{
    "title": "What is history? - Quora",
    "tags": [
        "What Is Meant By X",
        "Word Definitions, Terminology, and Jargon",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Stoertz",
                "href": "/profile/William-Stoertz"
            },
            "answer_text": "Very important question! Rather than refer you to stuffy official sources, I’ll entertain to offer my personal view of history. “History” as refers to the past (and to some extent also to the future) is not something “real” but rather something mental, a concept or model we have constructed based on information we have gleaned. Thus “history” does not exist in some physical space in time other than our own. History, therefore, is actually a metaphysical structure, which we have created. History is, you may say, only a theory or a conceptual construct. What we do have (which we often mistake for “history”) is only physical artifacts: Textbooks, encyclopedias, diaries, videos, novels, word-of-mouth reports, legends, Scripture… — these are the compendium of the external manifestos of what we call “history.” The true internal “history” is not those written records but the mental construct in the metaphysical realm. The external documents are indeed records, yet these are also subject to opinion, cultural or socioeconomic bias, viewpoint, and even fading and degradation through time. Is a video of an event “history”? No. It is a historical record, yet not the true history. Take JFK’s assassination: What is the “true history”? That would be what actually happened. Yet where is that? When those who are or were in the know all die, what will remain? Their memories will be transferred to the eternal metaphysical realm. Who can then prove what actually happened? Let us suppose there are angels who record everything. These metaphysical entities would know the true history. Yet, who can interview an angel or God and get the true account? No; this would also be a “record” or a “testimony” — again subject to truth or falsehood, personal bias, and other inaccuracies. I remember JFK’s assassination like a flashcube went off in history. I was at Edward’s AFB as a 9-year-old kid. Did it happen? Of course we all know that. But how did it happen? No one can tell for sure….. Did we land on the Moon? I was there! I watched it on TV as a Boy Scout at Camp Goshen. Will I lie? Yet who can really prove that someone didn’t fabricate that, too? At best we have theories: the best possible ones will win out in the social and psychological realms, and make it to the history books. Yet those history books will never be a conclusive final Proof. History, ultimately, abides in the metaphysical realm: Only God truly knows. ",
            "date": "Answered August 25, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Micha Hernandez",
                    "user_href": "/profile/Micha-Hernandez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maria Anderson",
                "href": "/profile/Maria-Anderson-124"
            },
            "answer_text": "History is the study of the past, particularly people and events of the past. History is a pursuit common to all human societies. Human beings have always been interested in the past, for many reasons. History can be a tremendous story, a rolling narrative filled with great personalities and tales of turmoil and triumph. Each passing generation adds its own chapter to history, while reinterpreting and finding new things in those chapters already written. History also gives us a sense of identity; by understanding where we have come from, we can better understand who we are. History provides a sense of context for our lives and our existence, helping us to understand the way things are and how we might approach the future. History teaches us what it means to be human, highlighting the great achievements and disastrous errors of the human race. History also offers hints about how we can organise and manage our societies, for the betterment of all those who live in them.  Those starting out in history often consider history and the past to be the same thing. This is not the case. The past refers to an earlier time, the people and societies who inhabited it and the events that took place there. History describes our attempts to investigate, study and explain the past. It is a subtle difference but an important one. What happened in the past is fixed in time and cannot be changed. History, however, changes regularly. The word “history” and the English word “story” both originate from the Latin historia, meaning a narrative or account of past events. History is itself a collection of thousands of stories about the past, told by many different people. Because there are so many stories, they are often variable, contradictory and conflicting. And like all stories, history is subject to revision and reinterpretation. Each generation looks at the past through its own eyes. It applies different standards, priorities and values and reaches different conclusions about the past. The study of how history differs and has changed over time is called historiography. Like historical narratives themselves, our understanding of what history is and the shape it should take is flexible and open to debate. For as long as people have studied history, historians have presented different ideas about how the past should be studied, constructed, written and interpreted. As a consequence, historians may approach history in different ways, using different ideas and methods and focusing on or prioritising different aspects. The following paragraphs discuss several popular theories of history: “History is the study of great individuals”  Plutarch According to the ancient Greek writer Plutarch, true history is the study of great leaders and innovators. Prominent individuals shape the course of history through their personality, strength of character, ambition, abilities, leadership or creativity. Plutarch’s histories were written almost as biographies or ‘life and times’ stories of these great individuals. They explained how the actions of these great figures shaped the course of their nations or societies. Plutarch’s approach served as a model for many later historians. It is sometimes referred to as ‘top-down’ history because of its focus on rulers or leaders. One advantage of this approach is its accessibility and relative easiness. It is often much easier to research and write about individuals than more complex factors, such as social movements or long-term changes. The Plutarchian focus on individuals can also be more interesting and accessible to readers. The main problem with this approach is that it can sidestep, simplify or overlook historical factors and conditions that do not emanate from important individuals, such as popular unrest or economic changes. “History is the study of the ‘winds of change'”  The Berlin Wall falls in 1989, a ‘winds of change’ moment Other historians have focused less on individuals and taken a more thematic approach, looking at factors and forces that produce significant historical change. Some focus on what might broadly be described as the ‘winds of change’: powerful ideas, forces and movements that shape or affect how people live, work and think. These great ideas and movements are often initiated or driven by influential people – but they become much larger forces for change. As the ‘winds of change’ grow, they shape or influence political, economic and social events and conditions. An example of a notable ‘wind of change’ was Christianity, which shaped government, society and social customs in medieval Europe. Another was the European Enlightenment, which undermined old ideas about politics, religion and the natural world; this triggered a long period of curiosity, education and innovation. Marxism emerged in the late 19th century and grew to challenge the old order in Russia, China and elsewhere, shaping government and society in those nations. The Age of Exploration, the Industrial Revolution, decolonisation in the mid-1900s and the winding back of eastern European communism in the late-1900s are all tangible examples of the ‘winds of change’. “History is the study of challenge and response” Some historians, such as the British writer Arnold Toynbee (1889-1975), believed historical change is driven by challenges and responses. All civilisations are defined not just by their leadership or conditions but by how they respond to difficult problems or crises. These challenges take many forms. They can be physical, environmental, economic or ideological; they can derive from internal pressures or external factors; they can come from their own people or from outsiders. The survival and success of a civilisation are determined by how it responds to these challenges. This itself often depends on its people and how creative, resourceful, adaptable and flexible they are. Human history is filled with many tangible examples of challenge and response. Many nations have been confronted with powerful rivals, wars, natural disasters, economic slumps, new ideas, emerging political movements and internal dissent. The process of colonisation, for example, involved major challenges, both for colonising settlers and native inhabitants. Economic changes, such as new technologies and increases or decreases in trade, have created challenges in the form of social changes or class tensions. “History is the study of dialectics”  Karl Marx, creator of the ‘material dialectic’ In philosophy, dialectics is a process where two or more parties with vastly different viewpoints reach a compromise and mutual agreement. The theory of dialectics was applied to history by German philosopher Georg Hegel (1770-1831). Hegel suggested that most historical changes and outcomes were driven by dialectic interaction. According to Hegel, for every thesis (a proposition or ‘idea’) there exists an antithesis (a reaction or ‘opposite idea’). The thesis and antithesis encounter or struggle, from which emerges a synthesis (a ‘new idea’). This ongoing process of struggle and development reveals new ideas and new truths to humanity. The German philosopher Karl Marx (1818-1883) was a student of Hegel and incorporated the Hegelian dialectic into his own theory of history – with one important distinction. According to Marx, history was shaped by the ‘material dialectic’: the struggle between economic classes. Marx believed the ownership of capital and wealth underpinned most social structures and interactions. All classes struggle and push to improve their economic conditions, Marx wrote, usually at the expense of other classes. Marx’s material dialectic was reflected in his stinging criticisms of capitalism, a political and economic system where the capital-owning classes control production and exploit the worker, in order to maximise their profits. “History is the story of the unexpected”  Franz Ferdinand’s murder in 1914, an unexpected but pivotal moment in history Some historians believe history is shaped by the accidental, the surprising and the unexpected. While history and historical change certainly follow patterns, they can also be unpredictable and chaotic. Despite our fascination with timelines and linear progression, history does not always follow a clear and expected path. The past is filled with unexpected incidents, surprises and accidental discoveries. Some of these have unleashed historical forces and changes that could not be predicted, controlled or stopped. A few have come at pivotal times and served as the ignition or ‘flashpoint’ for changes of great significance. The discovery of gold has triggered gold rushes that shaped the future of entire nations. In June 1914 Archduke Franz Ferdinand’s car took a different route through Sarajevo and passed an aimless Gavrilo Princip, a confluence of events that led to World War I. American historian Daniel Boorstin (1914-2004), an exponent of this fascination with historical accidents, claimed that if Cleopatra’s nose had been shorter, thus diminishing her beauty, then the history of the world might have been radically differen ",
            "date": "Answered July 2, 2018",
            "views": "322",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lafyroth Reyes",
                    "user_href": "/profile/Lafyroth-Reyes"
                },
                {
                    "user_id": "Janine Salvosa",
                    "user_href": "/profile/Janine-Salvosa-1"
                },
                {
                    "user_id": "Ritz Ardgie",
                    "user_href": "/profile/Ritz-Ardgie"
                },
                {
                    "user_id": "Kaifee Chowdhury",
                    "user_href": "/profile/Kaifee-Chowdhury"
                },
                {
                    "user_id": "Rowelyn Magpale",
                    "user_href": "/profile/Rowelyn-Magpale"
                },
                {
                    "user_id": "Kylie Banawa",
                    "user_href": "/profile/Kylie-Banawa"
                },
                {
                    "user_id": "Gbb Fvb",
                    "user_href": "/profile/Gbb-Fvb"
                },
                {
                    "user_id": "Jhulia Mae R. Hifarva",
                    "user_href": "/profile/Jhulia-Mae-R-Hifarva"
                },
                {
                    "user_id": "Marie Suelto",
                    "user_href": "/profile/Marie-Suelto"
                },
                {
                    "user_id": "Jonabel Ariola",
                    "user_href": "/profile/Jonabel-Ariola"
                },
                {
                    "user_id": "Sharvari Sawant",
                    "user_href": "/profile/Sharvari-Sawant-10"
                },
                {
                    "user_id": "Shafaque Bazmi",
                    "user_href": "/profile/Shafaque-Bazmi"
                },
                {
                    "user_id": "Nikhil Kohli",
                    "user_href": "/profile/Nikhil-Kohli-59"
                },
                {
                    "user_id": "Ruby Tsao",
                    "user_href": "/profile/Ruby-Tsao"
                },
                {
                    "user_id": "Bright Chimezie",
                    "user_href": "/profile/Bright-Chimezie-7"
                },
                {
                    "user_id": "Prof Saroj Kumar Tripathi",
                    "user_href": "/profile/Prof-Saroj-Kumar-Tripathi"
                },
                {
                    "user_id": "Cabdiraxmaan Jeego",
                    "user_href": "/profile/Cabdiraxmaan-Jeego"
                },
                {
                    "user_id": "Shahid Mir",
                    "user_href": "/profile/Shahid-Mir-34"
                },
                {
                    "user_id": "Sanchit Raj",
                    "user_href": "/profile/Sanchit-Raj-4"
                },
                {
                    "user_id": "Samuel Olowosile",
                    "user_href": "/profile/Samuel-Olowosile"
                },
                {
                    "user_id": "Conner McKNIGHT",
                    "user_href": "/profile/Conner-McKNIGHT-2"
                },
                {
                    "user_id": "Seavling Sok",
                    "user_href": "/profile/Seavling-Sok"
                },
                {
                    "user_id": "Birju Hansda",
                    "user_href": "/profile/Birju-Hansda"
                },
                {
                    "user_id": "Biswapratap Nanda",
                    "user_href": "/profile/Biswapratap-Nanda-2"
                },
                {
                    "user_id": "Gyau Adu",
                    "user_href": "/profile/Gyau-Adu"
                },
                {
                    "user_id": "UTTAM ROUT",
                    "user_href": "/profile/UTTAM-ROUT-4"
                },
                {
                    "user_id": "Emma Sun",
                    "user_href": "/profile/Emma-Sun-50"
                },
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                },
                {
                    "user_id": "Waqar Ahmad",
                    "user_href": "/profile/Waqar-Ahmad-441"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Tew",
                "href": "/profile/Clarence-Tew-1"
            },
            "answer_text": "History is a narration of the events which have happened among mankind, including an account of the rise and fall of nations, as well as of other great changes which have affected the political and social condition of the human race.—John J. Anderson. 1876. A Manual of General History. History is the study of the human past as it is described in the written documents left by human beings. The past, with all its decisions completed, its participants dead and its history told, is what the general public perceives as the immutable bedrock on which we historians and archaeologists stand. But as purveyors of the past, we recognize that the bedrock is really quicksand, that bits of the story are yet untold, and that what has been told comes tainted by the conditions of what we are today. If a science of history were achieved, it would, like the science of celestial mechanics, make possible the calculable prediction of the future in history. It would bring the totality of historical occurrences within a single field and reveal the unfolding future to its last end, including all the apparent choices made and to be made. It would be omniscience. The creator of it would possess the attributes ascribed by the theologians to God. The future once revealed, humanity would have nothing to do except to await its doom. ",
            "date": "Answered July 11, 2017",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ma.Alondra Alba",
                    "user_href": "/profile/Ma-Alondra-Alba"
                }
            ]
        },
        {
            "author_info": {
                "name": "John McKay",
                "href": "/profile/John-McKay-17"
            },
            "answer_text": "History is a useful narrative constructed from what we know about the past. Let me unpack that bit by bit. \"History is a ... narrative...\" History is not an accurate reproduction of the past and it is not all of the facts. History is a story (as the word indicates). We know the names and home towns all of the soldiers involved in D-Day. We know what many of them ate that day. We know the technical specs of their weapons, who designed, and who manufactured them. We know the logistics of getting them to the beach, the support efforts, and the casualties. To write a history of that day, the historian has to pick and choose through all of the raw data--the facts--to decide what is necessary to tell the story they want to tell. \"History is ... useful...\" No historian is completely random in picking their narrative. Again, look at military history. A narrative based on the same data/facts might describe a glorious victory, a unredeemed tragedy, or illustrate some aspect of the human condition. Facts and interpretation are two different things. This is why conservatives get so upset about how history is taught in the schools. Each new generation of historians reinterprets the same facts in the light of their experiences. Conservatives want history to be carved in stone. Facts are facts. History isn't facts; history is interpretation of facts. \"History is ... constructed from what we know...\" We can't know everything. This is obvious in the far past where we take every tiny data point and try to squeeze as much information as we can from it. Every decade or so we have an earthshaking discovery in ancient history. Here is a city that dominated this trade route for three centuries and this changes everything we thought we knew about the cities on either end of that trade route. Even in something as information rich as the D-Day example, there is an enormous amount we don't know. What were the conversations that led to important decisions? Who knew what and when did they now it? It's an historian's cliche to refer to history as a jigsaw puzzle with missing pieces, and no box to show us what the picture should look like, and no edge pieces, and a few handfuls of pieces from other puzzles added, and a hyperactive cat in the house, and half the pieces are wet... and that's why we love it. ",
            "date": "Updated April 10, 2019",
            "views": "68",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cabdiraxmaan Jeego",
                    "user_href": "/profile/Cabdiraxmaan-Jeego"
                },
                {
                    "user_id": "Somanath Behera",
                    "user_href": "/profile/Somanath-Behera-47"
                },
                {
                    "user_id": "MonkeyRuffi D. Jireh",
                    "user_href": "/profile/MonkeyRuffi-D-Jireh"
                },
                {
                    "user_id": "Mahadev Kumawat",
                    "user_href": "/profile/Mahadev-Kumawat-1"
                },
                {
                    "user_id": "James Galloway",
                    "user_href": "/profile/James-Galloway-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Owen",
                "href": "/profile/Norman-Owen"
            },
            "answer_text": "Following on from some of the earlier comments, there are three major ways in which the term “history” is used. First, as anything and everything that has happened in the past. There is a history of everything: of Easter Island, of the Vietnam War, of marbles, of fondue, of the American musical, of baseball in Asia . . . Whatever happened. It can include material normally studied under the heading of anthropology, sociology, literature, music, art, science, whatever; if it happened in the past, it has a history. It’s all of life - at least all of life up until the last few years/months/days. Second, as the _study_ of what happened in the past, not so much “what happened?” as “how do we [or how do others] understand what happened?” Sometimes this is distinguished from history by capitalization [A History of the United States]; some of it is subsumed under “historiography,” which is the history of historical writing. In this sense, we are often looking closely at evidence, at the sources that supply us with our understanding of the past. If the sources are lacking, our History may be rather thin. So we might say that the History of the Philippines before the 16th century is rather sketchy, in that we don’t know a lot about it, but that doesn’t mean the history of the Philippines [lower case] wasn’t as real and full of incident and culture as the history of other places. It just means that we don’t know a lot about it! Third, as the formal study of “History” in our society, particularly in schools and universities, but also in books and TV programs and the like. This tends to be restricted to certain aspects of the past, such as politics (lists of kings and presidents, wars and treaties, etc.), macro-economics (The Great Depression), etc. It will also normally have some chronological limits, e.g., American History from the Revolution to the Civil War. (There was once a convention in some universities that “History” only came up to some date in the not-all-that-recent past: before any of us were alive, or the date at which the diplomatic archives were opened. After that, it was implied, there were only Current Events.) In that sense, if someone claims to know “History” (or asks if you know it), the subject is likely to be not “everything that ever happened,” but “some of the political events and people in the past that we in our society acknowledge to be important,” e.g., Kings, Presidents, Battles, Inventions, etc. Such restriction is arbitrary, but since it is impossible to know everything about everything, there is a necessity to limit and focus our vision and try to understand _something_, which we hope and trust will be something of importance. I couldn’t offer a course on “History” without a narrower subject matter, unless I was trying to teach what is sometimes called “historical methods,” e.g., how we select and analyze evidence. So what you will find in a “history textbook” is a selection of the facts and themes - among literally millions of others - that the author thought were worth studying; no matter how well selected these are, and how long the textbook is, you should always remember that FAR more was left out than included. And that is how it has to be. FWIW, Ken Burns is the great presenter of TV “History” in our time, and while his series on the Civil War is justly acclaimed, and right in the mainstream of “American History,” his features on Baseball and National Parks - which are usually omitted from “American History” - are just as good. Enjoy! ",
            "date": "Answered November 23, 2016",
            "views": "121",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sean McHugh",
                    "user_href": "/profile/Sean-McHugh-9"
                },
                {
                    "user_id": "Mario Moncada Velasquez",
                    "user_href": "/profile/Mario-Moncada-Velasquez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jelmer Heeren",
                "href": "/profile/Jelmer-Heeren"
            },
            "answer_text": "The word “history” has two basic meanings. But there are three terms that need to be discussed. The example of a game of football can help us understand it all.  The two basic meanings of the word “history”: History can refer to those things, events and so forth that actually happened in the past (Latin: res gestae, meaning “things done” ). Let’s call this history(1).History can also refer to the analysis/investigation of past things, events and so forth (Latin: historia rerum gestarum, meaning “history of things done”). We are talking here about the professional writings and productions of historians. Let’s call this history(2).History(2) is also called historiography.But: the term historiography can also refer to the meta-discipline that is the theory/philosophy of history, meaning the reflection and contemplation on the nature and quality of history(2). Consider a game of football: you are lingering in the stadium after witnessing a great game, possibly the best you have ever seen. You and your buddies are passionately discussing every single detail, each of you offering a variety of rich descriptions all the while relating them to the game in its entirety. You even ponder the game’s significance in relationship to the whole season, perhaps even the past decade of football. During the discussion you come to realize that there are several seemingly mutually exclusive interpretations at play, or at least each one of you is drawing out different meanings by means of highlighting different aspects of the game, of the teams and of the past decade. You think to yourself: “Why don’t we agree with each other? Louis is making sense, displaying a controlled but tangible passion. Rinus, being the oldest, is definitely dropping a few wisdom bombs. I don’t understand a word Johan is saying, but I feel like he’s probably right. Besides, he used to be pretty decent himself at the whole football thing.” You realize that analyzing a football game is not that straightforward: you, Louis, Rinus and Johan have a different approach to the same particular game. However, this realization does not trump your more important realization that the game is worth discussing anyway. Besides, there are quite some things you do agree on. So when history is likened to a game of football, we get this: History(1) is the actual game.History(2) is the post-game analysis/documentation/reporting by you and your buddies, news outlets, sports magazines, websites and so forth.(the meta-discipline) Historiography reflects on the post-game analyses produced by the different authors/sources, considering their presuppositions, structuring and legitimacy.In conclusion: history(2) is a portrayal of history(1) in a book, article, encyclopedia, documentary and so forth. Historiography (in the meta-discipline sense) reflects on the way history(2) is being done. ",
            "date": "Updated May 16, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pascal Claivaz",
                "href": "/profile/Pascal-Claivaz-1"
            },
            "answer_text": "Historians and archaeologists are like the investigators of detective stories. They establish facts and dates. Fortunately we have them and I hope that we will continue to have them for a long time. Without them, you would never know for sure what happened.I remember the emotion on an archeology site (Antiquity) when the archaeologist took out for the first time from the ground a simple spool to spin wool. A very common object on an archaeological site. But it made a funny feeling to me, when he got her out of the ground. A \"first time\" excitement.Then we move on to interpretation. And there, we quickly arrive at the ideology. Historians try to let themselves be taken as little as possible by the ideology of the time they live in. Their ideal would be an interpretation completely rid of all ideology.But each era has reinterpreted the past at its convenience, starting with Roman history, for that matter. Think of the French Revolution and the Roman Republic. Think of Napoleon and the Roman Empire. Let us think, for Washington capital of the USA, with the Capitol, the obelisk, even the monument of Jefferson (it makes me think of the Mausoleum of the emperor Augustus).Besides, architecture says a lot. Let us think of the neoclassism of the nineteenth century, the negothism of that same century. There are even skyscrapers in neo-Gothic style in New York. Unbelievable!There is a common expression, currently: the American Empire. It is obviously a reference to the Roman Empire. Let us remember the trauma of the book by British historian Edward Gibbon: “Decline and Fall of the Roman Empire” (18th century).And we can continue: the second imperial Roman century to reinterpret the first century of mad emperors; the Merovingian era (roughly: 500-750 AD) religiously copied the works of the great Latin authors of the empire and the republic.All the Middle Ages spoke Latin, the other languages ​​of the countries being considered as vulgar patois, without literary interest. Dante (1300 AD) took Virgil as a guide to go and explore Hell, in the Divine Comedy.With the French poets of Pléiade Ronsard and Du Bellay (16th century), Dante (1300) contributed to make their vulgar languages (french and italian) ​​of literary languages. How did the French do it? By imitating the Latin and Greek models, but in French. The Grand Siècle, the 17th century of Louis XIV, was imbued with his Latin and Greek models. So, we are in 2020 and we are still looking to Antiquity, the Middle Ages, the Renaissance, the American and French Revolutions to move forward. The least accountant in a Swiss municipality, establishing its budget for one year or over 4 years, forecasts growth in its tax revenue. Why? Because it’s always been like this. Since when? Follow my gaze. P.S.: I think I found something good here. I can make my business, my beefsteak with this. After all, everyone has something to sell. For me, I think it’s this analysis of history. I am retired and have the time to deal with fundamental issues. As Alain Aspect (french Physician, Albert Einstein Prize 2012) explain about Bell’s inequalities, a young researcher in quantum physics long said to himself: “OK, this is an epistemological problem dating from 1926 between Max Born and Albert Einstein. But other than that, quantum physics is giving amazing results and so I’ll be concerned about that when I retire”. Well, since 1926 the question of locality or non-locality, namely the immediacy of reactions in space (which implies speeds greater than those of light) has been resolved by laboratory experiments from Alain Aspect. In particular, it has an impact on technology of quantum encryption keys. It’s not nothing. I do the same with the history. To have an idea of the future of my damn pension funds, I had to trace the analysis back to the time of the Romans. It was informative and exciting… And we’ll never be able to stop the bastringue.. It’s my turn, as Diana Ross sang in 1980. And until death ensues.God will decide when. ",
            "date": "Updated October 31, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "When I first started studying history in college, my favorite professor said this: “There's no truth in history, only perspective\" While history is about what happened in the past, it's not like geology or paleontology. History is not a subject of science. It is a subject of humanities. And because history is written by men, the study of history comes in two folds: first the study of what happened in the past, second the study of how such events were recorded. And when we read historical records, we always need to be mindful about who wrote it, when this record was written, under what circumstances, what resources the historian had and what point the historian intended to make. Yes, all historians inevitably make points in their book, consciously or unconsciously. There's no objective history. I was very lucky to meet a professor who not only understood this, but made sure her class reflected this concept. She never really followed the book. She expected you to read everything in the textbook and her lectures always gave students different perspectives to think about. Take Giorgio Vasari for example, Vasari is widely regarded as the first art historian because of his influential book Lives of the Most Excellent Painters, Sculptors, and Architects (or in short: The Lives). Every student of Renaissance history reads this book (or at least reads part of it). But Vasari was also notoriously biased in favor of the Florentine school of art, and the guy had the worst habit of recording rumors and gossips as “real\", and sometimes he made up stuff. This is even worse if one were to study Chinese history. Yes, we have the longest continuous written history in the world; yes we are the only civilization that specifically set up a government position to record history; yes our culture emphasizes the recording of history so even more than the central government, many provinces, counties, villages and large families maintain local history. But, they're all biased and should be read as such. It's nice to give historians government positions, but that means that what the historian ended up recording was scrutinized by the government. While there was integrity and honor among the literati—who were obligated by their personal principles to write truthfully—in practice, the embarrassing actions of emperors might have been omitted, and false information might have been made up to justify a poor decision. If a new dynasty replaced the old one, the historians from the new dynasty would often engage in smear campaigns to legitimize the new dynasty. To study history we must take information from different sources and try to piece together a more 3 dimensional view of history. I often see historical studies like detective work or jigsaw puzzles. You can't trust your witnesses, you need to find missing pieces. But in the end, there's no truth in history. We don't know what happened. Even people who experience the historical event don't know what happened. All we can say is “we think this is most likely scenario because of this and this and that record, but we're not 100% sure.” We'll never be 100% sure. And I think that's the charm of history, that there's always some mystery waiting for you to discover. ",
            "date": "Updated February 24, 2017",
            "views": "115",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joeylyn Miranda",
                    "user_href": "/profile/Joeylyn-Miranda"
                },
                {
                    "user_id": "Leila Gwen Aspiras",
                    "user_href": "/profile/Leila-Gwen-Aspiras"
                },
                {
                    "user_id": "LEAH ARTAJO ENTICA",
                    "user_href": "/profile/LEAH-ARTAJO-ENTICA"
                },
                {
                    "user_id": "Cabdiraxmaan Jeego",
                    "user_href": "/profile/Cabdiraxmaan-Jeego"
                },
                {
                    "user_id": "Junecar Vallespin",
                    "user_href": "/profile/Junecar-Vallespin"
                },
                {
                    "user_id": "Nishant das Gupta Extra Knowledge in All",
                    "user_href": "/profile/Nishant-das-Gupta-Extra-Knowledge-in-All"
                },
                {
                    "user_id": "Andrew Maicke",
                    "user_href": "/profile/Andrew-Maicke"
                },
                {
                    "user_id": "Vasil Kolchev",
                    "user_href": "/profile/Vasil-Kolchev-1"
                },
                {
                    "user_id": "Saurdeep Jena",
                    "user_href": "/profile/Saurdeep-Jena"
                },
                {
                    "user_id": "Diana Nava",
                    "user_href": "/profile/Diana-Nava-3"
                },
                {
                    "user_id": "Axel Evans",
                    "user_href": "/profile/Axel-Evans-1"
                },
                {
                    "user_id": "Valeria Lucchinelli",
                    "user_href": "/profile/Valeria-Lucchinelli"
                },
                {
                    "user_id": "Ross Beuermann",
                    "user_href": "/profile/Ross-Beuermann"
                },
                {
                    "user_id": "Jennifer Hu",
                    "user_href": "/profile/Jennifer-Hu-1"
                },
                {
                    "user_id": "Aaron Cai",
                    "user_href": "/profile/Aaron-Cai-10"
                },
                {
                    "user_id": "Tim Chan",
                    "user_href": "/profile/Tim-Chan-51"
                },
                {
                    "user_id": "Rinita Raju",
                    "user_href": "/profile/Rinita-Raju"
                },
                {
                    "user_id": "Molshree Malik",
                    "user_href": "/profile/Molshree-Malik-1"
                },
                {
                    "user_id": "Johnny Bai",
                    "user_href": "/profile/Johnny-Bai-3"
                },
                {
                    "user_id": "Sharranya Vallipuram",
                    "user_href": "/profile/Sharranya-Vallipuram"
                },
                {
                    "user_id": "Ray Huang",
                    "user_href": "/profile/Ray-Huang-49"
                },
                {
                    "user_id": "Nguyen Phi Yen",
                    "user_href": "/profile/Nguyen-Phi-Yen"
                },
                {
                    "user_id": "Alvaro Salgado",
                    "user_href": "/profile/Alvaro-Salgado"
                },
                {
                    "user_id": "Jinilia Irene",
                    "user_href": "/profile/Jinilia-Irene"
                },
                {
                    "user_id": "Matthew Bennett",
                    "user_href": "/profile/Matthew-Bennett-16"
                },
                {
                    "user_id": "Ardita Septiani",
                    "user_href": "/profile/Ardita-Septiani"
                },
                {
                    "user_id": "Megan Helseth",
                    "user_href": "/profile/Megan-Helseth"
                },
                {
                    "user_id": "Alex Ghitu",
                    "user_href": "/profile/Alex-Ghitu"
                },
                {
                    "user_id": "Yan Huan",
                    "user_href": "/profile/Yan-Huan-30"
                },
                {
                    "user_id": "Kathryn Elle",
                    "user_href": "/profile/Kathryn-Elle"
                },
                {
                    "user_id": "Karthikeyan Arivalagan",
                    "user_href": "/profile/Karthikeyan-Arivalagan"
                },
                {
                    "user_id": "Kyle D'souza",
                    "user_href": "/profile/Kyle-Dsouza-5"
                },
                {
                    "user_id": "Vecho Bryant",
                    "user_href": "/profile/Vecho-Bryant"
                },
                {
                    "user_id": "Yolanda. Zhu",
                    "user_href": "/profile/Yolanda-Zhu-11"
                },
                {
                    "user_id": "Ishita Roy",
                    "user_href": "/profile/Ishita-Roy-9"
                },
                {
                    "user_id": "Gokul Beeshman",
                    "user_href": "/profile/Gokul-Beeshman"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "Ng Soon Sing",
                    "user_href": "/profile/Ng-Soon-Sing"
                },
                {
                    "user_id": "Kushagra Jalal",
                    "user_href": "/profile/Kushagra-Jalal"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Qiang Yang",
                    "user_href": "/profile/Qiang-Yang-1"
                },
                {
                    "user_id": "Sam Siu",
                    "user_href": "/profile/Sam-Siu"
                },
                {
                    "user_id": "Kate McAleer",
                    "user_href": "/profile/Kate-McAleer"
                },
                {
                    "user_id": "Alice Cook",
                    "user_href": "/profile/Alice-Cook-20"
                },
                {
                    "user_id": "Prakhar Gupta",
                    "user_href": "/profile/Prakhar-Gupta-1"
                },
                {
                    "user_id": "Olivia Miljeteig",
                    "user_href": "/profile/Olivia-Miljeteig"
                },
                {
                    "user_id": "Kasper Browne",
                    "user_href": "/profile/Kasper-Browne"
                },
                {
                    "user_id": "Nikola Janković",
                    "user_href": "/profile/Nikola-Janković-13"
                },
                {
                    "user_id": "Daryl Lee",
                    "user_href": "/profile/Daryl-Lee-25"
                },
                {
                    "user_id": "Shomeli Dey",
                    "user_href": "/profile/Shomeli-Dey"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Meny",
                "href": "/profile/John-Meny"
            },
            "answer_text": "History is the stories we tell ourselves in order to make sense of the current shape of society and to explain why things came about the way they did. History is set of culturally-bound narratological rules and tropes that we trot out when we need to make sense of the world (in general or in specific). History gives us the illusion that our lives play out in some grand drama of good against evil (or to reference the excellent Mr. Trejo below) freedom against non-freedom. It’s to make us feel better, I think. I believe that the dismal truth is that there is no overarching pattern to the progression of history — too often it consists of people acting thoughtlessly or randomly to give it any real pattern. History then is the pattern we make. It’s the story of freedom vs non-freedom, bourgeois vs proletariat, christian vs heathen that we tell ourselves to make a coherent and usually happy story out of what is often violent, random chaos (often with us as the suffering hero). I think this explains the popularity of questions about warfare on Quora. Warfare is inconceivably horrible, but as a species we keep doing it. Discussion of strategies or tactics or great leaders use historical narrative to hide the nastiness of the business. The historical discussion focuses our attention away from the blood and suffering and towards abstractions that might as well be annotations of a chess game or a play-by-play. It also may desensitize us to the horrible fact that we still war…. ",
            "date": "Answered February 2, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gat Sinclair",
                    "user_href": "/profile/Gat-Sinclair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Joshua",
                "href": "/profile/Mark-Joshua-45"
            },
            "answer_text": "My boy Webster defines history as the study of events especially human affairs. History has many sup categories, I consider myself knowledgeable on the World Wars, Greek and Roman history these are much more studied times in human history that I enjoy learning about. History can be divided into several era’s the important ones are. -People exist -Hunter gatherers -People start to farm -Farmers get together and make a place where they live in proximity -Very basic social ladder established -Metal > Rock -Sumeria is first big civilization  -Food and people who like the food show up -Houses -SOCITEY -Horse is used in domestic purposes in central Asia -Egypt  -Wheels on horses -Xia dynasty -Indus river valley -Middle east has it’s 1st problem and Indo-Europeans (Wheel horse people) take over modern day Turkey -Greece part 1  -Bronze age collapse and the People spread out. -Greece and Phonecians make bronze and make carthage -Persian empire -Alexander is great -Confucius and his morals that are good -Time skip and the first war happens. -Rome part 1 (Monarchy) -Greece part 2 -Rome part 2 (Republic) -Rome part 3 (Empire) -Asian kingdoms -200 year intermission -Norse prank people with Greenland and Iceland -Holy ramen empire and Charlemagne -William conquerors England -China invents boom-boom -Mongols make a empire almost as big as me -Black death -Renaissance -Britain is bipolar and does some stuff with their monarch -Colonies -The dutch do much -Prussia -’Murica part 1 The Washington the revolution and the tea party -’Murica part 2, 1812 and Civil war -Hawaii and Cuba are annexed -The Maine is blamed on Spain -7 years war -WW1 -Great depression -Hitler part 1 -Hitler part 2 leads to WW2 -WW2 -Cold war part 1 -Korea Cold war gets colder -’Nam -Cold war is coldest -Desert storm -Rwandan genocide -9/11 -Iraq war -Ebola in liberia -ISIS part 1 -Trump elected -ISIS is gone -?????? Wow I left out so much well this is history simplified to a stupid level. ",
            "date": "Answered May 9, 2018",
            "views": "35",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kris Li",
                    "user_href": "/profile/Kris-Li-33"
                },
                {
                    "user_id": "Jonas Vansulli",
                    "user_href": "/profile/Jonas-Vansulli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Satyam Saxena (सत्यम सक्सेना)",
                "href": "/profile/Satyam-Saxena-सत्यम-सक्सेना"
            },
            "answer_text": "History is the multidimensional study of various sources of the past to understand What might have happened,When it may have happenedWhere it may have happenedHow it may have happenedAnd using the above answers, why it may have happened and what were the repercussions of the event.Practically history is not a subject rather a system of tools to study the past, thus giving it quite a broad domain. Technically, history began with creation of universe. The pre human era is under geological history where more focus is on geographical and astronomical aspects. In human history, the scholars have divided it into pre-history, proto-history and recorded history depending upon the types of sources available for the period. And in recorded history the basic division is Ancient, Medieval and Modern. The periods associated with these divisions are highly subjective and are often changed by various historiographers as required in their study. ",
            "date": "Answered March 5, 2020",
            "views": "722",
            "upvotes": " Answer requested by Monika Yadav",
            "upvoters": [
                {
                    "user_id": "Robert Desilets",
                    "user_href": "/profile/Robert-Desilets-1"
                },
                {
                    "user_id": "Kim Minseo",
                    "user_href": "/profile/Kim-Minseo-13"
                },
                {
                    "user_id": "Rajkumar Barik",
                    "user_href": "/profile/Rajkumar-Barik-1"
                },
                {
                    "user_id": "Ajay Narayanan",
                    "user_href": "/profile/Ajay-Narayanan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reshma Moosa",
                "href": "/profile/Reshma-Moosa"
            },
            "answer_text": "History (from Greek ἱστορία, historia, meaning \"inquiry, knowledge acquired by investigation\") is the study of the past, particularly how it relates to humans. It is anumbrella term that relates to past events as well as the memory, discovery, collection, organization, presentation, and interpretation of information about these events. Scholars who write about history are called historians. Events occurring prior to written record are considered prehistory. History can also refer to the academic discipline which uses a narrative to examine and analyse a sequence of past events, and objectively determine the patterns of cause and effect that determine them. Historians sometimes debate the nature of history and its usefulness by discussing the study of the discipline as an end in itself and as a way of providing \"perspective\" on the problems of the present. Stories common to a particular culture, but not supported by external sources (such as the tales surrounding King Arthur), are usually classified as cultural heritage or legends, because they do not show the \"disinterested investigation\" required of the discipline of history. Herodotus, a 5th-century BC Greek historian is considered within the Western tradition to be the \"father of history\", and, along with his contemporary Thucydides, helped form the foundations for the modern study of human history. Their works continue to be read today, and the gap between the culture-focused Herodotus and the military-focused Thucydides remains a point of contention or approach in modern historical writing. In Asia, a state chronicle, the Spring and Autumn Annals was known to be compiled from as early as 722 BC although only 2nd century BC texts survived. Ancient influences have helped spawn variant interpretations of the nature of history which have evolved over the centuries and continue to change today. The modern study of history is wide-ranging, and includes the study of specific regions and the study of certain topical or thematical elements of historical investigation. Often history is taught as part of primary and secondary education, and the academic study of history is a major discipline in university studies. ",
            "date": "Answered March 3, 2016",
            "views": "112",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Meet Dhokiya",
                    "user_href": "/profile/Meet-Dhokiya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Rogers",
                "href": "/profile/Pete-Rogers-1"
            },
            "answer_text": "History is what happened how it happened when it happened why it happened where it happened who made it happen and the honest consequences. We cannot be confident of historians because those who are willing to interpret events in a way that assists those of power is going to be the one we hear and the one who’s ideas are taught as in educational establishments as though truth. It is difficult to find a history that does not vindicate Monarchy here; for instance”: whereas America was violently against it until quite recently. These relativisms are a grave concern and suggest widespread propaganda one way or another. To give yourself an idea of what really good objective History can do to help us understand the past I recommend everyone to read The History of the Peloponnesian War by Thucydides written in 431 B.C. It is easier to understand and more full of integrity than anything you will find today. Next I recommend three books by the greatest ever Englishman - Tom Paine - they are “Common Sense”, “The Age of Reason” and “The Rights of Man” Man is mankind not gender selected. Always question what anyone tries to get you to accept and you will be ther friend of Manknind. I repeat a phrase from Tom Paine “These are the times that try men’s souls” ",
            "date": "Answered July 12, 2018",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Durcan",
                    "user_href": "/profile/Michael-Durcan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Lawson",
                "href": "/profile/Geoff-Lawson-4"
            },
            "answer_text": "What is history? The notion of an historical analysis of past events is the outcome of an ongoing evolving narrative over time. That is, as new facts come to light and bring new evaluations; information whereby intellectual, socially and individual changes arise and mitigate how the past is perceived and interpreted, means that novel intellectual approaches will emerge and or new facts will be uncovered, thus adding to the mix and modifying any analytical approach. History is merely the latest version, by one author, of what he or she avails themselves of of previous recorded material and or newly uncovered actual records or other relevant materials as they are unearthed and interpreted. Thus adding new information to the plot. Also, each historian interprets, that is draws conclusion from evidence based on assumptions; prejudice, political, theological or other biases that ‘colour’ as well as their interpretation of the previous historical records/literature, the resultant is their personal account (It is always a balance between subjectivity and the attempt to be ‘objective’). Also, being a narrative account, it has to be presented as a story with a rational and logically argued narrative and set out in such a manner as to have a beginning, a middle and an end, just as storybook(fairytale) has. Life is not a narrative, it is contiguous; we never know just how things will work out in the future. And it is the ‘future’ that whenever an historian ‘looks back’ and interprets and writes his/her account we are looking at in considering historical records. We, like the historian, are forever ‘looking back’ because we are never still but always moving forward, into an evolving, intangible unknown future. So ‘history’ is an account, in narrative form of one individual’s account on past events. Being a scholastic discipline it has a methodology and ‘rules’ as to what my be written; either left or right leaning political analysis may be acceptable. Any version that does not conform within the rules of historical analysis is anathema, and will be judged as beyond the redemption. That is how I perceive History. Despite its drawbacks, it is the only means we have of understanding and coming to a conclusion of how we interpret the past. Each of us in turn will add our biases and prejudices to the mix as we read and reflect on a particular historical account. Each reading of an historical text is an interpretation, influenced by our biases and prejudices in turn. So history is a form of fiction, a story argued in a manner that ‘makes sense’ to our learned ways of imbibing knowledge via information, data, facts, guesswork that are particular to each of our cultural and intellectual environments. “Our brain spend all its time seeking out correlations which can be tied to a narrative.” Scatterbrain. Henning Beck, 2019 “How the mind’s mistakes make humans creative, innovative and successful”. ",
            "date": "Answered August 4, 2020",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathryn Cotton-Betteridge",
                "href": "/profile/Kathryn-Cotton-Betteridge"
            },
            "answer_text": "Q: What is history? A question I have found myself asking many times. Particularly at about two in the morning when trying to chase down a reference that won’t cooperate. History has been described as the study of ‘past events’ or of ‘human affairs’, or as a ‘record of chronological changes and movements within human societies.’ Definitions agree that it is the study of the human past; academic history has traditionally used narrative to describe, examine, question, and analyze the human past. Some academics seek patterns and causal relationships and debate the significance of various periods, people, and events. My personal favorite definition comes from Y.N. Harari’s ‘Homo Sapiens: A brief history of humankind’. To quote Y.N. Harari; About 70,000 years ago, organisms belonging to the species Homo sapiens started to form even more elaborate structures called cultures. The subsequent development of these human cultures is called history. Three important revolutions shaped the course of history: the Cognitive Revolution kick-started history about 70,000 years ago. The Agricultural Revolution sped it up about 12,000 years ago. The Scientific Revolution, which got underway only 500 years ago, may well end history and start something completely different. ",
            "date": "Updated August 3, 2020",
            "views": "930",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joshelle Leovim G. Franconas",
                    "user_href": "/profile/Joshelle-Leovim-G-Franconas"
                },
                {
                    "user_id": "Damien Meillieux",
                    "user_href": "/profile/Damien-Meillieux"
                }
            ]
        },
        {
            "author_info": {
                "name": "Callum Hanton",
                "href": "/profile/Callum-Hanton"
            },
            "answer_text": "While I can give you some eymitoligcal breakdown of the word or a literal definition, I will instead endeavor to convey the greatest passion of my life in words. History to me is not reading stories, or breathing in the scent of old pages, containing events long ago committed to memory. Though that is a part of it. History is looking over Rome with Julius Caesar. watching Shakespeare in his globe theatre. History is feel the air rush over my face with Bleriot in his monoplane over the channel and attending queen Victoria’s coronation. Gasping at Hamilton’s Reynolds pamphlet. Cheering at Marie Antoinette’s guillotining with the crowds. History is laughing in vaudeville in 1920 and freezing in the trenches mere years before. It's watching Tesla wow the world With bolts like the myths of Zeus. its feeling the pages and having them take you back to the time of political Titans, men of myth like Churchill, Lincoln, and Napoleon. History is the greatest experience ever experienced for it is the experience of all of us. And dear god for all of its ups and downs, it's managed to be every genre and every niche and I've never been bored in my journey yet. Like Lewis and Clarke it takes me through time, and is the greatest love of my life. ",
            "date": "Answered January 8, 2017",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitendra Patel",
                "href": "/profile/Jitendra-Patel-308"
            },
            "answer_text": "History is a subject of Social science. Social science helps us understand the working of our social. It tells us about geography , the way the economy works,and the manner in which social and political life is organised. History will help you to understand that how this present evolved. It will tell you about the past of the present. History is journey across time and space. It transport us into another world, another age, in which people lived differently. History tells us their economy and society, their beliefs and faith, their arts and crafts. History can open doors into such worlds. But in reality history is not just about the past . It is about the present. The society we live in has been fashioned by those who came before us. The joys and sorrows of their daily lives, their discoveries and invention, slowly transformed human societies. These changes were often so gradual ,so seemingly small,that their impact was not noticed by people at that time. Only later ,when we return to the past,when we study history ,can we begin to see how these changes happened ,and we can observe their long term effect. By reading history we can understand how the modern world has emerged over long centuries of development.   Images source :Google ",
            "date": "Answered May 17, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean McHugh",
                "href": "/profile/Sean-McHugh-9"
            },
            "answer_text": "What is the definition of history? People study history and learn historical methods in order to refine their capability of forecasting the results of current events. Students of history are students of consequences. History is the record of the human experience of previous generations. Let me emphasise that history as an academic discipline is a study of the records. As others have noted here this just shifts the emphasis to what constitutes a record. Until recently, the records studied were government documents. This convention of a limit to the allowable objects of study has been blown apart by the widening of the area of interest to students, reaching the extent of including any human activity that left a trace. This can comprise everything from the tags left on the walls of palaeolithic caverns to the remnants of Victorian underwear. But I suggest that the human interest in history remains in comparing our own social lived experience to the social lived experience of previous generations. This can be useful when it comes to allowing students to realize how many aspects of the human world today are recent inventions. As you move back in time things like nation states fall away, the transport networks disappear, the amount of manufactured material objects dwindle. It is a novel experience in itself. ",
            "date": "Answered August 17, 2019",
            "views": "79",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                },
                {
                    "user_id": "Mahadev Kumawat",
                    "user_href": "/profile/Mahadev-Kumawat-1"
                },
                {
                    "user_id": "Aman Jaiswal",
                    "user_href": "/profile/Aman-Jaiswal-231"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uldis Sprogis",
                "href": "/profile/Uldis-Sprogis"
            },
            "answer_text": "History can be generally viewed as the progress of technological development in the world. Hunter gatherers used primitive tools and were totally dependent on nature for food. Agriculture was invented and humans began to grow their own food and most lived a farmer’s life with few living in towns or cities. The industrial revolution or technology was improved further and soon more could live in towns and cities and not be farmers. Technology means short duration efficiency and soon most in future generations will live leisurely lives dependent on technological machines to do most of the physical and even mental labor for them. Yes, history is also a record of wars between humans who used technology for better and better and more destructive military hardware which helped create temporary empires which rose and then collapsed. This controlled overpopulation to some extent along with terminal diseases. Humans have historically been ruled by language and religion with moral principles in their personal lives and relatively peaceful interaction among groups of humans was possible because of a shared moral code. Money is now the tool which is used to attempt to rule the world and a strong shared moral code to keep all the nations working together peacefully does not exist. Without a shared secular moral code it will lead to the inevitable collapse of a world order based on money without moral principles as a necessary foundation. To truly unify the world peacefully there must be one language and one secular moral code which not only humans practice in their daily lives in interactions with each other but the same secular moral code should be used to maintain trust between the humans and their leaders so that rule must not be through the threat of force or the use of force to keep society from disintegrating into chaos and disorder. Will the world adopt a unifying secular moral code and promote one major language? If we use history as a predictor then the resounding answer is probably not but I am still optimistically hoping that the answer will be a resounding yes and that future humanity will live in peace and cooperation protecting wilderness plants and animals and interacting peacefully among themselves on into the foreseeable future. My hope is that overpopulation will be solved peacefully through birth control techniques or laws which limit the reproduction of poor humans on welfare to one or two per family. Topsoil erosion and pollution may create polluted land no longer useful for healthy agriculture so a switch to organic farming techniques is the smart thing to do for sustainable farming land on into the foreseeable future. ",
            "date": "Answered March 25, 2017",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aman Jaiswal",
                    "user_href": "/profile/Aman-Jaiswal-231"
                },
                {
                    "user_id": "James Galloway",
                    "user_href": "/profile/James-Galloway-23"
                },
                {
                    "user_id": "Harshita Ahuja",
                    "user_href": "/profile/Harshita-Ahuja-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laksh Banthia",
                "href": "/profile/Laksh-Banthia"
            },
            "answer_text": "History, I believe, is the study of the past, with the purpose of forming the best approximations about what the past was actually like. \"Why try to understand what the past was like?\" Because the influence of the past is still very, very relevant. The Hindutva movement in India is present primarily because its peculiar claims about the singularity of Indian history , and as a result, they're a major influence in the social, political and even academic spheres in India. History-writing during the Cold War also had a major influence on U.S.A's reations with the erstwhile U.S.S.R. I'm writing this post in English right now because of British colonialism and Lord Macaulay's policies of reforming the education system in India during the 19th century. And to take a (very) comtemperory example, the debate (that went viral) about whether Britain owes reparations to India because of the damages it caused to Indians during the colonial era is also dependent on how one views and understands history and its relationship with the present. \"Why is writing history an exercise of forming the best approximations?\" How could you possibly know that the picture you have painted about a time period is the precise representation of the past? There are infinite number of sources (both qualitiative and quantitative in nature) that could tell you what the past was like . One historical source giving you another possibility of what the past could've been like will shatter your claims about your past. Set the past aside; is it even possible to give a precise picture of what the present is like? Do we have complete knowledge about today's realities? I guess not. That is why, history is the study of the past, with the purpose of forming the best approximations about the what the past was actually like. ",
            "date": "Answered July 23, 2015",
            "views": "41",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandria Marcus",
                    "user_href": "/profile/Alexandria-Marcus-2"
                },
                {
                    "user_id": "Achet Alang",
                    "user_href": "/profile/Achet-Alang"
                },
                {
                    "user_id": "Ankit Thakor",
                    "user_href": "/profile/Ankit-Thakor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Aubin",
                "href": "/profile/Patrick-Aubin"
            },
            "answer_text": "History is like an abstract art painting. We can't quite see the whole picture. We don't know exactly where we fit or why we made the decisions we did.  I mean lets take WWII and the development of the atom bomb. We have all these things happening rapidly and simultaneously. You had the evil Nazis attempting to take over the world at the same time were having this massive scientific awakening; the world of the infinitesimally small falls apart in terms of our classical understanding.  We have this massive scientific awakening near the turn of the century that really starts to blossom with the technological advancement.  At the same time people are reevaluating how they view humanity and life itself. With the destruction and outright murder by political systems such as Naziism and communism. The Nazis rise to power during the depression. The United States pulled itself out once Japan bombed us.  Either way, you have all these intense moments in the past commingling and moving things all around; careening towards the present. History is what happened. ",
            "date": "Answered December 13, 2014",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prof Saroj Kumar Tripathi",
                    "user_href": "/profile/Prof-Saroj-Kumar-Tripathi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Algis Ratnikas",
                "href": "/profile/Algis-Ratnikas-1"
            },
            "answer_text": "History is the study of life in society in the past, in all its aspect, in relation to present developments and future hopes. It is the story of man in time, an inquiry into the past based on evidence. Indeed, evidence is the raw material of history teaching and learning. It is an Inquiry into what happened in the past, when it happened, and how it happened. It is an inquiry into the inevitable changes in human affairs in the past and the ways these changes affect, influence or determine the patterns of life in the society. History is, or should be an attempt to re-think the past. Collingwood (1945) is particularly interested in this concept of history. History aims at helping students to understand the present existing social, political, religious and economic conditions of the people. Without the knowledge of history we cannot have the background of our religion, customs institutions, administration and so on. The teaching of history helps the students to explain the present, to analyze it and to trace its course. Cause-and-effect relationship between the past and the present is lively presented in the history. History thus helps us to understand the present day problems both at the national and international level accurately and objectively. http://ddceutkal.ac.in/Syllabus/MA_Education/Education_Paper_5_history.pdf ",
            "date": "Answered August 23, 2019",
            "views": "3",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Junecar Vallespin",
                    "user_href": "/profile/Junecar-Vallespin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saran Joel",
                "href": "/profile/Saran-Joel"
            },
            "answer_text": "oh my … here ican answer your question please go on History can also refer to the academic discipline which uses a narrative to examine and analyse a sequence of past events, and objectively determine the patterns of cause and effect that determine them. Historians sometimes debate the nature of history and its usefulness by discussing the study of the discipline as an end in itself and as a way of providing \"perspective\" on the problems of the present. Stories common to a particular culture, but not supported by external sources (such as the tales surrounding King Arthur), are usually classified as cultural heritage or legends, because they do not show the \"disinterested investigation\" required of the discipline of history. Herodotus, a 5th-century BC Greek historian is considered within the Western tradition to be the \"father of history\", and, along with his contemporary Thucydides, helped form the foundations for the modern study of human history. Their works continue to be read today, and the gap between the culture-focused Herodotus and the military-focused Thucydides remains a point of contention or approach in modern historical writing. In East Asia, a state chronicle, the Spring and Autumn Annals was known to be compiled from as early as 722 BC although only 2nd-century BC texts survived. Ancient influences have helped spawn variant interpretations of the nature of history which have evolved over the centuries and continue to change today. The modern study of history is wide-ranging, and includes the study of specific regions and the study of certain topical or thematical elements of historical investigation. Often history is taught as part of primary and secondary education, and the academic study of history is a major discipline in university studies.Historians write in the context of their own time, and with due regard to the current dominant ideas of how to interpret the past, and sometimes write to provide lessons for their own society. In the words of Benedetto Croce, \"All history is contemporary history\". History is facilitated by the formation of a \"true discourse of past\" through the production of narrative and analysis of past events relating to the human race. The modern discipline of history is dedicated to the institutional production of this discourse. All events that are remembered and preserved in some authentic form constitute the historical record. [ The task of historical discourse is to identify the sources which can most usefully contribute to the production of accurate accounts of past. Therefore, the constitution of the historian's archive is a result of circumscribing a more general archive by invalidating the usage of certain texts and documents (by falsifying their claims to represent the \"true past\"). The study of history has sometimes been classified as part of the humanities and at other times as part of the social sciences. It can also be seen as a bridge between those two broad areas, incorporating methodologies from both. Some individual historians strongly support one or the other classification. In the 20th century, French historian Fernand Braudel revolutionized the study of history, by using such outside disciplines as economics, anthropology, and geography in the study of global history. Traditionally, historians have recorded events of the past, either in writing or by passing on an oral tradition, and have attempted to answer historical questions through the study of written documents and oral accounts. From the beginning, historians have also used such sources as monuments, inscriptions, and pictures. In general, the sources of historical knowledge can be separated into three categories: what is written, what is said, and what is physically preserved, and historians often consult all three. But writing is the marker that separates history from what comes before. Archaeology is a discipline that is especially helpful in dealing with buried sites and objects, which, once unearthed, contribute to the study of history. But archaeology rarely stands alone. It uses narrative sources to complement its discoveries. However, archaeology is constituted by a range of methodologies and approaches which are independent from history; that is to say, archaeology does not \"fill the gaps\" within textual sources. Indeed, \"historical archaeology\" is a specific branch of archaeology, often contrasting its conclusions against those of contemporary textual sources. For example, Mark Leone, the excavator and interpreter of historical Annapolis, Maryland, USA; has sought to understand the contradiction between textual documents and the material record, demonstrating the possession of slaves and the inequalities of wealth apparent via the study of the total historical environment, despite the ideology of \"liberty\" inherent in written documents at this time. There are varieties of ways in which history can be organized, including chronologically, culturally, territorially, and thematically. These divisions are not mutually exclusive, and significant overlaps are often present, as in \"The International Women's Movement in an Age of Transition, 1830–1975.\" It is possible for historians to concern themselves with both the very specific and the very general, although the modern trend has been toward specialization. The area called Big History resists this specialization, and searches for universal patterns or trends. History has often been studied with some practical or theoretical aim, but also may be studied out of simple intellectual curiosity. ",
            "date": "Answered September 26, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Meny",
                    "user_href": "/profile/John-Meny"
                },
                {
                    "user_id": "Terry Bahn",
                    "user_href": "/profile/Terry-Bahn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "I will answer from the philosophy of GWF Hegel, in his book, Philosophy of History (1930). The large survey of world history shows a series of battles and revolutions to End Chattel Slavery. These battles appear in every century, in every nation, on every Continent, and go back to Biblical times (and perhaps longer). History, then, is a massive march toward Freedom. It begins in China, says Hegel, which nation was the first to transcend the tribal chief model to make the Chinese Emperor — first free man in history. With China, “one man became free.” Tribal chiefs could be toppled by a rival any day of any week. Chinese soldiers would sacrifice their lives for the Emperor — and so China grew in spectacular strength and size. This model was then followed (more or less) by other ancient nations, notably Egypt, Assyria, Babylon and Persia. Everything changed with Greece. Since an Emperor could execute any opponent with a wave of his hand, Greece developed an Aristocracy which defended itself against the Emperor by demanding a system of Trial by Jury. Hegel said that with Greece, “many men became free.” Everything change again with Western Europe. The great success of Aristocratic nations allowed them to grow to gargantuan proportions, with tens of millions of citizens. Thus, the Aristocracy could hardly do justice in Representing these millions. So, Western Europe developed the Republic, a system of Regular Elections. With the Republic, said Hegel, “all men became free.” Thus, for Hegel, world history is an ascending series of steps of Progress toward Freedom — from none, to one, to many, to all. Thus, for Hegel, the meaning of history is FREEDOM. There’s my reading. ",
            "date": "Answered December 1, 2019",
            "views": "31",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ma.Alondra Alba",
                    "user_href": "/profile/Ma-Alondra-Alba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Meshram",
                "href": "/profile/Sagar-Meshram-7"
            },
            "answer_text": "History is a mystery that happened in the past.Incidents needed to be remembered are recorded in history. It gives you a detailed though brief idea about the culture tradition and heritage of the past and what changes took place in it. History has witnessed many riseand Sito in costruzione and can predict what can happen in the future too …. ",
            "date": "Answered July 1, 2017",
            "views": "678",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julina Gonzales",
                    "user_href": "/profile/Julina-Gonzales"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Dodd",
                "href": "/profile/Eric-Dodd-1"
            },
            "answer_text": "This is an easy one. My history teachers ground this into us. Their ghosts would give me a boot up the behind for muffing rgis. The primary source are contemporaries of the event or person. This is what it was like by the people that were there to see it and describe it. I could be a primary source on the moon landing, even though I was never closer than my television set. Secondary sources. Are everyone else. I did my thesis for my masters degree on Boudica, who died in 61 AD. All the contemporaries are long since dead. Tacitus comes close, he interviewed some of the survivors but even he was not around in 61 AD and so he is a secondary source, Secondary sources, are everyone else. If you dig up a copy of my thesis (good luck with that), and use it, then I am a secondary source. Finally, one can be both a primary and secondary source. I wrote a book & made a film on the British role, in the US Civil War. During which, I witnessed many things, to include the salvage of a confederate raider. So for that, I was a primary source. Obviously, I was not around when it sank, so I had to rely on the accounts of others, so I was a secondary source. I can anticipate a question here. Which is best, a primary source or secondary source? Neither! Don’t trust anyone. You have to use your mind & judgement. Research! Don’t rely on one source. Be transparent with your sources. There are two sources of error. One is unintentional. We all do this. I saw something but I didn’t see everything, such as in the fog of war, so there are holes in what happened, so I just fill in the holes. I may even truly believe I saw, heard, or felt something but it may be possible I never could have done that (I wasn’t there, I was unconsious, I am old and my memory is unreliable, etc. Then there is the intentional. I want to make the story more exciting, My grandfather used to say “If it is not true, it ought to be!” I have a tie-in with the story. My relative, great, great, grand-cousin, possibly something removed, (something like that) is George Armstrong Custer. He is a good guy, because he is family. I am tempted to go light on the bad stuff and heavy on the good stuff to protect him. If you want to hear about the Little Bighorn, then know there is that! Maybe I believe in some cause or otherwise have an agenda to advance. The best you can do is listen with an open mind, compare it with what you know, and possibly find someone with the expertise to settle an issue. What you are writing is ultimately on you. ",
            "date": "Answered April 12, 2020",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Foysol Islam",
                "href": "/profile/Foysol-Islam-2"
            },
            "answer_text": "History is the study of the past specifically the people, societies, events and problems of the past as well as our attempts to understand them. It is a pursuit common to all human societies. History can take the form of a tremendous story, a rolling narrative filled with great personalities and tales of turmoil and triumph. Each generation adds its own chapters to history while reinterpreting and finding new things in those chapters already written. History provides us with a sense of identity. By understanding where we have come from, we can better understand who we are. History provides a sense of context for our lives and our existence. It helps us understand the way things are and how we might approach the future. History teaches us what it means to be human, highlighting the great achievements and disastrous errors of the human race. History also teaches us through example, offering hints about how we can better organise and manage our societies for the benefit of all. History’ and ‘the past’ Those new to studying history often think history and the past are the same thing. This is not the case. The past refers to an earlier time, the people and societies who inhabited it and the events that took place there. History describes our attempts to research, study and explain the past. This is a subtle difference but an important one. What happened in the past is fixed in time and cannot be changed. In contrast, history changes regularly. The past is concrete and unchangeable but history is an ongoing conversation about the past and its meaning. The word “history” and the English word “story” both originate from the Latin historia, meaning a narrative or account of past events. History is itself a collection of thousands of stories about the past, told by many different people. ",
            "date": "Answered April 7, 2020",
            "views": "761",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gyanendra Prakash",
                    "user_href": "/profile/Gyanendra-Prakash-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bharat Bhushan Wadhwa",
                "href": "/profile/Bharat-Bhushan-Wadhwa"
            },
            "answer_text": "history ˈhɪst(ə)ri/ noun noun: history; plural noun: histories the study of past events, particularly in human affairs.\"medieval European history\"synonyms:the past, former times, historical events, days of old, the old days, the good old days, time gone by, bygone days, yesterday, antiquity; More antonyms:the future the past considered as a whole.\"letters that have changed the course of history\"synonyms:background, past, family background, life story, antecedents; Morethe whole series of past events connected with a particular person or thing.\"the history of the Empire\"an eventful past.\"the group has quite a history\"a past characterized by a particular thing.\"his family had a history of insanity\"a continuous, typically chronological, record of important or public events or of a particular trend or institution. \"a history of the labour movement\"synonyms:chronicle, archive, record, report, narrative, story, account, study, tale, saga; Morea historical play.\"Shakespeare's comedies, histories, and tragedies\"Origin late Middle English (also as a verb): via Latin from Greek historia ‘finding out, narrative, history’, from histōr ‘learned, wise man’, from an Indo-European root shared by wit2. ",
            "date": "Answered July 10, 2018",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Biswapratap Nanda",
                    "user_href": "/profile/Biswapratap-Nanda-2"
                },
                {
                    "user_id": "Jayesh Marathe",
                    "user_href": "/profile/Jayesh-Marathe-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Hans Chaudhary",
                "href": "/profile/Rahul-Hans-Chaudhary"
            },
            "answer_text": "Let me try to answer this: History is all about big and extraordinary transformation in all aspects whether it is civilisation, geographical structure of earth or universe, economic activities etc.History is all about having a golden periods of economic and cultural achievement as well as periods of defeat and humiliation.History is all about traders, invaders refugees, foreigners etc.History is all about place names, urban villages, tradition & sacred sites, old ridges etc.History is all about rise and fall of empires and dynasties, battles, treaties and so on.History is all about geography because geography affects history and history affects geography.History is all about having multiple perspective and views and still goes on with flexiblity.History is all about teaching the behavioural response of particular civilisation or community from its past.History is all about giving anwers about why, when and how?History is all about beginning, preserving and ending.As famously put by Swami Vivekanand,” जतो मत ततो पाथ “ (As many opinions as many ways). You can treat history in any way you want!!! Cheerio :) ",
            "date": "Answered September 21, 2017",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "M A Sheikh",
                    "user_href": "/profile/M-A-Sheikh"
                },
                {
                    "user_id": "Longa Delfin",
                    "user_href": "/profile/Longa-Delfin"
                },
                {
                    "user_id": "Pam Bailey",
                    "user_href": "/profile/Pam-Bailey-40"
                },
                {
                    "user_id": "Raphaelle Therese",
                    "user_href": "/profile/Raphaelle-Therese-1"
                },
                {
                    "user_id": "Helen Lu",
                    "user_href": "/profile/Helen-Lu-8"
                },
                {
                    "user_id": "Eric Dang",
                    "user_href": "/profile/Eric-Dang-3"
                },
                {
                    "user_id": "Hemanth Yakkali",
                    "user_href": "/profile/Hemanth-Yakkali"
                },
                {
                    "user_id": "Lily Liu",
                    "user_href": "/profile/Lily-Liu-131"
                },
                {
                    "user_id": "Haitham Shammaa",
                    "user_href": "/profile/Haitham-Shammaa"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Seiji Sakurai",
                    "user_href": "/profile/Seiji-Sakurai"
                },
                {
                    "user_id": "Arsh Vishen",
                    "user_href": "/profile/Arsh-Vishen"
                },
                {
                    "user_id": "Layla Mohammed",
                    "user_href": "/profile/Layla-Mohammed"
                },
                {
                    "user_id": "Luca Pertegato",
                    "user_href": "/profile/Luca-Pertegato"
                },
                {
                    "user_id": "Biraj Parikh",
                    "user_href": "/profile/Biraj-Parikh"
                },
                {
                    "user_id": "Josh Guevara",
                    "user_href": "/profile/Josh-Guevara"
                },
                {
                    "user_id": "Steven Starkell",
                    "user_href": "/profile/Steven-Starkell"
                },
                {
                    "user_id": "Nebojša Galić",
                    "user_href": "/profile/Nebojša-Galić"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Tan",
                "href": "/profile/Michael-Tan-71"
            },
            "answer_text": "“What is history is but a fable agreed upon?” — Emperor Napoleon I We’ll never really know if Alexander the Great died because of just a mere fever or if there was something more sinister. We’ll never really know if Constantine the Great really saw a Cross in the Sky before the Battle of Milvian Bridge or if that was just propaganda spread by Christian agents. We’ll never really know if 200,000 soldiers were actually buried alive at the Battle of Changping or if this was just a number made up to show off the Qin State’s military might. Yet we have all agreed upon these fables and taken them as true. In truth, much of ancient history is unverifiable — We have no choice but to take as Gospel the writings of some ancient person, surrendering ourselves to the whims and biases and motivations of said person. In this case, that ancient person wrote the fable that we agreed upon. Emperor Napoleon himself understood this — Upon being defeated in Egypt in 1801, he returned home to France and convinced everyone for a good amount of years that he had vanquished the British and Egyptians. His word was taken as Gospel and he had a hero’s welcome. He made the fable that the French people agreed upon then.  This is Herodotus. Whatever this dude told us is now what we accept as history. ",
            "date": "Answered July 9, 2017",
            "views": "46",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Brown",
                    "user_href": "/profile/Harry-Brown-388"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ludwig Nijholt",
                "href": "/profile/Ludwig-Nijholt"
            },
            "answer_text": "Why are primary and secondary sources important to history? Because without sources there is no history, but speculation. Primary sources are contemporary, giving a direct account of events witnessed or reported. Secondary sources are usually non-contemporary, but may have had access to primary sources since lost. It’s this access that is key to history. And without sources, there is no access. Without the rmains of early hominids we would have no knowledge of early human (pre)history. In this sense archaeological finds can also be primary sources - and that for a period for which we have by definition no secondary sources. (That’s a bit beyond what is generally considered ‘history’, but it is a clear example.)  As a result of more creative merging we are now under the heading of an entirely different question yet again: What is history? There’s two answer to that. Here’s an outdated one: “History is the past as it is described in written documents, and the study thereof.” History - Wikipedia So, archaeology plays no part in it, apparently. That will disappoint quite a few archaeologists. Let’s try a better one: History is the past and the study thereof. Catches all meanings and couldn’t be more concise or accurate. (But check out Wikipedia for the explanation why history is called history.) ",
            "date": "Answered April 12, 2020",
            "views": "394",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lesley Iverson",
                    "user_href": "/profile/Lesley-Iverson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Velikovsky",
                "href": "/profile/Joe-Velikovsky"
            },
            "answer_text": "Q: What is your best definition of history? A: The past, as remembered/recorded by someone/thing. History is one of those things the evolutionary algorithm works on: selection, variation, transmission. (A person learns/remembers something) and then Selects which bits to re-present (after all there’s too much stuff going on all at once to represent the whole darn thing: you’d need a computer sim of it all, and even then humanimals would have to `rewind’ lots of it - and focus on different bits to take it all in - and then anyway KABOOM you’re dead of old age before you even get to the dinosaurs) Varies it, somehow (eg puts it in their own words, to avoid plagiarism, draws a picture, diagram or whatever) Transmits it to others. (sells it in a book, or sticks it a museum, tells someone, etc) I like Yuval Noah Harari’s evolutionary take on History: Has it made us happier, or the opposite? For more detail see StoryAlity#141 – The Robo-Raconteur – a StoryAlity Theory Artificial-Writer ",
            "date": "Answered July 3, 2018",
            "views": "912",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dana Leigh",
                "href": "/profile/Dana-Leigh-5"
            },
            "answer_text": "history often repeats itself…from Dr Martin Luther King with his refusal of going back to business as usual and his walk for civil rights of the minority all the way to remotely downloading data which reprograms and taps into the readers’ psyche to replace with a new set of beliefs or better yet, conjure up some new variables through the analysis of specific thought processes to meet the one sided goal(s). History in both aspects above its the displaced power in various ways and methodologies which may seek a goal but is only developed and implemented from what displaced power defines in every sense and among every word. ",
            "date": "Answered October 26, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diphandita Das",
                "href": "/profile/Diphandita-Das-2"
            },
            "answer_text": "History is the study of the human past as it is described in the written documents left by human beings. The past, with all its decisions completed, its participants dead and its history told, is what the general public perceives as the immutable bedrock on which we historians and archaeologists stand. But as purveyors of the past, we recognize that the bedrock is really quicksand, that bits of the story are yet untold, and that what has been told comes tainted by the conditions of what we are today. That's my opinion, of course—here are a collection of others. History Definition History is a narration of the events which have happened among mankind, including an account of the rise and fall of nations, as well as of other great changes which have affected the political and social condition of the human race ",
            "date": "Answered September 1, 2016",
            "views": "850",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Junecar Vallespin",
                    "user_href": "/profile/Junecar-Vallespin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Tuck",
                "href": "/profile/Tom-Tuck-3"
            },
            "answer_text": "Over the long haul social organization gets more complex and can store more information and give it to more people. So knowledge not only increases, It becomes available to more people and can be put to better use. Alphabets are created, printing becomes possible, more people can read. We can read letters written two thousand years ago by people long gone as though they were alive today. Knowledge spans generations instead of being passed from father to son. Our farming techniques improve massively and can support larger populations with less labor. Transportation moves from w as liking to horses to cars trucks and airplanes. We spread out to cover more and more land to put it to its best use. Whole continents are now used that were not before. We are actually thinking and planning on settling Mars. So the frontier is still expanding. That’s history ",
            "date": "Answered February 6, 2020",
            "views": "883",
            "upvotes": " Answer requested by Tucker Jones",
            "upvoters": [
                {
                    "user_id": "Tommy Sandford",
                    "user_href": "/profile/Tommy-Sandford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shobhit Yadav",
                "href": "/profile/Shobhit-Yadav-38"
            },
            "answer_text": "History (from Greek historia, meaning \"inquiry, knowledge acquired by investigation\") is the study of the past as it is described in written documents.Events occurring before written record are considered prehistory. It is an umbrella term that relates to past events as well as the memory, discovery, collection, organization, presentation, and interpretation of information about these events. Scholars who write about history are called historians. History can also prefer to the academic discipline which uses a narrative to examine and analyse a sequence of past events, and objectively determine the patterns of cause and effect that determine them.Historians sometimes debate the nature of history and its usefulness by discussing the study of the discipline as an end in itself and as a way of providing \"perspective\" on the problems of the present. ",
            "date": "Answered May 28, 2018",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Narayan Jat",
                    "user_href": "/profile/Narayan-Jat-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tristan Chénier",
                "href": "/profile/Tristan-Chénier"
            },
            "answer_text": "The most common error that I keep seeing pupping up all over the place regarding History is using a single source to justify one’s arguments. Even worse if this source is derivative. Any serious History relies upon the use of multiple primary and secondary sources. A primary source is a document that relays raw information about a subject; that document will be from the same time/location as the studied subject. It can be an artifact, a manuscript, a recording… left by a witness (direct or indirect) of the event /subject. Primary source A secondary source is a document that studies a historical subject using a plethora of primary sources and other secondary sources. Secondary source The study of how to “make” history, and particularly the proper use of sources, is called Historiography. Any historian, amateur or not, that’s worth his grain of salt will know about this. ",
            "date": "Answered February 18, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nilesh Singh",
                    "user_href": "/profile/Nilesh-Singh-158"
                }
            ]
        },
        {
            "author_info": {
                "name": "Udayaravi Shastry",
                "href": "/profile/Udayaravi-Shastry"
            },
            "answer_text": "Did you mean to say, “ What does History actually mean?” It is the study of past events, particularly in human affairs. Metaphorically saying, Today’s politics is tomorrow’s History. Usually when we say History, wespeak of past Kings and their rule and the administration. however, these days we have people’s history, that is history from below: Historical events accounted from the view of a common man. hisotry can be of various time periods. Ancient history, contemporary history, medieval history, or place histories like British hisotry, American history, etc. Other ways of using history is case history of a patient accounts for what ailments the person has in the past. It could be used ironically, she has had a wonderful history,colourful history, etc. History can be collocated with family history, life history, sexual history, employment history etc.. In all these cases as you can see, it is an event that has happened in the past. ",
            "date": "Answered January 4, 2017",
            "views": "7",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lidia Fedorska",
                    "user_href": "/profile/Lidia-Fedorska"
                },
                {
                    "user_id": "Yuvraj Singh",
                    "user_href": "/profile/Yuvraj-Singh-1698"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ibraheem Tijjani",
                "href": "/profile/Ibraheem-Tijjani"
            },
            "answer_text": "There are obviously many definitions of History as there are Historians. History in my view is not the study of anything or of everything. It is neither the study of the past, rather, History is an objective interpretation and analysis of events for the benefits of humanity.History is not a story telling and neither a chain of narrations. Of what benefit to present generation the devastating effect of the two world wars? Or even the study of how Africa was partitioned at Berlin. The fact remains that any study of the past, present or future reoccurances that did not bring out the lessons embedded in such events is a study in futility and therefore not \"history\" ",
            "date": "Answered March 5, 2017",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Navya Sri",
                "href": "/profile/Navya-Sri-4"
            },
            "answer_text": "History is so huge that it cannot be defined in one or two sentences....it basically gives information about events that happened in the past..it involves many topics but it is mostly implied to humans...american historian David McCullough once said \" history is who we are and why we are the way we are \"         Cultural festivals,historical places,kings who lived long back,different people,origin of a community and many things can be known with the help of history...historians are available whose main work is to know history of a particular thing....a family has a history which starts from  the great grand fathers and continues..in the same way everything has got history to know about how it originated and what happened as the time passed by... ",
            "date": "Answered October 26, 2013",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Likha Chumu",
                    "user_href": "/profile/Likha-Chumu"
                },
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-1542"
                },
                {
                    "user_id": "Ankit Thakor",
                    "user_href": "/profile/Ankit-Thakor-1"
                },
                {
                    "user_id": "Vinnie",
                    "user_href": "/profile/Vinnie-7"
                },
                {
                    "user_id": "Michael Zhang",
                    "user_href": "/profile/Michael-Zhang-226"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Oparinde",
                "href": "/profile/John-Oparinde"
            },
            "answer_text": "It depends on the context, but you probably mean the academic sense. In that case, history is the study of the past. Notice that I said study; simply recording events does not make someone a historian. A historian interprets events. He or she establishes cause and effect relationships. That is why Herodotus—at least in the West—is considered the first historian. There were scribes before him who recorded events, but Herodotus was the first to establish causes and effects between those events.  Herodotus, the “Father of History.” He set out to study the past, not just record it. ",
            "date": "Answered June 11, 2019",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Roberts",
                    "user_href": "/profile/Joseph-Roberts-19"
                },
                {
                    "user_id": "Dylan Wells",
                    "user_href": "/profile/Dylan-Wells-6"
                },
                {
                    "user_id": "Syed Haris Ahmed",
                    "user_href": "/profile/Syed-Haris-Ahmed-4"
                },
                {
                    "user_id": "Jack Doxey",
                    "user_href": "/profile/Jack-Doxey"
                },
                {
                    "user_id": "Rohan Mehere",
                    "user_href": "/profile/Rohan-Mehere"
                },
                {
                    "user_id": "Chase Quinton",
                    "user_href": "/profile/Chase-Quinton"
                },
                {
                    "user_id": "Prakhar Gupta",
                    "user_href": "/profile/Prakhar-Gupta-1"
                },
                {
                    "user_id": "Jackie Boden",
                    "user_href": "/profile/Jackie-Boden"
                },
                {
                    "user_id": "Daniel Ptashny",
                    "user_href": "/profile/Daniel-Ptashny-1"
                },
                {
                    "user_id": "Muadth Smith",
                    "user_href": "/profile/Muadth-Smith"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                },
                {
                    "user_id": "Sam Parker",
                    "user_href": "/profile/Sam-Parker-416"
                },
                {
                    "user_id": "Gerd Hoffmann",
                    "user_href": "/profile/Gerd-Hoffmann-2"
                },
                {
                    "user_id": "Giles Smith",
                    "user_href": "/profile/Giles-Smith-12"
                },
                {
                    "user_id": "Feifei Wang",
                    "user_href": "/profile/Feifei-Wang-6"
                },
                {
                    "user_id": "Richard Wall",
                    "user_href": "/profile/Richard-Wall-14"
                },
                {
                    "user_id": "Jeremy Glenesk",
                    "user_href": "/profile/Jeremy-Glenesk"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                },
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                },
                {
                    "user_id": "Alexander Goodwill",
                    "user_href": "/profile/Alexander-Goodwill"
                }
            ]
        },
        {
            "author_info": {
                "name": "Myles W. Farrington",
                "href": "/profile/Myles-W-Farrington"
            },
            "answer_text": "History is Why we are Who we are and What we are. Not arguing with Mr Steinberg, the above statement holds true even if the history you read is nationalist propaganda. That being said, if you take a scholarly interest in history, you need to read about events from all different perspectives and question everything.  There have been a number of questions on WWII lately and many years ago during my study of that period, I was able to obtain an English translation of a book called \"The Great Patriotic War\", which explained the war from the Russian perspective. Interesting. Several historians have been severly honest in their writings. Off hand, I think of William Manchester, John Toland and William Shirer. But, that's  if you're interested in the history of that period. ",
            "date": "Updated December 25, 2012",
            "views": "35",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darish Trinidad",
                    "user_href": "/profile/Darish-Trinidad"
                },
                {
                    "user_id": "Merimar Ni Fiach",
                    "user_href": "/profile/Merimar-Ni-Fiach"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "I understand that history is nuanced; it deserves and demands intense study of small details such that most people have neither the time nor focus to truly invest. A single small event in history can consume great quantities of time and intellectual rigor. The big things we think of in history have very complicated beginnings. In fact, there is no “beginning” in studying history, there are only previous events. “Any history that doesn't begin with the Big Bang is cutting out critical details.” ",
            "date": "Answered February 18, 2017",
            "views": "25",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sugyanananda Kusum",
                    "user_href": "/profile/Sugyanananda-Kusum"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Precht",
                "href": "/profile/John-Precht"
            },
            "answer_text": "“The past isn't dead. It isn't even past.” - William Faulkner. To me…History is a mystery to be unraveled… All History has the bias of whoever wrote it. A tremendous amount of History is a lie with a political agenda… Uncover and expose it! The fun part is to sink yourself into an historical subject, read all the different viewpoints as to what happened, research the subject from all angles, and try to come up with a feeling for what REALLY happened!…Without understanding the Past, we can never really understand why Things are the way they are Now, which is the only real Key to moving into the Future.. We will never solve our Problems as a Nation, without understanding how those Problems evolved... If we don't know where we've Been, how can we know where we're Going? ",
            "date": "Answered January 16, 2017",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zaheer Chans",
                    "user_href": "/profile/Zaheer-Chans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Ross",
                "href": "/profile/Paul-Ross-205"
            },
            "answer_text": "History is the study of meaningful events in the recorded past and their relevance to modern occurrence.For example one might study the rise of Mussolini in Italy of the 1920′ and 1930’s and note interesting parallels to certain events in today’s news.The events of the past tend to repeat themselves because the humans of the past are the same as us. ",
            "date": "Answered February 1, 2020",
            "views": "533",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saif Ahmed",
                "href": "/profile/Saif-Ahmed-279"
            },
            "answer_text": "History is something that makes us curious to know, happened in the past. I don’t think it always has to be a meaningful event. Because something meaningful to one could be totally meaningless to others. But it is still history because it happened and we wanna know it for our own interest or with a purpose. Now, if we want to say it in a formal way then History is the study of the things and events related to the human being, happened in the past. According to W.C. Sellar, “History is not what you thought. It is what you remember. All other history defeats itself.” I hope this definition is what you are looking for. ",
            "date": "Answered July 30, 2019",
            "views": "761",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heather Walker",
                "href": "/profile/Heather-Walker-29"
            },
            "answer_text": "What I mean by word history is the history of the written word - how writing was invented and progressed. Take note of the capitalisation. What I mean by Word history, by contrast, is specific to Microsoft Word editor program. It's possible I refer to the historical development of the program, but I more likely refer to the history of edits in a user document as reported by Word. By contrast, if I was curious about the the history of a particular word, I would search for its etymology. (And if I didn't know the word history, I’d search for “define history”). ",
            "date": "Answered February 24, 2020",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashok Dewan",
                "href": "/profile/Ashok-Dewan"
            },
            "answer_text": "History is series of events or activities that happened in the past long time ago. Those who witnessed those events and had gone through them, they recorded those past events in the form of written documents or in any other form. To study those events and situations is also called History. History is not a story or myth. History is reality which happened in the past. ",
            "date": "Answered March 15, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tore Ekstrem",
                "href": "/profile/Tore-Ekstrem"
            },
            "answer_text": "By word history most people mean the science engaged in past of humanity, its attitudes between each other and may be opportunity for some scientist to get their degree). But actually, it's more then just the science. In my opinion it's, first of all, an opportunity for all of us to see what might happen in case this or other decision. Cause a lot of historians recon that history has spiral structure this means that most of modern events might been happened in the past already. It may allow us to learn lessons of the past, and not to repeat mistakes in the future, but unfortunately... You can see yourselves that despite all lessons of the past, we not always can make the wright choice or make wright decision. But anyway I believe in our future and believe that with time we become better and better. And History (with a capital letter) is the main our assistant! ",
            "date": "Answered May 23, 2020",
            "views": "379",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tiaan van Schalkwyk",
                "href": "/profile/Tiaan-van-Schalkwyk"
            },
            "answer_text": "My father, being a historian and a specialist (historic) tour guide in his country, always has the following two things to say about history. 1) History is written by the victors (Actually an old Churchill saying, although I stand corrected). And 2) History is nothing more than an interpretation of the truth. This second statement just adds to the first, in that history (or at least the official, written, taught-in-schools version) is an interpretation of events to make the ruling party/race/group of people look good. Thats why I like the English word, even though English is not my first language. History… His-story… The story according to him (him being whoever is trying to convince you that things happened the way he says it did) ",
            "date": "Answered November 25, 2016",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Junecar Vallespin",
                    "user_href": "/profile/Junecar-Vallespin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sejal Gambhir",
                "href": "/profile/Sejal-Gambhir-1"
            },
            "answer_text": "History is the study of the past, past events and personalities who have done remarkable deeds and the study of early human civilizations, how they progressed, how new ideologies emerged and in what ways they are related to the present world. History is mainly divided into three periods, I.e ancient, medieval and modern. Also there is another dimension or a separate branch known as The Stone age, which is further subdivided into palaeolithic Age, Mesolithic Age and the Neolithic Age This branch particularly explains the origin and evolution of Man and the progress and developments of his intellect - from the making of stone weapons to the settlements in groups and discovery of agriculture. In short, history is a completely interesting and thrilling branch of study. ",
            "date": "Answered December 7, 2017",
            "views": "684",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Denisse Joan Lopez",
                    "user_href": "/profile/Denisse-Joan-Lopez"
                },
                {
                    "user_id": "Naresh Matta",
                    "user_href": "/profile/Naresh-Matta-2"
                },
                {
                    "user_id": "Ajneesh Raj Takkar",
                    "user_href": "/profile/Ajneesh-Raj-Takkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiani Francis",
                "href": "/profile/Kiani-Francis"
            },
            "answer_text": "History tells us why things are now as they are - aetiology of the world. It also contains stories - “histoires” - which are actually true (or not).  However our interpretation of it depends on different interpretations & perspectives. How significant was , say, the assassination of Franz Ferdinand? Very - because it started WW1 -or perhaps not at all, as ww1 may well have happened anyway, given that Germany was looking for a reason for war as it felt threatened by the Franco-Russian détente. Or was it due to inter-imperial rivalry? Could the British have avoided involvement? The lines of enquiry are endless. What is more significant- great figures & battles- or the invention of the washing machine? Can history teach us ever to learn from others mistakes? Probably not. Engels said “History repeats itself; the first time is tragedy, the second time as farce” He also said of the Bourbons “They have learnt nothing & forgotten nothing.” ",
            "date": "Answered January 7, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nanjan Sebastian",
                "href": "/profile/Nanjan-Sebastian"
            },
            "answer_text": "History is a subject that tells you about the past important occurrences happening in the universe.History is a record set or feat in particular subject like language sports or any other particular field.History is like your question asked in Quora aiming to different levels of parameters taken into account , to get it read all across the globe and making a very few like me to answer and finally bring out what is in their intellectual self.“IN A NUTSHELL HISTORY IS THE PAST THAT LIKES TO DEVOUR AND ASSIMILATE THE PRESENT AND THE FUTURE. “",
            "date": "Updated January 26, 2020",
            "views": "605",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yash Singh",
                    "user_href": "/profile/Yash-Singh-2175"
                },
                {
                    "user_id": "Amritesh Pandey",
                    "user_href": "/profile/Amritesh-Pandey-11"
                },
                {
                    "user_id": "Nilesh Pawar",
                    "user_href": "/profile/निलेश-पवार-Nilesh-Pawar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean O'Donovan",
                "href": "/profile/Sean-ODonovan-14"
            },
            "answer_text": "History is the accumulated memory of the Human race. Just as our individual memories help us to live better lives because we have learned how to do various things so History helps the race as a whole develop. Individuals today know far more about the world we live in than individuals of even 100 years ago. Unfortunately, just as individuals are not perfect and our lessons are not perfectly learned neither does the race as whole learn perfectly from the past . hence. History must needs be repeated from time to time. ",
            "date": "Answered June 8, 2020",
            "views": "281",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tee Brown",
                "href": "/profile/Tee-Brown-53"
            },
            "answer_text": "A whole series of past events connected to someone or something(s). It’s essentially a track record of human affairs and nature. The winners are the ones who are able to record it and spread it throughout the world though there are some that tell it like it was during the time period, but are much harder to research. It’s there for us to either learn from our mistakes or repeat them. ",
            "date": "Answered July 12, 2018",
            "views": "281",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Myself Only",
                "href": "/profile/Myself-Only-9"
            },
            "answer_text": "History is the branch of knowledge dealing with the records of the past. In other words we can define history as man's journey from the past to the present. “HISTORY” helps us to… Know our past.To know about the people. i.e about the rulers and the ruled.To know people's culture and civilization.To solve day to day problems in a better and amicable way.To know basic nature and needs of the society.To build a better world.To insulate the spirit of tolerance in us.(In history we find dates in BC (before Christ) and AD (anno Domini) which means in the year of Lord.)History is a two types prehistory and historyShuvo ",
            "date": "Updated August 23, 2020",
            "views": "367",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Lund",
                "href": "/profile/Jerry-Lund"
            },
            "answer_text": "History takes a discipline-based view of history as a process of inquiry with its own methods and procedures, based on the analysis and interpretation of evidence. This emphasis on history as a process of inquiry is important, because it signals to teachers that students need to actively investigate the content outlined in the curriculum, not just 'learn' it. An inquiry approach encourages students to pose questions and seek answers, to locate, analyse and interpret evidence, to discover and explain different perspectives and interpretations about the past and to develop and substantiate their own interpretations, based on evidence. So, history is not simply a body of content to be transmitted to students, nor a set of concepts, methods and skills to be taught in isolation, but an approach that brings the two together. Students develop historical knowledge and understanding by applying historical concepts, methods and skills to their investigations of aspects of the past. ",
            "date": "Answered May 2, 2016",
            "views": "867",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Lo",
                "href": "/profile/John-Lo-44"
            },
            "answer_text": "You may find it useful to distinguish three different ways in which the term is commonly understood: 1. History as the past, generally, though not exclusively, the human past; 2. History as the miniscule part of the human past of which there is some record; 3. History in the sense of the subject, or discipline of history. ",
            "date": "Answered May 3, 2019",
            "views": "223",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meet Dhokiya",
                "href": "/profile/Meet-Dhokiya"
            },
            "answer_text": "History is mainly about the past and and how how the all the things came in this present like examples TV , radio, aeroplanes etc.now you can understand that I said that how all the things came in present so so you can know that thank you to history that history always updating these New Earth . Everyone knows that student learn S.S and in in SS mainly history came but so many students have question that we know about the past by history so how can History know that all about the past so I will tell you answer students this this question answer is by craving craving means to write something to know wall the town and history know about past. ",
            "date": "Answered March 28, 2019",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Becksted",
                "href": "/profile/Bob-Becksted"
            },
            "answer_text": "History is the past. When something ends you will sometimes hear people say, “it’s history now.” History is also the truth about the past. You can’t make it up and call it history. We keep newspapers, books, letters, and videos as records for the past. This enables historians to study the past and help enable the future. We learn from history. There are sciences that study to help build history—archaeology, anthropology and genealogy for example. Our memories are not always good records of history. They may, however, be good clues for knowing how to find the facts. ",
            "date": "Answered October 5, 2019",
            "views": "272",
            "upvotes": " Answer requested by John Goldy Albarill",
            "upvoters": [
                {
                    "user_id": "Abdullah Al Faruque",
                    "user_href": "/profile/Abdullah-Al-Faruque"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreenivas Kss",
                "href": "/profile/Sreenivas-Kss"
            },
            "answer_text": "History, I call it as continuous story of things happened before ( various situations & various locations & various cultures & any thing of physical being). It’s a great subject that enlighten us on how our elders or ancestors lead their life or fought for survival. The same way our generations should make useful and non destructive things that would lead healthy and wealthy life for future generations. Even though available knowledge define the survival time of man & man kind, knowledge transfer (‘hi’ story’) is compulsory to go on…. Hence, under history, we come to know the information right from the birth of universe (material formation in the sky) till date. It also tells us how to honor our life issues. ",
            "date": "Answered July 23, 2018",
            "views": "32",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "ANKIT TIWARI",
                    "user_href": "/profile/ANKIT-TIWARI-591"
                },
                {
                    "user_id": "Nitesh Gughane",
                    "user_href": "/profile/Nitesh-Gughane"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjali Verma",
                "href": "/profile/Anjali-Verma-186"
            },
            "answer_text": "If seen academically, it is a series of events, basically of human beings, which occurred in the past and has been given to us to study and gather knowledge. It is like series of stories of civilizations, warriors, lifestyle, love, melodramas, inventions, discoveries, etc. If understood philosophically, history is nothing but past, and past is each and every second which is passing. So from this point of view, every passing second is becoming history. It depends on how we are seeing it. ",
            "date": "Answered July 11, 2017",
            "views": "507",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neeta Kohli (नीता कोहली)",
                    "user_href": "/profile/Neeta-Kohli-नीता-कोहली"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saikat Chakrabarty",
                "href": "/profile/Saikat-Chakrabarty-1"
            },
            "answer_text": "The whole human History is bunk because it is written by people who are victorious. For example in India, Britain ruled for 300 years and they were the writers of history. They were not writing about the reality, the fact. To them the revolutions of Indians was only a mutiny. Revolutions has a respectability about it.  Mutiny is something which is to be crushed.  The moment India became independent, they started writing history again. Those 300 years, they changed. Now who is right? When Stalin came to power in Russia, he changed the whole history of the revolution. Leon Trotsky was the second figure to Lenin, so in every picture he was sitting next to Lenin, he changed, Trotsky's pictures were removed, Stalin's pictures were put. Old books were destroyed. Troksky had escaped, writing history, when one of the murderers from Stalin hit him with a hammer on the head. Looking at Trotsky's history, one of the chief characters in the history, Trotsky was the second figure to Lenin, Stalin was nobody. Lenin was a great organizer, Trotsky had charisma and had influence over masses, both together were immensely helpful & complemented each other. However, Stalin & his followers have a different story. Now, Which one to believe? Whom to believe? ",
            "date": "Answered August 9, 2014",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raahul Sahni",
                    "user_href": "/profile/Raahul-Sahni"
                },
                {
                    "user_id": "AMAN VIVEK",
                    "user_href": "/profile/AMAN-VIVEK-8"
                },
                {
                    "user_id": "MonkeyRuffi D. Jireh",
                    "user_href": "/profile/MonkeyRuffi-D-Jireh"
                },
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                },
                {
                    "user_id": "Mahadev Kumawat",
                    "user_href": "/profile/Mahadev-Kumawat-1"
                },
                {
                    "user_id": "Krunal Mehta",
                    "user_href": "/profile/Krunal-Mehta-25"
                },
                {
                    "user_id": "Troy Friesen",
                    "user_href": "/profile/Troy-Friesen-2"
                },
                {
                    "user_id": "Pinky Sarada",
                    "user_href": "/profile/Pinky-Sarada"
                },
                {
                    "user_id": "Chandana Ps",
                    "user_href": "/profile/Chandana-Ps"
                },
                {
                    "user_id": "Yashika Dhulekar",
                    "user_href": "/profile/Yashika-Dhulekar"
                },
                {
                    "user_id": "Sumit Saxena",
                    "user_href": "/profile/Sumit-Saxena-45"
                },
                {
                    "user_id": "Shreekant Jahagirdar",
                    "user_href": "/profile/Shreekant-Jahagirdar"
                },
                {
                    "user_id": "Shanmugam (சண்முகம்)",
                    "user_href": "/profile/Shanmugam-சண்முகம்"
                },
                {
                    "user_id": "Vibhor Pandey",
                    "user_href": "/profile/Vibhor-Pandey-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidyabhushan Kalaskar",
                "href": "/profile/Vidyabhushan-Kalaskar"
            },
            "answer_text": "History is collection of all past significant moments which have influenced or are capable of influencing our present.Eg. Vedic time had given us the language of Sanskrit which is core of many present day's languages.History of mahatma Buddha gave us philosophy of \"Madhhyam Marga\" which is crucial in day to day life.All the ancient scientific advances are commendable and could prove beneficial to probe the science further if interpreted intelligently. Origin of religion, caste, creed, race lie in history. Everything that we have today has a history. If we could know everything about history, we will be able to know life in better way. It is said that, history repeats itself and hence to avoid the same mistakes what our ancestors did, one must know history. ",
            "date": "Updated January 26, 2019",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sherwin Lambong",
                    "user_href": "/profile/Sherwin-Lambong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suhas Sharma",
                "href": "/profile/Suhas-Sharma-20"
            },
            "answer_text": "The story of our past. A past from which we barely learn that we tend to repeat the same mistakes which our ancestors committed bringing about a vicious cycle of war and unrest. The only problem with history being it is prone to distortion. Historical facts can be grossly misrepresented, twisted, tuned to suit the version of the rich and powerful. History is written by the victors (Sir Winston Churchill). History is nothing but a set of lies agreed upon (Napoleon Bonaparte). ",
            "date": "Answered September 9, 2017",
            "views": "654",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Romelo Lloyd Coma",
                    "user_href": "/profile/Romelo-Lloyd-Coma"
                },
                {
                    "user_id": "Anita Prakash",
                    "user_href": "/profile/Anita-Prakash-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishna Kongalla",
                "href": "/profile/Ramakrishna-Kongalla"
            },
            "answer_text": "History is Md Copi… Till my 5th class I had a friend Md. Arif. His number was after me and he tried enough to Copi from my answer sheets always. And yes Md Copi is a pnemonic. And it means… MemoriesDiscoveredCollectedOrganisedPresented andInterpretedAnd also… “History is understanding the past in the present to be better in the future” Thank you… ",
            "date": "Answered September 21, 2017",
            "views": "19",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Levin",
                    "user_href": "/profile/Simon-Levin-6"
                },
                {
                    "user_id": "James Galloway",
                    "user_href": "/profile/James-Galloway-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benedicte Sofie Tverbak",
                "href": "/profile/Benedicte-Sofie-Tverbak"
            },
            "answer_text": "history /ˈhɪst(ə)ri/ noun 1.the study of past events, particularly in human affairs.\"medieval European history\"synonyms:the past, former times, historical events, days of old, the old days, the good old days, time gone by, bygone days, yesterday, antiquity; literarydays of yore, the olden days, yesteryear; archaicthe eld\"this is a wonderful opportunity to use my interest in history\"2.the whole series of past events connected with a particular person or thing.\"the history of the Empire\"",
            "date": "Answered November 19, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joy Quita",
                    "user_href": "/profile/Joy-Quita"
                },
                {
                    "user_id": "Krishna Reddy",
                    "user_href": "/profile/Krishna-Reddy-754"
                },
                {
                    "user_id": "Piyush Mathur",
                    "user_href": "/profile/Piyush-Mathur-17"
                },
                {
                    "user_id": "Mayank Mundhra",
                    "user_href": "/profile/Mayank-Mundhra-2"
                },
                {
                    "user_id": "Varun Shukla",
                    "user_href": "/profile/Varun-Shukla-वरुण-शुक्ला"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ivo Knittel",
                "href": "/profile/Ivo-Knittel"
            },
            "answer_text": "It is not political journalism because it is no longer about what is going to happen next. Also historians start their work when files are declassified and people are willing to talk before they die.It is not social science, whose precondition is the existence of a large number of comparable situations. History is precisely what is left over by political science. The unique flavour, this is just the historical.It is not mythology. Of course, we all perceive history as a mythology. Napoleon, John F. Kennedy, Kaiser Wilhelm II, Alan Turing and the Engima, they are all great stories ready to be told and argued over and over again and sometimes it doesn’t seem to matter any more what actually happened or whether a person even existed? For the historian it does matter.",
            "date": "Answered November 1, 2017",
            "views": "513",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mehran Zeenavand",
                "href": "/profile/Mehran-Zeenavand"
            },
            "answer_text": "Probably these words from bayhaqqi (an Iranian historian who was a pioneer in writing history in the style we know today, lived centuries ago) are the best asnswer to this question, He says ‘ gudhashta chirāgh i rāh i āyada ast ‘ word for word it means ‘ the past is the lamp of future’s path’ it means you should learn from the past so you don’t make the same mistake twice (or even more). ",
            "date": "Answered October 6, 2019",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda Olsvig Whittaker",
                "href": "/profile/Linda-Olsvig-Whittaker"
            },
            "answer_text": "That depends on whether you think human life has meaning. History is the story of human life. So if life has no meaning, history has no meaning. If life DOES have a meaning, then the meaning of history will depend on what meaning you give life itself. For example if you are a Jew or Christian, life and history are the playing out of God’s plans on earth. If you are an evolutionary biologist, life and history are examples of continuous adaptation. If you are a Hindu or Buddhist, life and history are endless cycles of “maya”, illusion. So it depends on your philosophical foundations. ",
            "date": "Answered February 19, 2020",
            "views": "573",
            "upvotes": " Answer requested by Brandon C. Njichop, Khan Demont and 2 more",
            "upvoters": [
                {
                    "user_id": "CE Channel A.D",
                    "user_href": "/profile/CE-Channel-A-D"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susmita Prakash",
                "href": "/profile/Susmita-Prakash-1"
            },
            "answer_text": "History is basically the study of past based on the available facts and evidences but it is important to note that the facts are only raw material and it becomes history based on the interpretation and perception of the historian. Moreover, history is interdisciplinary in nature based on reasoning. E.H Carr defines history as an unending dialogue between the past and present and according to him Past, present and future are linked together in endless chain of history. So the study of history is essential to critically examining the past and based on it take present and future decisions. ",
            "date": "Answered November 5, 2017",
            "views": "935",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denis Gavrilov",
                    "user_href": "/profile/Denis-Gavrilov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shimshon (Ignat) Ayzenberg",
                "href": "/profile/Shimshon-Ignat-Ayzenberg"
            },
            "answer_text": "Today, HISTORY is an interpretation of how and why some significant thing(s), event(s), people, labor, custom, thought, discovery, art, or invention, had existed in the past, transpired, and made some mark or contribution in a particular connected or ccostly associated chain of events that is based on some degree of empirical evidence. History is not what anybody would like to have happened on whim. ",
            "date": "Answered May 7, 2017",
            "views": "609",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Divine Grace Gempesao",
                    "user_href": "/profile/Divine-Grace-Gempesao"
                },
                {
                    "user_id": "Mahadev Kumawat",
                    "user_href": "/profile/Mahadev-Kumawat-1"
                },
                {
                    "user_id": "Nalini Rai",
                    "user_href": "/profile/Nalini-Rai-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-584"
            },
            "answer_text": "Some idiot walking past punches you in the head. Why. Maybe he is the (OR HER) a result of the past. I am itchy. History says a mosquito bit me. People steal from me. Do they hate my parents ? History is the interest of explaining what ails (hurts you) you. Most people live day to day and do not care that there lives would be different if something was different in the past. The saying is that history never repeats when education is not forgotten. Anything less is a return of cannibalism. I am sure animals wait the return of that. ",
            "date": "Answered July 14, 2018",
            "views": "269",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harsh Dadu",
                "href": "/profile/Harsh-Dadu-1"
            },
            "answer_text": "History can briefly defined as the analysis of past events to understand and probably predict the pattern of their occurance. As said by a great archaeologist,”You cannot study the present nor plan for the future without knowing the past.” So history though full of facts and dates is an important aspect of development with great scope for enthusiasts. History has also been divided on basis of dates, ruling powers, evolution calendar, to namme a few. Overall a vast subject with endless discoveries. ",
            "date": "Answered November 4, 2018",
            "views": "509",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thom Noble",
                "href": "/profile/Thom-Noble"
            },
            "answer_text": "For me it is a giant canvas. Like a story that over time will repeat usually unfortunately. We strive to take giant steps but fall back once in awhile. For example Trum I believe will be a minor blip on the radar of history. We are going through an evolution right now. A lot of our ignorance and suspicion are being stripped away. For example we are learning love is love even shedding some religious uncertainty along the way. History is a mural. One of the reasons I like Star Trek because it teaches we have a chance. We just need to grab it. ",
            "date": "Answered January 28, 2019",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shashwat Vardhana",
                "href": "/profile/Shashwat-Vardhana"
            },
            "answer_text": "It’s the longest story in the world. And, it’s a never ending one. It had infinity number of writers and several different contradicting versions … But one thing is for sure: you’ll always have a story when you want one in History ",
            "date": "Answered April 20, 2017",
            "views": "864",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshat",
                    "user_href": "/profile/Akshat-127"
                },
                {
                    "user_id": "Poonam Prashar Sahijpal",
                    "user_href": "/profile/Poonam-Prashar-Sahijpal"
                },
                {
                    "user_id": "Ripudaman Singh",
                    "user_href": "/profile/Ripudaman-Singh-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sourabh Kumar",
                "href": "/profile/Sourabh-Kumar-704"
            },
            "answer_text": "History is the study of past happenings or affairs related to humans. It consists of activities which affect the lives of human and influence ourselves. We are supposed to read history so that we can develop a standard for the human being, fo ex- learning from great kings or criticizing the bad deeds of people and develop good ethics. ",
            "date": "Answered May 7, 2020",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emir Kocak",
                    "user_href": "/profile/Emir-Kocak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nat Weeks",
                "href": "/profile/Nat-Weeks-3"
            },
            "answer_text": "History is ‘His Story’. The story of how God is vindicating Himself from Satan’s lie believed by Adam that man is better off denying and ignoring God. Thus far, mankind has tried tribalism, slavery, feudalism, kingdoms, aristocracies, communism, dictatorships, and republics. The last one left to try is a one-world government which will be the worst of all. Then He returns for those who prefer to trust and obey Him. At that point, history ends, and timeless eternity begins for us in either a good place or a bad one. ",
            "date": "Answered July 1, 2017",
            "views": "470",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Biira Rhoda",
                    "user_href": "/profile/Biira-Rhoda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Singh",
                "href": "/profile/अभिषेक-सिंह-Abhishek-Singh-5"
            },
            "answer_text": "History is derived from Greek term ‘Historia’ , meaning knowledge acquired by investigation. History is the study of our past. I believe it is a subject which is synonymous to story-telling. HISTORY in itself contains word “STORY”. Hence History tells us the story of people of the past, their economy , occupation , lifestyles , their rulers and battles they fought.  ",
            "date": "Answered March 13, 2017",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bonkonwar Sahu",
                    "user_href": "/profile/Bonkonwar-Sahu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajat Manocha",
                "href": "/profile/Rajat-Manocha-3"
            },
            "answer_text": "“HISTORY” is the “STORY” of “H”appenings “I”ncoming in our Life, those which have already happened once to Humans but are coming again. Thus by reading History we Humans can Analyse those stories to tackle them better this time. ",
            "date": "Answered July 1, 2017",
            "views": "308",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Chaudhary",
                    "user_href": "/profile/Aditya-Chaudhary-405"
                },
                {
                    "user_id": "Raghvendra Yadav",
                    "user_href": "/profile/Raghvendra-Yadav-6"
                },
                {
                    "user_id": "Srishti Tiwari",
                    "user_href": "/profile/Srishti-Tiwari-19"
                },
                {
                    "user_id": "Gunjan Singh",
                    "user_href": "/profile/Gunjan-Singh-177"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mario Auditore",
                "href": "/profile/Mario-Auditore-2"
            },
            "answer_text": " History is not the past. The past is lost, we don’t have access to it. But we do have access to some traces, some clues: the sources . And so we can reconstruct an account of the past: History. In greek, “Historia” meant witness. Cicero’s definition is perfect. ",
            "date": "Answered April 18, 2019",
            "views": "852",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "CE Channel A.D",
                    "user_href": "/profile/CE-Channel-A-D"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Ogden",
                "href": "/profile/Kenneth-Ogden-3"
            },
            "answer_text": "History is the study of the past in order to understand the meaning and dynamics of the relationship between cause and effect in the overall development of human societies. Reference http://www.eolss.net/sample-chapters/c04/e6-22-00-00.pdf ",
            "date": "Answered March 4, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Motiur Rahman",
                    "user_href": "/profile/Motiur-Rahman-270"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nayana M",
                "href": "/profile/Nayana-M-7"
            },
            "answer_text": "In common usage, History means the record of past events. But as we go deeper, History is nothing but investigation. Investigation of available facts and evidences without bias to reach the truth ",
            "date": "Answered November 18, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prince Adhana",
                "href": "/profile/Prince-Adhana"
            },
            "answer_text": "History is the record of past events in general but if we talk about its relevence, its ocean of knowledge. And we can use it to mend our acts, responses in present. ",
            "date": "Answered July 1, 2017",
            "views": "370",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aman Shukla",
                    "user_href": "/profile/Aman-Shukla-218"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hamza Khalid",
                "href": "/profile/Hamza-Khalid-117"
            },
            "answer_text": "The study of past events, particularly in human affairs or a continuous, systematic narrative of past events as relating to a particular people, country, period, person, etc., usually written as a chronological account; chronicle: A people without the knowledge of their past history, origin and culture is like a tree without roots. ",
            "date": "Answered June 6, 2018",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bonkonwar Sahu",
                    "user_href": "/profile/Bonkonwar-Sahu"
                },
                {
                    "user_id": "Rajagopalan R",
                    "user_href": "/profile/Rajagopalan-R-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raven Walker Robison",
                "href": "/profile/RavenWalker-Robison"
            },
            "answer_text": "Thank you for the A2A. his·to·ry /ˈhist(ə)rē/ noun 1. the study of past events, particularly in human affairs.\"medieval European history\"synonyms:the past, former times, historical events, days of old, the old days, the good old days, time gone by, bygone days, yesterday, antiquity; More2. the whole series of past events connected with someone or something.\"the history of Aegean painting\"",
            "date": "Answered August 16, 2019",
            "views": "377",
            "upvotes": " Answer requested by Rebecca Bean",
            "upvoters": [
                {
                    "user_id": "DuanDu",
                    "user_href": "/profile/DuanDu"
                },
                {
                    "user_id": "Tom Stagliano",
                    "user_href": "/profile/Tom-Stagliano"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanay Sahare",
                "href": "/profile/Tanay-Sahare"
            },
            "answer_text": "History is something which is time consuming. Everything happening around you becomes history as time passes by. Example: Now I've been writing the answer to this particular question… which is consuming time. And is being added upto to the things I've done today which had an existence in past time. This is what history is. ",
            "date": "Answered August 4, 2019",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shikha Meena",
                    "user_href": "/profile/Shikha-Meena-14"
                },
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Konrad Rutten",
                "href": "/profile/Konrad-Rutten-1"
            },
            "answer_text": "“Poetry is nearer to vital truth than history.” ― Plato Plato Quotes History is an art form and it’s all a form factual needle work and also, propaganda. History without artistry and feeling is mere squid juice on paper. History is also a wheel that keeps repeating itself. History can also be inspiration and enlightenment , a fine art. ",
            "date": "Answered July 12, 2017",
            "views": "398",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gunda Santhoshi",
                    "user_href": "/profile/Gunda-Santhoshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isha Paroha",
                "href": "/profile/Isha-Paroha"
            },
            "answer_text": "Study, analysis and investigation of the recorded events of the past and document them in a chronological manner. Many displines overlap with history in doing so viz anthropology, sociology, economics, plaeantology etc. Only documented events are considered history. The legends and tales told by generations are not considered history. Doccumentation includes consolidated proofs archaeological or otherwise. ",
            "date": "Answered November 26, 2019",
            "views": "484",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cadence Akins",
                    "user_href": "/profile/Cadence-Akins"
                },
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Lawrence",
                "href": "/profile/Henry-Lawrence-26"
            },
            "answer_text": "History, of course, is the record of the past supported by facts and figures that are unprejudiced, unbiased and unquestionable, which means TRUTHFUL. ",
            "date": "Answered November 18, 2017",
            "views": "473",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sean McHugh",
                    "user_href": "/profile/Sean-McHugh-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Byrne",
                "href": "/profile/Sean-Byrne-18"
            },
            "answer_text": "A collection of historical (past) happenings and instances  deemed important by some. Usually biased or \"swung\" in favour of the person\\people writing it.\" history is written by the victors\". Winston Churchill ",
            "date": "Answered June 28, 2015",
            "views": "441",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anshul Shepherd",
                    "user_href": "/profile/Anshul-Shepherd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Joshi",
                "href": "/profile/Shubham-Joshi-254"
            },
            "answer_text": "So I must tank you for your question.. Here is my favorite answer, a definition that changed the whole perspective on history.. History is the continuous dialogue between Past and Present.. -E H Char ",
            "date": "Answered May 7, 2017",
            "views": "204",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meher Akshay",
                "href": "/profile/Meher-Akshay"
            },
            "answer_text": "History is not learning historical dates and events by heart and recite them by rote;  To 'learn' history means to seek and find the forces which are the causes leading to those effects which we subsequentlyperceive as historical events. (by Adolf hitler) ",
            "date": "Answered May 18, 2015",
            "views": "532",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shivam Mishra",
                    "user_href": "/profile/Shivam-Mishra-3239"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Trevethan",
                "href": "/profile/Lawrence-Trevethan"
            },
            "answer_text": "History is the story of what happened. Not what inevitably had to happen. Not always what was likely to happen. Simply the story of what actually did happen, as a function of the vector sum of choices by many participants, with an element of luck thrown into the mix. ",
            "date": "Answered September 2, 2017",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kaley Garcia",
                "href": "/profile/Kaley-Garcia-1"
            },
            "answer_text": "History is the past and the reasoning of where we are now. Without history, we wouldn't know how some things came to be or why it is there. History is full of many different topics, and they can lead into many different things. Is history relevant to the present? Absolutely. ",
            "date": "Answered January 17, 2018",
            "views": "298",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cameron D. Akins",
                "href": "/profile/Cameron-D-Akins"
            },
            "answer_text": "empires will rise, kingdoms will fall, great people are born, normal people will die, a steady constant way of life with a purpose, wars and battles. inventions and creations, explorations and conquerings! sickness and healing…time. cheers ",
            "date": "Answered November 8, 2017",
            "views": "354",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swapna Pathak",
                    "user_href": "/profile/Swapna-Pathak-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Hague",
                "href": "/profile/David-Hague-16"
            },
            "answer_text": "History is a series of interesting events from the point of view of mankind and if It is Of particular interesting then it will be documented for posterity ! These are a few lesser known moments in History —- David Hague's answer to What are some unseen photos of world history? ",
            "date": "Answered September 30, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Leighman",
                "href": "/profile/Ron-Leighman"
            },
            "answer_text": "Today will become history this time tomorrow. History should be reflected on from time to time for our learning. Even history as far back as to our Founding Fathers. They warned us many times that the government would get too powerful and what we can do to stop it. Read their quotes you’ll see. ",
            "date": "Answered January 18, 2017",
            "views": "560",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siddhant Pandey",
                "href": "/profile/Siddhant-Pandey-64"
            },
            "answer_text": "History is nothing but digging up the past in order to make the present and future better by that I mean - to not repeat the mistakes from the past and learn from those mistakes to make the world a better place to live in. ",
            "date": "Answered July 1, 2017",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noyal David",
                "href": "/profile/Noyal-David"
            },
            "answer_text": "History is basically written history. Everything prior to it is prehistory. When humans started recording their life experiences and ideas in some form of language for future generations, that is when history starts. Currently, the oldest known ‘written’ language was Sumerian (written in cuneiform script) dating back 2600 BCE. ",
            "date": "Answered February 15, 2018",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harsh Dadu",
                    "user_href": "/profile/Harsh-Dadu-1"
                },
                {
                    "user_id": "Sanjana Yadav",
                    "user_href": "/profile/Sanjana-Yadav-34"
                },
                {
                    "user_id": "Neggy M",
                    "user_href": "/profile/Neggy-M"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarvanam Natesan",
                "href": "/profile/Sarvanam-Natesan"
            },
            "answer_text": "History is a collection of events in a country, put in a chronological order. In other words, it is a progress record of a country. What happened when etc. It is to help the future generations to know about that country. ",
            "date": "Answered February 20, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Greg Raines",
                    "user_href": "/profile/Greg-Raines-3"
                },
                {
                    "user_id": "Stephen Kahn",
                    "user_href": "/profile/Stephen-Kahn-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandy Smyth",
                "href": "/profile/Sandy-Smyth-1"
            },
            "answer_text": "History relates to past events as well as the memory, discovery, collection, organization, presentation, and interpretation of information about these events ",
            "date": "Answered December 3, 2019",
            "views": "457",
            "upvotes": " Answer requested by Tony Nyborg",
            "upvoters": [
                {
                    "user_id": "Fatima Motiwala",
                    "user_href": "/profile/Fatima-Motiwala-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sahit Dasaraju",
                "href": "/profile/Sahit-Dasaraju"
            },
            "answer_text": "History etymology Greek: histor (A learned man)Greek:historia (findin out, narrative story)Late Middle English ; history (story of man) It's definition is far more complex though, an umbrella term term used to organize, relate, present events in the past that relates to humans and formation of cultural institutions. ",
            "date": "Answered July 19, 2015",
            "views": "483",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malik Radhey",
                "href": "/profile/Malik-Radhey"
            },
            "answer_text": "History means the past, how people survived,how they lived, what was the life, culture, how they constructed their house and what were the sources of their food,shelter all these things we can come to know, ",
            "date": "Answered May 15, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suman Siwach",
                "href": "/profile/Dr-Suman-Siwach"
            },
            "answer_text": "History is always about the past happenings but it has major role to play. Once you have known what invasion means through history, you will always be aware and prepared to never let it happen again. This is a major contribution to our lives. ",
            "date": "Answered November 2, 2017",
            "views": "258",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert P. Collins",
                    "user_href": "/profile/Robert-P-Collins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prem Prakash",
                "href": "/profile/Prem-Prakash-318"
            },
            "answer_text": "The english word “history “ means the record and documents pertaining to occurrence of events which had impacted the lives of the population at large like natural disasters/calamities/world wars/changes in dynasties/political systems etc. ",
            "date": "Answered July 10, 2018",
            "views": "523",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kashif Anwar",
                "href": "/profile/Kashif-Anwar-24"
            },
            "answer_text": "History is derived from Greek term ‘Historia’ , meaning knowledge acquired by investigation. History is the study of our past. I believe it is a subject which is synonymous to story-telling. HISTORY in itself contains word “STORY”. Hence History tells us the story of people of the past, their economy , occupation , lifestyles , their rulers and battles they fought. ",
            "date": "Answered January 25, 2018",
            "views": "342",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexandr Pumas",
                "href": "/profile/Alexandr-Pumas"
            },
            "answer_text": "I think that history is the key to understanding us, people, and also undrstanding our situation. Also, if you look at the international history, people experiment a lot and it doesn’t always end well. That’s why all people should be educated about our history, so that these mistakes don’t happen again. Unfortunately, prople don’t see the pattern that is repeating and they don’t try to prevent bad events to happen. ",
            "date": "Answered January 8, 2017",
            "views": "621",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vaishali Tyagi",
                "href": "/profile/Vaishali-Tyagi-6"
            },
            "answer_text": "History is a subject in which you study about past. Example: you got to know about past events, civilizations, past administration, past polity, accommodation etc. ",
            "date": "Answered November 9, 2017",
            "views": "284",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suman Verma",
                "href": "/profile/Suman-Verma-178"
            },
            "answer_text": "It is basically the study of the past, how humans and technology as well as civilizations evolved from the ancient times till now. ",
            "date": "Updated January 16, 2019",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun Nagercoil",
                    "user_href": "/profile/Arun-Nagercoil"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirk Callender",
                "href": "/profile/Kirk-Callender"
            },
            "answer_text": "The past as perceived and recorded by the author. ",
            "date": "Answered March 4, 2018",
            "views": "568",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cricket Tv",
                    "user_href": "/profile/Cricket-Tv-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md Shaban",
                "href": "/profile/Md-Shaban-3"
            },
            "answer_text": "History is a science that deals with the events and occurrences attached to proohets,Kings,conquerors and eminent personalities and significant events of the ages past. ",
            "date": "Answered July 1, 2017",
            "views": "200",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Barham",
                "href": "/profile/Robert-Barham-5"
            },
            "answer_text": "Primary sources allow for historians to look at actual information from a time period that is being studied. For example, I am currently working on some research on Bachelors Degrees given in 1979 at my university. I have been going through documents such as yearbooks, newspapers, and attempting conduct interviews. All of those are primary resources. The paper that I will write will be a secondary source. Someone could use my paper as a secondary resource and write their own paper. It is not as realities because I was not actually there. Secondary sources allow for historians to “piggy back” on the research of others. ",
            "date": "Answered April 12, 2020",
            "views": "183",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sami Mirza",
                    "user_href": "/profile/Sami-Mirza-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadaf Fatima",
                "href": "/profile/Sadaf-Fatima-172"
            },
            "answer_text": "Meaning of word history is the things which has been passed along time . To know the things which has been passed there is an subject named history. hope my answer is correct ",
            "date": "Answered May 8, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dofa Bhai",
                "href": "/profile/Dofa-Bhai"
            },
            "answer_text": "History is the study of the human past…. The word 'history' is basically made up of two words:' his' and 'story'.'His' refers to the people of old times and historyis the study of http://past.It is derived from Greek word *ἱστορία* is historia, meaning inquiry.. ",
            "date": "Answered February 1, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Soniya Kumari",
                "href": "/profile/Soniya-Kumari-22"
            },
            "answer_text": "I think tha study of past events particulerly human affairs. The whole series of past events connected with a particular person or things. A continuous topically chronological records of importance or public events or of a particular trends or institutions..... ",
            "date": "Answered November 3, 2017",
            "views": "167",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shawn Banfield",
                "href": "/profile/Shawn-Banfield"
            },
            "answer_text": "History is a window into human culture. It gives us an opportunity to view where we have been. A tool to analyze where we are. A road map of where we should and shouldn’t go. ",
            "date": "Answered August 8, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suchintan Das",
                "href": "/profile/Suchintan-Das"
            },
            "answer_text": "Allow me to endorse the definition of history by the renowned French Historian Emmanuel Le Roy Ladurie \"History is the synthesis of all social sciences turned towards the past.\" ",
            "date": "Answered July 5, 2015",
            "views": "191",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Khushboo Sikri",
                "href": "/profile/Khushboo-Sikri"
            },
            "answer_text": "I think... history is all about the experiences of others.... and it is a result of their succes and failures... history gives the ans of various things which may be useful in various aspects ",
            "date": "Answered August 10, 2015",
            "views": "648",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arthur Foley",
                "href": "/profile/Arthur-Foley-4"
            },
            "answer_text": "You know there isn’t a simple answer to that question. I’m not really sure I can answer it properly. But it has to do with the human journey on this planet. ",
            "date": "Answered April 12, 2020",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Tsirtsis",
                "href": "/profile/Bill-Tsirtsis"
            },
            "answer_text": "Primary sources are important as evidence is in a trial.The important word is evidence.A primary source is some kind of evidence such as an eye witness a photograph a scientific or forensic piece of proof such as DNA tests on old bones.Secondary sources are usually records made after the fact with limited evidentiary value.If we were to look at Hitler's book , “mein kamph” , it would be a primary source about how Hitler viewed things in general but it would only be a secondary source in stating history because Hitler was only giving the reader his own bias opinion about things without any evidence whatsoever.All that we would know for sure by reading , his book is that he hated the Jews.All the history that he cited was baloney. ",
            "date": "Answered April 12, 2020",
            "views": "137",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hugo Ngai",
                "href": "/profile/Hugo-Ngai-1"
            },
            "answer_text": "“History is the study of important past events being recorded in chronological order,” to quote my history textbook from when i started studying history at school. ",
            "date": "Answered July 12, 2018",
            "views": "217",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sam Humphreys",
                "href": "/profile/Sam-Humphreys-5"
            },
            "answer_text": "History is everything that has ever happened before this moment. So it can be ancient History, or recent history. It just cannot be current or future happenings ",
            "date": "Answered January 9, 2017",
            "views": "509",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arden Tom McClure",
                "href": "/profile/Arden-Tom-McClure"
            },
            "answer_text": "Primary sources are written at the time and sometimes even by the participants. They give the events as seen at the time by the people and their contemporaries. Secondary sources are written by thoughtful and well-rounded professionals who have the advantage of hind sight. They tend to know what events gain or lose in importance as seen by later people who are not so directly involved and influenced by the passions associated with many major events. ",
            "date": "Answered April 12, 2020",
            "views": "124",
            "upvotes": " Answer requested by Larry Rivera, Fatima Motiwala and 1 more"
        },
        {
            "author_info": {
                "name": "Mohd Saleem Sayyad",
                "href": "/profile/Mohd-Saleem-Sayyad"
            },
            "answer_text": "History is nothing but a log of important events which had occurred in the past and important people who had played a key role in the past. ",
            "date": "Updated September 13, 2015",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arun Pal",
                "href": "/profile/Arun-Pal-94"
            },
            "answer_text": "Record of past events of importance. History reveals that Britishers always followed the policy of divide and rule. ",
            "date": "Answered May 8, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wes Hancock",
                "href": "/profile/Wes-Hancock-1"
            },
            "answer_text": "Actually, history is what happened in the past, whereas History is the study of the way it has been recorded and the reasons for that recording. Its purpose should be to establish the degree of bias and the reasons for it, so as to learn from its context, and benefit from that experience. ",
            "date": "Answered August 31, 2017",
            "views": "602",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dhariness Raj",
                "href": "/profile/Dhariness-Raj"
            },
            "answer_text": "History is the one because of which present runs and future depends... ",
            "date": "Answered August 9, 2015",
            "views": "386",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Val Gerasenkov",
                "href": "/profile/Val-Gerasenkov"
            },
            "answer_text": "History is everything that happened before this exact second. ",
            "date": "Answered July 3, 2018",
            "views": "210",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Planet Moon",
                "href": "/profile/Planet-Moon"
            },
            "answer_text": "History is the study of people's accounts of events that happened or supposedly happened. It is not the same as what happened in the past as we cannot view the events discussed in history first hand. ",
            "date": "Answered February 6, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jules Otto",
                "href": "/profile/Jules-Otto-1"
            },
            "answer_text": "Depends on the definition of the term, it can have various meanings. Here are a few common usages: As a general term for the pastAs a field of study, concerned with the pastAs the narration of the pastAs a construction of the past that draws on any kind of source from the past",
            "date": "Answered July 1, 2017",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gautam Bharadwaj",
                "href": "/profile/Gautam-Bharadwaj-4"
            },
            "answer_text": "History is a social science of past events. You come to know about famous personalities of the past who contributed societal changes. Story of the past events and personalities is another way of defining history. ",
            "date": "Answered June 28, 2015",
            "views": "256",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dante Alexander Kohrs",
                "href": "/profile/Dante-Alexander-Kohrs"
            },
            "answer_text": "The study of the past. what is history - Google Search ",
            "date": "Answered July 2, 2017",
            "views": "123",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Alice Gomez",
                "href": "/profile/Alice-Gomez-22"
            },
            "answer_text": "History is the past, or past events. It’s what has happened in the last second, minutes, hours, or years. ",
            "date": "Answered October 24, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sally William",
                "href": "/profile/Sally-William-8"
            },
            "answer_text": "History is a branch of social science that deals with what human beings did in the past. It studies: -changes in the development of societies -the political, economical and cultural life of past societies ",
            "date": "Answered October 5, 2019",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dom Verona",
                "href": "/profile/Dom-Verona"
            },
            "answer_text": "The course of human events, always leading to one absolutism. When you don’t learn from it, you often repeat it, wisdom for the ages! ",
            "date": "Answered August 4, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yash",
                "href": "/profile/Yash-217"
            },
            "answer_text": "in simple word it is the study of cause and impact of various event of past (which is based on sources and historian research) ",
            "date": "Answered November 1, 2017",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Hunter",
                "href": "/profile/Bob-Hunter-61"
            },
            "answer_text": "All Sources are important. Primary Sources are your raw material, they are the artefacts of the country and society created at the time of the events being studied. Secondary Sources are important because they contain the opinion of historians who have gone before you (and who, perhaps are more knowledgeable and more skilled than you) ",
            "date": "Answered April 12, 2020",
            "views": "101",
            "upvotes": " Answer requested by Larry Rivera, Fatima Motiwala and 1 more"
        },
        {
            "author_info": {
                "name": "Abhishek Gaur",
                "href": "/profile/Abhishek-Gaur-13"
            },
            "answer_text": "History is a way of learning from the past and so that mistakes could not be repeated. ",
            "date": "Answered May 6, 2014",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Turner",
                "href": "/profile/Thomas-Turner-78"
            },
            "answer_text": "Events that has happened in the past. I wrote that last sentence in history. ",
            "date": "Answered March 4, 2018",
            "views": "210",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shantanu Chaudhari",
                "href": "/profile/Shantanu-Chaudhari"
            },
            "answer_text": "History mean ITIHAS in most of Indian languagues. In Sanskrit ITIHAS mean——- ITI (इति)= THIS HAS( हास ) = HAPPNED. ",
            "date": "Answered July 28, 2016",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Sutton",
                "href": "/profile/Matthew-Sutton-3"
            },
            "answer_text": "History is a narrative used to explain the present, and if insightful enough, to inform our thinking about the future. ",
            "date": "Updated December 23, 2012",
            "views": "385",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Uniac Sachin Hedau",
                "href": "/profile/Uniac-Sachin-Hedau"
            },
            "answer_text": "Questions : What is the meaning of history? “Difference or Gap Betteen the Futures’ & Presents’ happened Events “ ",
            "date": "Answered August 31, 2017",
            "views": "847",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benny Beit-Hallahmi",
                "href": "/profile/Benny-Beit-Hallahmi"
            },
            "answer_text": "http://archaeology.about.com/od/hterms/qt/history_definition.htm ",
            "date": "Answered July 3, 2015",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Chand",
                "href": "/profile/Amit-Chand-95"
            },
            "answer_text": "History is a political subject which includes our fauther ",
            "date": "Answered June 22, 2020",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Farrell",
                "href": "/profile/Mark-Farrell-23"
            },
            "answer_text": "Primary sources are eyewitnesses to history either through personal experiences, writings or witnessing an event. One negative is that people can outright lie or embellish their memories. Secondary sources can be interviewing a primary source account or it could be an interpretation of an artifact or the source material. A negative is interpretations can be incorrect and interviewer can embellish source material. The bottom line is an historian needs both sources to write an accurate account. ",
            "date": "Answered April 12, 2020",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ernest Reaville",
                "href": "/profile/Ernest-Reaville"
            },
            "answer_text": "In my opinion, anyone dim enough to ask this question does not even deserve recognition. ",
            "date": "Answered July 12, 2018",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arun Kumar",
                "href": "/profile/Arun-Kumar-1641"
            },
            "answer_text": "'History' is set of lies agreed upon! Period ",
            "date": "Answered August 6, 2015",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tonicatlas Rugashan",
                "href": "/profile/Tonicatlas-Rugashan"
            },
            "answer_text": "history is a foundation of a future building ",
            "date": "Answered January 8, 2017",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Santosh Kumar",
                "href": "/profile/Santosh-Kumar-10854"
            },
            "answer_text": "the study of past events, particularly in human affairs. ",
            "date": "Answered July 23, 2018",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shilpa Gupta",
                "href": "/profile/Shilpa-Gupta-61"
            },
            "answer_text": "History - Study of past events ",
            "date": "Answered July 10, 2018",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandy Viveiros-Medeiros",
                "href": "/profile/Sandy-Viveiros-Medeiros"
            },
            "answer_text": "anything that happened before today! ",
            "date": "Answered March 4, 2018",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "S. Das",
                "href": "/profile/S-Das-59"
            },
            "answer_text": "I will tell you if you tell me the definition of drfination. ",
            "date": "Answered February 14, 2018",
            "views": "502",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yash Khatri",
                "href": "/profile/Yash-Khatri-40"
            },
            "answer_text": "The events that occurred in past. ",
            "date": "Answered June 11, 2018",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mayank Mithlesh",
                "href": "/profile/Mayank-Mithlesh"
            },
            "answer_text": "All the great thing happen in the past … ",
            "date": "Answered May 26, 2018",
            "views": "110",
            "upvotes": "0"
        }
    ]
}