{
    "title": "What did Genghis Khan use to enable him to father so many children? - Quora",
    "tags": [
        "Genghis Khan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhagwat Shah",
                "href": "/profile/Bhagwat-Shah"
            },
            "answer_text": "Before Geneva convention and the 24x7 New cycle, people didn’t really speak about what happened to women in the ‘losing camp’. Wars are always a brutal affair. Women suffer the most in most wars. Many women lose their menfolk either in the battle or the aftermath of the battle. Rape and slavery were often the lot of women on the losing side of the battle. Rape is often used a ‘weapon of war’, leaving behind children with genetic markers of the invaders. Idea is to father so many children of mixed birth, that they eventually forget their original cultural heritage and adopt the culture of the invaders. This is how Christian and Muslim armies decimated and displaced so many cultures and communities across the world. ISIS used the same tactic in Syria & Iraq recently for exactly the same reason. Mongolian hoard was notorious for rape, pillage and carrying off women as slaves. Even before Genghis Khan, amongst the nomadic tribes of Mongolia, women were often kidnapped and raped even if they were married. Men left their genetic imprint as far-and-wide as they could. Genghis’s own wife and mother were raped and enslaved. Genghis and his troops carried this all across Asia, spreading the Mongolian seed from Russia, China, Iran, Iraq, Afghanistan, the Balkans and beyond. Children of the slave women later became soldiers and spread their genes through another round of rape and pillage. As a result of regular repetition of this terrible cycle, a significant number of people in Aisa have genetic markers of different ethnicities, including Mongolian. ",
            "date": "Updated February 1, 2019",
            "views": "181",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Corneliu Niculescu",
                    "user_href": "/profile/Corneliu-Niculescu"
                },
                {
                    "user_id": "Arun Bhushan Prasad",
                    "user_href": "/profile/Arun-Bhushan-Prasad"
                },
                {
                    "user_id": "Mark Anthony",
                    "user_href": "/profile/Mark-Anthony-307"
                },
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Junius Wisnumurti",
                    "user_href": "/profile/Junius-Wisnumurti"
                },
                {
                    "user_id": "TaeTea",
                    "user_href": "/profile/TaeTea-2"
                },
                {
                    "user_id": "Bozhil Biserov",
                    "user_href": "/profile/Bozhil-Biserov"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Third-Nindum"
                },
                {
                    "user_id": "Anna Sinclair",
                    "user_href": "/profile/Anna-Sinclair-16"
                },
                {
                    "user_id": "Samsul Huda",
                    "user_href": "/profile/Samsul-Huda-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kelly",
                "href": "/profile/John-Kelly-348"
            },
            "answer_text": "That line of crapola about how many people are descended from Temujin—the so-called Genghis Khan, which just means “great king”—is a perfect example of how witless journalists are. No one has specific genetic markers that they can point to and say: “This is the DNA of the Great Khan.” All that can be said is that a great many people are descended from the united tribesmen who were called the Mongols. (Even that term is misleading—Temujin united the tribes within and to the north of the Yellow River loop, and they became known as the Mongols.) So when geneticists were able to demonstrate that a large percentage of the people of Asia had genetic markers which could be described as “Mongolian,” journalists came out with all this claptrap about the descendants of Genghis Khan. He did have more than ten wives, so he fathered quite a few children—but nothing like the numbers implies by journalists, who are only interested in sensational stories. ",
            "date": "Answered July 31, 2017",
            "views": "160",
            "upvotes": " View 657 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Thompson",
                    "user_href": "/profile/Don-Thompson-151"
                },
                {
                    "user_id": "Martin Den Boer",
                    "user_href": "/profile/Martin-Den-Boer"
                },
                {
                    "user_id": "Taimur Qasim",
                    "user_href": "/profile/Taimur-Qasim-2"
                },
                {
                    "user_id": "Dipen Patel",
                    "user_href": "/profile/Dipen-Patel-67"
                },
                {
                    "user_id": "Peter Copley",
                    "user_href": "/profile/Peter-Copley-1"
                },
                {
                    "user_id": "Ray Givan",
                    "user_href": "/profile/Ray-Givan"
                },
                {
                    "user_id": "George Missas",
                    "user_href": "/profile/George-Missas-1"
                },
                {
                    "user_id": "Tulsiram Tiwari",
                    "user_href": "/profile/Tulsiram-Tiwari-1"
                },
                {
                    "user_id": "Max Sharma",
                    "user_href": "/profile/Max-Sharma-28"
                },
                {
                    "user_id": "Thomas Kienholz",
                    "user_href": "/profile/Thomas-Kienholz"
                }
            ]
        }
    ]
}