{
    "title": "What is the difference between a Brahmi script and a Devanagari script? - Quora",
    "tags": [
        "Devnagri",
        "Brahmi",
        "Languages of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajarshi Bandopadhyay (রাজর্ষি বন্দোপাধ্যায়)",
                "href": "/profile/Rajarshi-Bandopadhyay-রাজর্ষি-বন্দোপাধ্যায়"
            },
            "answer_text": "The biggest, most obvious, glaring difference is that Brahmi does not have the horizontal line on the top of each letter as Devanagari does. In fact, this line comes from years of evolution of the Brahmi script into North-Indian script-forms. Here is a sample text in Brahmi:  Here is how the same writing (in Sanskrit) looks when it is written in Devanagari: देवानंपिये पियदसि लाज हेवं अहा As you can see, Devanagari looks a lot more ‘cool’, more standardized, more ‘smart’, more suave, more systematic, and of course more ‘scientific’ as compared to its ancestor. The boundaries between the words is more obvious. The letters are somehow more ‘distinct’. Less are the chances of confusing one consonant for another. Every other letter in the Brahmi text looks like ঢ (Bengali ढ). Also, the implementation of the matras is a little more confusing in the Brahmi script. Here are the Matras, Brahmi[1] :  See how terrible it is? One slip of hand, and का becomes कि, ल becomes ला, and so on. Do realize that progress happens in slow steps with time. Over many, many centuries, our greatest scholars identified the many, many weaknesses of the Brahmi script, and chose to correct them using new innovations. This is how we have the modern Devanagari script - a supreme accumulation of years of research, trial-and-error, and slow, steady progress. Remember that the next time you use the Devanagari script - what we learnt as kids with अ से अनार and आ से आम is the result of centuries of actual progress. Footnotes[1] Ancient Scripts: Brahmi",
            "date": "Answered October 20, 2016",
            "views": "81",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravi Singh Choudhary",
                    "user_href": "/profile/Ravi-Singh-Choudhary"
                },
                {
                    "user_id": "Chiranthan",
                    "user_href": "/profile/Chiranthan-2"
                },
                {
                    "user_id": "P. Akshay Kumar",
                    "user_href": "/profile/P-Akshay-Kumar-1"
                },
                {
                    "user_id": "Ravish Bharti",
                    "user_href": "/profile/Ravish-Bharti"
                },
                {
                    "user_id": "Maya Sharma",
                    "user_href": "/profile/Maya-Sharma-377"
                },
                {
                    "user_id": "Sutapa Das",
                    "user_href": "/profile/Sutapa-Das-83"
                },
                {
                    "user_id": "Ranjit Dash",
                    "user_href": "/profile/Ranjit-Dash-3"
                },
                {
                    "user_id": "Karishma Devi",
                    "user_href": "/profile/Karishma-Devi-2"
                },
                {
                    "user_id": "Navin Kumar",
                    "user_href": "/profile/Navin-Kumar-30"
                },
                {
                    "user_id": "Nobo Raj",
                    "user_href": "/profile/Nobo-Raj-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyansh Khare",
                "href": "/profile/Priyansh-Khare"
            },
            "answer_text": "Brahmi is the ancestor of all Indian scripts, and the oldest known readable Indian script. According to many sources Brahmi itself is possibly a descendent of the even older Indus script because there are many striking similarities between late Indus script symbols and early Brahmi ones, although that script has not been deciphered yet. Anyway, first earliest Brahmi sources and mention of it today are supposedly from around 6th-7th century BC. The actual existing Brahmi is found from Mauryan Empire era onwards. For a time it was the sole script used in India alongside Kharoshthi. Brahmi continued evolving over time. After Mauryan era (if not before already), Brahmi split into two variants, northern and southern, both of whom further kept evolving and further splitting up independently later on and gave rise to modern Indian scripts. Anyway, so northern Brahmi kept moving with time. Over the course of centuries it evolved from a rigid script meant for being inscribed in stone, to a more curved and aesthetic script meant for being written on paper. It slowly changed with influence of various empires like Shunga and Kushana, and the emergence of paper. Brahmi script reached it's final evolutions under Gupta Empire (320-550 AD), a grand classical empire which created a golden age for India where lots of texts were written. Northern India almost completely used this Late Brahmi of 4th and 5th centuries AD. And then Gupta Empire ended, and the Late Brahmi evolution stopped. But it was refined and upgraded, and the result was that immediately three new systems were born from it - Siddham, Sharada and Nagari. Nagari script of 8th century AD was a child system of the Late Brahmi of the Gupta Empire, looked very similar to modern Devanagari and also the other two sister systems it had, however it was a different script. Nagari was extensively used in northern India alongside Sharada (the ancestor of Punjabi, Kashmiri and Sindhi scripts) and Siddham (which faded from India and migrated to China and Japan). Nagari too started evolving slowly, and split into regional variants just like Brahmi had. But by 13th century, it had been reformed and upgraded. By then Nagari had reached it's final form and evolved into the refined Devanagari, which is the most common script in north-central India since then and used to write Hindi and related languages and dialects. So in short words, Devanagari is a successor, no, a more refined version of the 8th century Nagari, which is a descendent of Late (Gupta) Brahmi of 4th and 5th centuries, which is a refined evolution of early Brahmi used in India since 5th century BC and before. Brahmi is the earliest Indian script that can be read, and Devanagari is Brahmi's great, great grandchild who evolved alongside lots of others. One was meant for writing Prakrit and Sanskrit 2,500 years ago, and it's descendent is a product of over 2,500 years of evolution and change, and is mostly used to write Hindi but can write any Indo-European language, in the modern era. ",
            "date": "Updated January 26, 2016",
            "views": "142",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikhil Khude",
                    "user_href": "/profile/Nikhil-Khude"
                },
                {
                    "user_id": "Abhishek Krishnan (अभिषेक कृष्णन) (അഭിഷേക് കൃഷ്ണൻ)",
                    "user_href": "/profile/Abhishek-Krishnan-अभिषेक-कृष्णन-അഭിഷേക്-കൃഷ്ണൻ"
                },
                {
                    "user_id": "Abhijit Parial",
                    "user_href": "/profile/Abhijit-Parial"
                },
                {
                    "user_id": "Ravi Singh Choudhary",
                    "user_href": "/profile/Ravi-Singh-Choudhary"
                },
                {
                    "user_id": "Pranita Singh",
                    "user_href": "/profile/Pranita-Singh-2"
                },
                {
                    "user_id": "Chiranthan",
                    "user_href": "/profile/Chiranthan-2"
                },
                {
                    "user_id": "Pro Magic",
                    "user_href": "/profile/Pro-Magic-1"
                },
                {
                    "user_id": "Sanju Kumar S",
                    "user_href": "/profile/Sanju-Kumar-S-1"
                },
                {
                    "user_id": "Sreedaatree Chaudhuri",
                    "user_href": "/profile/Sreedaatree-Chaudhuri"
                },
                {
                    "user_id": "Mula Nikhil Raj",
                    "user_href": "/profile/Mula-Nikhil-Raj"
                }
            ]
        }
    ]
}