{
    "title": "What are the consequences of the First War of Independence of 1857? - Quora",
    "tags": [
        "Indian Subcontinent Independence War of 1857",
        "Independence",
        "Historical India",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Saprativ Das",
                "href": "/profile/Saprativ-Das-1"
            },
            "answer_text": "The consequences of the First War of Independence or the Revolt of 1857 are described below :- There were open revolt that broke out in Meerut and many other parts of India.Nana Saheb attacked on the British subjects and killed a few but were ineffective because Sir Collin Campbell with a strong relieving force attacked on Nana Saheb in which he was defeated and later escaped while Tantia Tope returned to Kalpi from his escaped place. Sir Collin Campbell always destroyed nearly every movements conducted by the Indian rulers.Rani Lakshmibai conducted the war at Jhansi where Tania Tope joined her. She was killed by Clad who was in a attire of a man . Later, Tantia Tope was caught by the British and was hanged in open public.India came under the direct controll of Queen's Majesty. As a result, the Governor of British got the additional title of Viceroy.Queen Victoria made a few solemn promises to the Indians.Queen Victoria also made the promise to not interfere with the religious beliefs and the related matters of India.The British troops and artilleries were increased and the number of Indians were reduced. The high post in the army were also exclusively reserved for the British .Queen Victoria made an official pardon to the Indians excepting those who were guilty in the murder of the British subjects.The mass movements and planning against the British were crushed.Many reforms were introduced later by the British.The British ruled relentlessly for the next 90 years in India where they later faced many hardships and ultimately quit India in 1947 and thus we got freedom.These incidents will forever be written in the history of India and will continue to inspire billions of the Indians to love our leaders and mother nation . Thanks for reading!!! Please do upvote if you like. Jai Hind !!! ",
            "date": "Answered April 8, 2020",
            "views": "19",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "School Time SHG",
                    "user_href": "/profile/School-Time-SHG"
                },
                {
                    "user_id": "Komal Nisar",
                    "user_href": "/profile/Komal-Nisar-7"
                },
                {
                    "user_id": "Debabrata Das",
                    "user_href": "/profile/Debabrata-Das-601"
                },
                {
                    "user_id": "Mateen SA",
                    "user_href": "/profile/Mateen-SA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ganesh Raam",
                "href": "/profile/Ganesh-Raam-1"
            },
            "answer_text": "The coalition forces lead by Maratha and Mughal Empires and all other kingdoms were defeated by the British East India Company with the help of 21 princely states that were loyal to them. The result – India was no more controlled by British East India Company.India came under the direct control of the British crown.Kingdoms that were loyal to the British Crown, were allowed rule under the Queen's name.Queen Victoria was proclaimed as the Empress of India. All of India became her subjects.The feeling and need to revolt was crushed for the next 50 years.Brought down India’s contribution of world GDP from 25% to less than 2%.Made India an offshore resourcing space to fight British wars around the world.Contributed to tens and hundreds of famines throughout the country. Bengal being the worst hit.Contributed to the racial/class/caste/religious divide.In all the defeat of 1857 contributed to the ruining of India for close to 90 years of slave and servitude attitude. Well, in some sense, it continues even today… ",
            "date": "Answered December 27, 2017",
            "views": "84",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdullah Yusuf",
                    "user_href": "/profile/Abdullah-Yusuf-47"
                },
                {
                    "user_id": "Seemal Imran",
                    "user_href": "/profile/Seemal-Imran-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/HARI-PRASATH-1324"
                },
                {
                    "user_id": "Zara Rashid",
                    "user_href": "/profile/Zara-Rashid-15"
                },
                {
                    "user_id": "Ahsan Ali Memon",
                    "user_href": "/profile/Ahsan-Ali-Memon-6"
                },
                {
                    "user_id": "Sidra Amjad",
                    "user_href": "/profile/Sidra-Amjad-7"
                },
                {
                    "user_id": "Denim Rai",
                    "user_href": "/profile/Denim-Rai-1"
                },
                {
                    "user_id": "Harshit Mishra",
                    "user_href": "/profile/Harshit-Mishra-139"
                },
                {
                    "user_id": "Inder Mohini Chadha",
                    "user_href": "/profile/Inder-Mohini-Chadha"
                },
                {
                    "user_id": "Chirag Chandnani",
                    "user_href": "/profile/Chirag-Chandnani-5"
                }
            ]
        }
    ]
}