{
    "title": "What are the reasons why people say Ancient Greeks were black? - Quora",
    "tags": [
        "Were X Black?",
        "Ancient Greece",
        "Ancient Civilizations",
        "Black People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Boyle",
                "href": "/profile/Justin-Boyle-6"
            },
            "answer_text": "This is fringe idea among black nationalists or black supremacists.The problem started in the 19th century, and it revolves around the fact that Africa's history is mostly unknown to us. Sub-Saharan Africa never developed advanced civilizations like you saw in Egypt, Sumer, Greece, etc. Many people believed that more advanced = more civilized = better, and although this is an utterly stupid idea it is nonetheless an idea some people have.Slavery was often justified in earlier generations through the argument that black people were 'inherently' inferior. As evidence of this inherent inferiority, people pointed out that Africa had no advanced civilization. (Again, dumb, but I'm just relating what someone else said) This argument needed to be disproven. Some people fixated on the possibility that certain advanced civilizations (such as the Egyptians) were located in Africa and probably had black people among them. They decided to claim Egypt as being 'black' (based upon scant evidence) because it advanced the idea that blacks were not inferior and slavery was, therefore, wrong.These kinds of ideas continued to fester into the 20th century. They were promoted by organizations such as the Nation of Islam and repeated by black nationalists like Malcom X. The Nation of Islam was/is a radical black supremacist organization that promoted a pseudo-religious myth in which black people were the first and best people on Earth. Now, there is great evidence that humanity originated in Africa, but the Nation's version of this story is pretty out there. (Worth a Google, if you're bored)Throughout most of America's history, white oppressors denied the possibility of black history or black identity. Schoolchildren were not taught African history, and black Americans did not inherit any history or culture from their ancestors. Not because Africa lacks historical records (sadly true) but because whites did not want blacks to know they had a homeland. I recall reading an excerpt from Malcom X in which he relates his shock and amazement when he discovered that Africans belonged to their own continent and culture. It allowed him to understand his identity and his place in the world, because he was now rooted in a culture that was understandable. If he had stopped there, he would have been doing alright. But he went on to repeat the claim of black Egyptians, not because the claim was grounded in historical evidence but rather because it filled an emotional need inside him. And that's really the point of it all. Africans have little in the way of recorded history, so some people compensate by trying to appropriate the cultures of others. I've heard the same thing about ancient Carthage, and also about both sides of the Trojan War. I once heard someone claim that the Greek shield-spear combination described in antiquity was in fact referring to the Zulu's assegai and nguni. This is a completely asinine idea devoid of evidence, but people continue to repeat it because it gives them emotional satisfaction and validation to believe they are descended from notable people. I can understand that black Americans had their own identity stolen and suppressed, and that is tragic and unforgivable. However, this fact does not give them license to appropriate other people's history in order to compensate. ",
            "date": "Answered August 23, 2017",
            "views": "97",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jone Orfanakhs",
                    "user_href": "/profile/Jone-Orfanakhs"
                },
                {
                    "user_id": "Jami Sundvall",
                    "user_href": "/profile/Jami-Sundvall"
                },
                {
                    "user_id": "Jennifer Booth",
                    "user_href": "/profile/Jennifer-Booth-83"
                },
                {
                    "user_id": "Ivan Jung",
                    "user_href": "/profile/Ivan-Jung-5"
                },
                {
                    "user_id": "Antonín Horný",
                    "user_href": "/profile/Antonín-Horný"
                },
                {
                    "user_id": "Tiffany Tiffany",
                    "user_href": "/profile/Tiffany-Tiffany-131"
                },
                {
                    "user_id": "Michael Loizides",
                    "user_href": "/profile/Michael-Loizides-1"
                },
                {
                    "user_id": "Cyril Daoud",
                    "user_href": "/profile/Cyril-Daoud"
                },
                {
                    "user_id": "Sonya Ataou",
                    "user_href": "/profile/Sonya-Ataou"
                },
                {
                    "user_id": "Filippo Maccani",
                    "user_href": "/profile/Filippo-Maccani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ral Cheva",
                "href": "/profile/Ral-Cheva"
            },
            "answer_text": "The ancient Greeks had skin of a light colour. Please, see how 23andMe define skin colour (this is not the same as race):  So, light or dark skin are very broadly defined by science. It is a large number of genes that affect our skin tone and scientists are not 100% sure which ones exactly and how they interact to give a final result. So this is how dark an indigenous European would have been 10,000 years ago.  So far a total of 3 migrations into Europe have been identified which contributed to the formation of the present population. It is thought that the last 2 brought genes for light coloured skin to the continent: the one from East Asia and the one from the Middle East. So, a European’s skin can be lighter or darker depending on how many of those genes s/he would have as well as environmental factors. It has been found that simply living in Europe makes the skin 5% lighter with every generation. Therefore, people’s skin colour depends on the geography they are from and the extent to which that particular area was affected by the aforementioned migrations. So, Greeks for example could have the full set of genes brought over by Middle Eastern migrants but not necessarily that many of those brought over from East Asia. I think that how you perceive the appearance of the average Greek depends on your background. As far as the scientific classification by 23andMe goes, I think that the overwhelming majority of Greeks would fall into the light-skinned category, if not all. Why some people think that ancient Greeks were black? As others have answered, politics and agendas. We are in a position to know exactly what the ancient Greeks looked like because they left a multitude of sculptures and mosaics depicting themselves:      ",
            "date": "Updated November 4, 2019",
            "views": "13",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Lestrange",
                    "user_href": "/profile/Matt-Lestrange"
                },
                {
                    "user_id": "Jami Sundvall",
                    "user_href": "/profile/Jami-Sundvall"
                },
                {
                    "user_id": "Justin Hoskins",
                    "user_href": "/profile/Justin-Hoskins-8"
                },
                {
                    "user_id": "Austin Fairley",
                    "user_href": "/profile/Austin-Fairley-1"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Clarence Uhrich",
                    "user_href": "/profile/Clarence-Uhrich"
                }
            ]
        }
    ]
}