{
    "title": "What inventions did the Mayans make? - Quora",
    "tags": [
        "Maya Civilization"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harun",
                "href": "/profile/Harun-59"
            },
            "answer_text": "The ancient Maya civilization existed in present-day Mexico and Central America from 2600 BC until the Spanish arrived in the 16th century. Part of the Mesoamerican culture, which included various indigenous tribes in the region, the Maya made important discoveries in the areas of science and cosmology which enabled them to create a complex calendar system. They were gifted designers and architects who built grand structures including royal residences, galactic observatories, sanctuary pyramids, straight roads, and canals. The Maya also invented elastic a long time before the process of vulcanization Ball Courts  The Maya loved their games, and had ball courts in every city, much like present-day stadia. The games were of extraordinary significance to the Maya and were frequently played during religious celebrations, lasting for up to 20 days. The courts were situated at the foot of sanctuaries to pay tribute to the gods and goddesses. Ball courts were expansive, each with a stone hoop mounted on a divider at one side. The Maya loved one particular game called pok-a-tok, or hotchpotch, the aim of which was to throw a strong elastic ball through the hoop using just your hips, shoulders, or arms. The victors regularly won the belongings of the losing side. The losing side, regularly made up of prisoners, was relinquished for the sake of the Maya gods. ",
            "date": "Answered June 21, 2020",
            "views": "343",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fran Jaime Rivera",
                "href": "/profile/Fran-Jaime-Rivera"
            },
            "answer_text": "An exact long count calendar that ran uninterrupted for 5,125 years, and ended in 2012. It reset immediately.  A number system based on 20, which included the concept of zero. (My kids learned it in grade school, here in Mexico, along with Roman numerals).  A form of writing, where pictures represented sounds.  *All pictures are from Google. ",
            "date": "Answered June 22, 2020",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eduardo Sánchez",
                    "user_href": "/profile/Eduardo-Sánchez-11"
                }
            ]
        }
    ]
}