{
    "title": "What is the most important moment in history to ever be captured on film? - Quora",
    "tags": [
        "History of Film",
        "Moments",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "A. Bowdoin Van Riper",
                "href": "/profile/A-Bowdoin-Van-Riper"
            },
            "answer_text": "It’s a three way tie for me: Liberation of the Nazi camps by Allied troops at the end of WWIIDetonation of the first atomic bomb on July 16, 1945Demolition of the Berlin Wall by hammer-wielding crowds in 1989. . . and it’s worth noting that the relation of the camera to the event is different in each of the three cases. The film of the atomic bomb test is simply a record of the event. It’s a statement that “this happened”—a ”documentary” film in the most literal sense. The film of the camps was shot as an act of bearing witness: not just a record that “this happened” but a statement that “a monstrous evil was being committed here, and we put an end to it.” The demolition of the wall was a powerful symbolic act carried out (and filmed) by people who were both—at some level—aware that its power stemmed from the fact that it was being filmed. ",
            "date": "Answered March 8, 2019",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alistair Thompson",
                    "user_href": "/profile/Alistair-Thompson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Scott",
                "href": "/profile/Barry-Scott-98"
            },
            "answer_text": "The liberation by the Allies of the concentration camps towards the end of World War II. There is plenty of footage available. The emaciated survivors, bodies stacked up like wood, the thousands of bodies that had to be put into mass graves, the ovens…….pray God no ‘revisionism’ of those events ever takes hold, and may the archives keep that footage safe for ever and ever. ",
            "date": "Answered March 6, 2019",
            "views": "184",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "A. Bowdoin Van Riper",
                    "user_href": "/profile/A-Bowdoin-Van-Riper"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                }
            ]
        }
    ]
}