{
    "title": "What times of technology had a large impact on society? - Quora",
    "tags": [
        "Social Impact",
        "History of Technology",
        "Impact",
        "Sociology of Everyday Life",
        "Sociology",
        "Technology Trends",
        "Society",
        "Technology",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitish Bhardwaj",
                "href": "/profile/Nitish-Bhardwaj-584"
            },
            "answer_text": "Our society is completely dependent on technology due to the growing trend of digitization. Now technology and human life cannot be separated. The regular and widespread use of technology has also had an impact on the needs and demands of the population. Technology can be used to perform different and routine tasks in a person's life, including travel, communication, learning, business, or comfort. However, people are increasingly concerned about the increased use of technology even after its many benefits. The inappropriate application of technology has led to further pollution of the environment, posing a serious threat to the life and property of members of society. It requires appropriate and meaningful use of technology. People face the greatest challenge of determining the future by creating relevant technologies to simplify our tasks. It has become very difficult to analyze the impact created in our lives by some advanced technologies introduced. People, the environment and society have also had an impact through the increased use of technology. The methods of using the technology determine whether it will create positive or negative effects. ",
            "date": "Answered September 4, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}