{
    "title": "What are the major differences between the 1960 and 1963 constitutions of Nigeria? - Quora",
    "tags": [
        "Constitutions",
        "Nigeria"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adewale Eke",
                "href": "/profile/Adewale-Eke"
            },
            "answer_text": "A constitutional conference was convened in 1960 in order to deliberate on the draft of the independent constitution. The conference ratified the decision of the House of Assembly of southern Cameroon to cease to be part of Nigeria at independence and also approved the independence of Nigeria with full responsible status within the commonwealth effective from October 1, 1960. With the independence constitution both the federal and regional governments operated the bi-camera westminister model of parliamentary system of government; with a House of Representatives and a Senate. The Queen remained the head of state represented by a Governor General in the person of Azikiwe – the first and only indigenous Governor General of Nigeria. Under this constitution, if there was a conflict between regional and federal laws, the regional law was rendered null and void. Following the defects of the independence constitution, the republican constitution was promulgated in 1963 through a process which was under the aegis of the national assembly. This constitution abolished the monarchical rule and gave Nigeria a republican status. The novel feature of this constitution was that the Privy Council seized to be the highest court of appeal and it relinquished it’s hitherto position to the supreme court of Nigeria, which became the highest court of appeal. This constitution laid down the procedure for the creation of more regions and states and consequently, the mid-western region was created on August 9, 1963. Under this constitution, the revenue allocation formula adopted was based on need and national interest. ",
            "date": "Answered July 2, 2016",
            "views": "266",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "COMEPASS PRE-VARSITY",
                    "user_href": "/profile/COMEPASS-PRE-VARSITY"
                },
                {
                    "user_id": "Funke Daniel",
                    "user_href": "/profile/Funke-Daniel"
                },
                {
                    "user_id": "Adaeze Ifeacho",
                    "user_href": "/profile/Adaeze-Ifeacho-1"
                },
                {
                    "user_id": "Paul Scott",
                    "user_href": "/profile/Paul-Scott-423"
                },
                {
                    "user_id": "Samuel Mayor",
                    "user_href": "/profile/Samuel-Mayor-3"
                },
                {
                    "user_id": "Onyebuchi Uchenna",
                    "user_href": "/profile/Onyebuchi-Uchenna-1"
                },
                {
                    "user_id": "Ken Okohe",
                    "user_href": "/profile/Ken-Okohe"
                },
                {
                    "user_id": "Owen Duruike",
                    "user_href": "/profile/Owen-Duruike"
                },
                {
                    "user_id": "Gabriel Williams",
                    "user_href": "/profile/Gabriel-Williams-100"
                },
                {
                    "user_id": "Owegbe Cosmos",
                    "user_href": "/profile/Owegbe-Cosmos-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adedoyin Giwa",
                "href": "/profile/Adedoyin-Giwa"
            },
            "answer_text": "The major difference between 1960 and 1963 is that it was parliamentary system of government where they have two head of government which are head of state and head of government and is based under the rules of the British government which is the queen of England while 1963 is attainment of getting real independent without the interference of any country or state it is known as republican system of government ",
            "date": "Answered May 31, 2018",
            "views": "58",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bolu Bajomo",
                    "user_href": "/profile/Bolu-Bajomo"
                },
                {
                    "user_id": "Igwe Johnson",
                    "user_href": "/profile/Igwe-Johnson-3"
                },
                {
                    "user_id": "Oyetade Tolulope",
                    "user_href": "/profile/Oyetade-Tolulope-2"
                },
                {
                    "user_id": "Itsado Precious",
                    "user_href": "/profile/Itsado-Precious"
                },
                {
                    "user_id": "Esther Okeke",
                    "user_href": "/profile/Esther-Okeke-5"
                }
            ]
        }
    ]
}