{
    "title": "What do Confederate monuments stand for? - Quora",
    "tags": [
        "Monuments and Memorials of the Confederate States",
        "Removal of Confederate Monuments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Burkhalter",
                "href": "/profile/Karl-Burkhalter-1"
            },
            "answer_text": "The courage and gallantry of the Confederate soldier and the nobility of Confederate ideals. One million Freedmen starved to death under Union Contraband Policy before Confederates were allowed to vote. The South was burdened with crippling tariff until 1913 and forced to pay reparations. The RRs charged punitive Freight rates into the 1950s. Several generations Black and White suffered from malnutrition and vitamin deficiency. Our schools and libraries were burned and could not be replaced. The generation that erected the Statues were trying to preserve some vestige of dignity. Blacks like Mississippi Legislator John F Harris openly supported them. B.T. Washington raised money for the statues. These pseudo-historians resurrected\"Wave the Bloody Shirt\" political rhetoric as fact to forward their Political Agenda even though no less a Black Leader as Hiram Revels complained about it as divisive and disingenuous. The Monument represent the struggle of the Postbellum generation as much as the War. “One argument used by those wanting to remove Confederate statues is that contemporary blacks had little chance to oppose them when they were erected. Aside from anecdotal evidence that blacks joined white crowds to observe the dedication ceremonies, one example in Mississippi provides undeniable evidence of explicit high-level black support.  In 1890 the Mississippi legislature voted on a bill to appropriate $10,000 for a Confederate monument. The vote in the lower chamber was 57-to-41 in favor. All six black representatives voted “yea.” One, John F. Harris, made a supporting speech excerpted below prior to the vote: ‘Mr. Speaker! I have risen here in my place to offer a few words on the bill…I was sorry to hear the speech of the young gentleman from Marshall County. I am sorry that any son of a soldier should go on record as opposed to the erection of a monument in honor of the brave dead. And, sir, I am convinced that had he seen what I saw at Seven Pines and in the Seven Days’ fighting around Richmond, the battlefield covered with the mangled forms of those who fought for their country and for their country’s honor, he would not have made that speech….When the news came that the South had been invaded, those men went forth to fight for what they believed, and they made no requests for monuments…But they died, and their virtues should be remembered.’ Sir, I went with them. I too wore the gray, We stayed four long years, and if that war had gone on till now I would have been there yet….I want to honor those brave men who died for their convictions.” The Deadly History Of This Infamous Site In Mississippi Is Terrifying But True He knew about Devil's Punch-bowl, do you? Via Eve Davenport Holder - The truth is it was not war. It was hell unleashed on Southern civilians, non-combatants, citizens who were defenseless; women, innocent children, and unarmed old men. \"It is with the greatest reluctance that I write this sketch of my mother's experience... If those who have urged me so much and so often to write, knew what I have suffered in putting those sad particulars on paper, they would have said, \"let them alone.\" Those who have undertaken to gather reminiscences of this kind have a hard task on their hands as one thousandth part of what the women of the South suffered during the war can never be told. It is a duty, however, that the authors of these reminiscences should be aided in every possible way, so that valuable materials of history may not be lost. This is why I send my crude statements, though it is breaking my heart to do so. Our home was in a little town on the Arkansas River, called Pittsburg, about nine miles from Clarksville. The federal officer in command of occupied Clarksville at the time was Col. Waugh. One federal officer called and said to me, \"If my wife or mother had been treated as yours, I would live only to kill federals and when I came to die, I would regret that I could not live longer to kill more.\" The following are the main particulars: On the night of the 20th of February 1864, five or six federal soldiers came and demanded money of mother, saying, \"I know you have it, every one knows that your husband has plenty of money.\" When she refused to give them money, they stripped the right foot and leg and thrust it into a bed of red-hot coals lying in a large open fireplace. When they took it out they asked her if she would tell them where the money was, and when she said no, they put it back and told her they would burn her to death if she did not tell. The flesh was cooked until it fell off from the knee to the toe. They then brought in my widowed aunt, Mrs. John W. Willis, who was living with my mother. They had been keeping her outside on the lawn and had previously told her that my mother had sent her word to tell them where the money was, as they were burning her to death. She said she did not believe them and refused. They then took my mother from the fire and put my aunt in and burned her in the same way, but not quite so severely. At last when they found they were of the material from which heroines are made and Spartan mothers reared, they released them and going to the servants quarters, they locked them in and told them if they came out before sun up, their heads would be shot off. My poor mother in some way found the linseed oil and together she and my aunt dressed their burns. When mother and aunt learned that the house was on fire, they in some mysterious way with those terribly burned limbs crawled to the wood pile where they lay and watched the destruction of a fine old Southern home (the home where brother John and I were reared). When the building was falling into ashes, some federal officers came with ambulances to fill them with furnishings from this house. When they saw the sad plight of my loved ones, they were compelled to take them to Clarksville where they could receive medical attention. A week after this terrible affair, Capt. Abbot commanding a U.S. transport (but a Southern sympathizer) came down from Clarksville and sent me word, saying that he had not the courage to bring the message in person. Capt. Abbot held the transport until I could get ready to return with him. I left my four fatherless children (baby being quite ill) with my dear friend, Mrs. Adams, widow of ex-Governor Adams, was afterwards with me in Little Rock, having been turned out of her home by federal officers. It took the transport three days to reach Spadra Bluff, the nearest point by river to Clarksville. I was told here that mother was dying and that her limb had been amputated, all of which was almost unbearable for me and the suffering so changed me that some of my loved ones did not recognize me. I must pass over the meeting with my mother; I cannot even at this late day write of it. I staid until my mother could be moved to Spadra Bluff by ambulance, and by transport to my home in Little Rock. The news soon spread that we had arrived. The first to reach the boat was our old friend, Dr. E.L. Dodge. He dropped on his knees beside mother's bed and wept aloud. Mother did not die just at this time but lingered two years. Poor, dear mother, how she suffered! \"I forgive them for the pain and poverty they have caused me,\" were her words. They destroyed what they could not carry away, shooting large numbers of cattle, hogs, etc. Maj. Newsome (a federal) told me at Spadra that when mother's house was on fire he counted fourteen others burning at the same time, and he knew that orders for the fires had been sent out from headquarters.\" CONFEDERATE WOMEN OF ARKANSAS 1861-1865 Compiled and published by Arkansas United Confederate Veterans 1907  ",
            "date": "Updated September 3, 2020",
            "views": "136",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Scott",
                    "user_href": "/profile/Tom-Scott-311"
                },
                {
                    "user_id": "Eddie Stephens",
                    "user_href": "/profile/Eddie-Stephens-8"
                },
                {
                    "user_id": "Michael Williams",
                    "user_href": "/profile/Michael-Williams-802"
                },
                {
                    "user_id": "Russell Person",
                    "user_href": "/profile/Russell-Person"
                },
                {
                    "user_id": "Geoff Hoppe",
                    "user_href": "/profile/Geoff-Hoppe-1"
                },
                {
                    "user_id": "Beni Habibi",
                    "user_href": "/profile/Beni-Habibi"
                },
                {
                    "user_id": "Vance Harris",
                    "user_href": "/profile/Vance-Harris-3"
                },
                {
                    "user_id": "David E. Webb",
                    "user_href": "/profile/David-E-Webb"
                },
                {
                    "user_id": "Vern Padgett",
                    "user_href": "/profile/Vern-Padgett"
                },
                {
                    "user_id": "J.B. Ellis",
                    "user_href": "/profile/J-B-Ellis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Hopkins",
                "href": "/profile/Jim-Hopkins-43"
            },
            "answer_text": "Let’s see what we can find… A lot were put up by the United Daughters of the Confederacy. Mrs I W Faison, President of that august group, stated “The work of the United Daughters of the Confederacy is not based on sentiment alone, as the records of our work will show. Our main objects are memorial, historical, benevolent, educational and social. We are building monuments of bronze and marble to our noble Confederate dead as an inspiration to future generations. We have built and assisted in building all over the South, monuments in the form of Soldiers Homes, Hospitals, Memorial Halls and Schools for descendants of our Confederate soldiers, in whose veins flow pure Anglo Saxon blood, who otherwise could not be educated.” The group behind Confederate monuments also built a memorial to the Klan Julian Carr speech at the Dedication of the Silent Sam memorial, June 2, 1913: “The present generation, I am persuaded, scarcely takes note of what the Confederate soldier meant to the welfare of the Anglo Saxon race during the four years immediately succeeding the war, when the facts are, that their courage and steadfastness saved the very life of the Anglo Saxon race in the South – When “the bottom rail was on top” all over the Southern states, and to-day, as a consequence the purest strain of the Anglo Saxon is to be found in the 13 Southern States – Praise God.” Transcription: Carr Speech This from the account of Governor Kitchin dedicating a monument in 1909: “This proud race, to which the Confederate veteran belongs, has encountered many obstacles in its upward march; it has encountered other races, but its superiority has ever been demonstrated under anything like fair circumstances. He told what the race had accomplished, after contact with the other races of every other color, no race ever being able to impede the onward march of the white race. He was glad many of the veterans had lived to see the day “when the world is beginning to appreciate that it is not in the power of all the armies ever drilled or any constitution ever written to make the white man and the black equal on this earth” So long as the descendants of the Confederate veterans control the destinies of the land they will be controlled in peace.” [Corner stone of Confederate monument laid] : United Daughters of the Confederacy. Granville Grays Chapter (Oxford, N.C.) : Free Download, Borrow, and Streaming : Internet Archive So…what do you think those that put up the monuments thought they stood for? ",
            "date": "Answered October 14, 2020",
            "views": "37",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kinyanjui Kamau",
                    "user_href": "/profile/Kinyanjui-Kamau"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                }
            ]
        }
    ]
}