{
    "title": "What are the symptoms of leprosy? - Quora",
    "tags": [
        "Leprosy",
        "Medical Symptoms",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajesh Batlish",
                "href": "/profile/Rajesh-Batlish"
            },
            "answer_text": "Symptoms which characteristically distinguish Leprosy from others are Loss of sensation with hypopigmented lesions on the face and back , thickening of nerves esp Ulnar and Popliteal . Once the disease progresses , it becomes obviously disfiguring like madarosis,collapsed bridge if nose,ulcers,autoamputation of fingers etc. Unfortunately, the early signs and symptoms of leprosy are very subtle and occur slowly (usually over years). The symptoms are similar to those that may occur with syphilis, tetanus, and leptospirosis. The following are the major signs and symptoms of leprosy: Numbness (among the first symptoms)Loss of temperature sensation (among the first symptoms)Touch sensation reduced (among the first symptoms)Pins and needles sensations (among the first symptoms)Pain (joints)Deep pressure sensations are decreased or lostNerve injuryWeight lossBlisters and/or rashesUlcers, relatively painlessSkin lesions of hypopigmented macules (flat, pale areas of skin that lost color)Eye damage (dryness, reduced blinking)Large ulcerations (later symptoms and signs)Hair loss (for example, loss of eyebrows)Loss of digits (later symptoms and signs)Facial disfigurement (for example, loss of nose) (later symptoms and signs)This long-term developing sequence of events begins and continues on the cooler areas of the body (for example, hands, feet, face, and knees). ",
            "date": "Answered January 7, 2017",
            "views": "760",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shahara Begum",
                    "user_href": "/profile/Shahara-Begum-2"
                },
                {
                    "user_id": "Leah Tracy",
                    "user_href": "/profile/Leah-Tracy-3"
                },
                {
                    "user_id": "Sreedeep Kumar",
                    "user_href": "/profile/Sreedeep-Kumar-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pratik Satalkar",
                "href": "/profile/Pratik-Satalkar-1"
            },
            "answer_text": "Leprosy primarily affects the skin and the nerves outside the brain and spinal cord, called the peripheral nerves. It may also strike the eyes and the thin tissue lining the inside of the nose. The main symptom of leprosy is disfiguring skin sores, lumps, or bumps that do not go away after several weeks or months. The skin sores are pale-colored. Nerve damage can lead to: Loss of feeling in the arms and legsMuscle weaknessIt usually takes about 3 to 5 years for symptoms to appear after coming into contact with the leprosy-causing bacteria. Some people do not develop symptoms until 20 years later. The time between contact with the bacteria and the appearance of symptoms is called the incubation period. Leprosy's long incubation period makes it very difficult for doctors to determine when and where a person with leprosy got infected. ",
            "date": "Answered September 16, 2017",
            "views": "501",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Janine White",
                    "user_href": "/profile/Janine-White"
                },
                {
                    "user_id": "Aditya Vitekar",
                    "user_href": "/profile/Aditya-Vitekar"
                }
            ]
        }
    ]
}