{
    "title": "What is the difference between the NVA and Viet Cong? - Quora",
    "tags": [
        "People's Army of Vietnam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preston Ingalls",
                "href": "/profile/Preston-Ingalls-1"
            },
            "answer_text": "As explained in the responses here, the North Vietnamese (NVA or PAVN) were the formal army of North Vietnam while the Viet Cong (short for Vietnamese Communist) was the guerrilla Army of South Vietnam. Actually, the Viet Cong was formed from the remnants of the Viet Minh who had successful fought the French. Many pro-communists Viet Minh were sent South when the country was split by UN vote to lie low until called upon to start an insurrection. The pro-nationalist elements but anti-communists segments of the Viet Minh had been murdered shortly after 1954 to form a complete communist insurrection. I fought both and the Viet Cong were hit and run tactics and less able to sustain a prolonged siege than the NVA. The NVA were better trained and supplied than the VC. The VC were pretty well decimated during the 1968 Tet Offensive losing much of their cadre in the failed attempt to take provincial capitals along with their disastrous assault on Saigon and Colon. Here are some illustrations of the uniform and equipment of both. The VC is on the left while the PAVN or NVA is on the right.  ",
            "date": "Answered June 20, 2018",
            "views": "148",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lâm Hoàng Nguyễn",
                    "user_href": "/profile/Lâm-Hoàng-Nguyễn"
                },
                {
                    "user_id": "Camarillo Rap Star",
                    "user_href": "/profile/Camarillo-Rap-Star"
                },
                {
                    "user_id": "Rich Repore",
                    "user_href": "/profile/Rich-Repore"
                },
                {
                    "user_id": "John Ye",
                    "user_href": "/profile/John-Ye-3"
                },
                {
                    "user_id": "Carl Liu",
                    "user_href": "/profile/Carl-Liu-41"
                },
                {
                    "user_id": "Jeff Hemmen",
                    "user_href": "/profile/Jeff-Hemmen-1"
                },
                {
                    "user_id": "Allan Lee",
                    "user_href": "/profile/Allan-Lee-142"
                },
                {
                    "user_id": "Gacha Laelynn",
                    "user_href": "/profile/Gacha-Laelynn"
                },
                {
                    "user_id": "Matthew Hawkes",
                    "user_href": "/profile/Matthew-Hawkes-4"
                },
                {
                    "user_id": "Alex Pombo",
                    "user_href": "/profile/Alex-Pombo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don G. Galan",
                "href": "/profile/Don-G-Galan"
            },
            "answer_text": "In theory, the North Vietnamese Army (or NVA) was the regular army (official one) of North Vietnam. The Viet Cong was the derogatory term of the National Liberation Front of South Vietnam (NLF). The NLF was a guerrilla formed mostly by South Vietnamese citizens who opposed the South Vietnamese government (backed by the US), although their number was largely engrossed by thousands of volunteers from North Vietnam. The NVA backed the Viet Cong with weapons, supplies, assessors and, sometimes, with recruits. When, in 1965, the Viet Cong was about to win the war and topple the South Vietnamese government, the US intervened sending combat troops to stop them. The arrival of foreign soldiers in Vietnam prompted the NVA to ‘covertly’ invade the south in support of the Viet Cong with better trained, equipped and armed soldiers. Eventually, in most occasions, the South Vietnamese Army (ARVN) would end up fighting the Viet Cong, while the best US units on the field were sent to fight the NVA or to try to keep it away. ",
            "date": "Answered September 1, 2017",
            "views": "12",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vũ Thị Phong Vân",
                    "user_href": "/profile/Vũ-Thị-Phong-Vân"
                },
                {
                    "user_id": "Tien Nguyen",
                    "user_href": "/profile/Tien-Nguyen-384"
                },
                {
                    "user_id": "Ai Tsurumi",
                    "user_href": "/profile/Ai-Tsurumi"
                },
                {
                    "user_id": "Carl Liu",
                    "user_href": "/profile/Carl-Liu-41"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                },
                {
                    "user_id": "Bao Chi",
                    "user_href": "/profile/Bao-Chi-3"
                },
                {
                    "user_id": "Klaire Hoang",
                    "user_href": "/profile/Klaire-Hoang"
                },
                {
                    "user_id": "Abigail Lorenso",
                    "user_href": "/profile/Abigail-Lorenso"
                },
                {
                    "user_id": "Anh Hoàng",
                    "user_href": "/profile/Anh-Hoàng-37"
                },
                {
                    "user_id": "Lê Văn Dũng",
                    "user_href": "/profile/Lê-Văn-Dũng"
                }
            ]
        }
    ]
}