{
    "title": "What do Russians think of Japan and Japanese people? - Quora",
    "tags": [
        "Russian Ethnicity and People",
        "Japanese Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Artem Bekmam",
                "href": "/profile/Artem-Bekmam"
            },
            "answer_text": " I may surprise many Quorans but Russians are ok with Japan and its people. In Russia Japan is famous for: Electronics and cars. Sony = quality.Lexus = Mercedess. Toyota, Mitsubishi, Nissan, Mazda, Subaru. Even kids are familiar with these brands.My dad, who spent decades of working in car repair business, prefers Japanese cars. In the Far East the majority of Russians prefer to buy a used car from Japan than any other car. My cousin, who lives in Moscow, had a long trip to Vladivostok to buy a car from Japan. Those cars usually cheap and have a good quality. Extremely hardworking people. Russians don’t understand how is it even possible to work so much, to have a cult of a boss, to leave a working place late otherwise a worker is not strive enough. But at the same time Japanese people are respected for this feature by Russians. Japanese culture. Everybody in Russia, at least, has heard such words as “Samurai”, “Bushido”, “Kimono”, “Sake”, “Sushi”, etc. Japanese food. It was extremely popular 10 - 15 years ago and still quite popular nowadays. If you don’t want to spend much money to arrange a party just order some sushi sets from a nearby sushi bar. Russian sushi and rolls are not so Japanese in fact but they are still associated with Japan. Kuril islands dispute. It is not the mainstream in Russia. And it is definitely not the reason for Russians to hate Japan and Japanese people. I never ever heard in my life that someone said he\\she hated Japan and its people. In fact many Russians don’t even know that officially Russia and Japan are still at war. As for me, the most well-known Japanese are Cary-Hiroyuki Tagawa or just Shang Tsung:  and Nobuhiko Takada:  Also Anime is rather popular in Russia but I’m not a fan of this genre of art. When I was a teenager, I prefered Japanese scary movies like “The Grudge” with that broken throat sound.:)  ",
            "date": "Updated October 19, 2020",
            "views": "11",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John McQueen",
                    "user_href": "/profile/John-McQueen-60"
                },
                {
                    "user_id": "Reynold Yong",
                    "user_href": "/profile/Reynold-Yong"
                },
                {
                    "user_id": "Naheyan Muhammad Abrar",
                    "user_href": "/profile/Naheyan-Muhammad-Abrar"
                },
                {
                    "user_id": "Arya Danadipa",
                    "user_href": "/profile/Arya-Danadipa"
                },
                {
                    "user_id": "Toshiyuki Shimono",
                    "user_href": "/profile/Toshiyuki-Shimono"
                },
                {
                    "user_id": "Gilang Putranto",
                    "user_href": "/profile/Gilang-Putranto"
                },
                {
                    "user_id": "Pavel Voloshin",
                    "user_href": "/profile/Pavel-Voloshin"
                },
                {
                    "user_id": "Anil Kumar Koundal",
                    "user_href": "/profile/Anil-Kumar-Koundal"
                },
                {
                    "user_id": "Hilmi Nur",
                    "user_href": "/profile/Hilmi-Nur-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregory Zak",
                "href": "/profile/Gregory-Zak-1"
            },
            "answer_text": "Elements of Japanese culture have been popular here since about mid1980ies to a varying degree. It probably started with sometimes initially underground karate classes. Then they surfaced, and many other martial arts of Japanese origin have been practiced and competed in since. Our president is skilled in judo, which has always been practiced officially. More peaceful pastimes are also known, like origami ot more rare bonsai. Artists seem to know and like Japanese painting. Hokku and haiku have inspired some poets, mostly not very serious. Big cities are full of sushi restaurants and delivery services. You can buy a box of these in mass market chain stores. My female college student made and once showed me her anime cartoons dreaming of an ideal love for a very shy girl. I have heard that a couple of my female former students about 10 years ago took classes of Japanese language at a culture center supervised by the Japanese consulate, and a male student was talking of practicing kendo, fencing. I cannot judge how superficial their acquaintance with your culture is. My is superficial. I like to see beautiful gardens, including the Japanese corner of Saint Petersburg Academy of sciences Botany Garden. I have read Memoirs of a Geisha, but they are Western-written and have been criticised. Japanese authors like Haruki Murakami are known here, and my friend once took me to a circus performance themed on the life of Yukio Mishima. Japanese cars have been loved among middle class as well as Japanese electronics. I was asked 20 years ago by my Russian college penpal from a Russian city on Volga to meet his Japanese fellow student of Russian as a foreign language and English at the central train station coming with his school classmates to take them to a hotel they had booked. I did so and chatted a sort of tour along the way in English. We safely reached their intended hotel room, and only there I discovered that the only person speaking English among these young people was the group leader, the student from Volga. They thanked and gave me two souvenirs - a kind of cup-sized can of sake which must still be sitting somewhere, me being a teetotaler, and a fist-sized ball of a head of Daruma. For the general public Japan is a land of ancient history not terribly well known, modern high technology, popular exotic food etc. We were taught at school of the bloody Russo-Japanese War, the heroic loss in which preceded, and contributed to, the First Russian Revolution of 1905 that led to introduction of some freedoms in the country and convocation of the first parliament on centuries. Tsushima Naval Battle was remembered a lot for heroic loss of Russian battle cruiser Varyag (The Varangian), and another cruiser of that war Aurora stands at its permanent anchorage in central Saint Petersburg , originally preserved for its role in October Revolution of 1917. Another war with Japan, on land, immediately preceded World War II. It is said to secure Japanese non-interference in the USSR conflict with Nazi Germany. The battles lead to the fall of Marshal Vassiliy Blukher and rise of the victorious George Zhukov who 7 years later took Berlin. Soviet troops joined then the USA in 1945 to free China and Korea. One of the Japanese prisoners of war married a Russian teacher of English and they had a daughter who studied to become a well-known economist and a 1990ies liberal political activist, got elected three times to the lower house of Russian parliament where she became a vice-chair. She writes, teaches, broadcasts. Irina Khakamada - Wikipedia ",
            "date": "Updated September 6, 2019",
            "views": "843",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chan Kah Wai",
                    "user_href": "/profile/Chan-Kah-Wai-1"
                },
                {
                    "user_id": "Arissa Mang",
                    "user_href": "/profile/Arissa-Mang"
                },
                {
                    "user_id": "Emanuel Leung",
                    "user_href": "/profile/Emanuel-Leung"
                },
                {
                    "user_id": "Ko Inagaki",
                    "user_href": "/profile/Ko-Inagaki"
                },
                {
                    "user_id": "Alexander Levin",
                    "user_href": "/profile/Alexander-Levin-26"
                },
                {
                    "user_id": "Jay Levine",
                    "user_href": "/profile/Jay-Levine-20"
                }
            ]
        }
    ]
}