{
    "title": "What is the second decade of the 20th century? - Quora",
    "tags": [
        "20th Century",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Oehm",
                "href": "/profile/Greg-Oehm"
            },
            "answer_text": "Because we count from 1 and by definition there is no 0 AD, the modern era starts at 1 AD. Thus, the 20th century began in 1901, so the first decade was 1 January 1901 to 31 December 1910. Therefore the second decade was from 1 January 1911 to 31 December 1920. To clarify: The calendar, despite the fact it has an error, is based on years since the birth of Christ, or “Anno Domini”, the Year of our Lord. Anything before that is BC (before Christ), and the year of his birth is thus the first year of our Lord, or 1AD. There can be no 0AD; not inky would 0AD be a nonsense, we don’t start counting from 0, but 1. (If in doubt, count your fingers!) Thus decades, centuries and millennia start in years ending in a 1 and end on years ending in a zero. So, the 21st century began in 1 January 2001. The end of the 20th century was 31 December 2000. ",
            "date": "Answered August 9, 2020",
            "views": "98",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Bridgen",
                    "user_href": "/profile/David-Bridgen-2"
                },
                {
                    "user_id": "Reva Pearlston",
                    "user_href": "/profile/Reva-Pearlston-3"
                },
                {
                    "user_id": "Bill Brown",
                    "user_href": "/profile/Bill-Brown-630"
                },
                {
                    "user_id": "Leon Zach",
                    "user_href": "/profile/Leon-Zach-1"
                },
                {
                    "user_id": "Wendy Hays",
                    "user_href": "/profile/Wendy-Hays-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Theodore D. Appleby",
                "href": "/profile/Theodore-D-Appleby"
            },
            "answer_text": "The idea of century is a man-made concept. Hence, we can define it any way we like. Accordingly, I propose that (as of approximately 2000 years ago), we define the first century as the years 1 to 99. (After all there was no year 0.) The second century is therefore 100 to 199. The third century is 200 to 299. And so on. Therefore, in the 20th century, the first decade is 1900 to 1909, and the second decade is 1910 to 1919. ",
            "date": "Answered August 9, 2020",
            "views": "44",
            "upvotes": "0"
        }
    ]
}