{
    "title": "What does DNA and archeology say about whether the Biblical Philistines were ancestral to modern day Palestinian Arabs? - Quora",
    "tags": [
        "Philistines",
        "Palestinians",
        "State of Palestine",
        "The Arab World",
        "Archaeology",
        "Arab Ethnicity and People",
        "Palestine",
        "Israeli–Palestinian Conflict",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avinoam Ben Dor",
                "href": "/profile/Avinoam-Ben-Dor"
            },
            "answer_text": "Nothing connects the Biblical Philistines to the so called contemporary made up “Palestinians\". Who were the Philistines Ancient DNA may reveal origin of the Philistines Puncturing the big lie of Palestinian identity Linda Sarsour’s ‘Jesus was Palestinian’ comment ignores Jewish history Rabbi blasts Ilhan Omar for promoting idea Jesus was Palestinian Who are the so called \"Palestinians\" Palestinian 'Canaanites' [incl. Rashid Khalidi]: Before 1948, \"Palestine\" had been the preferred term of Jewish identification.   “There was nothing called a Palestinian people” in 1917, says Palestinian historian “There was nothing called a Palestinian people” in 1917, says Palestinian historianby Itamar Marcus and Maurice Hirsch PA historian: In 1917 http://americasurvival.org/2014/07/soviet-russia-creators-of-the-plo-and-the-palestinian-people.html#axzz5JnL0IpkD Soviet Russia: Creators of the PLO and the Palestinian People \"there was nothing called a Palestinian people\" Itamar Marcus and Maurice Hirsch Origins of the Palestinian Narrative | Israel Behind the News Palestinian political violence - Wikipedia Answer to Were the Palestinians in ancient Israel Jews or Arabs? I am assuming that the Palestinians of today, at least, are really Arabs. Am I correct in this assessment? by Dani Ishai Behan Dani Ishai Behan's answer to Were the Palestinians in ancient Israel Jews or Arabs? I am assuming that the Palestinians of today, at least, are really Arabs. Am I correct in this assessment? (הצל) the shadow Analysis: The Gaza Strip – From Ancient Times to the Present Illuminating the Philistines' Origins - Biblical Archaeology Society Where Did The Palestinians Come From? Peace Doesn't Exist. Neither Do the Palestinians The Myth of Palestinian ‘Canaanites’ Puncturing the big lie of Palestinian identity ",
            "date": "Answered September 1, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Minger",
                    "user_href": "/profile/David-Minger"
                },
                {
                    "user_id": "Chaim Handler",
                    "user_href": "/profile/Chaim-Handler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maksim Gur",
                "href": "/profile/Maksim-Gur"
            },
            "answer_text": "Both archeology AND genetics say, NO. Philistines were but a part of so called Greek diaspora, as the Greek colonized all coasts of the eastern Mediterranean sea and the Black sea. To be precise, Philistines were genetically nearly identical to the modern southern Greece population. Archeology shows Greek building style and decorations, Greek ceramics, and Greek race of pigs. Now, Palestinian Arabs are ARABS. Arabs are, as their name testifies, colonizers who arrived from the Arabian peninsula to the Levant as Muslim aggressors in the eighth century. They forced their religion and culture on the indigenous populations which became assimilated or else were forced out. Prior to 1948, when British imperialists left the land, the term Palestinians could be only referring to the Jewish population, as opposed to the Arab population of “Palestine.” Arabs here insisted they are Syrians, and the land is a part of Syria. Only 1965 in the term Palestinians was invented by the KGB as a subtle weapon against Israel. The main Genetic pool of the “Palestinians” consists of Arabian peninsula population, Syrian and trans-Jordanian arab population, and lesser amounts of Muslims from Balcan and Turks. ",
            "date": "Answered December 15, 2019",
            "views": "318",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo Torres",
                    "user_href": "/profile/Alfredo-Torres-103"
                },
                {
                    "user_id": "Daniel Robinson",
                    "user_href": "/profile/Daniel-Robinson-163"
                },
                {
                    "user_id": "Elchanan Ogorek",
                    "user_href": "/profile/Elchanan-Ogorek"
                },
                {
                    "user_id": "Allen Gerald",
                    "user_href": "/profile/Allen-Gerald"
                },
                {
                    "user_id": "Coleman Cooper",
                    "user_href": "/profile/Coleman-Cooper-1"
                },
                {
                    "user_id": "Gary Rosenberg",
                    "user_href": "/profile/Gary-Rosenberg-18"
                },
                {
                    "user_id": "Josh Alpert",
                    "user_href": "/profile/Josh-Alpert-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-E-Hg"
                },
                {
                    "user_id": "Daniel Levi",
                    "user_href": "/profile/Daniel-Levi-26"
                },
                {
                    "user_id": "Leonid Kliotzkin",
                    "user_href": "/profile/Leonid-Kliotzkin"
                }
            ]
        }
    ]
}