{
    "title": "What 2 cities in Japan were bombed in World War 2? - Quora",
    "tags": [
        "Military History and Wars of Japan",
        "Japan",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Szandor Zoellner",
                "href": "/profile/Szandor-Zoellner"
            },
            "answer_text": "Far more than two cities were bombed, and thoroughly destroyed, in Japan in WW2. I know, this is a Quora question designed to try and make “money” by asking an “obvious” question. But the question is asked from the commonly held uneducated understanding that “only” “two” Japanese cities were “bombed” in WW2. Many are only taught the “politically correct” history that here was Japan, sitting there with butterflies and Geisha girls, and those dirty mean Americans cruelly dropped atom bombs on them without warning. Of course, anyone with slightly more education than that knows that a strategic bombing campaign had been going on for a while, and at least 42 major Japanese urban centers had already been destroyed by conventional bombing raids of 300, 500, 700 bombers at a time, before any atomic bomb was dropped. Five months before the atomic bombs, Tokyo was bombed and destroyed by massive conventional raids and by some estimates, more people were killed in Tokyo than by both later atomic bombings, combined. Oh, you didn’t know that? Now you do. Ask a real question. ",
            "date": "Answered March 9, 2020",
            "views": "229",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yifan Wang",
                    "user_href": "/profile/Yifan-Wang-82"
                },
                {
                    "user_id": "Marco Antonio Gonzalez",
                    "user_href": "/profile/Marco-Antonio-Gonzalez-4"
                },
                {
                    "user_id": "Jeroen van Hasselt",
                    "user_href": "/profile/Jeroen-van-Hasselt-1"
                },
                {
                    "user_id": "Eric Youle",
                    "user_href": "/profile/Eric-Youle-1"
                },
                {
                    "user_id": "Russell Watson",
                    "user_href": "/profile/Russell-Watson-8"
                },
                {
                    "user_id": "Alexander Queiroz",
                    "user_href": "/profile/Alexander-Queiroz-1"
                },
                {
                    "user_id": "Keith Twort",
                    "user_href": "/profile/Keith-Twort"
                },
                {
                    "user_id": "Denis O'brien",
                    "user_href": "/profile/Denis-Obrien-15"
                },
                {
                    "user_id": "Charles Malcolm",
                    "user_href": "/profile/Charles-Malcolm-7"
                },
                {
                    "user_id": "Jerry Murdock",
                    "user_href": "/profile/Jerry-Murdock-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Fletcher",
                "href": "/profile/Charles-Fletcher-5"
            },
            "answer_text": "Only Two? There were many Japanese cities that were bombed during WWII. Even the small Doolittle raid in 1942 with only 16 B-25s hit targets in 5 cities. Air raids on Japan - Wikipedia ",
            "date": "Answered March 9, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}