{
    "title": "What does the Bible say about riches and wealth? - Quora",
    "tags": [
        "The Bible",
        "Wealth",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jona Arkenson",
                "href": "/profile/Jona-Arkenson"
            },
            "answer_text": "Jesus clealy said himself that if you are very rich, you are committing a sin. If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow me. [4] When he heard this, he became very sad, because he was very wealthy. Jesus looked at him and said, \"How hard it is for the rich to enter the kingdom of heaven! Indeed, it is easier for a camel to go through the eye of a needle than for someone who is rich to enter the kingdom of heaven.\" [5] The other of the rich men said to him \"Master, what good thing shall I do and live?\" He said to him \"Man, perform the law and the prophets.\" He answered him \"I have performed them.\" He said to him \"Go, sell all that thou hast and divide it to the poor, and come, follow me.\" But the rich man began to scratch his head, and it pleased him not. And the Lord said to him \"How can you say 'I have performed the law and the prophets'? seeing that it is written in the law 'Thou shalt love thy neighbor as thyself,' and look, many of your brothers, sons of Abraham, are clad with dung, dying for hunger, and your house is full of much goods, and there goes out therefrom nought at all unto them.\" And he turned and said to Simon his disciple, sitting by him, \"Simon, son of John, it is easier for a camel to enter through the eye of a needle than a rich man into the kingdom of the heavens\". [6] Jesus and the rich young man - Wikipedia A lot of rich billionaire televangelists will try to claim that Jesus says being rich is okay.. these people are master manipulators and they get millions of dollars claiming God will answer your prayers if you donate money to them.. this is a big scam. Jesus’ number 1 concern is the poor and needy, and has taught his followers to give up your riches and always help the poor and needy.. don't give your riches to televangelists however, they are NOT poor. Give it to the homeless, give it to the children's hospital, or have it go towards something important such as paying for school supplies since public schools are heavily underfunded ",
            "date": "Answered October 2, 2020",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kimberly Gray",
                    "user_href": "/profile/Kimberly-Gray-45"
                },
                {
                    "user_id": "Gin Richman",
                    "user_href": "/profile/Gin-Richman"
                },
                {
                    "user_id": "Lanita Ballard",
                    "user_href": "/profile/Lanita-Ballard"
                },
                {
                    "user_id": "Gia Paul",
                    "user_href": "/profile/Gia-Paul"
                }
            ]
        },
        {
            "author_info": {
                "name": "David McKay",
                "href": "/profile/David-McKay-26"
            },
            "answer_text": "What does the Bible say about riches and wealth? Gosh! Where do I start? Over and over Jesus spoke out against the rich and in defence of the poor. In the Luke 6 version of the Sermon on the Mount, Jesus says, “Blessed are the poor, for the kingdom of heaven belongs to them… but woe to the rich, for they have received their consolation.” In the middle of the Sermon on the Mount (Matthew 6:19–34) Jesus called on his followers to do like the birds and the flowers, and stop working for material things, so they can build God’s invisible kingdom of faith and love. The Most Impossible Teaching of Jesus He promised that his Father in heaven would care for us if we would do that. Jesus told several parables about people giving up everything in order to enter the kingdom of heaven. What Does It Take To Go To Heaven? In Luke 11, 12, 14, and 18, Jesus told the Pharisees, his disciples, a huge multitude, and the rich young ruler (respectively) all to sell everything they have and to give to the poor. Rather than draw the lines between God and the Devil, Jesus told his followers that the ultimate choice is between working for money (and all that money can buy) or working for God. To be fair, you have asked what the BIBLE says about money, whereas I have only made reference to what JESUS said (whose teachings happen to be in the Bible). But, before you put too much stock in the rest of the Bible over what Jesus said, let me remind you that it will also tell you to stone people to death for a lot of misdemeanours, to tear your house down stone by stone if it has mildew, and carry all the stones outside the city boundaries, to sacrifice various doves, lambs, goats, and cows at the Temple in Jerusalem each year, and to slay all the enemies of the children of Israel, including their women, children, and animals. So if you have to choose between that and what Jesus said, which one are you going to embrace? ",
            "date": "Answered October 7, 2020",
            "views": "47",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Williams",
                    "user_href": "/profile/Robert-Williams-2933"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                }
            ]
        }
    ]
}