{
    "title": "What are Emperor Ashoka failures? - Quora",
    "tags": [
        "Ashoka (Mauryan emperor)",
        "Emperors",
        "Historical India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Tauro",
                "href": "/profile/Anthony-Tauro"
            },
            "answer_text": "First a disclaimer: as I have mentioned in many answers before we know very little about this period in history. So any assessment in the context of what we know could be potentially way off the mark. Still we go with what we do know. We know that Ashoka was probably the greatest of the Maurya emperors. He inherited a formidable empire, increased its extent a little and spent the rest of his life in trying to consolidate and unify his empire. His conversion to and proselytizing of Buddhism must be seen in this context. He wanted to culturally unify his empire (as another great Emperor would try to do nearly 2000 years later in the 16th century). Yet for all his efforts his empire broke up almost immediately after his death. Frontier territories like the Satavahanas in the South and Kalinga broke away from the empire, and the core empire itself might have been divided between his successor grandsons. To be fair this state of fragmentation was the norm and empire the exception. Yet the empire which Chandragupta and Chanakya had built had survived for three generations. It is possible that he ran out of good successors like Roman emperor Augustus who was ridiculously unlucky in this regard, or like Aurangzeb had killed off the more worthy successors. It's rather curious that he did not have a son to succeed him, and is also said to have killed off his brothers who were competitors to the throne (this is mentioned in documents that are not accepted as historical artifacts). So he was more likely like Aurangzeb than Augustus, and that would be his biggest failure. ",
            "date": "Answered November 1, 2016",
            "views": "18",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek S",
                    "user_href": "/profile/Abhishek-S-380"
                },
                {
                    "user_id": "Sankalp Raga",
                    "user_href": "/profile/Sankalp-Raga-1"
                },
                {
                    "user_id": "Adhiraj Chattopadhyay",
                    "user_href": "/profile/Adhiraj-Chattopadhyay"
                },
                {
                    "user_id": "Abhishek Kumar Lal",
                    "user_href": "/profile/Abhishek-Kumar-Lal-1"
                },
                {
                    "user_id": "Ashok K Singh",
                    "user_href": "/profile/Ashok-K-Singh-6"
                },
                {
                    "user_id": "Anmol Jain",
                    "user_href": "/profile/Anmol-Jain-26"
                },
                {
                    "user_id": "Akhil Vg",
                    "user_href": "/profile/Akhil-Vg"
                },
                {
                    "user_id": "Apoorv Kumar Chaudhary",
                    "user_href": "/profile/Apoorv-Kumar-Chaudhary"
                },
                {
                    "user_id": "Shannu Prasad",
                    "user_href": "/profile/Shannu-Prasad"
                },
                {
                    "user_id": "Kingshuk Bandyopadhyay",
                    "user_href": "/profile/Kingshuk-Bandyopadhyay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhagwat Shah",
                "href": "/profile/Bhagwat-Shah"
            },
            "answer_text": "An Emperor is like a large banyan tree. He is so over arching and so over reaching that nothing else grows under it. No new talent, no new leader can grown under his fantastic authority. Ashoka, Akber and every other leader like them, create bureaucrats that replicate their orders and carry out their wishes, BUT they fail to nurture peers & heirs who can expand their ideas in years to come. ",
            "date": "Answered October 25, 2016",
            "views": "626",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dinesh Pandya",
                    "user_href": "/profile/Dinesh-Pandya-1"
                }
            ]
        }
    ]
}