{
    "title": "What could be a major downfall for Amazon? - Quora",
    "tags": [
        "Amazon.com (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Elles",
                "href": "/profile/Chris-Elles"
            },
            "answer_text": "Anti-Trust Regulatory pressure: Amazon is a diverse and integrated conglomerate/keiretsu. It can run retail operations as a non profit to continue to aggressively expand market share using its high margin Amazon Web Services(AWS) cloud computing profits to fund growth and keep margins low. Amazon already has well over 50% of North American e-commerce sales. That is simply staggering market share & market dominance and Amazon will not taking it’s foot off the gas unless it is compelled to do so via regulatory means or market forces. Is it fair for a massive ultra efficient retail player to receive additional subsidy from it’s high margin conglomerate /keiretsu entities? What % of Amazon retail competition use AWS for their cloud computing creating further advantage to Amazon as a conglomerate? An argument could be made to forcibly split Amazon retail operations from Amazon Web Services to disrupt an increasing unfair advantage. Cloud Computing competition and margin pressure: Amazon Web Services is the biggest single contributor to Amazon’s skyrocketing market capitalisation. In retrospect, AWS looks like a very simple idea, and it is. Rather than buying just enough servers to stay just ahead of Amazon’s fast growing data needs, why not just buy every server and lease out the excess capacity to others for profit? Genius. But there are other companies(Microsoft Azure, Google Cloud, and potentially Apple) that are not going to sit idly by and allow Amazon’s AWS to continue to dominate unopposed forever. If I wanted to directly attack Amazon and kneecap their relentless Borg-like growth and expansion into new markets, I would directly attack their core cashflow generator. Google and Microsoft may not be major direct competitors with Amazon outside of Cloud computing yet(bar voice search devices with Google and tablet computing with Amazon), but Apple and Alibaba increasingly are. Corporate Warfare: Cash or cash equivalents held by companies like Google($100B+), Microsoft($130B+), Apple($75B), and Alibaba($210B) are truly massive in scale. Even(and especially) in comparison to Amazon’s($30B) “dry powder” available today, for a corporate war tomorrow. Amazon could face considerable headwinds in a multi-front corporate “war” against Alibaba in retail, Microsoft/Google in cloud computing, and Apple in platform content. The current environment in retail e-commerce, cloud computing, and platform content may be one of very high growth and low(er) friction between competitors, akin to the African Serengeti in the wet season. But what happens when the dry season arrives for companies? The fangs come out, the adaptive and resilient survive, and the weak perish. Mass media offers consistent threats and warnings of doom about the threat of North Korea nuclear weapons, but offers little in terms of the far greater likelihood of “war” between corporate “states”. “Wars” that will likely offer lower prices(for a time) for consumers and lower margins for the corporates fighting each other. Blue Sky Threat 100+ years ago a company called Sears quickly came to dominate US consumer retail sales built on the back of a disruptive mail-order business model supported by an efficient logistics network. Today, the bones of Sears are being relentlessly picked thru by more adaptive, agile, and resilient companies such as Amazon. Blue Sky threats cannot be predicted as predictability is declining with the increasing velocity of technological change. Lifespans of corporates on the S&P 500 has fallen over 80% in the last century. The best defence against a Blue Sky Threat is to act with absolute urgency, which is what Amazon does with “It’s always Day 1” mindset as directed by Jeff. ",
            "date": "Answered September 25, 2018",
            "views": "19",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cyndi Nelson",
                    "user_href": "/profile/Cyndi-Nelson-2"
                },
                {
                    "user_id": "José Vega",
                    "user_href": "/profile/José-Vega"
                },
                {
                    "user_id": "Redmond Gurney",
                    "user_href": "/profile/Redmond-Gurney"
                },
                {
                    "user_id": "Eric Yap",
                    "user_href": "/profile/Eric-Yap-5"
                },
                {
                    "user_id": "Daniel Joseph",
                    "user_href": "/profile/Daniel-Joseph-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Ohms",
                "href": "/profile/Justin-Ohms"
            },
            "answer_text": "Amazon is such a large and diversified company that it is doubtful anything short of a collapse of society (or major culture shift) would cause an immediate downfall of the company. To illustrate, compare Amazon to a company such as Apple. Apple is of similar size but focused on just a few market areas, computers and personal electronics. If for example, a new awesome technology would come along that would make cell phones obsolete entirely, or even just a “must have” technology for cell phones that Apple didn’t have the patent to (and couldn’t replicate.) Apple would immediately lose a very significant source of the revenue. (60 - 70% of revenue is from iPhone alone) Now Apple has huge cash reserves so they could manage for a while. But if this scenario were to play out in multiple areas of their business, a new technology that isn’t theirs would kill them eventually unless they came up with something even better. Contrast this to Amazon. Amazon is the latest “Everything Except Shoes” (but now also with shoes) While their primary business is online retail, at times they make more money with their cloud services division (Used by Netflix, Facebook, Twitter, etc…) They also manufacture hardware and software and have their own eco-system just like Apple. They have inroads into banking, shipping, groceries. etc. The list seems to go on an on and it seems to grow every week. You can see that Amazon’s diversification would probably make it incredibly resilient to outside problems. Even if there were a massive exodus from their cloud services division, the other parts of the company would still have viable and significant revenue streams. The only thing that could really make Amazon fall quickly is Amazon itself. If the company just really screwed up everything in all the various businesses at the same time. ",
            "date": "Answered September 23, 2018",
            "views": "182",
            "upvotes": "0"
        }
    ]
}