{
    "title": "What is the history of Karhade Brahmins? - Quora",
    "tags": [
        "Hindu Brahmins (priestly caste)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shyam Sundar",
                "href": "/profile/Shyam-Sundar-55"
            },
            "answer_text": "The exact theory about the origins of the origins are varied, some of the most common ones which have been documented are as follows; - the 'Sahyadri Khanda' in a demeaning way to Karhade and Chitpavan Brahmins, indicate that the Karhade were resurrected from the bones of a camel. - Professor D. R. Bhandarkar concludes that the Karhade must have had at least some partial extraction from the Gurjar (Saka) clans. - there is evidence that during the Chalukya sovereignty over the Deccan during the 10th and 11th centuries, settled Brahmins in the Konkan and Goa regions. The exact origin of these Brahmins is unclear, however at least in one copper-plate grant (found with the Phansalkar Khot family of Terwan) by a Chalukya king to a group of 19 Brahmins settled near Rajapur, there is mention that these Brahmins, as one of their sacerdotal activities would be responsible for creating and maintaining orchards - called Karhataks, in the region surrounding the Vimaleshwar temple. The purpose of these Karhataks, being sustenance of the temple and its occupants and also growing the flora required for yaaga and homa activities. Similar copper plate grants have been found with other Karada families in southern Konkan. The Bombay gazette complied by the British contains transcripts of many such copper plates, which are now available for public research. Traditionally the Karada Brahmins in close association with the Rajapur Saraswat and Naik communities, were involved in horticultural activities and were pioneers in ground water cultivation and irrigation techniques. Like the Havyaka of Karnataka, the Karade have been involved in Betelnut cultivation. Most modern Karhade share the gotra with other Brahmins of the sub-continent. It is not known how the various Brahmin tribes with such diverse origins came to inherit the same paternal lineages. The Gotra system may have been philosophical/ideological at its roots rather than the popular belief that it indicates the genealogical origins. eatures of the Karhades belief system, is that their titulary deities (Graam Devatha or Kula Daiwat) are almost always different versions of Shakti or Durga. Five 'Durga' temples are in the four corners of Kerala-Karnataka region where there is concentration of Karhaade population – Kongoor at Mangalore and Aavala, Kuntikanna, Agalpaady and Thaire in Kasaragod. Similarly in the Marathi speaking domains, Karhada populations have always patronised Mahalakshmi-Kolhapur and Durga-Goa. Similarly, the Marathi dominions host 3 1/2 'Durga' temples in its four corners, Kolhapur, Tuljapur, Vani and Mahur. Originally the Kshaharatasperhaps spoke an old Eastern-Iranian language, however under the increasing cultural influences from the Satavahanas gradually their languages were Prakritised. They used Kharoshti and Brahmi scripts for writing. Subsequent Brahminisation during the Middle Ages inspired the Karhades to learn Sanskrit as a medium to officiate religious ceremonies. Most modern day Marathi-speaking Karhade live in Maharashtra and Goa, though a significant population exists in Madhya Pradesh. A southern branch of Karhade Brahmins settled around the Kasaragodu region (north of theChandragiri river) of the Malabar coast and are called the Karada and share their traditions with fellow Tuluva Brahmins of Kasargode and Dakshina Kannada/Udipi. Other Tuluva Brahmins of the region are Shivalli and Havyaka. South of the Chandragiri river, collectively the Tulu and certain Karhada Brahmins, who assimilated with the Kerala Brahmins are loosely called Embranthiri. In Goa Karhade have two subcastes, viz. Padyes who speak a unique dialect of Konkani/Bhati Bhasha and Bhatt Prabhus who speak standard Konkani.[1] In some pockets the Karadi dialect has been preserved or has influenced the spoken languages of Karhade, e.g. the Karada Bhashe of Dakshina Kannada/Kasargodu, the Karhadi Boli of Rajapur/Sawantwadi and some peculiarities of the Marathi spoken by the Karhade of Bundelkhand. Particular mention is made of the Karhadi language of Kasaragodu, several researchers like Dr. Radhakrishna Belluru - Kannur University, Nozomi Kodama - Tokyo University and Smt. Saraswathi - Hampi University have studied this intra-community language unique to the region. Dr. Radhakrishna Belluru published a book on Karada grammar and edited Karada Vocabulary. Nozomi Kodama also published a book on Karada language. Research has shown that the Kasaragodu Karhadas retained this language which appears to be a dialect of Konkani with significant structural borowings from Kannada and notably Tulu. According to Dr. Radhakrishna Belluru, two Karada dialects are very popular in Tulu Nadu and Kasaragod region. The second dialect is called Bekila Bhaashe, spoken by later Karhada migrants to the region. Kasaragodu Karhadas are essentially multi-lingual, resorting to Kannada, Malayalam and Tulu, when communicating outside their community. Unlike them, other Karhadas like those from Hosdrug, interior and northern Canara, Goa and Maharashtra, are now monolingual and can communicate only in the local languages of their residence, i.e. Malayalam, Kannada, Konkani and Marathi respectively. The modern Karhade celebrate several festivals according to the Hindu Calendar. Karhadas have actively participated and patronised classical and folk music and art forms. In the Marathi speaking areas, Pandit Jitendra Abhisheki and several others have contributed immensely to the Hindustani Classical music.Another Karhada from Belgaum,Annasaheb Kirloskar promoted the Marathi Natyasangeet. In Kasaragodu region, they have been involved in the local art forms of Yakshagana and Talamaddale. Balipa Narayana Bhagwat is one of the last remaining vocalists from an era where microphones were not so common. Karhadas like Nataraja Sharma Ballapadavu, Balasubrahmanya Bhat (son of very popular violinist late Vishnu Bhat Kolikkaje) and Ballapadavu Yogeesha Sharma actively run music schools in Kasaragodu. Prince Rama Varma a descendant ofSwathithirunal regularly visits - Veenavadini, Agalpaady to conduct music classes for young aspiring Karhade Brahmins. Source : Karhade Brahmin ",
            "date": "Answered December 7, 2016",
            "views": "105",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Parmar",
                    "user_href": "/profile/Shubham-Parmar-235"
                },
                {
                    "user_id": "Android Tech",
                    "user_href": "/profile/Android-Tech-7"
                },
                {
                    "user_id": "Manasi Mahajan",
                    "user_href": "/profile/Manasi-Mahajan-4"
                },
                {
                    "user_id": "Sameer Bhave",
                    "user_href": "/profile/Sameer-Bhave-1"
                },
                {
                    "user_id": "Nisha",
                    "user_href": "/profile/Nisha-1048"
                },
                {
                    "user_id": "Chandan Bengapattana",
                    "user_href": "/profile/Chandan-Bengapattana"
                },
                {
                    "user_id": "Sudhanshu Nafde",
                    "user_href": "/profile/Sudhanshu-Nafde"
                },
                {
                    "user_id": "SHARMILAA PANDIT",
                    "user_href": "/profile/SHARMILAA-PANDIT-1"
                },
                {
                    "user_id": "Pawan Chandra N",
                    "user_href": "/profile/Pawan-Chandra-N"
                },
                {
                    "user_id": "Vijay Kibe",
                    "user_href": "/profile/Vijay-Kibe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Candon",
                "href": "/profile/Stan-Candon"
            },
            "answer_text": "Based on what is seen online these days, it seems a lot of Indian brahmin sub-castes are bent on proving their north-west of India (and further west) origins, as a clever way to associate themselves with the more caucasian-like peoples and prove their inherent superiority over other “native” Indians. That this is done by ignoring the credible body of research is particularly disturbing. The Wikipedia Talk page on Karhade Brahmins has much more comprehensive and well-rounded debate on the origins. ",
            "date": "Answered March 19, 2018",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin Bahulkar",
                    "user_href": "/profile/Ashwin-Bahulkar-1"
                }
            ]
        }
    ]
}