{
    "title": "What is basic historical definition for what religion is? - Quora",
    "tags": [
        "True Religion (company)",
        "History of Religion",
        "Philosophy of Religion",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Warren Kramer",
                "href": "/profile/Warren-Kramer"
            },
            "answer_text": "Do you think its important to have a religion? There is no definition of “religion” that fits every religion, except, “a set of views, beliefs, values, and teachings.” And every human on the planet has one of those. Don’t believe it? Religion and belief in god(s) are separate things. There are religions with no concept of god(s), and people most do not consider “religious” that believe in god(s).Religion is not ritual. There are religion which do not include rites and rituals, and plenty of rituals that are not religion-based.“Organized religion” is not the only kind of religion there is. Every organized religion once had only one follower. It was the same set of ideas then. So is that set of ideas a “religion” when it has 4 followers? 10? 100? It’s just a set of ideas, which every human has.There is really no substantive difference between people we normally call “religious” and those most do not. “Religious” and “non-religious” are false identifiers. ",
            "date": "Answered May 17, 2016",
            "views": "308",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Winnie Marhaxa",
                    "user_href": "/profile/Winnie-Marhaxa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Saini",
                "href": "/profile/Akash-Saini-19"
            },
            "answer_text": "Religion is the sigh of the oppressed creature, the heart of a heartless world, and the soul of soulless conditions. It is the opium of the people…Karl Marx.. Marx’s contention was that religion gives people artificial, illusory happiness—like opium does to a drug addict—and freeing people from that unrealistic illusion was part of building a better society. ",
            "date": "Answered May 17, 2016",
            "views": "75",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Brown",
                    "user_href": "/profile/Richard-Brown-70"
                },
                {
                    "user_id": "Akash Saini",
                    "user_href": "/profile/Akash-Saini-7"
                }
            ]
        }
    ]
}