{
    "title": "What happened during colonization? - Quora",
    "tags": [
        "Colonization",
        "Colonialism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamie Cawley",
                "href": "/profile/Jamie-Cawley-1"
            },
            "answer_text": "This is too big a question to fully answer but there are a few comments to make. What happened ‘during colonialism’ was completely varied. Most of it was not ‘colonialism’ in its normal sense of sending out colonies from a homeland at all. So the term is wrongly used except for North America, Australia, South Africa and New Zealand. All the rest of the so-called colonial territories were ruled from Europe but with minimal export of people to them. The Spanish and Portuguese rule in South America (c.1550 - 1820) was traditional exploitation of a conquered empire, abetted by imported diseases that killed millions and demoralised the rest. It was always cruel by modern standards but the removal of European rule after around 1810–20 made no difference to the harshness of the rulers, whoever they were. Most of the other European ‘colonies’ were, until 1850 or so, ports and nearby areas ruled somewhat reluctantly by one European country to keep the other European countries out. After around 1850 some European countries started to engage in a more serious acquisition of other lands in a race for prestige. Most of these co-called colonies were ruled with a light touch, Europeans were generally less then one in one hundred of the population and the locals were not concerned. Often, as in China, European rule was much preferable to the alternative Manchu rule and the European areas prospered. In China and India it is notable how the early ‘colonial’ areas grew in population and are still the major cities apart from the capital. There were some huge tragedies under disgusting colonial rule, notably in Argentina, Tasmania and Namibia, where there were deliberate and largely successful attempts to exterminate the local population, and in places like Congo and the Caucasus where great cruelty was practiced by the colonial power. But, on the other hand, local rulers were often appalling and in many areas the colonial power probably had a better record. At the end, it all made very little difference. What made a difference was the transformation of the world by the industrial and commercial developments that started in England around 1770 - if you want to know how and why this happened you can read it in my book, The Birth of Now. ",
            "date": "Answered October 8, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wes Frank",
                    "user_href": "/profile/Wes-Frank-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manuel Louro Mourão",
                "href": "/profile/Manuel-Louro-Mourão"
            },
            "answer_text": "By rule, the exploration of the contries colonized. ",
            "date": "Answered July 29, 2018",
            "views": "71",
            "upvotes": "0"
        }
    ]
}