{
    "title": "What is the most British state in America? - Quora",
    "tags": [
        "Great Britain",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Martin",
                "href": "/profile/Peter-Martin-559"
            },
            "answer_text": "As far as national states are concerned, I'd go with Canada, although several West Indian countries are most British in culture. As far as states and provinces within countries or national states, I'd say Newfoundland & Labrador followed by Utah, Maine and Prince Edward Island. Some provences in Canada may be distinctly Scottish (e.g. Nova Scotia for culture, Prince Edward Island by descent) and several, such as British Columbia, have tried to sell themselves on their britishness. Also worth mention are such southern USA states as those in northern New England (i.e. Vermont, New Hampshire, Maine) and mormon USA states such as Utah, Wyoming, and Idaho. As far as the old stock British are concerned, they are dominant in much of the south and Appalachia in such states of the USA as Kentucky, Arkansas, possibly West Virginia, Alabama, Tennessee, North Carolina, Virginia (still culturally British in several ways in the case of the last one mentioned) et al. By decade, starting with 1850 (focus on Utah): From Ireland to Germany to Italy to Mexico: How America’s Source of Immigrants Has Changed in the States, 1850 - 2013 Only the English, estimated:  NORTHERN USA in 1870– density, for those born in England and Wales  USA in 1900 — “race” here refers to national state or country of birth. See the pink areas for Great Britain.  Worthy of mention: this map generally splits those of British ancestry into the English, Scottish, Manx, Welsh, Scots-Irish et al, as well as the many millions who respond as being of “American” descent (and are overwhelming of British descent) —  ",
            "date": "Answered September 18, 2020",
            "views": "821",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pablo Djankowicz Ruizinowitz",
                "href": "/profile/Pablo-Djankowicz-Ruizinowitz"
            },
            "answer_text": "I definitely second New England. I lived there for 4 years, in the rural beauty of western Massachusetts. I’ve also lived in England for about 1 year. There’s obviously the geography—New England has quite some very English names for place names. They even have the weird English tendency to spell and sound quite differently. There’s Worcester, Haverhill, Scituate, Leominster, Cochituate, Gloucester, etc. But it’s also the culture. New Englanders tend to be quiet, not very expressive and keep to themselves a lot of the time. They can sometimes be cold. They’re not voluble, chatty people, unlike most Americans. They’re very much like the English themselves—who are also quiet, not very expressive, keep to themselves a lot of the time and can sometimes be cold. And if I go by whenever the Red Sox won the World Series, like the English, New Englanders can suddenly transform themselves into a rowdy, violent bunch when they get drunk and their favorite team wins some type of tournament. LOL. (Though on average New Englanders can hold their liquor better than the original English. Sloppy drinking in public is definitely something that is frowned upon in New England but that is very much tolerated in old England.) [EDIT: I just thought about it and I’m describing only western Massachusetts here. I’d imagine that Vermont, New Hampshire and Maine are the same way. I’ve met a lot of Mainers and two Vermonters, and they were all quiet, not very expressive and incredibly self-effacing, like the English.] ",
            "date": "Answered September 23, 2020",
            "views": "353",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Ellen Charlton",
                    "user_href": "/profile/Ellen-Charlton-2"
                }
            ]
        }
    ]
}