{
    "title": "What if the pyramids were never built by Egyptians? - Quora",
    "tags": [
        "Pyramid Theories",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Allen",
                "href": "/profile/Steven-Allen-73"
            },
            "answer_text": "If the pyramids were not built by the Egyptians then that must mean that another civilization built the pyramids. I personally do not think that the Egyptians built the pyramids given the numerous discrepancies between their civilization and the pyramid’s construction with the most obvious being that King Khufu's name is no where to be found on or inside ANY of the pyramids and supposedly the pyramid was built to serve as his tomb. There are no bodies or body parts found in the great pyramid’s king chamber. Further, there is no writing within that chamber, which is what HAS been observed in other Egyptian tombs. There are many others but I won’t mention them here. Here’s the real question you should be asking —if a geologist or archaeologist came forward and provided empirical evidence that the Egyptians did not build the pyramids, would he or she be taken seriously by other scientists that have been teaching the standard paradigm for several decades? If the story of what happened to Jacques Cinq-Mars is an indicator, they probably wouldn’t. There is HUGE resistance to changing current models even when they are clearly and obviously wrong. https://www.smithsonianmag.com/science-nature/jacques-cinq-mars-bluefish-caves-scientific-progress-180962410/ Despite what the pervious poster says, there is indeed evidence of a VERY ancient civilization that must have predated the Egyptians by thousands of year. Here are few links if you're really interested in learning more about some of the structures discovered. Enormous Ancient City Uncovered by Lasers in Guatemalan Jungle An Archaeological Site In Turkey Is Rewriting Our Entire Understanding of Human History ",
            "date": "Answered July 16, 2019",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wayne Rutledge",
                "href": "/profile/Wayne-Rutledge-4"
            },
            "answer_text": "Then we have had an invisible civilization in the past that was so clever that it could hide its activities and existence with 100% success. Except for when it built pyramids. Its cities cannot be found, it left no trace of its people, and it left no trash, no artifacts, was able to avoid affecting the environment and used no resources at all. All we can find of this invisible civilization are a bunch of stone and mud brick pyramids which for some odd reason they used primitive stone working technologies to build. AND they also arranged for them to be cleverly dated to a later period and to be culturally associated with people who didn’t then exist and also inspired everyone else on earth to build pyramids too - often thousands of years before they came into being - all without being seen. Truly amazing! Hail the invisible civilization…ah are you still here? ",
            "date": "Answered December 9, 2018",
            "views": "202",
            "upvotes": "0"
        }
    ]
}