{
    "title": "What are the manifestations of colonialism and imperialism on Africa? - Quora",
    "tags": [
        "Imperialism",
        "Colonialism",
        "Africa"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Hunt",
                "href": "/profile/Christopher-Hunt-23"
            },
            "answer_text": "The problem with a question such as this is the absence of a counter-factual. To be certain, it would be necessary to visit an alternative universe where colonialism and imperialism did not take place. However, we do know that colonialism and imperialism (C&I) caused depopulation in Africa. As recently as the start of the 20th Century, when the incredibly exploitative Belgian regime was governing the Congo, the native populations simply failed to reproduce sufficiently to maintain the population. Add in all the thousands of people who were exported as slaves… It is difficult to keep up with African population figures, but Google tells me that it is currently about 1.2bn, roughly the equivalent of China which has 1/3rd the land mass (Africa Is Way Bigger Than You Think). If C&I had not happened, the African population might be 3.6bn! We also know that C&I disrupted traditional African trading patterns and routes, raising the importance of coastal cities - Houakchott, Dakar, Banjul, Bissau, Conakry, Yamasoukro, Accra, Lome, Lagos, Maputo, Mogadishu, Djibouti (I know Lagos is no the capital of Nigeria, but Abuja is not the trading centre) - relative to internal cities (Kumasi and Kano come to mind, but also Timbuktu. To pursue the issue further - if the human population of Africa had been allowed to grow unhindered - to 3.6, or even 2bn - would the natural resources of Africa have been exploited more comprehensively? Is it possible that C&I has actually preserved African wildlife, particularly the mega-fauna (elephants, lions, giraffe) that would have been eradicated by pressure for land? Of course language - without C&I, European languages such as English, French and Spanish would not have been adopted throughout the African continent. Clothing - Africans have adopted “European” dress or shirt tie and business suit. When I visit Accra on holiday in shorts, T-shirt and sandals, I cause great discombobulation in the banks, stockbrokers’ offices and even computing firms that I visit. One can only imagine that Africans would still be wearing looser fitting, and possibly more colourful, clothing in the absence of C&I. Food - rice and, particularly maize/corn, were introduced to the African continent as a consequence of C&I. Would they have been adopted so readily without the coercive pressures? Would millet, yam and cassava have been bred to be more productive? This is not a simple question, it is worthy of several hundred dissertations focussing on particular aspects of life. Mental health - since the over-riding paradigm of “mental health” is that imposed by the Western European model/ standard, many Africans find themselves categorised as ill. If the disciplines of psychology and psychiatry had developed in a free African world, it is certain that the idea of “normal” would be different - possibly more inclusive. ",
            "date": "Answered June 3, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emmanuel Sunday",
                    "user_href": "/profile/Emmanuel-Sunday-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edem Inyang",
                "href": "/profile/Edem-Inyang"
            },
            "answer_text": "The borders of the nations were created by colonialism. Many of the languages spoken as official languages are from this era as well. You also find many of the laws applied, method of schooling, foreign policy and even sports played are manifestations of this era. ",
            "date": "Answered June 3, 2018",
            "views": "344",
            "upvotes": "0"
        }
    ]
}