{
    "title": "What kills, guns or people? - Quora",
    "tags": [
        "Gun Control in the United States of America",
        "Killing",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Davis",
                "href": "/profile/Erik-Davis-59"
            },
            "answer_text": "People have always been killing other people.  Guns just make it easier for anybody to be able to do so.. Before guns you had to have at least some skill at some form of combat or some knowledge and cunning. Now if you notice any group of asshats whether it be in Antifa or Aryan Nations, they tend to attack people who are unarmed. The right to bear arms isn't just about safety and personal liberty from the government, it's about safety and personal liberty from bad actor citizens as well. The left would like to disarm the general public in a effort to install mob rule and the right wants the religious to arm themselves and create a theocracy.. The silent majority better step up and start being vocal or we will lose our country to one or the other. And the only way for us to step up and protect our rights is to use our right to defend ourselves and our right to free speech to stop these groups from throwing the country under the feet of their ideologies. Without the first and second amendments, this country is lost to one intolerant ideology or the other intolerant ideology. It's time for those of us who have stayed at home and tried to just live our lives without division to stand and say enough! We need to bring those of us from the Democratic party and those of us from the Republican party who have a understanding that we must respect the fact that others who we don't agree with have the right to believe the way they want to believe, together. Dunning-kruger isn't a republican thing or a Democrat thing it's a human flaw and those that feel it can be fough with violence are not only wrong, they're dangerous to the fabric of our society. There is no way to stand up for yourself once you've taken somebody's ability to defend themselves. Be forewarned.. if we do so, the far left and the far right will eat the center alive! ",
            "date": "Answered October 20, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Noel",
                "href": "/profile/Jack-Noel-8"
            },
            "answer_text": "Thank you for the A2A. The question asks; What kills, guns or people? Criminal homicides (by definition) are the result of people using various kinds of tools and methods to commit single and multiple murders. Since most people who become murderers choose to do their killing with guns (mostly handguns), that is all that can be said of tool choice. It really does stop there because (1) taking away guns from the millions of non criminal citizens of a country does not stop murderers from using other tools including hands to manually strangle the victim and (2) No government anywhere, at any time, has successfully removed all guns and other tools of homicide. But a key difference between guns and other “tools” of murder is that it takes a gun in the hands of the defender to stop the attack by the armed killer. That and some condition training so that the defender knows when to duck and when to fire at the attacker. How lucky would it have been for Mr. Ronald Goldman and Ms. Nicole Brown Simpson if they had happened to be armed with handguns when they were attacked by a knife wielding killer? But according to Democrat Doctrine, neither they nor any of us “can be trusted” with “deadly guns.” So because it’s the extra intelligent, extra trustworthy Democrat politicians telling us that having the government let only some people have guns will “solve the problem of too many guns,” we had better vote them into government at as high a level as possible so they can have complete control of the United States government, right? ",
            "date": "Answered March 21, 2018",
            "views": "340",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Kirkpatrick",
                    "user_href": "/profile/Jim-Kirkpatrick-11"
                },
                {
                    "user_id": "John Lesnak",
                    "user_href": "/profile/John-Lesnak"
                },
                {
                    "user_id": "Mike Dempsey",
                    "user_href": "/profile/Mike-Dempsey-12"
                },
                {
                    "user_id": "Bailey Ferrier",
                    "user_href": "/profile/Bailey-Ferrier-1"
                },
                {
                    "user_id": "John Woodworth",
                    "user_href": "/profile/John-Woodworth-11"
                },
                {
                    "user_id": "Cory Whidden",
                    "user_href": "/profile/Cory-Whidden"
                },
                {
                    "user_id": "Milt Hemmingsen",
                    "user_href": "/profile/Milt-Hemmingsen"
                },
                {
                    "user_id": "Jeff Hamilton",
                    "user_href": "/profile/Jeff-Hamilton-43"
                },
                {
                    "user_id": "Brett Fenton",
                    "user_href": "/profile/Brett-Fenton"
                }
            ]
        }
    ]
}