{
    "title": "What caused the black plague to end? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Barendrecht",
                "href": "/profile/Eric-Barendrecht"
            },
            "answer_text": "Between 1346 and 1353 the second wave of the plague, dubbed the black death, ravaged Europe and killed millions. Up to a third of the population was wiped out (Though that's a rough estimate. We don't really know.) But it wasn't the first time the plague broke out and it wasn't the last. The plague has been around for centuries and still exist to this day. The cause of the plague is a bacteria called Yersinia pestis. And like many bacteria, they have different and evolving strands. In an extremely simplified version, you have to see the plague as something similar to the flu. So what happens during a flue endemic, is that it quickly spreads, everybody susceptible gets sick, create antibodies and fights it off, until there are no more new victims and the virus dies off as it cannot find hosts to replicate itself anymore. And the next year there's gonna be a new strand that will make its rounds. But not every strand it's equally bad. Some strands, like the Spanish and Russian flu, caused millions of deaths. That's basically what happened with the plague as well: it quickly spread, killed between 75 and 200 million, until there were no more susceptible victims anymore and the plague slowly died. Other factors, such as quarantine protocols, cold weather killing fleas, rats falling victim to the plague etc. were also a factor. ",
            "date": "Answered May 5, 2019",
            "views": "19",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Simon Riis",
                    "user_href": "/profile/Simon-Riis-2"
                },
                {
                    "user_id": "Sharlotte Fandriana",
                    "user_href": "/profile/Sharlotte-Fandriana"
                },
                {
                    "user_id": "Aditya Sharma",
                    "user_href": "/profile/Aditya-Sharma-1280"
                },
                {
                    "user_id": "Barry Howard Westfall",
                    "user_href": "/profile/Barry-Howard-Westfall"
                },
                {
                    "user_id": "Mike Sims",
                    "user_href": "/profile/Mike-Sims-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Oppenheimer-Crawford",
                "href": "/profile/James-Oppenheimer-Crawford"
            },
            "answer_text": "It basically ran out of hosts. It killed a third of all Europe. Like all organisms, it did not kill all who contracted it, although in many cases, it got pretty close. There were places that were wiped out (I recall reading about a chronicle of a monastery where the account tells of the monks dying of the plague, and finally the chronicle goes silent, as the last monk has died) , and places where the plague never got to, such as Oberammergau. Eventually the supply of hosts dried up, and that was that — til the next time. Nasty business!! ",
            "date": "Answered January 21, 2020",
            "views": "727",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Michael-Adu-25"
                },
                {
                    "user_id": "Aditya Sharma",
                    "user_href": "/profile/Aditya-Sharma-1280"
                },
                {
                    "user_id": "Dylan McGrath",
                    "user_href": "/profile/Dylan-McGrath-9"
                },
                {
                    "user_id": "Karan Velloo",
                    "user_href": "/profile/Karan-Velloo"
                },
                {
                    "user_id": "Mac McCutcheon",
                    "user_href": "/profile/Mac-McCutcheon"
                },
                {
                    "user_id": "Mike Sims",
                    "user_href": "/profile/Mike-Sims-68"
                },
                {
                    "user_id": "Floyd Chaffee",
                    "user_href": "/profile/Floyd-Chaffee-1"
                },
                {
                    "user_id": "Janie Sheehan",
                    "user_href": "/profile/Janie-Sheehan"
                }
            ]
        }
    ]
}