{
    "title": "What is the rarest existing World War II era aircraft? - Quora",
    "tags": [
        "Military Aircraft",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Patrick",
                "href": "/profile/Alex-Patrick-15"
            },
            "answer_text": "There are plenty of WWII aircraft that were either built in very small numbers, or have only one or two examples remaining. Examples like these, where thousands were built and yet barely any survive today; Handley Page Hampden. 1,400+ built, no full examples remain. Only one remains fairly intact, on display in Canada, whilst another wreck is currently undergoing a complete rebuild at RAF Museum Cosford.  Fairey Barracuda. 2,600+ built, 2 wrecks exist today - undergoing work at the Fleet Air Arm Museum.  Fairey Fulmar. 600 built of which only the prototype remains.  Boulton Paul Defiant. 1,000+ built, only one full aircraft exists today.  Hawker Typhoon. 3,300+ built, only one full example survives.  De Havilland Hornet and Sea Hornet. Almost 400 built, only one survived intact.  Mitsubishi Ki-46 “Dinah”. Over 1,700 produced with just one left today.  Junkers Ju-88. With over 15,000 of these aircraft built, its mind-boggling how just two intact aircraft survive today. Not unlike the Ju-87 Stuka and Bf 110 with 6,000+ of each being made and just a pair of each remaining intact.  Editing in one: The Dornier 17. 2,100+ built, and until a few years ago none at all remained. Now there is the wreakage of one undergoing preservation at Cosford, though there isn't much of it remaining.  There are dozens of mass produced aircraft types with none remaining today, and dozens more types with just one or two. These are just a few that spring to mind. Rarer still are the prototypes or unsuccessful aircraft that never entered mass production, the majority of which were not preserved. Hope this helps ",
            "date": "Updated February 13, 2020",
            "views": "49",
            "upvotes": " View 586 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miles Dewan (माइल्स देवन), (ਮਿਲੈ ਦੇਵਾਂ)",
                    "user_href": "/profile/Miles-Dewan-माइल्स-देवन-ਮਿਲੈ-ਦੇਵਾਂ"
                },
                {
                    "user_id": "Luke Price",
                    "user_href": "/profile/Luke-Price-60"
                },
                {
                    "user_id": "Sam Morris",
                    "user_href": "/profile/Sam-Morris-226"
                },
                {
                    "user_id": "Dan Davies",
                    "user_href": "/profile/Dan-Davies-37"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                },
                {
                    "user_id": "Lindsey Foles",
                    "user_href": "/profile/Lindsey-Foles"
                },
                {
                    "user_id": "Jonathan Greever",
                    "user_href": "/profile/Jonathan-Greever"
                },
                {
                    "user_id": "Ken Harris",
                    "user_href": "/profile/Ken-Harris-108"
                },
                {
                    "user_id": "Andy Ronayne",
                    "user_href": "/profile/Andy-Ronayne"
                },
                {
                    "user_id": "Alejandro Gutiérrez",
                    "user_href": "/profile/Alejandro-Gutiérrez-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "I would have to submit that the following aircraft are also quite rare:  Messerschmitt Me 263 Scholle - There were only three ever built and all three are in a warehouse at Wright Patterson AFB in Dayton,Ohio. They are disassembled and they have never flown.RB-1 Conestoga - A seaplane that was more a test platform than a serviceable fighting aircraft. There were 20 made and the only survivor is in the Pima Air Museum in Tucson, Arizona.Lockheed C-69 Constellation - A transport plane that was later sold to civilian airlines and flown for  number of years. There's only one survivor of the 22 which were built and it also resides in the Pima Air Museum.IAR 80 - A Romanian aircraft that saw service late in the war. 346 were built and all were scrapped at the end of WWII. However, civilian enthusiasts have managed to to rebuild two from spare parts and scrapped hulls. They are located in museums in Romania.Supermarine Stranraer - Was a British flying boat which served in a troop transport and anti-submarine role during the early part of WWII. It was supposed to be  sturdy and after the war the fleet was sold to Canadian civil operators and was used until the end of the 1950s. The sole remaining survivor of the 57 which were built is in the Royal Air Force Museum in London.",
            "date": "Updated August 18, 2015",
            "views": "74",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Austin Duong-Van",
                    "user_href": "/profile/Austin-Duong-Van"
                },
                {
                    "user_id": "Eric Brammer",
                    "user_href": "/profile/Eric-Brammer"
                },
                {
                    "user_id": "Peter Nissen",
                    "user_href": "/profile/Peter-Nissen-2"
                },
                {
                    "user_id": "YoungSherlock",
                    "user_href": "/profile/YoungSherlock"
                },
                {
                    "user_id": "Lawrence Lister",
                    "user_href": "/profile/Lawrence-Lister-2"
                },
                {
                    "user_id": "Michael Wen",
                    "user_href": "/profile/Michael-Wen-19"
                },
                {
                    "user_id": "Patrick Morganelli",
                    "user_href": "/profile/Patrick-Morganelli"
                },
                {
                    "user_id": "Colin Park",
                    "user_href": "/profile/Colin-Park-9"
                },
                {
                    "user_id": "Krister Sundelin",
                    "user_href": "/profile/Krister-Sundelin"
                },
                {
                    "user_id": "Pu YingHao",
                    "user_href": "/profile/Pu-YingHao"
                }
            ]
        }
    ]
}