{
    "title": "What is the worst death a human has ever experienced? - Quora",
    "tags": [
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Kroplinski",
                "href": "/profile/Thomas-Kroplinski"
            },
            "answer_text": "Back in 1999, in the town of Tokaimura Japan, three men were working in a uranium reprocessing facility. They had been assigned to work with uranium nitrate solution. Due to their disregard of important safety regulations, a large container of the dissolved uranium 235 went suddenly critical. This resulted in a huge flux of high energy neutrons to be emitted. Two of the three men received radiation doses in excess of 18 sieverts. Generally speaking, 6–7 sieverts is considered a death sentence. One of the three, Mr. Hitachi Ouchi would become the unwitting subject of a medical experiment that might be entitled “How Long Can We Keep This Poor Wretch Alive?” The first part of the experiment involved taking samples of blood and tissues to see what they had to work with. It turns out, not much. It was, in fact, impossible to find any normal chromosomes in this man's body. NONE! You might wonder what this means for a human being. Basically, without chromosomes, your body cannot make new cells. So as old worn out cells die, the tissues just begin to die (necrosis in medical terminology). The first cells to die are those lining the intestines and mouth. True to form, these started to slough off within days. The lining of Mr. Ouchi's mouth as well as the lining of his intestines just peeled away revealing raw bleeding flesh. Now this would normally be the beginning of the end. However, the hospital gave their patient intravenous fluids, nutrients, and antibiotics. He briefly stabilized. A few days later however, his skin, having worn out it's cells, also began to slough off like the skin of a boiled chicken. Additionally, it was discovered that the neutron flux had turned the sodium in his body into a radioactive isotope. He was STILL receiving deadly doses of radiation internally. Fortunately, this isotope decays in a matter of days, so the radiation died down quickly. Unfortunately, this additional radiation really finished off his ability to make any new blood cells, so he had to be transfused continuously. By this time, Mr. Ouchi was begging to die. But “no, no no\" medical screen science must move forward. I'm going to provide a link to a YouTube video that will let you see pictures of this poor man, as well as provide even more gruesome details. But in my opinion no human on earth has suffered a more lingering, agonizing death.  ",
            "date": "Answered June 1, 2018",
            "views": "4",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Athanasius Casanova",
                    "user_href": "/profile/Athanasius-Casanova"
                },
                {
                    "user_id": "Jack Edginton",
                    "user_href": "/profile/Jack-Edginton-1"
                },
                {
                    "user_id": "Georgina Bowers",
                    "user_href": "/profile/Georgina-Bowers-2"
                },
                {
                    "user_id": "Awe Sum",
                    "user_href": "/profile/Awe-Sum-5"
                },
                {
                    "user_id": "Kirito Dawson",
                    "user_href": "/profile/Kirito-Dawson"
                },
                {
                    "user_id": "Sheryl Erickson Hughes",
                    "user_href": "/profile/Sheryl-Erickson-Hughes"
                }
            ]
        }
    ]
}