{
    "title": "What is a dichotomy? - Quora",
    "tags": [
        "Dichotomies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kinney",
                "href": "/profile/Jeff-Kinney-7"
            },
            "answer_text": "According to Webster, a dichotomy is: a division into two especially mutually exclusive or contradictory groups or entities the dichotomy between theory and practice; also : the process or practice of making such a division dichotomy of the population into two opposed classes;something with seemingly contradictory qualities, as in: it's a dichotomy, this opulent Ritz-style luxury in a place that fronts on a boat harbor —Jean T. Barrett;the phase of the moon or an inferior planet in which half its disk appears illuminated; orbifurcation; especially repeated bifurcation (as of a plant's stem), a system of branching in which the main axis forks repeatedly into two branches, or branching of an ancestral line into two equal diverging branches.",
            "date": "Answered February 7, 2018",
            "views": "24",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Radhakrishnan (Arkay) Nair",
                    "user_href": "/profile/Radhakrishnan-Arkay-Nair"
                },
                {
                    "user_id": "Will Turner",
                    "user_href": "/profile/Will-Turner-127"
                },
                {
                    "user_id": "Heidi Lynn",
                    "user_href": "/profile/Heidi-Lynn-63"
                },
                {
                    "user_id": "Marion Cannon",
                    "user_href": "/profile/Marion-Cannon"
                },
                {
                    "user_id": "Joshua Dainty",
                    "user_href": "/profile/Joshua-Dainty"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bethann Siviter",
                "href": "/profile/Bethann-Siviter"
            },
            "answer_text": "Look at the word first. Dicho- root means “two, apart”. The suffix -tomy means “cutting”. So, the word means, literally, “cut in two” and refers to a choice, but can tend to refer to a contradiction that makes it hard to choose. “Seeing Jeff was wrong, because he was married, but I love him” - this is a dichotomy- I have two choices, and neither is the right one. “It is a dichotomy to have wide internet access as although it brings us closer, we are more at risk” - this is an example of a choice with elements that cannot be disentangled, also a dichotomy. It’s hard to choose between access, and safety. Although the word itself does not have a negative connotation, it can have a feeling of being a difficult or confusing choice. ",
            "date": "Answered June 26, 2016",
            "views": "499",
            "upvotes": "0"
        }
    ]
}