{
    "title": "What are soldiers' first time experience on a battle field? - Quora",
    "tags": [
        "Military Personnel",
        "Personal Experiences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phil Cravens",
                "href": "/profile/Phil-Cravens"
            },
            "answer_text": "The first time I was in combat on May 21, 1969, we were ambushed by a reinforced company of NVA. At first, I was outside of the horseshoe ambush, after hearing others being shot, the screams, guys I knew begging for help, seeing friends wounded with multiple gunshot wounds. Because it was a grab us by the belt, We were unable to call artillery or air support. I couldn’t stand it anymore. So I volunteered with a group of others to attack the enemy bunkers. While low crawling as quiet as I could but my heart was pounding so hard, I thought it would burst through my chest. I could almost swear everyone else could hear it. I had to take a very short timeout to get control of my heart it was beating so darned hard, I had made the decision to help and I was determined to see it through. After we got close to one of their bunkers, five of us got online to assault it, as we were up and firing the person on my right had the muzzle of his M-16 very close to my ear and cut loose on full automatic. I went down to the ground because my head was hurting so bad, because of that my brain felt rattled and I couldn’t hear, I had the worst headache in my life. After that, it seemed like I was in a dream-like state. The next time we assaulted two guys on either side of me went down with serious gunshot wounds, I have no idea why I wasn’t hit with them. We finally knocked out the bunker with rifles and grenades. After the fight and we were recovering the wounded, we carried them almost a half-mile. After we arrived at the LZ, I saw guys I knew and friends shot up, sucking chest wounds, one of our machine gunners was missing several fingers and two bullet wounds to his penis. I felt that my inability to hear was minor compared to what I saw. The shakes began as soon as we med-evac the last of the wounded, I didn’t think the shakes would ever end. When we arrived at our NDP, I still had to do watch while not being able to hear, I did blow a claymore mine that night. It was so close to our position, the people in the CP thought a mortar round had hit us. Terrified most of the day and that night. The next day we had to recover our dead, our friends, they were so full of life the day before. Now they were lifeless bodies covered with flies and had a sickly sick odor from the decomposing of their bodies. I felt the need to tell the complete story. Thank you for the upvotes. ",
            "date": "Updated December 10, 2018",
            "views": "59",
            "upvotes": " View 3.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Benjamin Judson Rhoads",
                    "user_href": "/profile/Benjamin-Judson-Rhoads"
                },
                {
                    "user_id": "Scott Blanchard",
                    "user_href": "/profile/Scott-Blanchard-2"
                },
                {
                    "user_id": "John Toussaint",
                    "user_href": "/profile/John-Toussaint-6"
                },
                {
                    "user_id": "Brian Bourne",
                    "user_href": "/profile/Brian-Bourne-5"
                },
                {
                    "user_id": "Tom Childs",
                    "user_href": "/profile/Tom-Childs-23"
                },
                {
                    "user_id": "Kheam Hem",
                    "user_href": "/profile/Kheam-Hem"
                },
                {
                    "user_id": "David Gattis",
                    "user_href": "/profile/David-Gattis-1"
                },
                {
                    "user_id": "Ed Huesing",
                    "user_href": "/profile/Ed-Huesing"
                },
                {
                    "user_id": "Benny Coon",
                    "user_href": "/profile/Benny-Coon"
                },
                {
                    "user_id": "B Mc",
                    "user_href": "/profile/B-Mc-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan-Khang Nguyen",
                "href": "/profile/Nathan-Khang-Nguyen"
            },
            "answer_text": "This is not an account from myself, however, I’d like to share what it was like to experience combat for the first time through the eyes of a South Vietnamese soldier. This account was written by Doan Phuong Hai, a member of the 7th Airborne Batt. (TD7ND) and served during the entirety of the war from what I understand. It was originally written in Vietnamese, but I’ve translated it into English. His first taste of fighting occurred at the disastrous Battle of Dong Xoai in 1965 which was a major defeat for the South Vietnamese. Here is his account.  Biography of the Author: Doan Phuong Hai graduated with Class 19 from the Da Lat Military Academy in 1964 and was assigned to the 7th Airborne Battalion. After being severely wounded during the Battle of Dong Xoai in 1965, he was initially transferred to the Gia Dinh Police, and then to the Military Police, where he was assigned to guard Prisoner of War (POW) camps in Bien Hoa and on Phu Quoc Island. Shortly before the 1968 Tet Offensive, he was able to get transferred back to the Airborne and was assigned to the 11th Airborne Battalion  Dong Xoai - Memories that are Difficult to Forget Dedicated to the memory of Tran Tri Dung, Vietnamese Military Academy Class 19, and the other comrades-in-arms who were lost at Dong Xoai In late 1964, Dung, Nhut, Rot, and I, who had all graduated from the Military Academy together, were assigned to the 7th Airborne Battalion, which was stationed at the Bien Hoa Airfield. Bien Hoa was a military city, complete with bars, American soldiers, and naive country girls who had swarmed in from poverty-stricken remote villages to try to make money off the foreigners in the many bars that had sprouted up like mushrooms in the city. Bien Hoa, which was 30 miles from Saigon, was also famous for the memorial statue of a soldier sitting with his rifle laid across his thighs overlooking the Army Cemetery outside the city. The 7th Airborne Battalion had been formed during the last years of the French-Vietnamese war in the mountain jungle region next to Laos, stretching from Hoa Binh through Nassan and Dien Bien Phu. When I was first assigned to the battalion, I found that there were still many ethnic Cambodian, Montagnard, and Nung soldiers. These grizzled veterans had lived through many battles, from the burning desert sands of Algeria in Africa while serving with the French Army’s Foreign Legion to the bloody battlefields of the highlands of North Vietnam. I heard many war stories told by Captain Nham, Captain Hai, “Old Man” Phat, and Captain Dien about the bloody battles fought in Hoa Binh and on the hill-top positions at Dien Bien Phu. On Christmas of 1964, during my first confusing days with the unit, I had accompanied Phan Nhat Nam out to the Tan Phong forest on the outer security perimeter of the Bien Hoa Airfield. Lolling in our hammocks, we shared a piece of pastry and sips of a hot liquor that let us feel every artery and vein in our bodies. We heard the booms of artillery guns echoing from the direction of Tan Uyen and the roar of jets laden with bombs taking off for night bombing missions. We were quietly listening to a small, pocket-sized radio when the playing of hymns and the pealing of church bells made us suddenly realize that it was Christmas Eve! The night that Christ was born, Christ who had come to bring peace to the world, but mankind was still suffering from the miseries and loss of war. In the six months since I left the military academy I had been sent to many places: From An Khe and Cu Chi to Binh Ba-Binh Gia, and now, this mid-night, I was slinging my pack onto my back for another operation. The cool morning air woke me up as we drove past the bars and Ha Tien cement plant, and then down the main highway that we could see dimly by the streetlights. The truck convoy carried us troops through the streets of the city while Saigon was still sleeping. The street-sweepers stopped sweeping to wave at us, and then they returned to sweeping away the dry leaves that the rush of our speeding trucks had scattered across the streets of the city. On 9 June 1965 our battalion arrived at the rear base of the 8th Airborne Battalion on the Tan Son Nhat Airbase and waited for the aircraft that would fly us up to Phuoc Long. The front pages of the newspapers were emblazoned with reports of the fighting in Dong Xoai. We had not even left for the city yet, but the press was already reporting that “tomorrow the 7th Airborne Battalion will be sent to Phuoc Long and will then be landed by helicopter in an area north of Dong Xoai.” We cursed to ourselves, saying: “Those fuckers! We have not even received our official orders yet and have not yet received the battle plan, and yet these journalists have already drawn sketches of our landing zone and have all the details. How the hell are we supposed to be able to fight?” Some high-ranking officer in a pressed and starched uniform and wearing spit-shines shoes must have wanted to make himself look important in the eyes of some journalists. Early on the morning of 10 June, our unit was flown up to Phuoc Long. The C-123’s roared down to the end of the runway and we ran out of the aircraft through the big cargo door at the tail end of the aircraft. We moved quickly into the rubber trees next to the airfield to wait to be helicoptered up to the area north of Dong Xoai the next morning. I told several of my friends that yesterday’s newspaper reports had been correct - we were indeed going to be landed by helicopter north of the town. We slung our hammocks between rubber trees to wait for the next morning, when we would be landed in the battle area. From the radio we heard the voice of a female announcer in the rear area sending sweet words of greetings to the “beloved soldiers in the remote corners of our country.” Dong Xoai, whose official administrative name was Don Luan, was located on Route 14 in Phuoc Long Province, more than 70 kilometers north of Saigon. The vast rubber tree plantation stretched all the way to Quan Loi in Binh Long Province. On the morning of 11 June, a helicopter unit transported us to Dong Xoai. The helicopter carrying Bony Nam [Phan Nhat Nam] had just taken off when it experienced a mechanical problem and crashed. From high above I saw smoke swirling around the helicopter’s fuselage. Bony Nam was injured and had to remain behind at Phuoc Long. The other soldiers said to one another, “Well, he’s lucky. He gets to return home to ‘hug his wife’ for 29 days before he gets a medical clearance. Secretly though, I thought to myself: “Damn, we’ve lost a helicopter before even entering the fight. That is a bad omen for us!” I sat in the chopper with my legs dangling outside the cabin. The sky was blue, with a few wispy clouds floating beneath us. The cold wind blowing into my uniform made me shiver. Dong Xoai came into view. Smoke and flames enveloped the district capital. From high in the air I saw the town market sitting right beside the highway, several brick houses standing out from among the areas of tin-roofed houses and thatched-roofed huts spread along a few paved streets. The helicopter landed us right on the main highway north of the town. I led my platoon quickly into an area of charred, destroyed houses along both sides of the road. The stench made me want to vomit; bodies of our soldiers and enemy soldiers were strewn throughout the streets of the town. A pack of owner-less dogs barked loudly at the sound of the helicopters and then ran away, disappearing into the forest. The 52nd Ranger Battalion had arrived in Dong Xoai the day before, but because they did not have enough men they had only searched and set up defensive positions in the western part of the district capital. I led my men in running towards the eastern part of town. Collapsed buildings and body were everywhere. A dead young boy with his eyes still open wide, sat leaning against a wall with bullet wounds all over his body. He had died without having time to close his wide-open eyes and mouth after being terrified by the sight of a man wearing rubber sandals and a pith helmet firing AK bullets into him! A mother lay dead clutching her suckling baby to her breast, her arm still holding the baby tightly as if to try to block the bullets that had riddled her body. An ox lay dead on the side of the road, killed while pulling an ox-cart filled with the bodies of dead Viet Cong. Scattered along the highway were a few bicycles and a truck from the plantation loaded with enemy bodies that had been hit by a bomb. The truck was still smoking and stank with the smell of dead bodies. The battalion was ordered to chase the enemy out toward the Thuan Loi Plantation, located more than six kilometers north of Dong Xoai. The 72nd Company was the lead company and my platoon was the lead assault platoon. My soldiers said to me: “Sir, since the day your arrived at our platoon, we have always been ordered to take the lead. This is too hard on us, Lieutenant!” I raised my arms to sky and laughed, then I followed my lead soldiers. We had advanced about two kilometers out from the district headquarters when I saw several charred, burnt-out helicopters sitting very close to the highway in an area of young, immature rubber trees. Our unit spread out and deployed around the rubber forest area to collect the bodies of soldiers from our 5th Infantry Division who had been ambushed when the helicopters landed them to relieve and clear Dong Xoai. The massive firepower of an entire enemy regiment had been waiting for them when the helicopters landed, so they had suffered very heavy casualties. Under the blazing summer sun, we quickly became exhausted as we recovered the bodies and collected them all in one area. My nose grew swollen and red from the bottle of fragrant Nhi Thien Duong oil that I used to cover the stench from the bodies, and my arms grew numb from the exertion of pulling the dead bodies to the collection site. It had been only a little over two days, but the bodies were virtually falling apart from rotting under the hot sun and the heavy downpours of the early days of the rainy season. I shivered involuntarily and got goosebumps when I saw ants crawling out of the ears, noses, and eyes of the dead. The clouds of buzzing flies swarming around the bodies and my eyes simply took my breath away. I suddenly crazed a cigarette but I did not dare to stick my hand into my pocket to get one because my hand stank with the stench of death. After we had carried several dozen bodies to the collection point, darkness began to fall. The battalion moved almost a kilometer to the north and searched the surrounding area to prepare to set up there for the night. I was starving because I had not eaten anything since breakfast, so I opened a can of meat and a bag of milled rice. The pork was covered with a layer of grease that looked so much like the rotting flesh of the dead bodies I had seen that afternoon that I vomited. I smoked continuously, and my heart was filled with sadness. … The next morning, when we woke up, we learned that a soldier from 74th Company had been killed when a large branch had fallen on him while he was sleeping. Using Route 14 as its guideline, the battalion conducted a sweep up the left side of the road through thick rubber tree vegetation; on the right side of the forest was an area of banana orchards and sugar cane fields farmed by the local civilians. The battalion split into two columns. The first column consisted of the 72nd Company, including the lead company, followed by 70th Company, the battalion headquarters, and the 71st Company bringing up the rear. The second column consisted of the 74th Company, leading in an extended combat formation, followed by the 73rd company. A number of civilians along with several ARVN 5th Division soldiers who had become separated from their unit who were fleeing down the highway toward Dong Xoai told us that there were very large numbers of Viet Cong who totally filled several portions of the rubber tree forest and at the Thuan Loi Plantation. A few enemy troops appeared in front of us and gunfire started to crackle. It was shortly before 3:00 in the afternoon of 12 June that Captain Phat, the Commander of 74th Company, had just captured a prisoner. Preliminary interrogation of the prisoner had disclosed that the enemy, consisting of the Q726th and Q763rd Regiments, were deployed in ambush positions intending to wipe out our Airborne unit to mark the formation of the VC 7th Division. Enemy troops were running around visibly at the edge of the tree line in an effort to entice us to chase them deep into the forest. I reported this to my superiors, but I was ordered to continue to advance. We began to get glimpses of a large number of red brick houses and of an airstrip through the leaves of the trees. I saw Dung off on my left moving his troops up parallel to my platoon. Large numbers of enemy troops could be seen right along the tree-line and in several houses on the right. Second Lieutenant Do’s troops opened fire to prevent the enemy from blocking the way to the airstrip. Enemy 12.7mm machine-guns and all kinds of other weapons suddenly opened up on us accompanied by shells from several 82mm mortars emplaced behind several lines of houses on the other side of the airstrip. Volleys of mortar shells rained down on us. I radioed a request for artillery and air strikes, but Captain Dien just cursed in response because the Operations Command Headquarters had refused to allow artillery fire or air strikes because they said there still were still large numbers of civilians inside the plantation compound. I shouted into my radio, “What fucking civilians? They’re all VC!” I could not understand where the Headquarters had gotten their information. I was there right on the front, and I could not see any civilians. All I could see was men wearing yellow-green khaki uniforms and pith helmets running all around the area of the rubber processing compound and the adjacent housing compounds. I was ordered to take and occupy the tree-line and several houses nearby to serve as a springboard from which to launch an attack across the airstrip to destroy the 82mm mortars and several heavy machine-guns firing from a water tower. I muttered to myself, “Death is certain for all of us. How can a 26-man platoon be expected to charge across an airstrip to take a few mortars?” But I was a soldier, so I had to obey orders. I was only a 2nd lieutenant, and if I refused I would be reduced in rank to a buck private! However, charging across an airstrip, almost 200 meters of flat, open space into a curtain of fire from enemy guns and heavy weapons that were just waiting for us meant that not one of us would survive to return to our base. Well, I thought, first we’ll take the tree-line and the houses, and then we’ll decide what to do next. Therefore, I directed our 57mm recoilless rifle to destroy the houses and pound the rubber-trees along the tree-line. Using the bloody experience of veteran soldiers with many years of combat under their belts, the 26 of us charged forward with all the strength our legs could muster in a race with death, ignoring the bullets that cracked past our ears. We directed all of our fire to our front, throwing hand grenades, stabbing with bayonets, and jumping over the heads of enemy troops, striving to make every action quick and precise in order to kill the enemy and save our own lives. We were able to capture the tree-line, which was strewn with bodies of enemy soldiers in a line of foxholes beside the trunks of the trees. We had only a very short distance to go to capture the houses. Our 57mm gunner again concentrated his fire on trying to knock down two rows of houses as we simultaneously used grenades to capture and occupy the first house. Enemy bodies were scattered amongst the piles of bricks, but gunfire continued as we eliminated the last enemy troops who were sill resisting. Through the fog of gun smoke and bullets, I reached the place where several soldiers had been wounded and sadly closed the eyes of two who had been killed and broke off the metal tags on which were recorded the name, age, service number, and blood type of each soldier. At this same time, at a place far away, in a rear base next to a rubber plantation, children would be playing in a classroom and young wives would be preparing dinner or sitting at a window thinking about their husbands. The wives would suddenly hear the bugle call for the lowering of the flag at the end of the day. If the husband had been back at the rear base, he would soon be coming home for dinner - but the wife did not know that when the bugle call ended and the NCO folded the flag that at that very time her husband’s unit was engaged in heavy fighting and that her husband would never be coming home! It suddenly grew very windy and the forest turned dark because of an oncoming line of dark clouds. The rain poured down in buckets. Captain Dien, my company commander, and 2nd Lt. Do ran to the place where I was located. I pointed across to the other side of the airstrip and told him that when the enemy mortar fire ended, the enemy would launch an all-out assault, and that they would swing around to hit our battalion’s flank and rear. Looking through his binoculars, the captain saw everything. He nodded his head in agreement with me and then moved back to the rear. The rain was still pouring down. I gave the 57mm recoilless to Lt. Do. With the senses of an old fox who had almost 20 years of combat experience, having risen from the rank of buck private to second lieutenant, Do just shook his head and said to me, “We are surrounded by more than a regiment of enemy troops.” He squeezed my hand tightly, then his bent-over shadow could be seen moving through the charred walls of the collapsed house as he returned to his platoon. The scars on his gaunt old face were blackened with gunpowder. Do used the 57mm to take out the enemy machine-gun nests on the water tower. On the other side of the airstrip, the 82mm mortars ceased firing and swarms of enemy troops, as thick as ants, were reinforcing the enemy attack columns attacking the flank and rear of 71st and 73rd Companies. Our unit was surrounded, with the airstrip on one side and the open highway on the other. Our Airborne soldiers had only the section of forest in between which we could use to try to fight against the enemy’s bloody assault waves. We, who were professional soldiers right there on the front line, had clearly reported that there were no more civilians left in the plantation compound and that the enemy was massing more than a regiment of troops there, so why were they still refusing to provide us with artillery and air support? It was clear to me that our stupid senior commanders wanted to kill us; they wanted to allow two enemy regiments to annihilate our Airborne troopers. I watched as enemy troops moved around out in the open, out of range of our individual weapons, and I did not know what to do. If we were given the same air and artillery support we had received in previous battles, we could have taken on an entire enemy regiment! War has some extremely bitter moments. We knew we were about to die but all we could do was to close our eyes and wave our arms in the face of decisions made by our incompetent commanders. In extremely dangerous circumstances such as the one we were in, we had the right to think for ourselves and to curse our commanders! Through the rain I saw the enemy begin to launch their attack across the airstrip. Guns of all calibers opened fire as screams rang out from the enemy troops as bullets and shells ripped through their bodies. The enemy set up a medium machine gun, using the bodies of their dead as a shield from our bullets. Pieces of flesh erupted into the air when the bodies were hit by our bullets. The blood from the carnage mixed with the heavy downpour, dyeing the airstrip a bright red. Like moths rushing to a flame, the enemy insanely launched a third assault across the airstrip, but even though they used the bodies of their comrades to shield themselves, we stopped the enemy dead in the middle of the airstrip. Claymore mines blew away groups of enemy troops who had managed to get in close to our defense line. Enemy bodies were blown into the air and pieces of flesh and bone rained down on our heads and shoulders. The enemy stopped their attack, probably because of their heavy losses. The sounds of gunfire continued from all around us. Suddenly, I heard the voice of Captain Nham, our Battalion Commander, over my radio. He told me that Captain Dien had been killed, and he ordered me to collect the company and move back to the rear to help hold off the enemy’s overwhelming assault waves. I asked him why we still had not received any artillery or air support. He responded by cursing loudly into his radio microphone, then he told me that the Operation Headquarters still refused to authorize air or artillery support because they had an intelligence report that there were still civilians inside the plantation compound! At that moment, Sergeant Major Tang Man Tai reported to me that 2nd Lt. Do had been killed. I remembered his tight squeeze of my hand and his sad eyes from our last meeting that afternoon. After twenty years of near constant fighting, he was now truly gone. I silently told Do, “Rest in peace” and prayed that he would not be so weary and tired in his next life. The rain continued to fall. It was now after 6:00 in the afternoon, and the fighting continued along the edge of the forest, with our troops and enemy soldiers screaming at each other and fighting one another for the cover of individual rubber tree trunks. Our battalion’s casualties continued to increase and there were bodies strewn everywhere. I ran into Captain Phat, the Commander of 74th Company. I asked him about Dung. He shook his head and said that Dung had been killed right next to the airstrip while his men were attacking a line of brick houses next to the airstrip after they had destroyed several enemy machine-gun nests and 82mm mortar positions. Stunned by the news, I stumbled over to Corporal Phan Nien’s medium machine-gun, which was continuing to fire at the enemy. Not far from me, Captain Nham, our battalion commander who had taken over command of the battalion only a little over a month before, was shouting into his radio. Captain Hai, the 73rd Company Commander who was concurrently the deputy battalion commander, had just been killed. That stubborn old soldier who had fought in Laos and at the outpost named Beatrice at Dien Bien Phu was gone! First Lieutenant Hop, the 70th Company Commander, dove in beside me. He said that the 73rd and 71st Companies were fighting against enemy human-wave assaults being launched from the direction of Route 14 and the two sides were engaged in close-quarters combat on the road surface itself. Corporal Thang buckled over just as he was fired his M-79. He had been hit by an enemy bullet. I heard the bullet rip through his body and shatter his chest. I hugged my AR-15 and rolled over to another tree-trunk. At that moment an enemy grenade exploded. I fired a burst from my rifle. Several Viet Cong charged toward me and I emptied a magazine from my AR-15 into them, blasting them backward. As I heard a scream from 1st Lt. Hop, I glanced over and saw Captain Nham, wearing a rain poncho, running toward me. He was firing his folding-stock M2 carbine at a group of enemy soldiers charging toward him. Filled with blood-lust, I stood up and raked the enemy soldiers with an entire magazine from my AR-15. Captain Nham waved at me and then ran on, accompanied by his bodyguards. I jumped over the bodies and ran toward the highway. Several enemy 12.7mm machine-guns were tearing apart the tree-line and the road’s surface, cutting down any soldier who tried to cross the road to get to the banana orchard on the other side of the highway. Bodies of both our soldiers and enemy soldiers littered the road and lay across the barbed wire fence next to the banana orchard. Several soldiers from the 71st Company told me that 1st Lt. Ky, their company commander, had been killed as well. I tried calling out on my radio but I did not hear the voice of my battalion commander. Captain Phat came on the radio and said that the commander was fighting the enemy near the highway. Our battalion had virtually disintegrated. All four company commanders were dead and we had lost contact with the battalion commander. Suddenly I saw stars in front of my eyes, like someone had slapped my face. My arm flew upward and the AR-15 dropped from my grasp. I collapsed next to Corporal Phan Nien’s medium machine-gun, who continued to spray bullets at the enemy. When I recovered consciousness, it was almost dark. The rain was no longer coming down in large drops, but it was continuing to drip down in the rubber tree forest. The body of an enemy soldier lay across my stomach and his pith helmet lay right next to my face, making me feel like I couldn’t breathe. My face and my right army were numb and hurt like hell. I made an effort to pull my left arm out from under the enemy body. My watch said it was a little past 7:00 in the evening, and the sky was still light. I raised my left hand to my face. A bullet had cut through the bridge of my nose and my cheekbone. I was bleeding heavily and my face was swollen and so numb that I could not feel anything. My right arm had been pierced by two AK bullets, and the four holes were blackened by powder-burns. The raindrops finally woke me up completely. I was able to pull up my knees,and with my last bit of strength I was able to push the dead body off to one side. The enemy’s chest had been ripped wide open, and his bloody stomach and intestines had dyed my entire face and torso red with blood. I crawled to the foot of a rubber tree and lay there un-moving because of my extreme pain and exhaustion. There were now only a few scattered shots from both sides that could be heard. The enemy soldiers shouted out to each other and they began to police up the battlefield, searching and cursing as they went because of their tremendous losses in the just-concluded battle. Several enemy soldiers walked past the place where I was laying. Seeing the rank insignia on my shirt-collar, one of them let out a curse in a Northern accent, kicked my leg, and then bent down to look. I held my breath and was waiting for death when I felt the cold steel of an AK bayonet rake across my face. It was still raining, and perhaps the bleeding wounds on my face, the blackened bullet-holes in my arm, and the bloody chunks of intestine still sticking to my stomach made them think that I was dead. Cursing, they turned me over so they could take my cartridge belt off, which also contained my glasses and my transistor radio. Then they took my watch off my wrist, one of them stuck it in his pocket, and then they left. I heard the Viet Cong soldiers arguing about how to share the things they had taken from me. Tears began to fill my eyes as I thought about how my mother prayed at the altar for my good fortune every day. I truly had been granted a great deal of good fortune. I began to feel cold as if the cold rain penetrated right through me. I had virtually no strength left because I had lost so much blood. I crawled over to Corporal Tam’s body, pulled off his poncho and used it to cover my head and my chest, and then laid there next to the body of my radioman. The two of us laid there, one dead and one still alive, with our bodies curled up next to each other. I looked at Tam sadly, reminiscing on all of the good and bad times we’ve had together since I had been assigned to the platoon. I thought about my parents. At this time they would have been eating dinner. They would have certainly thought about me and my mother would have run over to the family altar and lit an incense stick to pray for me. As I faded from consciousness, I thought about Dung, my closest friend at the Academy and in the battalion, someone who often told me what I should do, but who still always hung around with me when we had free time at our unit. The image of Dung appeared in my mind…. [Long section in which the author has a mental conversation with the dead Lt. Tran Tri Dung, recalling their past history together] The rain stopped and it was completely dark. I heard the sounds of aircraft and parachute flares lit up the night sky. Enemy soldiers were gathering and calling out to one another as they moved down the highway. They were using several large trucks and dozens of ox-carts from the plantation to transport their wounded. In the light of the flares, I saw large numbers of enemy soldiers, thick as ants, moving up the highway headed northward from the plantation. An hour later they used more trucks and ox-carts to carry off their dead, and then they all disappeared. I crawled over to the medical bag carried by our medic, who lay dead nearby. I took out a bottle iodine and alcohol and poured the contents on the wounds on my arm and on my face. Then I used my red neck scarf, the company insignia of 72nd Company, to wrap around my wounded arm and then tied the scarf around my neck to support my arm. In the light of the flares, I crawled forward and I encountered many bodies. I heard the sounds of fighter aircraft in the sky above and hurriedly crawled behind a tree-trunk. The aircraft’s machine-guns strafed the ground, and then it dropped bombs that whistled through the air into this patch of trees. I shook from the concussion and blood ran from my mouth because the bomb exploded too close to me. I cursed the pilot for dropping bombs on us after the battle was already over, while during the afternoon battle we had not received even a single round of artillery support! Totally exhausted, I passed out amidst the echoing bomb explosions. [More mental conversations with the dead Lt. Dung] Almost two days later, after falling down countless times and struggling to stand back up again, I ran into a few fellow soldiers who were also lost. Only then did I realize how deep was the feeling of true brotherhood between soldiers on the battlefield By the time I reached Dong Xoai, my wounds had changed color, my flesh had begun to smell and was infected. Dr. Dam treated me solicitously and I waited for an aircraft to transport me to the Cong Hoa Hospital [the main Army Hospital in Saigon]. When I walked past the operations room, I stuck my head in and asked why we had not been given any air or artillery support, but since I was just a 2nd Lieutenant, no one bothered to give me an answer. In fact, what I received in return was a statement that I will not forget for as long as I live: “You’re just a lieutenant. What the hell do you know! Get out of here. It’s still early in the morning and here you are making so much noise that the boss won’t be able to sleep! Be careful or we’ll lock you up right now!” I cursed the entire operations room and grabbed an M2 carbine that was propped up against the wall. Several officers and MPs grabbed me and pulled me outside. The kind of soldierly fellowship that was present in that goddamned operations room turned my stomach! When I got back to the Cong Hoa Hospital, I ran into Bony Nam [Phan Nhat Nam] and a number of other friends who were being treated there. Only then did I learn that two VC regiments, the Q762 and Q763 Regiments, had attacked Dong Xoai and ambushed the 7th Airborne Battalion in order to mark the formation of the National Liberation Front’s 7th Division. The Viet Cong had two entire regiments at full personnel strength and armed with modern weapons like AK-47s and B-40 rocket launchers that were being used on our battlefield for the first time, while our Airborne troops had only three AR-15s and M-79s in each platoon - at this time, those were the most modern weapons possessed by the South Vietnamese Army. Our battalion commander, deputy battalion commander, all four company commanders and many other officers had been killed. I was the only wounded officer who had been able to make it back several days later. Our battalion had been shattered - more than 200 soldiers had been killed and so many others had been wounded. Bony Nam and I felt sick with sorrow and pain. We walked the halls of the Cong Hoa Hospital and met with soldiers from the battalion’s other companies. They told us that Dung had led his platoon in destroying the 82mm mortar and machine-gun emplacements, they described how he fought the enemy hand to hand and how he had fallen when the enemy overwhelmed his platoon with a force many times as large. They also told us how Captain Phat had led some of the surviving soldiers in a fight that lasted all night and how he had withdraw to the banana orchard on the other side of the road and waited there for reinforcements, but after waiting and waiting uselessly, they had finally returned to Dong Xoai. A number of soldiers had followed Nhut in fighting their way to the other side of the barbed wire fence along the highway and then had waited there to collect soldiers who had become separated from their units and to collect the wounded. This group had not pulled back to the district capital until the next day. No one knew what had happened to Rot. Some said he had been killed but others said he had been captured. Two days after the battle, Captain Phat and 1st Lt. Nhat, along with the Rangers, had come back to Dong Xoai to collect the bodies of our dead comrades and evacuate them from the battlefield. [Translator’s Note: Phan Nhat Nam, in his book “Mark of a Combat Soldier” [Dau Binh Lua], published in Saigon in 1973, tells this same story and sources the story to his friend “Hai” (the author of this account, Doan Phuong Hai), who told it to him after the battle. The only significant difference between this story and the one told in Phan Nhat Nam’s book is that in this book Nam is reported to have been injured in a helicopter crash that occurred at the airstrip from which the helicopters took off to assault the Dong Xoai area, while in Nam’s book Nam says that he had stayed back at the battalion’s rear base because he was still recuperating from a stomach wound he suffered in an operation to clear Route 19 in the An Khe area in the Central Highlands in March 1965. It is probable that Phan Nhat Nam’s version of the reason he did not participate in this operation is the correct one. ",
            "date": "Answered December 11, 2018",
            "views": "16",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rush Lovelyy",
                    "user_href": "/profile/Rush-Lovelyy"
                },
                {
                    "user_id": "Wallie Autry",
                    "user_href": "/profile/Wallie-Autry-1"
                },
                {
                    "user_id": "Sarahlynn Bower",
                    "user_href": "/profile/Sarahlynn-Bower"
                },
                {
                    "user_id": "Roger Steward",
                    "user_href": "/profile/Roger-Steward"
                },
                {
                    "user_id": "John D. Sahr",
                    "user_href": "/profile/John-D-Sahr"
                },
                {
                    "user_id": "Michael Frain",
                    "user_href": "/profile/Michael-Frain-7"
                },
                {
                    "user_id": "Peter Rainbow",
                    "user_href": "/profile/Peter-Rainbow-1"
                },
                {
                    "user_id": "Trinity Young",
                    "user_href": "/profile/Trinity-Young-7"
                },
                {
                    "user_id": "Thomas Mitchell",
                    "user_href": "/profile/Thomas-Mitchell-24"
                },
                {
                    "user_id": "Freek Voorwinden",
                    "user_href": "/profile/Freek-Voorwinden"
                }
            ]
        }
    ]
}