{
    "title": "What are some amazing strategies which were used in World War 2 and World War 1? - Quora",
    "tags": [
        "World War I",
        "World War II",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Davis",
                "href": "/profile/Jon-Davis-10"
            },
            "answer_text": "The best strategies that I could think of were used during World War II and they are the Island Hopping Campaign and the Blitzkrieg. Blitzkrieg is an anglicised word describing all-motorised force concentration of tanks, infantry, artillery, combat engineers and air power, concentrating overwhelming force at high speed to break through enemy lines, and, once the lines are broken, proceeding without regard to its flank. Through constant motion, the blitzkrieg attempts to keep its enemy off-balance, making it difficult to respond effectively at any given point before the front has already moved on.During the interwar period, aircraft and tank technologies matured and were combined with systematic application of the German tactics of infiltration and bypassing of enemy strong points. When Germany invaded Poland in 1939, Western journalists adopted the term blitzkrieg to describe this form of armoured warfare. Blitzkrieg operations were very effective during the campaigns of 1939–1941. These operations were dependent on surprise penetrations (e.g. the penetration of the Ardennes forest region), general enemy unpreparedness and an inability to react swiftly enough to the attacker's offensive operations. During the Battle of France, the French, who made attempts to re-form defensive lines along rivers, were constantly frustrated when German forces arrived there first and pressed on.Academics since the 1970s have questioned the existence of blitzkrieg as a coherent military doctrine or strategy. Many academic historians hold the idea that the German armed forces adopted \"blitzkrieg\" as an offensive doctrine to be a myth. Others continue to use the word to describe the style of breakthrough warfare practised by the Axis powers of this period, even if it were not a formal doctrine. The concepts of Blitzkrieg form the basis of present-day armoured warfare. Leapfrogging (also called \"islandhopping\") was a military strategy employed by the Allies in the Pacific War against Japan and the Axis powers during World War II. The idea was to bypass heavily fortified Japanese positions and instead concentrate the limited Allied resources on strategically important islands that were not well defended but capable of supporting the drive to the main islands of Japan. This strategy was possible in part because the Allies used submarine and air attacks to blockade and isolate Japanese bases, weakening their garrisons and reducing the Japanese ability to resupply and reinforce them. Thus troops on islands which had been bypassed, such as the major base at Rabaul, were useless to the Japanese war effort and left to \"wither on the vine.\" General Douglas MacArthur greatly supported this strategy in his effort to regain the Philippines. This strategy began to be implemented in late 1943 inOperation Cartwheel. While General Douglas MacArthur claimed to have invented the strategy, it initially came out of the Navy.Leapfrogging had a number of advantages. It would allow the United States forces to reach Japan more quickly and not expend the time, manpower, and supplies to capture every Japanese-held island on the way. It would give the Allies the advantage of surprise and keep the Japanese off balance. The overall leapfrogging strategy would involve two prongs. A force led by Admiral Chester Nimitz, with a smaller land force and larger fleet, would advance north towards the island and capture the Gilbert and Marshall Islands and the Marianas, going generally in the direction of the Bonin Islands. The southern prong, led by General MacArthur and with larger land forces, would take the Solomons, New Guinea, the Bismarck Archipelago, advancing toward the Philippines. ",
            "date": "Updated August 21, 2012",
            "views": "32",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bethany Jones",
                    "user_href": "/profile/Bethany-Jones-194"
                },
                {
                    "user_id": "Gourav Dey",
                    "user_href": "/profile/Gourav-Dey-44"
                },
                {
                    "user_id": "Roshin Ramakrishnan",
                    "user_href": "/profile/Roshin-Ramakrishnan"
                },
                {
                    "user_id": "Mike Carr",
                    "user_href": "/profile/Mike-Carr-98"
                },
                {
                    "user_id": "Fabio D'Alessandro",
                    "user_href": "/profile/Fabio-DAlessandro"
                },
                {
                    "user_id": "Steva Vasara",
                    "user_href": "/profile/Steva-Vasara"
                },
                {
                    "user_id": "Naphat Buristrakul",
                    "user_href": "/profile/Naphat-Buristrakul"
                },
                {
                    "user_id": "Andrew Givens",
                    "user_href": "/profile/Andrew-Givens-1"
                },
                {
                    "user_id": "Rayed Rahman",
                    "user_href": "/profile/Rayed-Rahman"
                },
                {
                    "user_id": "Victor Gao",
                    "user_href": "/profile/Victor-Gao-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Wilson",
                "href": "/profile/Bill-Wilson-183"
            },
            "answer_text": " The Germans using zepplins to bomb London at night was an amazing new tactic. The USA took advantage of having Hollywood studios that could build period accurate sets for movies. The US Army had them build the typical European houses, outbuildings, villages and larger urban buildings on sets out in the countryside where the GI’s could become familiar with their designs when trying to assault or defend those. The US also used the Hollywood directors and sound men to make wire recordings of the racket made by GI’s and their vehicles when in transit, getting into position and when being massed for an offensive strike. The recordings were then played thru a pair of loudspeakers that usually were made up with each having 12 horn speakers. The operators were trained to use the terrain to their advantage to project the sound further. They were used to make the Germans think there was a build-up of US forces in areas they had lightly defended so they would redeploy men and material from the sector the US Army wanted to attack. General George Patton used them to get an advantage for crossing the Rhine River. He had found an ideal location where it’s bridge had been blown and the small village on the opposite side was only manned by Volksturm troops. A ways to their rear was a sizable detachment of German regulars that would’ve gave the 3rd Army problems when trying to throw a pontoon bridge across the river. Patton’s forward scouts reported that the village’s taverns had just received a load of fresh beer and information from a disgruntled local that the Volkstrum will get paid in a couple days then blow it on getting drunk on beer that evening. Armed with that information, George sent his sound tanks further down river to make the noise of a large troop build-up. That drew away the German regulars from the village. George had his trailer trucks with the bridging equipment prepositioned along the road leading to the river and had them start building the pontoon bridge in the dead of night, figuring that the civilian soldiers were in a drunk sleep. They got the bridge built in short order without being detected nor were his tanks and trucks as they crossed. The Germans woke up to find the streets full of US GI’s, tanks and trucks so offered no resistance. At that time, Field Marshall Montgomery was still gathering up forces to cross the Rhine where he faced stout German defensive positions. That morning an aide informed Bernard that Patton crossed the Rhine as soon as he came up on it. Montgomery said that was interesting and went back to his set-piece planning. ",
            "date": "Answered September 12, 2018",
            "views": "4",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bethany Jones",
                    "user_href": "/profile/Bethany-Jones-194"
                },
                {
                    "user_id": "Ryan Brians",
                    "user_href": "/profile/Ryan-Brians"
                },
                {
                    "user_id": "Charles Simpson",
                    "user_href": "/profile/Charles-Simpson-1"
                },
                {
                    "user_id": "Dries Haans",
                    "user_href": "/profile/Dries-Haans"
                },
                {
                    "user_id": "Sachin S. Shenoy",
                    "user_href": "/profile/Sachin-S-Shenoy"
                },
                {
                    "user_id": "Top Cat",
                    "user_href": "/profile/Top-Cat-64"
                }
            ]
        }
    ]
}