{
    "title": "What made Ronald Reagan a popular president? - Quora",
    "tags": [
        "Ronald Reagan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Clary",
                "href": "/profile/Bill-Clary"
            },
            "answer_text": "Reagan's popularity was based on a combination of his policies, his demeanor, his ability to communicate, and good fortune. Any one of the set would not have been enough. For example, polls taken throughout the 1980s found that the public did not support some of his more cherished positions, but most of them \"liked\" Reagan. The good fortune part comes from the fact that the economy was \"bad\" at just the right times for Reagan's presidency to succeed. He took office during a time of high interest rates and high inflation. The economy slipped into a recession late in Reagan's first year that proceeded to last throughout the second year of his administration. Partly as a result, Reagan's approval rate fell below 50% for most of 1982, and the Democrats scored a big victory in the 1982 midterm elections. However, the economy rebounded in 1983 and was riding high by 1984 when he ran for re-election. As noted above, he was unpopular for most of 1982. His approval rating was also below 50% for much of his second term, especially after the Iran-Contra scandal broke into the open. His popularity began to rebound toward the end of his Presidency, and he was one of three Presidents to leave office at the end of his term with an approval rating greater than 60% (the other two being Dwight Eisenhower and Bill Clinton). If the recession in the early 80s had lasted into 1984, Reagan probably would not have been re-elected. If Iran-Contra had come to light a year later than it did, it is conceivable that Reagan would have been below 50% in 1988, and he would have been remembered somewhat differently. Machiavelli wrote that fortune perhaps rules half of our lives. We can't know precisely what hand we will be dealt. The best we can do is to prepare and to be flexible enough to change our behavior in light of those hands. Reagan was lucky in that his bad hands were dealt at fortuitous times, but he was also good at playing his hands. Reagan entered office as the consummate Cold Warrior, but when Gorbachev took office in the USSR, he changed his tack and proceeded to negotiate some of the most important arms control treaties in history. He came into office as a dedicated cutter of Federal taxes; the budget passed in 1981 did contain the largest Federal tax cut since Coolidge. But when the budget deficit ballooned, he reversed course and proceeded to approve a series of tax increases, including the 1986 revenue code changes which meant some of the largest tax increases in Federal history. Reagan understood intuitively that as conditions changed, he had to change with them. I think that and his genuine likeability allowed him to persevere across some bad patches. Interestingly, when Reagan negotiated and approved tax increases, the result was far different from when his successor George H. W. Bush did so under similar circumstances. Reagan got away with it. Bush did not. Reagan and his advisors also understood how far he could go in trying to achieve his conservative political program; where the public would not follow, Reagan did not try to lead, at least beyond rhetoric. All in all, Reagan was a skillful politician. Skillful politicians are more likely to succeed than unskillful politicians dealing with the same circumstances. ",
            "date": "Answered October 15, 2016",
            "views": "78",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kendra Douglas",
                    "user_href": "/profile/Kendra-Douglas-8"
                },
                {
                    "user_id": "Rango",
                    "user_href": "/profile/Rango-30"
                },
                {
                    "user_id": "Grigori Rasputin",
                    "user_href": "/profile/Grigori-Rasputin-21"
                },
                {
                    "user_id": "Ikem Maduakor",
                    "user_href": "/profile/Ikem-Maduakor"
                },
                {
                    "user_id": "Liron Berisha",
                    "user_href": "/profile/Liron-Berisha-1"
                },
                {
                    "user_id": "Nathan Brown-Haysom",
                    "user_href": "/profile/Nathan-Brown-Haysom"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Chockle Cheung",
                    "user_href": "/profile/Chockle-Cheung"
                },
                {
                    "user_id": "Jack Scoufis",
                    "user_href": "/profile/Jack-Scoufis-1"
                },
                {
                    "user_id": "Elaine Scholl Sawdye",
                    "user_href": "/profile/Elaine-Scholl-Sawdye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Emerson",
                "href": "/profile/Don-Emerson-1"
            },
            "answer_text": "Reagan’s popularity is entirely a product of media mythology. His so called “presidency” was one of the most clever frauds ever to be played out in US politics. Reagan was known when he was the President of the Screen Actor’s Guild, to be unable to grasp ideas and manage concepts. Even then, he was nothing but a well known personality who could read a script. Everyone else had to tell him what to do and say, because he had no idea himself. He went on for a few years in the same vein, as Governor of California, and then was propelled to the White House. And all of this his political “experience” was the result of PR experts orchestrating appearances and speeches so that the public would get the desired image. During his terms as president, he quite frequently slept through important meetings. When he was rambling instead of reading a carefully prepared speech, he often mixed up the plots of movies that he had seen, with reality. When he was asked to testify about Iran Contra, he couldn’t remember any of the decisions, events, or even the names of his own cabinet members. His one saving grace was that he could read a script/speech, convincingly, even if he had no idea what the words that were coming out of his mouth meant. His image, the image we have of him today, is entirely manufactured by the media, to be accepted at true by an uncritical public. And it is no more substantial than a wisp of smoke in a hurricane.  When Was Ronald Reagan Senile? When Wasn't Ronald Reagan Senile? ",
            "date": "Answered October 15, 2016",
            "views": "23",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christen Sawls",
                    "user_href": "/profile/Christen-Sawls"
                },
                {
                    "user_id": "Tom Reneqe",
                    "user_href": "/profile/Tom-Reneqe"
                },
                {
                    "user_id": "Aldane Burnett",
                    "user_href": "/profile/Aldane-Burnett"
                },
                {
                    "user_id": "Stephen Connor",
                    "user_href": "/profile/Stephen-Connor-25"
                }
            ]
        }
    ]
}