{
    "title": "What does a nationalist believe in? - Quora",
    "tags": [
        "Nationalism",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Wawrzuta",
                "href": "/profile/David-Wawrzuta"
            },
            "answer_text": "Nationalists hold a variety of different ideological beliefs and can be found all over the political spectrum. Although it is commonly believed that all nationalists are right-wing conservatives, this simply isn’t true. Some nationalists hold right-wing economic views, others hold left-wing economic views. Some nationalists hold right-wing socio-cultural views, others hold left-wing socio-cultural views. Some nationalists are absolutely against state intervention in the economy and society, whereas some nationalists are supporters of authoritarianism or totalitarianism. Some nationalists are pro-NATO, others are anti-NATO, and of course, some nationalists are pro-EU, and others are anti-EU. This results primarily from the fact that the ideas of nationalism can be applied to almost every political and economic ideology which exists. Nationalism is compatible with conservatism, capitalism, progressivism, liberalism, libertarianism, democracy, republicanism, monarchism, fascism, national socialism, and socialism. The only ideologies which aren’t strongly compatible with nationalism are Anarchism and Marxism, but that hasn’t stopped people from being nationalist Anarchists or nationalist Marxists, despite how contradictory it may seem. Nonetheless, despite being a group which holds a very diverse range of political and economic beliefs, there are two things which all nationalists agree on, to a certain degree. First of all, all nationalists believe that the socio-cultural organization of humanity into separate nations, is, as of right now, the most efficient, productive, and secure form of socio-cultural organization. Nationalists are against the organization of humanity into separate tribes (tribalism) and lower forms of socio-cultural organization. Second of all, all nationalists believe in self-determination for the various nations of the world, to a certain degree. However, this belief in self-determination for all nations can be severely limited when nationalism is combined with imperialist or expansionist beliefs, and in other cases. As such, nationalists are a very diverse group when it comes to their economic and political beliefs, nonetheless, all nationalists believe in the primacy of the socio-cultural organization of humanity into separate nations, and likewise, all nationalists believe in the idea of national self-determination, to a certain degree. ",
            "date": "Answered February 9, 2020",
            "views": "16",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mauro Spatari",
                    "user_href": "/profile/Mauro-Spatari"
                },
                {
                    "user_id": "Jack Cornochan",
                    "user_href": "/profile/Jack-Cornochan"
                },
                {
                    "user_id": "Hanna Kresko",
                    "user_href": "/profile/Hanna-Kresko"
                },
                {
                    "user_id": "Simon Ball",
                    "user_href": "/profile/Simon-Ball-15"
                },
                {
                    "user_id": "Jimboy Manalili",
                    "user_href": "/profile/Jimboy-Manalili"
                },
                {
                    "user_id": "Fitzpatrick Burnette",
                    "user_href": "/profile/Fitzpatrick-Burnette-1"
                },
                {
                    "user_id": "Matija Urankar",
                    "user_href": "/profile/Matija-Urankar-1"
                },
                {
                    "user_id": "Callum Boyle",
                    "user_href": "/profile/Callum-Boyle-5"
                },
                {
                    "user_id": "Bob Ross",
                    "user_href": "/profile/Bob-Ross-188"
                },
                {
                    "user_id": "Ari Jefferson",
                    "user_href": "/profile/Ari-Jefferson-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abraham Gavin",
                "href": "/profile/Abraham-Gavin"
            },
            "answer_text": "A nationalist, is, quite simply, one who is concerned about their nation (people), and looks out for them first. This is what nationalists, in the classical sense of the term, believe. “People” can mean in a blood sense (see ethnic or race nationalism) but there are also other factors which unify people in a national sense. (The word “national” can refer strictly to ethnicity [from Greek “ethnos” used as their word for nation], but there are other forms of national unity as well.) This means that, contrary to popular usage, “nation” does not mean the same thing as “country.” People will falsely claim that nationalism means “I want my people to be supreme to all others/ I want my people to rule over [x] group(s) of people.” This is not nationalism - this is chauvinism. Some have tried to say this is the definition, but this idea has been quite recent, the classical definition is what I wrote above in bold. Nationalism can be thought of like this. I have a dog. My friend also has a dog. My friend’s dog is overdue to go to the veterinarian, but so is my dog. My car can only take one dog at a time. I take my own dog. I do not take my own dog necessarily because I hate my neighbor’s dog, but because this dog is closer to me and has a special place. Whenever someone says “nationalism is wrong,” I ask them two questions: 1.) Do you have a family? 2.) Do you love your family? At the end of the day, the nation is merely an extension of the family. It would make sense, if one looked out for their family with somewhat of a pre-eminence, to then do the same for one’s nation. If they don’t, well, it makes sense then why - by their logic - they wouldn’t be a nationalist. Side note: there are also a contingent of (mostly) reactionary monarchist types who claim that this phenomenon did not exist prior to the Age of Enlightenment. This is false, and I can demonstrate why. If you want me to elaborate why and how this is false, you can ask in the comments below. Nationalism, in this definition by which it has been classically understood, can sometimes be unnecessary or detrimental given certain situations, but generally I would argue that it is healthy to have. ",
            "date": "Answered January 27, 2020",
            "views": "111",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jean Mendoza",
                    "user_href": "/profile/Jean-Mendoza-45"
                },
                {
                    "user_id": "Jorge Long",
                    "user_href": "/profile/Jorge-Long"
                }
            ]
        }
    ]
}