{
    "title": "What has been the longest running government in history? - Quora",
    "tags": [
        "Government",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Golding",
                "href": "/profile/Mark-Golding-10"
            },
            "answer_text": "Today is December 9, 2019, and next year some of the states mentioned will be a year older than I calculate today. It is possible that the longest running government in the world was the Roman state. The eastern capital of Constantinople was officially bounded in AD 330, so bureaucrats should have begun working there in various government offices at least as early as 330. And of course many jobs and entire bureaus of the government were abolished or added over the course of centuries. But even as late as AD 1204 there should have been some civilian and military officials at Constantinople who were the successors of officials there in 330, 874 years earlier. Constantinople was captured by the Fourth Crusade in 1204, and the crusaders established what is usually called the Latin Empire of Constantinople, while eastern Roman or “Byzantine” leaders established several rival Roman states in exile. So at the shortest minimum I could think of, the Roman state lasted for only a mere 874 years without interruption. But if various interpretations of longest running are allowed, the Roman state could be considered to have lasted since the foundation of Rome about 853 BC to 653 BC until the fall of Constantinople in 1453, or for about 2,106 to 2,306 years. And if the Holy Roman Empire is considered to be a continuation of the Roman Empire, the Roman state could be considered to have lasted for about 2,459 to 2,659 years from the foundation of Rome about 853 BC to 653 BC to 1806. The Holy Roman Empire itself is usually considered to have lasted for either 844 years from 962 to 1806 or 1,006 years from 800 to 1806. It is commonly said that the Chinese Empire lasted for 2,133 years from 221 BC to AD 1912. But there were several times in that period when China divided into several states, usually followed by bloody civil war where thousands, and millions, and often tens of millions of people died., before a Chinese state, or sometimes a foreign state, conquered the whole of China in bloody wars to unify it again. So some historians think of Chinese imperial history as a succession of separate empires instead of a single continuous empire lasting for 2,133 years. It is often claimed that the Japanese state has existed for 2,679 years since 660 BC. But no serious historian thinks that the legendary history of Japan is correct. I sometimes read that Kinmei (reigned 539?-571?) was the first totally historical monarch of Japan. And some of the stories about Japanese history might or might not be accurate for several hundred years before Kinmei. Some historians consider Ojin (who might have reigned from AD 270–310) as the first historical monarch of Japan. Thus the Japanese state seems to have existed since sometime between the reign of Kinmei, 1,448 to 1,480 years ago and the reign of Ojin, allegedly 1,709 to 1,749 years ago. The modern Ethiopian state has lasted 28 years since the end of communist rule in 1991, or 45 years since the monarchy was abolished in 1974, or 78 years since the Italians were defeated in 1941, or 749 years since the foundation or restoration of the Solomonic dynasty in 1270, or for some other length of time. The realm that the Solomonic dynasty took over in 1270 was more or less (and it is uncertain how much more or less) a continuation of the Kingdom of Axum that lasted from sometime in the first century AD (AD 1-AD 100) to about 960 (give or take some decades). Thus the Ethiopian monarchy might possibly have lasted more or less continuously for between 1,874 years from 100 to 1974 and for 1,973 years from 1 to 1974. And the Ethiopian state might have lasted more or less continuously for between 1,919 years from 100 to 2019 and for 2,018 years from 1 to 2019. And that is very impressive, except for all the civil wars and revolutions in all those centuries which have seriously damaged claims of continuity. But there’s more! Ethiopian medieval legend claimed that Ethiopia was founded by Menelik I, the son of King Solomon of Israel and the Queen of Sheba. King Solomon, if real, would have reigned about 970–931 BC. So Menelik I should have ruled Ethiopia about 950 BC. So the Ethiopian monarchy lasted between 704 years between 1270 and 1974, and about 2,924 years from about 952 BC to 1974, and the present state of Ethiopia has lasted for between 28 years since 1991 to 2,969 years since about 950 BC. 2,969 years is 106.035 times as long as 28 years, so consistent definitions are necessary for determining the correct record holder. Of course ancient states like Egypt, Assyria, and Babylonia supposedly lasted for thousands of years. But their government continuity was broken up by rebellions, civil wars, periods of foreign conquest, periods of division, etc., etc. After Egypt was first united into one kingdom, it was united for the early Dynastic Period and the Old Kingdom, then was disunited for about 200 years, the First Intermediate Period, then united for about 380 years in the Middle Kingdom, then divided for centuries in the Second Intermediate Period, including rule by the foreign Hyskos, then united for the New Kingdom period, followed by the Third Intermediate Period, including conquest of Egypt by Libyan kings and by Nubian Kings, followed by the Late Period and then by Persian conquest. So it is hard to say that Egypt had the same government continuously for all those thousands of years. And the same goes for the history of Assyria and Babylonia. So a correct definition of how continuous a government has to have been to qualify is necessary. With a very strict definition, the longest running government in history might one which lasted for centuries fewer than the 874 years I suggested for the eastern Roman government, and with a very loose definition, the longest lasting government migth have lasted for thousands of years. ",
            "date": "Answered December 9, 2019",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laszlo Harangozo",
                    "user_href": "/profile/Laszlo-Harangozo"
                },
                {
                    "user_id": "Sandy Beshear",
                    "user_href": "/profile/Sandy-Beshear"
                },
                {
                    "user_id": "Eric Johnson",
                    "user_href": "/profile/Eric-Johnson-188"
                },
                {
                    "user_id": "A.J. Ellis",
                    "user_href": "/profile/A-J-Ellis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Mansfield",
                "href": "/profile/Andy-Mansfield-6"
            },
            "answer_text": "China. China is the longest continual political civilisation, and its government dates back over 2,000 years in one form or another. The first emperor, Qin Shi Huang, founded the imperial dynasty in 221 BCE and created a government system that has lasted and evolved to this day. According to Ian Morris in Why the West Rules - For Now, China and Ancient Rome were the world's strongest empires from the second century BCE, and China became dominant from the first century CE as the world's strongest nation. Yet while Rome collapsed, China has continued as a major world power and is again on the rise, after suffering decline from the nineteenth century until later in the Communist period. For Francis Fukuyama China was the first modern state. In The Origins of Political Order, Fukuyama argues that China was the first state to centralise its government under an ‘impersonal' bureaucratic regime. It did this nearly 2000 years before Europeans achieved it with the French Revolution under the Napoleonic regime. Despite numerous changes in dynasties, Mongol invasion, changes in territorial size, civil war and the emergence of Communism and changes in its government, there is a recognised continuity from 221 BCE. ",
            "date": "Answered March 18, 2017",
            "views": "10",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chance Keshian",
                    "user_href": "/profile/Chance-Keshian"
                },
                {
                    "user_id": "Simon Simonyiking",
                    "user_href": "/profile/Simon-Simonyiking"
                },
                {
                    "user_id": "Edwin Xu",
                    "user_href": "/profile/Edwin-Xu-12"
                }
            ]
        }
    ]
}