{
    "title": "What is the history of inflation? When was inflation first mentioned or detected? Why does inflation exist? - Quora",
    "tags": [
        "Inflation (economics)",
        "Macroeconomics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mobeen Farhan",
                "href": "/profile/Mobeen-Farhan-2"
            },
            "answer_text": "During the Mongol Yuan Dynasty, the government spent a great deal of money fighting costly wars and the government wanted to raise more money therefore, it decided to print more money and this increase in money supply led to the rise in prices which we today refer to as inflation. Historically, large infusions of gold and silver also lead to inflation. From the second half of the 15th century to the first half of the 17th, Western Europe experienced a major inflationary cycle referred to as the \"price revolution\",with prices on average rising perhaps sixfold over 150 years. This was largely caused by the sudden influx of gold and silver from the New World into Habsburg Spain. The silver spread throughout a previously cash starved Europe and caused widespread inflation. Demographic factors also contributed to upward pressure on prices, with European population growth after depopulation caused by the Black Death pandemic. The main cause of inflation are: Demand-Pull Inflation Cost-Push Inflation Imported Inflation Monetary Inflation Demand pull inflation: Demand-pull inflation is a period of inflation which arises from rapid growth in aggregate demand. Cost-Push Inflation: Cost-push inflation occurs when we experience rising prices due to higher costs of production and higher costs of raw materials. Imported Inflation: Inflation due to the increase in import prices. As imported prices increase, prices of goods made domestically also rise as raw materials are often more expensive. Monetary Inflation: Monetary inflation is a sustained increase in the money supply of a country (or currency area). ",
            "date": "Answered June 1, 2018",
            "views": "641",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Luu",
                    "user_href": "/profile/Kevin-Luu-16"
                },
                {
                    "user_id": "Fred Flip",
                    "user_href": "/profile/Fred-Flip"
                },
                {
                    "user_id": "Ammad Khan",
                    "user_href": "/profile/Ammad-Khan-49"
                },
                {
                    "user_id": "Matt Hibbard",
                    "user_href": "/profile/Matt-Hibbard-4"
                },
                {
                    "user_id": "Jose Tormo",
                    "user_href": "/profile/Jose-Tormo-1"
                },
                {
                    "user_id": "Chowa Sekai",
                    "user_href": "/profile/Chowa-Sekai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Flip",
                "href": "/profile/Fred-Flip"
            },
            "answer_text": "The United States experienced 3.27% from 1914 until 2018, and then recorded an all time high of 23.70% in June of 1920, and the lowest of -15.80% in June of 1921. The great economist Milton Friedman has said that \"Inflation is always and everywhere a monetary phenomenon, in the sense that it is and can be produced only by a more rapid increase in the quantity of money than in output.” Remember that anything can be “money”. Sea shells have been used, as have cigarettes, or many other things. The infamous hyper-inflation in Germany occurred because the leaders printed money more rapidly to pay off war debts, but without a corresponding increase in output of goods and services, the money wasn't worth the paper it was printed on. ",
            "date": "Answered June 6, 2018",
            "views": "91",
            "upvotes": "0"
        }
    ]
}