{
    "title": "What is the meaning of Psalms 82 in the Bible? - Quora",
    "tags": [
        "Psalms",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "YashRaj Singh",
                "href": "/profile/YashRaj-Singh-286"
            },
            "answer_text": "Psalm 82: Like Psalm 58, this psalm is concerned with the problem of unjust judges. The content of the psalm may be analyzed as follows: God Himself arrives for the hearing (verse 1), the accusations are delivered (verses 2-5), God sets forth His verdict (verses 6-7), and the psalmist presents a petition for God’s judgment over the entire earth (verse 8). Judges are called Elohim, “gods” (in verse 6), because of their responsibility to represent God (compare John 10:34 where Jesus quotes this verse to support His deity). Verses 1-8: This psalm (like Psalms 2 and 58), focuses on the injustices of tyranny. The psalmist pictures God standing in the assembly of earthly leaders, to whom He has delegated authority, and condemning their injustices. The final prayer of the psalmist (verse 8), is that God Himself will take direct control of the affairs of this world. I. The Assembly of World Leaders Before God (82:1). II. The Evaluation of World Leaders by God (82:2-7). III. The Replacement of World Leaders with God (82:8). Verses 1-5: Magistrates are the mighty in authority for the public good. Magistrates are the ministers of God's providence, for keeping up order and peace, and particularly in punishing evil-doers, and protecting those that do well. Good princes and good judges, who mean well, are under Divine direction; and bad ones, who mean ill, are under Divine restraint. The authority of God is to be submitted to, in those governors whom his providence places over us. But when justice is turned from what is right, no good can be expected. The evil actions of public persons are public mischiefs. Verses 1-4: God’s concern for the “poor” and defenseless of the world is apparent throughout Scripture (Deut. 24:17; Isa. 11:4; Jer. 22:16). The courts were intended as the place where “needy” people could find justice, but they were not fulfilling this responsibility. Psalm 82:1 \"God standeth in the congregation of the mighty; he judgeth among the gods.\" “In the congregation of the mighty”: The scene opens with God having called the world leaders together. “Among the gods”: The best interpretation is that these are human leaders, such as judges, kings, legislators and presidents (compare Exodus 22:8-9, 28; Judges 5:8-9). God the Great Judge, presides over these lesser judges. God standeth, means God continues to stand. The congregation in the Old Testament, are the Israelites. The congregation of the mighty perhaps, would be speaking of the High Priest and the priests, because they were mighty among their people. They were elevated up as gods by their people. They actually said who was allowed to enter the temple, and who could not. They made many judgements of the people. They really were a government in a government. The High Priest was set up at first, to represent God to the people, and the people to God. They started out just fine, but by the time that Jesus was ministering on the earth, the priesthood had gone down to the point that they were buying and selling the position of High Priest. The presence of God was over the mercy seat in the tabernacle in the wilderness. Verses 2-4: “Judge unjustly”: God accuses the lesser human judges of social injustices which violate the Mosaic law (e.g., Deut. chapter 24). Psalm 82:2 \"How long will ye judge unjustly, and accept the persons of the wicked? Selah.\" These are the words not of the psalmist, but of the divine Person that stands in the congregation of the mighty, and judges among the gods. Calling the unjust judges to an account, and reproving them for their unrighteous proceedings and perversion of justice. In which they had long continued, and which was an aggravation of their sin. This is very applicable to the rulers and judges of the Jewish nation in the times of Christ, who had long dealt very unjustly, and continued to do so. They judged wrong judgment, or judgment of iniquity, as Aben Ezra renders it, both in civil and ecclesiastical things. Their judgment was depraved concerning the law, which they transgressed and made void by adhering to the traditions of the elders. They passed an unrighteous judgment on John the Baptist, the forerunner of Christ, rejecting his baptism, and calling him a devil. And upon Christ himself, judging him to death for crimes he was not guilty of. And upon his followers, whom they cast out of the synagogue. For the character of an unjust judge (see in Luke 18:2). \"And accept the persons of the wicked?\" Gave the cause in favor of them, and against the righteous, because they were rich, or related to them. Or had bribes from them, contrary to the law in (Deut. 16:19). So the judges among the Jews, in Christ's time, judged according to appearance, the outward circumstances of men, and not righteous judgment, as our Lord suggests (John 7:24). We find that justice did not prevail. God had given these Israelites the most complete set of laws and ordinances known to man. They covered the civil laws, as well as the religious laws. There was no excuse for judging unjustly. God had given them the way to judge every situation. This does not exactly say so, but favoritism was probably being practiced. The priesthood had really gone down. Of course, Selah means stop and think on this. Psalm 82:3 \"Defend the poor and fatherless: do justice to the afflicted and needy.\" Or, judge them. Such as have no money to enter and carry on a suit, and have no friends to assist and advise them, and abide by them. These should be taken under the care and wing of judges. Their cause should be attended to, and justice done them. Their persons should be protected, and their property defended and secured for. Since they are called gods, they ought to imitate him whose name they bear, who is the Father of the fatherless, the Judge of the widows, and the helper of the poor that commit themselves to him (Psalm 10:14). Such a righteous judge and good magistrate was Job (see Job 29:12). \"Do justice to the afflicted and needy\": Or \"justify\" them. Pronounce them righteous, give the cause for them, not right or wrong, nor because they are poor and needy, but because they are in the right. For, if wicked, they are not to be justified, this is an abomination to the Lord (see Lev. 19:15). From this Scripture, it seems their favors had been done for the wealthy, perhaps for a bribe. They were doing the very opposite of what the Lord had taught them to do. He reminds them again here, that they must defend the fatherless and the widow. They must help the needy. This of course, would not get them any bribes on the earth. Psalm 82:4 \"Deliver the poor and needy: rid [them] out of the hand of the wicked.\" From his adversary and oppressor, who is mightier than he, and draws him to the judgment seat. When it is not in his power to defend himself against him, and get out of his hands, unless a righteous judge will show a regard to him and his cause. And sometimes even an unjust judge, through importunity, will do this, as everyone ought, and every righteous one will. \"Rid them out of the hand of the wicked\": This was what the poor widow importuned the unjust judge for, and obtained (Luke 18:3). If they are to be a good judge, then they must help those who are not able to help themselves. The wicked seem to pick on the poor and needy, because they cannot help themselves. These judges need to remember that their time is coming. They will have to stand before the Lord Jesus on judgement day. They will be judged in the same manner they judged others. Psalm 82:5 \"They know not, neither will they understand; they walk on in darkness: all the foundations of the earth are out of course.\" “Darkness”: Signifies both intellectual ignorance and moral iniquity. “Foundations of the earth are out of course”: When leaders rule unjustly, the divinely established moral order which undergirds human existence is undermined. How dark and full of sin can the world get? The very ones who are supposed to be upholding that which is right, have gone bad themselves. If those who are supposed to uphold righteousness are gone bad, then it seems that there is great darkness. Matthew 15:14 \"Let them alone: they be blind leaders of the blind. And if the blind lead the blind, both shall fall into the ditch.\" Matthew 6:23 \"But if thine eye be evil, thy whole body shall be full of darkness. If therefore the light that is in thee be darkness, how great [is] that darkness!\" Verses 6-8: It is hard for men to have honor put upon them, and not to be proud of it. But all the rulers of the earth shall die, and all their honor shall be laid in the dust. God governs the world. There is a righteous God to whom we may go, and on whom we may depend. This also has respect to the kingdom of the Messiah. Considering the state of affairs in the world, we have need to pray that the Lord Jesus would speedily rule over all nations, in truth, righteousness, and peace. Psalm 82:6 \"I have said, Ye [are] gods; and all of you [are] children of the most High.\" This verse was quoted by Jesus when the religious authorities wanted to stone Him for declaring Himself to be the Son of God (John 10:34-38). “I have said”: Kings and judges are set up ultimately by the decree of God (Psalm 2:6). God, in effect, invests His authority in human leaders for the stability of the universe (compare Rom. 13:1-7). “Ye are gods”: Jesus, in quoting this phrase in (John 10:34), supported the interpretation that the “gods” were human beings in a play on words, He claims that if human leaders can be called “gods”, certainly the Messiah can be called God. “You are children of the most High”: Created by God for noble life. Notice, that gods is not capitalized. They are false gods. They are gods in their own sight. This calling them gods is a mocking of the real Word. They were acting with great authority given them by God. It is such a shame that they abused that authority. God had set up a ruling authority of which they were, but they had misused their office. These were Israelites (children of the most High). Psalm 82:7 \"But ye shall die like men, and fall like one of the princes.\" “Die like men”: In spite of being made in God’s image, they were mortal and would die like human beings. “Fall like … princes”: The unjust rulers would become vulnerable to the violent deaths which often accompanied tyranny. They will be judged more harshly, because they sinned in full knowledge. Even though they had a high office on this earth, they were but men, and would die as men. The statement like princes, means that their death will be first. God judges the house of God first. Psalm 82:8 \"Arise, O God, judge the earth: for thou shalt inherit all nations.\" “For thou shalt inherit all nations”: The psalmist prayerfully anticipates the future when God will set up His kingdom and restore order and perfect justice to a sin-cursed world (compare Psalms 96 and 97; Isa. 11:1-5). He is calling for Messiah who will rule all the earth justly. We would say, come quickly Lord Jesus. Jesus will rule as King of kings and Lord of lords. Jesus is the Righteous Judge who all will stand before in judgement. Philippians 2:10 \"That at the name of Jesus every knee should bow, of [things] in heaven, and [things] in earth, and [things] under the earth;\" ",
            "date": "Answered July 20, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Wittenberg",
                "href": "/profile/David-Wittenberg-1"
            },
            "answer_text": "Thanks for asking about the 82nd psalm. I’m going to guess that you’re interested in the meaning of the word “gods.” Who are the “gods” other than God that this psalm refers to? You could build a case that there are multiple Gods if you wish. In the original language, the word elohim is used, and that is the same word used to refer to the single, supreme being. You could also argue that the “gods” in this psalm are a particular group of people, since the psalm is addressed to the group in Israel who were responsible for judging. They were the interpreters of God’s law. They settled cases. Would these judges be supernatural or worthy of worship if the psalmist called them elohim, the same title that is used for the supreme being, the creator of the universe? You could decide to believe that if you wish, but almost all scholars, both theologians and linguists, would disagree with you. The rabbis and doctors of the law who have led and taught Israel for the 3000 years since that psalm was written have a clear view about the elohim in this psalm. Please take a look at this interlinear version from mechonmamre.org: 1 A Psalm of Asaph. {N}God standeth in the congregation of God; in the midst of the judges He judgeth: ב עַד-מָתַי תִּשְׁפְּטוּ-עָוֶל; וּפְנֵי רְשָׁעִים, תִּשְׂאוּ-סֶלָה. 2 'How long will ye judge unjustly, and respect the persons of the wicked? Selah ג שִׁפְטוּ-דַל וְיָתוֹם; עָנִי וָרָשׁ הַצְדִּיקוּ. 3 Judge the poor and fatherless; do justice to the afflicted and destitute. ד פַּלְּטוּ-דַל וְאֶבְיוֹן; מִיַּד רְשָׁעִים הַצִּילוּ. 4 Rescue the poor and needy; deliver them out of the hand of the wicked. ה לֹא יָדְעוּ, וְלֹא יָבִינוּ-- בַּחֲשֵׁכָה יִתְהַלָּכוּ;יִמּוֹטוּ, כָּל-מוֹסְדֵי אָרֶץ. 5 They know not, neither do they understand; they go about in darkness; {N}all the foundations of the earth are moved. ו אֲנִי-אָמַרְתִּי, אֱלֹהִים אַתֶּם; וּבְנֵי עֶלְיוֹן כֻּלְּכֶם. 6 I said: Ye are godlike beings, and all of you sons of the Most High. ז אָכֵן, כְּאָדָם תְּמוּתוּן; וּכְאַחַד הַשָּׂרִים תִּפֹּלוּ. 7 Nevertheless ye shall die like men, and fall like one of the princes.' ח קוּמָה אֱלֹהִים, שָׁפְטָה הָאָרֶץ: כִּי-אַתָּה תִנְחַל, בְּכָל-הַגּוֹיִם. 8 Arise, O God, judge the earth; for Thou shalt possess all the nations. {P} As you can see, the traditional understanding is that the “gods” of Psalm 82 are the judges of Israel, and not supernatural beings or beings who deserve worship as gods. The judges deserved respect. They held power by virtue of their office. So, they were given a title of great respect, elohim. If you’ve read this far, you may be interested in one more grammatical point. The suffix -im in Hebrew indicates plural, the same way that -s does in English. Yet when used to refer to God, its meaning is singular; the God of Israel is one. So, if the word elohim is being used as a plural — and in this psalm, it is clearly being used as a plural; these elohim assemble — how could it make sense to think it refers to “gods?” There is only one Elohim (God), but there can be multiple elohim (judges). ",
            "date": "Answered July 22, 2018",
            "views": "576",
            "upvotes": " View Sharers"
        }
    ]
}