{
    "title": "What is baroque music? - Quora",
    "tags": [
        "Baroque",
        "Baroque Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim",
                "href": "/profile/Kim-469"
            },
            "answer_text": "Baroque music is music written by the great composers in the baroque. It is characterized by simplicity if you compare it with modern music. It follows strict musical rules. The baroque was like the first period that was not subject to the even stricter rules of the old church. It was also in this period the monody and the first operas was “invented”. It was here that noble humanists, musicians and poets in Florence formed the Florentine Camerata. The traditional history of the Camerata is that they invented opera, however many music historians disagree. Vincenzo Galilei (father of Galileo Galilei) was a member of the Camerata. He was an opponent to the (at that time) traditional way choirs sang. In choirs, singers sang high and low notes simutaneously, different counter melodies and different rhythms. Vincenzo Galilei thought this made everything sound chaotic, and he thought that the emotional message couldn’t be delivered to the listener, because the lyrics was difficult to hear. The solution to this was the monody. With monody, there’s only one singing voice, but it is accompanied by instruments, so the harmonies don’t get lost. The first operas was heavily affected by monody. At that time, the composers wasn’t considered artists as they are today. They were rather considered craftsmen (like a joiner). The most well-known baroque composer is JS Bach. ",
            "date": "Answered January 8, 2017",
            "views": "832",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Luqing Zhang",
                    "user_href": "/profile/Luqing-Zhang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soubhik Baral",
                "href": "/profile/Soubhik-Baral"
            },
            "answer_text": "Derived from the Portuguese barroco, or “oddly shaped pearl,” the term “baroque” has been widely used since the nineteenth century to describe the period in Western European art music from about 1600 to 1750. Comparing some of music history’s greatest masterpieces to a misshapen pearl might seem strange to us today, but to the nineteenth century critics who applied the term, the music of Bach and Handel’s era sounded overly ornamented and exaggerated. Having long since shed its derogatory connotations, “baroque” is now simply a convenient catch-all for one of the richest and most diverse periods in music history. In addition to producing the earliest European music familiar to most of us, including Pachelbel’s Canon and Vivaldi’s The Four Seasons, the Baroque era also greatly expanded our horizons. The acceptance of Copernicus’s 16th century theory that the planets didn’t revolve around the earth made the universe a much larger place, while Galileo’s work helped us get better acquainted with the cosmos. Advances in technology, such as the invention of the telescope, made what was believed to be finite seem infinite. Great thinkers like Descartes, Hobbes, Spinoza, and Locke tackled the big questions of existence. Geniuses like Rubens, Rembrandt, and Shakespeare offered unique perspectives through their art. European nations grew more and more involved with foreign trade and colonization, bringing us into direct contact with parts of the globe that were previously unfamiliar. And the growth of a new middle class breathed life into an artistic culture long dependent on the whims of church and court. Many of the well known personalities from the first part of the Baroque period hail from Italy, including Monteverdi, Corelli and Vivaldi. (By the mid- eighteenth century, our focus shifts to the German composers Bach and Handel.) Many of the forms identified with Baroque music originated in Italy, including the cantata, concerto, sonata, oratorio, and opera. Although Italy played a vital role in the development of these genres, new concepts of what it meant to be a nation increased the imperative of a “national style.” Differences between nations are often audible in music from the period, not only in the way music was composed, but also in conventions of performance; particularly obvious was the contrast between Italy and France. While certain countries may seem to claim a larger piece of our experience of Baroque music today, however, every nation played a role.  ",
            "date": "Answered April 29, 2020",
            "views": "67",
            "upvotes": "0"
        }
    ]
}