{
    "title": "What is wrong with university education in the 21st century? - Quora",
    "tags": [
        "Education Reform"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What is wrong with university education in the 21st century? (1) In a services company/organization entity, the entity may view its service-recipients in three ways. As a ‘product’. E.g. a cuisine school’s output is trained chefs.As a ‘customer’. As in guests in a hotel.As a ‘client’. A client is a more personalized customer. As in a lawyer’s client, an investment banker’s client.(2) How the entity views its service-recipients will influence and shape the form and substance of its services, and service delivery. How the service-recipients view themselves will influence and shape their service experience. (3) We come back to this Quora question. What is wrong with university education in the 21st century? Universities are ambivalent about whether their students are products (e.g. trained engineer), customers or clients.Are universities the means by which a society produces skilled employees to feed the economy mill?Or, should we cater to the needs and desires of individual students (and their parents)?The metaphor of the ‘customer’ is apt if it encourages students to seek value-for-money, and academics to provide that value.It increases the agency of the student.It also subtly redefines education as a private rather than a public good.But, it also distorts the teacher-student relationship, suggesting that it is numbingly transactional: I’ve something (knowledge, skills, wisdom) that you are paying me to transfer to you.The student-as-a-client is more invested in his/her relationship with a professor than a customer. It suggests a modest degree of individualization.Conversely, students are ambivalent about whether they’re products, customers or clients.Product: “I want to be an Engineer”Customer: “I’m here to get a degree”Client: “It was Prof. John who piqued me to pursue String theory in Physics”(4) Ultimately, regardless of the metaphor, education is transformative. SkillsIdeasValues(5) The idea that a university is a place you go to get a degree will, in time, be replaced by an understanding that none of us ever stops learning and changing. ",
            "date": "Updated October 8, 2018",
            "views": "358",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Solomon O’Towo",
                    "user_href": "/profile/Solomon-O-Towo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luis Diaz",
                "href": "/profile/Luis-Diaz-1"
            },
            "answer_text": "Have a look at this letter to the Guardian for a glimpse of the situation in the UK:http://www.guardian.co.uk/education/2012/sep/25/market-education-destroying-university-values?INTCMP=SRCHIn short - the transformation of the academic environment into a market; watering down of what research is and means; loss of critical and neutral aspect of scholarly work. ",
            "date": "Answered September 29, 2012",
            "views": "382",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pranati Satapathy",
                    "user_href": "/profile/Pranati-Satapathy"
                }
            ]
        }
    ]
}