{
    "title": "What is the difference between table tennis and tennis game? - Quora",
    "tags": [
        "Table Tennis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hai Tran",
                "href": "/profile/Hai-Tran-15"
            },
            "answer_text": "Beside the physical layout - table versus actual court - the major differences are as follows: all returns hit have to be after one bounce in table tennis - tennis can volley with no bounceservice requires one bounce on each side in table tennisin table tennis doubles, players on each team alternate hitsin table tennis doubles, services are bounced diagonally from the right sidein table tennis singles, services bounce can initiate and end on any side; tennis alternate sidesscoring: table tennis 11 point games, by 2 in the event of a tie; tennis is by 4 point games (2 in the event of a tie/deuce), 6 games per set with 9 point tie-breaker or by 2 gamesOther than those differences, the games are both enjoyable and healthy! ",
            "date": "Updated September 12, 2018",
            "views": "68",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kerry Terrel",
                    "user_href": "/profile/Kerry-Terrel"
                },
                {
                    "user_id": "Aremu Zaynab",
                    "user_href": "/profile/Aremu-Zaynab"
                },
                {
                    "user_id": "Lin Li",
                    "user_href": "/profile/Lin-Li-323"
                },
                {
                    "user_id": "Vikram Singh",
                    "user_href": "/profile/Vikram-Singh-125"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "Seriously? Table tennis is played on a small table (9 ft by 5 ft) with rubber-faced wooden paddles and a lightweight 40 mm cellulose ball.   Tennis is played on a large (78 ft by 27 ft) ground-level court, of clay, grass, or asphalt using strung rackets and a heavy rubber, felt covered 2.6 inch ball.   Table tennis is a game of speed and spin. The professionals have paddle with very tacky/grippy rubber and spin is an important part of the game, reaching thousands of RPM. Tennis is about speed and spin also, with pro services flying off the racket at 130 mph. ",
            "date": "Answered May 16, 2018",
            "views": "64",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kerry Terrel",
                    "user_href": "/profile/Kerry-Terrel"
                },
                {
                    "user_id": "Sinmisola Olaifa",
                    "user_href": "/profile/Sinmisola-Olaifa"
                },
                {
                    "user_id": "Neelu Chauhan",
                    "user_href": "/profile/Neelu-Chauhan-8"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Steven J Greenfield",
                    "user_href": "/profile/Steven-J-Greenfield"
                },
                {
                    "user_id": "James Ryan",
                    "user_href": "/profile/James-Ryan-164"
                }
            ]
        }
    ]
}