{
    "title": "What is the historicity of the story of Moses? If it's not historical, why does it go out of its way to vilify Ancient Egypt? - Quora",
    "tags": [
        "History of Egypt",
        "Moses (biblical figure)",
        "Ancient Egyptians",
        "Ancient Egypt",
        "Ancient History",
        "The Bible",
        "World History",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anders Eklof",
                "href": "/profile/Anders-Eklof"
            },
            "answer_text": "Moses is probably a historical person, but his life story almost certainly bears little resemblance to what you read in the Bible. Much of the doubts about his historical existence is based on the lack of archaeological evidence for an “exodus” from Egypt as it is described in the book of Exodus. Contributing to the doubts caused by this lack of evidence, there is also no firm consensus among historians about when the “exodus” took place, if ever. It was almost certainly before 1208 B.C., the date of an Egyptian inscription by Pharaoh Merneptah claiming to have laid waste some cities of “Israel.” It is unlikely to have been associated with an inscription by the female Pharaoh Hatshepsut, where she expresses anger at some “Asiatics” who were allowed to leave the delta region of Egypt around 1450 B.C. Some historians date it by interpreting some of the plagues of Egypt as the effects of the eruption of the volcano of the Greek island of Santorini in about 1500 B.C. Those attempts also suffer from an absence of archaeological evidence. There seem to have been no significant effects of the event on the land of Egypt. (It is also a bit naive to see the miracles and magic events in the Bible as having a factual, historical basis, and try to find a scientifically acceptable explanation.) To find a more probable date for the Exodus, and thereby provide more credence to the story of Moses, we need to scour Egyptian historical record and identify events in the 1500 - 1200 B.C. period that might contain clues. It turns out that there was only one significant disturbance in that period that could qualify, namely the Amarna controversy and its aftermath when Pharaoh Horemheb drove into exile a large number of “undesirables,” primarily converters to the revolutionary and, from the Egyptian perspective, shockingly heretical monotheistic faith of Pharaoh Akhenaten. The counterrevolution against his religious revolution was violent and driven by religious fervor. If one reads the story of Exodus carefully, it becomes abundantly clear that the struggle between Moses and the Pharaoh is all about the freedom by Moses and his followers to worship their god, who apparently is not any of the traditional gods of Egypt. Moses fails in that contest, and he and his followers are forced to leave Egypt in all haste, pursued by the Pharaoh’s chariots. The event can then be dated to around 1320 B.C. The identification of Moses with a follower of the monotheistic creed of Akhenaten is supported by the preeminent chronicler of ancient Egyptian history, Manetho, and by several old Greek historians, like Hecataeus of Abdera, Lysimachus, and Strabo. Many modern experts on Egyptian history agree. Donald Redford states it emphatically: “Surely it is self-evident that the monotheistic preaching at Mount Sinai is to be traced back ultimately to the teachings of Akhenaten.” In his book “Moses and Monotheism,” Sigmund Freud is no less convinced: “…if Moses was an Egyptian and if he transmitted to the Jews his own religion, then it was that of Ikhnaton [Akhenaten], the Aton religion.” ",
            "date": "Answered March 18, 2020",
            "views": "293",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Towner",
                "href": "/profile/Chris-Towner-6"
            },
            "answer_text": "Let’s put a date for the supposed Exodus around 1200 BCE as a vaguely usable figure. You could say that that vaguely matches a time when Canaan saw an influx of several bands of nomadic immigrants. They told a variety of stories about their experiences in the desert, and probably acquired further details from other tribes with similar experiences. The figure called Moses may have had a place there, or maybe he came later. Some time in the 7th century BCE some of the stories came to be written down, and at that time they had formed a nation around a major city called Jerusalem. 100 years or so later they encountered a military challenge from Babylon and were conquered and taken off into exile. During the years they were there the old (Exodus) stories grew and got modified by their experience of exile in Babylon, and that experience shaped an element of those stories and transferred them to Egypt and slavery. When maybe 60 years later they returned to Jerusalem (now some 700 years after the supposed Exodus) and wrote them all down in a book (over probably another hundred years), which we still have and call The Bible. So you will probably judge that ‘historicity’ is not an issue to be confronted and neither is ‘vilification’ of Egypt. It’s much more about the way that traditions are remembered and retold and adjusted to fit conditions experienced by its tellers, but more significantly it’s the story of a nation who thought of themselves as The People of God and an account of the relationship forged by Him. And by them. ",
            "date": "Answered April 6, 2020",
            "views": "13",
            "upvotes": " Answer requested by Thao Dao"
        }
    ]
}