{
    "title": "What are cheaper stores like Urban Outfitters? - Quora",
    "tags": [
        "Urban Outfitters (retail brand)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Wilson",
                "href": "/profile/Daniel-Wilson-437"
            },
            "answer_text": "First of all, Urban Outfitters is not an cheaper priced store as products like a Bandana costs $12 or more at the online website as well as offline stores. Products at Urban Outfitters are overpriced. Some of the most inexpensive stores that makes shopping convenient and enjoyable for shoppers are: Uniqlo - The best place to shop for basic apparel like t-shirts, jeans, shirts, maxi dresses, shorts, top-wear etc. Old Navy - Selling affordable clothing for both men and women, Old Navy is a shoppers paradise as you buy new arrivals at throw-away prices, get chic fashionwear at reasonable prices. Boohoo- Boohoo is a women’s online fashion seller. From designer dresses to the exclusive handpicked collection, Boohoo dresses are super affordable and super stylish. They have all segments of clothing and one can shop according to their budget.Fashionnova - Looking for some ideas in bold fashion? Fashionnova is the place to be. Fashionnova houses some of the boldest fashion designs in the marketplace and has collaborated  Missguided - For edgier style and curvy fashion, head to missguided and choose from a wide range of dresses, tops, skirts, denim, trousers, jumpsuits, swimwear, lingerie, activewear, sleepwear and more. Asos, Pretty Little Thing, Nasty Gal, Forever 21 etc., are other online fashion sellers that offer trendiest, up to the minute fashion for men and women at cheaper prices. They do not compromise on quality and offer genuine products to end customer. ",
            "date": "Answered September 11, 2018",
            "views": "7",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juliana Mirkovic",
                    "user_href": "/profile/Juliana-Mirkovic"
                },
                {
                    "user_id": "Jessica Jade",
                    "user_href": "/profile/Jessica-Jade-40"
                },
                {
                    "user_id": "Adrienne Liew",
                    "user_href": "/profile/Adrienne-Liew-1"
                },
                {
                    "user_id": "Cara Yang",
                    "user_href": "/profile/Cara-Yang-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Bowden",
                "href": "/profile/Dave-Bowden-2"
            },
            "answer_text": "I put together a pretty comprehensive rundown of stores like Urban Outfitters that’s probably too long to post in full here, but here are some of the cheaper ones on the list: H&M - Probably your best bet for clothes that are similar in style to Urban Outfitters, but much cheaper. (Unfortunately, the quality of the pieces often reflects this.) Amazon - Their Goodthreads and Amazons Essentials brands are both great, more affordable alternatives to Urban Outfitter’s clothes. Zara - More fashion-forward than Urban Outfitters, but dirt cheap. Madewell - Owned by J.Crew, it’s their cheaper alternative for staples like jeans, tees and sweaters. Topman – Great place for affordable slim-fitting pieces. Asos – Similar to Topman in style, quality and price. Hope this helps! As I say, there were a lot of other options in my full list, but not all are cheaper. Many are comparable in price, and a few are more expensive because they’re better quality, higher end brands, or both. ",
            "date": "Answered October 27, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}