{
    "title": "What would happen if someone (let’s say Vlad Tepes for example) was immortal and accumulated their wealth from 587 years ago to now? How rich would they be? - Quora",
    "tags": [
        "Becoming Rich",
        "Immortality",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Economics of Everyday Life",
        "Wealthy People and Families",
        "Wealth",
        "Hypothetical Scenarios",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rufus Delorian",
                "href": "/profile/Rufus-Delorian"
            },
            "answer_text": "To be able to accumulate wealth, our immortal dude needs a source of income. If we assume Vlad is our guy, he can tax his subjects but, even if his immortality extends to not being killable, he'll eventually get invaded or deposed and, presumably locked away once people realise he can't be executed. I imagine his captors will want to know his secret to immortality so he'll probably remain a secret prisoner forever and accumulate little wealth. If the immortal guy is less well known and has less Ottoman empires after him, it'd still be tough. If he tries to keep his wealth anonymous (having a pile of gold or something) then he's vulnerable to theft or loss by accident…also the wealth isn't increasing his earning power. If he does stuff like buy land & property, he gets entangled in bureaucracy…he has to interact with people and people will probably notice that he never ages. Maybe he could try an “I'm actually my son now” trick but how would it work? He'd have to disappear for a bunch of years each time so people wouldn't just immediately recognise him…what does he do about his tenants, taxes and such in the meantime? He'd probably have to do it every 15-20 years...people would catch on unless he sold up & moved every time What if he has an actual son that inherits everything while he's away? I'd imagine keeping up a scam would just get progressively harder as time goes on (people living longer recognize you, more paperwork, photos). If he wanted to keep his immortality secret, he'll never want to get too rich or people will start paying attention. A ~600 year old guy isn't likely to perform well in a modern economy…my parents struggle with modern technology, our immortal guy stands no chance…he's likely to be conservative with investments too so will miss out on all the big tech company stock rises and lose his ass on buggy whips or tulips. He'd probably end up broke several times, probably start a family once or twice a century and use them to cover for him…probably never becoming amazingly rich. ",
            "date": "Answered October 26, 2020",
            "views": "92",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Spy Girl Spygirl",
                    "user_href": "/profile/Spy-Girl-Spygirl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Costa Grațo Solomon",
                "href": "/profile/Costa-Grațo-Solomon"
            },
            "answer_text": "Don’t know, don’t care, the answer to that will not benefit you whatsoever in any way shape or form for your future, its purely instant gratification and if you keep at it you will never build wealth.. ",
            "date": "Answered October 29, 2020",
            "views": "92",
            "upvotes": " Answer requested by Zach Kabia"
        }
    ]
}