{
    "title": "What is the greatest chess match ever? Why? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Dallas Van Winkle",
                "href": "/profile/Dallas-Van-Winkle-1"
            },
            "answer_text": "Known in America as the “Seventh Seal,” and also as “The Mexican Immortal” in honor of Carlos Torre’s excellent victory. (I’m more than certain that is also was an inspiration for an old movie of the same name.) Forget the “Immortal” or “The Game of the Century” (this isn’t about Fischer’s dismissive remarks about Lasker, though Fischer notably executed another infamous “windmill” in his game as well.) This game features one of the most devastating attacks ever executed on another professional player. I first began to eulogize this man when reading some article (I can not recall it’s source) that stated he envisioned the pieces on the board as if they were characters in a playwright. Let’s get back to the description: White’s Bishop g5 is only “relatively pinned” against his Queen, snapping away from this pin would of course hang the Queen, but it also allowed for a superior exchange later on: 25. Bf6!! Qxh5 26. Rxg7+ Kh8  Lasker - Black / Torre - White 27. Rxf7+ Kh8 28. Rxb7+ Kg8  Lasker - Black / Torre - White 29. Rg7+ Kh8 30. Rg5+  Lasker - Black / Torre - White 31. Rxh5 + Kh7 32. Rxh5 Kg6 (Lasker refusing to stay down, comes back with a nice double attack to get back another piece.) Perhaps there’s also the visual aspect of the rook, swinging like a hell hammer on the 7th rank before peeling back to take out the Queen as well. The best takeaway from this game is the importance of not letting a rook penetrate your 7th rank. I keep reading more about Lasker and can’t help but idolize the guy ever more. Lasker apparently had to step down from defending his Championship title against José Raúl Capablanca (1920). He seemingly disappeared from the chess scene for the next 11 years. His motivation to play, arose because of his need to earn prize money. Again, much like his playstyle, Lasker showed that he could arm himself with a mercurial goal to compel and sharpen his play. Lasker marched into Moscow (1935) at age 66 and he finished 3rd place, undefeated. No one could argue that it was \"a biological miracle.\" Lasker was the longest reigning World Championship title holder. But on top of that, he was a good sport, and a staunch supporter of chess players retaining the copyrights for their games. It was commonplace during those days for players to emulate paradigms of other successful players. Lasker had no school of thought, nor could anyone even begin to unravel his ability to defend or follow through with an attack. Finally, and I think this the best aspect of all, Lasker tended to ignore or disagree with contemporary opening analysis, and yet his positional play style will never be forgotten. Thank you all for reading this! Carlos Torre Repetto vs Emanuel Lasker (1925) \"Seventh Seal\" [Portable Game Notation] http://www.chessgames.com/perl/nph-chesspgn?text=1&gid=1100063 Diagram used: Chess.com - Play Chess Online - Free Games ",
            "date": "Updated June 20, 2017",
            "views": "3",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soham Gangurde",
                    "user_href": "/profile/Soham-Gangurde-1"
                },
                {
                    "user_id": "Atharv Vyas",
                    "user_href": "/profile/Atharv-Vyas-4"
                },
                {
                    "user_id": "Abhijit Paul",
                    "user_href": "/profile/Abhijit-Paul-97"
                },
                {
                    "user_id": "Nishanth Raj",
                    "user_href": "/profile/Nishanth-Raj-53"
                },
                {
                    "user_id": "Dallas Van Winkle",
                    "user_href": "/profile/Dallas-Van-Winkle-6"
                },
                {
                    "user_id": "Dallas Van Winkle",
                    "user_href": "/profile/Dallas-Van-Winkle-8"
                },
                {
                    "user_id": "Aditya Kulkarni",
                    "user_href": "/profile/Aditya-Kulkarni-205"
                },
                {
                    "user_id": "Aaron Araujo",
                    "user_href": "/profile/Aaron-Araujo-3"
                },
                {
                    "user_id": "Ian Pulizzotto",
                    "user_href": "/profile/Ian-Pulizzotto"
                },
                {
                    "user_id": "Aditya Gupta",
                    "user_href": "/profile/Aditya-Gupta-120"
                }
            ]
        },
        {
            "author_info": {
                "name": "Håkon Hapnes Strand",
                "href": "/profile/Håkon-Hapnes-Strand"
            },
            "answer_text": "The standard answer would be Bobby Fischer vs. Boris Spassky, Reykjavik, 1972. In terms of excitement, drama, controversy, popularity, strength of the winning player and pop culture relevance, nothing comes close. This match had it all. That answer is not very interesting though, because that’s the one everyone would pick. Let me add a slightly different answer. The greatest series of chess matches and the greatest rivalry in the history of chess was that of Garry Kasparov vs. Anatoly Karpov, 1984–1990. These were arguably the two greatest players in the history of the game at the peak of their powers going at it in five incredibly hard-fought and very close matches. They played a total of 144 games! Kasparov emerged the winner every time (except the aborted match of ‘84), but the total score in the matches was only 73–71 in his favor. There was no one else in the 1980s that could even come close to challenging either of these two, but they had each other, and they just made each other stronger. The matches produced some of the most brilliant and epic games in the history of chess. Who can forget Kasparov’s “octopus knight” on d3 in this game: http://www.chessgames.com/perl/chessgame?gid=1067175 …or Karpov’s incredible endgame wizardry in this game: Anatoly Karpov vs Garry Kasparov (1984) \"Karpov Diem\" These two are living legends of the game. Old enemies…  …and now, old friends.  ",
            "date": "Updated December 29, 2019",
            "views": "305",
            "upvotes": " View 951 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Babak Saffari",
                    "user_href": "/profile/Babak-Saffari"
                },
                {
                    "user_id": "Leonardo Suzuki",
                    "user_href": "/profile/Leonardo-Suzuki-3"
                },
                {
                    "user_id": "Mathan Raj",
                    "user_href": "/profile/Mathan-Raj-2"
                },
                {
                    "user_id": "Brent Wolf Reimann",
                    "user_href": "/profile/Brent-Wolf-Reimann"
                },
                {
                    "user_id": "Arjun Ravikumar",
                    "user_href": "/profile/Arjun-Ravikumar-4"
                },
                {
                    "user_id": "Yerkebulan Amangeldi",
                    "user_href": "/profile/Yerkebulan-Amangeldi"
                },
                {
                    "user_id": "Martin Odum",
                    "user_href": "/profile/Martin-Odum"
                },
                {
                    "user_id": "Alfonso Ansó Rojo",
                    "user_href": "/profile/Alfonso-Ansó-Rojo"
                },
                {
                    "user_id": "Flavio Rocha",
                    "user_href": "/profile/Flavio-Rocha-6"
                },
                {
                    "user_id": "Jesper Sahner Pedersen",
                    "user_href": "/profile/Jesper-Sahner-Pedersen"
                }
            ]
        }
    ]
}