{
    "title": "What do you miss about life 10 or 20 years ago? - Quora",
    "tags": [
        "Present Now",
        "The Human Race and Condition",
        "Important Life Lessons",
        "History",
        "Experiences in Life",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sivani Vaddi",
                "href": "/profile/Sivani-Vaddi"
            },
            "answer_text": "I am 9 years old ten years ago. I miss those days when I am careless with zero worries.I miss playing lame games with my brother and fighting for every small thing.Those days when I used to celebrate my birthday in class ( I was made to distribute chocolates, sweets by parents)I miss playing vice city every day on PC. I miss those days when me , mom and bro fought for playing Super Mario video game. I miss these shows    I miss these foods which I and my bro used to buy in a small shop near my school.  I miss those days when I, my mom , dad, bro and our single friend( she's 6–7 years smaller than me but she's my bestie) in my neighborhood used to play many board games and outdoor games on terrace ( cricket , football, disc, police and thief , cycling etc) . My mom and dad are our best friends back then to till date and that will be the same. But due to this lock down again we started walking together , running etc in terrace.Those days when I used to create mess in the class by talking with everyone around me when my class teacher used to change my place without knowing that I had friends in entire class.Those days when I , mom and bro used to watch those never ending Telugu and Hindi serials.Those days when me and my bro used to bath together for hours togetherThose days when my father used to bathe me every day cleanly and got me ready.How many of you can relate to these? ",
            "date": "Answered May 3, 2020",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhaskar Rao Prakyath",
                    "user_href": "/profile/Bhaskar-Rao-Prakyath"
                },
                {
                    "user_id": "Shreya Pinisetty",
                    "user_href": "/profile/Shreya-Pinisetty-2"
                },
                {
                    "user_id": "Abdirisaq Abdi",
                    "user_href": "/profile/Abdirisaq-Abdi-3"
                },
                {
                    "user_id": "Meena",
                    "user_href": "/profile/Meena-311"
                },
                {
                    "user_id": "Aditya C",
                    "user_href": "/profile/Aditya-C-46"
                },
                {
                    "user_id": "Mahima Kulshreshtha",
                    "user_href": "/profile/Mahima-Kulshreshtha-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lakshi Mundargi",
                "href": "/profile/Lakshi-Mundargi"
            },
            "answer_text": "I was 8 years old before 20 years and I feel that my life was very simple during late 90’s and early 2000’s. 90’s kids had a lot of fun even without internet and we were very close to nature. 1)I miss the aasai chocolate a lot and I loved its delicious taste. I guess it has been relaunched with slight variation in name, but still I miss the old aasai chocolate.  2)I miss the Landline calls and the excitement to pick the call, when bell rings. Pic Translation : come soon you got a call  3)Taperecorders - I miss rewinding the tape using pencil or pen. Sometimes I used my little finger to rewind.  4)We called it as Ink eraser and spent a lot of time in trying to erase the ink letters from notebook.  5)This was our biggest fear, but still we would laugh after getting beaten by teacher.  6)I asked my mom to get me a shakalaka pencil and later, I myself did one using the feathers. But it did not work as shown in serial.  Translation : mom I want shakalaka boom boom pencil There are still more a lot of things which I miss about 90’s and early 2000’s. Pic Source : Google search ",
            "date": "Answered May 2, 2020",
            "views": "45",
            "upvotes": " View 76 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prasad Nagarajan",
                    "user_href": "/profile/Prasad-Nagarajan"
                },
                {
                    "user_id": "Bhaskar Rao Prakyath",
                    "user_href": "/profile/Bhaskar-Rao-Prakyath"
                },
                {
                    "user_id": "Raja Manickam",
                    "user_href": "/profile/Raja-Manickam-64"
                },
                {
                    "user_id": "Suresh Babu",
                    "user_href": "/profile/Suresh-Babu-377"
                },
                {
                    "user_id": "Alfi Dasthakeer",
                    "user_href": "/profile/Alfi-Dasthakeer"
                },
                {
                    "user_id": "Ravindar",
                    "user_href": "/profile/Ravindar-10"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raghul-83"
                },
                {
                    "user_id": "Lavanya Nagalapuram",
                    "user_href": "/profile/Lavanya-Nagalapuram"
                },
                {
                    "user_id": "Mohan Ram S",
                    "user_href": "/profile/Mohan-Ram-S"
                },
                {
                    "user_id": "Praveen",
                    "user_href": "/profile/Praveen-1361"
                }
            ]
        }
    ]
}