{
    "title": "What does 'my song' in the Bible mean about God? - Quora",
    "tags": [
        "God and the Christian Bible",
        "The Bible",
        "God",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Godwin Goziem Jireh",
                "href": "/profile/Godwin-Goziem-Jireh"
            },
            "answer_text": "The phrase \"my song\" occurs in the Bible 7 times (KJV), 6 times (ESV). God is described as \"my song\" 3 times (KJV, ESV) in Exodus 15:2, Psalm 118:14 and Isaiah 12:2. He is the \"strength\" of the hearts and lives of His people, and of their “salvation “; and therefore is their \"song\". He is the subject of their song and praise. There is no ground of praise in themselves for anything that they have done, but all is due to God. Because God is the author and giver of everything, natural and spiritual, He has become “ my song”. The phrase appears in three other places in the book of Psalms (KJV, ESV) where it is said: with my song I give thanks to him (God) - Psalm 28:7Let me remember my song in the night - Psalm 77:6 IYour (God's) statutes have been my songs in the house of my pilgrimage/sojourning - Psalm 119:54Lastly, Isaiah 38:20 (KJV) declares, “The LORD was ready to save me: therefore we will sing my songs to the stringed instruments all the days of our life in the house of the LORD.” ",
            "date": "Answered August 25, 2019",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajani Telagathoty",
                    "user_href": "/profile/Rajani-Telagathoty"
                },
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jarrett Kitzul",
                "href": "/profile/Jarrett-Kitzul"
            },
            "answer_text": "Psalm 40:3 And he hath put a new song in my mouth, even praise unto our God: many shall see it, and fear, and shall trust in the Lord. Many times in the Word of God the Psalmist refers to a point in his life of which would be referred to as established or Set in the Lord. I believe that in our walk with God that there are certain Levels of Relationship to reach., As stated by References to the Children of God, the Sons of God or Daughters and the Friends of God; repeated in the Called, the Chosen the faithful. It is my belief that at a certain point a person is given a choice to go further with the Lord after salvation, Salvation is certainly free but I believe that to walk in the presence of the Lord costs something as it is also stated that a man must count that cost. We are called to the likeness of his suffering,and just as the Children of Israel walked out of Egypt they crossed first the Red Sea and then the river Jordan. I believe that after this establishment you are given a Son. Some may refer to it as a song as David did, Some may be given a testimony some may be given a people of flock to lead. either way it is something special and personal which is tied into a gift given unto you in that time. The Lord loves to gift people and to reward faith and hope with astonishing things which we can not even imagine. So let your Song sing regardless of what others may thing. Sing it aloud for all to hear , sing it for the Lord which is really our only way of showing praise and thanks ..Our voice our love our obedience and testimony. ",
            "date": "Answered April 20, 2020",
            "views": "456",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Chase Edwards",
                    "user_href": "/profile/Chase-Edwards-12"
                }
            ]
        }
    ]
}