{
    "title": "What are France's disadvantages? - Quora",
    "tags": [
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tsuk János",
                "href": "/profile/Tsuk-János"
            },
            "answer_text": "There is no shortage of advantages France enjoys, its geographic position at the crossroad of the European continent being the most obvious. However most disadvantages are man made, and they are quite numerous ! 1. Over – centralisation. Ask yourself why Switzerland manages to run a country with less than ¾ of France’s taxation (including all sorts of social security levies). Their roads, their hospitals do not look decrepit ! The reason is that France is ONE country run from Paris, at least ever since 1000 A.D. and the successive “decentralisation laws” just added additional layers to the administrative cake. In Switzerland many decisions are taken on the communal level, or the cantonal level (there are 28 of them) and the citizens have constantly the possibility of expressing their disapproval if for their small unit some measure has a negative cost-benefit ratio. 2. France’s official religion is the equality of all citizens. This means that theoretically all should enjoy the same level of public services, whatever the cost. Of course in a globalised world this is ever less affordable. Still the number of rural hospitals, of useless government officials etc. show that the leopard has trouble shedding his spots. 3. The French are creative, but poor in industrial follow-up. The first high-speed trains were French (and Japanese) we exported the know-how and now we are unable to sign an export contract. Our atomic energy network is the densest in the world, but all new atomic power plants have slant eyes and our latest generation power plant is an industrial disaster. 4. Our political system is haphazard. Ever since WW2 a long line of successive governments have regularly reversed the policies from left to right and then back again, each time un-doing what the predecessors put in place. Italy is worse ? Spain has even a worse record ? That is no comfort, our competitors are Chinese, and they keep ploughing the same furrow. 5. Our culture is ever more out-dated. The art market has moved to New York or London. The French language is waging a losing battle against English. Listen to the business radio station BFM : every second word is “franglais” even when a proper French word would be available. Not only the “blogosphère”has abolished all grammatical rules, but even the leading newspapers tend to contain major errors. 6. Not accepting our ranking as a medium sized country. De Gaulle had the ambition to lead the world but ever since President Giscard d’Estaing our relative position on the international chess board has become quite obvious. Now with President Macron we may dream again of a Europe (or a euro zone to be precise) where we can again be the major player. Will this ambition succeed ? Take your bet. ",
            "date": "Answered November 27, 2017",
            "views": "4",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Teply",
                    "user_href": "/profile/Thomas-Teply"
                },
                {
                    "user_id": "Jeremy Ozenne",
                    "user_href": "/profile/Jeremy-Ozenne"
                },
                {
                    "user_id": "Gea Fab",
                    "user_href": "/profile/Gea-Fab"
                },
                {
                    "user_id": "Alexandre Chetrite",
                    "user_href": "/profile/Alexandre-Chetrite"
                },
                {
                    "user_id": "Béres Stephen",
                    "user_href": "/profile/Béres-Stephen"
                },
                {
                    "user_id": "Salvator Vella",
                    "user_href": "/profile/Salvator-Vella"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sam-Katse"
                },
                {
                    "user_id": "Magnus Reynhamar",
                    "user_href": "/profile/Magnus-Reynhamar"
                },
                {
                    "user_id": "Michael Neild",
                    "user_href": "/profile/Michael-Neild"
                },
                {
                    "user_id": "Ken Summers",
                    "user_href": "/profile/Ken-Summers-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Brun d'Aubignosc",
                "href": "/profile/Emmanuel-Brun-dAubignosc"
            },
            "answer_text": "Taxes, corruption and mass immigration. ",
            "date": "Answered April 22, 2017",
            "views": "408",
            "upvotes": "0"
        }
    ]
}