{
    "title": "What does it feel like to be an assassin? - Quora",
    "tags": [
        "Assassins and Hitmen"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajat Thosar",
                "href": "/profile/Rajat-Thosar"
            },
            "answer_text": "Being an assassin is the exact opposite of being glamorous! Think of it for a moment. You want to be secretive about yourself. You can’t go climb every tower and keep leaping of faith! People are gonna know it’s you! Also being an assassin would mean that you would have 0% social life. You also would not want to have any personal life too, as it would be under constant danger of getting exposed. So no strutting like Ezio!  Pic 1: He could do it, because he was Ezio Auditore da Firenze! Plus being an assassin would not be seen as a glamorous thing. Isn’t it looked down as rather extremist? (Well, yeah. Thank you Captain Obvious). You would have to be machine like - emotionless. Agent 47 to be precise. And as you grow notorious, you’re going to attract more Law Enforcement. You will starve of the “stardom” that you expected. And there would be no posters to tear down to lower the wanted level.  Pic 2: Agent 47 isn’t emotionally “active” a lot of times Take Gavrilo Princip for eaxmple. (Doesn’t ring any bell? Okay let me help: He assassinated Franz Ferdinand). He assassinated the Archduke of Austria- Franz Ferdinand and Ferdinand’s wife when the royal couple was visiting Sarajevo. This sparked the start of World War I. What was the next immediate action of Princip, when he shot two bullets at them? He swallowed a pill of cyanide to commit suicide (which had decayed, resulting into contraction of sickness). So it’s clear, that being assassin is nowhere near to being glamorous. Instead, it’s a horrific. Movies and games glorify these activities because the games are based on such activities (again, thanks to Captain Obvious). So let’s leave it to Ubisoft and Square Enix to create these games, cause they do it well. And we should just play these games and not think of being in one! Hope this helps! Cheers! Image Source - Google ",
            "date": "Answered June 21, 2017",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumit Sahana",
                    "user_href": "/profile/Sumit-Sahana"
                },
                {
                    "user_id": "Sean McClung",
                    "user_href": "/profile/Sean-McClung"
                },
                {
                    "user_id": "Vonder Vox",
                    "user_href": "/profile/Vonder-Vox"
                },
                {
                    "user_id": "Alex",
                    "user_href": "/profile/Alex-6202"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Tiwari",
                "href": "/profile/Rohan-Tiwari-19"
            },
            "answer_text": "It is definitely unlikely for a real assassin to get in touch with you here, but I did some research as these things interest me. So maybe I would take you on a different path than these stories from Assassin’s Creed and Hitman. So i came about the reality of the possibility of hiring an assassin when I somehow stumbled upon the Deep web , a place I would never recommend anyone with no idea about being safe on the internet to access. So, finding websites to hire a “Hitman”, I saw that they had conveniently provided a rate list to assassin various categories of people. The had also given a break up of how the money (given in euros, paid in bitcoins) is going to be used for the particular mission. They clearly stay away from high profile people such as politicians and celebrities, as that would be way to much heat, obvioulsy. This was enough to generate my interest after which I tried to get to know a little more about this. Through various sources I stumbled upon did shine some light on this, anonymously ofcourse. It said that these assassins are mostly highly trained ex-army men. The best in their game. These are the people that were specifically trained to get into a place, get the job done and get out without anyone even realizing what happened. These people are spread across mostly USA and Europe, keeping in touch and getting missions through the Deep Web. As mentioned by themselves, it is the easiest if you could send them a few pictures and some part of their schedule. It is never mentioned when would the job be done, but the only thing mentioned is that the money you send them would be used to buy flight tickets and new guns for every job. I suppose that would make it difficult to trace. Since there is ever no news of someone being killed mysteriously anywhere in the world, I would say that either it is a slow business or they are way too good at what they do. Either way, you would never be able to tell an assassin, or else they wouldn’t be one. So I believe the life of an assassin should be a normal one like anybody else, Until they get an assignment. And what it feels like? maybe like one of the regular things that needs to be done. Just a side business for the pros. ",
            "date": "Answered July 10, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebel Richardson",
                    "user_href": "/profile/Rebel-Richardson"
                },
                {
                    "user_id": "Midnight Gekkō Potato",
                    "user_href": "/profile/Midnight-Gekkō-Potato"
                },
                {
                    "user_id": "Vonder Vox",
                    "user_href": "/profile/Vonder-Vox"
                },
                {
                    "user_id": "Anmol Jalan",
                    "user_href": "/profile/Anmol-Jalan"
                },
                {
                    "user_id": "Jace Sinclair",
                    "user_href": "/profile/Jace-Sinclair-1"
                }
            ]
        }
    ]
}