{
    "title": "What happened to Harshad Mehta? Where is he now? - Quora",
    "tags": [
        "Harshad Mehta"
    ],
    "response": [
        {
            "author_info": {
                "name": "Subhransu Sahu",
                "href": "/profile/Subhransu-Sahu-17"
            },
            "answer_text": "Harshad Mehta was an Indian stockbroker, well known for his wealth and for having been charged with numerous financial crimes that took place in the Securities Scam of 1992. Of the 27 criminal charges brought against him, he was only convicted of four, before his death at age 47 in 2001.  Introduction of Harshad Mehta Harshad Mehta was an Indian Stock broker and was known as the big bull of Dalal Street. He was born on 29th of July 1954 in a poor family in Rajkot District in Gujarat. His father was peon. He migrated to Mumbai with just Rs40 in his pocket. In 1976 he somehow managed to complete his graduation in commerce from Lala Lajpat Rai College, Mumbai. After completing his graduation, he worked in some companies for couple of years. While working as a sales person in New India Assurance Company Ltd. he developed the interest in Share Market and hence after quitting his job in early 1980’s, he joined the Stock broker B.Ambalal. Later 1981 he worked as sub-broker to stock broker J.L.Shah and Nandalal Sheth. After gaining ample of experience, in 1984 he with his brother, started his own firm named as Grow More Research and Asset Management. Later, he became the member of Bombay Stock Exchange as a broker. In 1986, He started trading actively. By early 1990, he became a famous stock broker and a number of eminent people began to invest in his firm, and utilize his services including the then minister P.Chidambaram through Chidambaram's own shell companies. Harshad Mehta mainly used two instruments in scam: 1. Ready Forward Deal (RF Deal). 2. Bank Receipt (BR).  If u enjoying please upvote. Regards, Subhransu sahu ",
            "date": "Answered January 22, 2019",
            "views": "718",
            "upvotes": " View 206 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sahil Chauhan",
                    "user_href": "/profile/Sahil-Chauhan-389"
                },
                {
                    "user_id": "Haran Das",
                    "user_href": "/profile/Haran-Das"
                },
                {
                    "user_id": "Kranthi Kumar",
                    "user_href": "/profile/Kranthi-Kumar-201"
                },
                {
                    "user_id": "Shikara Gowda",
                    "user_href": "/profile/Shikara-Gowda"
                },
                {
                    "user_id": "Bhaskar",
                    "user_href": "/profile/Bhaskar-300"
                },
                {
                    "user_id": "Rahul Kumar Gupta",
                    "user_href": "/profile/Rahul-Kumar-Gupta-81"
                },
                {
                    "user_id": "Cool Beats",
                    "user_href": "/profile/Cool-Beats-2"
                },
                {
                    "user_id": "Harold Dsouza",
                    "user_href": "/profile/Harold-Dsouza-1"
                },
                {
                    "user_id": "Rijan Sigdel",
                    "user_href": "/profile/Rijan-Sigdel"
                },
                {
                    "user_id": "Shrestha Priya",
                    "user_href": "/profile/Shrestha-Priya-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirti-Bemoneyaware",
                "href": "/profile/Kirti-Bemoneyaware"
            },
            "answer_text": "One of the greatest scams in Indian stock market occurred in 1992, valued at Rs 5000 crore, (USD $ 740 million), was by a man known as ‘The Big Bull’, Harshad Mehta. The scam exposed the loopholes in the Indian banking system and the Bombay Stock Exchange transaction system. Harshad Mehta along with his brothers was arrested by the Central Bureau of Investigation (CBI) in November 1992 as shown in the image from our articleHarshad Mehta Scam of 1992, Big Bull, Rise and Fall  Mehta and his brothers were released on bail after three months in custody. He held a conference in a hotel along with his lawyer Ram Jethmalani and claimed that he had paid Rs 1 crore to then Prime Minister PV Narasimha Rao as a donation to the Congress to get him off the hook. A few years later, Mehta made a brief comeback as a stock market expert and started providing investment tips on his website and in a weekly newspaper column. Harshad Mehta was convicted by the Bombay High Court and the Supreme Court of India for his part in this financial scandal valued at Rs 5000 crore, (USD $ 740 million). On 31 December 2001, at the age of 47, Harsha Mehta passed away in Tihar jail after a heart attack. ",
            "date": "Answered July 6, 2020",
            "views": "303",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sahil Chauhan",
                    "user_href": "/profile/Sahil-Chauhan-389"
                },
                {
                    "user_id": "Ashish",
                    "user_href": "/profile/Ashish-1092"
                },
                {
                    "user_id": "Devendra Chhajed",
                    "user_href": "/profile/Devendra-Chhajed-1"
                },
                {
                    "user_id": "Jatin Nanda",
                    "user_href": "/profile/Jatin-Nanda"
                },
                {
                    "user_id": "Muthukumaran Rangarajan",
                    "user_href": "/profile/Muthukumaran-Rangarajan"
                },
                {
                    "user_id": "Varsha Rupani",
                    "user_href": "/profile/Varsha-Rupani-11"
                },
                {
                    "user_id": "Ronak Panchal",
                    "user_href": "/profile/Ronak-Panchal-141"
                },
                {
                    "user_id": "Pawan Rohra",
                    "user_href": "/profile/Pawan-Rohra-11"
                },
                {
                    "user_id": "Meera Ghaskadvi",
                    "user_href": "/profile/Meera-Ghaskadvi"
                },
                {
                    "user_id": "Rajiv Kumar Pandit",
                    "user_href": "/profile/Rajiv-Kumar-Pandit"
                }
            ]
        }
    ]
}