{
    "title": "What is inside the Kaaba? - Quora",
    "tags": [
        "Trivium (seven liberal arts)",
        "Elphinstone Road Railway Station",
        "Elphinstone Road Railway Station Stampede (September  2017)",
        "Colorado River",
        "Red Sea",
        "Kaaba",
        "Makkah, Saudi Arabia",
        "Muslims",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shad Rizvi",
                "href": "/profile/Shad-Rizvi"
            },
            "answer_text": "Ka’ba is nothing but a cubicle with four walls, a roof and a floor. It has no significance at all except that God has attributed it to Himself. It has absolutely nothing in it. My dear friend Rehan Wangde has given a lengthy, but mostly irrelevant reply full of mistakes and half knowledge. God attributed Ka’ba to Himself to test the mankind. Every muslim is directed to bow and prostrate towards Ka’ba from whichever place he is on earth. This way, it inculcates unity among muslim brotherhood. Secondly, one who bows and prostrates before Ka’ba with the belief that he is bowing and prostrating to Ka’ba, is attributing partners to God, which is a major sin. One has to believe that he is bowing and prostrating before Ka’ba as an obedience to One Absolute God. Hajj of Ka’ba is another ritual that inculcates unity among muslim brotherhood and they get to meet people from all over the earth and know each other. Islam encouraged people to involve in trade among each other after completing the rituals of Hajj. This way, seeds of international trading were sown among muslim brotherhood. Ka’ba, also known as Bait al-Ateeq, Masjid al Haraam and Bait al Allah, is the replica of Bait al Mamoor, located on the fourth Heaven. Quran says, there are seven heavens, one above the other like a set of funnels placed one above another; modern cosmic science has also confirmed that there are seven universes like ours, placed like funnels placed one above another. Quran also says God has created seven earths, that modern science is yet to confirm. Ka’ba was originally built by prophet Adam, with the aid of Archangel Gabriel using material from space. Throughout the history, it was damaged and rebuilt by various prophets and their Vicegerants. God has declared Ka’ba as His home, though God does not have a form or shape and is independent of any needs, it is only an attribution to inform the sanctity of the structure. Accordingly, anyone who is denier of God is not permitted to the sacred area of Ka’ba, The House of God (Baitullah). Just outside the structure of Ka’ba is a stone called Hajar al Aswad (The Black Stone) which has an equal sanctity. This stone was originally installed by prophet Adam, that came from space and was of piercing whiteness. However, the sins of mankind have blackened it over the ages. What more sins mankind carry out to the nature other than the pollution? Quran has already said that the sins of mankind in water and on land will be thrown back on them. Read more Pollution of Land and Sea in Quran ",
            "date": "Answered February 18, 2019",
            "views": "51",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahi Sharma",
                    "user_href": "/profile/Mahi-Sharma-533"
                },
                {
                    "user_id": "Maddie Khan",
                    "user_href": "/profile/Maddie-Khan-1"
                },
                {
                    "user_id": "Kareem Hasan",
                    "user_href": "/profile/Kareem-Hasan-11"
                },
                {
                    "user_id": "Nafay M",
                    "user_href": "/profile/Nafay-M"
                },
                {
                    "user_id": "Gulrez Tawar",
                    "user_href": "/profile/Gulrez-Tawar-1"
                },
                {
                    "user_id": "Shaik Sayar",
                    "user_href": "/profile/Shaik-Sayar"
                },
                {
                    "user_id": "Sarrthak Tripathi",
                    "user_href": "/profile/Sarrthak-Tripathi"
                },
                {
                    "user_id": "Zaki Shaikh",
                    "user_href": "/profile/Zaki-Shaikh-84"
                },
                {
                    "user_id": "Heena Agre",
                    "user_href": "/profile/Heena-Agre"
                },
                {
                    "user_id": "Morgan Roberts",
                    "user_href": "/profile/Morgan-Roberts-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akintunde Ayorinde",
                "href": "/profile/Akintunde-Ayorinde"
            },
            "answer_text": "Kaaba- Faithfuls are always carried away with emblems. Kaaba is a location not a house. That was the location assumed to be the position Ibrahim laid down the foundation of the house of worship with Ishmael V 2 : 125–129. Neither Ibrahim nor Ishmael will recognize the structure called Kaaba today. A careful reading of the Qur'an showed the foundation of the house laid was for the people, the inhabitants of the area, its people who accept the faith of Ibrahim, then the descendants of Ishmael, whoever among them, after this Ibrahim prayed for a messenger to be sent to them to recite. This is different from the people with covenant of prophethood and book .V 29:27, the descendants of Isaac and Jacob. Until the arrival of Muhammad pbuh the shrine was desecrated with Idol worshiping, it was the messenger of Allah that restored its use. Point of note is the building or the location was done by Ishmael and Ibrahim who were grandfather and a Senior uncle of Isreal/Jacob who was granted prophet hood with his descendants. The temple built in Jerusalem by Solomon was much later thousands of years after Kaaba was built. The Jerusalem temple direction was the first to be used as (quibla) direction of prayer as it was requested by Solomon from God when the temple was dedicated, 1King 8 : 27 to end. That same direction was used by Muhammad until a new revelation came to him V 2 : 142–148, despite this new revelations, when he Muhammad pbuh was about to be taken on journey to heaven he had to go to this distant temple away from Kaaba. Inside the Kaaba was nothing of religious purposes except a place for prayer. One significant thing apart from decorations is one so called Blackstone which Muslims attached so much importance, but Qur'an never associated any importance to it. ",
            "date": "Answered February 14, 2020",
            "views": "177",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priyanshi Sharma",
                    "user_href": "/profile/Priyanshi-Sharma-31"
                },
                {
                    "user_id": "Magdalena J. Hammar",
                    "user_href": "/profile/Magdalena-J-Hammar"
                },
                {
                    "user_id": "Mohammed Bala",
                    "user_href": "/profile/Mohammed-Bala-1"
                }
            ]
        }
    ]
}