{
    "title": "What are the best colleges under Mumbai University for history? - Quora",
    "tags": [
        "University of Mumbai",
        "Mumbai, Maharashtra, India",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priteesh Satpute",
                "href": "/profile/Priteesh-Satpute"
            },
            "answer_text": "In my opinion, Wilson College & Xavier's College, under Mumbai University, serves the purpose to its best. I'm myself a Wilsonian graduate from Arts Faculty. However both colleges are really good when it comes to Honors in History. I had friends in Xavier's doing History while I continued the same in Wilson's, and we compared the study material, professors teachings and tutorials pattern, activities, etc, both go hand in hand when it comes to quality. I felt blessed completing my graduation from Wilson's, right from junior college till the final year, I got the right kind of assistance, support and environment that's required from an educational institute and the best part is, its the same treatment for all students not just toppers . In fact in the final year the HOD (history) takes all the lectures and is involved and readily available for assistance and guidance. Besides, Them being the subject matter expert, are also concerned and attentive to every student's progress, and working areas, and strive hard to make the subject interesting and interactive, by including lot many activities in the course rather then just monotonous lectures, and that makes these colleges a better and fun filled institute to take up a vast subject like history. All the best! Stay blessed ! ",
            "date": "Answered June 11, 2019",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anamika K Nair",
                    "user_href": "/profile/Anamika-K-Nair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Namita Repe",
                "href": "/profile/Namita-Repe-1"
            },
            "answer_text": "Thanks for the question. You can try following options: a) Ramnarain Ruia college (has some best faculties for History) b) St. Xaviers college, Fort Traditionally, students from above two colleges tops the merit list in History at Mumbai University. There are few other colleges also like MD college, Sophia college etc. but above two are the best for History course under MU. ",
            "date": "Answered June 13, 2019",
            "views": "79",
            "upvotes": " Answer requested by Anamika K Nair"
        }
    ]
}