{
    "title": "What is the nature of Norwegian people? - Quora",
    "tags": [
        "Norwegian Ethnicity and People",
        "Norwegian (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kari Frydenlund",
                "href": "/profile/Kari-Frydenlund"
            },
            "answer_text": "Norwegians are often seen as reserved and almost cold. That's not the case at all. Out in public spaces, we tend to want our space and privacy. We won't approach a stranger sitting alone on a bench, and strike up a conversation. We would feel like we intruded on their space and privacy, and that's not in our nature. It's not dangerous to talk to us in public, though. If strangers approach us on the street to ask for directions, it's not like we whip out our brass knuckles and stare at them with roid rage in our eyes. You will be able to tell if it's a bad time to engage us in idle chit-chat on the bus stop by the lack of engagement. It might be the perfect time for it, and then we're all in. In social settings, we are much more smiley and approachable. Some may be a little withdrawn if they are self conscious about their rusty English skills, but most of us will be able and willing to strike up a conversation. No matter how well we hit it off with you, we will most likely not consider you our “close and personal friend” at the end of our first meeting. You will be an acquaintance, and you can go from there to a friend fairly quickly. Not a best friend that we share our deepest secrets with, because that usually takes time. You would be someone we enjoy hanging out with, and invite with us when we go bowling, or out for pizza, or to a quiz night at the pub, for instance. Given time, if we feel we can trust you not to gossip and you are open, we will probably begin confiding in you - gradually. And that's when you reach the point that one Quoran who has lived in Norway on and off, described something like this: When you have made a Norwegian friend, you have a friend for life. Compared to some cultures, when friends come easily and go away just as easily, he might have a point. We don't easily dispose of those we consider our good friends. And you know how Norwegians are notorious for being sporty and love anything to do with skiing during the winter, and bicycling and hiking during the summer? Let me tell you a little known secret about Norwegians: Not all of us are like that! A lot of us would never dream of going outside during the darkest and coldest of winter voluntarily. But yeah - we are more fond of “walking for no reason” than people in a lot of other countries. We relax and charge our batteries hiking in the woods, along our lakes or on the trails across our mountain plateaus. We have a beautiful natural scenery here, and we are - most of us, to some extent - children of nature. ",
            "date": "Answered April 22, 2018",
            "views": "139",
            "upvotes": " View 77 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eli B. MacAlpin",
                    "user_href": "/profile/Eli-B-MacAlpin"
                },
                {
                    "user_id": "Kevin Kuzma",
                    "user_href": "/profile/Kevin-Kuzma-2"
                },
                {
                    "user_id": "Jonas Lillelid",
                    "user_href": "/profile/Jonas-Lillelid"
                },
                {
                    "user_id": "Stein-Bjarne Johansen",
                    "user_href": "/profile/Stein-Bjarne-Johansen-1"
                },
                {
                    "user_id": "Christian Syvers",
                    "user_href": "/profile/Christian-Syvers"
                },
                {
                    "user_id": "Gala Semich Álvarez",
                    "user_href": "/profile/Gala-Semich-Álvarez"
                },
                {
                    "user_id": "Jugoslav Krstic",
                    "user_href": "/profile/Jugoslav-Krstic-1"
                },
                {
                    "user_id": "Isai Ancona",
                    "user_href": "/profile/Isai-Ancona"
                },
                {
                    "user_id": "Leart Lika",
                    "user_href": "/profile/Leart-Lika"
                },
                {
                    "user_id": "Aaron Marquees",
                    "user_href": "/profile/Aaron-Marquees-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Breonna Stagg",
                "href": "/profile/Breonna-Stagg"
            },
            "answer_text": "The Norwegian lifestyle is strongly connected to the time spent on studies and work. The work/life balance has become more demanding, with increasing expectations of professional and personal availability. The difference between who you are at work and in your free time is not that big. In Norway it is generally accepted to be personal at work. In return, it is also expected that work can be taken home – often in the form of a long weekend with home office at the cabin. Norwegians study and work hard during the week and the year – but are also good at resting and relaxation. An average working week consists of five seven-and-a-half-hour workdays. The average Norwegian takes every weekend off – and has five weeks paid vacation per year. Good health and an active lifestyle are important. Evenings and weekends are often filled with activities, from theatre performances and concerts to outdoor activities and sports. Norwegians have also become an adventurous people who love to travel. Norwegians generally have a simple approach to clothes – often focusing on practical, comfortable garments. This is also reflected in educational and professional settings: there is, for instance, rarely a strict dress code. That said, it is worth noting that there has been a significant change in recent years. In keeping with the rise of the minimalist Nordic/Scandinavian style, we see increasing numbers of formally dressed (and well-dressed) Norwegians – both young and old. The same tendency towards formality is also evident in other areas of public life, for instance in conversation and public debate. This shift towards formality does not mean that Norwegians leave their all-weather jackets and practical shoes at home, or adopt more formal forms of address. It is rather a sign that Norwegians, as a result of increasing globalisation and prosperity, have learned to adapt to the expected etiquette. Compared to other countries, people in Norway have a lot of free time. Norwegians admittedly work nine to five, but they have afternoons and evenings off – in addition to almost every Saturday and Sunday, as well as Christmas, Easter and summer holidays. Football (soccer) and handball rank among the most popular recreational activities for children and youth. Running, cycling and swimming have also become more popular forms of exercise. Nevertheless, it is cross-country skiing that deserves to be called our national sport, and one in which Norway boasts world-class results. ",
            "date": "Answered April 19, 2018",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "DJ. Scruff",
                    "user_href": "/profile/DJ-Scruff"
                },
                {
                    "user_id": "Dominic Albuquerque",
                    "user_href": "/profile/Dominic-Albuquerque"
                },
                {
                    "user_id": "Elfrid Tyri Gulliksen",
                    "user_href": "/profile/Elfrid-Tyri-Gulliksen"
                },
                {
                    "user_id": "Axel Felix",
                    "user_href": "/profile/Axel-Felix-3"
                }
            ]
        }
    ]
}