{
    "title": "What are the archaeological sources of history? - Quora",
    "tags": [
        "Sources",
        "Archaeology",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Duyer",
                "href": "/profile/Jim-Duyer"
            },
            "answer_text": "The first things an archaeologist does when he arrives at a site is look for pottery or carved stones such as flint tools or arrowheads. That will help him a great deal in dating the find. The next thing, if it is in the USA, is to look for signs of pre-Clovis cultures or evidence of early writing by Native Americans. Those pieces of evidence will need to get broken up and buried elsewhere, before anyone else arrives. The next thing is to see who will agree, without even visiting the site, to support your findings, which you have not come up with yet. But it helps to get that in early. And finally, he needs to determine which of his grad students are most likely to break their backs and yet least likely to squawk when he fails to give them any credit for anything they discover. Oh, and change his closes for the newspaper photo ops. Am I being cynical? Yes, to a degree. Some archaeologists work hard, and provide a valuable service to humanity. Too bad they come from small university backgrounds and their finds won’t receive much attention, nor will they be able to publish in first class journals. ",
            "date": "Answered July 9, 2016",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Murphy",
                    "user_href": "/profile/Peter-Murphy-27"
                },
                {
                    "user_id": "Will Ev",
                    "user_href": "/profile/Will-Ev"
                },
                {
                    "user_id": "Peter Sowmy",
                    "user_href": "/profile/Peter-Sowmy"
                },
                {
                    "user_id": "Magnus Auru'in",
                    "user_href": "/profile/Magnus-Auruin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Worcester",
                "href": "/profile/Kelly-Worcester"
            },
            "answer_text": "Believe it not the Bible is a good archeological source. It’s thousands of years old and when searching for lost sites, cities, etc. in the area of the world it covers the bible has proven itself very accurate in this regard. Many archeologists use it to determine the name of a site they have found. Coupled with the writings of ancient historians like Livy (Titus Livius), Josephus, and some others history can be rebuilt keeping in mind that historians like Livy, Pliny, and Josephus had a tendency to alter unflattering details for sake of politics. Still they are accurate enough when used in conjunction with the bible in archeology of those times and areas. Many of the works of both the Elder Pliny and the Younger were not strictly as historians but the information is valuable. ",
            "date": "Answered April 25, 2018",
            "views": "34",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oona Larson",
                    "user_href": "/profile/Oona-Larson-2"
                },
                {
                    "user_id": "Christian Ezra Sanders",
                    "user_href": "/profile/Christian-Ezra-Sanders"
                },
                {
                    "user_id": "Cory Galle",
                    "user_href": "/profile/Cory-Galle"
                }
            ]
        }
    ]
}