{
    "title": "What are the most violent biblical verses? - Quora",
    "tags": [
        "Violence",
        "Catholicism",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Godwin Goziem Jireh",
                "href": "/profile/Godwin-Goziem-Jireh"
            },
            "answer_text": "Here are the most violent Biblical verses: Matthew 27:26-36 Then Pilate freed Barabbas for the people. But he had Jesus whipped and handed over to be crucified. Then the governor's soldiers took Jesus into the palace and gathered the whole troop around him. They took off his clothes and put a bright red cape on him. They twisted some thorns into a crown, placed it on his head, and put a stick in his right hand. They knelt in front of him and made fun of him by saying, \"Long live the king of the Jews!\" After they had spit on him, they took the stick and kept hitting him on the head with it. After the soldiers finished making fun of Jesus, they took off the cape and put his own clothes back on him. Then they led him away to crucify him. On the way they found a man named Simon. He was from the city of Cyrene. The soldiers forced him to carry Jesus' cross. They came to a place called Golgotha (which means \"the place of the skull\"). They gave him a drink of wine mixed with a drug called gall. When he tasted it, he refused to drink it. After they had crucified him, they divided his clothes among themselves by throwing dice. Then they sat there and kept watch over him. 2 Kings 15:16 Then Menahem attacked Tiphsah, everyone there, and its territory. Because the city didn't open its gates for him, he attacked it and ripped open all its pregnant women. 2 Kings 25:5-10 The Babylonian army pursued King Zedekiah and caught up with him in the plain of Jericho. His entire army had deserted him. The Babylonians captured the king, brought him to the king of Babylon at Riblah, and passed sentence on him. They slaughtered Zedekiah's sons as he watched, and then they blinded Zedekiah. They put him in bronze shackles and took him to Babylon. On the seventh day of the fifth month of Nebuchadnezzar's nineteenth year as king of Babylon, Nebuzaradan, who was the captain of the guard and an officer of the king of Babylon, came to Jerusalem. He burned down the LORD's temple, the royal palace, and all the houses in Jerusalem. Every important building was burned down. The entire Babylonian army that was with the captain of the guard tore down the walls around Jerusalem. \" ",
            "date": "Answered September 24, 2020",
            "views": "341",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                },
                {
                    "user_id": "Emad Azer",
                    "user_href": "/profile/Emad-Azer-3"
                },
                {
                    "user_id": "Gandy M. Rosioru",
                    "user_href": "/profile/Gandy-M-Rosioru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Holman",
                "href": "/profile/Joshua-Holman-4"
            },
            "answer_text": "The most violent verses I’ve read is the story of Jael in Judges. She puts a tent peg in the temple of Sisera’s head as he sleeps after a battle. I taught this story one Sunday and there were gasps in the room. Here’s the story from Judges 4:17–22 (quotes are from the ESV): But Sisera fled away on foot to the tent of Jael, the wife of Heber the Kenite, for there was peace between Jabin the king of Hazor and the house of Heber the Kenite. And Jael came out to meet Sisera and said to him, “Turn aside, my lord; turn aside to me; do not be afraid.” So he turned aside to her into the tent, and she covered him with a rug. And he said to her, “Please give me a little water to drink, for I am thirsty.” So she opened a skin of milk and gave him a drink and covered him. And he said to her, “Stand at the opening of the tent, and if any man comes and asks you, ‘Is anyone here?’ say, ‘No.’” But Jael the wife of Heber took a tent peg, and took a hammer in her hand. Then she went softly to him and drove the peg into his temple until it went down into the ground while he was lying fast asleep from weariness. So he died. And behold, as Barak was pursuing Sisera, Jael went out to meet him and said to him, “Come, and I will show you the man whom you are seeking.” So he went in to her tent, and there lay Sisera dead, with the tent peg in his temple. ",
            "date": "Answered June 30, 2017",
            "views": "701",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Bianchi",
                    "user_href": "/profile/Lisa-Bianchi-1"
                },
                {
                    "user_id": "John Chow",
                    "user_href": "/profile/John-Chow-28"
                }
            ]
        }
    ]
}