{
    "title": "What if there never was 'The Five Civilized Tribes' in the United States of America? - Quora",
    "tags": [
        "Tribalism",
        "Native Americans",
        "Civilization",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "Culture of the United States of America",
        "History of the United States of America",
        "Hypothetical Scenarios",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-247"
            },
            "answer_text": "There were five tribes which were considered by whites to be civilized, because they adopted some customs of white Americans.Well, had they not done that, it would not have made any difference in their history, they would still have been deported to Oklahoma, forced to walk from their homelands all the way to Oklahoma, on what is known as the Trail of Tears, many of them died during the long walk. The thing is that many whites in the southeast wanted more land, so they wanted the land of those tribes. And president Andrew Jackson, who was very terrible in general toward the indigenous people and toward blacks too, when he was told of this idea of deporting them to Oklahoma, he loved it, So he ordered them to walk all the way, to Oklahoma, so the southeast would finally have no more tribes, the land would all belong to whites. Well,,it was appealed all the way to the Supreme Court, and the Supreme Court decided that Jackson’s order to deport the tribes from their homelands was actually illegal. Well, Jackson made a decision which I don’t know that any other US president ever made, to disobey a Supreme Court ruling, so he ordered the tribes deported anyway. So;they still bad to walk on the terrible Trail of Tears,on which so many died. It made no difference to the southern whites or to Jackson that they were considered to be civilized. They were indigenous people, members of tribes, they were non-white, the whites there wanted their land, so they had no choice, they had to go. Regardless of what the Supreme Court decided. ",
            "date": "Answered September 30, 2019",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Speers",
                "href": "/profile/William-Speers"
            },
            "answer_text": "Well, there would be fewer stories of Iroquois subjecting the Roman Catholic missionaries to deaths by horrific tortures. No St. Catherine Tekakwitha. ",
            "date": "Answered September 29, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                }
            ]
        }
    ]
}