{
    "title": "What nostalgic place brings back memories of you as a kid? - Quora",
    "tags": [
        "Nostalgia",
        "Childhood Memories",
        "Childhood",
        "Memories",
        "Human Memory",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rhon Cotton",
                "href": "/profile/Rhon-Cotton"
            },
            "answer_text": "I believe it was called the Sunset park. I went there I think only a handful of times as a toddler and I loved it there. There were giant slides (not sure if they were giant or I was just tiny), but they also had large nets that you could climb on, seesaws, a large open plain area where you could just run around, and probably other parts of the park that I haven’t visited. I’m pretty sure I fell a bunch of times there, probably got my first few scrapes there, and I definitely knew what it meant to go outside and play. Now, even that is like a distant memory. I remember how it was actually really crowded once. I’d go there again, it’s only a few minutes for a drive. I wonder what’s changed since the last time I was there. ",
            "date": "Answered May 15, 2019",
            "views": "232",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Diego Lozano",
                    "user_href": "/profile/Diego-Lozano-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esther Fichtenholz",
                "href": "/profile/Esther-Fichtenholz"
            },
            "answer_text": "My old elementary school! Everywhere I look has a memory there. The giant eucalyptus tree where we would hide from the yard duties and build fairy houses, the patch of chammomile that everyone believed was haunted, the playground where we would play pretend. There was a small meadow near the front that always had a bunch of daisies growing on it, and in kindergarten my best friend and I would always go out there and pick them after school. There was a tree in the middle of the blacktop that had low-hanging branches, and all the kids would try to jump up and see if we could touch one. There was a tall green fence around the area that separated the blacktop from the feild, and in third grade a boy managed to scale it somehow. Every Friday at lunch we would all pour our snacks out on the table and have a trade day. My parents gave me shit snacks, so no one ever wanted to trade with me, but one day I brought cookies and managed to trade a couple for an entire lychee fruit. It was my first time eating lychee. Unfortunately, they remodeled the school last summer! It makes me sad, because all of these were universally loved things among the students, and the incoming classes are going to have a very different experience. ",
            "date": "Answered May 28, 2019",
            "views": "476",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hollow Exterior",
                    "user_href": "/profile/Hollow-Exterior"
                },
                {
                    "user_id": "Sean Shao",
                    "user_href": "/profile/Sean-Shao-7"
                },
                {
                    "user_id": "Alexis Cedargren",
                    "user_href": "/profile/Alexis-Cedargren"
                }
            ]
        }
    ]
}