{
    "title": "What are some historical events of Russia? - Quora",
    "tags": [
        "History of Russia",
        "Russia",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregory Maddison",
                "href": "/profile/Gregory-Maddison"
            },
            "answer_text": "Establishment of the Kievan Rus’Christianization of Rus’Mongol invasionThe battle on the ice led by Alexander NevskiyThe Great Stand at the Ugra River (the end of the Mongol Yoke)Ivan the Terrible comes to powerThe invasion of Kazan’A series of wars with the Polish-Lithuanian Commonwealth, the Ottoman Empire and SwedenThe conquest of SiberiaPeter the Great comes to power, gives Russia access to the Baltic Sea, moves the capital from Moscow to St. Petersburg and westernizes RussiaRussia becomes an empireThe conquest of FinlandCatherine the Great comes to powerCrimean WarThe defeat of NapoleonThe establishment of the colonies Sagallo (Djibouti), Fort Ross (California), Fort Elizabeth (Hawaii) and Alaska.The abolishment of serfdomThe trans-siberian railway gets builtRusso-Japanese WarRussian Civil War (aka the collapse of the Russian Empire)The birth of the Soviet UnionThe industrialization begins. It was also a period when the literacy rate increased from less than 50% to 99%.The studios Souyzmultfilm and Mosfilm were foundedStalin’s purgeThe Great Patriotic WarThe defeat of HitlerThe Cold War beginsRussia launches the Sputnik sattelite, Laika the dog (first creature to get sent to space) and Yuri Gagarin (first astronaut in history). The astronaut Alexey Leonov was also the first astronaut to conduct a space walk and Valentina Tereshkova was the first female astronaut ever.Russia becomes a nuclear powerThe collapse of the Soviet UnionEconomic crisis of the 90sTwo wars in ChechnyaRusso-Georgian WarPutin comes to power, serves 4 sentences (almost 20 years) and improves Russia’s economy and armySochi OlympicsAnnexation of Crimea",
            "date": "Updated May 14, 2020",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dima Vorobiev",
                "href": "/profile/Dima-Vorobiev"
            },
            "answer_text": "The most important inflection points in Russian history are Christianization of Rus lands in 988. Russia becomes a part of EuropeThe subjugation of Russian fiefdoms to the Empire of Joche by Alexander Nevsky in 1240s-60s. Russia adopts the concept of one nation under one ruler.Muscovy is proclaimed the “Third Rome” by Grand Duke Vasili III. Russian rulers lay the claim to the imperial legacy of the Eastern Roman Empire: “Two Romes have fallen. The third stands. And there will be no fourth.”Ivan the Terrible has himself crowned as Czar (= “Caesar”) and occupies Turk kingdoms along the Volga River in 1552–1556. The great expansion of Russia eastward starts.In 1613, the House of Romanovs is voted to power. The new dynasty starts a gradual re-integration of Muscovy back to the European civilization.Peter the Great ends the formal subjugation of Russia to the Chingizid Turks in Crimea (1700), starts a large-scale Westernization and proclaims Russia an empire (1721).The spectacular defeat of Napoleon in Russia in 1812 launches a profound transformation of the Russian ruling elite from a mixture of cosmopolitan servants of the House of Romanovs into the class of ethnically-aware aristocratic flag-bearers of the Russian Empire.Millions of peasants are freed from serfdom in 1861, which leads to a rapid economic development. With the rise of the middle class, the Russian political nation takes its first baby steps. Professional political terrorism finds it European cradle in St. Petersburg.In 1891, Czar Alexander concludes a strategic alliance with France, which later becomes the Triple Alliance with Britain. Russia loses the historic chance to carve the Central and Eastern Europe with the ascendant German Empire. This leads to the war between the two powers in 1914, with the subsequent demise of both.In 1917, a swarm of Black Swans brings down the House of Romanovs. In the resulting chaos, a small group of determined Communists takes power and transforms Russia into a launching pad of the global Communist revolution.In 1924, the death of Lenin leads to a power struggle where Stalin turns up a winner. He retrofits the USSR into a variation of the Russian empire with an aggressive agenda of Communist Califate. He performs a successful modernization and creates a world-class army and military-industrial complex.Against all odds, in 1945 the Soviet system demonstrates its superiority and defeats Nazi Germany in WW2. The spoils of war are used for the second wave of industrialization, which makes the USSR the first nation in the outer space in 1961 and a nuclear superpower on par with the US and their allies.The inherent economic and technological weakness of Real Socialism sparks off attempts among the ruling elite to modernize it. In the mid-1980s, Gorbachev initiates his ill-conceived Perestróika. It coincides with a dramatic fall of oil markets, which de-facto bankrupts the USSR in 1990–1991.In the resulting chaos, the lower and middle level of Soviet bureaucracy, allied with ethnic elites use the chance to pick apart the Communist project. Starting with the dissolution of the USSR in 1991, a market-based state-oligarchical system emerges on the ruins of the Soviet economy. In Russia, the traditional pattern of a statist extractive economy is increasingly taking shape.In 1999, a few oligarchical clans bring to power a liberal functionary from St Petersburg, an alumnus of KGB Vladimir Putin. The new President uses the windfall from oil and gas exports to streamline and perpetuate the state-oligarchical market-based system, guaranteed by his strong authoritarian power.Picture below: Governator Arnold Schwarzenegger absorbing lessons of Russian history during his visit to Moscow in 2010. The painting in front of him is Vershchagin’s “The Apotheosis of War”.  ",
            "date": "Updated February 12, 2019",
            "views": "208",
            "upvotes": " View 559 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarim Faruque",
                    "user_href": "/profile/Sarim-Faruque"
                },
                {
                    "user_id": "Bettina Parker",
                    "user_href": "/profile/Bettina-Parker-1"
                },
                {
                    "user_id": "Jamal Mousavi",
                    "user_href": "/profile/Jamal-Mousavi-3"
                },
                {
                    "user_id": "Santanu Rathod",
                    "user_href": "/profile/Santanu-Rathod"
                },
                {
                    "user_id": "Joe Higgins",
                    "user_href": "/profile/Joe-Higgins-12"
                },
                {
                    "user_id": "Frank O'Hara",
                    "user_href": "/profile/Frank-OHara-6"
                },
                {
                    "user_id": "Chad Redding",
                    "user_href": "/profile/Chad-Redding-7"
                },
                {
                    "user_id": "Lam Yau-king (林友敬)",
                    "user_href": "/profile/Lam-Yau-king-林友敬"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-4491"
                },
                {
                    "user_id": "Alex Foster",
                    "user_href": "/profile/Alex-Foster-137"
                }
            ]
        }
    ]
}