{
    "title": "What is the origin of the last name Levy? - Quora",
    "tags": [
        "Nationality",
        "Genealogy",
        "Given Names",
        "Surnames",
        "Etymology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Aurand",
                "href": "/profile/Jerry-Aurand"
            },
            "answer_text": "Origin of Name. The origin of the name \"Levi\" has been quite variously explained. (1) In Gen. xxix. 34, J regards it as from the stem  (\"to join\"), and explains it by Leah's hope that her husband would now be joined to her. (2) Lagarde (l.c.) derives it from the same stem, but explains it as referring to Egyptians who, like Moses, attached themselves to the Israelites when they left Egypt. (3) Baudissin (l.c.) derives it in the same way, but refers it to those who were attached to, or accompanied, the ark. (4) Budde (l.c.) gives it the same derivation, but applies it to those who attached themselves to Moses in some great religious crisis. (5) Hommel (\"Aufsätze und Abhandlungen,\" i. 30; \"Süd-Arabische Chrestomathie,\" p. 127; \"Ancient Hebrew Tradition,\" pp. 278 et seq.) derives it from the Minäan \"lawi'u\" (= \"priest\"); with this Mordtmann (\"Beiträge zur Minäischen Epigraphik,\" p. 43) and Sayce (\"Early Hist. of the Hebrews,\" p. 80) agree. (6) Wellhausen (\"Prolegomena,\" 5th ed., p. 141) suggests that it is a gentilic name formed from the name of Levi's mother, Leah; in this opinion Stade (\"Gesch.\" i. 152), Gray (\"Hebrew Proper Names,\" p. 96), Nöldeke (hesitatingly; in \"Z. D. M. G.\" xl. 167), Gunkel (\"Genesis,\" p. 301), and Luther (Stade's \"Zeitschrift,\" xxi. 54) concur. (7) Jastrow (\"Jour. Bib. Lit.\" xi. 120 et seq.) connects \"Levi\" with \"Laba\" of the El-Amarna tablets. \"Laba\" he connects with the word  (\"lion\"), thus making Levi the \"lion\" tribe. (8) Skipwith (in \"J. Q. R.\" xi. 264) connects \"Levi\" with \"leviathan,\" making it refer to the coils of the serpent. This variety of opinion illustrates and emphasizes the present uncertainty concerning the origin and existence of the tribe, which results from the scanty evidence. ",
            "date": "Answered March 19, 2020",
            "views": "69",
            "upvotes": " Answer requested by Darrell Sanford"
        },
        {
            "author_info": {
                "name": "Robert Cuminale",
                "href": "/profile/Robert-Cuminale"
            },
            "answer_text": "Levy (Levi) was on of Jacob’s (Israel’s) sons. His descendants became the priestly tribe after the Exodus from Egypt. They all had a share in the temple service and thus received no land like the other tribes. It was a reward because they had not participated in the sin of the Golden Calf. AAron the brother of Moses and he were members of Levi. AAron produced the Golden Calf and was not punished for it and his descendants were the High Priests. ",
            "date": "Answered March 14, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}