{
    "title": "What inventions originated in China? - Quora",
    "tags": [
        "Technological Innovation",
        "Innovation",
        "Invention and Inventions",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dikshant Yadav",
                "href": "/profile/Dikshant-Yadav-8"
            },
            "answer_text": "1. Compass The compass we know of today was invented in China as early as the periods between 475 BC-221 BC. 2. Papermaking The art of papermaking was first developed in China by an official named Cai Lun after a long term experiment using plant fibers, bark, rags and torn fishing nets. 3. Printing The first movable type printing technique were first invented in China and first introduced to Korea and Japan and then westward to Persia and Egypt. 4. Silk-making The ancient art was such a closely guarded secret that anyone who gave the secret out to outsiders were considered traitors and could face the death penalty. 5. Gunpowder Gunpowder was first invented by the Chinese for fire crackers which was also first invented by the Chinese. 6. Ice-cream Did you know that ice cream was firs invented in China when the Chinese packed soft milk and rice mixture in snow. 7. Calendar A complete cycle of the Chinese calendar take 60 years. It dates back 2600 BC and it the oldest known calendar in the world. 8. Bridges Suspension bridges were first invented in China in 25 BC, 1800 years before such bridges were known in the west. 9. Sanitary The toilet paper was first invented in China in the late 1300 and was meant for emperors only. Now it is enjoyed by all and sundry. 10. Kites Kites are the invention of the Chinese. ",
            "date": "Answered January 26, 2018",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruby Tsao",
                    "user_href": "/profile/Ruby-Tsao"
                },
                {
                    "user_id": "Jaeson Monteiro",
                    "user_href": "/profile/Jaeson-Monteiro"
                },
                {
                    "user_id": "Allen Allington",
                    "user_href": "/profile/Allen-Allington"
                },
                {
                    "user_id": "Starr Xu",
                    "user_href": "/profile/Starr-Xu"
                },
                {
                    "user_id": "詹益铖 Yc",
                    "user_href": "/profile/詹益铖-Yc"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/panrev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Volker Hetzer",
                "href": "/profile/Volker-Hetzer"
            },
            "answer_text": "Depends on what you mean by “originating”. What's certainly true is that a lot of things were invented there first. But what's also true is that a lot of chinese inventions stayed there or were treated as mere curiosities. Take gunpowder and guns. Yup, the chinese did both. But the europeans, having seen those primitive beginnings, turned the pipe/powder/ball combination into the deadly force that dominates armed conflicts up to today.Take paper money. Yes, the chinese had it first. But it was European merchants who took it, in the form of bills of exchange and created first continent-, then planet-spanning markets for goods and services using paper and now virtual money.Take the compass. Who? China. But who did one expedition, then was bored and returned home? And who went on, discovered the world and made use of it? Yup.The problem was that some cultures are inherently creative, outward going and open, and others are inward, top-down and stagnant. That basically defines whether the occasional flash of individual brilliance fizzles out or becomes a roaring fire of progress. ",
            "date": "Updated April 5, 2020",
            "views": "437",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicolaas Manoppo",
                    "user_href": "/profile/Nicolaas-Manoppo"
                },
                {
                    "user_id": "Allen Allington",
                    "user_href": "/profile/Allen-Allington"
                },
                {
                    "user_id": "Camille Gawe",
                    "user_href": "/profile/Camille-Gawe"
                },
                {
                    "user_id": "Blues Shao",
                    "user_href": "/profile/Blues-Shao"
                }
            ]
        }
    ]
}