{
    "title": "What happens to the Mughal Empire after Bahadur Shah Zafar death? - Quora",
    "tags": [
        "Bahadur Shah Zafar (Mughal Emperor)",
        "Mughal Empire (1526–1857)",
        "Empires",
        "Historical India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Durga Prasad Surapaneni",
                "href": "/profile/Durga-Prasad-Surapaneni"
            },
            "answer_text": "Delhi durbar was held at Red Fort in 1911, called as Qila - e -Mubark by the people of Delhi and Britishers, to commemorate the accession of King George V to the British throne, almost all the princes and local rulers of indian states attended the Durbar. While the princely procession was going on, a beggar named Bahadur Shah, begging for alms with his useless legs moving in an agonising gait as his legs were not supporting him properly. Who was he ? why he bore a name of Bahadur Shaw? He was none other than grand son of “ Mirza Abu Zafar Sirajuddin Muhammad Bahadur Shah Zafar”, the last ruler of greatest of great empires, Mughals. A mystic Bahadur shah when arrested by the British near Humayun Tomb, tried by the British , pleaded that he was a puppet in Sepoy movement, without his involvement that he was declared as head of their revolt. British sent him on exile to Rangoon, Burmah and boasted that they had not punished - only exiled him. Being a good poet and philospher, he penned his last words in despair: I asked for long life - I received four days Two passed in desire, two in waiting The days of life are over, evening has fallen I shall sleep legs outstretched, in my tomb How unfortunate is Zafar! for his burial Not even two yards of land were to be had in the land of beloved. These instances were mentioned in “Kwaja Hasan Nizami’s”, ( 1873 - 1955) Begamaat ke Ansoo, he made a research on what happended aftermath sepoy Mutiny , 1857 and where are the successors of Mughals. One of the grandsons' real name was “ Mirza- Nasir-Ul Mulk”, who escaped the wrath of British along with his sister found employment in a merchant’s house in Shahajanbad. British later granted them Rs.5/- pension as that amount was not sufficient, they went in to begging. Bahadur shah Zafar’s daughter - Quraishia Begum also reduced to begging in the streets of Shahajanabad. Another prince of Mughals, Mirza Qama Sultan, who used to beg with an aristocratic tone - “ ya Allah please get me something i want to buy provisions.” Three of his sons were shot infront of his eyes. The where abouts of crown prince, Mirza Kavaish Bahadur, were not known. All the descendants of Mughals now living in penury.   Yaqub Habibuddin Tucy, present Mughal descendant. The Mughal emperor Jehangir would have never imagined that one day the traders for whom he has given trading rights to counter Portuguese , would reduce his Mughal kingdom to rubble. ",
            "date": "Answered September 7, 2018",
            "views": "179",
            "upvotes": " View 172 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruva Banavara",
                    "user_href": "/profile/Dhruva-Banavara"
                },
                {
                    "user_id": "Atharv Mishra",
                    "user_href": "/profile/Atharv-Mishra-15"
                },
                {
                    "user_id": "Sameer Bhide",
                    "user_href": "/profile/Sameer-Bhide-4"
                },
                {
                    "user_id": "Jaivardhan Sahay",
                    "user_href": "/profile/Jaivardhan-Sahay"
                },
                {
                    "user_id": "Aryan Bagde",
                    "user_href": "/profile/Aryan-Bagde-1"
                },
                {
                    "user_id": "Bhavya",
                    "user_href": "/profile/Bhavya-56"
                },
                {
                    "user_id": "Raju S Gunturi",
                    "user_href": "/profile/Raju-S-Gunturi"
                },
                {
                    "user_id": "Dilipkumar Bondalapati",
                    "user_href": "/profile/Dilipkumar-Bondalapati"
                },
                {
                    "user_id": "Navajit Choudhury",
                    "user_href": "/profile/Navajit-Choudhury-1"
                },
                {
                    "user_id": "Harihar Sharma",
                    "user_href": "/profile/Harihar-Sharma-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Hawaldar आदित्य हवालदार",
                "href": "/profile/Aditya-Hawaldar-आदित्य-हवालदार"
            },
            "answer_text": "The Mughal Empire was dissolved as soon as the British were victorious in the First War of Independence. Queen Victoria became the Empress of India and the Office of the Secretary of State of India came into existence. Bahadur Shah Zafar II was sent to Burma, where he died in 1862. His three sons were shot dead in front of his eyes at the Khooni Darwaza in Delhi by the British. The indirect descendants of the Mughal royal family scattered all over the subcontinent, many living in obscurity and poverty. This was a far cry from the heydays of Mughal Empire, when pomp and grandeur characterised the Mughal reign. Today these descendants live in cities like Delhi, Kolkata, Hyderabad and others. Thank you. ",
            "date": "Answered April 15, 2018",
            "views": "738",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Patil",
                    "user_href": "/profile/Aditya-Patil-362"
                },
                {
                    "user_id": "Aditi Prakash",
                    "user_href": "/profile/Aditi-Prakash-18"
                }
            ]
        }
    ]
}