{
    "title": "What are the best skills to adapt to the fourth industrial revolution? - Quora",
    "tags": [
        "Fourth Industrial Revolution",
        "Industrial Revolution",
        "The Future",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen Jones",
                "href": "/profile/Allen-Jones-174"
            },
            "answer_text": "Materials Science knowledge 3D Geometry, precision CAD programs like Dassault’s SolidWorks and Computer-Numerically-Controlled Machine Programming like MasterCam. Understanding of Programmable Logic Controllers and what they’re evolving into with the Internet of Things controls Sensors Technologies (infrared, video analytics, ultrasonic, pressure, velocity, chemicals testing, atmospheric, hardness, tensile strength, etc.) Ergonomics Haptic Technology Nanotechnology Data Analytics and Experiment Design & Testing so research methods and statistics too Controls & Instrumentation+Automation, Expert Systems, and Neural Networks Data communications technologies (the many wireless network standards in factories as well as old school Electronic Data Interchange, CAD, CAM, sales data, video streaming, etc. plus fiber optic inhouse and out of house, wireless and WiMax too, data centers and cloud storage, storage media, translation and format support, and network design basics. 3D Printing Biomimicry for design of products and processes Biomaterials Physics, Chemistry, Life Sciences, Geometry, Business Cost Accounting Concepts Intellectual Property Law and IP protection (physical, process, and cyber) Startups, investors, and industry development patterns (see Everett Rogers’ “Diffusion of Innovations” and Thomas Kuhn’s book on scientific revolutions.) ",
            "date": "Answered October 16, 2018",
            "views": "341",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John P Benfield",
                "href": "/profile/John-P-Benfield"
            },
            "answer_text": "Flexibility, collaboration, integration, innovation management and the ability to synthesize and adapt new information quickly and seamlessly into your world view. Depth of knowledge in single disciplines will still be needed, but the true heroes are going to be the polymaths, generalists and strong collaborators who can see the connections between disciplines, the opportunities in collaboration and who can leverage and motivate disparate teams towards a common vision that the individuals may not be able to see on their own. Companies who want to be successful are going to have to disband top-down models and empower more dynamic groups that can restructure around new opportunities, bringing together disciplines that, historically, may not have collaborated. Those same teams need to be able to collapse and reform around the next new ideas. There will need to be more tolerance for experimentation and less focus on incremental improvement. Innovation is going to be required to remain competitive. It's going to take new, high-risk ideas and an ability to mitigate and learn from failure. That's going to require a level of trust and empowerment that most current organizations aren't prepared to sustain. ",
            "date": "Answered February 7, 2017",
            "views": "1",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dong-Yoon Lee",
                    "user_href": "/profile/Dong-Yoon-Lee"
                },
                {
                    "user_id": "Esther Fuldauer",
                    "user_href": "/profile/Esther-Fuldauer"
                },
                {
                    "user_id": "Raivat Luthra",
                    "user_href": "/profile/Raivat-Luthra"
                },
                {
                    "user_id": "Anthony Wu",
                    "user_href": "/profile/Anthony-Wu-33"
                },
                {
                    "user_id": "Wallis Dudhnath",
                    "user_href": "/profile/Wallis-Dudhnath"
                }
            ]
        }
    ]
}