{
    "title": "What were the goods or commodities that were exported from India to Britain during the colonial era? - Quora",
    "tags": [
        "Colonial Era",
        "Commodities",
        "Crown Rule in India (1858-1947)",
        "Colonialism",
        "History of Great Britain",
        "Import/Export",
        "Great Britain",
        "Historical India",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashutosh Mehndiratta",
                "href": "/profile/Ashutosh-Mehndiratta"
            },
            "answer_text": "It started with cotton textiles in the early seventeenth century when the English East India Company merchants were driven out of the East Indies by the aggressive Dutch. Pepper would have been the other key commodity along with few other spices. The Golconda mines in India were the only known source of precious gems and diamonds at the time and many English merchants were drawn towards that trade. Some EIC officials indulged in private trade secretly, building great personal fortunes. Beginning in the late eighteenth century, with the onset of the Industrial Revolution, the EIC switched to raw cotton feeding mills in Lancashire and finished, machine-made textiles were exported back to India. The major source of raw cotton, however, was the American South. The Indigo dye used for coloring textiles was another cash crop that was forcefully grown in India, replacing food crops, by the EIC and was exported to Britain. Opium was grown as well in large quantities to be shipped to China to purchase Tea that was exported to Britain, where the beverage had become popular. Later the tea plant was smuggled by a Scottish botanist from China to India and large tea plantations came up for export to Britain and other parts of the world. Jute was another commodity that had a strong demand, especially during the two world wars. The British did not allow any industries to come up in India other than the rail network that was built primarily to ship raw commodities from the hinterlands to the ports. So there were hardly any ‘manufactured’ goods out of India. The first steel mill by Jamsetji Tata was allowed just because Britain was sorely lagging behind Germany and the US in steel production by late nineteenth century. ",
            "date": "Answered October 26, 2020",
            "views": "119",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lalit Barmecha",
                    "user_href": "/profile/Lalit-Barmecha-1"
                },
                {
                    "user_id": "Anusiah Balasingam",
                    "user_href": "/profile/Anusiah-Balasingam-1"
                }
            ]
        }
    ]
}