{
    "title": "What is an experience that most people will eventually go through? - Quora",
    "tags": [
        "Experiences in Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mari Hakobyan",
                "href": "/profile/Mari-Hakobyan-8"
            },
            "answer_text": "In my opinion, the experience that everyone will go through at least once is disappointment. The disappointment of not coming true of your own expectations and there is nothing we can do to avoid that. Mainly, people face it in young age , when mostly they do not realize how life can be and as a result, watch all their expectations ruining in front of their eyes. This is really sad, but eventually everyone is going to experience this in their lives whether they like it or not. But what is important, is that it should never break people and instead, motivate people to try something new. ",
            "date": "Answered October 15, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leona Jones",
                    "user_href": "/profile/Leona-Jones-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kauri Wilson",
                "href": "/profile/Kauri-Wilson-4"
            },
            "answer_text": "A range of Abuse- spiritual, economical, physical, verbal and psycholigical. We experince subtle, undermining changes in our peers and support groups whether you are the victim or the agressor. Naturally we hope for our community to understand us and our adverse social impacts, however no individual can if you busy idling the idea of having power and control over external influences you can’t tame. Therefore it is an internal belief in ourselves to have thought we can do better and must be better for the other person to recognize us yet we have no autonomy- empowerment. We are then entitled beings, having to prove our legitimacy yet in doing so, we cause a lapse in building succesful interpersonal and working relationships with those around us who we can and might mistake as - worthless, unstable or transient. Going through any abuse is detrimental and uncalled for. Therefore I hope who ever is reading this. You take no tolerance or a passive approach to negative, underlying issues from your abuser. ",
            "date": "Answered October 21, 2020",
            "views": "45",
            "upvotes": " Answer requested by Devin Swycinsky"
        }
    ]
}