{
    "title": "What are some examples that prove Trump is a far better human being than a good politician? - Quora",
    "tags": [
        "Politicians and Government Leaders of the United States of America",
        "Politicians and Government Leaders",
        "Presidents of the United States of America",
        "Trump-Pence 2016",
        "The Human Race and Condition",
        "Donald Trump (politician, business person)",
        "Politics",
        "Politics of the United States of America",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peggy Walter",
                "href": "/profile/Peggy-Walter"
            },
            "answer_text": "There is no indication that Trump is a better person than he is a politician. He’s a rotten person. He cheats on his wives, he’s rude, he mocks the disabled and members of the military, he’s greedy and incurious. He’s a boar, a bully and a racist, a disgusting misogynist and an utter fool. He lies constantly, he dishonors his oath of office, breaks laws without batting an eye, is infatuated with tyrants and dictators, incites violence among his followers, and surrounds himself with weak suck-ups. His inner circle is a bunch of crooks and his family is a case study in why nepotism is terrible. His policies are nonexistent with the exception of those designed specifically to further enrich the wealthy, especially him. He even cheats at golf. He is literally the worst person who could ever hold the office of president of the United States. But he must be a good politician, because he got elected despite being reprehensible in every way. So, better politician than person. ",
            "date": "Answered August 31, 2020",
            "views": "87",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victoria Napora",
                    "user_href": "/profile/Victoria-Napora-1"
                },
                {
                    "user_id": "Mike Dulak",
                    "user_href": "/profile/Mike-Dulak-1"
                },
                {
                    "user_id": "Angie Colondres",
                    "user_href": "/profile/Angie-Colondres"
                },
                {
                    "user_id": "Ajith Raj",
                    "user_href": "/profile/Ajith-Raj-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Paul",
                "href": "/profile/Donna-Paul-30"
            },
            "answer_text": "Let’s see. Well he’s had 4 bankruptcies, a fraudulent university, ex employees that still haven’t received their wages, owes millions to Russia because no one else in the states would lend him money, thinks grabbing women by the crotch is an O.K. thing. Did I leave anything out? ",
            "date": "Answered August 31, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Victoria Napora",
                    "user_href": "/profile/Victoria-Napora-1"
                }
            ]
        }
    ]
}