{
    "title": "What is nucleotide excision repair (NER)? How does it work? - Quora",
    "tags": [
        "Nucleotide",
        "Bioinformatics",
        "Genomics",
        "Biotechnology",
        "DNA",
        "Molecular Biology",
        "Biochemistry",
        "Genetics and Heredity",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Lowe",
                "href": "/profile/James-Lowe-196"
            },
            "answer_text": " Damage to one or a few bases of DNA is often fixed by removal (excision) and replacement of the damaged region. In base excision repair, just the damaged base is removed. In nucleotide excision repair, a patch of nucleotides is removed. NUCLEOTIDE EXCISION REPAIR Nucleotide excision repair is another pathway used to remove and replace damaged bases. Nucleotide excision repair detects and corrects types of damage that distort the DNA double helix. For instance, this pathway detects bases that have been modified with bulky chemical groups, like the ones that get attached to your DNA when it's exposed to chemicals in cigarette smoke. Nucleotide excision repair is also used to fix some types of damage caused by UV radiation, for instance, when you get a sunburn. UV radiation can make cytosine and thymine bases react with neighboring bases that are also Cs or Ts, forming bonds that distort the double helix and cause errors in DNA replication. The most common type of linkage, a thymine dimer, consists of two thymine bases that react with each other and become chemically linked. In nucleotide excision repair, the damaged nucleotide(s) are removed along with a surrounding patch of DNA. In this process, a helicase (DNA-opening enzyme) cranks open the DNA to form a bubble, and DNA-cutting enzymes chop out the damaged part of the bubble. A DNA polymerase replaces the missing DNA, and a DNA ligase seals the gap in the backbone of the strand ",
            "date": "Answered November 16, 2019",
            "views": "52",
            "upvotes": " Answer requested by Ali Naqvi",
            "upvoters": [
                {
                    "user_id": "Sean Steele",
                    "user_href": "/profile/Sean-Steele-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gangadharan Nair",
                "href": "/profile/Gangadharan-Nair-7"
            },
            "answer_text": "In nucleotide excision repair (NER), damaged bases are cut out within a string of nucleotides, and replaced with DNA as directed by the undamaged template strand. This repair system is used to remove pyrimidine dimers formed by UV radiation as well as nucleotides modified by bulky chemical adducts. Links:- https://en.wikipedia.org/wiki/Nucleotide_excision_repair ",
            "date": "Answered November 6, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter"
        }
    ]
}