{
    "title": "What is the modern name of the disease the Bible calls leprosy? - Quora",
    "tags": [
        "Leprosy",
        "The Bible",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carol Whelan",
                "href": "/profile/Carol-Whelan"
            },
            "answer_text": "While leprosy today is leprosy (and also Hansen’s), leprosy in the bible was likely a much more generic term: tzara (צָרַע)- the root verb means to have a skin disease. It’s unlikely that all biblical cases of “leprosy” were actually true Hansen’s. It is widely accepted that they were everything from psoriasis, vitiligo, pie baldism to crusted scabies. Given that it is very hard, in fact impossible to culture M. Leprae, and diagnosis today is based on clinical features as well as acid fast staining, it just isn't possible that the people writing and being written about had 100% diagnostic accuracy. ",
            "date": "Answered March 26, 2018",
            "views": "262",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Waugh",
                    "user_href": "/profile/John-Waugh-15"
                },
                {
                    "user_id": "George Lord Jr DC",
                    "user_href": "/profile/George-Lord-Jr-DC"
                },
                {
                    "user_id": "Lorri Robinson",
                    "user_href": "/profile/Lorri-Robinson"
                },
                {
                    "user_id": "Kevin Davidson",
                    "user_href": "/profile/Kevin-Davidson-9"
                },
                {
                    "user_id": "Craig Milliman",
                    "user_href": "/profile/Craig-Milliman"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Aho",
                "href": "/profile/John-Aho-3"
            },
            "answer_text": "The modern medical name for Leprosy is Hansen Disease, although the term Leprosy is still in popular usage. Infection by either Mycobacterium leprae or Mycobacterium lepromatosis can, following an indolent period of from five to twenty years, cause granulomas of the skin, nerves, respiratory tract, and, sometimes, the eyes. Granulomas are the body’s attempt to wall off the bacteria. The classic image of body parts falling off is actually not caused by the disease directly, but, rather, by the nerve granulomas reducing pain sensation, which allows unrelated infections to start and grow unnoticed, as in diabetic foot sores, resulting in gangrene, osteomyelitis, and tissue, digit, and, rarely, limb loss. Nowadays, Hansen Disease is curable with the simultaneous use of either two or three specific antibiotics, depending on the specific bacterial strain. ",
            "date": "Answered April 7, 2018",
            "views": "376",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William James",
                    "user_href": "/profile/William-James-399"
                },
                {
                    "user_id": "Leah Tracy",
                    "user_href": "/profile/Leah-Tracy-3"
                }
            ]
        }
    ]
}