{
    "title": "What did the world use before the invention of the electric light? - Quora",
    "tags": [
        "Inventors",
        "Invention and Inventions",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted England",
                "href": "/profile/Ted-England"
            },
            "answer_text": "What did the world use before the invention of the electric light? How far back do you want to go and how much money have you got? If you didn’t have any money you used the light from the fireplace. Here is an oil lamp, said to be from Israel and supposedly 2,000 years old. You can see that it has been used. The fuel would have been any seed oil or olive oil. Such oils were a major export from Greece while the lamps were often made in Israel. There were also made in glass and metal. If you were rich you might have one with a central oil reservoir and several wicks. The wick was any piece of cloth. They smoked badly and needed near constant attention. The wick could be adjusted with a stick of wood or metal called a pickwick. This technology remained essentially the same until the late 1700s though the lamps might have been prettier. My own photo  In Europe, specially Britain the rushlight was used. This was a rush, picked when green and partially stripped of the outer hard layers but leaving the pith behind. These were dried then soaked in any animal fat that was available though mutton was preferred. They could be propped up somewhere on a slope and the upper end was lit. Over a few hours they would steadily burn away, smoking and smelling and giving about as much light as a modern candle. If you could afford it you had an iron stand for them.  Chobham Rush Light Holder Rushlight - Wikipedia I do not know when candles were invented but it was a long time ago. They were a convenient cylinder of solid fats or beeswax, or maybe a mixture of the two. They were expensive since the fats were regarded as food and the beeswax had a multitude of other uses. They also needed pretty constant attention since the wick didn’t burn away as fast as the fuel and they had to be trimmed frequently. That was partially solved by the use of a braided wick. They were so expensive that Prince Albert, the husband of Queen Victoria forbade the replacement of partially burnt candles until they were burned right down. In 1830 paraffin wax was discovered in petroleum oil and soon was added to candles or entirely replaced the fats and beeswax. This made candles much cheaper once oil refining for kerosene got going. Paraffin wax - Wikipedia In 1774 the French chemist Lavoisier demonstrated that oxygen was about 21% of the air and supported combustion. Some years later the Swiss chemist and physicist Ami Argand wanted lights for a brandy distillery he was operating in France. Candles were too expensive and when he tried large oil lamps with thick wicks they smoked very badly. He realised that most of the smoke was coming from the middle of the wick because the oxygen in the air was not getting to the fuel. It occurred to him to make a tubular wick about the same size as the thick wick he had tried, and allow a current of air to come up the middle and outside of the tube. This gave a better light, smoked a lot less and with the addition of a glass chimney the light was even brighter. Argand had to go to England to get heat resistant glass and eventually he got a deal with Matthew Boulton and James Watt to make his lamps in Birmingham. Within a few years George Washington and the Emperor of China were using Argand lamps made in Birmingham, England. Aimé Argand - Wikipedia  Argand Lamp; B. Gardiner After Lavoisier was executed in the French revolution his wife married an American scientist who had remained loyal to the British in the War of Independence, Benjamin Thompson. He seems to have realised that the tubular wick Argand lamp was expensive to make and may have developed a lamp with a thin, wide flat wick. This was called a Rumford lamp. Benjamin Thompson - Wikipedia You probably have been told that all these lamps burned whale oil. Well some did, but the main fuel in France was colza oil, which was pressed from the original variety of plant that now makes canola oil. By 1820 the French were exporting large amounts of colza. Meanwhile, back in Birmingham, Boulton and Watt’s junior partner William Murdoch was experimenting with coal gas. By 1802 their Soho factory was illuminated with coal gas to celebrate a short lived peace treaty with France. William Murdoch - Wikipedia In the USA, some lamps burned a mixture of turpentine oil distilled from pine wood and alcohol, called burning fluid. This was a dangerous mixture, used until the 1850s. Burning Fluid Recipe  Early Lighting 7 In the late 1840s and early 1850s Abraham Gesner in Canada and James Young in Britain distilled a substance like modern kerosene from oil sands, and oil shale and Ignacy Lukasiewicz in Poland got it from Carpathian petroleum. By 1856 Ignacy Lukasiewicz had a refinery going and sent some of his product to a lamp maker in Vienna, Austria, Karl R Ditmar who developed an improved flat wick burner and a glass chimney that swelled out at the base and narrowed at the top. This was almost immediately “stolen” and patented in the USA as an original invention. Most cheaper kero lamps have followed this pattern.  My own photo, lamp belonged to my great grandmother. Tubular wick lamps were also redesigned for kerosene. By the 1890s kerosene lamps had become very elaborately decorated.  Bradley & Hubbard Nickel Hanging Library Lamp - Oil Lamp Antiques By the end of the 1800s most large towns had gasworks with pipes running underground to many streets. Many homes had gas lighting downstairs but cheaped out and used kerosene lamps or candles upstairs. In 1885 Carl Auer von Welsbach of Austria began to develop incandescent mantles which gave a white glow when heated with a gas flame. This was a raging success and even in 1905 it was a serious question whether the “new” electric light bulbs would beat them in the market. Electric light bulbs were unreliable. Carl Auer von Welsbach - Wikipedia In the early 20th century the gas mantle was adapted to the kerosene lamp in Germany and later in the USA.  oil lamps, the metal kerosene aladdin lamps The final type, I guess is the pressure lamp which uses kerosene or petrol vapor to heat the mantle giving a brilliant light. Here is a table top type.  1910(?) Sun Gas lamp ",
            "date": "Answered August 21, 2018",
            "views": "699",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikell Allan",
                    "user_href": "/profile/Mikell-Allan"
                },
                {
                    "user_id": "Markus Schwemmle",
                    "user_href": "/profile/Markus-Schwemmle"
                },
                {
                    "user_id": "Jeya Rama",
                    "user_href": "/profile/Jeya-Rama"
                },
                {
                    "user_id": "Alan Dicey",
                    "user_href": "/profile/Alan-Dicey"
                },
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Winslade",
                "href": "/profile/Mike-Winslade"
            },
            "answer_text": "I remember my Grandmother talking about getting the electricity on for the first time. My Grandfather had arranged for one electric light to be installed in the lounge room but when the installers came Grandmother insisted they put it in the kitchen. At that time the other lights in the house were gas lanterns piped to a common connection (remember when every town had a gasometer?) Other lights were kerosene and “tilley lanterns”. My Father talks about his eccentric Aunty who would only read by natural light and would have nothing to do with gas lanterns and was literally afraid of electric light. ",
            "date": "Answered August 21, 2018",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wallis Dudhnath",
                    "user_href": "/profile/Wallis-Dudhnath"
                }
            ]
        }
    ]
}