{
    "title": "What is the difference between pre-colonial literature and contemporary literature? - Quora",
    "tags": [
        "Contemporary Literature",
        "Similarities and Differences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Rupp",
                "href": "/profile/Tim-Rupp-1"
            },
            "answer_text": "The difference between pre-colonial and contemporary literature is that pre-colonial literature was written before the colonial period and contemporary literature was written in the current time. Every piece of writing is influenced by the world in which it was written and the thoughts and beliefs of its writer. People who lived in pre-colonial times wrote their books against the background of a pre-colonial world and their thoughts and ideas were founded in that landscape. I’m not going to make a list of absurdities about whether the writers used certain language or wrote in certain ways. I don’t believe in the notion that writers from a certain period wrote the same way as each other and then someone flicked a switch and the writing was different. Generalisations about literature such as this are not helpful. Writers write about the world that they are writing in. The world changes, the topics change and writing progresses. ",
            "date": "Answered August 27, 2020",
            "views": "22",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marielle Millena",
                    "user_href": "/profile/Marielle-Millena"
                },
                {
                    "user_id": "Theaa Llena",
                    "user_href": "/profile/Theaa-Llena"
                },
                {
                    "user_id": "Sakamoto Yamada",
                    "user_href": "/profile/Sakamoto-Yamada"
                },
                {
                    "user_id": "Jiezel Corbilla",
                    "user_href": "/profile/Jiezel-Corbilla"
                },
                {
                    "user_id": "Yhangyhang Cutanda",
                    "user_href": "/profile/Yhangyhang-Cutanda"
                },
                {
                    "user_id": "Axel Jay Ediral",
                    "user_href": "/profile/Axel-Jay-Ediral"
                }
            ]
        }
    ]
}