{
    "title": "What are the roots of French Revolution.? - Quora",
    "tags": [
        "French Revolution",
        "History of France",
        "Revolution",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriel Savard",
                "href": "/profile/Gabriel-Savard"
            },
            "answer_text": "The French Revolution has many origins and they are very complex so I will only present the major causes of it. Mainly, the French Revolution is caused by different factors in different aspects of life: socially, economically and politically. Each of these aspects affected the lowest order, the ‘’Tiers État’’ or Third order in english. This order was composed mostly of farmers (85%), craftsmen (7%) and the bourgeoisie (5%). Politically, the nobles have many privileges and they are rivals to the king. The noble order, the second one, is slowly declining and losing power against the bourgeois who are getting very rich through trade and commerce. The nobles, trying to maintain their positions, oppose the king and succeed to turn down the possibilities of the bourgeois. Even if the society was split between 3 orders, you could move from one to another, mostly going up. This was the case of the bourgeois who could pay a small fortune to acquire a noble rank. However, following the nobles reaction, these possibilities were stopped. Add the fact that the nobles had a lot of privileges like not paying any taxes or being the only ones to be able to be officers in the army and you get angry bourgeois. You need to know that the bourgeois are the most important actors during the Revolution because they belong to the Third order, but they are powerful because of the money made from their occupations. Bankers, rich merchants and other liberal professions belong to this order. Economically, the finances of the kingdom are not in a good shape: during all the XVIIIth century, France has a lot of debt. The situation get even worse with the American Revolution which cost a lot for the king. Additionally, the administration is poorly managed and nobles take advantage of it. They sell back to the administration their offcial charges after having worked for the king. With the ‘’Convocation des États généraux’’, king Louis XVI create an assembly of all 3 orders to discuss a new tax to cover the debts and it turns out differently... Socially, other things affect the population such as the corporations. The corporations are an organization of a type of professions which decide the production and the distribution of the goods made by the said profession. They possess a juridical status and are thus protected by royal laws. The bourgeois and the craftsmen, being restricted by those institutions of the past, want to free themselves from them. Finally, famine is another element of the social unrest. Until the XIXth century with the Industruial Revolution , famines were still haunting modern States. Bad weather caused bad harvest prior to 1789 and it sparkled a rise of the price of bread. The Enlightment and the newly Liberalism of the XVIIIth century are also important for the cause of the Revolution. Even if a big proportion of the population doesn’t know how to read, the liberal ideas still manage to spread among the people, from the intellectual bourgeois down to the rest of the population. Ideas of liberty, truth and knowledge are motivating some people, but the way I see it, the bourgeois really wanted to expand their power… Mix all those elements together and get a pretty important social unrest. Obviously, the bourgeois are leading the Revolution because they are the most hungry for power, but they are still supported by a majority of the popualtion. The ‘’Tiers État’’, at first, are mostly against the nobles and their privileges. It’s only later that they turn against the king and that the Revolution becomes more radical. ",
            "date": "Answered January 20, 2017",
            "views": "6",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ndri Pasha",
                    "user_href": "/profile/Ndri-Pasha"
                },
                {
                    "user_id": "Massimo Valerio Preite",
                    "user_href": "/profile/Massimo-Valerio-Preite-1"
                },
                {
                    "user_id": "Arthi Vikram",
                    "user_href": "/profile/Arthi-Vikram-1"
                },
                {
                    "user_id": "Daniel Hong",
                    "user_href": "/profile/Daniel-Hong-97"
                },
                {
                    "user_id": "Victor Despontin",
                    "user_href": "/profile/Victor-Despontin-1"
                },
                {
                    "user_id": "Twin Stars",
                    "user_href": "/profile/Twin-Stars-1"
                },
                {
                    "user_id": "Etienne Mourez",
                    "user_href": "/profile/Etienne-Mourez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Etienne Mourez",
                "href": "/profile/Etienne-Mourez"
            },
            "answer_text": "Several factor led to the Revolution, a long cookout boiling throught the decades to The massive Debt, France was an agricultural nation at the dawn of its industrial revolution. Read Arthur Youg “Voyage en France” for an detailed overview. Tax collection was faulty and expenses many. Basicaly they were outsourcing taxe collection. Ferme générale - Wikipedia The American Revolution , Training, and Keeping an army is expensive, especialy the Navy. France had a big military upgrade after the 7 years war - called the french and Indians war in other climate. Focus was put on the Navy, Versailles also funded heavily the young American Republic.  The court system and the 3 orders  a peasant supporting a noble and a priest.” Oratores, Militantes, Laborantes. “Those way Pray, those who fight , those who work. The 3 pillars of the Kingdom since Middle Ages. The nobles were not paying taxes because they pay with their blood in wars. so they said… Priest had a similar excuses. Centuries of wealth concentration created a class of parasites hoarders. The king granted pensions on Nobles for their sustenance. Monasteries and abbot were filthy rich. Add the arrogance and injustice of Class to this god sanctionned system to add flavor to the upcoming Revolution. Failed Reforms . So many “controleur général des finances” One of them Etienne de Silhouette became a byname for fading shadow. Lets just mention Turgot who tried to cut reglementation and tarif on trade, especialy on grain. His reforms, despite all the good sense only led to speculation and riot whe the price of bread rose up sharply. And Necker, whose reform were favoring the burgeoning merchant class -and his business- His dismisal , the 11 of July 1789, made things worst. Climate Change : The 1788 was particularly harsh, ruining crops and raising the price of bread again. Les états-Généraux et les cahiers de doléances - Grievances lists  To solve the financial crisis and inforce new taxes, the king summon the general estates. Deputies from the 3 Orders were elected and gathered at Versailles. Peoples from all the country were asked to inform the King of their plea. Surpringly, Taxes and oppression from the Nobles were top of list. But you can also read about equal right, women right, access to military and civil servant positions for commoners, abolition of slavery, Rural reforms… It is a great source for an historian. Did you know that a peasant had no right to hunt game even if it ravage its fiels. It was a nobility priviledge. Estates-General of 1789 - Wikipedia All the kingdom Hopes were focused on this meeting. When those hopes of reforms were dispeled by opposing elites. The deputies of the third estates, joined by some member of the two others orders gathered in a “National Assembly”. A defiant king having close the meeting room, you have here the Tennis Court Oath , showing these deputies “vowing not to separate, and to reassemble wherever circumstances require, until the constitution of the kingdom is established”  Menaces are not enough to shake their resolve. So the king Louis XVI seem to have it like: “ Ils veulent rester… Hé bien merde, qu’ils restent” (Let them stay were they are ) But the Queen and many Aristocrats are planning a coup de force and gather loyalist Regiments around Paris, while trying to convince the King to give the orders. Rumors of this reach Paris, and Parisians look for weapon to defend themself. After looting some rifles in the Invalides and police post, someone remember there is plenty of gunpowder in bastille.  After a brief siege and the arrival of soldiers and cannon from the Gardes Françaises -a Milicia Regiment- the governor agrees to the besieger initial request to hand over guns and ammo. - others will say he surrendered- This act of Defiance to Royal autority embolden a whole nation. Legend has it that Louis the XVI came back from a bad hunting day and wrote on his diary : 14th of July: nothing. After being awaken by news of the storming, we have this dialogue: The King : Is this a revolt ? The duke : No Sire. It is a Revolution. ",
            "date": "Answered January 20, 2017",
            "views": "103",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eva Pawlowski",
                    "user_href": "/profile/Eva-Pawlowski"
                },
                {
                    "user_id": "Debajyoti Chowdhury",
                    "user_href": "/profile/Debajyoti-Chowdhury-3"
                },
                {
                    "user_id": "Raj Kumar",
                    "user_href": "/profile/Raj-Kumar-17754"
                },
                {
                    "user_id": "Pranav",
                    "user_href": "/profile/Pranav-287"
                },
                {
                    "user_id": "Nick Chang",
                    "user_href": "/profile/Nick-Chang-26"
                }
            ]
        }
    ]
}