{
    "title": "What are monuments? What are some examples of monuments? - Quora",
    "tags": [
        "Historic Preservation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean L Craft",
                "href": "/profile/Sean-L-Craft"
            },
            "answer_text": "Monuments are symbolic structures or statues that commemorate a person, place, or event. A prime example here in Richmond, VA is “Monument Avenue” which is lined with Civil War Generals and luminaries from Richmond’s Past including Arthur Ashe and Matthew Fontaine Maury. Similarly there are statues all over town of other famous people such as Bill “Bojangles”, Maggie Walker, Columbus etc. There are also places such as bridges, parks, highways, all of these are monuments of a different sort. The Washington Monument is probably the most famous here in the US. There are also monuments found in cemeteries such as statues, tombstones or temples. ",
            "date": "Answered August 18, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tiya Paul",
                    "user_href": "/profile/Tiya-Paul-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Layton",
                "href": "/profile/Jan-Layton"
            },
            "answer_text": "The definition of monument is: a statue, building or other structure to commemorate a famous or notable person or event. These are examples of monuments around the world. Lincoln Memorial - Washington, DC, USATaj Mahal - Agra, IndiaArc de Triomphe - Paris, FranceGreat Pyramids of Giza - Cairo, EgyptColosseum - Rome, ItalyStatue of Liberty - New York, USAEiffel Tower - Paris, FranceMount Rushmore - Keystone, South Dakota, USAGreat Sphinx of Giza - Cairo, EgyptKremlin - Moscow, Russia",
            "date": "Answered August 17, 2018",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "AKSHIT CHANDEL",
                    "user_href": "/profile/AKSHIT-CHANDEL-7"
                },
                {
                    "user_id": "Tiya Paul",
                    "user_href": "/profile/Tiya-Paul-8"
                }
            ]
        }
    ]
}