{
    "title": "What are the worst facts about the Black Plague? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Campbell",
                "href": "/profile/Susan-Campbell-173"
            },
            "answer_text": "What are the worst facts about the Black Plague? I thought of different answers for this question and discarded them one by one until—surprise—only one remained. I think it is the worst thing about the Plague. I know most people think of the sights, sounds, and smells of the Plague.      A dead bell or deid bell (Scots), also a 'death', 'mort', 'lych', 'passing bell' or 'skellet bell' was a form of hand bell used in Scotland and northern England in conjunction with deaths and funerals up until the 19th century. These bells and church bells rang and rang until some places passed laws prohibiting their ringing.   Note the four death bells carried by the two figures (likely children) under the bier.   All of these were terrible. No argument. I, however, think the worst, the very worst, facet of the Plague was not knowing. What was causing this? Was god angry? Will I survive until tomorrow? Are all my children going to die? Why? They had no knowledge of germs. They knew of no cures. They had no certainty in their lives.  Images from the internet. One quote from Wikipedia. ",
            "date": "Answered August 2, 2019",
            "views": "144",
            "upvotes": " View 146 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Keith",
                    "user_href": "/profile/James-Keith-66"
                },
                {
                    "user_id": "Finn Yeung",
                    "user_href": "/profile/Finn-Yeung-2"
                },
                {
                    "user_id": "Yaqub Kazem",
                    "user_href": "/profile/Yaqub-Kazem-1"
                },
                {
                    "user_id": "Zommy Gabriel",
                    "user_href": "/profile/Zommy-Gabriel"
                },
                {
                    "user_id": "Steven",
                    "user_href": "/profile/Steven-1842"
                },
                {
                    "user_id": "Gerald McCloy",
                    "user_href": "/profile/Gerald-McCloy-1"
                },
                {
                    "user_id": "Mika Isomäki",
                    "user_href": "/profile/Mika-Isomäki"
                },
                {
                    "user_id": "Lee Ginsburg",
                    "user_href": "/profile/Lee-Ginsburg"
                },
                {
                    "user_id": "Ben Waldock",
                    "user_href": "/profile/Ben-Waldock-2"
                },
                {
                    "user_id": "Brie K. Harvey",
                    "user_href": "/profile/Brie-K-Harvey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Cogswell",
                "href": "/profile/Max-Cogswell-1"
            },
            "answer_text": "It was the Christians who spread the black plague. It had appeared multiple times throughout history without ever becoming an epidemic, however before the historical black plague the Pope had signed an order for the execution of all cats because they were satanic due to the Egyptian worship of Cats. The rat population skyrocketed and the plague occured, but if ignorant religious fanatics had not been so tolerated the death of a third of Europe could have been averted. The most terrifying thing about the black plague is what inadvertently caused it and that it still exists today killing just as many people. ",
            "date": "Answered January 6, 2019",
            "views": "557",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Simon Elias",
                    "user_href": "/profile/Simon-Elias-4"
                }
            ]
        }
    ]
}