{
    "title": "What is the truth behind the death of Netaji Subhas Chandra Bose? How did he disappear? What was the political scenario at the time of his death? - Quora",
    "tags": [
        "Subhas Chandra Bose (Indian freedom fighter)",
        "Indian Independence Movement",
        "Conspiracy Theories",
        "Historical India",
        "Truth",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Puneet Bansal",
                "href": "/profile/Puneet-Bansal-195"
            },
            "answer_text": "SCB the Engima: Bose lived the life of a 007 and he disappeared like that. This is modern India’s first and the biggest conspiracy theory which is still as fresh as it was on the day of crash(whether SCB was killed in Plane Crash on 18th August 1945 or he survived)? In the consensus of scholarly opinion, Subhas Chandra Bose's death occurred in a plane crashed in Japanese-ruled Formosa. However, it has been more circumstantial rather than fact driven. Conspiracy theories appeared within hours of his death and have since become part of the folk fare .  The Crash: The chronological events of Bose’s death till ashes reaching Japan are as follows: a) On 18th August, 1945, In Taihoku, at around 2:30 PM , the plane swung wildly to the right and plummeted, crashing, breaking into two, and exploding into flames. b) Inside, the chief pilot, copilot and Lieutenant-General Tsunamasa Shidei were instantly killed.Bose's assistant Habibur Rahman passed out briefly, and Bose, although conscious and not fatally hurt, was soaked in gasoline. c) When Rahman came to senses, he and Bose attempted to leave by the rear door, but found it blocked by the luggage.They then decided to run through the flames and exit from the front. d) The ground staff, now approaching the plane, saw two people staggering towards them, one of whom had become a human torch, Bose, whose gasoline-soaked clothes had instantly ignited. e) Rahman and a few others managed to smother the flames, but also noticed that Bose's face and head appeared badly burned.Bose was rushed to Nanmon Military Hospital . e) Dr. Yoshimi began to treat Bose. Inspite of the treatment, Bose went into a coma. on Saturday 18 August 1945, Subhas Chandra Bose, aged 48 died. f) Bose was cremated in the main Taihoku crematorium two days later, 20 August 1945. On 23 August 1945, the Japanese news agency Do Trzei announced the death of Bose. g) On 7 September a Japanese officer, Lieutenant Tatsuo Hayashida, carried Bose's ashes to Tokyo, and the following morning they were handed to the president of the Tokyo Indian Independence League, Rama Murti. h)On 14 September a memorial service was held for Bose in Tokyo and a few days later the ashes were turned over to the priest of the Renkōji Temple there they have remained ever since. The story seems to be fine and normal, ins’t it? However, there were couple of things that happened during and post the crash that instigated the suspicion and hence the conspiracy theories. 1. Japan’s surrender: Japan announced the surrender in WW2 on 15th August 1945 just 3 days before the plane crash. Knowing how good Bose was as a Strategist and Military commander why would he travel to the country (Japan) which has just surrendered in the war to the Allies, Britishers being one of them. This plane crash could be a perfect cover up for Bose to go in hiding or escape to come back later on when the situation is much more conducive for him. Bose has done such a daring escape before also, from his Kolkatta house to Berlin under a perfect cover up. 2. No visual evidence: After Bose's death, Bose's other lieutenants, who were to have accompanied him to Manchuria, but were left behind on the tarmac in Saigon, never saw a body after the plane crash .There were no photographs taken of the injured or deceased Bose, neither was a death certificate issued. 3. Gumnami Baba: Gumnami baba was a sanysai who was rumored to be SCB in disguise. 24 boxes full of Gumnami Baba’s belongings have been kept at the Faizabad Treasury. They contain “round frame spectacles, Belgian typewriters, many newspapers of pre-independence and post-independence time with Baba’s comments scribbled on them, boxes full of books of international relevance, several books gifted by ‘sister’, cigars from Germany and Italy, and some huge-size family photographs.”  · Forensic evidence, recovered from Bhagwanji’s assets and handwriting – both English and Bangla – were examined by a top expert and said to be a match with that of Bose · Dr. Priyabrat Bannerjee was one of those 13 who saw Gumnami Baba on his last journey.Priyabrat Bannerjee explained the meetings with Bhagwanji and why he – and his family are convinced that Bhagwanji was indeed Netaji Subhash Bose himself. · Justice M K Mukherjee, who led the Mukherjee Commission Investigation made a remark off-the-camera, though the camera was inadvertantly recording. He said that “he is 100 per cent sure” that Bhagwanji of Faizabad was Netaji in disguise. · What creates more suspicion is the way Indian government has been handling the issue since 1945. As late as the 1970s, when while the GD Khosla Committee was at work, many files pertaining to Netaji were destroyed. Why there are so many classified files on SCB and whenever they are being asked to open, Government says that it will make the relations sour with other countries. Whats there in those files? Netaji ‘family photos’ deepen mystery about Gumnami Baba Who was Gumnami Baba, the man rumoured to be Netaji? Was he actually Kaptan Baba, the killer? 4. In Russia: There has been unconfirmed reports and citing of SCB in Russia. SCB could have been a big bargaining chip with Britishers (Till India independence and post WW2 negotiations) and so it might be possible Stalin, a shrewd mind could have kept SCB in captivity. However, the utility of SCB once the cold war started ( late 40s) was not much as USSR and Britishers were not easily going to come on negotiation table and SCB was not a threat to Britishers post their withdrwal from India. Was Netaji Subhas Chandra Bose in Russia till 1968? - The Economic Times 5. Enquiries: There were multiple enquires set up to investigate the death of SCB by Indian as well as by Foreign states. Why all of them had some issue or other, either they were inconclusive, or rejected by GOI, or classified for 50 years and was not made public, or jury was divided. It cannot be possible that if a major event like a plane crash has happened then it cannot be confirmed satisfactory until and unless the motive was to keep it hidden or wrapped with conspiracy theories · Figgess Report;1946 John Figgess was given a task to investigate Bose's death. Figgess's report, submitted on 25 July 1946, however, was confidential. In 1997, the British Government made most of the IPI files available for public viewing in the India Office Records of the British Library.However, the Figgess report was not among them. A photocopy of the Figess report was soon anonymously donated for public viewing to the British Library in the European manuscripts collection The crucial paragraph in the Figgess report is: \"As a result of a series of interrogations of individuals named in the following paragraphs it is confirmed as certain that S.C. Bose died in a Taihoku Military Hospital (Nammon Ward) sometime between 1700 hours and 2000 hours local time on the August 18, 1945\" The Figgess report confirmed four facts: The crash near Taihoku airport on 18 August 1945 of a plane on which Subhas Chandra Bose was a passenger; Bose's death in the nearby military hospital on the same day; Bose's cremation in Taihoku; and transfer of Bose's ashes to Tokyo. · Shah Nawaz Committee 1956 Government of India in 1956 appointed a three-man committee headed by Shah Nawaz Khan. Committee interviewed 67 witnesses in India, Japan, Thailand, and Vietnam. In particular, the committee interviewed all the survivors of the plane crash.The committee interviewed Dr. Yoshimi, the surgeon at the Taihoku Military Hospital who treated Bose in his last hours. It also interviewed Bose's Indian companion on the flight, Habib ur Rahman. Although there were minor discrepancies here and there in the evidence, the first two members of the committee, Khan and Maitra, concluded that Bose had died in the plane crash in Taihoku on 18 August 1945. Bose's brother, Suresh Chandra Bose, however, after having signed off on the initial conclusions, declined to sign the final report.He, moreover, wrote a dissenting note in which he claimed that the other members and staff of the Shah Nawaz Committee had deliberately withheld some crucial evidence from him, that the committee had been directed by Jawaharlal Nehru to infer death by plane crash, and that the other committee members, along with Bengal's chief minister B. C. Roy, had pressured him bluntly to sign the conclusions of their final report. · Khosla Commission 1970 In 1977, Government of India appointed a new commission to enquire into the \"disappearance\" of Bose.The single investigator was G. D. Khosla. Justice Khosla, not only concurred with the earlier reports of Figess and the Shah Nawaz Committee on the facts of Bose's death, but also evaluated the alternative explanations of Bose's disappearance and the motives of those promoting stories of Netaji sightings. · Mukherjee Commission 2005 In 1999, following a court order, the Indian government appointed retired Supreme Court judge M. K. Mukherjee to probe the death of Bose. Though oral accounts were in favour of the plane crash, the commission concluded that those accounts could not be relied upon and that there was a secret plan to ensure Bose's safe passage to the USSR with the knowledge of Japanese authorities and Habibur Rahman. The commission observed that the ashes kept at the Renkoji temple, reported to be Bose's, were of Ichiro Okura, a Japanese soldier who died of cardiac arrest. The Mukherjee Commission submitted its report to on November 8, 2005. The report was tabled in the Indian Parliament on May 17, 2006. The Indian Government rejected the findings of the commission · Japanese government report 1956, declassified September 2016 An investigative report by Japanese government titled \"Investigation on the cause of death and other matters of the late Subhas Chandra Bose\" was declassified on 1 September 2016. It concluded that Bose died in a plane crash in Taiwan on 18 August 1945. The report was completed in January 1956 and was handed over to the Indian embassy in Tokyo, but was not made public for more than 60 years. 6. Tashkent Man: The Tashkent Declaration is a peace agreement that was signed between India and Pakistan in the aftermath of the Indo-Pakistani War of 1965. On top of the peace talks already being controversial in both India and Pakistan at the time, Shastri died under mysterious circumstances a few hours after the signing of the Tashkent Declaration. However, I feel that there could be a bigger mystery which experts are trying to unfurl related to Tashkent Declaration. There is presence of an unidentified individual at the peace talks who has been dubbed the Tashkent Man. There are investigation going on whether the Tashkent Man was actually Subhas Chandra Bose.  This picture was taken on 10 January, 1966 at the Indo-Pak Peace treaty at Tashkent, Russia   A stark similarity roused the interests of many Netaji researchers, who then approached Neil Miller, a renowned forensic expert, to verify their suspicion that the Tashkent Man is in fact Netaji. Miller noted striking similarity between Bose and the Tashkent Man: 1. Shape of the head and the form of the hairline 2. Shape of the face: a round face with pronounced chubbiness in the cheek regions and a fleshy, hanging chin region 3. Eyes: both men have the exact same strabismus and the effect due to magnification factor of the spectacles appear to be the same  4. The left ear exhibits key similarities in its overall shape and the form of the lobe 5. Nose: the Tashkent Man has a slightly more sagging tip and bulbous look from certain angles - it must be noted that this is a common effect of the human aging process 6. Lips: the cupid's bow and lip-cheek fold, together with the overall shape of the mouth are virtually identical 7. The left hand After a careful study of all the pictures and videos for over a month, Miller came to the conclusion that the Tashkent Man has a very strong resemblance to Netaji Subhash Bose. The Subhas Chandra Bose Mystery 'Face-mapping shows man with Lal Bahadur Shastri at Tashkent could be Netaji Subhas Chandra Bose' - Times of India This Man Might Solve The Mystery Of Netaji's Disappearance The Bose and Shastri : My take on Tashkent Man and possibility of him being SCB does not end without linking him with the death of Lal Bahadur Shastri (or possible murder of Shastri Ji) Shastri died in Tashkent on January 11, 1966, soon after signing the Tashkent Pact with Pakistan. His death is itself a mystery. Immediately after his death, which according to official version was due to heart attack, Shastri’s family led by his wife alleged that he was poisoned because they saw that his body had turned blue. Before his death, he had called up his wife and told her that upon his return he would reveal something that would make “every Indian forget everything else”. Various accounts prove that Shastri was the only Prime Minister in India who was actually interested in unveiling the truth behind Bose’s disappearance. He was the only one in the Congress to disagree with the plane crash theory. So was it that Tashkant Man was indeed SCB which is indicated by forensic research? if that is true then is it possible that SCB disclosed his identity to Lal Bahadur Shastri which he could have told the entire nation after his return? If that is true then is it possible that all those forces which declared SCB dead in Plane crash in 1945 killed Shastri in Tashkant? If all this does not prove that SCB was the most enigmatic player of the Indian Freedom struggle then what else can prove it. He was in fact liked and revered by millions of Indians but was an eye sore for couple of people who had power and who used their power to send SCB in obscurity. ",
            "date": "Answered May 16, 2019",
            "views": "5",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarvottam Mishra",
                    "user_href": "/profile/Sarvottam-Mishra"
                },
                {
                    "user_id": "Anirudh Rai",
                    "user_href": "/profile/Anirudh-Rai-33"
                },
                {
                    "user_id": "Pritam Chowdhury",
                    "user_href": "/profile/Pritam-Chowdhury-2"
                },
                {
                    "user_id": "Molleti Thejesvinni",
                    "user_href": "/profile/Molleti-Thejesvinni"
                },
                {
                    "user_id": "Kiran Shah",
                    "user_href": "/profile/Kiran-Shah-27"
                },
                {
                    "user_id": "Tauseef Talib",
                    "user_href": "/profile/Tauseef-Talib"
                },
                {
                    "user_id": "Koushik Bhowmick",
                    "user_href": "/profile/Koushik-Bhowmick-4"
                },
                {
                    "user_id": "Jerin Benny Palathingal",
                    "user_href": "/profile/Jerin-Benny-Palathingal"
                },
                {
                    "user_id": "Manvendra Singh",
                    "user_href": "/profile/Manvendra-Singh-599"
                },
                {
                    "user_id": "Abhishek Paul",
                    "user_href": "/profile/Abhishek-Paul-126"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subhajit Mukherjee",
                "href": "/profile/Subhajit-Mukherjee-10"
            },
            "answer_text": "Netaji Subash Chandra Bose’s death is still shrouded in mystery. But the various conspiracy theories about it make it even more mysterious. While recently the news about Gumnami Baba, a revered saint of Faizabad, Uttar Pradesh, who was believed to be Bose himself, came to the fore, we never cease to imagine how the great man must have spent his last moments on earth. Here is a look back at some of the most intriguing conspiracy theories: At 2 pm on August 17, 1945, a Mitsubishi Ki-21 heavy bomber took off from Saigon airport. Inside the aircraft were 13 people, including Lt Gen Tsunamasa Shidei of the Imperial Japanese Army, Col Habibur Rahman of the Indian National Army and one man who sat in a seat a little behind the portside wing – Netaji Subhas Chandra Bose. After an overnight halt in Vietnam, on August 18, the plane arrived to refuel in Taihoku, Formosa (now Taipei, Taiwan). Moments after the flight took off again, passengers heard a loud ‘bang’. Ground crew saw the portside engine fall off, and the plane crashed. The pilots and Lt Gen Shidei were killed instantly, Col Rahman fell unconscious. Bose survived, but his gasoline-soaked clothes ignited, turning him into a human torch.  The Mitsubishi Ki-21 twin-engine heavy bomber that Netaji Subhas Chandra Bose and Col Habibur Rahman boarded at Saigon airport around 2 PM on 17 August 1945. A few hours later, in coma in a hospital, Netaji Subhas Chandra Bose passed away. This is the established account of how one of India’s most famous freedom fighters died. But is it true? “There were no official reports released by the Governments of India or Britain,” historian Leonard Gordon says, “Even members of India’s Interim Government in 1946 waffled on the matter. Bose had disappeared several times earlier in his life; so rumours began again in 1945 and a powerful myth grew.” What you will read next is a saga of secrets, political vendetta, outrageous claims, half-truths and full rumours that strive to prove that Netaji did not die on that fateful day in Taiwan. No dead body  In the immediate aftermath, an intriguing, and perhaps damning fact emerged: Netaji’s other lieutenants, who were to follow him on another flight, never saw his body. No one took photographs of Bose’s injuries, or his body, nor was a death certificate issued.  Netaji with Mahatma Gandhi.  As news reached India, senior INA officer JR Bhonsle rejected the news. Mahatma Gandhi said, “Subhas is not dead. He is still alive and biding his time somewhere.” Soon, rumours began doing the rounds that Bose was either in Soviet-held Manchuria, a prisoner of the Soviet Army, or had gone into hiding in Russia. Lakshmi Swaminathan, of the INA’s Jhansi Regiment, said in 1946 she thought Bose was in China. The Sadhu story  In the 1950s, there emerged stories that Netaji had become a sadhu. And, the most elaborate of these took shape a decade later. Some of Netaji’s old associates formed the ‘Subhasbadi Janata’, and claimed Bose was now the chief sadhu in an ashram in Shoulmari in North Bengal. Through well-crafted newspapers and magazines, the organisation was able to, quite convincingly, recreate Bose’s post-war activities. According to the ‘Subhasbadis’, Bose returned to India after the war, became a sadhu, attended Gandhi’s funeral unseen in 1948, lived in a temple in Bareilly in the late 1950s, before finally settling in Shoulmari as Srimat Saradanandaji in 1959. Other versions, too, began gathering credence. Bose remained either in Maoist China or the Soviet Union. He attended Jawaharlal Nehru’s cremation in 1964, of which there appeared to even be photographic evidence.  There were claims that Soviet leader Nikita Khrushchev told an interpreter in Delhi that the Soviet Union could produce Bose in 45 days if India so desired. The Soviet Connection and a Conspiracy After independence, Nehru took the Foreign Affairs portfolio himself and appointed Vijayalekshmi Pandit as the ambassador to Russia. After her term ended, Dr S. Radhakrishnan took her place. There are reports that Dr Saroj Das, of Calcutta University, told his friend Dr RC Muzumdar that Dr Radhakrishnan had told him that Bose was in Russia.  Hindustan Times news report, Nov 17, 1970. In another report, former Indian ambassador Dr Satyanarayana Sinha met CPI founder Abani Mukherjee’s son Georgey, who said his father and Netaji were imprisoned in adjacent cells in Siberia. In 1995, a team from Calcutta’s Asiatic Society, researching Indo-Soviet ties in Moscow, found a bunch of declassified files that hinted at Bose having been in the USSR after 1945. Dr Purobi Roy, a member of the team of scholars, said she found a document stamped “most secret”, dated 1946, in the military archives of Paddolosk, near Moscow, which mentioned Stalin and Molotov discussing Bose’s plans — whether he would remain in the USSR or leave. Dr Roy also said she found a KGB report in Bombay from 1946, which said, “it is not possible to work with Nehru or Gandhi, we have to use Subhas Bose”. This implies Bose was still alive in 1946.  This photograph allegedly shows water room-heaters behind Netaji. These heaters were in use only in the USSR at the time.  Gumnami Baba, aka ‘Bhagwanji’ Of all this, the most enduring legend is of a sadhu in Faizabad whom the locals called Gumnami Baba, who went by the name Bhagwanji. Bhagwanji, they say, was a monk who lived in Uttar Pradesh – Lucknow, Faizabad, Sitapur, Basti and Ayodhya – for more than 30 years till his death on September 16, 1985. He maintained contact with Dr Pavitra Mohan Roy, the former top Secret Service agent of the INA. However, more than his life, what Bhagwanji left behind after his death seems to confirm that the sadhu and Bose were one and the same: Gold-rimmed spectacles identical to what Netaji was always pictured wearing, powerful German binoculars, a colour photograph of Swami Vivekananda, Bengali books, the original copy of the summons issued to Suresh Chandra Bose to appear before the Khosla Commission, a map of undivided India, an album containing family photographs of Netaji Subhas Chandra Bose.  Left: Netaji’s handwriting. Right: Bhagwanji’s handwriting. Forensic expert Dr B Lal told the Mukherjee Commission that both handwritings matched.  Other items recovered included a torch pencil generally used in map-making by military personnel, newspaper clippings about Netaji’s ‘death’ probe, letters from Netaji’s followers. One of the more intriguing finds was a letter from a person who accompanied the Khosla Commission to Taiwan, which reads: “We got only 15 days in Taihoku (Taipei). Formosa’s (Taiwan) task is over… I cannot write everything in this letter, if you permit, I can come over for a week.” Photographs found among Bhagwanji’s belongings indicate he celebrated his birthday on January 23. There was no plane crash  Clipping from a Japanese newspaper, published on August 23, 1945, reporting the death of Bose and General Tsunamasa Shidei.  Netaji could not have died in a plane crash because no aviation accident occurred in Taipei on August 18, 1945. In 2005, the BBC reported that not only did the Taiwanese government reject the Bose-died-in-a-plane-crash-in-Taipei story, it also denied any plane crashes occurred between August 14 and September 20 that year. Stalin killed Netaji Most recently, the BJP’s Subramanian Swamy has alleged that Bose did not actually die in a plane crash in 1945, but was killed by Soviet dictator Josef Stalin in 1953. “According to the papers that exist with us, Bose had faked his death and escaped to Manchuria in China which was under Russian occupation, hoping Russia would look after him. But Stalin put him in a jail in Siberia. Somewhere around 1953, he hanged or suffocated Bose to death,” said Swamy, demanding that the Netaji files be declassified. However, he conceded, “Declassification of Netaji documents in haste and without judging the consequences would be difficult. India’s relations with Britain and Russia may be affected. “But I will persuade the Prime Minister to disclose the documents.” Inquiries and Commissions The Figgess Report of 1946, the first official probe into Bose’s death, said: “As a result of a series of interrogations of individuals named in the following paragraphs it is confirmed as certain that S.C. Bose died in a Taihoku Military Hospital (Nammon Ward) sometime between 1700 hours and 2000 hours local time on the August 18, 1945. The cause of death was heart failure resulting from multiple burns and shock.” In sum, the Figgess Report confirms: 1. The crash near Taihoku airport on August 18, 1945, in which Subhas Chandra Bose was a passenger2. Bose’s death in a nearby military hospital on the same day3. Bose’s cremation in Taihoku4. Transfer of Bose’s ashes to Tokyo The Shah Nawaz Committee of 1956 was India’s first inquiry, comprising three people – Member of Parliament Shah Nawaz Khan, West Bengal government-nominated ICS officer SN Maitra, and Suresh Chandra Bose, Bose’s elder brother. The committee interviewed 67 witnesses in India, Japan, Thailand and Vietnam, including the ‘survivors’ of the plane crash. Most importantly, it interviewed Colonel Habibur Rahman, Bose’s companion on the flight. Based on these testimonies, Khan and Maitra concluded Bose had died in a plane crash in Taipei. The committee’s third member, Netaji’s brother, however, disputed the report, claiming Jawaharlal Nehru orchestrated the inquiry to infer death by plane crash.  Hindustan Times news report, Jan 21, 1971. 14 years later, the Government of India sanctioned another inquiry, this time by a one-man team – the Khosla Commission of 1970. Deposing before the Khosla Commission, Dr Satyanarayan Sinha had said Colonel Habibur Rehman had confessed to him in 1946 that he lied about Bose dying in a plane crash. However, the commission chose to concur with the two preceding inquiries into Bose’s death. More than 25 years later, yet another Government of India enquiry was constituted — this time, however, by a BJP-led government. In 1999, the Mukherjee Commission, led by retired Supreme Court judge MK Mukherjee, began his exhaustive probe into the Bose mystery. In 2005, after perusing hundreds of documents, taking oral testimonies, and visits to Japan, Russia and Taiwan, the commission reported that the Japanese and the USSR made a secret plan to grant Bose safe passage into the USSR. The commission also said that the ashes kept at Renkoji Temple, believed to be Bose’s, actually were of a Japanese soldier who died of a heart attack.  ",
            "date": "Answered May 12, 2016",
            "views": "236",
            "upvotes": " View 129 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pritam Chowdhury",
                    "user_href": "/profile/Pritam-Chowdhury-2"
                },
                {
                    "user_id": "Jerin Benny Palathingal",
                    "user_href": "/profile/Jerin-Benny-Palathingal"
                },
                {
                    "user_id": "Srijan Nandan",
                    "user_href": "/profile/Srijan-Nandan-2"
                },
                {
                    "user_id": "Peehu Pal",
                    "user_href": "/profile/Peehu-Pal-2"
                },
                {
                    "user_id": "Anindya Chatterjee",
                    "user_href": "/profile/Anindya-Chatterjee-80"
                },
                {
                    "user_id": "Rubi Manimandiram",
                    "user_href": "/profile/Rubi-Manimandiram"
                },
                {
                    "user_id": "Prakash Jha",
                    "user_href": "/profile/Prakash-Jha-120"
                },
                {
                    "user_id": "GAURAV TRIPATHI",
                    "user_href": "/profile/GAURAV-TRIPATHI-249"
                },
                {
                    "user_id": "Jyoti Sahu",
                    "user_href": "/profile/Jyoti-Sahu-120"
                },
                {
                    "user_id": "Kousik",
                    "user_href": "/profile/Kousik-14"
                }
            ]
        }
    ]
}