{
    "title": "What are the benefits of organic farming? - Quora",
    "tags": [
        "Organic Food",
        "Organic Farming",
        "Farming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vignesh Vinayak",
                "href": "/profile/Vignesh-Vinayak-4"
            },
            "answer_text": "ADVANTAGES OF ORGANIC FARMING : Organic farming method uses the natural environment to enhance the productivity of an agriculture.Organic farming uses carbon based fertilizers and biological pest control and do not use synthetic fertilizers.Crop diversity can be seen in organic farming. In conventional farming mass production of one crop in one location is focused while in organic farming it is possible to grow multiple crops in the same place.Organic farming uses method like green manure and composting which replaces nutrients taken from the soil from the previous crops, organic farming relies on natural breakdown of organic matter and hence allows the production of nutrients in the soil. It improves soil fertility and feeds nutrients to the soil to feed the plant. Organic farming is one of the effective method for soil management.Organic Farming also controls other organisms with the help of methods such as biological pest control and Integrated Pest Management.Organic agriculture improves the health of people, soil and ecosystem.Organic agriculture reduces the use of non renewable energy sources by using organic fertilizes and reducing the consumption of agrochemicals.Organic farming also helps to control green house effect.Organic stops global warming and climate change and keeps environment clean.Using fertilizers and pesticides groundwater is polluted, but organic farming replaces it with organic fertilizers hence it helps to prevents water pollution.By using organic farming ecological services such as Soil forming and conditioning, waste recycling, nutrient cycling, Stabilization of soil, carbon sequestration, predation ,pollination and habitates are improved.Organic food are rich in nutritional value.Organic food are free from harmful fertilizers, herbicides and pesticides.Organic farming improves the taste and quality of food and organic agriculture are climate and ecologically friendly.",
            "date": "Answered December 29, 2017",
            "views": "272",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tanishka Sinha",
                    "user_href": "/profile/Tanishka-Sinha-1"
                },
                {
                    "user_id": "Virendermann Tanish",
                    "user_href": "/profile/Virendermann-Tanish"
                },
                {
                    "user_id": "Banamali Pradhan",
                    "user_href": "/profile/Banamali-Pradhan-11"
                },
                {
                    "user_id": "Pratiksha Andhere",
                    "user_href": "/profile/Pratiksha-Andhere"
                },
                {
                    "user_id": "Chameli Dey",
                    "user_href": "/profile/Chameli-Dey-3"
                },
                {
                    "user_id": "Paritosh Patil",
                    "user_href": "/profile/Paritosh-Patil-2"
                },
                {
                    "user_id": "Deepak Adyanthaya",
                    "user_href": "/profile/Deepak-Adyanthaya"
                },
                {
                    "user_id": "Surendra Tiwari",
                    "user_href": "/profile/Surendra-Tiwari-119"
                },
                {
                    "user_id": "Suresh Chava",
                    "user_href": "/profile/Suresh-Chava-3"
                },
                {
                    "user_id": "Ifrah Hussein",
                    "user_href": "/profile/Ifrah-Hussein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jannet William",
                "href": "/profile/Jannet-William"
            },
            "answer_text": "We’re already living on a planet that is a victim of man-made pollution. It is not only destroying the environment but also affects human health in the worst possible ways. The need of the hour is to create a sustainable living, where organic farming will act as a stepping stone towards its achievement. 1. It directly reaps the nutrients When compared to traditionally farmed and genetically engineered products, organic foods have almost 90% more nutrients. It is loaded with essential vitamins, enzymes, minerals, and other micro-nutrients. Research shows that organic foods render far better nutrients than artificial ones when tested on the same number of servings. 2. It is free from genetic alterations When products are genetically modified, they get severely contaminated, causing serious health issues. What makes organic products safe is that they are officially labeled and sourced from verified sources, thus eliminating the said risks. 3. It has a more natural taste Whenever experts are asked to conduct a quality check, one of the main steps they undertake is to taste the organic and engineered products. It has been found that organic products taste far more natural and hence better than the artificial ones. 4. It conserves biodiversity The fact that the statistics of extinct species also contain several crops is never highlighted in media and textbooks. Research shows that almost 75% of the agricultural biodiversity crops were wiped out in the last century alone. ",
            "date": "Answered March 21, 2020",
            "views": "819",
            "upvotes": "0"
        }
    ]
}