{
    "title": "What is the oldest weapon still used today by the U.S. military? - Quora",
    "tags": [
        "U.S. Army",
        "United States Armed Forces",
        "Weapons",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Combs",
                "href": "/profile/Richard-Combs-7"
            },
            "answer_text": "Hey there John, The oldest weapon in use today is the mark one human being. 3 million years of evolution has built a intelligent, curious, determined, weapon, willing to take orders in a hierarchy and follow them. This weapon is capable of questioning whether those orders are legal, and can differentiate targets from non-targets… and so on. As far as oldest style inanimate objects go the the M9 bayonet. That style weapon have been for centuries.  But style is not what you asked. THE WINNER OF THE OLDEST WEAPON IN USE TODAY (IN THE US MILITARY) IS: Browning Machine Gun, Cal. .50, M2, HB… Ma Deuce Herself.  Since 1933 this almost perfect machine has been in service. The Army found an M2 .50 caliber machine-gun still shooting perfectly after 90 years of service. In more than 90 years of existence, the receiver with serial number 324 has never been overhauled.[1]  The above is a video of US Military practice.  Warning: This is actual combat footage… some harsh language and the knowledge they are shoot at people. The WINNER OF THE 2ND LONGEST IS: THE B 52 The next longest is the B 52. It went into service in 1955, so it is 22 year younger than Ma Deuce.  Please forgive the B2 in the picture, I just think they are cool. The picture is meant to show that after 63 years the old girl is still right up there doing her job better than ever. I hope this helps Ciao. PS: The venerable Colt 1911 went in 2015. The last of the M45 1911 were replaced 9n 12 October 2015 when the United States Marine Corps Special Operations Command gave the official word that they replaced the .45 caliber M45 1911s for the 9mm Glock 19. Then the US Army decided in 2017 to use the SIG SAUER Model P320.  Colt O1070M45 Marine CQBP M45-A1 1911 Pistol  GLOCK 19 MHS 9mm semiautomatic pistol  SIG SAUER Model P320 for the US Army 01 January 2017 Footnotes[1] The Army found an M2 .50 caliber machine-gun still shooting perfectly after 90 years of service",
            "date": "Answered June 24, 2018",
            "views": "77",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Johnson",
                    "user_href": "/profile/Eric-Johnson-188"
                },
                {
                    "user_id": "Kurt Weggler",
                    "user_href": "/profile/Kurt-Weggler"
                },
                {
                    "user_id": "Rayyan Arviandri",
                    "user_href": "/profile/Rayyan-Arviandri"
                },
                {
                    "user_id": "Gra Hen",
                    "user_href": "/profile/Gra-Hen"
                },
                {
                    "user_id": "Geronimo Schmidt",
                    "user_href": "/profile/Geronimo-Schmidt"
                },
                {
                    "user_id": "Jay Morgan",
                    "user_href": "/profile/Jay-Morgan-98"
                },
                {
                    "user_id": "Rodney Grasshopper",
                    "user_href": "/profile/Rodney-Grasshopper"
                },
                {
                    "user_id": "Fredrick Heath",
                    "user_href": "/profile/Fredrick-Heath-1"
                },
                {
                    "user_id": "Christopher Sloane",
                    "user_href": "/profile/Christopher-Sloane"
                },
                {
                    "user_id": "Michael Ewart",
                    "user_href": "/profile/Michael-Ewart-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lamb",
                "href": "/profile/Greg-Lamb-7"
            },
            "answer_text": "The M1903 Springfield bolt action rifle.  It was the main service weapon for the U.S. Army Infantry starting in 1903 until it was replaced by the M1 Garand battle rifle in 1937. It was still used as a sniper rifle up through the Vietnam War.  It is currently used by the U.S. Coast Guard as a line throwing rifle.  ",
            "date": "Answered September 10, 2020",
            "views": "1099",
            "upvotes": " View 1.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joshua Fargason",
                    "user_href": "/profile/Joshua-Fargason"
                },
                {
                    "user_id": "Lee Michael Schumaker",
                    "user_href": "/profile/Lee-Michael-Schumaker"
                },
                {
                    "user_id": "Scott Mancuso",
                    "user_href": "/profile/Scott-Mancuso-2"
                },
                {
                    "user_id": "Kenneth Merchant",
                    "user_href": "/profile/Kenneth-Merchant"
                },
                {
                    "user_id": "Larry Spiller",
                    "user_href": "/profile/Larry-Spiller"
                },
                {
                    "user_id": "Wyndal Messick",
                    "user_href": "/profile/Wyndal-Messick"
                },
                {
                    "user_id": "Thomas West",
                    "user_href": "/profile/Thomas-West-64"
                },
                {
                    "user_id": "Andy Richards",
                    "user_href": "/profile/Andy-Richards-19"
                },
                {
                    "user_id": "Michael Perron",
                    "user_href": "/profile/Michael-Perron-2"
                },
                {
                    "user_id": "Daniel Kaplan",
                    "user_href": "/profile/Daniel-Kaplan"
                }
            ]
        }
    ]
}