{
    "title": "What is Dravidam? Who is meant to be a Dravidian? - Quora",
    "tags": [
        "Dravida Nadu (region in south india)",
        "Dravidian Languages",
        "Dravidian Ethnicity and People",
        "South India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mangayarkkarasi Mohan",
                "href": "/profile/Mangayarkkarasi-Mohan"
            },
            "answer_text": "There is no etymology for the word ‘’Dravidam’. It may be used by our ancestors and later on it is changed to Dravidian. Some people claim that the Dravadians originally inhabited the Northern part of India and were later pushed to the southern part of the country by the Aryans. Hence about 28% of Indians are Dravidians and reside in South India with one of the Dravadian languages as their main language, which includes, Tamil, Malayalam, Telugu, Kannada and Tulu. The Dravidian language has three subgroups, namely North Dravidian, Central Dravidian and South Dravidian. In present day India, the states of Andhra Pradesh, Karnataka, Kerala and Tamil Nadu are the significant regions with a Dravidian population, the rest 72% are Aryans, residing in North India.The difference in the origin of these languages is the reason of the different South and North Indian accents. We know very little about the Dravidian people in India, who used to reside in the country before the Aryans invaded Northern India from Iran and Southern Russia. It is believed by some linguists that the Dravidian people were well spread all across the Indian sub continent and it is because of this that the Indus Valley civilization (Harappa and Mohenjo Daro) is also referred to as a Dravidian civilization, but whether the Indus Valley civilization is Dravidian or not is still controversial. Dravidian people residing in present day Central India are tribal people known as Gond people, Kannadigaru Dravidians are from Karnataka, northern Kerala and southern Maharashtra, and northwest Tamil Nadu, Kondha Dravidians are from eastern Indian states of Andhra Pradesh and Orissa, Kodavas Dravidian people from Karnataka and northern Kerala. Then there are Kurukh, Malayali, Tamil, Telugus and Tuluvas people who belong to Dravidians in India. Dravidians were actually peace loving farmers and they were not trained in any kind of warfare. It is believed that when the Aryans invaded India, they pushed the Dravidians to the Southern part, as the Aryans were skilled fighters and came prepared with weapons and chariots. Also Dravidians, had a very sophisticated culture and used to worship all forms of life like herbs, and plants. With the coming of the Aryans, the concept of heaven and God came into existence which dramatically changed society. Not much is known about the Dravidians, so only archaeological and linguistic studies are the main source of information about them. Dravidian people have dark complexion, dark black hair and eyes and large foreheads. Because of structural similarities, it is also believed that Dravidians has an African origin. As per this anthropological and genetic data, these people migrated from Africa and reached South India via the southern route about 50,000 years ago. Because of rivers and fertile soil they stayed in India in large numbers, than other parts of world. But there are many theories and studies that explain the origin of Dravidians, their link to Africa, Aryan invasion and Dravidian’s migration to South India. But all the theories state the fact that Dravidians were a very classy and skilled race of people. ",
            "date": "Answered August 2, 2019",
            "views": "419",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gopinath R",
                    "user_href": "/profile/Gopinath-R"
                },
                {
                    "user_id": "Anand Ravindran",
                    "user_href": "/profile/Anand-Ravindran-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Ravindran",
                "href": "/profile/Anand-Ravindran-4"
            },
            "answer_text": "The dravidians were part of indus valley civilization. (say 6000 BC). They are dark skinned with big eyes, big nose and of medium height. Later People from central asia and mongolia invaded india and settled down in north part of india. The original people of india(dravidians) were moved down. The dravidians were good in mathematics, architecture, constructed well planned streets and houses, water filters, dams. They were good in astrology or vana sastram. The area below vindhiya hills in indian map till srilanka are called “dravidam”. These are the places where dravidians lived. Tamil, Telugu, Kannada, Tulu, Malayalam speakers are dravidians. After 16th, 17th centuries the Mughals invaded and they ruled deccan plateau for 800 years. They brought Urdu as official language. Along mughal emperors, their courtmen, warriors, jewellers, weavers, cook everyone came and they merged with deccan people. Thus people got thin nose, fairer skin, thin hair in some of the regions and they forget their dravidian origin. ",
            "date": "Answered August 16, 2019",
            "views": "245",
            "upvotes": " Answer requested by Neeraj C V"
        }
    ]
}