{
    "title": "What aspect of life should stay old fashioned? - Quora",
    "tags": [
        "Old Fashioned",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lepage",
                "href": "/profile/David-Lepage"
            },
            "answer_text": "Class. I get it. Times change, the old folks always complain about how things are not like they used to be. And I realize I’m slowly becoming an old folk myself. I also understand that fashion evolves, trends come and go, and that we’re all free to do pretty much whatever we please. Fine. So be it. But I still go the old-fashioned way as much as possible in how I behave in various social contexts and circles. I dress somewhat appropriately when going to a funeral or a formal event. I wear clean, casual clothes to work eventhough, being “a creative”, I could wear sandals, white sox, shorts, and a tuque. I also think it’s appropriate to hold the door for the next person behind me. Or to speak more formally to someone I don’t know or to an older person. I don’t like people being on their phone at the table. It shows, when someone has class. In a world where pretty much anything has to be allowed and tolerated, I tend to prefer the old-fashioned class, self-esteem, and respect towards other people and institutions. Just a few days ago, there was an election in my province. One person running for a neo-marxist party has been elected. And this is how she decided to dress on that important night.  She’s been congratulated by some singer who feels like this is how you dress when you receive an award.  I just don’t get it. They might be nice people. Certainly charismatic in their own way. But I don’t understand what mental process leads someone to show up dressed like that to a formal event. I know I sound like Clint Eastwood in Gran Torino. But I think having a minimum of class shows you respect yourself and the people you interact with. No top hat, no tuxedo. Just, you know, the basics. Call me old-fashioned all you want. But I think the way you dress and talk speak volume about yourself. ",
            "date": "Answered October 8, 2018",
            "views": "569",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lauren Bordeaux",
                    "user_href": "/profile/Lauren-Bordeaux"
                },
                {
                    "user_id": "Astrea Fawley",
                    "user_href": "/profile/Astrea-Fawley"
                },
                {
                    "user_id": "Chiara Torbidoni",
                    "user_href": "/profile/Chiara-Torbidoni"
                },
                {
                    "user_id": "Olga Marie Bautista",
                    "user_href": "/profile/Olga-Marie-Bautista"
                },
                {
                    "user_id": "Jordan White",
                    "user_href": "/profile/Jordan-White-265"
                },
                {
                    "user_id": "Sally Hansen",
                    "user_href": "/profile/Sally-Hansen-18"
                },
                {
                    "user_id": "Musa Muhammed",
                    "user_href": "/profile/Musa-Muhammed-6"
                },
                {
                    "user_id": "Rhea Kaur",
                    "user_href": "/profile/Rhea-Kaur-10"
                },
                {
                    "user_id": "Debasree Banerjee",
                    "user_href": "/profile/Debasree-Banerjee-15"
                },
                {
                    "user_id": "Frans du Plessis",
                    "user_href": "/profile/Frans-du-Plessis-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veshma R",
                "href": "/profile/Veshma-R"
            },
            "answer_text": "Relationships. These days it’s all about sex, sex and more sex. STOP omg. I cannot understand why it’s so necessary to get down with someone you’re dating. Call me old-fashioned, but that stuff is for when you’re married. I know what you’re thinking, but what if he/she’s the one? Nooope. Honey, the right one will not make you compromise your values, even if you find your impulses hard to control; they respect you too much. And ironically, that’s how you know you’ve really found the one.I feel like dating has become too society-driven. So much emphasis is put on going out to expensive restaurants or on trips, buying gifts for every possible occasion, and gosh, don’t even get me started on that one-month-anniversary crap…. WTH 0.o). Society makes dating seem expensive, but it honestly doesn’t need to be.*It’s also too social-media driven. Texting and snapchatting et cetera, are the norm, especially in teens and young adults. But I think this results in a lack of human connection. There’s also the possibility of falling for a person seems to be a certain way online, while in real life they act like a completely different person. All in all, dating should be about spending time with someone you love and see a potential future with. The gifts, snapchats and $$ dining are okay, but shouldn’t be what sustains the relationship. *So things like: holding handshaving picnicsgoing to a beach/rivertaking a walkplaying board gamessinging karaoke at my housecooking dinner together at his houseplaying jenga, or twisterwatching a movie at home (10x more comfortable and cheaper in my opinion)going for a drivecuddlingor even just doing nothing together……are some of the old-fashioned things I think really add value to a relationship. I admire the cute stuff, because admittedly, I am a sappy person xD Oh and I almost forgot, NO SEX. Not until rings and a certificate allow it ;) :) ",
            "date": "Answered October 11, 2018",
            "views": "72",
            "upvotes": " Answer requested by Sean Kernan"
        }
    ]
}