{
    "title": "What bad things did Mustafa Kemal Atatürk do? - Quora",
    "tags": [
        "Mustafa Kemal Atatürk (founder of the Republic of Turkey)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Göktuğ Danacı",
                "href": "/profile/Göktuğ-Danacı"
            },
            "answer_text": "Before i start, i will try to look as sideless as i can, as a Turk. I don’t want to be missunderstood, but i love and like the reforms of Kemalism and i, myself is a strong defender and supporter of Tanzimat/Gülhane Hatt-ı Hûmayun, which is first Turkish illumination as individual pashas and Ottoman memurs(civil servants) No system and no human is near perfect, no decisions can be made without flaws, and no steps can be taken without the fear of falling. For me, biggest crack in the Kemalism is minority policy. Kemal Pasha undeniably stated that theres only Turks, and there will be only Turks in the Secular Republic of Turkey. It sounds ok to a bit, right? Greek lands and many other minoritical lands were all gone, and after the bosnians, serbians, bulgarians, greeks and armenians, turks gained their indepence from the Selamet-i Osmaniye (Dynastat Osmanen). No, it was far too more than that. First, theres alot of Armenian claims after the so called genocide (this could be not sideless tho, still didn’t read about it.), after the boiling pot of east we have Greek invasion and Anatolia Minor Greeks whos mainly against them, because of decisions that made by Patriarch of Fener, numinous centre of Orthodox world. Kurds on the other hand barehandedly feeded by the Brits, saying them that great civilization of Mesopotamians will rise again in the name of Zoroaster and Xerves. The policy that normal leaders would follow would be; Feed the Patriarch to stop or decrase amount of invasions, tell Armenians that the government who had killed and genocided the eastern anatolia was overthroned, and newly founded Meclisi Umumi can’t help for now, and say that Kurds and Turks are both Sunni nation and they should work under the banner of islam against the kuffar, not under the banner of kuffar and against the islam. Pragmatist leaders would go for those options, but no. We declared islamic decline, Turkic superiority and undeniably derision of minorities. Still, thats the only crack i can found inside the Kemalism, even if its nearly 100 years old, we can’t say its outdated and weapon of true terror. And i believe that neo kemalist policy that current CHP (first party in Turkey, founded by Ataturk itself.) following will going to end and kill the unnecesarry Turkish pragmatism. I don’t want to say anything bad to Ataturk, considiring that hes from the early 20th century, he was the least racist people in his time. And comparing him to the other leaders of Europe and far right eras, he was more porgressive than pragmatist. ",
            "date": "Answered April 27, 2018",
            "views": "64",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kufi Seydali",
                    "user_href": "/profile/Kufi-Seydali"
                },
                {
                    "user_id": "Nobody Perfect",
                    "user_href": "/profile/Nobody-Perfect-6"
                },
                {
                    "user_id": "Jerome Sassani",
                    "user_href": "/profile/Jerome-Sassani"
                },
                {
                    "user_id": "FuturDeGris",
                    "user_href": "/profile/FuturDeGris"
                },
                {
                    "user_id": "Marat Petrosyan",
                    "user_href": "/profile/Marat-Petrosyan"
                },
                {
                    "user_id": "Tugrul Kaya",
                    "user_href": "/profile/Tugrul-Kaya"
                },
                {
                    "user_id": "DaZZle",
                    "user_href": "/profile/DaZZle-17"
                },
                {
                    "user_id": "Khan Ubaid-ur-Rehman",
                    "user_href": "/profile/Khan-Ubaid-ur-Rehman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehmet Uluğ",
                "href": "/profile/Mehmet-Uluğ"
            },
            "answer_text": "I wouldn't necessarily say “bad” but Atatürk had a reputation of believing in outrageously mishappen versions of history. Even though we can credit him with the creation of the ministry of history, which taught the Turks of their past, of which they had no real knowledge before, he himself subscribed to theories such as the “Sun language theory” which postulated that Ancient Anatolian civilisations such as the Hittites were..Turkish. it does sound outrageous, and received much criticism from his contemporaries, some of whom became disillusioned with propagating a proper version of Turkish history as it begins with the onset of Turkic tribes in Asia. In hindsight I believe this was done with the best intentions, but it was simply spreading untrue versions of Turkish History which were scrapped a few years after his death. Today, almost no one speaks of the Sun language theory any more in Turkey, but our enemies use this blunder to attack Turkish nationalism as an ideology founded on pseudo science that claimed all languages descended from Turkish. Obviously they're not, and yes he was wrong. ",
            "date": "Answered August 15, 2019",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nobody Perfect",
                    "user_href": "/profile/Nobody-Perfect-6"
                },
                {
                    "user_id": "Jerome Sassani",
                    "user_href": "/profile/Jerome-Sassani"
                },
                {
                    "user_id": "Moses Alaca",
                    "user_href": "/profile/Moses-Alaca"
                }
            ]
        }
    ]
}