{
    "title": "What is the greatest discovery of the early man? - Quora",
    "tags": [
        "Prehistoric Humans",
        "Discoveries",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Germano Feijó",
                "href": "/profile/Germano-Feijó"
            },
            "answer_text": "I have little doubt of what it is: agriculture. Sure fire was a great revolution for hunter-gatherers, but it is not the great beginning for the human era on Earth. Agriculture is what made modern life possible in essence. Back to 12000 years ago, some people around Middle East were the first to be able to produce its own food. This revolution changed their society in crucial ways: Dedicate land areas just for “edible” callories-rich grains was sure more productive than collecting sparse fruits and roots in the wilderness. It allowed a boost in human population, changing the shape of society and creating more complex relations. As farmers became a thing and there were a lot of extra hands, there could be specialization in the people’s functions and now it was possible to organize and coordinate the efforts since the supply of food was soon centralized by the leader(s), making the lead for stratification. They were now able to accomplish things like buildings for stocking the production, further improvements on the farm, houses, religious sites and other structures. People estabilished complex interactions in cooperation, exchanges, deals etc as they fulfilled new and different functions. The hunter-gatherers groups therefore became more organized tribes and later civilizations.Having a (mostly) fixed home settled around farms allowed these new group of humans to accumulate belongings, goods, and all sorts of pieces of technology. Formerly, they had to move from time to time for new resources (most of the groups) which made carrying a load of tools and constructions impossible.This revolution made possible a new flux of innovations and ideas: the husbandry and domestication of all modern cattle and pets (except dogs), the formation of soldiers and wars, the money, the origin of religion, writing and all the very basis of modern life. Developing all these new outcomes would be impossible without the cooperation and organized structure of agricultural societies. We may think that rasing plants is obvious and stupid. But we actually took thousands of years before this was a thing. We have been eating them in the wild for quite a time before agriculture. It’s important to note that the food we harvest today is not even close in look to their wild counterparts, lacking significant production rate, size and resistance. They probably took some generations to improve the croppings. Maintaining a farm was no easy task and farmers actually worked MORE than hunter-gatherers. They also became more unhealthy due to lack of nutrient variety; and aglomeration spread diseases and attracted rats. So, why they kept on this path? Some authors think this was a trap: they thought that a more reliable and efficient source of food would be better and as soon as population grew it was no more possible to go back to hunter-gathering, creating a vicious cycle of more work. What really triggered all this process is not very clear, though. Sources: Guns, Germs and Steel - Jared Diamond Sapiens - Yuval Noah Harari An Edible History of Humanity - Tom Standage ",
            "date": "Answered June 25, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shamas Khanewal",
                "href": "/profile/Shamas-Khanewal"
            },
            "answer_text": "If your question is not about what important discoveries scientists have made about early humans but is really about the important discoveries made by our early human ancestors then there is probably more than one answer. People will have different opinions on the matter. Some could argue that the fashioning and use of tools was one of the most important discoveries.  With tools early hominids killed large game, fashioned other tools, made dwellings previously not possible. Evidence for tool use is much older than any other technology. The earliest stone tool-making developed by at least 2.6 million years ago. The Early Stone Age began with the most basic stone implements made by early humans. The use and then making of fire is also a hallmark discovery or invention by our hominid ancestors.  Evidence for the use of fire by Homo erectus by about 400,000 years ago has wide scholarly support. Claims for the earliest definitive evidence of control of fire by a member of Homo range from 0.2 to 1.7 million years ago. There is an argument to made that the invention and use of language is another important landmark in hominid evolution. Language makes it possible to not only cooperate and plan events including hunting strategies but it is vital in transmitting knowledge to successive generations. The parents verbally communicate the skills required for survival. Verbal communication led to written language whether in the form of art or words.  In a time of lockdowns, its a great topic to discuss - the merits of different early human inventions. ",
            "date": "Answered April 23, 2020",
            "views": "835",
            "upvotes": "0"
        }
    ]
}