{
    "title": "What is the first and foremost thing you will do if you become rich overnight? - Quora",
    "tags": [
        "Becoming Rich",
        "Becoming a Millionaire",
        "Hypothetical Personal Situations",
        "Wealthy People and Families",
        "Wealth",
        "Wanting and Making Money",
        "Hypothetical Scenarios",
        "Money",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anubhav",
                "href": "/profile/Anubhav-87"
            },
            "answer_text": "I like to learn new stuff and do experiments. That is why I seek solitude. In peace, I am able to go deep into topics, which gives me high. For this, if someday I became rich, by God’s grace, I want to have a small Isle villa.  This shall not only ensure peace and solitude, but also offer magnificent views as well as moderate climate for peek performance.  With some more grace of God, I want to build a small community of innovative people, who should have developed a wider perspective about their life, and are open minded for collaboration.  It will be great to hangout with them and engage in some group activity, to maintain the balance between learning and leisure.  However, there will a challenge of logistics, since every necessary item needs to shipped in containerized fashion which can escalate cost of living, if not streamlined.  That is why, to make the Island self sustainable, I have to dedicate a small part of Isle for resort purposes and open it for rich people. This will add some revenue, as well giving unique opportunity of hanging with new and influential people.  Have a Glimpse of these Money related Answers : Anubhav's answer to What do you love the most about making money? Anubhav's answer to What is Dan Bilzerian's job? ",
            "date": "Updated October 9, 2020",
            "views": "108",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Nicky Mathur",
                    "user_href": "/profile/Nicky-Mathur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Srivastava",
                "href": "/profile/Aman-Srivastava-678"
            },
            "answer_text": "Most people would say that they will buy expensive items. Personally, If I were to get a huge sum of money, I'd save it. I'm young and have no exact use of it. I'm in a college, what am I going to do with a big house and an expensive car? Even if I bought both of them, I'll just be losing money. The maintenance costs go sky high. In the future, I would buy a house which not big. However, just perfect enough for a family. I would buy a family SUV instead of a sports car. Spending every penny on expensive items will just be a waste of time. I would invest it in my future, in my family's future. It will feel good to have infinite money but it will be even better, to see my children and the love of my life, happy. I have used the word ‘would',more times than I can count. Forgive me for that. ",
            "date": "Answered May 11, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter "
        }
    ]
}