{
    "title": "What is the number one cause of death for teenagers? - Quora",
    "tags": [
        "Causes of Death",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikhil Arya",
                "href": "/profile/Nikhil-Arya-22"
            },
            "answer_text": "One straight answer “Suicide”. Suicide is the biggest reason for the death of teenagers in India and around the world. Classical sociologist Durkheim in his Le suicide, 1897 defines suicide as ‘ Suicide as any case of death, caused by directly or indirectly, positive or negative action of the victim, which he knows will produce this result'. According to him, suicide is a social phenomenon and not an individual phenomenon. We believe that suicide in teenagers occurs because of stress, hormonal disturbances, hereditary factors, etc. But Durkheim concludes in his study that there is a higher tendency of committing suicide who are less integrated into society. With the increasing pressure of schools, colleges, competitive exams on students, these students mostly get detached from society and are more likely to commit suicide. To understand why this occurs Durkheim explains egoistic suicide. Egoistic suicide is a suicide that occurs from the low integration of individuals in society. Social bonds gets weak and the individual feels alienated and feel they are not part of society. Which results in suicide from failure and depression. This can be understood in an example like COVID-19 or war. People are more likely to commit suicide in this situation because they are dealing with separation from family, friends and loved ones. With the pressure of studies, there is also overregulation forced upon these innocent children by their parents, schools or colleges who wants them to succeed in this highly competitive environment.re To understand this Durkheim talks about fatalistic suicide. Fatalistic suicide occurs when there is excessive control of society or parents over an individual. This results in Oppression of individual leading to his suffocation and powerlessness. Acc to Durkheim ‘Persons with futures, pitilessly blocked and passions, violently choked by oppressive discipline' are more likely to commit suicide. So, the real problem in society which leads to suicide is a problem of low integration and over-regulation. ",
            "date": "Updated September 25, 2020",
            "views": "179",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kalpana Devi",
                    "user_href": "/profile/Kalpana-Devi-3-1"
                },
                {
                    "user_id": "David William Hayhurst",
                    "user_href": "/profile/David-William-Hayhurst"
                },
                {
                    "user_id": "Kevin Koch-Klein",
                    "user_href": "/profile/Kevin-Koch-Klein"
                },
                {
                    "user_id": "Anindita Bera",
                    "user_href": "/profile/Anindita-Bera-7"
                },
                {
                    "user_id": "Donna Land",
                    "user_href": "/profile/Donna-Land"
                },
                {
                    "user_id": "Chiyoko Beasley",
                    "user_href": "/profile/Chiyoko-Beasley"
                },
                {
                    "user_id": "Natalye Jackson",
                    "user_href": "/profile/Natalye-Jackson-1"
                },
                {
                    "user_id": "Isabella Gaines",
                    "user_href": "/profile/Isabella-Gaines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "In the US: The leading causes of death for the teenage population remained constant throughout the period 1999-2006: Accidents (unintentional injuries) (48 percent of deaths), homicide (13 percent), suicide (11 percent), cancer (6 percent), and heart disease (3 percent). Motor vehicle accident accounted for almost three quarters (73 percent) of all deaths from unintentional injury. Suicide is a relatively high cause of death, but teens are not the ones who commit suicide the most commonly.  But older people die of all sorts of other things, so it seems like teen suicide is more common than it is. ",
            "date": "Answered June 12, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}