{
    "title": "What does the Bible say about King Cyrus? - Quora",
    "tags": [
        "Cyrus of Persia (historical figure)",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Connor J. McClurg",
                "href": "/profile/Connor-J-McClurg"
            },
            "answer_text": "It says this in the Book of Isaiah, chapter 45, verses 1–7: “Cyrus is my anointed king. I take hold of his right hand.I give him the power to bring nations under his control.I help him strip kings of their power to go to war against him.I break city gates open so he can go through them. I say to him,2 ‘I will march out ahead of you. I will make the mountains level.I will break down bronze gates. I will cut through their heavy iron bars.3 I will give you treasures that are hidden away. I will give you riches that are stored up in secret places.Then you will know that I am the Lord. I am the God of Israel. I am sending for you by name.4 Cyrus, I am sending for you by name. I am doing it for the good of the family of Jacob. They are my servant.I am doing it for Israel. They are my chosen people.You do not know anything about me. But I am giving you a title of honor.5 I am the Lord. There is no other Lord. I am the one and only God.You do not know anything about me. But I will make you strong.6 Then people will know there is no God but me. Everyone from where the sun rises in the east to where it sets in the west will know it.I am the Lord. There is no other Lord.7 I cause light to shine. I also create darkness. I bring good times. I also create hard times. I do all these things. I am the Lord. ",
            "date": "Answered September 21, 2020",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Lee",
                    "user_href": "/profile/Steve-Lee-169"
                },
                {
                    "user_id": "Joseph Bolton",
                    "user_href": "/profile/Joseph-Bolton-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Ferguson",
                "href": "/profile/Terry-Ferguson-51"
            },
            "answer_text": "Cyrsu led the remnant of the Southern KIngdom of Judah back to bebuild Jerusalem,after their captivity in Babylon.Only a remnant,returned.CYrus also,rebuild`s end times jerUSAelm.Or restores.i`m not sure if this is the actural man,or an end time person,with the spirit of Cyrsu,or a descendant of Cyrus.BUT,Cyrus restores,God`s true people.Not the fake jews. ",
            "date": "Answered September 21, 2020",
            "views": "27",
            "upvotes": "0"
        }
    ]
}