{
    "title": "What are some animals that are native to Europe that were brought to the Americas hundreds of years ago? - Quora",
    "tags": [
        "The Americas",
        "Prehistory",
        "History of Europe",
        "Evolutionary Biology",
        "Zoology",
        "Europe",
        "Animals",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anik Sig",
                "href": "/profile/Anik-Sig"
            },
            "answer_text": "The exchange of products, species, and people between Europe, the Americas, Africa, and Asia during the start and end of the colonial period is called The Columbian Exchange   (There are some errors to these diagrams however: indigenous Americans already had their own variety of honeybees they depended on, and they also fail to mention the transfer of syphilis from the Americas to the Old World) The basic gist of the Columbian exchange was that the Old World introduced their model of agriculture—dominated by use of heavy livestock animals such as horses and bovines while depending on mass harvests of a single crop at a time—while the Americas introduced a vast array of new products that made Old World diets and lifestyles far easier, more nutritious, better tasting (spices tend to do that!) and helped to usher in industrialisation. For the longest time, Spain dominated Europe in terms of wealth, especially given their huge hold over the Americas and their lucrative position in the slave trade (a position that later became more prominent with the English and the Portuguese, particularly in Brazil). Acapulco was one of the busiest ports of its time and bridged the trade between the Americas, Asia, Europe, and Africa:   It helped that Acapulco is so close to Taxco, which to this day is still a major producer of silver. Veracruz and Tampico were also significant ports of exit and entry. It was from these ports where Mexico received anything and everything (from silk, Asian spices, rubber, enslaved Africans, Japanese samurai, Indian princesses, exotic new plants and flowers such as bougainvilleas and roses, horses, and even fashions) and then redistributed them across the Americas. See also: introduced species ",
            "date": "Answered September 21, 2019",
            "views": "561",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ash Christie",
                    "user_href": "/profile/Ash-Christie-1"
                },
                {
                    "user_id": "Anthony Middleton",
                    "user_href": "/profile/Anthony-Middleton-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Uhrich",
                "href": "/profile/Clarence-Uhrich"
            },
            "answer_text": "Pigs and horses, etc. Horses, donkeys, mules, pigs, cattle, sheep, goats, chickens, large dogs, cats and bees were rapidly adopted by native peoples for transport, food, and other uses. One of the first European exports to the Americas, the horse, changed the lives of many Native American tribes. Columbian exchange - Wikipedia for more see the above link The new contact between the global population circulated a wide variety of crops and livestock, which supported increases in population in both hemispheres, although diseases initially caused precipitous declines in the numbers of indigenous peoples of the Americas. Traders returned to Europe with maize, potatoes, and tomatoes, which became very important crops in Europe by the 18th century. It all began with Christopher Columbus, hence the name. Primarily from the late 15th Century onward. ",
            "date": "Answered September 21, 2019",
            "views": "109",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angela Boyd",
                    "user_href": "/profile/Angela-Boyd-4"
                },
                {
                    "user_id": "Anthony Middleton",
                    "user_href": "/profile/Anthony-Middleton-12"
                }
            ]
        }
    ]
}