{
    "title": "What role did women play in the French Revolution? - Quora",
    "tags": [
        "French Revolution",
        "History of France",
        "Revolution",
        "History of Europe",
        "Feminism",
        "France",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tiny Malone",
                "href": "/profile/Tiny-Malone-1"
            },
            "answer_text": "Women, just like the Sans-culottes or the peasantry or the bourgeoisie played a significant role in bringing about the French Revolution. Their participation in a number of uprisings prior to 1789 and even after the revolution had taken place are considered significant aspects of the popular participation of the French Revolution. However, it was the ‘March to Versailles’ to get the king to sign the ‘The Declaration of the Rights of the Man’ that is considered to be the most significant event that marked the culmination of the revolution. At the same time, women were participating in the revolution indirectly by promoting and propagating modern ideas through societies, journals, pamphlets etc. Hence, it can be seen that women did in fact have a significant role to play during the French Revolution. Before we go on to analyse the role that they played in this uprising it would be important to understand the role of the women in the French society prior to 1789. Women had no political rights in pre-Revolutionary France; they couldn’t vote or hold any political office just like many other people. However, according to some scholars, as far as the dignity of the women was concerned it was trampled upon much more than that of a common man. They were considered to be “passive” citizens, who should remain at home and rely on men to decide what was best for them. It was believed that men alone were capable of governing and that this was a quality that women could not imbibe. In fact, a woman’s education often consisted of learning to be a good wife and mother; as a result women were not supposed to be involved in the political sphere, as the limit of their influence was the raising of future citizens. In addition to this degrading attitude towards women, which extended to cover the so-called elitist women as well, there were economic and social problems as well that essentially affected the common man. Thus, all women may not have had the same grievances or demands during the time of the revolution. For instance, women belonging to the sans-culottes or peasantry suffered from problems of rising prices, low wages, unemployment, food shortage and other such conditions that often resulted in an extremely miserable existence. It was these women, who revolted during the revolutionary period when the economic crisis had become intertwined with the political crisis with the hope that a change in the regime would lead to them having a better existence. Hence, while women belonging to the more elitist or well-to-do sections of society were more concerned about their democratic aspirations and securing political rights and some degree of equality vis-à-vis men, the women belonging to the sans-culottes were more concerned about battling their day-to-day problems, which naturally got precedence over political rights. This had become evident when the list of grievances was being prepared for the Estates-General. Women belonging to the sans-culottes had demanded greater control over prices; working women wanted equal pay for equal work; and in particular checking the phenomenon of black marketing and hoarding, which always led to a rise in prices. Thus, it can be seen that their demands were economic in nature. It was the upper class women, who had political grievances. However, a change was coming about in the role of the women towards the fag end of the 18th century. In those days the rural artisans and peasants were paid very little, with most of the surplus being appropriated by the middleman or the capitalist. It is for this reason that these people began to migrate to towns and cities and started factories in the periphery. A large number of girls and older women were sent to these factories to earn a living. Even married women were taking up jobs in the garment factories as glove makers, lace workers, seamstress etc for the objective of supplementing their family income. The bourgeoisie women, on the other hand, were also engaged in professions like teaching, writing, social activism besides being employed in their family business. The fact that women had started taking up jobs had helped in fostering a spirit of independence and confidence among them. Olwen Hofton has claimed that such women had an equal role in the household setup on account of their contribution to the family income. It was these women, who had economic grievances, who played a more direct role in the revolution. The participation of such women can be seen in the general and more ‘popular’ movements that took place during this period. Their role and behavior in this regard was similar to that of the men as were their grievances and demands. This included participation in the fall of Bastile, march to Versailles, which resulted in the Declaration of Rights being signed; the Municipal revolution, the twillers incident and the various soap and bread riots that had taken place to protest against the high prices. Hofton has argued that “it was working class women who raised their voices against the rising prices of bread as they were finding it extremely difficult to maintain their families”. This was the period when the ideas of the enlightenment seem to have been gaining in popularity during this period. It had created an environment, wherein ideas of liberty and equality seem to have found great support among the women as they could see in these ideas a means of escaping their dependent and downtrodden condition. However, one must not over emphasise the role of such ideas as already seen above such ideas may not have had an equal impact on all sections of women. The impact of such ideas was mostly confined to the elitist women and had not found currency among the women of the lower classes. It was this aristocratic and upper Bourgeoisie women, who were members of clubs or salons run from their homes. Prominent among such women were Madame Geoffin, Madame d’Epinay, Madame Lespinasse, Madame Roland etc. These women were deeply influenced by the works of the Philosphes and wrote a number of journals, pamphlets etc , which helped in spreading such ideas among other people. Hoften believes that these upper class women were greatly influenced by the intellectual milieu created by the Enlightenment and themselves contributed to the revolution intellectually through their articles, pamphlets etc Prominent among such feminists were Eha Palm and Olympe de Gouges. Palm had supported the idea of political equality of women along with men. This not only included the right to vote or stand for public office but also the equal right to inheritance, education and suppression of dowry. Olympe had written a number of fiery articles in which she demanded total equality for women in the social and political sphere and for this she believed that women should be included within the Republic of France. Her article “Rights of Woman and Child” (1791) demanded universal suffrage for both men and women. She claims that women symbolized virtue, beauty and tenderness and it is these characteristics that should be taken into account while admitting the women into the public sphere as equals. Joan Scott, has, however, argued that de Gouges talks of universality but focuses only on issues and problems that confronted her class of women. It was post-1791 that there was a rise in militant feminist activism. The most radical militant feminist activism was practiced by the Society of Revolutionary Republican Women, which was founded by Léon and her colleague, Claire Lacombe on May 10, 1793. The goal of the club was “to deliberate on the means of frustrating the projects of the enemies of the Republic.” Up to 180 women attended the meetings of the Society. Of special interest to the Society was “combating hoarding [of grain and other staples] and inflation.” Similarly, in 1793, women were at the fore of a crowd that demanded bread and a new constitution. When their cries went unnoticed, the women went on a rampage, “sacking shops, seizing grain and kidnapping officials.” Despite the role played by the women in not only promoting a revolutionary spirit but also actively participating in assisting the Bourgeoisie to consolidate their political gains, it would be wrong to think that the women were able to gain significantly from their participation in this event. While largely left out of the thrust for increasing rights of citizens, as the question was left indeterminate in the Declaration of the Rights of Man, activists such as Pauline Léon and Théroigne de Méricourt agitated for full citizenship for women. Women were, nonetheless, denied political rights of active citizenship and democratic citizenship. Joan Scott argued that the term “Universal” in the declaration of rights was a misnomer as it recognized the rights of only certain groups in society, mostly the upper class white men. In fact, she had blamed de Gouges and certain other intellectual women for perpetuating the myth that women were not capable of participation in the political affairs of the country. The fact that these intellectuals argued that women alone possessed features such as parental and family love, courage during child birth and superior beauty tended to undermine the attempt to take part in “universal” citizenship. Moreover, other equal rights were also denied to the women. For instance, Pauline Léon, in 1792, submitted a petition signed by 319 women to the National Assembly requesting permission to form a garde national in order to defend Paris in case of military invasion. Léon requested permission be granted to women to arm themselves with pikes, pistols, sabers and rifles, as well as the privilege of drilling under the French Guards. Her request was denied. Later in 1792, Théroigne de Méricourt made a call for the creation of “legions of amazons” in order to protect the revolution. As part of her call, she claimed that the right to bear arm would transform women into citizens. However, this right was once again denied to them. Although, women decided to take matters into their own hands by resorting to militant means, it had provoked serious repressive measures from the government. Most of these outwardly activist women were punished for their actions. The kind of punishment received during the Revolution included public denouncement, arrest, execution, or exile. Théroigne de Méricourt was arrested, publicly flogged and then spent the rest of her life sentenced to an insane asylum. Pauline Léon and Claire Lacombe were arrested, later released, and continued to receive ridicule and abuse for their activism. Many of the women of the Revolution were even publicly executed for “conspiring against the unity and the indivisibility of the Republic”. In fact, from 1793 onwards, women were banned from forming their political clubs. In fact, the Jacobin regime has been seen as being highly regressive and backwards and an obstacle in the promotion of feminism in France. Their regime is said to have prevented the women from leaping across the existing social and political barriers of inequality between the sexes. In May 1795, the National Convention banned the women from “attending political assemblies” urging them to withdraw to their homes and ordering the arrest of those who would gather together in groups of more than five. The lines between public men participating in civic life and domesticated women caring for family and children alone was drawn more firmly by the Jacobins than it had ever been drawn before. ",
            "date": "Answered March 15, 2018",
            "views": "46",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamal Khan",
                    "user_href": "/profile/Jamal-Khan-456"
                },
                {
                    "user_id": "Ravinsh Yudhuvanshi",
                    "user_href": "/profile/Ravinsh-Yudhuvanshi"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "James Laws",
                    "user_href": "/profile/James-Laws-12"
                },
                {
                    "user_id": "Monika Yadav",
                    "user_href": "/profile/Monika-Yadav-215"
                },
                {
                    "user_id": "Tech Geek TV",
                    "user_href": "/profile/Tech-Geek-TV"
                },
                {
                    "user_id": "Clarice Braun",
                    "user_href": "/profile/Clarice-Braun"
                },
                {
                    "user_id": "Etienne Mourez",
                    "user_href": "/profile/Etienne-Mourez"
                },
                {
                    "user_id": "Marie Bou",
                    "user_href": "/profile/Marie-Bou"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ardian Pllana",
                "href": "/profile/Ardian-Pllana-3"
            },
            "answer_text": "(for clarity and a more broad understanding I’ll use the gregorian calendar for all events) Despite the major changes in society that occur in 1792 through the inauguration of the First Republic, women are pretty much left aside from all the evolution of citizenship at the beginning. They are never mentionned in the Declaration of the Rights of the Man and of the Citizen of 1789The ideal woman, even for the male philosophers of the Révolution, is the mother that will bring young bright future “sans-culottes” citizens into the world.They are also seen as guardians of “morality” and “virtue” that were the premises of the Révolution.But they didn’t go down without a fight and had a considerable role to play in the events of the Révolution, especially through organising the political struggle. They were generally the tenants of clubs and “Salons”, where politicians and masterminds of the Révolution debated and elaborated the concepts of the soon-to-be First Republic. For example : Robespierre was a regular of Manon Roland’s litterary club/salon before the entire conflict between the Montagnards and the Girondins (where she was a very respected and influential figure). So influential in fact that through her grip on Girondins activities, she managed to push Jean-Marie Roland de La Platière on the forefront of the Révolution as a leader, and that was quite a common thing for other salon littéraire owners.They took up arms and constituted sometimes even half of the participants in the street riots that occured in the 1780s, notably in the revolts of the Sarthe of April and even in the Day of the Tiles 7th of June 1788, the start of the Révolution.Women are very often credited through multiple sources of local authorities and even deputies of starting the marches, the riots and the protests. So much so that a law was instituted to limit the public reunion of women to a minimum of 5 individuals.On the 5th of October 1789, a group of revolutionnaries constituted of nearly only women march towards Versailles to bring the king Louis XVI and his wife Marie-Antoinette to Paris by force so they could be judged there. It is a very known and symbolic event. The women that take part in the Révolution, especially through direct action generally have the same set of characteristics : They are Parisian. This is also true for the men, most of the action occurs in Paris, as most of the centers of power and authority were established in the capital.They are part of the lowest spheres of society, mostly worker class. This of course doesn’t concern the salons owners, litterary figures and such that were often times from the bourgeoisie or even aristocracy.They are generally over 30, when a women of this time was on average more independent. (basically when she is done raising children)Despite their importance in the struggles of the Révolution, their will to change society and their implication in most of the riots, the women are quickly evicted from all assemblies. But that didn’t stop them from : Massively attending the public assemblies or every other major public event, screaming and scanding against injustice towards them and the poorest spheres of the sans-culotterie. They were pejoratively nicknamed : “the tricoteuses” (knitting woman) because men jokingly implied that they came and stayed for so long to have an entertaining spot to proceed to knit. It is probably true that the poorest of the female attendees did in fact knit, and this phenomenon probably led to those particular women popularizing the very symbolic “bonnet phrygien” among all the public.Form women-exclusive clubs to debate the new laws and reforms and especially read them or even teach to read them to the poorest of the women who were members, lead activism towards full equaliity for divorce, the armament of women, and so on. The Société des républicaines révolutionnaires was such a club (led by the very influential and known Pauline Léon who read a petition signed by over 300 Parisians for equal rights and Claire Lacombe, a precursor of feminism). Sadly, all female-only clubs were banned on the 30th of October 1793.Debate and protest against every law that excluded them from the newly born citizenship. For example wearing the famous tricolor cocarde that was a symbol of citizenship publicly, which was harshly reprimanded.All of this also paved the way for incredibly influential female writers, thinkers and political theorists that still have a major role in today’s political feminism such as : Olympe De Gouges, who wrote the Declaration of the Rights of Woman and of the Female Citizen in 1791 opposidely to the Declaration of the Rights of the Man and of the Citizen of 1789, that excluded women. Today considered as a precursor of feminism, she was guillotined for her ideas of true equality and the fair treatment of women in 1793 during the Terreur.Mary Wollstonecraft, although not French, was hugely inspired and influenced by the events of the Révolution and even the writings of De Gouges, and like her, taught herself to write and speak in several languages including french. She is mostly known for her answers to Edmund Burke, a major critic of the Révolution and notably it’s impact on women, through her pamphlet A Vindication of the Rights of Men, in a Letter to the Right Honourable Edmund Burke; Occasioned by His Reflections on the Revolution in France.",
            "date": "Answered May 15, 2018",
            "views": "21",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shreya",
                    "user_href": "/profile/Shreya-978"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Srijana Pal",
                    "user_href": "/profile/Srijana-Pal"
                },
                {
                    "user_id": "Bikesh Singh",
                    "user_href": "/profile/Bikesh-Singh-43"
                },
                {
                    "user_id": "Rahul Mishra",
                    "user_href": "/profile/Rahul-Mishra-1670"
                },
                {
                    "user_id": "Ayush Khirwar",
                    "user_href": "/profile/Ayush-Khirwar"
                },
                {
                    "user_id": "Shubhanshu Pal",
                    "user_href": "/profile/Shubhanshu-Pal-5"
                },
                {
                    "user_id": "Laura Toscane",
                    "user_href": "/profile/Laura-Toscane"
                },
                {
                    "user_id": "Fun With Anushka",
                    "user_href": "/profile/Fun-With-Anushka-1"
                },
                {
                    "user_id": "Harriet Eenmaa",
                    "user_href": "/profile/Harriet-Eenmaa-1"
                },
                {
                    "user_id": "Maria Taratina",
                    "user_href": "/profile/Maria-Taratina"
                },
                {
                    "user_id": "Samad Khan",
                    "user_href": "/profile/Samad-Khan-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpita Singh",
                "href": "/profile/Arpita-Singh-869"
            },
            "answer_text": "Role of women in the French Revolution: The most notable demand of women during the French revolution was the \"right to vote\" and equal wages.In order to discuss and raise voice for their demands, they started many \"political clubs\" and \"newspapers\", among which “the society of revolutionary” and “Republican women were famous.”One of the most notable French Revolutionary women was Olympe de Gouges.She daringly exposed the opposition of women community towards the Jacobin government which was denying the vote right to women folks of France. She also expressed her criticism for closing down of the women's club. Thank you Arpita ~ ",
            "date": "Answered September 16, 2020",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohamed Boubendir",
                "href": "/profile/Mohamed-Boubendir"
            },
            "answer_text": "There a few notable women from the French Revolution. I should mention that, in general, women did not gain much from it, as most revolutionary leaders viewed women as mere distractions from men’s socio-political goals. They drew heavily upon the many mistresses of past French kings as examples, particularly Louis XV. Olympe de Gouges is probably the most well-known woman of the revolution. A dedicated writer, she spent much of her energies fighting for women’s rights. She famously wrote the Declaration of the Rights of Woman and of the Woman Citizen, mirroring the Declaration of the Rights of Man (which has nothing to do with “men”). She gained some traction, particularly outside of France, and her efforts were noticed by British and American women. She aligned herself politically with the moderate group known as the Girondins, who, like her, came from wealthier backgrounds. Unfortunately, she stayed on the wrong side, and when the Girondins fell from power, de Gouges was sent to the guillotine. She also spoke against slavery and advocated giving the people more power.  1748–1793 Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex? Charlotte Corday is another important figure. She is known for assassinating revolutionary politician, writer, and intellectual Jean-Paul Marat in the bathtub. She was apprehended by the police and guillotined. During her trial, she showed absolutely no remorse or regret for what she had done.  1768–1793 I killed one man to save a hundred thousand. Next we have Jeanne-Manon Roland de la Platière, known as Madame Roland. A woman of exceptional intelligence and energy, she was very well-versed in Plutarch and the Classics, as well as Voltaire and other Enlightenment writers. She was less involved socially, and preferred to work within the government and all the revolutionary events. Through her marriage to Jean de la Platière, she gained access to many political figures, and was temporarily active in the Jacobin Club, where she met Robespierre, who she grew to dislike. She preferred the Girondins, developing a close relationship with politicians and writers Brissot, Condorcet, and Buzot (with whom she might have had an affair with). Wielding great influence over her husband, she guided him politically, as he was the minister of the interior. Alas, we know by now the fate of the Girondins! Hunted down by the Jacobins, she was thrown into jail, awaiting execution. She wrote her memoirs while imprisoned. At the age of 39, Madame Roland was guillotined. When her husband learned of this, he committed suicide. Buzot also committed suicide to avoid capture. More about her very interesting memoirs is here.  1754–1793 At the guillotine: O Liberty, what crimes are committed in your name! Germaine de Staël, or Madame de Staël, is another point of interest. Unlike the others, she wasn’t guillotined. Daughter of the enormously wealthy Swiss banker and Royal finance minister Jacques Necker, she was a writer and salonnière. She was married to the Swedish ambassador to France at the age of twenty. It was certainly not for love, and they essentially lived independently of each other. She had an affair with the Comte of Narbonne since 1789, who went on to become the minister of Louis XVI and a leader of Revolutionary France, only to be torn down in 1792, fleeing to England with her help. She soon joined him in England, though she returned to France when English upper-class found her morals and character ill-fitting. Personally, she could very well have been inclined towards the Jacobins, but their radicalism was too great, and she wished for reconciliation with the Girondins. She barely escaped the violence of the Revolution, having witnessed the storming of the Tuileries (as did the young Napoleon), and leaving Paris right before the September Massacres. Madame de Staël wrote a few romantic novels, such as Delphine and Corinna. She also penned the Considerations on the principle events of the French Revolution.  1766–1819 Love is the emblem of eternity; it confounds all notion of time; effaces all memory of a beginning, all fear of an end. Aside from these particular personages, the roles of women were various. The women’s march to Versailles in 1789 is a significant event, as many women marched from Paris to the Royal Palace, forcing the King and Queen to relocate to the former, where they could be better watched. I would like to mention other women of influence, most of which were in some way related to the Royal family and Marie-Antoinette. Madame Élisabeth, the sister of Louis XVI was guillotined in 1794. Another, Princesse Lamballe, a close friend of Marie-Antoinette, suffered a worse fate in 1792. She was murdered by a mob during the September Massacres, her head stuck on a pike, and her heart eaten. A regular woman’s life was not much improved by the events of the revolution. They were still expected to be subordinate, tending to the home and the children. This was only reinforced by Napoleon’s Civil Code, further restricting women’s liberties. During the days of the Monarchy, aristocratic and wealthy women had great influence in politics and society, managing salons, and intellectual debates. However, this accounted for a small percentage of the population. Nevertheless, women played an important role during the revolution, and their various ideologies can be considered as significant milestones in the history of society. ",
            "date": "Updated July 5, 2019",
            "views": "28",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravinsh Yudhuvanshi",
                    "user_href": "/profile/Ravinsh-Yudhuvanshi"
                },
                {
                    "user_id": "Jenny Kim",
                    "user_href": "/profile/Jenny-Kim-257"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Ozan Simitçiler",
                    "user_href": "/profile/Ozan-Simitçiler"
                },
                {
                    "user_id": "Ozgur Zeren",
                    "user_href": "/profile/Ozgur-Zeren"
                },
                {
                    "user_id": "Tom Clemans",
                    "user_href": "/profile/Tom-Clemans"
                },
                {
                    "user_id": "Matthew Nghiem",
                    "user_href": "/profile/Matthew-Nghiem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noah Wiener",
                "href": "/profile/Noah-Wiener-1"
            },
            "answer_text": "Not all that much at all. The French Revolution really wasn't very revolutionary when it came to gender roles. In fact, one prominent Montagnards politician characterized the role of the wife as intrinsically that of the homemaker, taking care of the children while her radical husband was off protesting. Probably the best chance women had for any real advancement in the Revolution was the Revolutionary Women’s association, led by Olympe de Gouges, one of the first outspoken feminists in history. De Gouge in 1791 published the “Declaration of the Rights of Women and the Female Citizen”, a clear riffing on the Declaration of the Rights of Man, where she demanded full gender equality for women.  de Gouges Unfortunately for the cause of gender equality in France, de Gouges was in the wrong faction. She was a Girondin, a moderate Republican, and opposed the more radical elements of the Revolution. She supported that Louis XVI be exiled, not executed. The last straw came in 1793 when she published a demand that a referendum be called as to whether France would be a monarchy or a Republic(to be fair, this demand was totally unworkable). She and her associates were arrested and purged as part of the Reign of Terror. With them died any chance that the French Revolution would see advancement for women- and, indeed, it eventually saw a rollback of the rights of women, when Napoleon in his Napoleonic Code declared a woman fundamentally subordinate to her husband, and abolished divorce. ",
            "date": "Answered September 30, 2018",
            "views": "54",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sterling Carpenter",
                    "user_href": "/profile/Sterling-Carpenter-1"
                },
                {
                    "user_id": "Michael Criswell",
                    "user_href": "/profile/Michael-Criswell-7"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Mohamed Boubendir",
                    "user_href": "/profile/Mohamed-Boubendir"
                },
                {
                    "user_id": "Frank Pellett",
                    "user_href": "/profile/Frank-Pellett"
                },
                {
                    "user_id": "Daniela Romero",
                    "user_href": "/profile/Daniela-Romero-9"
                },
                {
                    "user_id": "Andrew SaVann",
                    "user_href": "/profile/Andrew-SaVann-1"
                },
                {
                    "user_id": "Armaan Genomal",
                    "user_href": "/profile/Armaan-Genomal"
                },
                {
                    "user_id": "Lucas Precoda",
                    "user_href": "/profile/Lucas-Precoda"
                },
                {
                    "user_id": "Ariel Safdie",
                    "user_href": "/profile/Ariel-Safdie"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Vi",
                "href": "/profile/James-Vi-1"
            },
            "answer_text": "Women were among those that sieged the Bastille, and tore down its stones. Women served on the frontiers of revolutionary France as Cantinieres to the army. Indeed, women were involved in the printing explosion of newspapers during the revolution, and the other key aspects that allowed the nation to overturn its feudal past. Olympe De Gouges in 1791 published the ‘Declaration on the Rights of Women,’ where she set forward a clear vision, and explanation about why the rights of equality, fraternity, and liberty meant nothing, if they did not apply to women, as well as men. Yes, her message was largely ignored in the National Assembly, but her example represents one of the many women who made a huge difference in the revolution. Remember that it was a march of women (mostly from the fish market) who marched on Versailles and forced the king to return with them to Paris. One of the hot spots for the revolutionaries and their ideas in the early days was in Madame Roland’s salon, for which she would later pay-for by facing the guillotine because of her close ties to the Girondins. It was the women in the court, that stopped the cruel, and absurd prosecution of Marie Antoinette when the prosecutors tried to accuse her of incest. The female figure was in large part the symbol of the revolution, if you consider that Goddess of Reason, that was elevated in churches across France, including in Notre Dame. Let there be no mistake, women were key stakeholders in the revolution. ",
            "date": "Answered December 7, 2018",
            "views": "446",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sébastien JULLIEN",
                "href": "/profile/Sébastien-JULLIEN"
            },
            "answer_text": "Not very much. They always had a role subservient to men and the French Revolution was little interested in women’s rights. Feminist mythology is keen to quote the “Declaration of the Rights of Women” by Olympes de Gouges but at the time it was a marginal figure and nobody cared. Actually the French Revolution abolished voting rights for the few women who had them (abbesses, i.e. heads of nunneries, and a few noble women because they were heads of their families) for it was believed female voting rights were obviously “absurd”. Women were seldom interested in political rights and asked for more practical things such as more midwives and the right to divorce. Even the march of women on Versailles the 5th of October 1789 was inspired by practical motives: it was believed the lack of bread in Paris was caused by the political deadlock on the Declaration of the Rights of Men (the years of the French Revolution were fertile in conspiracy theories and people often attributed economic difficulties to reactionaries conspiracies). ",
            "date": "Answered August 10, 2020",
            "views": "171",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andras Boros-Kazai",
                    "user_href": "/profile/Andras-Boros-Kazai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kira Binkley",
                "href": "/profile/Kira-Binkley-1"
            },
            "answer_text": "Until I re-read “Macbeth” (Shakespeare) yesterday, my knowledge of women in the French Revolution was limited to Madame Defarge, from “A Tale of Two Cities”. But when I read Lady Macbeth’s assessment of her husband’s character, “Ambition he has, but lacks the illness attends it”, I realize that probably a great deal of the horror and terror of the French Revolution were due to the influence of women. Macbeth himself had said something to the effect that the deed itself were one thing, perhaps doable, but the consequences that came “tramelled” with it, brought hesitation. Women, it seems, have less ability to foresee consequences, and probably less desire to maintain loyalty to a great leader. ",
            "date": "Answered August 10, 2020",
            "views": "148",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rudraksh TheBeast",
                    "user_href": "/profile/Rudraksh-TheBeast"
                },
                {
                    "user_id": "Lakshmi Venkateswara Bonthu",
                    "user_href": "/profile/Lakshmi-Venkateswara-Bonthu"
                },
                {
                    "user_id": "Lauren Bowie",
                    "user_href": "/profile/Lauren-Bowie-7"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Kiran Dwivedi",
                    "user_href": "/profile/Kiran-Dwivedi-25"
                },
                {
                    "user_id": "Minakshi Rajput",
                    "user_href": "/profile/Minakshi-Rajput-12"
                },
                {
                    "user_id": "Reena Sikarwar",
                    "user_href": "/profile/Reena-Sikarwar"
                },
                {
                    "user_id": "Neeru Sehgal",
                    "user_href": "/profile/Neeru-Sehgal-3"
                },
                {
                    "user_id": "Filza Zarin",
                    "user_href": "/profile/Filza-Zarin"
                },
                {
                    "user_id": "Jaishree Kesharwani",
                    "user_href": "/profile/Jaishree-Kesharwani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Radhika Sarkar",
                "href": "/profile/Radhika-Sarkar-11"
            },
            "answer_text": ">> During the revolutionary years' women were active participants: >> In order to discuss and voice their interests they started their own political clubs and newspapers. >> About 60 women's clubs emerged in different French cities, the most famous being the Society of Revolutionary and Republic Women. >> They wanted to enjoy the same rights as men i.e., right to vote, to be elected to the Assembly and to hold political office. >> Women's struggle for equal political rights during the late 19th and 20th centuries. Finally, in 1946, French women won the right to vote. ",
            "date": "Answered May 5, 2020",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicolas Rey-Coquais",
                "href": "/profile/Nicolas-Rey-Coquais"
            },
            "answer_text": " « À Versailles, à Versailles » An icon of the active participation of women during the French Revolution. The industrial revolution requiring more and more women to be sent to the factories and the rise of the bourgeoisie would force women to take a stand on the social change happening. I don’t think the French Revolution could have happened without broad support from women. Women are described as conservative, I don’t know if this is true, but it would seem difficult to bring about any change in society without their consent. ",
            "date": "Answered September 9, 2020",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roger H Werner",
                "href": "/profile/Roger-H-Werner"
            },
            "answer_text": "I think you need to specify which revolution (there were only two actual revolutions of which I’m aware (1789, 1848). Lots of changes in governments including constitutions but they didn’t led to outright revolutions. ",
            "date": "Answered April 26, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andras Boros-Kazai",
                    "user_href": "/profile/Andras-Boros-Kazai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Saintonge",
                "href": "/profile/Stephen-Saintonge"
            },
            "answer_text": "That varied from woman to woman. They weren’t soldiers, govt. employees, legislators, or voters, but they influenced the men who were. Some were much more active than others, politically. You really want to read some books on the social history of France in that period to get a better understanding of what people were doing. ",
            "date": "Answered April 27, 2018",
            "views": "885",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priyanka Singh",
                "href": "/profile/Priyanka-Singh-2739"
            },
            "answer_text": "The woman play a important role for French people right,but woman didn't get equal rights as compared tomen such as right to vote . But when men go for the war then woman do all the work. ",
            "date": "Answered April 19, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Dan Cloete",
                    "user_href": "/profile/Dan-Cloete"
                },
                {
                    "user_id": "Kiran Dwivedi",
                    "user_href": "/profile/Kiran-Dwivedi-25"
                },
                {
                    "user_id": "Saba Farheen",
                    "user_href": "/profile/Saba-Farheen-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernest Reaville",
                "href": "/profile/Ernest-Reaville"
            },
            "answer_text": "Surely you mean `what was the role of Women in the French Revolution ´ They did in fact participate in every way because they hoped, and firmly believed, that by doing so they would further the emancipation of Women, be able to vote and be counted as equal to men in French life. To learn more read some French history of the Revolution and its after effects. ",
            "date": "Answered July 15, 2018",
            "views": "728",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zo Muana",
                    "user_href": "/profile/Zo-Muana-2"
                },
                {
                    "user_id": "Sagar Kumar",
                    "user_href": "/profile/Sagar-Kumar-1760"
                },
                {
                    "user_id": "Kiran Dwivedi",
                    "user_href": "/profile/Kiran-Dwivedi-25"
                },
                {
                    "user_id": "Rishabh Bajpai",
                    "user_href": "/profile/Rishabh-Bajpai-51"
                }
            ]
        }
    ]
}