{
    "title": "What started World War II? - Quora",
    "tags": [
        "World Wars",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Moses Anderson",
                "href": "/profile/Moses-Anderson-9"
            },
            "answer_text": "Among the causes of World War II were Italian fascism in the 1920s, Japanese militarism and invasions of China in the 1930s, and especially the political takeover in 1933 of Germany by Hitler and his Nazi Party and its aggressive foreign policy. The immediate cause was Britain and France declaring war on Germany after it invaded Poland in September 1939. Problems arose in Weimar Germany that experienced strong currents of revanchism after the Treaty of Versailles that concluded its defeat in World War I in 1918. Dissatisfactions of treaty provisions included the demilitarization of the Rhineland, the prohibition of unification with Austria (including the Sudetenland) and the loss of German-speaking territories such as Danzig and Eupen-Malmedy despite Wilson's Fourteen Points, the limitations on the Reichswehr making it a token military force, the war-guilt clause, and last but not least the heavy tribute that Germany had to pay in the form of war reparations, which became an unbearable burden after the Great Depression. The most serious internal cause in Germany was the instability of the political system, as large sectors of politically active Germans rejected the legitimacy of the Weimar Republic. The stage was then set for the Danzig crisis to become the immediate trigger of the war in Europe started on 1 September 1939. Following the Fall of France in June 1940, the Vichy regime signed an armistice, which tempted the Empire of Japan to join the Axis powers and invade French Indochina to improve their military situation in their war with China. This provoked the then neutral United States to respond with an embargo. The Japanese leadership, whose goal was Japanese domination of the Asia-Pacific, thought they had no option but to pre-emptively strike at the US Pacific fleet, which they did by attacking Pearl Harbor on 7 December 1941. ",
            "date": "Answered May 19, 2017",
            "views": "668",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Boroughs",
                    "user_href": "/profile/Justin-Boroughs"
                },
                {
                    "user_id": "Barry Weir",
                    "user_href": "/profile/Barry-Weir-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Mitchell",
                "href": "/profile/Robert-Mitchell-547"
            },
            "answer_text": "World War II a global struggle between democratic freedom and facist oppression, fueled by the mistakes of the previous generation, which ended up looking like this:  The causes of the war are myriad and complex. WW1 ended in 1918 with the defeat of Germany by the Entente (Britain, France, Russia) and their American allies. The war had been horrific, and both sides had suffered staggering loses- loses which would only be dwarfes by those of WW2. The victorious powers forced Germany and her allies to take the blame for the war, and made Germany pay in every meaning of the word. 1919 saw the signing of the Treaty of Versailles, which stripped Germany of much of her industrial and economic capabilities by returning Alsace-Lorriane to French control, giving large swathes of Eastern Germany to Poland, and leaving Germany with a massive debt to the Entente- a debt which Germany would find difficult to pay with the loss of so much of their land and people to the Treaty and the war. Although conditions improved for Germany in the '20s under Stresseman and his Dawes Plan, which secured billions in US loans, the 1929 Wall Street crash and resulting depression left Germany in more trouble than ever- unemployment skyrocketed as the economy collapsed. This climate propelled the growth in size and popularity of the Nazi party under a certain Adolf Hitler, who took power as Chancellor in 1933. The Nazis introduced sweeping social and economic reforms, which seemingly caused a miracle- unemployment fell rapidly as the economy grew quickly. But the so-called miracle was mostly a sham, a propaganda lie created by the Nazis by ignoring large unemployed tracts of society and doctoring economic statistics. Much of Germany was angry- perhaps so- at the Entente and the Treaty of Versailles, which had left their country broken after the Great War. It was this resentment of other European powers which allowed Hitler to take power, and which fueled the desire to strengthen and expand Germany, through war if necessary. In direct violation of the Treaty of Versailles, the Nazis began to rearm Germany, with a fearsome new army- the Wehrmacht- and a technologically advanced air force- the Luftwaffe- along with the new principle of warfare. Germany also fostered alliances with Facist Italy, who the Nazis had taken inspiration from for their ideology, and Franco's facists in Spain, as well as signing the Nazi-Soviet pact with the communist USSR. The new power which Germany held alarmed the former Entente powers, but who were still weak from the war. In 1938, Germany crossed another line laid out by the Treaty- they annexed Austria, in an act called Anchluss. The Nazis, facing relatively little opposition in this, saw that they could continue to defy the Treaty and the protests of other European powers- and they did. In 1939, PM Chamberlain flee to Munich to hold talks with Hitler. The Nazis wanted to annex the Sudetenland, a region of Czechoslovakia which had a large German population, against the wishes of the Czech government- the Sudetenland was well defended, meaning that it would be difficult for the Wehrmach to take it by force- and was home to a large portion of Czechoslovakia's industry. In a policy of appeasement, Chamberlain agreed to let Germany annex the Sudetenland, despite the protests of the Czech government. The Germans took the Sudetenland, and, soon after, the rest of Czechoslovakia. Now, the Germans turned to their next target- Poland.  Meanwhile, on the other side of the world, the Japanese Empire had been fighting a long war of expansion in China and the Pacific; the Japanese were at war with China and the Soviet Union, seeking more territory and Rae materials to fuel their industries and war machine. Despite early victories, the Japanese advance slowed and eventually stopped, held by the Chinese and Soviet forces. In response to threating Japanese aggression, the USA announced its' trade treaty with Japan, and began trade embargoes of various resources on the Japanese. At the same time the United States, the United Kingdom, and the Netherlands engaged in secret discussions for the joint defence of their territories, in the event of a Japanese attack against any of them.  On 1st September 1939, Germany invaded Poland after running false flag operations against their own radio stations, despite warnings from the British and French, who were allied with Poland, and who declared war on Germany as a direct result of the invasion. The Polish fought bravely, but in vain, and the Nazi army swept away resistance in the fact of their furious Blitzkrieg advance, claiming complete victory by October. The Soviets began an invasion of East Poland in agreement with the Nazis in September as well. Hitlee offered France and Britain piece which was swiftly rejected. In the Spring of 1940, Germany invaded Denmark and Norway. Striking swiftly against the French, the Nazis attacked France through Belgium and Holland, forcing British forces to evacuate from the continent at Dunkirk in June 1941, arguably one of the most famous troop manoeuvres in history. Italy invaded France on 10th June, and France had fallen by the end of the month. The Battle of Britain, pitting the Luftwaffe against the RAF in a German attempt to invade Britain, began in July, but failed, largely in thanks to the RAF's radar technology. After this, Britain, under Winston Churchill's strong leadership, began to fight in North Africa and the Mediterranean.  In June 1941, Germany and her allies began Operation Barbarossa, invading the Soviet Union in a long and bloody campaign. Stalin was shocked and in denial over the Nazi betrayal of the Nazi-Soviet pact, and over next few years the Axis forces made massive gains, reaching Russia's capital Moscow and almost succeeding in taking the city as the Soviets destroyed everything as they fell back, using scorched earth tactics. However, the campaign was perhaps doomed to failure- the German forces were ill-equiped for a winter war, with insufficient men and limited oil. The Germans broke themselves on Stalingrad and were pushed back by the endless tide of the Red Army, who were adept at fighting in the freezing cold.  In response to the US embargoes, and believing that a sudden strike would allow a victory in the Pacific, the Japanese Navy attacked the US fleet at Pearl Harbor on 7th December, killing thousands and severely wounding the US fleet. The Empire also began invasions of various Pacific states over the next few months, including Burma, the Phillipines, and attempting to invade Australia. But unfortunately for the Japanese, despite their early victories the US entered the war against them with a fury, fighting them at sea and on land and forcing back Imperial soldiers across the Pacific in the face of heavy fighting. Although Japan and Germany were allied, there was no need for Germany to declare war on the US in 1941- yet they did, and dragged the Americans into the European war which, until recently, the Germans had been winning.  In short, the Treaty of Versailles caused awful economic despair in Germany post WW1, resulting in a rise of support for fascists and right wing politicians, most predominant of whom was Hitler. German disgruntlement and anger at the other European powers after the Fiest World War led to German invasions expansion into Austria and Czechoslovakia, and eventually the invasion of Poland which would begin WW2, with France, Britain, and many commonwealth nations declaring war against Germany. The later Nazi invasion of the Soviet Union would cause the USSR to enter the war, whilst Japan's empire building and the Pearl Harbor attack pulled the USA into the war against both Japan and Germany. ",
            "date": "Answered June 30, 2019",
            "views": "483",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Byron Todd",
                    "user_href": "/profile/Byron-Todd-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristoffer Barks",
                "href": "/profile/Kristoffer-Barks-1"
            },
            "answer_text": "OH BOY! The lead up to WW2 is, in my opinion, more interesting than the war itself. LET’S DIVE RIGHT IN! The first event in the lead up to WWII was the end of WWI. Ironic, I know. The Treaty of Versailles The Treaty of Versailles wasn’t made to be fair. It was made with the set interest of vengeance towards the Central Powers, particularly Germany. The French, who had suffered heavily in the fighting, were on a vengeful path and wanted the treaty to completely crush German spirits. Versailles and the other treaties ending the 1st World War treated the Central Powers as if they had all been fully occupied and utterly crushed despite the fact most of the fighting had happened within Entente territory. Many future Axis powers would come out of this treaty. The Bulgarian Situation The history of Bulgaria in the early 20th century has been difficult to see. After seeing Greece and Serbia annex much of the Macedonian lands promised to Bulgaria, they invaded only to be attacked by Romania and the Ottoman Empire shrinking further. Their defeat in WW1 saw them lose West Thrace to Greece and what little of Macedonia they had to Yugoslavia. Many of these territories were ethnically Bulgarian.  So it wasn’t a surprise that Bulgaria would ally with the country who was the biggest threat to Serbia, now Yugoslavia, and Greece, Italy. As Italy began to expand into the Balkans, Bulgaria saw the opportunity to profit from some of the territory that Italy didn’t want. The Hungarian Situation The 1st World War saw Austria-Hungary completely dissolved. Hungary, the second half of the namesake, in particular saw not only its non-Hungarian lands taken but even regions that had majority Hungarian populations given off to be ruled by the Czechs and Romanians.  This left many Hungarians finding themselves across the border from the country that beard their name. Hungary felt abandoned by the Entente. So when Germany approached them promising them their old lands, Hungary quickly aligned itself with the Axis. The Italian Situation In the Kingdom of Italy, the circumstances were quite different. The Italians had won the war but during peace talks were horrified to find that they had been stabbed in the back by the Entente. Before Italy joined WW1, the Central Powers and Entente tried to sway them to their respective sides with promises of territorial gain. Eventually, they sided with the Entente after they were promised Tyrol, Istria, and the Dalmatian Coast.  However, during Versailles, they were treated as a minor despite heavy casualties and watched much of the territory promised to them given to the Serbs instead.  The Italians were left very bitter about this especially since the territory they didn’t get was given to Serbia which had capitulated pretty early on in the war and, in their eyes, hadn’t earned it. We’ll get more into Italy later on. The Japanese Situation Japan, like Italy, also joined the Entente during WW1. However, they got what they wanted out of it, annexing many German colonies in China and Oceania. However, now that the Japanese plans for expansion into German territory were fulfilled, their eyes shifted towards their old allies, towards British Malaysia, French Indochina, the American Philippines, and China. Japan went on to expand into China by invading Manchuria establishing a puppet state. China would later collapse into civil war. They left the League of Nations after it condemned them for their actions in Manchuria.  Relations soured further between Japan and the Entente as Britain refused to renew their alliance with the Japanese out of fear of war with the U.S. They would go on to renounce several naval treaties agreeing to keep their navy small. Essentially, Japanese interests for expansion were their main reason for allying with the Germans as further expansion required wars with the Allied powers. The German Situation Finally, and most importantly, Germany. They lost 13% of their territory including, like in Hungary, land that was majority German. Even Denmark which hadn’t even entered the war was given Northern Schleswig.  On top of this, the Rhineland, Germany’s main industrial area, was made a demilitarized zone and the army was downsized to only 100,000 men. They were forced to pay war reparations of $300 Billion. And the icing on the cake, they had to take full responsibility for a war that they hadn’t even started. The Germans, a historically militaristic people, were left in a nation that was on a path to destruction. Hundreds of thousands of soldiers were now unemployed, Germany was in extreme debt, and inflation sky rocketed. Germany had to take out loans from the U.S. to continue to pay off their debts. And when the Great Depression came to America, they demanded all their loans be payed off. Germany eventually suffered TWO GREAT DEPRESSIONS, and when they couldn’t pay off their debts, the industry in the Rhineland was invaded by Belgium and France. Many Germans incorrectly believed that the war could have still been won if Germany hadn’t been betrayed by the new Democratic Government. Soon, political popularity shifted towards either the Far-Left or Far-Right. Popularity for Communism, however, faded after a failed Communist Revolution in Bavaria. Italy’s Descent into Fascism In Italy, discontent led to the March on Rome. Here, Benito Mussolini and his new Fascist party sieged Rome. The situation was only pacified when King Victor Emmanuel III made Mussolini Prime Minister transferring power to a new Fascist government. Mussolini was very popular among the Italians with his promises of great territorial expansion into Africa and the Balkans and the idea of a revived Roman Empire that would bring Italy greatness once more. Italy’s first major venture in expansion was an invasion of Ethiopia. They had gone to war with Ethiopia once before and embarrassingly lost. Victory in the 2nd Italo-Abyssian War boosted popular approval of Fascist Italy and discredited the League of Nations as a peace-keeping force as they stood idle despite Ethiopian pleas for assistance.  Germany’s Descent into Fascism All the misery and hatred in Germany allowed for a little party known as the National Socialist German Workers' Party, or Nazi Party, with its rhetoric pushing the blame of Germany’s failure to minorities and its talk about making Germany great once more to gain popularity. Eventually, the leader of the Nazi Party, one Adolf Hitler, ran for president of the Wiemar Republic being beaten only be decorated war hero Paul Von Hindenburg. However, Hindenburg was convinced to make Hitler chancellor essentially using him as a puppet to keep Nazi supporters happy while giving him no actual power. What could possibly go wrong!? I’ll tell you what. Hindenburg died. And who was next in line to be in charge of the country? Hint: It starts with an H and with an itler. Over time, the Nazi party used its popularity to consolidate power, purge opposition, indoctrinate the populace, and remove “undesirables” such as Jews, alcoholics, homeless, and unemployed. As well, Germany began to improve relations with the Soviet Union extending diplomatic relations and agreeing to non-aggression pacts. The new German Reich worked to improve their economy doing it pretty quickly. They got to show their economic revival during the 1936 Olympics hosted by Germany where they gained a great propaganda victory not only for Germany but for Fascism as a whole. Germany Looks Outward On March 7th, the military was ordered to enter the Rhineland Demilitarized Zone under orders to immediately retreat if France and Britain responded militarily. Instead, they stood down, issuing minor diplomatic objections. Germans troops entered the Rhine to cheering German crowds. The German military machine began roaring back to life. The size of the army was enlarged heavily and Germany began actively developing an air-force and navy. Germany began setting up diplomatic relations and cementing alliances with foreign nations. They began with the Anti-Comintern Pact in 1936 in which they and Japan agreed to declare war on the Soviet Union if either nation was attacked. Italy joined on November 6th of the following year. Spain’s Descent into Fascism On the 17th of July, 1936, a failed Spanish coup led to the Spanish Civil War between the Nationalists and Republicans. The Nationalist side gained great support from Germany, Italy and Portugal. The Republican side saw only major support from the Soviet Union and minor assistance from Mexico as France and Britain decided to stay neutral. By 1939, the Fascist Nationalist side was victorious and Francisco Franco became dictator of Spain. Japan Looks Outward On July 7th, 1937, the Japanese staged a false-flag incident on the Marco Polo Bridge blaming it on the Chinese and demanding massive territorial concessions. On August 13th, Japan declared war starting the 2nd Sino-Japanese War seeing huge victories. Like with Ethiopia, the League of Nations was content in its neutrality. Appeasement On May 28th, 1937, Neville Chamberlain was elected Prime Minister of Britain beginning a policy of appeasement towards Germany. Germany began its first major act of expansion during the Anschluss of Austria. On March 13th, 1938, Germany invaded Austria and staged a vote in which a suspicious 99.9% of the populace voted to be annexed by Germany. Maybe it had to do with the ballet;   In July, the U.S. and Britain stopped accepting Jewish refugees. On October 5th, Jews were reissued passports with the letter “J” on them after Sweden and Switzerland requested an easier way of denying Jews into their countries. On September 27, U.S. President Franklin D. Roosevelt sent a letter to Hitler seeking peace. Germany expanded further on September 30th. The Germans demanded that Czechoslovakia cede the Sudetenland territory which had a German majority population seeking autonomy. The “Sudeten Crisis” was resolved when Britain, France, Italy, and Germany signed the Munich Agreement giving the Sudetenland to Germany in exchange for the end of German expansion. Czechoslovakia was not invited to attend.  Shortly after, Poland demanded the territory of Zaolzie which Czechoslovakia ceded. On November 2nd, the First Vienna Award signed by Germany, Italy, Hungary, and Czechoslovakia ceded Southern Slovakia and Carpathia to Hungary. This cemented Hungary’s allegiance to Germany.  On March 15th of 1939, Germany invalidated the Munich Agreement by invading Czechoslovakia. The Czechs showed little resistance as most of their defensive positions had been built in the Sudetenland.  They created the protectorates of Bohemia and Moravia and created the state of Slovakia under a puppet Regime led by Josef Tiso. On March 20th, German Foreign Minister Joachim von Ribbentrop delivered an oral ultimatum to Lithuania demanding they cede the former German territory of Memel. Facing invasion from East Prussia, Lithuania yielded to German demands. The next day, Germany demanded the return of the Free City of Danzig. Two days later, Germany signed a treaty of Development of Economic Relations with Romania bringing the two closer.  On the 31st, France and Britain had had enough and guaranteed the independence of Poland. However, on April 18th, they rejected a proposition of a tripartite alliance with the Soviet Union. On April 7th, Italy invaded Albania. In 5 days, Albania was annexed into a personal union between the Italian and Albanian crowns.  On May 17th, Sweden, Norway, and Denmark refused German offers for non-aggression pacts. Sweden, however, continued cooperating heavily with the Germans trading with them and allowing the flow of troops from occupied Denmark and Norway into Finland during the war. On May 22nd, the Pact of Steel officially formed an alliance between Germany and Italy.  On August 23rd, Germany surprised the world by signing an alliance with the Soviet Union. The Molotov-Ribbentrop Pact agreed that the Soviet Union would not intervene against Germany in any future wars. A secret addendum agreed to the separation of German and Soviet spheres of influence. The Soviet sphere included Finland, Estonia, Latvia , Bessarabia, and Eastern Poland while the German sphere included Lithuania and Western Poland. The treaty gave Germany the ability to wage war in Europe without fear of Soviet intervention.  Finally, on August 30th, Germany sent an ultimatum to Poland over the Polish Corridor and Danzig the territories giving Poland access to the sea. 2 days later, with no answer, Germany invaded Poland plunging the world into war. And so we enter the war with an immediate advantage for the Axis powers allowing for the occupation of most of continental Europe. Europe 1939  Timeline of WW2 Kristoffer Barks's answer to What is the timeline of WW2? ",
            "date": "Updated September 19, 2018",
            "views": "112",
            "upvotes": " View 62 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lewis Craig",
                    "user_href": "/profile/Lewis-Craig-10"
                },
                {
                    "user_id": "Angadiparambil Gurudas",
                    "user_href": "/profile/Angadiparambil-Gurudas"
                },
                {
                    "user_id": "Fahad Rahman",
                    "user_href": "/profile/Fahad-Rahman-33"
                },
                {
                    "user_id": "Paulo Cezar Souza",
                    "user_href": "/profile/Paulo-Cezar-Souza-1"
                },
                {
                    "user_id": "Harikarathode Bhukya",
                    "user_href": "/profile/Harikarathode-Bhukya"
                },
                {
                    "user_id": "Gusti Eldo Wiranda",
                    "user_href": "/profile/Gusti-Eldo-Wiranda"
                },
                {
                    "user_id": "Pousuangdin Panmei",
                    "user_href": "/profile/Pousuangdin-Panmei"
                },
                {
                    "user_id": "Andre Kaan Liakof",
                    "user_href": "/profile/Andre-Kaan-Liakof"
                },
                {
                    "user_id": "Yehezkiel Davi",
                    "user_href": "/profile/Yehezkiel-Davi"
                },
                {
                    "user_id": "Eamon De Valera",
                    "user_href": "/profile/Eamon-De-Valera-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonas Vermassen",
                "href": "/profile/Jonas-Vermassen-1"
            },
            "answer_text": "Many reasons can lead to war, and in a war of this scale, no one reason can be singled out. I will highlight three “causes” that lead to the three main sub-conflicts of WW2 Germany vs France/Britain: In march 1938, germany annexed Austria. the western allies were shocked, but wanted to avoid a new war. Sudetenland followed, sacrificed by Chamberlain on the altar of peace. When the rest of Czechoslowakia followed, London and Paris realized that Germany wouldn’t stop, and that they couldn’t let this go any further. Hitler still managed to get Memel from Lithuania, but when he invaded Poland, he had overplayed his hand. The allies declared war, and the war had begun.So that’s your first reason: german expansionismGermany vs USSR: Stalin had a non-aggression pact with the Hitler, but neither believed this would hold for long. Stalin was convinced the victorious Capitalist block would march on the Soviet Union, but Hitler didn’t wait for victory. The nazi’s hated the soviets almost as much as the jews, if not worse, and had sworn to eradicate communism, and the communists with it.So the second reason: the looming power of the soviet union and the blind hate of the nazi’s for everything that smelled communist.Japan vs USA: In 1941, Japan wasn’t doing as great as one would think. The war in China was dragging on, and as Japan had few natural resources, further expansion was needed to support the ever-expanding military. They had bad memories of fighting the Russians in 1903, and the army was tied up further south anyway, so the navy would have to do most of the work. A quick strike against the USA, they believed, would force that country to accept Japanese dominance over the Pacific. Though a tactical succes, Pearl Harbor did exactly the opposite, awakening the giant that was the US to doom the axis powersSo third reason: Japanese expansionismTLDR: Japanese imperialism, Soviet imperialism, German imperialism. Those were the reasons ",
            "date": "Answered January 18, 2019",
            "views": "559",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Robert S. Fisher",
                    "user_href": "/profile/Robert-S-Fisher"
                },
                {
                    "user_id": "Prasad Patil",
                    "user_href": "/profile/Prasad-Patil-150"
                },
                {
                    "user_id": "Percival Chang",
                    "user_href": "/profile/Percival-Chang"
                },
                {
                    "user_id": "Furga Prasad Panda",
                    "user_href": "/profile/Furga-Prasad-Panda"
                },
                {
                    "user_id": "Nick Gibson",
                    "user_href": "/profile/Nick-Gibson-76"
                },
                {
                    "user_id": "Wowi Hg",
                    "user_href": "/profile/Wowi-Hg"
                },
                {
                    "user_id": "Jacqueline Montemayor",
                    "user_href": "/profile/Jacqueline-Montemayor-1"
                },
                {
                    "user_id": "Ayush Tiwari",
                    "user_href": "/profile/Ayush-Tiwari-380"
                },
                {
                    "user_id": "Paul Melin",
                    "user_href": "/profile/Paul-Melin"
                },
                {
                    "user_id": "Sean Reynolds",
                    "user_href": "/profile/Sean-Reynolds-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Tominac",
                "href": "/profile/Paul-Tominac"
            },
            "answer_text": "The Versailles Treaty, which put all the blame for WW1 on Germany, and forced it to pay the cost of the war, while preventing the re-militarization of Germany, in which a great deal of national pride was invested. Cynically, the outgoing German administration created a “democracy” which they knew would have to sign and implement the horrors of the Versailles Treaty, and attract the wrath of the People for so doing—-Ludendorff and Co figured they could come back and “rescue” Germany—-a brilliant plan that worked perfectly, except for Hitler, who got their first.An exaggerated belief in the rising power of the USSR, in London and Paris—-which some “experts” predicted would surpass the US economy by 1940 (it never did). Too much effort was put on watching the USSR and not enough on stopping Hitler, who was seen as a buffoon (watch him speak on YouTube—-he isn’t a great statesman compared to any of his day) and of course, he was a capitalist, despite the Socialism in NaZi. The elite were far too concerned with Communism and failed to take Fascism seriously.No one anticipated WW1 serving to motivate the Little People around the globe, but especially in Europe. WW2 had the same effect but more pronounced, as colonists pushed back against the Empires and African Americans against Jim Crow. Where societies weren’t prepared for the tumult, like Italy, dictators arose to restore order. Elsewhere the more successful economies of the US, Britain and to a lesser extent the USSR and France, elsewhere in Europe, kept people working or at least from rising up against the Elites, until Hitler gave them a central motivating issue (or invaded and crushed their democracies and monarchies). Still, when we talk about Socialism or Communism today we miss entirely the religious like devotion it inspired among working class people. They were ready to fight and die for the cause, and in many cases they did. WW1 was sold to the Allies as something noble (it wasn’t, it was ALL about colonialism and who could play) and after it was over, and the suffering had mostly ended, the People wanted what they were promised. Socialism and Communism all too often stepped up where the Western Elites gave cold shoulders.Our own blind racism. Japan was our ally in WW1, but spurned from the Peace they followed the brutal American example in the Phillippines and marched on the Pacific Rim and China to create for Japan what Europeans, and to a point, Americans had enjoyed for the last few centuries. Japan, being Japanese, was never a perfect fit for the Third Reich, and the USSR was even worse, but in such situations, “any enemy of my enemy is my friend”. The Non-Aggression pact signed by Stalin and Hitler was never an alliance, just two thugs agreeing to stay out of each others territorial ambitions until one thug broke the agreement. Germany and Japan would likely have gone to all out war soon after an Axis victory. Eastern Europe and Russia wouldn’t even exist today.Finally, bringing it all together, the Depression. When things go south, nothing turns a spark into a blaze like pulling the food off of people’s tables and the roofs off over their heads. The Elites had one vision of the world—-which predated WW1 and the People had another view that favored them over fawning over Capital. Where the Elites succeeded in channeling the rage of the people against foreigners you got Fascism (one of the sloppiest explanations for it, ever, I admit) and where they couldn’t, Hitler scared them into fighting for the elites. And eighty years on we’re still not really telling ourselves the Truth about that awful war.",
            "date": "Answered April 2, 2018",
            "views": "53",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hershann D",
                    "user_href": "/profile/Hershann-D"
                },
                {
                    "user_id": "Paul Argue",
                    "user_href": "/profile/Paul-Argue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhargav Panyam",
                "href": "/profile/Bhargav-Panyam"
            },
            "answer_text": "There were many events throughout the world that led to the beginning of World War 2. In many ways, World War 2 was a direct result of the turmoil left behind by World War 1. Below are some of the main causes of World War 2. Treaty of Versailles The Treaty of Versailles ended World War I between Germany and the Allied Powers. Because Germany had lost the war, the treaty was very harsh against Germany. Germany was forced to \"accept the responsibility\" of the war damages suffered by the Allies. The treaty required that Germany pay a huge sum of money called reparations. The problem with the treaty is that it left the German economy in ruins. People were starving and the government was in chaos. Japanese Expansion In the period before World War II, Japan was growing rapidly. However, as an island nation they did not have the land or the natural resources to sustain their growth. Japan began to look to grow their empire in order to gain new resources. They invaded Manchuria in 1931 and China in 1937. Fascism With the economic turmoil left behind by World War 1, some countries were taken over by dictators who formed powerful fascist governments. The first fascist government was Spain which was ruled by the dictator Franco. Then Mussolini took control of Italy. These dictators wanted to expand their empires and began to look for new lands to conquer. Italy invaded and took over Ethiopia in 1935. Adolf Hitler would emulate Mussolini in his take over of Germany. Hitler and the Nazi Party In Germany, Adolf Hitler and the Nazi Party rose to power. The Germans were desperate for someone to turn around their economy and restore their national pride. Hitler offered them hope. In 1934, Hitler was proclaimed the \"Fuhrer\" (leader) and became dictator of Germany. Hitler resented the restrictions put on Germany by the Treaty of Versailles. While talking about peace, Hitler began to rearm Germany. He allied Germany with Mussolini and Italy. Then Hitler looked to restore Germany to power by expanding his empire. He first took over Austria in 1938. When the League of Nations did nothing to stop him, Hitler became bolder and took over Czechoslovakia in 1939. Appeasement After World War 1, the nations of Europe were weary and did not want another war. When countries such as Italy and Germany became aggressive and began to take over their neighbors and build up their armies, countries such as Britain and France hoped to keep peace through \"appeasement.\" This meant that they tried to make Germany and Hitler happy rather than try to stop him. They hoped that by meeting his demands he would be satisfied and there wouldn't be any war. Unfortunately, the policy of appeasement backfired. It only made Hitler bolder. It also gave him time to build up his army. Great Depression The period before World War II was a time of great economic suffering throughout the world called the Great Depression. Many people were out of work and struggling to survive. This created unstable governments and worldwide turmoil that helped lead to World War II. ",
            "date": "Answered September 5, 2018",
            "views": "640",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Blanc",
                    "user_href": "/profile/Ben-Blanc-4"
                },
                {
                    "user_id": "Jeremy Selby",
                    "user_href": "/profile/Jeremy-Selby"
                },
                {
                    "user_id": "Christian Westby",
                    "user_href": "/profile/Christian-Westby"
                },
                {
                    "user_id": "Marion Owens",
                    "user_href": "/profile/Marion-Owens-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Jänsch",
                "href": "/profile/Martin-Jänsch"
            },
            "answer_text": "How? WW2 started when the Nazi regime (badly) faked an attack of polish attackers on a german radio station and then as a result started the invasion of Poland, September 1st 1939. So far, so boring and easy to look up. Now WHY is the much more interesting topic. There is a whole complex of topics and reasons that all were leading to the ‘necessety’ for Germany to start this war, ill focus on 2. Let’s start with Nazi ideology. The Nazi’s worldview of being the strongest and noblest race and being meant to lead the world because of this was one of the keys in propaganda and justification of all steps that seemed necessary to achieve world leadership. The anit-semitism that came with this was not an invention of the Nazis, but they made it one of their leading arguments to not only save the aryan race but the whole world from this ‘non-worthy race’.Germany as a unified nation was coming too late to have success at colonialsim, and with loosing WW1 and the big shame, as it was felt by big party of the population, of the treaty of Versailles there was a longing for significance and power in the population. As colonies were not really an option, ‘Lebensraum’ was then to be taken from those neighboring ‘races’ deemed less worth. Ideology would allow a lot more details to be analyzed, but ill go over to the other, more often overlooked aspect: financial necessityOk, so we have that treaty of Versailles, costing immense ammounts of money in reparations and limiting the german military to a fraction of a deemed ‘worthy’ army (perspective of the ideology). How do you change those both things? Just ignore them? Actually, yes, to some degree just that was happening. Germanys army was enlarged a lot in the years before WW2, many things, like the development of tanks and airforce, had to be done in secrecy, others were just done and lied about to the allies (navy mostly) or even not hidden at all (enlarging troop numbers in general). Hitler always made small steps in these regards, probing how far he could go without the Allies doing more than scold him.But all that costs even more money, and not paying reparations wasn’t just that easy. Nazi ideology would help with this again. After deeming jewish race less worth and making the ‘Nürnberger Rassegesetze’ that limited the rights of jews immensely, it was easy to get immense ammounts of money. Jewish property was seized or simply bought ridicolously underpriced, the laws all allowed that and no other nation intervened. In addition the Nazis simply went deep into national debt. So much that late ’30s germany was moving rapidly towards state bankrupcy. Hitlers plans to start a war were set for some years later, giving him more time to strengthen his position and armies, allying with the russians at first to lure them into false security.But all was about to crumble in mid ’39 when the Nazi regime was weeks away from actual bankrupcy. THIS was the moment the war had to start! There was no way to be able to wait any longer.With the invasion of Poland the regime seized enough property to go on for many month. The side effect of France and UK declaring war was that there were no necessary payments to be made towards the now again enemies. With the invasion of France there came the next big cashflow towards Nazi Germany, with this alone it would have been possible to wait out the attack on russia even longer … but now the Nazis got over confident. After defeating France in weeks and with Russia still not expecting much and being busy with preparing a defense against the anticipated attack of the Japanese through occupied China, Hitler chose not to wait too long to attack Russia. The rest is, simply said, history. ",
            "date": "Updated April 3, 2019",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivang Shaw",
                    "user_href": "/profile/Shivang-Shaw-1"
                },
                {
                    "user_id": "Sushil",
                    "user_href": "/profile/Sushil-118"
                },
                {
                    "user_id": "Pousuangdin Panmei",
                    "user_href": "/profile/Pousuangdin-Panmei"
                },
                {
                    "user_id": "Ankit.",
                    "user_href": "/profile/Ankit-1362"
                },
                {
                    "user_id": "Sritam Tripathy",
                    "user_href": "/profile/Sritam-Tripathy"
                },
                {
                    "user_id": "Grace Luis",
                    "user_href": "/profile/Grace-Luis-2"
                },
                {
                    "user_id": "Micah John Vegerano",
                    "user_href": "/profile/Micah-John-Vegerano-1"
                },
                {
                    "user_id": "Jahidul Hoq Emon",
                    "user_href": "/profile/Jahidul-Hoq-Emon"
                },
                {
                    "user_id": "Poonam Jain",
                    "user_href": "/profile/Poonam-Jain-163"
                },
                {
                    "user_id": "Carlton Gillard Jr.",
                    "user_href": "/profile/Carlton-Gillard-Jr"
                },
                {
                    "user_id": "Rajesh Gaikwad",
                    "user_href": "/profile/Rajesh-Gaikwad-5"
                },
                {
                    "user_id": "Sid Simo",
                    "user_href": "/profile/Sid-Simo"
                },
                {
                    "user_id": "Scott Carrington",
                    "user_href": "/profile/Scott-Carrington-2"
                },
                {
                    "user_id": "Kartik Reddy",
                    "user_href": "/profile/Kartik-Reddy-33"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-43"
                },
                {
                    "user_id": "Harshit",
                    "user_href": "/profile/Harshit-275"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jinx Fogle",
                "href": "/profile/Jinx-Fogle"
            },
            "answer_text": "I believe the one and only answer is control of the masses by a few powerful families. These are not the families who were appointed or elected by the countries who gave up the pride of their youth to the monster of war. The USA government pledged to \"NEVER ENTER A FOREIGN CAMPAIGN\". Of course we all know be now that the Spanish-American war was devised by W.R.Hurst to sell papers and have his armament buddies make more wealth. WWI we lied when we said the Lusitania was not carrying war materials enabling  Wilson to act inflamed convincing congress to declare war. If we had never entered WWI Britain and France would have sued for peace, costing the 10 or so families funding the war to lose fortunes. And allowing the people in Russia to over throw communism.WWII was caused by the extreme monetary restrictions placed on Germany, it took wheeled barrows full of paper money in Germany to buy a loaf of bread. They declared bankruptcy and started WWII again by the few families pulling the strings. Korea and Vietnam were over Chinese taking raw materials and great open water ports in Korea. The communists getting their hand on rubber and oil in Vietnam. Now we are in the middle east, in Africa the crazies are selling children as brides, raping and kill older women and killing the men who do not pledge to Allah. But in Afghanistan full of raw materials we are fighting a never ending was to wait for it \"WIN THE HEARTS AND MINDS OF THE PEOPLE\". Every war we have been involved since the revolutionary war has been with out merit. I deplore slavery but every state was assured the right to secede when they join the United States.  Note that MONSTER FDR took away the gold standard against the constitution \"nothing but gold or silver may be money\" by lying that the Federal Reserve was not a state therefore not constrained by the constitution. From 1776 until 1932 the value of the US dollar was \"as good as gold\". Even as late as 1958 Eisenhower could only create the interstate freeway system be saying \"There will be at certain periods of roads  8 miles long  of freeway smooth enough for our bombers and fighters to land once our air bases are destroyed.\" I guess I am so old I remember friends bringing 22 and 410 rifles to shoot in the way home from school rabbits and such. The teacher would put them by her desk and return them after school. Try shooting up a school with 25 guns in 12 rooms. ",
            "date": "Answered August 5, 2015",
            "views": "782",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dipesh Raj Digwal",
                "href": "/profile/Dipesh-Raj-Digwal"
            },
            "answer_text": "A lot of events throughout the world led to the beginning of World War II. In many ways, World War II was a direct result of the turmoil left behind by World War 1. Below are some of the main causes of World War II. Treaty of Versailles The Treaty of Versailles ended World War I between Germany and the Allied Powers. Because Germany had lost the war, the treaty was very harsh against Germany. Germany was forced to “accept the responsibility” of the war damages suffered by the Allies. The treaty required that Germany pay a huge sum of money called reparations. The problem with the treaty is that it left the German economy in ruins. People were starving and the government was in chaos. Japanese Expansion In the period before World War II, Japan was growing rapidly. However, as an island nation, they did not have the land or the natural resources to sustain their growth. Japan began to look to grow their empire in order to gain new resources. They invaded Manchuria in 1931 and China in 1937. Fascism With the economic turmoil left behind by World War I, some countries were taken over by dictators who formed powerful fascist governments. The first fascist government was Spain which was ruled by the dictator Franco. Then Mussolini took control of Italy. These dictators wanted to expand their empires and began to look for new lands to conquer. Italy invaded and took over Ethiopia in 1935. Adolf Hitler would emulate Mussolini in his take over of Germany. Hitler and the Nazi Party In Germany, Adolf Hitler, and the Nazi Party rose to power. The Germans were desperate for someone to turn around their economy and restore their national pride. Hitler offered them hope. In 1934, Hitler was proclaimed the “Fuhrer” (leader) and became dictator of Germany. Hitler resented the restrictions put on Germany by the Treaty of Versailles. While talking about peace, Hitler began to rearm Germany. He allied Germany with Mussolini and Italy. Then Hitler looked to restore Germany to power by expanding his empire. He first took over Austria in 1938. When the League of Nations did nothing to stop him, Hitler became bolder and took over Czechoslovakia in 1939. Appeasement After World War I, the nations of Europe were weary and did not want another war. When countries such as Italy and Germany became aggressive and began to take over their neighbors and build up their armies, countries such as Britain and France hoped to keep peace through “appeasement.” This meant that they tried to make Germany and Hitler happy rather than try to stop him. They hoped that by meeting his demands he would be satisfied and there wouldn’t be any war. Unfortunately, the policy of appeasement backfired. It only made Hitler bolder. It also gave him time to build up his army. Great Depression The period before World War II was a time of great economic suffering throughout the world called the Great Depression. Many people were out of work and struggling to survive. This created unstable governments and worldwide turmoil that helped lead to World War II. Interesting Facts about the Causes of World War II Because of the Great Depression, many countries were experiencing strong fascist and communist movements including France and Great Britain prior to the war.Prior to World War II, the United States attempted to stay out of world issues with a policy of isolationism. They were not members of the League of Nations.As part of their appeasement policy, Britain and France agreed to let Hitler have part of Czechoslovakia in the Munich Agreement. Czechoslovakia had no say in the deal. The Czechoslovakians called the agreement the “Munich Betrayal.”Japan had taken over Korea, Manchuria, and a significant part of China before World War II began.",
            "date": "Answered February 13, 2017",
            "views": "56",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Justa",
                    "user_href": "/profile/Aditya-Justa"
                },
                {
                    "user_id": "Robert Clouse",
                    "user_href": "/profile/Robert-Clouse"
                },
                {
                    "user_id": "Heinrich Kretzer",
                    "user_href": "/profile/Heinrich-Kretzer"
                },
                {
                    "user_id": "Erik Pina",
                    "user_href": "/profile/Erik-Pina-3"
                },
                {
                    "user_id": "Kieron Swift, PhD",
                    "user_href": "/profile/Kieron-Swift-PhD"
                },
                {
                    "user_id": "الف نون",
                    "user_href": "/profile/الف-نون"
                },
                {
                    "user_id": "John McClenny",
                    "user_href": "/profile/John-McClenny"
                },
                {
                    "user_id": "Kanika Sharma",
                    "user_href": "/profile/Kanika-Sharma-34"
                },
                {
                    "user_id": "Carlos Ljungberg",
                    "user_href": "/profile/Carlos-Ljungberg"
                },
                {
                    "user_id": "Evan Lee",
                    "user_href": "/profile/Evan-Lee-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hinton",
                "href": "/profile/James-Hinton-3"
            },
            "answer_text": "Amar covers the European portion of the war reasonably well, so I won't touch that. Instead I'll focus on the other half of the war, the Pacific War. The roots of WWII began with the opening of Japan in the 1850s and 1860s, largely led by the U.S.A. This forceful series of actions by several of the Great Powers of the time left Japan at a serious disadvantage in the world, but also gave it the examples of locations like China and Africa to examine for the potential consequences. After examining them, Japan decided it had to avoid those consequences as much as possible. To do so it determined to modernize, particular in terms of technology and education, while it still had the wealth to do so. Rather than having their economy slowly bled dry and their control lost (as happened to China) they engaged in aggressive efforts to purchase the tools needed to form a modern nation-state and hire the experts to help them learn to best apply them. Japan's goal through all of this was to force the Great Powers to treat Japan as an equal. In order to do that it needed to be a Great Power itself. To be counted as a Great Power it needed to be able to meet more or less three conditions. It had to be able to project significant power outside of its borders, economically, politically, and militarily,  it had to have extensive geographic holdings (colonies), and it had to be able to have the recognition of its power by the other Great Powers. By 1894 Japan had moved towards this goal. By that time Japan had annexed Hokkaido and conquered the Kingdom of Ryukyu. They had also sent punitive expeditions to Formosa (Taiwan), forced Korea open and subjected them to similar lopsided treaties as those Japan itself had only recently managed to repudiate, and turned Japan into an economic and industrial powerhouse. So far none of these had managed to earn them the Great Power status they needed for their own protection, but they had succeeded in greatly angering China. When a pro-Japanese Korean official was assassinated in Shanghai, Japan went to war with China. In the following 9 month long war the Japanese ran roughshod over China, resulting in their gaining control of Taiwan, a Chinese peninsula near Korea, and a large indemnity. Korea also was recognized as no longer a Chinese tributary state. Russia, France, and Germany all had ambitions on Korea and were alarmed by Japan's sudden influence there. Their combined diplomatic threats forced Japan to return the peninsula to China (Russia immediately leased the area afterward, particularly Port Arthur). Despite this, Japan became the primary controller of Korea's international relations. By 1904 Japan had wrested control of the Chinese coastline across from Taiwan away from all other powers, using the ports there as exclusive economic zones, and sent the largest force to put down the Boxer Rebellion. One of the Great Powers (the U.K.) had finally acknowledged that Japan was a force to be recognized and actually began backing Japanese ambitions as a counter to Russian ambitions. Russia, recognizing the threat, agreed to move its troops out of Manchuria by 1903. Unfortunately Russia missed the deadline. In fact, it even went so far as to instead suggest Japan let Russia have the half of Korea that sits north of the 38th parallel. Japan declared war (and started it with a surprise attack) in February. By June of 1905 Japan had destroyed two-thirds of Russia's navy with almost no losses of its own and had, at great cost, conquered Korea outright. Japan was given the islands north of Hokkaido and control over significant portions of Manchuria. At this point Japan had everything it needed to be recognized as a Great Power in its own right, save for one thing. None of the other Great Powers, including it's ally, Britain and it's victim, Russia, would acknowledge it as a Great Power. When WWI came along, Japan sided with the Allies and engaged in a number of military operations that kicked Germany out of its Pacific colonies and protected allied shipping throughout the Pacific.  When the war ended Japan was allowed to join the negotiations that would lead to the Treaty of Versailles. Unfortunately, Japan's expectations at the conference were frustrated, particularly when it demanded a clause in the treaty recognizing racial equality. Japan was allowed to keep all German territories north of the equator that it had conquered, but had to cede all territories south of the equator to Australia. At each turn, Japan's need to be recognized as the equal of the Great Powers was frustrated. Determined to force this recognition once and for all, Japan became increasingly aggressive in China, annexing Manchuria forcibly and waging a campaign of terror on any citizens who resisted. Concerned by this action, the United States began embargoing Japanese trade, leading to long term shortages that would have critically damaged the Japanese economy. In order to replace those goods lost to the embargo, Japan needed new sources. The closest sources were in French Indochina. Owing to the relationship between England, France, and the U.S. an attack on Indochina would result in war with all three. Japan attempted to negotiate an end to the embargo, but neither the U.S. or Japan were willing to accept any compromise in their relative positions. Knowing that France and the U.k. were too heavily engaged in war with Germany, Japan gambled on a knockout blow against the U.S. fleet at Pearl Harbor that would allow them to negotiate a favorable peace with the U.S. shortly thereafter. The rest is history. ",
            "date": "Answered January 26, 2015",
            "views": "52",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Diksha Hetta",
                    "user_href": "/profile/Diksha-Hetta-1"
                },
                {
                    "user_id": "Ken Ski",
                    "user_href": "/profile/Ken-Ski"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/emmanuela-prempeh"
                },
                {
                    "user_id": "Revathi Srirangam",
                    "user_href": "/profile/Revathi-Srirangam"
                },
                {
                    "user_id": "Josh Kholhring",
                    "user_href": "/profile/Josh-Kholhring"
                },
                {
                    "user_id": "Rishabh Raya",
                    "user_href": "/profile/Rishabh-Raya"
                },
                {
                    "user_id": "Qasim Zulfikar",
                    "user_href": "/profile/Qasim-Zulfikar"
                },
                {
                    "user_id": "Pranay Purohit",
                    "user_href": "/profile/Pranay-Purohit-1"
                },
                {
                    "user_id": "Russel Rhay Basiao",
                    "user_href": "/profile/Russel-Rhay-Basiao"
                },
                {
                    "user_id": "Tahir LOne",
                    "user_href": "/profile/Tahir-LOne-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Nary",
                "href": "/profile/Sam-Nary"
            },
            "answer_text": "World War II broke out for a couple of major reasons… Economic Troubles Related to the Great Depression: The Stock Market Crash in 1929 had a profound impact across the globe and affected nearly every nation on Earth. For as prices fell and resources seemed to dwindle as a result of the economic crisis, this forced many to turn more radical or reactionary movements as a response to the crisis. In the US, you would see a large rise in the Communist Party, which had been largely ignored after the first Red Scare in the early 20s. Though, for the most part, with the way US elections work, even with the growth in the Communist Party in the 30s, it was not enough for them have an impact on the US government. Largely as the main US parties, the Republicans and Democrats managed to hold enough votes to keep third parties on the outside looking in. However, in other countries that had different election laws or a tradition that leaned more toward a more regimented system, the economic crisis brought on by the Great Depression would see the rise in extremist parties that didn’t have clear checks on their power. In Europe this would lead to Hitler’s rise to power in 1933 on the promises that the Nazis would fix the economic problems and restore Germany as a great power. In Asia this would lead to the Japanese government becoming more and more militarist in its nature… And both of these for various reasons would then turn to economic policies that were built around conflict and conquest to take the resources and land needed for economic substance. This would be especially true for Germany, who through their own prejudices cut themselves off from international trade and thus created a situation where Germany would HAVE to conquer and expand in order to sustain its own economy for according to their own doctrines, trade would only empower their enemies in the long run, and thus it would be better to conquer and gain the resources so that trade wasn’t needed. And it’s this that sets Germany on the path to invading Poland in 1939… Which would mean that World War I did NOT cause World War II. Yes, there may have been certain aspects of the Versailles Treaty that may have come off as “unfair” to the Germans, that was NOT what actually brought Hitler to power. The idea that it did was largely the Nazi Party’s own propaganda machine which repeatedly attacked the Versailles Treaty through the 20s and thus was inspiration for the failed putsch in the 20s and became an increased talking point once the Nazis were actually in power. It’s the fact that they wouldn’t shut up about Versailles that has left the impression that the end of WWI was the cause of their rise to power… But if that were true, the Beer Hall Putsch would have succeeded and not failed under a hail of Reichswehr and Bavarian Police bullets. The war and its terms may have helped inspire Nazi ideology, but it did NOT inspire their rise to power and without the Great Depression, the Nazis likely would have remained a tiny and insignificant party for many years longer than they did in history. Jealousy of the Established Imperial Powers: This was something that was especially true for Japan. As the Japanese had watched Britain and America fight with China, Spain in the Philippines, and with Japan in the 1800s. This in turn lead to Japan adopting many of the actions and techniques that were common in Europe and North America when Japan unified. In this, by 1900, Japan was already an industrial power in Asia and that power was growing. With that power came many of the same motivations that drove European colonialism, and since Japan saw itself as the most powerful country in the region, they felt they had the right to advance that power for influence in the region… and this can be seen in Japan’s victory over Russia in 1905 and its participation in WWI on the Allied side. In this, conflict between Japan and at least the US over China and Pacific colonies was probably bound to come about at some point as Japan actively sought to create an empire for itself. The economic crisis of the Great Depression merely accelerated the intensity of Japan’s efforts. To a certain extent, this could also apply to Italy to a degree. As while Italy would unite at around the same time as Germany in history and shared at least some of Germany’s ambitions for colonies in the late 1800s and early 1900s, Italy was largely denied this. They would establish colonies in Libya and in what is now parts of Somalia, but its first attempt to take Ethiopia failed and Italy soon settled in with the colonies they’d taken. By the time Mussolini came to power in the 20s, he revived many of the old dreams of empire that Italy had had before WWI. This would shape both Italy’s conquest of Ethiopia in the 30s and the reasons for which Mussolini joined the war in Europe in 1940. ",
            "date": "Answered July 2, 2019",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hifza Shaheen",
                "href": "/profile/Hifza-Shaheen"
            },
            "answer_text": "Causes of World War II A lot of events throughout the world led to the beginning of World War 2. In many ways, World War 2 was a direct result of the turmoil left behind by World War 1. Below are some of the main causes of World War 2. i. Treaty of Versailles The Treaty of Versailles ended World War I between Germany and the Allied Powers. Because Germany had lost the war, the treaty was very harsh against Germany. Germany was forced to \"accept the responsibility\" of the war damages suffered by the Allies. The treaty required that Germany pay a huge sum of money called reparations. The problem with the treaty is that it left the German economy in ruins. People were starving and the government was in chaos. ii. Japanese Expansion In the period before World War II, Japan was growing rapidly. However, as an island nation they did not have the land or the natural resources to sustain their growth. Japan began to look to grow their empire in order to gain new resources. They invaded Manchuria in 1931 and China in 1937. iii. Fascism With the economic turmoil left behind by World War 1, some countries were taken over by dictators who formed powerful fascist governments. The first fascist government was Spain which was ruled by the dictator Franco. Then Mussolini took control of Italy. These dictators wanted to expand their empires and began to look for new lands to conquer. Italy invaded and took over Ethiopia in 1935. Adolf Hitler would emulate Mussolini in his take over of Germany. iv. Hitler and the Nazi Party In Germany, Adolf Hitler and the Nazi Party rose to power. The Germans were desperate for someone to turn around their economy and restore their national pride. Hitler offered them hope. In 1934, Hitler was proclaimed the \"Fuhrer\" (leader) and became dictator of Germany. Hitler resented the restrictions put on Germany by the Treaty of Versailles. While talking about peace, Hitler began to rearm Germany. He allied Germany with Mussolini and Italy. Then Hitler looked to restore Germany to power by expanding his empire. He first took over Austria in 1938. When the League of Nations did nothing to stop him, Hitler became bolder and took over Czechoslovakia in 1939. v. Appeasement After World War 1, the nations of Europe were weary and did not want another war. When countries such as Italy and Germany became aggressive and began to take over their neighbors and build up their armies, countries such as Britain and France hoped to keep peace through \"appeasement.\" This meant that they tried to make Germany and Hitler happy rather than try to stop him. They hoped that by meeting his demands he would be satisfied and there wouldn't be any war. Unfortunately, the policy of appeasement backfired. It only made Hitler bolder. It also gave him time to build up his army. vi. Great Depression The period before World War II was a time of great economic suffering throughout the world called the Great Depression. Many people were out of work and struggling to survive. This created unstable governments and worldwide turmoil that helped lead to World War II. ",
            "date": "Answered April 4, 2017",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivang Shaw",
                    "user_href": "/profile/Shivang-Shaw-1"
                },
                {
                    "user_id": "Saket Shukla",
                    "user_href": "/profile/Saket-Shukla-27"
                },
                {
                    "user_id": "Dhirendra Chandra Das",
                    "user_href": "/profile/Dhirendra-Chandra-Das"
                },
                {
                    "user_id": "Devendra Shewaramani",
                    "user_href": "/profile/Devendra-Shewaramani"
                },
                {
                    "user_id": "Kartikey M",
                    "user_href": "/profile/Kartikey-M"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Adamchek",
                "href": "/profile/Edward-Adamchek-1"
            },
            "answer_text": "In Europe, initiation of crimes against humanity began some time around 1936, when anti-Semitism began to be formally organized and coordinated, as the result of Hitler’s “election;” fighting actually began when Germany invaded Western Poland, in Sept. 1939, with the Soviet military invading Eastern Poland a few weeks later. Some identify this as the beginning of WWII. In Asia, Japan began its invasion of China in 1932, rapidly increasing its level of incursion to the point of the beginning of International Outrage, in 1934 or 1935. The atrocities committed by Japan in China have not been publicized as highly as the Holocaust, but numbers of murders were commensurate. Ultimately, American history identifies WWII as having begun when America entered the War when Pearl Harbor was attacked by Japan, so the common answer in America would likely be that the baginning of WWII occurred on America’s entry into war in Pacific WWII on December, 7 1941; although by that time, War in Asia had been ongoing for at least 6 or 7 years. To identify when WWII actually began, meaning as an actual World War, rather than as multiple wars, invasions and conflicts occurring around the globe, then it was essentially when America entered into the Asian conflict, as the result of the Japanese attack, or possibly one or two (?) days afterwards, when Hitler formally declared war on America, and the Allied and Axis polarization occurred, with America formally declaring partnership in the conflicts against both Germany, as well as Japan. The US had been supporting the Allies in the European conflict previously, through “Lend Lease,” earlier than Dec. 1941, and through covert support for China against Japan, by way of covert support of the Flying Tigers. However, America initiated coordinated offensive action when the US initiated the Doolittle Raid against the Japanese home islands in April of 1942 and entered as an Allied combatant in North Africa in November 1942, in Operation Torch, fighting against German, Italian and Vichy French forces of the Axis. ",
            "date": "Answered April 3, 2019",
            "views": "268",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suprakash Roy",
                "href": "/profile/Suprakash-Roy-1"
            },
            "answer_text": "There were so many causes. Only fews were mainly responsible for this bloodiest war. Treaty of Versaille - After 1919, France and Belgium forced Germany and Austria to sign this. They considered Hamburg as an international port. They forbade Germany to produce a single arsenal of creating Air force. England snatched 60% of Germany's battleships. Germany occupied zones were snatched by Allied countries and France demanded a huge compensation from Germany for the cost of world war 1. In 1923, France and Belgium snatched Germany’s rurh industrial zone because Germany could not give the amount of money,which they wanted. It led to a huge discrimination between two countries.Rise of Nazis - German people lost all of their hope to Weimer republic . Because they were following the rules of humiliating treaty of Versaille. It was a story of a young boy, who wanted to become an artist but finally became a drifter. He was born in Austria. He fought as a soldier in ww1.Later he planned to make a political party to change German economy. In 1925 , he was arrested. In jail, he wrote his famous book,Mein Kamph. He sent the copy to his best friend Rudolf Hess. He was nothing but Adolf Hitler. At this time, German economy was governed by Marxists and Jews. Hitler's mother Klara was killed by a Jew doctor when Hitler was just 18 years old. Berlin was a porn graphic hub. German students were addicted to porn by Jew people. They controlled the entire media and they were snatching common German's job. Hitler made Nazi Party against it. His gestapo,Brown shirt and Black shirt started to kill the political leaders of other parties. In 1933, Nazis won the power and Hitler became Chancellor. Hitler reduced 80% unemployment rate within 3 years after getting his dictatorship. That is why German people supported him. He started anti smoking campaign and made Autobahn highway for Germany.In 1935, a peace conference was organised in Geneva. Hitler claimed that Germany won't increase their army if France and England did the same. But France refused to do it. Hitler then resigned the league of nation and started to produce some secret weapons. Germany then annexed Austria in 1937.Lebensraum - ‘Lebensraum’ means the living place for Germans. Hitler planned to reunite all German people. France and England were afraid of seeing Germany's massive air force and submarines. They also needed Germany to destroy Soviate Bolseivikh party. In 1938, they signed Munich treaty with Hitler to protect Chezklosovakia. Hitler violated Chamberlain's proposal and occupied entire territory.This again brought trouble.Hitler finally demanded Dunkirk and ww2 started.",
            "date": "Updated July 7, 2018",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinav Shankar",
                    "user_href": "/profile/Abhinav-Shankar-34"
                },
                {
                    "user_id": "Abubakr Jamal",
                    "user_href": "/profile/Abubakr-Jamal-3"
                },
                {
                    "user_id": "Sachin Yadav",
                    "user_href": "/profile/Sachin-Yadav-3234"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steph Groom",
                "href": "/profile/Steph-Groom-2"
            },
            "answer_text": "(1) Hitler’s dream was to conquer all of Europe. Hitler started his dream first by conquering Poland. Then later on he decided to declared War on England after his Blitzkrieg bomded the Hell out of London over many months. England all alone with no allies to help them had no choice but to declare War on Germany. These events started what would become WW II in Europe. Based on research by Bob Baer a former CIA Operative that is presented on a History Channel TV series ‘Hunting Hitler”, his team of researchers discovered information that Hitler planned to attack the US, with a future atomic bomb aimed a New York City, that Germany scientists were researching on how to develop and build, after his dream of conquering Europe was completed. (2) Japan was on a path to conquer parts of Asia and the Pacific Islands including the Philippines by first terrorizing and essentially conquering China and later on deciding to take on the US by attacking and basically destroying the US Naval fleet at Pearl Harbor, Hawaii on 12/7/1941. FDR after the Pearl Harbor attack declared War in Japan. This is the start of the US entering WW II against Japan and because Japan was a partner in the Axis and the Attacks-War declarations of England-Germany, the US entered the WW II in Europe. Further, the US being an ally of England meant that the US would have to fight Germany in hopes of saving England and attempting to stop Hitler’s aggression of countries in Europe. This is the start of US entering WW II in Europe. Hence, the US becomes part of the Allied or Allies (England, Russia, US) alliance against the Axis (Germany, Japan, Italy). In the mix of countries fighting in WW II in Europe, because Germany attacked Russia, Russia declared War on Hitler’s Germany also due to Germany violating a previous non treaty with Russia and attacking them. This is how Russia became part of the Allied alliance. (3) Italy joined the Axis Pact in 1937. The \"Rome–Berlin Axis\" became a military alliance in 1939 under the so-called \"Pact of Steel\", with the Tripartite Pact of 1940 leading to the integration of the military aims of Germany, Italy and Japan (source 1). Italy, in my opinion was the weak link in the Axis Alliance. In Benito Mussolini’s mind he thought that Italy’s attempted conquests in Europe was his dream of rekindling the might of Roman Empire. What a joke this dream was! This little nothing of a so-called man fascist dictator would turnout to be Italy’s biggest mistake during WW II. Italy to this day is a weak country indeed. Source Italy was part of the Axis alliance by",
            "date": "Answered December 7, 2018",
            "views": "281",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Achyuthan Sanal",
                "href": "/profile/Achyuthan-Sanal"
            },
            "answer_text": "I do not think such a complex question can be put into a simple narrative. So I’ll try to be as brief as possible.(look how that went) At the end of World War I, the winning side(the Entente- France, Britain, The USA, Serbia, Italy and others) demanded that, in return for peace, Germany accept all responsibility for the war, surrender it’s colonies, give the region of Alsace-Lorraine to France and pay 132 billion German marks or $400 billion in today’s money, limit it’s military to 100,000 men(1/13th of it’s previous size)among other conditions.  The German government accepted and this treaty was known as The Treaty of Versailles. The German Kaiser fled to the Netherlands. The huge war indemnity destroyed the German economy and bankrupted the government, which started printing more money and boom- inflation. By October 1923, a single egg cost 3 billion reichsmarks. Consumers needed a wheelbarrow to carry enough paper money to buy a loaf of bread.  The German people were angry and bitter. It was the perfect situation for a charismatic leader to take advantage of and rise to power. That leader was Adolf Hitler. Hitler blamed the Weimar Republic’s weakness on the influence of Germany’s Jewish and communist minorities, who he claimed were trying to take over the country. He blamed the Jews and claimed they were inferior. He promised the restoration of Germany’s pre-war glory.  The Germans were desperate for someone to turn around their economy and restore their national pride. Hitler offered them hope. In 1934, Hitler was proclaimed the \"Fuhrer\" (leader) and became dictator of Germany. Hitler resented the restrictions put on Germany by the Treaty of Versailles. While talking about peace, Hitler began to rearm Germany. He allied Germany with Fascist Italy, with Benito Mussolini as it’s dictator and later Imperial Japan, which had ambitions to take over the East. Then Hitler looked to restore Germany to power by expanding his empire. He first took over Austria in 1938. When the League of Nations did nothing to stop him, Hitler became bolder and took over Czechoslovakia in 1939.  After World War 1, the nations of Europe were weary and did not want another war. When countries such as Italy and Germany became aggressive and began to take over their neighbors and build up their armies, countries such as Britain and France hoped to keep peace through \"appeasement.\" This meant that they tried to make Germany and Hitler happy rather than try to stop him. They hoped that by meeting his demands he would be satisfied and there wouldn't be any war. Unfortunately, the policy of appeasement backfired. It only made Hitler bolder. It also gave him time to build up his army. The allies only declared war when Hitler went a step too far and invaded Poland. Thus, the Second World War started on the First of September, 1939…  ",
            "date": "Answered August 2, 2020",
            "views": "241",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Monika Miliczka",
                    "user_href": "/profile/Monika-Miliczka"
                },
                {
                    "user_id": "Reed McNeely",
                    "user_href": "/profile/Reed-McNeely"
                },
                {
                    "user_id": "Roy Haikarainen",
                    "user_href": "/profile/Roy-Haikarainen"
                },
                {
                    "user_id": "Lori Sly",
                    "user_href": "/profile/Lori-Sly-1"
                },
                {
                    "user_id": "Emily Scott",
                    "user_href": "/profile/Emily-Scott-63"
                },
                {
                    "user_id": "Gail Ellis",
                    "user_href": "/profile/Gail-Ellis-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/C-Hadar"
                },
                {
                    "user_id": "Voytek Eymont",
                    "user_href": "/profile/Voytek-Eymont"
                },
                {
                    "user_id": "Chris Judge",
                    "user_href": "/profile/Chris-Judge-8"
                },
                {
                    "user_id": "Gopi Krishna",
                    "user_href": "/profile/Gopi-Krishna-289"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                },
                {
                    "user_id": "Sandeep Deshpande",
                    "user_href": "/profile/Sandeep-Deshpande-6"
                },
                {
                    "user_id": "Sapna Roy",
                    "user_href": "/profile/Sapna-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Civish",
                "href": "/profile/Fred-Civish"
            },
            "answer_text": "What started World War II?  It is far too simplistic to blame it on one cause, one incident or even a small group of incidents.   However, I would argue that all of the following were significant factors, even if no single item is the cause: The Treaty of Versailles - It was quite punitive.  It mangled the German economy and helped create the conditions where Hitler could arise, but without Hitler, war was not inevitable.  Who made the Treaty of Versailles so punitive?  The French, British and other countries.  What were they thinking?  That punishing Germany would, \"Teach them a lesson?\"  Like they hadn't already learned a lesson from their own war losses?  Why didn't the other European nations learn the lesson that it is better to make friends of your enemies, than to make your enemies worse? The rise of Hitler.  Say what you will, he was one man, but he was at a crucial point and he was not averse to using illegal activity, and then social manipulation through propaganda, to get his way.  Without Hitler, I don't think that Germany would have gone to war.  Or at least not for several more decades, at least.  True, his nascence was directly out of World War I, and the Treaty of Versailles, BUT, he literally went against the will of most German people, and clearly broke their own laws, until he was able to get control, and start his propaganda machine to turn them to his side and build up to war. Outmoded French thinking.  The Maginot Line and the poorly prepared French military did not scare Hitler.  In fact, it made France look like a plum, ripe for the taking.  And he was right.  France was ostensibly the strongest Continental power, after Germany, and with it looking so weak, it was very tempting to him to start the war.  After all, it seemed he would have tremendous gains with very little risk, and that decision made him look like a military genius.  A stronger France, with a better prepared military and defense might have made him think twice about starting the war. English appeasement.  Czechoslovakia and the Sudetenland.  \"Peace in our time!\"  Please.  So, how did that work for you?  If you give the bully your lunch money, do you really think he won't be back tomorrow for more? Russian duplicity.  There are Soviet apologists out there who claim that Russia just \"had\" to sign treaties with Hitler, to supply him with oil and equipment and other military and political support.  After all, if they didn't, then they just \"knew\" that the big bad wolf was going to eat them, so they had to buy time.  Of course, there isn't a shred of evidence that this was ever the Russian strategy.  They MADE themselves into Germany's ally, before the war.  They HELPED the German military build up and prepare for war.  Meanwhile, Stalin was killing, raping and starving his own people in many areas of Russia and the Ukraine and other \"sub\" countries, because it helped him gain and keep more power.  He killed a whole generation of their most competent military leaders and emasculated his military.  He NEVER seemed to consider Germany to be a threat.  Instead, he seemed to feel his own people were the real threat, and his army was mostly used to keep them in line, until Germany turned against him.  Oh, and he also used it against lesser nations, like Poland, jumping right in, along with Germany, and gobbling up as much of that country as he could.  Something that might interest you:  Go look at a map of Poland from BEFORE World War II and a map of Poland now.  Russia planned to use Germany to help it with its own territorial ambitions, and it would have continued to do so, if Germany hadn't double-crossed them.   American apathy.  \"Let the Europeans rot,\" was a very common opinion in the United States.  Stay out of Europe.  It's none of our business.  Besides, America was still pulling itself out of the vestiges of the Great Depression (as were other countries) and most Americans felt it was better to focus on the home front.  At the start of World War II, the United States had something like the 25th largest army in the world.  Even \"super powers\" like Portugal had armies bigger than the United States.  The United States REALLY does not want to be the world's Policeman.  It is a horrible, thankless, dirty and unpopular job.  Too bad.  Somebody has to do it and there just don't seem to be any other candidates waiting in the wings.  But if they don't do it, who will keep the bullies from taking the smaller kid's lunch money? Japanese aggression and racism.  Mostly when we talk about World War II, we seem to focus on the European theater, at least at the beginning, but World War II actually started earlier than most people think, and probably started first in the Asian theater.  Japan always seemed to be abusing Korea.  Then the Japanese invaded Manchuria in 1931, and ruled it until the end of WW II, and invaded mainland China in 1937.  This was the year BEFORE Hitler invaded the Sudetenland in 1938.  Japanese society was quite racist at the time, and viewed other Asians as lesser beings - admittedly, they weren't the only people who did so, but their beliefs led them to act brutally.  They literally butchered and raped their way through Asia and didn't care about anything except the glory of Greater Japan.  Eventually they even attacked the United States at Pearl Harbor in December 1941, and their excuse was that we were being bad to them, using economic and political pressure, and were trying to prevent them from raping their neighbors.  They just HAD to do it.  We MADE them attack us.  After all, we had no REAL right to be in the Pacific.  The Pacific belonged to them.  Now, how much did all this early Japanese adventurism in Asia affect the rest of World War II?  Hard to say, but it certainly set some bad precedents and didn't help matters in general.  There were reasons why Hitler signed treaties with the Japanese, and the Germans clearly like Japanese aggressiveness. Italian Fascism, Mussolini and Ethiopia.  Meanwhile, in Italy, Mussolini came to power and decided to re-establish the Roman Empire.  After all, who were the greatest people on earth?  Why, the Romans of course, so it must be their destiny to rule the world.  They started with Ethiopia, invading it in 1935.  Of course, Ethiopia had no ability to fight even a second rate power like Italy, so they were quickly conquered, and then Mussolini and the Italians decided they were world beaters just waiting for their chance, so they allied themselves with Germany and got ready for the main show.  Or so they thought.  If they really had understood themselves a little bit better, they would have stayed out of the whole thing. Weak International/Multi-National Power.  The League of Nations was probably a good idea, but it was virtually impotent in its implementation.  When Japan beat up on the rest of Asia and Italy beat up on the poor Ethiopians, the League of Nations was unable to do anything.  They certainly couldn't function as a world policeman, and with the US being otherwise occupied, that role of an enforcer, ready to stop aggression, was just left barren.  Not to say England wasn't trying, to a degree, but with Neville Chamberlain giving away parts of other countries to the Germans, Great Britain didn't look very threatening.   Of course, this meant that Germany, Japan and Italy all thought they could have their own heyday, so World War II started. ",
            "date": "Answered June 19, 2015",
            "views": "24",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronit Damania",
                    "user_href": "/profile/Ronit-Damania-4"
                },
                {
                    "user_id": "Toni Nduka",
                    "user_href": "/profile/Toni-Nduka"
                },
                {
                    "user_id": "Satish Naraharisetti",
                    "user_href": "/profile/Satish-Naraharisetti"
                },
                {
                    "user_id": "Carlton Gillard Jr.",
                    "user_href": "/profile/Carlton-Gillard-Jr"
                },
                {
                    "user_id": "Parigyan Goyal",
                    "user_href": "/profile/Parigyan-Goyal"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/emmanuela-prempeh"
                },
                {
                    "user_id": "David Cunningham",
                    "user_href": "/profile/David-Cunningham-174"
                },
                {
                    "user_id": "Hardebayo Holar",
                    "user_href": "/profile/Hardebayo-Holar"
                },
                {
                    "user_id": "Reed McNeely",
                    "user_href": "/profile/Reed-McNeely"
                },
                {
                    "user_id": "Chirag Patki",
                    "user_href": "/profile/Chirag-Patki"
                },
                {
                    "user_id": "Scott Longwell",
                    "user_href": "/profile/Scott-Longwell"
                },
                {
                    "user_id": "Kamran Farooq",
                    "user_href": "/profile/Kamran-Farooq-5"
                },
                {
                    "user_id": "Ashish Rana",
                    "user_href": "/profile/Ashish-Rana-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Digamber Rana",
                "href": "/profile/Digamber-Rana"
            },
            "answer_text": "53 WORLD WAR-2 Hands down !! a sure shot epitome of a deadliest conflict in human history was this world war . It had other names : total war , global war . It was fought over span of 6 years ; 1st September , 1939- August 1945. Interestingly, many historians consider 1937 sino- Japanese War to be an advent to Second World War . Casualties were sky high. Roughly , 60–80 million people died and many were maimed : 50 million civilians and 25–30 million soldiers . BELLIGERANTS likewise First World War it too had allied and axis powers . Allied powers - U.K. , USA , France , USSR , china , Poland , Yugoslavia , Greece . Axis powers - Nazi germany , Japan , Italy . CAUSES :- Rise of militarism in JapanJapan had craving to become superpower and they went on a spree to rule mainland china which gave them impetus to become Asia king . The unjust treaty of Versailles .France vengeful behaviour with Germany - In the wake of treaty of Versailles , France misbehaved with Germany.Demands of imperialism .Rise of nationalism and dictatorship in Germany , Japan , Italy .Failure of League of Nations which was formed after world war 1 .Irrational boundaries were carved out after world war 1 . Many ethnic Germans were living in Poland and Czechslovakia . Most significant reason was the rise of Hitler and NSDAP .National socialist Germany workers partyAnti-Semitic ( anti - Jews)Anti - MarxistBelieved in superiority of aryan race .Hitler became chancellor of Germany in 1933Hitler pulled off re-arming of Germany army , airforce by going against treaty of Versailles.Marking of Jews , suspending civil liberties thus became dictator .Restoring the glory of fatherland.Asian role :- 2nd sino-Japanese war began in 1937 , sino stood for China . As Japan was militarising , they invaded Korea in 1910 and Manchuria ( north China) in 1931 . Due to ongoing civil war in china , Japan hopped in and swoop away many territories . Hence , full-blown invasion of China happened in 1937 . The image below will give you limpid idea about Japanese colonies .  EVENTS IN EUROPE :- Before delving into Europe , we must have a clear idea about map of Europe for better understanding .  1936 Remilitrisantion of Rhineland .Rome- Berlin axesGermany - Japan Pact .1938 German annexation Anschluss- annexation of Austria , it was a bloodless coup .Sudentland (Czechslovakia) was annexed .The image down below will give you clear perspective .  1939 Entire Czechslovakia was attacked and conquered by Germany in march .Next target was Poland - but it was provided protection by U.K. and France .MOLOTOV-RIBBENTROP Pact was signed between USSR and Germany . The reason to sign this pact was the cautiousness of Germany . They didn't want to repeat what they did in world war 1 .WAR BREAKS OUT-1939 1st September - Germany attacked Poland .France and U.K. Declare war on Germany.Consequently, USSR attacks Poland from east . As you can see in the image how Poland was bifurcated . 1940- BLITZKRIEG Germany invades Denmark ( concede within few hours ) , Norway .Belgium & Netgerland (Low Countries ) fall to blitzkrieg of Germany .USSR invaded Baltic states ( Lithuania , Estonia , Latvia ) and Finland .Italy joins in and invades France in June .Germany invades France 10 June .Fall of Paris on 14 June .Battle of Britain - Aerial bombing .1940 The Tripartite pact between Germany, Japan , and Italy . Their motto was “one for all and all for one” . Later Hungary , Bulgaria , Romania joined in .1941  According to map , Egypt was English colony , Libya was Italian colony , Tunisia , Morocco and Algeria were French colony . British forces from Egypt push back Italians in Libya but German reinforcement arrive and send British back to Egypt .Germany invades Yugoslavia and Greece .1941 Axis power attacks USSR in June . They ran one of the world's gigantic operation - operation Barbarossa . Germany thought to annex USSR so that they'll get easy access to land for agriculture . Winter sets in and Germany army bogged down .  The Pacific Japan had conquered large parts of china by 1940.After joining axes , it attacked western colonies - indochina( laos , Vietnam , combodia) , Burma , Hong Kong , Guam , Indonesia , Singapore . Singapore was the most prized possession of Uk because of strait of malacca which they lost to Japan. Due to this , USA put and embargo on Japan over oil . THE PEARL HARBOUR ATTACK JAPAN attacked Uk and USA at multiple location on Dec 7/8 of 1941 . Hawaii , maylasia, Philippines, Hongkong were attacked to cripple the navy of USA and Uk . 2500 navy soldiers died in pearl harbour , Hawaii attack . Bombardments over Australia , Papua New Guinea . 1942- ENTRY OF USA . Multiples battles between USA and Japan throughout the island of Pacific and south east Asia from 1942–44.Japan lost crucial battle of medinway and later at Guadalcanal.Many casualties went unwitnessed.1942- THE TIDE TURNS Russians starts to pushback Germans .Heavy casualties and war crimes at eastern front .Siege of Leningrad aka st Petersburg and battle of Stalingrad aka Volgograd . Volgograd is a symbol of USSR resistance . USSR pushed the Germany back .Allied push back Germans and Italian from Libya while US army attacks from morocco .Tunisia won in early 1943 .1943-ALLIED OFFENSIVENESS Island of Sicily and later Italy .Dictator- Benito Mussolini,fall prey to coup , deposed and arrested .1944 By this time soviet army liberated most of the Eastern Europe from Germany .Allied army push through northern Italy .Allied navy gets closer to Japanese mainland.Japanese attacks in Assam repelled . D-DAY 6th June 1944 - allied landing in northern France .France was liberated and Germany was pushed back. Largest amphibious landing . 1945 29 April , germanh army surrenders30 April , Hitler committed sucide.Burma , Indonesia and Philippines retaken by allies .To avoid full scale invasion of Japan , USA dropped nuclear bombs on Hiroshima - 6th August Nagasaki - 9th August . 90k -110k people died instantly . Japan surrenders in August 15 . Aftermath Beginning of Cold War (1947–91)Rise of superpower : USA and USSR .World divided into two blocs . USSR , USA , UK & France divided Germany into two blocs -east and west .Berlin WallHeavy loss of men , material , industry , in Europe .Uk and France stature as global power diminished .UNO was establishedOccupation of Japan and its Pacific land territories by USAKorea was bifurcated .Chinese civil wal resumes and end in 1949 . Communism prevailed and nationalist flee to Taiwan .Israel created .",
            "date": "Answered December 15, 2016",
            "views": "35",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arthur Brogard",
                    "user_href": "/profile/Arthur-Brogard-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/emmanuela-prempeh"
                },
                {
                    "user_id": "Marc Grossman",
                    "user_href": "/profile/Marc-Grossman-6"
                },
                {
                    "user_id": "Krzysztof Kędzierski",
                    "user_href": "/profile/Krzysztof-Kędzierski"
                },
                {
                    "user_id": "Alistair Thompson",
                    "user_href": "/profile/Alistair-Thompson-3"
                },
                {
                    "user_id": "Jason Wang",
                    "user_href": "/profile/Jason-Wang-383"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wes Frank",
                "href": "/profile/Wes-Frank-2"
            },
            "answer_text": "Some excellent answers below on the deeper technical causes of World War II. However, it is important, since a great deal of historical discussion is about blame, responsibility, and guilt, not to lose sight of the primary and immediate causes of the war, and who bears the moral responsibility for the greatest tragedy in human history. That primary moral responsibility likes with Adolf Hitler, who made the choice to conquer and enslave eastern Europe, with the Nazi clique that back him, and with the Germany elites who backed the Nazis. Germany had a lot of historic grievances, but is was recovering better from the Great Depression than any other nation in Europe.  In any case, only a lunatic or a sociopath believes that the appropriate response to a past grievance is to rob and murder thirty million of your neighbors.  Beyond the moral responsibility of the German leadership, we have the leadership elite of Japan.  Japan had much less in the way of past grievances to justify the devastation she visited upon Asia in the 1930s and 1940s. In fact, Japan had done quite well as a nation for centuries before the militerists took over in the 1920s. Ultimately, the cause of thirty million deaths in Asia was sheer egotism. The Japanese ruling faction wanted a larger empire, and they decided to acquire that empire by conquering northern China, dispossessing and starving the population, and colonizing the best land. When the Japanese leadership realized they could not win the war in China, they sought to gain more resources for that war by conquering Siberia from the Soviet Union. When that effort failed, they still had the option of shutting down the Chinese war, but instead opted to conquer Southeast Asia.  There were a number of other enabling factors, high among them Mussolini and Italian fascism, and also Stalin and Soviet imperialism, but they pretty much pale by comparison. ",
            "date": "Answered May 10, 2016",
            "views": "12",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pramod Peter Rachapudi",
                    "user_href": "/profile/Pramod-Peter-Rachapudi"
                },
                {
                    "user_id": "Ardian Nugraha",
                    "user_href": "/profile/Ardian-Nugraha-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Trask",
                "href": "/profile/Scott-Trask-4"
            },
            "answer_text": "Germany invaded Poland on September 1st 1939. Britain and France had pledge Poland to come to her aid but their support was limited. The Soviets invaded from the east on September 17. The Nazi and Soviets had sighed a non aggression pact so they were temporary allies. Hitler turned his attention to Western Europe in 1940. The Germans invaded and occupied Denmark and then Norway. They then attacked and invaded The Netherlands, Belgium, Luxembourg and France and defeated and occupied them in just 6 weeks. Italy entered the war on Germanys side after France had already been defeated and declared war on Britain.The German then tried to force Britain into submission by an intense bombing campaign that ended with a British victory. Italy tried to conquer Greece and had to rely Germany to bail her out. Germany and Italy occupied the Balkans and Greece together. The Germans also had to send troops to North Africa to aid the Italians again after they tried to take over the British controlled territories. In June 1941 Germany attacked the Soviet union which escalated the war and opened a whole new theater. The United States ,which was neutral, was sending as much support as it could to the countries fighting the Axis Powers. Japan ,who had invaded China in 1937 allied with Germany and Italy in 1940. The US began ending trade of certain items in hopes in would deter Japan's expansionism. In July of 1941 the US stopped all oil exports to Japan which was vital to them. Despite efforts by politicians on both sides to avoid a war. The Japanese military, who all but controlled Japan at this time, pushed for war. The Japanese launched a preemptive strike on the US Pacific fleet at Pearl Harbor, Hawaii on the morning of December 7th 1941. Japan also declared war on the British Empire on December 7th. On December 8th the United States declared war on Japan. Germany and Italy declared war on the US which responded in kind. Before the war their had been a series of crisis. Japan was expanding into China and Italy into Africa. Germany had wanted back its lost territory and in 1938 annexed Austria and then Czechoslovakia. Hitler wanted territory from Poland who refused and asked The British and French for support. Hitler claimed the invasion of Poland was done in defense after Polish troops attacked a German radio station in what was called the Gleiwitz incident. German troops dressed in Polish uniforms staged the incident in order to give the Germans a legitimate reason to invade. World War 2 was also a direct result of World War 1. The Treaty of Versailles imposed many restrictions on Germany and life difficult for the German people. Germany was rife with chaos for years until Hitler came to power and promised to restore the nations pride and place in the world. He then pursued an expansionist policy on the belief that the German people were superior to all the people of Europe and even the world, the Master Race. Hitler could have been stopped at Munich but their was no will for a war. The other nations sold out Czechoslovakia and bought a few more months of peace. ",
            "date": "Answered April 4, 2017",
            "views": "439",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Coca Cola",
                    "user_href": "/profile/Coca-Cola-175"
                },
                {
                    "user_id": "Emily Sockwell",
                    "user_href": "/profile/Emily-Sockwell-1"
                },
                {
                    "user_id": "Paul Close",
                    "user_href": "/profile/Paul-Close"
                },
                {
                    "user_id": "Charles Clemens",
                    "user_href": "/profile/Charles-Clemens-3"
                },
                {
                    "user_id": "Rupesh Routray",
                    "user_href": "/profile/Rupesh-Routray"
                },
                {
                    "user_id": "Micah Nakihei",
                    "user_href": "/profile/Micah-Nakihei"
                },
                {
                    "user_id": "Carol Wellington",
                    "user_href": "/profile/Carol-Wellington-2"
                },
                {
                    "user_id": "Pato Omollo",
                    "user_href": "/profile/Pato-Omollo"
                },
                {
                    "user_id": "Meryem Kas",
                    "user_href": "/profile/Meryem-Kas"
                },
                {
                    "user_id": "Austin McGee",
                    "user_href": "/profile/Austin-McGee-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Byron Owens",
                "href": "/profile/Byron-Owens-2"
            },
            "answer_text": "The Japanese had, by the 1930’s, a dire need of raw materials for industry and the military. As an island nation they could not produce their own and so were dependent upon imports. This did not sit well with them so the militaristic leaders in power at the time implemented a program of conquer-by-force, giving it the rather benign sounding name of the Greater East Asia Co-prosperity Sphere (putting lipstick on a warring boar, if you will). Invasions of Indo-China, China, and Indonesia ensued. The only thing standing in their way was the American Pacific Fleet which, in 1940, had moved its base from San Diego to Pearl Harbor, HI. Imperial Japanese Navy Admiral Isoruko Yamamoto knew, from having lived in the USA, that there was no way the IJN could win a duke-it-out naval battle with the USA. Thus, he came up with a Pearl Harbor attack plan which he hoped would force the Americans into a position of having to sign a non-aggression (peace) treaty with Japan. At the same time economic sanctions due to having lost WWI had plunged Germany’s economy into a deep depression by the early 1930’s. This allowed a madman named Adolph Hitler and his Nationalist Socialist (NAZI) party to eventually come to power. A desperate people will support anyone who convinces them their plight is not their fault and has a convenient boogeyman (the Jews) to point the finger at. Hitler began expanding Germany’s military, shoring up its economy, and consolidating his power by what ever means necessary. Eventually, he embarked upon an expansionist policy and pursuing his vision of a one-Europe under Nazi German control. Austria and the Sudetenland were brought under the Nazi umbrella almost without firing a shot. If he had stopped there the world would have said, “Okay, we’re good. Have fun running your country” (see Neville Chamberlain and his policy of appeasement). But Hitler didn’t intend to stop there. Aggression was the order of the day and eventually he went too far. The invasion of Poland was the tipping point. The world now saw that Europe was in deep kim-chee. FDR helped Great Britain as much as he could (Lend-Lease program) but was hamstrung by a strong isolationist movement in the USA, the poster boy of which was none other than Charles Lindbergh. On December 7, 1941 the roiling pot boiled over. The USA declared war on Japan the next day and two days later Hitler, honoring his Axis commitment, declared war on the USA. There are many details, back stories, and side bars to my synopsis. This is the Cliff’s Notes version of events but, in short, this is how WWII got started. ",
            "date": "Answered June 14, 2017",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greg Stewart",
                "href": "/profile/Greg-Stewart-23"
            },
            "answer_text": "War World Two was War World One - The sequel! In Germany there was a popular belief that the Germans were not defeated at the end of WWI, but just gave up! Additionally, the terms of the Versailles Treaty were so onerous, that Germany simply could not afford them. The feelings of resentment were very real during the inter-wars but they were loosely kept in check. The catalyst that reignited everything was the Great Depression. During the Great Depression, Germany’s payments to the victors of WWI were still owed and Germany’s economy went into a melt down. Germany suffered from hyper-inflation much as in Venezuela today. Purchase power was destroyed, jobs were lost and the populace was desperate. Germany was a parliamentary democracy and with its politicians unable to stop the meltdown, a fringe candidate was able to garner 36 percent of the electorate. It was enough to have him appointed Chancellor in 1933. Hitler had come to power. Hitler was one of those people who believed that Germany had not been defeated and Hitler had a plan to reverse the outcome of WWI. Hitler was also one of those people who did not believe in democracy and thought that a healthy society should always be at war. For the next few years, Hitler spent huge amounts growing and updating the German army. He often did this secretly so as not to show his plans. This was especially true with the air force (Luftwaffe), which Germany was prohibited from operating at all. While Germany’s army was not quite ready for battle, Hitler realized that the Allied powers were exhausted from WWI, and he gambled that they would not rise to the challenge if he shook things up. He occupied the Rhineland in 1936. It violated the Treaty of Versailles and the Locarno Treaties, but Hitler was right. Nothing happened. He then incorporated Austria in the Anschluss of 1938, and while he was still digesting that country, he convinced the Allies to give up protecting the most strategic part of Czechoslovakia, the Sudetenland. A few weeks later they took over the rest of that country. Germany’s borders were growing in leaps and bounds and as yet, not a single German soldier was wounded! Germans were ecstatic! There inflation had stopped. Their industries were growing and they were regaining their self esteem! Sure, there were some that saw the evil, but by that time democracy in Germany was dead. They had the choice of shutting up or being sent to prison. All this happened before the official start of WWII on September 1, 1939. Meanwhile… On the other side of the planet, the Japanese realized that war was coming to Europe and decided that this would be a great time for them to raid European colonies such as Vietnam, while at the same time taking advantage of the political tribalism that was going on in China. Both the WWI exhaustion and the renewed attention to Hitler’s Germany would give them a free hand as they created the Greater East Asian Co-Prosperity Sphere. In July of 1937 the Second Sino-Japanese War was started. War World One was the catalyst which propelled both theaters into war. ",
            "date": "Answered September 18, 2018",
            "views": "47",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daan Bronkhorst",
                "href": "/profile/Daan-Bronkhorst-1"
            },
            "answer_text": "The Treaty of Versaille(In extension of 1.) The French tendency to stick it to Germany after WW1The economic crisis in 1929.Bonus: a shrewd politician BE ADVISED: Long Read Ahead! The Treaty of Versaille At the end of WW1, everyone agreed on one thing: this must never happen again. World War One was to be ‘The War to end all Wars’. So, they put the thumbscrews on Germany. And boy, were they tight. Germany was allowed a military of 100.000 men maximum, 7 infantry and 3 cavalry divisions. To avoid building up large numbers of experienced ex-soldiers, they were to stay in service for a very long time. They were allowed a Navy of 6 battleships, 6 light cruisers, 12 destroyers and 12 torpedo boats. The Navy was to have no more than 15.000 men, to work in ALL positions - including coastal defence, communications, etc. And, to top it all off, Germany had to pay. Big time. The 2018 equivalent of these reparations, as they were called, is 442 BILLION US Dollars or 284 Billion Pound Sterling. To put that into perspective, in 2017 Germany had a GDP of 3.65 Trillion. The reparations would have cost almost 10% of today’s Germany’s GDP. Naturally, this was utterly impossible for a shattered, wartorn nation to pay. All in all, this greatly pissed the Germans off. Step one to a new war complete. The French Historically, the French and the Germans have always had it in for each other. They’re natural enemies. So, after WW1, the French had a great time pestering Germany. Reminding them they had to pay, and simply taking coal if they couldn’t provide money. This, also, didn’t sit well with the Germans. The Economic Crisis With the German economy shattered, there was no way they were going to pay. So, what did the Americans do: lend them money. This worked well in theory, and in the beginning: lend them some money so they can fix their shit, and once they’ve done that, they pay us back with a nice bit of interest. Then, Black Thursday happened. The stock markets plummeted, and suddenly there was no money left to send to Germany. Even worse, the US wanted their money back, which the Germans obviously didn’t have. They’d used it trying to fix their economy, but that hadn’t quite worked out yet. So, now both the US and Germany need money. But before all of this even happened, the Germans did something even more stupid. Printing money, and lots of it. More money is good, right? Well, no. The more money there is, the less rare and therefore the less valuable it is. So, printing money leads to higher prices. Printing A LOT of money (say, 496.5 QUINTILLION Marks? - this was the German currency at the time, and by 1923, the Reichsbank had given out that much of it.) leads to REALLY high prices. People collected their pay in suitcases, and when left unattended, the suitcase would be stolen - but the money would be there. Bread prices increased 800 million-fold from January to November ‘23. Bonus Round: shrewd politician! So, no military, the French (and Allies in general, to be fair) are being dicks, and everyone is poor as dirt and a bread costs a damn fortune. You’re German, and you’re right fucking pissed off. And along comes Adolf Hitler. A failed art student gone crazy. He joins a political party, and pushes all the right buttons. He forms a paramilitary support group along the way, beating his enemies into submission - and the German people love him! He promises better times, economic recovery, and restoration of the German pride. At this point, he’d used to some questionable-at-best tatics to gain power, but he wasn’t talking war or Auschwitz just yet. Things were looking good for the German people: a strong leader who knows what he wants (in retrospect, he wanted some fucked up shit. Just a shame we didn’t know until it was too late.) and the willpower to push through. He does bring jobs and income. The only problems is the way he does it. He’s building guns, ships, ammunition, anything a modern army might need. Fighter planes, bombers, you name it - the Germans were building it. And that, ladies and gentlemen, is why after World War One yet another 70 to 80 million people from all over the world died. That’s 4% of the world’s population at the time. Let us be very glad that the world has not seen such a large-scale conflict in over 70 years now. ",
            "date": "Answered January 18, 2018",
            "views": "329",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Drac Smith",
                "href": "/profile/Drac-Smith"
            },
            "answer_text": "World War II was the culmination of 3 centuries of war on the European mainland and 1,000 years of rivalry between Japan, China and Korea. In specific the punitive nature of the treaty that ended WW I created especially harsh conditions in Germany. This combined with the Russian revolution created an environment that allowed people like Hitler and Stalin to come to power. Each with their own odd idea of conquering the world, which is what European powers have been doing for thousands of years starting with Alexander and continuing on into the 1940s. European colonial power was on the wane, tensions between European nations still high from WW I. Hitler dreamed of making the whole world German and populating it with the German race. Mussolini dreamed of a 2nd Roman empire. Stalin wanted to make the whole world part of the Soviet empire. Meanwhile in the East Japan dreamed of controlling the entire Pacific, Mao was busy trying to spread Communism first to China, then the rest of the world, the UK and France were trying to protect and expand their colonies in the region. That created the tinderbox. The sparks that set it off were a weak Japanese emperor who allowed a silent military coup that made him a figurehead and allowed the Japanese military elite to embark on conquest in the 1930s. Weak and timid leadership in France and England just emboldened Hitler and Stalin. Once they got a taste of success they kept going. Hitler’s betrayal of Stalin and invasion of Russia was a critical turning point which threw the Soviets into the Allied camp after they’d worked closely with and allied with the Nazis initially. Prior to that the Soviets were all about expansion and they used WW II to take over most of Eastern Europe. In China the civil war opened the door for the Japanese invasion. Continued fighting between the 3 major factions kept China weak until it was too weak and divided to throw back the Japanese invasion. Had the UK or France had real leadership prior to WW II starting, and not tried to placate Hitler, then the European war could have probably been averted or at least delayed for decades. The Soviets would have remained bottled up and probably failed as a state before 1950. The UK could have effectively countered Japanese aggression in parts of Asia and the US would have eventually been dragged in and helped push Japan out of China. ",
            "date": "Answered July 3, 2019",
            "views": "213",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abubakr Jamal",
                "href": "/profile/Abubakr-Jamal-3"
            },
            "answer_text": "After the humiliation of defeat in WW1 the German people had been through a terrible economic crisis; there were no colonies to drain to compensate the damage the war, pandemic and reparations did. They were angry at the rich and powerful and radical parties began to gain a foothold even as the economy limped back to normalcy. Uprisings were occurring throughout the 1920s. Capitalist forces and conservatives were looking for someone to fight the rising strength of the Communists and with the help of an influential banker they found Hitler and his NSDAP, who had become popular by blaming the Jews and Leftists for “stabbing Germany in the back” during WW1. They enabled his further rise to power, allowing his paramilitary to reign terror on Communists and promoting him to Chancellor. In 1933 he used a staged attack on the Reichstag to outlaw the Communists, and followed that up by targeting the Socialists and trade unions, unleashing the might of the state on them. Hitler believed that one race was superior to all others - the Aryan “master race” - and envisaged the Aryan race taking over the world and gaining breathing space by ridding it of the impure “subhuman” races - Jews, Blacks, Gypsies, the works - as well as disabled people and the people he believed worked for the Jews (Communists because Marx was Jewish). He began to build up the military while enabling harsher and harsher laws against his enemies and seizing complete power. In one night he murdered the entire opposition within his own party. Once he had a powerful military, he began to ally with other fascist empires looking to expand their influence - this became the Axis, between Germany, Italy and Japan. He then began to annex neighboring countries. This was against the rules of the League of Nations, but the superpower members were exhausted by WW1 and hoped that Hitler would start a war with their rival and his ideological enemy, the USSR - this led to a policy of “appeasement”. The USSR attempted to ally with France but when that didn’t happen Stalin allied with Germany; this startled the UK and France, who made a pact with Poland that they would wage war on anyone who attacked the country. The Germans attacked nonetheless; two days later the UK and France declared war. This is considered the beginning of WW2. Two weeks later the Soviets attacked Poland from the East and split the country, and then invaded Finland in order to extend their borders against a potential invasion. [Aftermath: The Germans surprised the world by sweeping through Western Europe and annexing France in a matter of months, using their advanced method of mobile warfare. They began a bombing and submarine campaign to beat England into submission; their allies Italy began to attack British territory in North Africa and Japan began to attack the British in Southeast Asia from annexed parts of China. Britain held firm and Hitler turned to the East, launching history’s largest land assault on June 22 1941 against the Soviet Union. While the Germans made huge inroads and inflicted millions of casualties on the Soviet Red Army, they were forced to lay siege to Leningrad and delayed and stopped inches from Moscow by fanatical resistance. A crippling winter set in and they were rolled back by a Soviet offensive; they turned to the oil-rich Caucasus, and advanced on Stalingrad, a key town in the region. Japan launched a surprise attack and crippled the US fleet at Pearl Harbour on December 7 1941. This brought the USA into war against the Axis but allowed the Japanese to sweep through East Asia, driving the British back to India. Italian and German troops were winning in Africa and threatening the Middle East. The British overcame the German submarine threat and defeated the Germans and Italians at El Alamein in 1942, turning the tide in North Africa. The Americans intercepted and defeated the Japanese Navy at the Coral Sea and Midway. At Stalingrad the Soviets held off the Germans in a brutal battle and counterattacked, destroying the elite 6th Army and throwing the Germans back. The Germans attempted to attack again at Kursk in 1943 but were beaten decisively and the initiative shifted to the Red Army. The North African campaign was in a shambles and the Allies had taken Sicily. Japan was struggling to hold on to its territories. The USSR, USA and UK began to work together on the downfall of the Axis. Stalin demanded a second front be opened in Europe. This led to an American-British invasion of Italy that slowed to a crawl, and then a massive invasion of France on June 6. Weeks later the Soviet Union launched Operation Bagration, wiping out three German Armies and all but securing victory. The UK and USA began to push the Japanese out of its territories and Italy fell. A belated attempt by German panzer groups to surprise the Allies in December failed and the Soviets conquered most of Eastern Europe, including Poland. Berlin fell in May 1945, Hitler shot himself, the USA dropped nuclear weapons on Japanese cities as the Soviets annexed Manchuria, Japan capitulated and the war was over. Hitler’s ideology had taken a horrific toll. During the invasion of the USSR special units liquidated millions of people considered subhuman in German territory. Later on these people were shipped inwards, where the fit would be worked to death while the rest would be gassed dead. 17 million were butchered. The Japanese were also cruel, killing 14 million in China and Southeast Asia. The leaders of the Axis stood trial at Nuremburg and Tokyo as well as small scale trials in the camps.] ",
            "date": "Answered August 3, 2020",
            "views": "102",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Utkarsh Raizada",
                    "user_href": "/profile/Utkarsh-Raizada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Marshall",
                "href": "/profile/Andrew-Marshall-116"
            },
            "answer_text": "After WW1, the German economy was in a ruinous state. Four years of blockade had caused widespread shortages, and many of the civilian population were starving. The Treaty of Versailles imposed what were seen as humiliating peace terms, and the allies, particularly France, demanded payments of punitive sums in reparations for war damage. The result was hyperinflation and economic hardship for most Germans. At the same time a myth was actively promoted by right wing ultra-nationalists, many of whom were ex soldiers returning from the western front after the armistice, that the army had not been defeated on the battlefield, but had been “stabbed in the back” by elements back at home. Initially the Weimar politicians were blamed, but communists and Jews soon became scapegoats as well. The resulting political instability allowed the ultimate rise to power of Hitler and the Nazis. Once in power, Hitler ruthlessly suppressed opposition. Also his early economic policies stimulated growth and employment, and improved the lives of ordinary Germans and he promised a return of national power and pride. However, to deliver on his promises he needed to expand, and being the ruthless dictator he was, his preferred means of doing this was by way of bluff, threat and outright force, annexing or occupying countries to the east of Germany, starting with the Anschluss with Austria, then the Sudetenland, Czechoslovakia, and finally, what was for Britain and France a step too far, Poland, thus precipitating WW2. ",
            "date": "Answered January 15, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raunak Tolani",
                "href": "/profile/Raunak-Tolani"
            },
            "answer_text": "First world war-After thenfirst world war, many humiliating sanctions were imposed on defeating nations by victorious nations.Bankruptcy of nations due to WW1- War destroyed many industries, houses etc. Which caused hatred amongst the people. People became unemployed, there were the problems like inflation etc.Rise of the dictators-The democratic government weren't able to tackle the problems caused due to world war. The people in some countries like Germany and Italy were fed up with the democratic government and saw the dictators as their liberators.also all the problems would be solved though military means, keeping this in mind the people favoured for rise of dictatorship.The Versailles treaty-Weimar republic (government of Germany) agreed to the humiliating treaty imposed by the victorious countries, thus the people and army of Germany were against the government. Thus, Hitler came into power with the support of the people and he assured the people that Germany will get back the glory which it has lost in the war.Inferior treatment of Japan in Paris  peace treaty-Japan was one of the victorious nations of the 1st world war. It got benefit in the Paris peace treaty. But the then president of America Mr. Hardings convened a meeting in Washington. Through this meeting Japan was declined it's benefits. When Japan attacked the indo China region, America had put economic sanctions on it. Japan was the victim of the great depression of 1929.and you know what happened in world war 2 due to the tension between America and Japan.Failure of League of Nations-League of nations weren't able to control the rising dictators and wars.It lacked in arms and ammunitions to punish the guilty nations. Rejection of America was also one of the cause due to which the league of nations had to close it's office.Germany (A God made nation)-Hitler thought that Germany was a God made nation and it was the divine rule that Germany should rule the world with Hitler as it's emperor. Thus Hitler started the war by attacking Poland. ",
            "date": "Answered June 17, 2015",
            "views": "803",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Theodorakopoulos Nikos",
                    "user_href": "/profile/Theodorakopoulos-Nikos"
                },
                {
                    "user_id": "Tonmoy Podder",
                    "user_href": "/profile/Tonmoy-Podder"
                },
                {
                    "user_id": "Dylan O'Donnell",
                    "user_href": "/profile/Dylan-ODonnell-8"
                },
                {
                    "user_id": "Ryu Lim",
                    "user_href": "/profile/Ryu-Lim-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayank Srivastava",
                "href": "/profile/Mayank-Srivastava-250"
            },
            "answer_text": "To answer this question, it is imperative to learn about the prevailing atmosphere in the aftermath of WW1. Germany was defeated in WW1 by The Allies. Though Britain and France emerged victorious in the War after the intervention of the US, but war had already crippled the economy of both the nations and ruined their military prowess. Besides this,they didn’t want Germany to rise its head again. With this in mind, the victorious Allied Powers met at the Paris Peace Conference (January 1919) and by June 1919, the conference had come up with the Treaty of Versailles for Germany, the chief aggressor in the Central Powers. The terms of the Treaty:- Germany had to lose its territory in EuropeAlsace-Lorraine to FranceEstonia, Latvia and Lithuania, which had been handed over to Germany by Russia by the Treaty of Brest-Litovsk, were taken away from Germany and set up as independent states.This was an example of self-determination carried out in practiceWest Prussia to Poland, though Danzig (the main port of West Prussia) was to be a free city under League of Nation, as its population was wholly German2 Germany’s African Colonies were wretched from it and became protectorates of League of Nations 3. German armaments were restricted to maximum of 100000 troops and no conscription (compulsory military service) no tanks, aircrafts, submarines and battleships. The Rhineland was to be permanently demilitarized 4. The War Guilt clause squarely blamed Germany and its allies for the outbreak of war. Germany was asked to pay the reparation for damage done to the Allies to the mammoth tune of £ 6600 million 5 A League of Nations was formed with the aim to settle international disputes to prevent wars in future These above terms and clauses caused great resentment and grievance among the Germans who were not allowed to discuss the terms and conditions of the Versailles Treaty. Some historians believe that some of the objections raised by the Germans were justified and it would have been reasonable to allow them to take part in discussions. The little concession, if given, would have certainly deprived the Germans of the argument used by Hitler that because the peace was a ‘Diktat’, it should not be morally binding. Another grievance among the Germans was that right from the start of the conference, Allies had pressed for all nationalities to choose which country they wanted to belong to. But this principle was applicable only to non-Germans, as the clause left millions of Germans under Poland, 3 millions Germans along the frontiers with Germany and Austria( an area know as Sudetenland) in Czechoslovakia. Besides this, Austria was a completely German state. All these Germans wanted to become part of Germany, but the unification was forbidden as it would have made Germany a larger and more powerful than in 1914. Now comes the protagonist, Hitler He aimed to make Germany again the great power by bringing all German-speaking people inside Germany. He hated the Versailles Treaty for its gross injustice and wanted the avenge the humiliation and disgrace the Germans were subjected to by the Allies. The International climate in 1930s gave Hitler the opportunity to implement his dream of making Germany great once again. During this time, affairs were dominated by three belligerent powers-Japan, Italy and Germany; their extreme nationalism made them commit so many acts of violence and breaches of agreements that led world into WW2. Japan became the first aggressor with its invasion of eastern China , known as Manchuria, 1931. Both Hitler and Mussolini noticed the failure of League of Nations to curb this Japanese aggression. Taking the cue, he began cautiously with the reintroduction of conscription(1935). This breach of Versailles caused Britain, France and Italy to come together and signed treaty. In June 1935, the Hitler signed the Anglo-German Naval Agreement by offering to limit the German navy to 35 % of the strength of British Navy. British logic was since Germans were already breaking Versailles by building a fleet, it would be better to have German navy atleast limited. Mussolini, encouraged by the Japanese and German successes, invaded Abyssinia(Ethiopia). The League condemned the invasion and slapped economic sanctions; but these were useless because they didn’t include banning sales of oil and coal to Italy. Reasons for this weak stand against Italy were that Britain and France were economically and militarily unprepared for war and and therefore followed the policy of appeasement with the aggressors-Japan, Italy and Germany. but Mussolini was aggrieved with sanctions anyway and began to draw towards friendship with Hitler, who had not criticized the invasion and nor slapped any sanctions. Sensing all these, Hitler sent troops into Rhineland, which had been demilitarized by the Versailles Treaty; Britain and France again merely protested and took no action to expel the Germans. With Mussolini greatly impressed by Hitler, the duo signed Rome-Berlin Axis in October 1936. By now, it was clear that the League of Nations was toothless and ineffective while France and Germany unprepared for any war. Consequently, Hitler, now certain that the Italians would not object, carried out his most ambitious project to date-annexation of Austria in March 1938. next he turned his attention to Czechoslovakia and demanded Sudetenland, an area containing 3 million Germans, adjoining the frontier with Germany. When Czechs refused Hitler’s demands, British PM Chamberlain anxious to avoid war at all costs took up Hitler’s invitation to a conference at Munich (September 1938), at which it was agreed that Germany should have Sudetenland but not whole of Czechoslovakia. War seemed to have been averted but the following March, Hitler broke this pact and sent German troops to occupy Prague, Czech capital. With this comes the flashpoint: The Germans resented the loss of Danzig and Polish Corridor at Versailles, so Hitler demanded the return of Danzig and a road and railway across the corridor , linking East Prussia with the rest of Germany. This demand was , infact, reasonable since Danzig was mainly Germany speaking; but this coming immediately after the taking over of Czechoslovakia, the Polish were certain that the German demand of Danzig and Corridor would culminate in its invasion. When Poles rejected Hitler’s demands , Britain and France promised to help Poland if Germany attacked. Hitler didn’t pay attentions to their threats and after signing a non-aggression pact with Russia (August 1939), the Germans invaded Poland on 1 September. Britain and France accordingly declared war on Germany. Rest followed suit.  ",
            "date": "Answered January 12, 2020",
            "views": "255",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yosapat Thaohirun",
                "href": "/profile/Yosapat-Thaohirun"
            },
            "answer_text": "How did the Second World War really start? As David Nazzaro had stated, it all started (well, can be sourced) at the Treaty of Versailles and its rather harsh conditions for Germany. That or the failure of an international organisation, the League of Nation But if you really want to know where the Second World War started, then I would like to say that the it started when mankind was born. Our greed and selfishness caused it. Hell, the invention of the weapon and the ability to seize what we want, when we want, with brute force probably contributed it. I’ll indulge you when each nation joined the war. Because a world war can really only start when the entire globe is engulfed in the flames of war. Germany: either from the Treaty of Versailles, the triumphant of the Nazi Party, or the expansion of the German Reich with the anschluss of Austria in 1938. Also a whole lot of events. Japan: the occupation of Manchuria and it’s renaming to Manchuko. I bold this as this is the earliest event to cause the downfall of the League of Nation. Occurred in 1931, the League failed to stop it. Also caused the downfall of the Japanese Civilian government and rise of the Army. Italy: the Invasion of Abyssinia in 1935. Again, League failed. Britain: failure to stop Japan or Italy. Caused the name of the League of Nation to be shamed. Although I can hardly blame them, the League was drawn up by the United States and they didn’t join. Also when they gave in to the policy of Appeasement. France: either when they keep pushing for extremely harsh conditions on Germany after the First World War or when they got invaded after the German’s ‘amazing’ bypass of the Maginot Line through Belgium. Your pick. Spain: Spanish Civil War. And the nationalist Spanish won - with the aid of German support. Russia: when they invaded Poland as per terms and agreements on the Molotov-Ribbentrop Pact (otherwise known as the Nazi-Soviet Pact) China: when they got invaded by Japan in 1931. United States: either how you perceive when a war starts; by hostile action, on April 10, 1941 when the USN Niblack attackd a German U-boat. Or by hostile destruction, on 14 September 1941, resulting in the destruction of a German weather station by USCGC Northland. Aside from that, they didn’t join the League of Nations. Or when they got attacked in Pearl Habour by the Japanese on December 7. 1941 (the latest date). When the US joined the war, the European War truly became a World War. Otherwise it would have just been the European War or the Asian War. tl;dr how did the Second World War start? When the Japanese attacked Pearl Habour and bought the United States into the war. ",
            "date": "Answered April 4, 2017",
            "views": "837",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie Van Dongen",
                    "user_href": "/profile/Charlie-Van-Dongen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allan Davis",
                "href": "/profile/Allan-Davis-36"
            },
            "answer_text": "Great question. The immediate cause was the Nazi invasion of Poland and the promise of the Britain and France to declare war on Germany if Poland was attacked, which they did. But the immediate reason was preceded by long planning and plotting by the US, Britain, and the Zionists, who wanted the war. Homer Lea iwrote n 1912 in ‘Day of the Saxon’ There can be no retention of present British sovereignty without the repression of territorial and political expansion of other nations - a condition that must culminate in war, one war if the Empire is destroyed, a series of wars if it is victorious. At the beginning of the 20th century Germany became a threat to the British Empire, and that was the underlying reason for WW I. Good reference - ‘Century of War’ by W. Engdahl At the end of WW I Germany was carved up and lost territory and population. German attempts to regains this territory and population would lead to WW II. Also, at the end of WW I a communist revolution had taken over Russia, and a communist revolt had been crushed in Germany. Jews dominated the communist governments, The Jewish Role in the Russian Revolution, and the Jews were very active in post-war Germany, in the financial sphere, in politics, and in culture. Hitler detailed his reasons for hating the Jews in Mein Kampf. For more details see Allan Davis's answer to Did Hitler really hate Jewish people, or was he just using them as scapegoats to propel his extremist views? In 1933 the worldwide Jewry declared economic war on Germany,  So, the pieces are now in place. Britain’ s desire to crush opposition, Germany desire to regain WW I losses, and the hatred between the Nazis and the Jews. The Nazis wanted to regain lost territory and they wanted to get the Jews out of Germany, and the US, Brits, and Zionists wanted a war to destroy Germany. The proximate cause of the war was the city of Danzig, which contained mostly Germans, but was controlled by Poland. Hitler hoped to sign a treaty with Poland to stand in opposition to the Bolsheviks in Russia, he had no desire to conquer Poland. But at the same time, he wanted to regain German control over Danzig and tried for one year to get control from Poland. The lengthy negotiations Germany employed to regain control of Danzig, and the machinations of the Nazis, British, and Poles, are detailed in ‘Churchill, Hitler, and the Unnecessary War’ by Buchanan, and ‘The War that Had Many Fathers’ by Shultze-Rhonof, both essential. Roosevelt and the Zionist’s role in recounted in President Roosevelt's Campaign To Incite War in Europe. The short version is that the British, US, and Zionists all urged the Poles, who didn’t need much urging, to remain intransigent ever though Hiler’s demands were just and reasonable. From Buchanan’s book Chamberlain also believed Danzig should be returned. As Taylor wrote, “The British cared nothing for Danzig, or, if they did, sympathized with the German case.”15 Lord Halifax considered Danzig and the Corridor “an absurdity.”16 Indeed, of all the German claims to lost lands, the claim to Danzig was strongest. It had always been a German city. Its population was 95 percent German. Any plebiscite would have produced a 90 percent vote to return to the Fatherland. And Britain had no objection to Danzig’s return, as long as it came about peacefully through negotiation, not violently through military force. On Danzig, the basic British and German positions were almost identical. Both wanted its peaceful return to Germany. WW II was the result. ",
            "date": "Answered June 1, 2018",
            "views": "888",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shashi Jindal",
                    "user_href": "/profile/Shashi-Jindal-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Jindal",
                "href": "/profile/Nikhil-Jindal-83"
            },
            "answer_text": "The question can be answered by describing two set of factors- the necessary but insufficient factors and the precipitating factors. The necessary but insufficient factors include: 1. Treaties such as the Versailles Treaty and the Munich Agreement, which either caused resentment among European countries or tried to unsuccessfully appease the aggressive powers. 2. The failure of the League of Nations and the concept of ‘Collective Security’. 3. The global economic crisis spurred by the Great Depression in America, as it led to the rise of Hitler and other Fascist powers. The factors which proved to be the precipitating causes for the war included - Hitler and Germany’s imperialistic tendencies, the Policy of Appeasement followed by UK& others and the role of USSR. These are detailed in the following text: 1) Hitler’s Role a) He attacked Poland on all fronts, rather than just capturing the Polish corridor and Danzig, which were parts of his demands to Poland. This act of Hitler showed that he desired destruction of the whole of Poland and not just restoration of the territory lost after the Treaty of Versailles. b) Hitler wanted to destroy Russia and use its territory for his Lebensraum or ‘Living Space for the Germans’. The concept of Lebensraum has been explained earlier. Capturing Poland was an important prerequisite for an eastward march towards Russia. The Non Aggression Pact of 1939 with Russia was just for keeping Russia neutral, while Hitler took Poland. He did not want a war on two fronts viz. against the Western powers (who would come to the aid of Poland) and Russia. The evidence of Hitler’s desire for occupying Russia comes from the Mein Kampf (My Struggle) and an unpublished secret book that he wrote in 1928. If this theory is right, then Appeasement cannot be blamed. It can be said then, that the appeasement only made Hitler’s goal achievement easy. Also then the German people cannot be blamed and responsibility for the World War II lies only with Hitler. c) Yet, it can be said based on general opinion of various scholars that Hitler cannot be blamed for the World War II. He only wanted a localized war. He did not think that Britain and France would honour their guarantee of Polish frontiers when they had abandoned Czechoslovakia, where too, Hitler’s actions were unjustified. He thought that Poland and Russia being weak, would be quickly defeated through the German Blitzkrieg i.e. a swift and violent military offensive with intensive aerial bombardment. d) Also, it can be argued that Hitler was an opportunist and went ahead with occupation of the Czechoslovakia (minus Sudetenland) in 1939 only because there existed an opportunity in form of poor law and order situation due to demand for semiindependence by Slovakia. 2) The Role of Appeasers: The appeasers share the blame equally with Hitler. The Policy of Appeasement raised Hitler’s prestige at home. After Hitler was offered Sudetenland on a plate in Munich Conference (1938), Hitler was convinced of British and French inaction when he invaded Poland in 1939. Also, it can be argued that the British Prime Minister Chamberlain picked a wrong issue to act militarily against Germany. Danzig and Polish Corridor were more genuine demands than Sudetenland. This was so because in Danzig the Germans formed 95% of the population and the Polish corridor was important for connecting East Prussia with the rest of Germany. The British justification for Munich Conference (1938) - that it chose to appease Hitler because it needed time for rearmament - is hard to digest since Czechoslovakia was militarily strong and had excellent fortifications in Sudetenland against a Germany invasion. Thus, Czechoslovakia would have formed a better ally when it had Sudetenland than Poland. Also, the inaction during annexation of the rest of Czechoslovakia is condemnable. 3) The Treaty of Versailles and the German People: It can be argued that without the support of the German people, the rise of Hitler would not have been possible. Hitler did not do any coup to come to power and rather he came to power through a democratic process of elections. He headed the Nazi party that fought elections and won a good number of seats. It can be said that Hitler said those things, which the Germans wanted to hear. His propaganda against the Treaty of Versailles capitalized on the anger among the Germans against the humiliation the treaty brought. The German public thus approved of Hitler’s action. But it can be said that the public was responsible for the rise of Hitler but it cannot be blamed for the atrocities Hitler committed. There was a Department of Propaganda, which continuously brainwashed the Germans and fed them with antisemitic views. The school curriculum was changed accordingly. Hitler stoked the public phobia towards communism and thus manipulated them in his favor. The weak politicians before the rise of Hitler who worked only in self interest and did not stand up against Hitler are also to blame. The German capitalists contributed monetarily to the Nazi party as it helped restore law and order. The people and businessmen supported Hitler because he ensured law and order stability and because they were against communism in general. 4) Non-agression Pact between USSR & Germany: It can be argued that USSR made world war inevitable by signing the Non Aggression Pact of 1939 with Germany. Had this not happened, the German aggression would probably have been nipped in the bud. The activities by Comintern in India and other British colonies were also responsible for the distrust. In their defence, the Russian scholars argue that Russia knew that it would be attacked in future and thus needed the pact to buy time to bolster its defences. 5) Distrust between USSR and the would-be Allied Powers: This was also a reason. The conservatives in France and Britain were more suspicious of communists in USSR than the Nazis. The right wingers in France were sympathetic to Hitler and in awe of his achievements. The conservatives in France prevented addition of a clause for Military cooperation in the agreement signed by France and USSR in 1935. If the military alliance between the two had materialized then Germany would have been defeated in a localized war in Eastern Europe or it might have not ventured into a war at all. ",
            "date": "Answered May 21, 2020",
            "views": "258",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charles Temm Jr.",
                    "user_href": "/profile/Charles-Temm-Jr"
                },
                {
                    "user_id": "Jarod Brown",
                    "user_href": "/profile/Jarod-Brown-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Poole",
                "href": "/profile/Bob-Poole-23"
            },
            "answer_text": "WWII on the European side was caused by the Versailles treaty, Wilson wanted to go easy on Germany after the Armistice, but France and Britain wanted revenge and reparations for the cost of the War and imposed punishing sanctions. The belief in Germany after the war was “We were betrayed on the home front, the troops never surrendered.” This theme was played on by a paper hanger named Hitler who tried to overthrow the German Weimar Republic in 1923 with his beer hall punsh in Munich. While in Germany during the Roaring 20’s he didn’t get much traction although the brownshirts and the communist did fight in the street though. After the Great Depression hit and Germany under the reparations imposed couldn’t pay the debt so they started devaluing the currency and the resulting depression with many out of work, people started believing Hitler because he promised their pride back and put people to work, The War in the Pacific was a bit different, during WWI Japan was an Ally mostly because the British and the Japanese were close., but after the War, the various Allied government tried to limit the cost of capital ships, which was one of the arm races that spurred the resulting clash in WWI. The allies pushed on the Japanese the 5–5–3 division for battleship tonnage and they capped the tonnage of battleships and cruisers. The Americans and British were the “5” and the Japanese were “3”, and this pissed the Japanese off. This didn’t help that the Japanese Army and Navy didn’t play well together, the relationship was “Frosty” at the best of times, usually relying on the General Staff to break deadlocks. Well anyway the Japanese Army wanting to expand the sphere of influence and the Army and the industrialist viewed China as a huge resource area and the Japanese Army invaded Manchuria in 1931 and later the “Marco Polo Bridge Incident in 1937 sparked the 2nd Sino-Japanese war, and the resulting brutality was savage and drew the attention of the United States. If I made any mistakes, bear with me, this is by memory. ",
            "date": "Answered March 22, 2020",
            "views": "221",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Glossop",
                    "user_href": "/profile/John-Glossop-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Taylor",
                "href": "/profile/Paul-Taylor-431"
            },
            "answer_text": "Very hard to state absolutely. There are numerous motivations between the various players/leaders. Certainly the background to Germany’s motivation vs Japan’s is very different! Japan, for example, gained a great deal from Versailles, despite the way they saw it and spun it. Their (rejected) call for “racial equality” wasn’t sincere. They didn’t treat the Koreans, or the population of Formosa (Taiwan) as equals, and imposed their own immigration ban on the Chinese! They clearly had no intention of changing any of this. And unlike Germany, they not only were on the winning side, but they also escaped the huge loss of life and massive debts that the other victors (USA apart) took as the price of victory. Japan had probably already set her sights on becoming the hegemonic power of East Asia (if not Asia in its entirety) and used the alliance with Britain as an excuse to seize German claims in China and the Pacific, knowing that Germany was in no position to retaliate. After that, the link with Britain may well have been seen as an impediment to Japanese ambitions, particularly since it was clear from the outset that the alliance did not include war against the US. By contrast, Germany LOST WWI, and it’s Generals helped to foster the “stab in the back” propaganda, to push the blame for the defeat onto others. It was very easy to blame Germany’s post war problems on the defeat, and therefore believe that reversing this defeat would solve all these problems. About all you could say for those two is that for Japan, the War led to easy pickings at little cost, whilst the German’s blamed all of their woes on defeat, and which then led to the idea that a win would have solved all the problems (which ignores the economic problems Britain and France had in the 1920’s). But, as you can see, unless you want to blame WWI, this does not give a single explanation, since all 3 axis powers, let alone countries like Hungary, Romania and Finland, had very different experiences in WWI. So if you want a single cause for WWI, something that cause the move to war, and without which there may not have been a WWII, I would suggest the Great Depression! In the 1928 election, the last one before the Depression in Germany, the Nazis got 2% of the vote. In 1930, they got over 20% in their “break out election”! Similarly Japan switched to militarism to seek expansion, first in Manchuria, and then in China proper, to solve their economic issues as well as for pure imperial expansion. The Depression led to massive protectionism (even Britain, wedded to free trade since the 1840’s switched to a protectionist system); the US also went off the gold standard, lowering the value of the dollar, and making imports more expensive and exports cheaper. This was to keep as much of the domestic market for domestic industries as possible. But this made things harder for countries like Germany and Japan, which needed to trade for essential commodities: this helped make the case in these countries that the “solution” was to seize territories that contained these commodities. This, of course, suited old imperialist ambitions held by many, and in Japan, meant a military as opposed to a civilian solution to the economic problems. The Depression also, at least initially, helped to slash defence budgets in Britain and France, making them militarily weaker, and less able to respond. The cry was “butter before guns”. So I would suggest if you want a SINGLE cause, then the Depression would be it. The crisis, and the response to it. It helped the militarists to win the argument in Japan that military action in seizing territory in Asia and the Pacific was THE solution to the problems Japan had. Without the Depression, the risks and costs of war may have been enough to prevent the country embarking on the course they did. In Germany, there is little doubt that the economic crisis is what brought the Nazis to power: a regime and leader committed to military expansion. The Italian situation is a bit more ambiguous. Mussolini may have been bitter about the “betrayal” by Britain and France. But he’s real aim was to seek to expand Italian power, in his own mind rebuilding the Roman Empire! And his alliance with Germany was really about creating the situation to expand the Italian Empire. In fact despite the “Axis Pact”, in late 1939 and early 1940 he was sending proposals to the Allies that he join them AGAINST Germany, and giving a list of territories he demanded as his price! So no Great Depression, then no Second World War, at least not starting in the late ‘30’s! Germany had been able to slowly remove many of the impositions of Versailles: for example removing French troops stationed in the Rhineland, and a significant renegotiation of the reparations. And they would probably have been able to do more in coming years, especially if the West became more concerned by the size and arms of Stalin’s Red Army. ",
            "date": "Answered July 21, 2020",
            "views": "240",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ssebatta Johnnadi",
                    "user_href": "/profile/Ssebatta-Johnnadi"
                },
                {
                    "user_id": "Nuha Ansari",
                    "user_href": "/profile/Nuha-Ansari-1"
                },
                {
                    "user_id": "Obasi Kenneth",
                    "user_href": "/profile/Obasi-Kenneth-1"
                },
                {
                    "user_id": "Joel Parker",
                    "user_href": "/profile/Joel-Parker-7"
                },
                {
                    "user_id": "Paul Feist",
                    "user_href": "/profile/Paul-Feist-5"
                },
                {
                    "user_id": "John John",
                    "user_href": "/profile/John-John-774"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaroslaw Moszkowski",
                "href": "/profile/Jaroslaw-Moszkowski"
            },
            "answer_text": "The WW2 started because some very powerful nations were willing to risk war in order to meet their goals. These goals, supported by the majority of political elites in Germany, Soviet Union and Japan, were the main reason the war started:1) Germany was looking to expand from the beginning of the 20th century. Their goal in WW1 was to destroy France and Russia as great powers of Europe and create the chain of puppet, colony-like countries in the Central Europe (Mitteleuropa). Germans were humiliated by their failure in the WW1, and they have never accepted the Treaty of Paris. If not Hitler, another leader would emerge to revenge the defeat and take lands that they believed to belong to them. So the war in Europe was inevitable, but it would not be a world war, if Hitler was not allowed to fight series of one-front-wars in 1939 and 1940. If France and UK supported Poland in September 1939 as they were supposed to, the war would be over by the end of that year. Also it would not be a world war if not Soviets. 2) Soviet Union had never given up plans to export revolution into Europe. It was a common conception among Bolsheviks and Stalin was not an eagle among them (Socialism in One Country). However, till the end of 1930's the allied Poland and Romania had armies powerful enough to make a barrier against it (Poland proved its strength in 1920 - Polish–Soviet War). The best chance for European revolution would be another war between \"capitalists\". He hoped that as WW1 led to the victory of revolution in Russia, another bloody war would cause the revolutions in Central and Western Europe. The Soviet Union with its powerful army would be just around the corner to intervene. Therefore in August 1939 Soviet Union signed the Ribbentrop-Molotov pact that encouraged Germans to attack Poland. Without the alliance with Soviets, Germans would not be able to import all necessary materials to maintain its military and feed its population.3) Japan was trying hard to create the empire in East Asia since the end of 19'th century and China was it's main obstacle (Second Sino-Japanese War). It was yet not possible for Japanese military to expand war into South-East Asia after European colonists were either overrun by Germany (France and Netherlands), or had to fight heavy wars (UK). European war caused by politics of Germany and Soviet Union and Asian war caused by Japanese imperialism together made the WW2. ",
            "date": "Answered April 30, 2015",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carolina Farias",
                    "user_href": "/profile/Carolina-Farias-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Trevethan",
                "href": "/profile/Lawrence-Trevethan"
            },
            "answer_text": "It depends on one’s point of view. Chronologically, WWII begins in Asia, with the Japanese invasion of China. From 1937 until 1945, the war is continuous there. KMT China failed to defeat the invaders in pitched battles, losing its entire air force, navy and the German trained first line army units, so it adopted the policy that the USA was “the last, best hope for China” - and ultimately maneuvered successfully in ways that resulted in Japan being embargoed for oil, iron ore and rubber - something Japan could not sustain - causing it to attack the US in Hawaii and the Philippines, as well as Malaya and the Dutch East Indies. This was not unrelated to the War in Europe, however. Japan acted in the context of a series of European crises, and believed that the great colonial powers were too tied up to resist its expansion in both China and SE Asia. Italy had engaged in colonial expansion into Africa and created the Fascist (nationalist socialist) political movement, which Germany (Spain and Argentina) imitated. German nationalism was fueled by the unjust conditions ending WWI which had led to hyperinflation. Curiously, Thailand (renaming itself partially in English, formerly having been Siam) went through a similar nationalist policy and willingly joined Japan (something generally misrepresented in history). And the USSR played both sides, and probably intended to march Westward once it recovered from the self-imposed disaster caused by its massive purges. It is an extremely complex conflict, the most savage and costly in history. If “terror bombing” was first used by Japan (on China), it ended up being used massively by the US and UK, deliberately causing firestorms (which killed more people than atomic bombs did) as well as the only combat use of nuclear weapons in history - use on cities which violates the formal definitions of the nominal law of war (which forbids destruction of cities or attacks on population centers). For even handed histories, see Armageddon (Clive Owen) or Total War (Calvocoressi et al) or Blood, Tears and Folly (Len Deighton). ",
            "date": "Answered October 24, 2017",
            "views": "189",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Emily Hammond",
                    "user_href": "/profile/Emily-Hammond-20"
                },
                {
                    "user_id": "Michael Lopez",
                    "user_href": "/profile/Michael-Lopez-168"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kohan",
                "href": "/profile/John-Kohan-3"
            },
            "answer_text": "The short answer is 1 Sept 1939 when Germany invaded Poland. The intermediate answer is the Treaty of Versailles that ended WWI or the long answer which is the Franco-Prussian War of 1870. Most WWII history books do not go back far enough to find the real reasons that led up to WWII. The Franco-Prussian War of 1870 was the first war fought by basically a unified Germany ruled by Prussia and France. Eventually, German Forces defeated numerous French armies in a series of battles leading to a German siege of Paris. The French felt humiliated by being beaten at the hands of Prussia. Still remembering the humiliation of the Franco-Prussia War, the French were determined to seek revenge at the Treaty of Versailles that ended WWI. The conditions demanded by France against Germany were very extreme, especially the condition that Germany pay reparations for the cost of the war, and giving up areas that were part of Germany’s industrial base. The effect of this was wide spread economic disaster for Germany and uncontrolled monetary inflation that made German money worthless. This situation caused starvation in Germany, and the rise of radical organizations like the Nazi’s and the Communist seeking to control Germany. The Nazi’s won and gained control of the Germany. Hitler’s revenge against France was for the French to sign their surrender in the same location (Versailles), where the French had the Germans surrender in WWI. To add additional insult to the French, Germany occupied France and headquartered their occupation headquarters in Paris. The Germans also demanded payments in resources and manpower from the French. As a side note, the allies in WWII did not demand unreasonable economic concessions from the defeated Axis countries. The United States led the rebuilding process of their former enemies, especially through the Marshall Plan. This in-turn developed into the economic vibrant democratic Western Europe when have today. ",
            "date": "Answered June 12, 2019",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charlie Armstrong",
                "href": "/profile/Charlie-Armstrong-12"
            },
            "answer_text": "World War II started for the same reason most other wars were started: To gain land, power, and resources. World War II is most often noted to be started by Nazi Germany, in their invasion of Poland. Lead by Adolf Hitler, Germans desired to take revenge on the evil nations that humiliated them after their defeat, through the Treaty of Versailles. This was at least what they were convinced they wanted by Hitler. Hitler believed Germany, specifically Aryans, to be the greatest race of humans on Earth, and lead World War II following the belief that Germany needed more “living space,” or Lebensraum, as it was called in Germany. Hitler, in his rise to power, also needed a scapegoat to blame Germany’s failings upon. The Jewish were chosen to be that scapegoat. This of course lead to mass homicides of the Jewish in Europe, known today as the Holocaust.  World War II didn’t just take place in Europe though. Imperial Japan also was a major Axis power, fighting China in East Asia. Most historians agree that the main reason that Japan declared war on China in World War II was in order for Japan to not suffer the same fate China did when they were humiliated by Western powers. In order for Japan to retain it’s pride as a powerful nation, they needed to rapidly industrialize, and due to the fact Japan is naturally resource poor, they needed to conquer the land to industrialize. This lead to Japan’s aggression against China. World War II wasn’t a fundamentally different or new war in history. It still included the same things as other wars, desire for land, power, and resources. What made World War II stand out from other wars was because of the rapidly advancing technology at the time, which allowed for more casualties on the battlefield, and due to the large amount of countries participating in the war. ",
            "date": "Answered January 22, 2018",
            "views": "118",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brayden Swanson",
                    "user_href": "/profile/Brayden-Swanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Mathew Luga",
                "href": "/profile/Jose-Mathew-Luga-1"
            },
            "answer_text": "1.) The cause lies post WWI with the treaty of Versailles and the way the Germans were made to pay for most of the war damages for all parties involved — this resulted to Germany’s economic woes in the early 20th century. Also, the Japanese did not benefit from the Treaty of Versailles, despite of the support they gave to the Allied forces and they felt slighted because of this, giving root to Japanese transition to the Axis powers during WWII. 2.) The great depression did not help alleviate this economic woes of Germany. The United States in the 1920s actually started to invest in Germany and it was supposed to be one way to help alleviate the economic woes the country faced — but with the stock market crash, the US decided to focus on its own problems, leaving Germany entirely on its own with unemployment reaching 6 million. 3.) Such a condition has provided for the rise of Adolf Hitler and the Nazi party. The failure of the German economy was attributed to the democratic Weimar government. As a result, the German people were looking for alternatives and they sought it in Nazism and Communism. The Weimar Government recognized the growing appeal that Hitler had and rather than confronting him, they thought that they can manipulate him so they agreed to have him be Chancellor. 4.) With Hitler Chancellor, he was able to cement his power further with the burning of the Reichstag — he blamed the incidents to the Communists and as a result had them expelled from parliament while declaring state emergency, centralizing power to his office. 5.) He then proceeded to use the anger of the German people from the injustices they received from the Treaty of Versailles. Coupled with his ideas from the Mein Kampf preaching racial superiority over the transmitters and destroyers of cultures (who were the Jews), he proceeded to plan his “final solution” while stirring the German people at the same time against the Allied powers — leading to the invasion of Czechoslovakia, and later on Poland (the latter triggering WWII in Europe) 6.) As for the Pacific Front, the Germans wanted to make sure that the Allied forces in the Pacific were neutralized, for this reason, they allied with the Japanese, who were also slighted by the lack of recognition it was given for its contribution to the Allied effort in WWI. 7.) Also, Japan was lacking natural resources due to its expanding population, hence it decided to invade neighboring Manchuria (1931) and later on China (1937). The Japanese Army stormed until French-Indochina (1940) which now alarmed the Allied powers due to Japan’s proximity to other Allied colonies (e.g., Myanmar, the Philippines, Malaysia, Singapore, Indonesia) — US placed an embargo on iron and oil to Japan. 8.) With Japan now desperate for oil and other war related resources, it turned its gaze to Southeast Asia. Planning to win the invasion swiftly, it hit the largest Allied base in the Pacific where it hurt them most — Pearl Harbor (December 8, 1941), hence outbreak of war in the Pacific. I obviously glossed over some details but for the sake of providing a summary of events, these were the general causes of WWII. ",
            "date": "Answered March 30, 2017",
            "views": "653",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nobody Name",
                "href": "/profile/Nobody-Name"
            },
            "answer_text": "It had many origins that started long before the fighting began. At the end of world war 1 the Germans were forced to sign the treaty of Versailles. This treaty had massive implications, it forced Germany to pay extensive war reparations and cede land to the allies. This left Germany broken, impoverished. Resentment festered insidiously over the years, everyone blaming either the communists or the Jewish community for their misfortune. It was what is called “mass hysteria.” This led to radicals rising up, feeding on the disenfranchised population and focusing that powdered keg of animosity to reach their goal of totalitarian control. On the other side of the world, Japan was an empire expanding rapidly, they had long been fighting and conquering chinese territory before world war two. Years later they were running low on oil, and recieved oil from the U.S. The U.S. passed an oil embargo on Japan and their war machine was soon to grind to a halt. Out of desperation, they attacked the U.S. at Pearl Harbor in hopes of destroying it's naval capabilities so they could be successful in their invasions of the Pacific Territories while acquiring more oil. Back to the European theater; Germany began breaking the rules of the treaty of Versailles. They re-militarized the Sudaten Land, annexed Austria and Chec. territory. The allies were war weary, they wanted to avoid another massive European war so looked the other way while Hitler gave empty promises not to take anymore territory. Then in a joint attack, Russia invaided Poland from the east and Germany invaided Poland from the west in 1939. This was the last straw, Great Britain and France declared war on Germany, which brought Italy and Japan into the fold on Germanys side as the axis powers. The U.S. enters the war later in 1941 after the Pearl Harbor attack. ",
            "date": "Answered September 23, 2017",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Piotr Szafranski",
                    "user_href": "/profile/Piotr-Szafranski"
                },
                {
                    "user_id": "Chandra Sekhar",
                    "user_href": "/profile/Chandra-Sekhar-1204"
                },
                {
                    "user_id": "Mpho Victoria",
                    "user_href": "/profile/Mpho-Victoria-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Pease",
                "href": "/profile/Jim-Pease-4"
            },
            "answer_text": "SEPT. 1 1939 At 4:00 in the morning forty-five minutes ahead of the proposed 4:45 starting time: The German battleship Schleswig-Holstein opened fire on the small Polish garrison of Westerplatte.The battleship's eleven inch guns pounded the 182 men defending the munitions depot at the mouth of Danzig harbor, at a range of 800 yards. As the day progressed, the shelling increased. Aerial attacks by Junkers JU-87 dive bombers preceded infantry assault by Wehrmacht regulars and SS-\"Heimwehr Danzig\"police units. The defenders commanded by Major Hendryk Sucharski fought on. Around 4:30 units of the Danzig SS surrounded and attacked the Polish post office in Danzig. Postal officials armed themselves and for several hours repulsed the assaults until wounded, and ammunition exhausted, they surrendered. Execution by firing squad followed for the defenders. The 4:45 commencement time was heralded by aerial attacks and general hostilities. Operation \"Case White\" the invasion of Poland was under way. Approximately 5:30 the first bombers appeared over Warsaw. Henkiel He- 111, And Dornier medium bombers as well as JU-87 dive bombers dropped 1000, 500, And 110 lbs.bombs. To add to the destruction 2.2 lbs. thermite magnesium incendiaries were dropped, igniting uncontrolled fires. For the people of Warsaw it was only the beginning. Five armies crossed the Polish border \" Army Group North \" commanded by General Von Bock consisted of the third, and forth armies. \" Army Group South \" under Von Rundstedt was made up of the eighth, tenth, and fourteenth armies. The Polish army, Equipped with 475 light tanks tried to hold back the 2,511 tanks of the Nazi forces. The Luftwaffe deployed 1323 first line combat aircraft against the Poles 433 obsolete military aircraft. Bombing and strafing of civilians proved the age of chivalry was dead. ",
            "date": "Answered September 11, 2019",
            "views": "286",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Mills",
                    "user_href": "/profile/Josh-Mills-105"
                },
                {
                    "user_id": "Kyle Murao",
                    "user_href": "/profile/Kyle-Murao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Edwards",
                "href": "/profile/Mike-Edwards-49"
            },
            "answer_text": "Lazy Answers are going to say the Treaty of Versailles. Equally simple ones will say Hitler A better one would ask - WHY hasn’t modern Germany risen to start WW3? The Treaty of Versailles was a light punishment for the unwarranted destruction and loss of life in WW1 , This (barsteward) Got it right:-  General John Joseph \"Black Jack\" Pershing (barsteward for 3,500 American casualties on the last day of the war) But-Pershing had disagreed with Allied Leaders , over the Armistice and wanted to push into and occupy Germany to force an unconditional surrender \"We never really let the Germans know who won the war. They are being told that their army was stabbed in the back, betrayed, that their army had not been defeated. The Germans never believed they were beaten. It will have to be done all over again....\" Pershing in 1923 on the prospects of another war. Post-WW2 Gemans knew differently , The Cause of WW2 was not punishing Germany enough, on their own doorsteps, with foreign flags on their buildings , and foreign troops in their streets, WW1 was not fought in Germany, the War Cemeteries are in France, the Allies got to bury the Dead - and wanted to avoid WW2, Germany tried to forget or never accepted its Defeat & Shame. ",
            "date": "Answered January 31, 2017",
            "views": "984",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessie Cecilya",
                    "user_href": "/profile/Jessie-Cecilya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ozgur Zeren",
                "href": "/profile/Ozgur-Zeren"
            },
            "answer_text": "The root cause of world war 2 is industrial and imperialist circles in the west fostering and backing fascist movements outside and inside their own countries in order to ward off the demands which were placed on them by the public due to the results of great depression.  Better wages, better working conditions were demanded, taxes on the rich were demanded, social security was demanded (it didnt exist then, basically you were on your own), regulations were demanded, people were hungry. Popular movements started in order to get these progressive aims.  Rich industrial circles didnt like these one bit. After Mussolini's fascism was able to stamp out such demands and ensure a regulation-free, low tax environment for 'business', every other industrialist became a fascist advocate.  Nazi party was supported by German industry, and after coming to power the industrial establishment in the west at large, with the hopes of using them against USSR and any potential country in Europe which could turn progressive to any degree. Fascist movements fostered fascist movements abroad as well - nazis actively funded and organized nazi groups in the west, including usa. They have a major role in hundreds of nazi groups popping up in usa before 1941, and FDR's subsequent crackdown. These fascist regimes fostered their own imperial aims behind the guise of 'eradicating communism' - every other single invasion which they couldnt justify through historical claims were explained by 'fighting communism' - from ethiopia to spain.  Western corporate press - even outfits like new york times - were loudly applauding these stuff. Even calling for the 'free world' allying with nazi germany to 'wipe out communism'. Special credit for this needs to go to oil interests who lose caucasian oil fields after soviet revolution. They mounted massive propaganda and lobbying by spending massive funds to foster direct military action against ussr, and after nazis came to power their support was turned to nazis.  So the new imperialist powers who came to being in the form of fascist regimes set about pursuing their own aims - japan wanted east asia, germany wanted all europe until urals. And they got about doing that. Even as Germany was invading poland and occupying it, the west was still keeping silent and inactive just across the rhine, in what is called the 'phony war'. They werent taking any noticeable military action despite germany's industrial heart, ruhr, was just under the guns of french and british on the other side of the rhine river. German army was in poland campaign for a month, and then was being ferried west, while entire french army and british expeditionary force was just waiting on france's eastern borders. ~8 months passed with this unbelievable and inexplicable 'inaction'. Of course, its not inexplicable. The expectancy of the western governments was that germany would attack ussr. corporate papers in the west were shouting about how this was the 'wrong war' and that france and britain AND usa should join germany and attack ussr and 'get the world rid of communism'. After nazis crossed seine, the illusion and facade was over. During this time, the appeasement government in uk resigns, churchill is appointed pm, and some of the top political cadres AND industrial cadres who were waiting for communism to be eradicated by nazis woke up to real world.  Rather late. ",
            "date": "Updated November 6, 2015",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Djoremy",
                    "user_href": "/profile/Joe-Djoremy"
                },
                {
                    "user_id": "Paul Gallagher",
                    "user_href": "/profile/Paul-Gallagher-12"
                },
                {
                    "user_id": "Sam Siddiqui",
                    "user_href": "/profile/Sam-Siddiqui"
                },
                {
                    "user_id": "Saeed Doroudiani",
                    "user_href": "/profile/Saeed-Doroudiani"
                },
                {
                    "user_id": "Nguyen Quoc Huy",
                    "user_href": "/profile/Nguyen-Quoc-Huy-3"
                },
                {
                    "user_id": "Manish Baluja",
                    "user_href": "/profile/Manish-Baluja-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Sorrell",
                "href": "/profile/Steven-Sorrell-1"
            },
            "answer_text": "HOnestly, as simplistic and dopey as this sounds, the reason for WW2 is WW1. You likely want more than that, so... The conditions that occurred during and just after the signing of the treaty that ended WWI (The Treaty of Versailles: June 28, 1919) were these:  -- Russia fell to Civil War and was out if the war years prior.--the Balkan States (Where this war started) was in as much disarray as ever with the fall of the Ottoman and Austro-Hungarian Empires. And within both Empires borders were the chaos associated with the vacuum of power.--the British, economically and materially unable to administer their middle east and Indian parts of their empire was divided into ridiculous minor nation states with NO input by the people who lived there.--The French empire (their southeast Asian empire evaporated) was destroyed along with their countryside as most of the war was fought there.--In fact, nearly all of European holdings in northern and Sub-Saharan Africa fell to various civil wars.--Canada remained part of the Commonwealth of the UK but we're pretty much on their own. Australia, long revolutionary now simply it's own country.-- Turkey and Italy, kind of weasels in this war, struck won petty land gains but had no political power save what the military could muster. Germany...and ahhh Germany!Germany was certainly a primary aggressor in WW1,  but were made to take the blame for ALL of it!!! There  was even a clause in the Treaty of Versailles assigning them blame and reparations they didn't truly deserve and could never really pay. Indeed,  they lost the war and we're forced into surrender, but no part of the war was fought on their soil. It's tough to convince the common people that they should have to surrender when no battle was fought on your own soil. The Americans, in turn, got far FAR too much credit for their part in the victory. Of course, the \"14 points\" President Wilson offered for surrender (the basis for Germany's surrender and the creator of the League of Nations) was never passed by Congress so never actually participated in by the USA. 20,000,000 soldiers died or wounded.20,000,000 civilians lost to influenza, other diseases,  and starvation.10,000,000 more die in the Russian Revolution.  Sorry for running so long...but I have only scratched the surface of the toll of WW1 and how it caused WW2. All I have written is just the political and loss-of-life results. AND  I have left out sooo much. Obviously,  without World War One there could Not ,have been a World War Two. But the latter was clearly caused by the former. ",
            "date": "Updated December 9, 2014",
            "views": "522",
            "upvotes": " View 164 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yehezkiel Davi",
                    "user_href": "/profile/Yehezkiel-Davi"
                },
                {
                    "user_id": "John Von Ignalig",
                    "user_href": "/profile/John-Von-Ignalig"
                },
                {
                    "user_id": "Ben Kellett",
                    "user_href": "/profile/Ben-Kellett-2"
                },
                {
                    "user_id": "Nick Bot",
                    "user_href": "/profile/Nick-Bot"
                },
                {
                    "user_id": "Raksha Singh",
                    "user_href": "/profile/Raksha-Singh-28"
                },
                {
                    "user_id": "Daniel Driscoll",
                    "user_href": "/profile/Daniel-Driscoll-15"
                },
                {
                    "user_id": "Paul Hart",
                    "user_href": "/profile/Paul-Hart-100"
                },
                {
                    "user_id": "JanRev Cruz",
                    "user_href": "/profile/JanRev-Cruz"
                },
                {
                    "user_id": "Christopher Meade",
                    "user_href": "/profile/Christopher-Meade-3"
                },
                {
                    "user_id": "Aidan Weston",
                    "user_href": "/profile/Aidan-Weston-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma William",
                "href": "/profile/Emma-William-11"
            },
            "answer_text": "1) The main causes of World War II were nationalistic tensions, unresolved issues, and resentments resulting from the World War I and the interwar period in Europe, 2) plus the effects of the Great Depression in the 1930s. 3) The culmination of events that led to the outbreak of war are generally understood to be the 1939 invasion of Poland by Germany and Soviet Russia and the 1937 invasion of the Republic of China by the Empire of Japan. 4) These military aggressions were the result of decisions made by the authoritarian ruling Nazi elite in Germany and by the leadership of the Kwantung Army in Japan. 5) World War II started after these aggressive actions were met with an official declaration of war and/or armed resistance. Most of the people say, “The war is generally accepted to have begun on 1 September 1939, with the invasion of Poland by Germany, and subsequent declarations of war on Germany by France and most of the countries of the British Empire and Commonwealth. Germany set out to establish a large empire in Europe. From late 1939 to early 1941, in a series of campaigns and treaties, Germany conquered or subdued much of continental Europe; in accordance with Nazi-Soviet agreements, the nominally neutral Soviet Union fully or partially occupied and annexed territories of its six European neighbors, including Poland. Britain and the Commonwealth remained the only major force continuing the fight against the Axis in North Africa and in extensive naval warfare. In June 1941, the European Axis launched an invasion of the Soviet Union, giving a start to the largest land theater of war in history, which, from that moment on, tied down the major part of the Axis military power. In December 1941, Japan, which had been at war with China since 1937,and aimed to dominate Asia, attacked the United States and European possessions in the Pacific Ocean, quickly conquering much of the region.”  ",
            "date": "Answered September 29, 2016",
            "views": "786",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shahzad Khan",
                    "user_href": "/profile/Shahzad-Khan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Hall",
                "href": "/profile/Albert-Hall-29"
            },
            "answer_text": "THe start of WW2 had it’s roots at the end of WW1. Many Germans tought that theyy had been betrayed and thetb their government had needlessly signed an unconditional surrender. The German Forces did mutiny however which hastened the end as it were, However the baisc command structures were and remained in place enabling n a rapid re-construction of military command. . The feeling of being cheated was exascerbated by the horrendous WAR REPARATiONS demanded from Germany that had no chance of ever being repaid except in the eventuallity of devaluing the currency. This lead to a massive depression and inflation in German. This in turn lead to the upsurge of both the NATIONAL GERMAN WORKERS SOCIALIST PARTY the infamous NAZI Party ] and the COMMUNIST PARTY of Germany who went head on the streets. By this time ADOLPH HITLER who hade spent some time in jail for insurrectioin and sedition had written his MEIN KAMPF [My Struggle] in which he layed out plans for a future Germany . Hitler blamed the JEWS for Germany’s civil problems and apart from anything else this found resonance with the majority of the German People who were only too willing to go along with his plans to rid Germany of Jews by any means possible. All this time the German Military had stood aside from meddling in Political matters. However by this time an organisation known as the BROWN SHIRTS who were a supposedly HITLER supporters looked like becoming for to powerful for the military to stomach. In return for the Military swearing PERSONAL loyalty to him Hitler promised to get rid ofm the Brown Shirts. They did and He did inn thew NIght of the Long Knives. HITLER as is very apparent in MEIN KAMPF also saw the need for LEIBANSTRAUM [or Living Space] for German expansion. The only viable space was to the East and the bread basket and coal of the Ukraine and the oilfields of Rumania added to this Hitler also saw the Communist Soviet Union as his greatest long term enemy added to gether this could only mean the eventual invasion of the Soviet Union [USSR] Poland stood in the way and had to be dealt with first. In the meantime both France and the UK had signed a treaty with Poland that if Germany invaded Poland BOTH nations would go to warb with Germany of Polands behalf . Germany invaded Poland the rest is history. This is a very very short precise based on my OPINIONS but there have been many learned tomes written on the subject. BUt one thing I would say is that from the end of WW! WW2 was pretty much unavoidable at some stage. If it had not been precipitated by HITLER it might well have been a combined pan European war against the USSR. Some estimates put that probable war as beginning in around 1950 ",
            "date": "Answered May 23, 2019",
            "views": "259",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Harker",
                "href": "/profile/Steven-Harker-4"
            },
            "answer_text": "Probably the British. It’s usually the British who are at fault when you boil it down. Like most things we Brits do, it was mostly accidental. All Hitler wanted to do was have a few local wars, for the glory, take over and oppress his immediate neighbours before invading the USSR, exterminating undesirables along the way. Which he finally got around to doing in the summer of 1941, a bit behind schedule. You could say that the invasion of Poland was going to be one last practice run. The final warm up match before the big event. In his eyes this shouldn’t have troubled either Britain or France. After all we hadn’t really kicked up a fuss when he invaded Czechoslovakia in 1938 so why should the invasion of Poland in September 1939 get a different reaction. But it did. You can only make fools of us so many times before we finally say enough is enough, which we did with Poland and it just sort of snowballed from there. Willingly or not, virtually the whole of Europe and Scandinavia got involved. Italy decided that it wanted it’s own slice of the glory, in the Mediterranean and North Africa which went as well as you’d expect. Since Britain and France had empires, troops from all over the colonies were mobilised and sent to fight, soon some wouldn’t have to travel all that far either. The USSR decided it just didn’t have enough room so invaded Finland in November 1939, which almost had Britain declaring war on the USSR. Ironic considering that Finland later briefly aligned itself with Germany. (It should be remembered that the USSR had taken advantage of the German invasion of Poland, to carve a chunk of Poland off for itself). Meanwhile Japan, which had been running it’s own private war in China, decided to take advantage of the chaos in Europe and “liberate” European colonies in the far east. However, in a sudden rush of blood to the head, they also decided to attack Pearl Harbour which brought the USA into the war in December 1941 A truly global conflict. ",
            "date": "Answered March 20, 2019",
            "views": "153",
            "upvotes": " View 72 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishal Patil",
                    "user_href": "/profile/Vishal-Patil-1046"
                },
                {
                    "user_id": "Yehezkiel Davi",
                    "user_href": "/profile/Yehezkiel-Davi"
                },
                {
                    "user_id": "Pratik Kulkar",
                    "user_href": "/profile/Pratik-Kulkar"
                },
                {
                    "user_id": "Suleyman Aras Ortac",
                    "user_href": "/profile/Suleyman-Aras-Ortac"
                },
                {
                    "user_id": "Rick Garber",
                    "user_href": "/profile/Rick-Garber-4"
                },
                {
                    "user_id": "Alex Ossel",
                    "user_href": "/profile/Alex-Ossel"
                },
                {
                    "user_id": "Bd Massey",
                    "user_href": "/profile/Bd-Massey"
                },
                {
                    "user_id": "Mike Torres",
                    "user_href": "/profile/Mike-Torres-113"
                },
                {
                    "user_id": "Vee.Wake",
                    "user_href": "/profile/Vee-Wake"
                },
                {
                    "user_id": "Rick Walker",
                    "user_href": "/profile/Rick-Walker-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suryakant Mishra",
                "href": "/profile/Suryakant-Mishra-12"
            },
            "answer_text": "Most historians agreed that the seeds of world war 2 were sown at the end of World War 1. In 1918, the \"War Guilt Clause\" of the Treaty of Versailles held Germany and Austria-Hungary responsible for the entire conflict and imposed on them crippling financial sanctions, territorial dismemberment and isolation. Germany, for example, was forced to demilitarise the Rhineland and abolish its air force. Some scholars say that the terms of the treaty were unnecessarily harsh and led to mounting anger in Germany in particular over subsequent decades. The rise of Hitler In 2013, Germany marked the 80th anni Continue Reading",
            "date": "Answered October 6, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James LaBare",
                "href": "/profile/James-LaBare"
            },
            "answer_text": "Everyone points to the Treaty of Versailles as the primary cause of World War One, and certainly it provided the Nazi Party a starting point to get people to listen, but the truth was the rise of the Nazi's, Fascism in Italy, and the Militarism in Japan were ALL a result of the First World war. But, to keep this answer readable in terms of length, I'll focus on the Nazi's, as without them, the European war would've been probably little more then a regional power grab by Italy. While Germany had tough economic conditions in the immediate aftermath of the war, near the end of the 1920s, they had  Continue Reading",
            "date": "Answered May 3, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Will Dixon",
                "href": "/profile/Will-Dixon-47"
            },
            "answer_text": "World War 2 was started in 1919 by The Treaty Of Versailles. It punished the entire population of Germany far too harshly for far too long. Lots of Germany’s resources were routinely shipped to neighbouring countries, making living standards in Germany for the average German far too harsh. So in 1933 the National Socialist (Nazi) Party was elected because of the prevailing harsh economic environment. The Nazis were exceptionally effective with propaganda. The Nazi government put into action a healthy exercise / summer camp organisation for children and youths, which was popular. This gradually Continue Reading",
            "date": "Answered March 23, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Florian Klein",
                "href": "/profile/Florian-Klein-4"
            },
            "answer_text": "World War I and the Treaty of Versailles The Treaty of Versailles held Germany responsible for the war and put certain military restrictions on them. The motive was to handicap Germany to ensure that it would not wage another war. They were also asked to pay a huge sum of money as a fine and make substantial territorial concessions to the Allied Powers. The people of Germany were not at all happy with the proceedings. The Treaty of Versailles didn't just affect the economy of the country, but had also hurt the national pride. In Adolf Hitler, they saw hope and brought him to power. Rise of Hitle Continue Reading",
            "date": "Answered June 8, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aman Karn",
                "href": "/profile/Aman-Karn-5"
            },
            "answer_text": "Well, the immediate cause was the attack by Germany on Poland on 1 September 1939. France and the UK gave a 24 hour ultimatum to Hitler to withdraw his troops from Poland. But the Nazis refused. So, on 3rd of September, 1939, Britain and France declared war on Nazi Germany, thus precipitating the World War 2. Now, so far as the causes of World War 2 are concerned, there were many. Some of them are: Treaty of Versailles After the defeat of Imperial Germany to the Allied powers in the First World War, Germany was severely humiliated by the Allies, most importantly as per the wish of Georges Clemenc Continue Reading",
            "date": "Answered August 3, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alastair Ian",
                "href": "/profile/Alastair-Ian"
            },
            "answer_text": "This question needs a really long answer. We can start with some basics. World War 2 really had its roots in World War 1 and the rise of Ideology that happened afterward. Nationalism had been a rising force in European politics since the Napoleonic Wars of the early 1800s. Nationalism helped fuel the start of World War 1. It continued to do so during World War 2. The Treaty of Versailles punished Germany a great deal. France would accept nothing less. It also cold shouldered Japan from gaining politically from its involvement in the War. This was part of a series of political losses for Japan  Continue Reading",
            "date": "Answered January 8, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Bennett",
                "href": "/profile/Mike-Bennett-83"
            },
            "answer_text": "One could easily go to Wikipedia to find the answer, but here is my take: ego. Throughout all of history, man has found new and inventive ways to satisfy the need/desire to impose their own perception of reality upon others and beat it over the heads of anyone who opposes those perceptions. As I have studied history, both for academic credit and because “it’s 3am and I should really be going to bed,” I have noticed that the words of the character “The Merovingian” from 2003’s The Matrix Reloaded comes to mind: “You see there is only one constant. One universal. It is the only real truth. Causali Continue Reading",
            "date": "Answered May 13, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theodorakopoulos Nikos",
                "href": "/profile/Theodorakopoulos-Nikos"
            },
            "answer_text": "There are two parts in this answer. The causes of WW2 and the events that led to WW2 or signified WW2. Events: They were mentioned by most of the posts. The preludes (Italian conquest of Albania and Ethiopia, the Spanish Civil War, the Japanese campaigns in Manchuria, China, the annexation of Sudeteland and Austria by the Third Reich) and the main course of the war after the invasion of Poland. Two preludes that were not mentioned were: The Japan-Soviet Union conflicts in 1938–1939 in Mongolia and ManchuriaThe Soviet Union war against Finland (Winter War)Causes: WW2 was a sequence of WW1, in the s Continue Reading",
            "date": "Answered January 28, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shewali Tiwari",
                "href": "/profile/Shewali-Tiwari"
            },
            "answer_text": "WW II started because of WW I.  When everyone came to settlement after the WW I, Germany had to give away its land, other possessions, and was asked not to have its armed forces, furthermore declining them the status of a sovereign nation. Quiet evidently, it created a lot of hustle among the people in charge.  15 years later, Germans chose Adolf Hitler as the leader. Hitler was the leader of National Socialists or Nazis, a political party which promised bring freedom back to the Germans. Nazi was founded on the grounds to fight hyperinflation, economical depression, and deprivation.  1st SeptembContinue Reading",
            "date": "Updated February 8, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Willem Dommisse",
                "href": "/profile/Willem-Dommisse"
            },
            "answer_text": "Germany was in a massive debt, due to the treaty of Versailles. People hated their goverment because of a rumor, the army said that germany could have won the war if they kept fighting, but the government stabbed the army in the back by signing a peace treaty. Hitler took advantage of the debt and the anger towards the govermen and he managed to become reichs kanselier after the reichstag burned down. The reason why it got as far as a war was that the British and French where afraid for another war. So they tried to do everything with treaties. Britain and France basically kept asking this ques Continue Reading",
            "date": "Answered January 31, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoff Leigh",
                "href": "/profile/Geoff-Leigh-1"
            },
            "answer_text": "OQ: Why did World War II erupt? Thanks for the A2A, Nanang. Simply put, Germany’s military felt they had unfinished business, there was a wave of nationalism that was a common reaction of a population to periods of economic stress. Then we add a despotic leader for the Germans in Adolf Hitler, who proceeded to secretly build up German Military Capabilities despite World War I armistice conditions, and even test out some of it in Spain to support the rise of Fascism and Dictatorship there. Then he proceeded to annex and invade parts of Europe including areas that would activate mutual support and Continue Reading",
            "date": "Updated January 27, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Magcaleka Nonjabe",
                "href": "/profile/Magcaleka-Nonjabe"
            },
            "answer_text": "British empire, conspiracy theories asides, British had that tendency of looking at some other countries down, it was an age of imperialism, Germany (Hitler excluded) wanted to expand its newly created empire in Europe, Italy wanted expand its territory in Africa, nevermind those who blame Mussolini for war as if they never started colonising Ethiopia before the world war even started, yes they did they were already in Ethiopia, but the British being British started to interfere in these countries adventures when no one did a thing when they were invading and killing defenceless people around  Continue Reading",
            "date": "Answered April 16, 2020",
            "views": "0",
            "upvotes": "0"
        }
    ]
}