{
    "title": "What does it mean to say Elvis has left the building? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Albert",
                "href": "/profile/Frank-Albert-1"
            },
            "answer_text": "The minute E finished his final note—the last song he ever performed was “I Can’t Help Falling in Love with You,” in Indianapolis, on June 26th, 1977,—he burned rubber off the stage and into a waiting limousine. The band would still be finishing up; the Sweet Inspirations would be rounding off the high “Yooooouuuuu,” and he’d be ensconced in the back seat, shades on, Ginger Alden by his side. And as with all of his performances, the MC would announce that “Elvis has left the building,” to ward off his legions of bloodthirsty fans, already driven into a frenzy by the taste of his sweat and tears when he removed scarves from his neck and flicked them at the screeching maenads. This sentence took on horrible significance when the great man left our crummy building for good in 1977, and headed straight to Heaven, glory glory, hallelujah. ",
            "date": "Updated October 20, 2020",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Liam Dougan",
                    "user_href": "/profile/Liam-Dougan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Dans",
                "href": "/profile/Carlos-Dans"
            },
            "answer_text": "“Show over - you can all go home now.” Elvis has left the building Other possible meanings - Elvis has left the building, but the building has remained, meaning that Elvis may be gone, but rock ’n roll is here to stay, a take on “the King is dead, long live the King!” Edison is dead, but the light bulb lights all our houses. Hendrix is gone, but we, his children, are a legion. No show is ever truly over - the stage is still there to fill. Think of similar metaphors. ",
            "date": "Answered June 4, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}