{
    "title": "What are the differences between ancient, medieval, and classical? - Quora",
    "tags": [
        "Ancient Civilizations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bradley Betts",
                "href": "/profile/Bradley-Betts-4"
            },
            "answer_text": "What are the differences between ancient, medieval, and classical? ‘Ancient’ refers to any time prior to the collapse of the Western Roman Empire in the 5th century AD; sometimes referred to as ‘antiquity’. ‘Mediaeval’ literally means ‘middle ages’ and refers to a period of European history between the collapse of the Western Roman Empire and the onset of the Age of Exploration. The Early Middle Ages lasted from the collapse of the Western Empire in 476 to the Norman invasion of England in 1066; the High Middle Ages from the Norman invasion to around 1250; and the Late Middle Ages from 1250 to the onset of the Age of Exploration, often dated from Columbus’ first expedition to the Americas in 1492. ‘Classical’ in this context is a period of ancient history lasting roughly from the 8th century BC to the Early Middle Ages. The term is used most often when discussing Greco-Roman history, mostly because that was the dominant civilisation in Europe throughout this time period. ",
            "date": "Answered October 4, 2020",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenneth Lee",
                    "user_href": "/profile/Kenneth-Lee-381"
                },
                {
                    "user_id": "Fatpacs Channel Solano",
                    "user_href": "/profile/Fatpacs-Channel-Solano"
                },
                {
                    "user_id": "Chrek Pothilin",
                    "user_href": "/profile/Chrek-Pothilin"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Notmyreal-Firstname"
                },
                {
                    "user_id": "S. Damon",
                    "user_href": "/profile/S-Damon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Tutunjian",
                "href": "/profile/Jerry-Tutunjian"
            },
            "answer_text": "Anytime before the fall of the Roman Empire in the 5th century is ancient times. Medieval is from the late 5th century to the discovery of the Americas in 1492. Classical times refers to the period when Greek and Roman civilizations were at their peak. For Greece it’s from the 6th century B.C.E. to the 3rd century B.C.E. For the Romans it’s from the 3rd century B.C.E. to the 1st century A. D. ",
            "date": "Answered July 11, 2018",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rose Walker",
                    "user_href": "/profile/Rose-Walker-137"
                },
                {
                    "user_id": "Prarabdha Sharma",
                    "user_href": "/profile/Prarabdha-Sharma-5"
                },
                {
                    "user_id": "Anuksha Varma",
                    "user_href": "/profile/Anuksha-Varma-1"
                }
            ]
        }
    ]
}