{
    "title": "What did Hitler think of India and Indian people? - Quora",
    "tags": [
        "Hitler and India",
        "Adolf Hitler",
        "History of India",
        "Historical India",
        "Indian Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Lee Chaisiri",
                "href": "/profile/Andy-Lee-Chaisiri"
            },
            "answer_text": "What did Hitler think of India, and how did this view evolve over time? Let's have him speak for himself: 4th February 1945  To tell the truth, I feel much more sympathetically inclined to the lowliest Hindu than to any of these arrogant (British) islanders . 7th February 1945  In them (Asians), the white races have imposed their will by force, and the influence they have had on the native inhabitants has been negligible; the Hindus have remained Hindus, the Chinese have remained Chinese, and the Muslims are still Muslims. There have been no profound transformations, and such changes as have occurred are less marked in the religious field, notwithstanding the tremendous efforts of the Christian missionaries, than in any other. There have been a few odd conversions the sincerity of which are open to considerable doubt-except, perhaps in the case of a few simpletons and mentally deficient. The white races did, of course, give some things to the natives, and they were the worst gifts that they could possibly have made, those plagues of our own modern world-materialism, fanaticism, alcoholism and syphilis. For the rest, since these peoples possessed qualities of their own which were superior to anything we could offer them, they have remained essentially unchanged.  Colonization is not an activity which Germans feel called upon to pursue,Germany should never make common cause with the colonizing nations and should always abstain from supporting them in their colonial aspirations. Those quotations are from Hitler's transcribed conversations with his personal secretary Martin Bormann, who was with Hitler in his bunker in the Battle of Berlin and one of the witnesses to the signing of Hitler's Last Will and his marriage to Eva Braun on April 29th, 1945. Bormann was also present in the cremation of Adolf and Eva on April 30th. That uncharacteristically sympathetic view towards non-Europeans held at theend of his life has to be taken in the context of those last few years; it wasn't Asians or Arabs that repelled his European invasions or reduced Dresden to ashes, it was his fellow 'White' people that did it.  As bizarrely sympathetic as Hitler was in the days before his suicide, he began life with a typical Imperialist attitude of the world, and was a hardcore Anglophile in particular. You could say that his goal was to make Germany as powerful as Britain during the height of their empire. Here's a look at some of the things Hitler said about non-Europeans (India in particular, as this is what the question asks for. Hitler even makes a comment about Nehru and Bose) from the publishing of Mein Kampf to his transcribed private conversations :    July 1941 Let's learn from the English, who, with two  hundred and fifty thousand men in all, including fifty thousand  soldiers, govern four hundred million Indians. 17th October 1941 The basic reason for English pride is India. Four hundred  years ago the English didn't have this pride. The vast spaces  over which they spread their rule obliged them to govern  millions of people — and they kept these multitudes in order by  granting a few men unlimited power. It would obviously have  been impossible for them to keep great European areas supplied  with foodstuffs and other articles of prime necessity. In any case, the Anglicans never sustained the slightest effort of a missionary description.  Thus it was that the Indians never suffered any attack of this  sort upon their spiritual integrity....What India was for England, the territories of Russia will be  for us. If only I could make the German people understand  what this space means for our future! ...If the English were to be driven out of India, India would  perish. Our role in Russia will be analogous to that of England  in India. ...The Russian space is our India. Like the English, we shall  rule this empire with a handful of men. 15th August to 17th September 1941 In this business I shall go straight ahead, cold-bloodedly.  What they may think about me, at this juncture, is to me a  matter of complete indifference. I don't see why a German who  eats a piece of bread should torment himself with the idea that  the soil that produces this bread has been won by the sword. When we eat wheat from Canada, we don't think about the  despoiled Indians. The precept that it's men's duty to love one another is theory  — and the Christians are the last to practise it! A negro baby  who has the misfortune to die before a missionary gets his  clutches on him, goes to Hell! If that were true, one might well  lament that sorrowful destiny: to have lived only three years,  and to burn for all eternity with Lucifer! 26th October 1941 To exploit the Ukraine properly — that new Indian Empire — I  need only peace in the West. The frontier police will be enough to ensure us the quiet conditions necessary for the exploitation  of the conquered territories. I attach no importance to a  formal, juridical end to the war on the Eastern Front. If the English are clever, they will seize the psychological moment to make an about-turn — and they will march on our side. 5th January 1941 One of their great bases is Iran, Irak and Syria. That's  where their fleet takes on supplies. The other is the Malay  archipelago, where they're losing all their refueling -points for  oil. They can trumpet abroad their intentions concerning  Europe, but they (Britain) know very well that it's the possession of  India on which the existence of their Empire depends. December 1941  Hitler meets with Haj Amin al-Husseini, the leader of the Supreme Muslim Council, which was opposed to British presence in Palestine. January 1942 The wealth of Great Britain is the result less of a perfect  commercial organisation than of the capitalist exploitation of the three hundred and fifty million Indian slaves. The British are  commended for their worldly wisdom in respecting the customs  of the countries subject to them. In reality, this attitude has  no other explanation than the determination not to raise the  natives' standard of living. If we took India, the Indians would  certainly not be enthusiastic, and they'd not be slow to regret  the good old days of English rule! The climax of this cynical  behavior of the English is that it gives them the prestige of  liberalism and tolerance. The prohibition of suttee for widows, and the suppression of  starvation-dungeons, were dictated to the English by the desire  not to reduce the labour-force, and perhaps also by the desire to  economize wood! They set so cleverly about presenting these  measures to the world that they provoked a wave of admiration. That's the strength of the English: to allow the natives to live  whilst they exploit them to the uttermost. There's not a single Englishman, at this moment, who isn't  thinking constantly of India. If one were to offer the English  this alternative, to keep India whilst abandoning Europe to  Germany, or to lose India whilst retaining the control of  Europe, I'm sure that 99 per cent of them would choose to keep  India. For them, India has likewise become a symbol, for it's on India that she built the Empire. Out of four hundred and  fifty million subjects, the King of England has three hundred  and fifty million Indians. 12th-13th January 1942 There are no bloody insurrections in India to-day, but the  difficulty for the Indians is to reconcile the divergent interests  of such a diverse population.How are the princes and the  Brahmins, the Hindus and the Mussulmans, all these hierarchised and partitioned castes to be combined in a common front?  If a British newspaper in India writes an article to-day attacking Churchill, that's because it can't do anything else — or it  would lose its whole public. The Press doesn't give an exact  picture of the reality.  In India, revolt is an endemic condition.  Gandhi tried to succeed by pacific methods, but whatever be  the methods chosen, the Indians are unanimous in their desire  to shake off the British yoke. Some of them would like to try  Bolshevism for that purpose, others would like to try us.  Others would prefer to owe nothing to the foreigner. For all,  the object is the same, it's liberty — and nobody cares about the  state of anarchy that will follow in India upon the departure of  the English.When one treats a people as the English have continually  treated the Indians, the unpardonable folly is to send the youth  of the country to the universities, where it learns things that it  would be better for it not to know.  3rd March 1942 I read to-day that India at present numbers three hundred  and eighty-eight million inhabitants, which means an increase of  fifty-five millions during the last ten years. It's alarming. We  are witnessing the same phenomenon in Russia. The women  there have a child every year. The chief reason for this increase  is the reduction in mortality due to the progress made by the  health services. What are our doctors thinking of? Isn't it enough to vaccinate the whites? So much the worse for the  whites who won't let themselves be vaccinated ! Let 'em croak!  All the same, because of these people's fixed ideas, we can't sterilize all the natives. If the English give India back her liberty, within twenty  years India will have lost her liberty again. There are English-  men who reproach themselves with having governed the country badly. Why? Because the Indians show no enthusiasm  for their rule. I claim that the English have governed India very well, but their error is to expect enthusiasm from the people they administer.  If it's true that the English have exploited India, it's also true that India has drawn a profit from English domination.  Without the English, India would certainly not have a population of three hundred and eighty million inhabitants.  It is questionable, by the way, whether Cripps will get any hearing from  the Indian people. The Indian world has already been so disturbed by the presence of the Japanese on its frontiers, and by  the fall of Singapore, that the man of compromise, Nehru, has  been eclipsed by Bose. If today Cripps endeavours, with the  help of blackmail or begging, to induce the Indians to resist the  Japanese, I doubt whether Nehru, however much he would  like to, would be able to help him effectively. Nehru's fate will  be like that of the Socialists in 1918 who were swept away by  the masses. May 29, 1942: Hitler meets Subhas Chandra Bose  Hitler meets Subhas Chandra Bose, leader of the Indian National Army which fought for Indian independence from colonial rule. Germany forms the Indische legion, made up of Indian volunteers and British-Indian POW's.    Rommel with the Indische legion 1942, February 6th  I can well imagine that Japan would put no obstacle in the way of peace, on condition that the Far East were handed over to her. She's not capable of digesting India, and I doubt whether she has any interest in occupying Australia and New Zealand. If we preserve our connections with her, Japan will derive from this a great sense of security, and will feel that she has nothing more to fear from anybody at all. This alliance is also an essential guarantee of tranquility for us—in particular, in the event of our being able to rely on a lasting friendship with France. There's one thing that Japan and Germany have absolutely in common—that both of us need fifty to a hundred years for purposes of digestion: we for Russia, they for the Far East... ...the Japanese would win the war, but that in the long run they'd be absorbed by the Chinese. 1942, May 17th There are certain foreign journalists who try to create an impression by talking about the Yellow peril and by drawing our attention to the fact that our alliance with Japan is a species of betrayal of our own racial principles. 1942, June It angers one to think that, while in other parts of the globe religious teaching like that of Confucius, Buddha and Mohammed offers an undeniably broad basis for the religious-minded, Germans should have been duped by a theological exposition (Christianity) devoid of all honest depth. 22nd August 1942  In a book on India which I read recently, it was said that  India educated the British and gave them their feeling of  superiority.The lesson begins in the street itself; anyone who  wastes even a moment's compassion on a beggar is literally torn  to pieces by the beggar hordes; anyone who shows a trace of  human sentiment is damned for ever. From these origins  springs that crushing contempt for everything that is not British  which is a characteristic of the British race. Hence the reason  why the typical Briton marches ahead, superior, disdainful and  oblivious to everything around him. If the British are ever  driven out of India, the repercussions will be swift and terrible.  In the end, the Russians will reap the benefit. However  miserably the inhabitants of India may hve under the British  they will certainly be no better off if the British go.  Opium and alcohol bring in twenty-two and a half million  sterling to the British Exchequer every year. Anyone who raises  his voice in protest is regarded as a traitor to the State, and dealt  with accordingly. We Germans, on the contrary, will all go on  smoking our pipes, while at the same time compelling the  natives of our colonies to abandon the horrors of nicotine!  Britain does not wish to see India over-populated ; it is not in  her interest. On the contrary, she would rather see a somewhat  sparse population. If we were to occupy India, the very first  preoccupation of our administrators would be to set up countless Commissions to enquire into the conditions of every aspect  of human activity with a view to their amelioration; our Universities, full of solicitude for the welfare of the natives, would  immediately open sister organisations all over the country; and  we should finish up by quickly proving that India has a civilization older than our own!  I have just been reading some books which every German  going abroad should be compelled to read. The first of them is  Alsdorff's book, which should be read by every diplomat. According to it, it was not the British who taught Indians evil  ways ; when the first white men landed in the country they found  the walls surrounding many of the towns were constructed of  human skulls; equally, it was not Cortez who brought cruelty  to the Mexicans — it was there before he arrived. The Mexicans,  indeed, indulged in extensive human sacrifice, and, when the  spirit moved them, would sacrifice as many as twenty thousand  human beings at a time! In comparison, Cortez was a moderate  man. There is no need whatever to go rushing round the world  making the native more healthy than the white man. Some  people I know are indignant at the sale of shoddy cotton goods  to the natives; what, pray, do they suggest — that we should give  them pure silk? I have been reading tales of the burning of corpses at Benares.  If we were out there, our hygiene experts would rise in their  wrath and institute a crusade, backed by the most rigorous  penalties, to suppress this evil practice! Every day official  chemists would come and analyse the river-water, and in no  time a new and gigantic Ministry of Health would be set up! The British, on the other hand, have contented themselves with  forbidding the immolation of widows. The Indians can think  themselves lucky that we do not rule India. We should make  their lives a misery! Just think of it! Two hundred yards down-  stream of the place where they pitch the half-burned bodies  of their dead into the Ganges, they drink the river water!  Nobody ever takes any harm from it. But would we stand for a  thing like that? 1945, February 13th \"Pride in one's own race - and that does not imply contempt for other races - is also a normal and healthy sentiment. I have never regarded the Chinese or the Japanese as being inferior to ourselves. They belong to ancient civilizations, and I admit freely that their past history is superior to our own. They have the right to be proud of their past, just as we have the right to be proud of the civilization to which we belong. Indeed, I believethe more steadfast the Chinese and the Japanese remain in their pride of race, the easier I shall find it to get on with them. 14th February 1945 Never, at any price, should we have put our money on France and against the peoples subjected to her yoke. On the contrary, we should have helped them (Morocco, Algeria, Tunisia, Libya, Ivory Coast, Sudan, Guinea, Mauritania, Niger, Senegal, Upper Volta, Togoland, Chad, Oubangui-Chari, Congo, Cameroon, Madagascar, Lebanon, Syria ) to achieve their liberty 17th February 1945 Had we been on our own, we could have emancipated the Moslem countries dominated by France; and that would have had enormous repercussions in the Near East, dominated by Britain, and in Egypt. But with our fortunes linked to those of the Italians, the pursuit of such a policy was not possible. All Islam vibrated at the news of our victories. The Egyptians, the Irakis and the whole of the Near East were all ready to rise in revolt. Just think what we could have done to help them, even to incite them, as would have been both our duty and in our own interest! But the presence of the Italians at our side paralysed us; it created a feeling of malaise among our Islamic friends, who inevitably saw in us accomplices, willing or unwilling, of their oppressors. For the Italians in these parts of the world are more bitterly hated, of course, than either the British or the French. The memories of the barbarous, reprisals taken against the Senussi are still vivid. Then again the ridiculous pretensions of the Duce to be regarded as The Sword of Islam evokes the same sneering chuckle now as it did before the war. This title, which is fitting for Mahomed and a great conqueror like Omar, Mussolini caused to be conferred on himself by a few wretched brutes whom he had either bribed or terrorized into doing so. We had a great chance of pursuing a splendid policy with regard to Islam. But we missed the bus, as we missed it on several other occasions, thanks to our loyalty to the Italian alliance! 1945, February 18th He (Roosevelt) had done all in his power to provoke the Japanese... they (America) were more obsessed than ever with the idea of the Yellow Peril... For us, Japan will always remain an ally and a friend. This war will teach us to appreciate and respect her more than ever. It will encourage us to draw more tightly the bonds which unite our two countries. It is of course regrettable that the Japanese did not enter the war against Russia and at the same time as ourselves. Had they done so, Stalin's armies would not now be besieging Breslau or squatting in Budapest. We should have liquidated Bolshevism by the time winter came, and Roosevelt would have hesitated to take on adversaries as powerful as our two selves. In the same way I am sorry that Japan did not capture Singapore as early as 1940, immediately after the defeat of France. The United States was then on the eve of a presidential election and would have found it impossible to intervene. That, then, was one of the turning points of the war. In spite of everything, we and the Japanese will remain staunchly side by side. We will conquer or die together. Should we be the first to succumb, I can't see the Russians continuing to maintain the myth of `Asiatic solidarity' for the sake of Japan! The descendants of the convicts in Australia should inspire in us nothing but a feeling of supreme indifference. If their vitality is not strong enough to enable them to increase at a rate proportionate to the size of the territories they occupy, that is their own look out, and it is no use their appealing to us for help. For my own part, I have no objection at all to seeing the surplus populations of prolific Asia being drawn, as to a magnet, to their empty spaces. Let them all work out their own salvation! And let me repeat - it is nothing to do with us 2nd April 1945 I am sure that the Japanese, the Chinese and the peoples of Islam will always be closer to us than, for example, France, in spite of the fact that we are related by blood. You can see that early on Hitler believed the war in Europe would be brief, with his hope that Britain would see the 'error of their ways' and join hands with him to rule the world. Even as late as October of 1941 Hitler held on to the fantasy that the British people would run over to his side. But as the war raged on his dream of a unified 'white race' vs everyone else had been sorely tested.  Of his European ally Italy, Hitler had nothing good to say of them, even claiming that it was worse to have them as an ally than to have them do nothing at all.  Of Japan Hitler was initially aghast at having to ally with non-Whites (calling it a 'great tragedy' that Asia would be lost to the white race) but as the war went on his opinion of them raised, even wishing that Germany had a bushido spirituality like theirs. Among Africans and Arabs Hitler had found many allies(France and Britain had made a poor impression there), and again Hitler admired their Islam above that of European Christianity. Of India, the crown jewel of Britain's empire, Hitler had met the revolutionary Subhas Chandra Bose and saw an Indian revolution as something that would cripple Britain. And towards other 'White' people, Hitler divided them into arbitrary subgroups to brutally murder one another.  To sum it up, Hitler's feelings towards India was directly related to his feelings towards Britain. The more he admired Britain and emulated their empire while hoping they would become his ally, the less he thought of India and viewed them as a dehumanized resource to exploit (even throwing in casual comments on sterilization). The less he thought of Britain though and acknowledged the reality of his European war, the more sympathetic he was to India and other non-European peoples he was not warring with. My quotes came from these sources:    This is the same answer as I gave to a similar question:Andy Lee Chaisiri's answer to What was Hitler's attitude towards India? ",
            "date": "Answered May 29, 2014",
            "views": "1992",
            "upvotes": " View 1.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parikshit Sivan",
                    "user_href": "/profile/Parikshit-Sivan"
                },
                {
                    "user_id": "Jarod Rieth",
                    "user_href": "/profile/Jarod-Rieth"
                },
                {
                    "user_id": "Himanshu Koranga",
                    "user_href": "/profile/Himanshu-Koranga-8"
                },
                {
                    "user_id": "Aditya Pandey",
                    "user_href": "/profile/Aditya-Pandey-545"
                },
                {
                    "user_id": "Akshay Panchal",
                    "user_href": "/profile/Akshay-Panchal-174"
                },
                {
                    "user_id": "Rosie Lu",
                    "user_href": "/profile/Rosie-Lu-3"
                },
                {
                    "user_id": "Sulayman Ibraheem",
                    "user_href": "/profile/Sulayman-Ibraheem"
                },
                {
                    "user_id": "Sean Han",
                    "user_href": "/profile/Sean-Han-13"
                },
                {
                    "user_id": "Saketh Sarvepalli",
                    "user_href": "/profile/Saketh-Sarvepalli-4"
                },
                {
                    "user_id": "Kangpei Meng",
                    "user_href": "/profile/Kangpei-Meng"
                }
            ]
        },
        {
            "author_info": {
                "name": "Collin Spears",
                "href": "/profile/Collin-Spears-1"
            },
            "answer_text": "The Nazis felt the ancient Indians were \"Aryans\" like the German people, but the modern Indians were basically a result of Aryans that mixed with \"subhumans\" (untermensch).   So he believed the original Aryans were white, and they brought high civilization to India, they were warriors and philosophers. The problem is they mixed with the \"natives\" they conquered, so became inferior, the caste system was not enough to keep the races apart. Himmler had a special fascination with India, particularly what he believed as the \"ancient white Aryans\". Nazi Germany’s Fascination With Ancient India: The Case Of Heinrich Himmler  Perhaps the most fervent Nazi adherent to Indian Hindu traditions was Heinrich Himmler, one of the most brutal members of the senior command. IB TIMES: Heinrich Himmler was reportedly fascinated by Hinduism and ancient Indian culture and had read the Bhagavad Gita, among other classic Indian texts. How and when was he introduced to Indian culture? Was it prior to his joining the Nazi party, or afterward? TIETKE: As early as 1925, when Himmler was only 24 years old and had joined the SS, and just two years after Adolf Hitler's beer hall putsch, Himmler wrote: Kshatriyakaste, that is how we need to be. This is the salvation.[“Kshatriyakaste” referred to the military and ruling elite of the Vedic-Hindu social system of ancient India.]Himmler was deeply influenced by the Indologist, yoga scholar and SS Capt. Jakob Wilhelm Hauer of the University of Tübingen in Germany and the Italian philosopher Baron Julius Evola.Himmler had a keen interest in the Rigveda and the Bhagavad Gita. According to his personal massage therapist, Felix Kersten, Himmler carried a copy of the Bhagavad Gita in his pocket from 1941 until his death four years later. The book was a translation by the German theosophist, Dr. Franz Hartmann. IB TIMES: Germany's fascination with India and its culture started in the 19th century, no? That is, long before the advent of the Nazis? TIETKE: Yes, that's true. The fascination with and admiration of Indian culture can be found as early as the 19th century in the writings of pro-Aryan and anti-Semitic German philosophers and theosophists -- always in relation to Indian classical texts.In 1844, the German philosopher Friedrich Wilhelm Joseph Schelling highlighted in his lectures the same passage from the fourth chapter of the Bhagavad Gita, which 100 years later would fascinate Himmler – so much so that he dictated this passage to his massage therapist. This passage emphasizes that a person's identity does not have to be defined by one's actions -- that is, even if they commit evil acts, they can still remain untainted and unaffected by ones’ own actions.Moreover, in 1851, the German philosopher Arthur Schopenhauer raved about the enthusiastic spirit of the Vedas and the Upanishads, citing that his spirit is washed clean of all his early inoculated Jewish superstitions.IB TIMES: Is it true Himmler could read and speak Sanskrit fluently? Where and how did he learn such a difficult foreign language? TIETKE: Himmler read translations of Indian texts from well-known German and Austrian Indologists. However, there is no evidence that he had mastered or read the original Sanskrit editions. IB TIMES: As Reichsführer of the SS, Chief of the German Police, Minister of the Interior and head of Gestapo and the Einsatzgruppen killing squads, Himmler was responsible for the murders of millions of people. How did he reconcile such brutality with the tenets of Hinduism, which is a generally peaceful philosophy?TIETKE: Himmler had clear preferences with some of the scriptures of Hinduism. One was his interest in the Rig Veda, which in some places is imbued with much violence.The other was the Bhagavad Gita, which he greatly admired and appreciated. Himmler particularly referred to Krishna's instructions on satisfying one's duty on the battlefield and not to identify with such actions.In a poem written by Himmler, which I discovered in the Federal Archive in Koblenz, he tells stories about the holy life [that] unfolds itself on deadly born.For the period after the war, the Reichsführer-SS Himmler was already planning a retreat. He recommended that there should be sour milk and brown bread as physical food for his men and the Bhagavad Gita as spiritual nourishment and as the subject for meditation. IB TIMES: Aside from millions of Jews, Himmler was also responsible for the mass murder of up to half-million Roma (Gypsies). Did he not realize that the Roma are of Indian descent themselves? TIETKE: Himmler even killed his own comrades or SS officers, if, in his view, it served the supposedly higher cause, i.e., the ideology of National Socialism.Himmler was not really sympathetic so much to the complexities Indian culture, but rather to the ideal of the Kshatriya [warrior caste of India] and to the ideals of purity.IB TIMES: The Bhagavad Gita is partially about the adventures of Arjuna, the world's greatest warrior. Did Himmler fantasize that he was a 20th-century version of Arjuna “fighting for the glory of the Aryans”? TIETKE: Yes, I think so and there are such statements to confirm this. In fact, in an effort to explain his murderous violence, Himmler told his massage therapist Kersten that it would naturally be more pleasant to deal with the flower beds, instead of the sweepings pile and the garbage disposal of the state-- but without that garbage collection, the flower beds would not flourish.” IB TIMES: Did Himmler view Hitler as his “god” Krishna – like a reincarnation of the deity? TIETKE: Yes, there were statements by Himmler in which he described Hitler as incarnation of a great shining light, as a predestined karma of the Germanic world. Indeed, Himmler equated Hitler with Krishna.In the Bhagavad Gita, Krishna declared that he will always be reborn when the peoples' sense of right and truth disappeared and injustice ruled the world. Himmler commented that this verse related directly to Hitler. IB TIMES: Did Himmler envision the SS as a modern version of the ancient Kshatriya Hindu warrior caste? TIETKE: Absolutely. Himmler conceived of the SS as a kind of “spiritual” order. He demanded loyalty, moral integrity, and also required that his men never acted from base motives.However, he also required his men to have a pure conscience -- inwardly cold, sober and willing to kill for a higher purpose. IB TIMES: Discuss Himmler’s fascination with yoga and what he sought to gain from the practice. TIETKE: What Himmler had sought and found in yoga was legitimacy, relieving his conscience and overcoming his doubts.The concept of purity is found both in the writings of yoga as well as in the ideology of National Socialism --- that is, the idea that one has to detach oneself from such concepts as “good” and “bad.”This was conveyed to me in 1997 in a weekend seminar in my training as a yoga teacher: Three days of the seminar were based around the Bhagavad Gita. In fact, according to the assertions of speaker, it was the “karma” [fate, deeds] of the Jews to be destroyed, and it was the “dharma” [nature, order] of the Wehrmacht and the SS, to wage war. I did not agree with these assertions. IB TIMES: Did Himmler (and other top Nazis) use the Bhagavad Gita as a kind of a “blueprint” for the Holocaust and World War II? TIETKE: The Bhagavad Gita was for Himmler and also for top Nazi ideologue Alfred Rosenberg an important source of inspiration and legitimacy. They could refer to an ancient and sacred text to which British-German philosopher Houston Stewart Chamberlain and German philosopher Friedrich Nietzsche had already referred to.In their comments they wrote of the “Aryan race” and the “Aryan belief” (Chamberlain) and about the superman (Übermensch), the [lower-caste] Sudras as the servant race and the degenerates of all caste and about the eject materials in perpetuity (Nietzsche). IB TIMES: During World War II, there was a community of Indian nationalists living in Berlin. The most prominent of these was Subhash Chandra Bose, who met with many top Nazi officials, including Himmler, Joachim von Ribbentrop, Hermann Goering and Hitler himself. Is it true that Himmler was genuinely interested in helping Bose achieving independence for India (whereas most of the other German leaders only used Bose in a ploy to stoke anti-British sentiments in India)? ",
            "date": "Answered December 9, 2015",
            "views": "602",
            "upvotes": " View 225 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jarod Rieth",
                    "user_href": "/profile/Jarod-Rieth"
                },
                {
                    "user_id": "Saketh Sarvepalli",
                    "user_href": "/profile/Saketh-Sarvepalli-4"
                },
                {
                    "user_id": "Amey Sawant",
                    "user_href": "/profile/Amey-Sawant-86"
                },
                {
                    "user_id": "Varun Pandey",
                    "user_href": "/profile/Varun-Pandey-315"
                },
                {
                    "user_id": "Amogh Bajpai",
                    "user_href": "/profile/Amogh-Bajpai"
                },
                {
                    "user_id": "Lashin Sadiq",
                    "user_href": "/profile/Lashin-Sadiq"
                },
                {
                    "user_id": "Harsh Singh",
                    "user_href": "/profile/Harsh-Singh-3713"
                },
                {
                    "user_id": "Hazik Khan",
                    "user_href": "/profile/Hazik-Khan-6"
                },
                {
                    "user_id": "Saurabh Chavan",
                    "user_href": "/profile/Saurabh-Chavan-82"
                },
                {
                    "user_id": "Mike Lampon",
                    "user_href": "/profile/Mike-Lampon"
                }
            ]
        }
    ]
}