{
    "title": "What is a good primer on medieval history? - Quora",
    "tags": [
        "History Book Recommendations",
        "History Books",
        "Middle Ages (era)",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hailey Strickon",
                "href": "/profile/Hailey-Strickon"
            },
            "answer_text": "A Short History of the Middle Ages, I-II and Reading the Middle Ages: Sources from Europe, Byzantium, and the Islamic World by Barbara H. Rosenwein are what I have used for my medieval history courses, essentially a primer-textbook and a collection of primary source documents that establish a nice base of the time period. Rosenwein has a website accompanying the books, as well--basically a college level course rolled into one.  I've also heard good things about The History of the Medieval World: From the Conversion of Constantine to the First Crusade by Susan Wise Bauer Some more topic-specific (and/or just fun) volumes are from the Bedford series in history and culture, which offer thoughtful commentary with related primary documents.  The Time Traveler's Guide to Medieval England: A Handbook for Visitors to the Fourteenth Century / Ian Mortimer The Silk Roads : a brief history with documents / Xinru Liu. The Black Death : the great mortality of 1348-1350 / John Aberth. ",
            "date": "Answered April 7, 2015",
            "views": "11",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carmen Miller",
                    "user_href": "/profile/Carmen-Miller-10"
                },
                {
                    "user_id": "Udit Monga",
                    "user_href": "/profile/Udit-Monga-1"
                },
                {
                    "user_id": "Deirdre Beecher",
                    "user_href": "/profile/Deirdre-Beecher"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-1"
                },
                {
                    "user_id": "Ján Lučanský",
                    "user_href": "/profile/Ján-Lučanský"
                },
                {
                    "user_id": "Harvey Miller",
                    "user_href": "/profile/Harvey-Miller-4"
                },
                {
                    "user_id": "Andrei Kucharavy",
                    "user_href": "/profile/Andrei-Kucharavy"
                },
                {
                    "user_id": "Brent Fisher",
                    "user_href": "/profile/Brent-Fisher-1"
                },
                {
                    "user_id": "David R. Carpenter",
                    "user_href": "/profile/David-R-Carpenter"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fergus Brown",
                "href": "/profile/Fergus-Brown-4"
            },
            "answer_text": "When I studied Medieval History we started at 300 AD and progressed to 1300. That's 1000 years. We studied the late Roman Empire, the rise of Islam, early England, the Crusades, Magna Carta, the Papacy, and other subjects.It is a huge area rich in complexity and interconnectedness. In modern times our views have changed a lot and the notion of the Dark Ages is more or less dismissed. Perhaps you could usefully start with one aspect of the Medieval world and go on from there - which do you most enjoy?For good quality, readable modern primers you can start with some of the works of Michael Wood, a historian and TV presenter. His material is easy to read, tells good stories, and is technically sound.I enjoy reading historical fiction as well (not the romances, but the adventures, thrillers or crime stories set in the past). Bernard Cornwell's Saxon series and Grail Quest series are very enjoyable and well written (though perhaps more to the male reader's taste  - hard to say). This should keep you occupied for a week or two. Enjoy. ",
            "date": "Answered April 8, 2015",
            "views": "158",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carmen Miller",
                    "user_href": "/profile/Carmen-Miller-10"
                },
                {
                    "user_id": "Andrew Whitman",
                    "user_href": "/profile/Andrew-Whitman-2"
                }
            ]
        }
    ]
}