{
    "title": "What are the most important events that have happened globally in 2019? - Quora",
    "tags": [
        "World Events",
        "Historical Events",
        "2019 (year)",
        "Events (leisure)",
        "World History",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Jan 30, 2019-- Nathan Coppedge completes Leibniz's quest for the Characteristica Universalis, instructions for a universal scientific language. HISTORY OF PERPETUAL MOTION MACHINES: FEBRUARY 5 - 20, 2019: Escher Machine appears to be working again in some obscenely precise ratios: GODS MIGHT NOT REVERSE ESCHER MACH (GODS MIGHT NOT REVERSE ESCHER MACH) FEBRUARY 20, 2019: Extremely long natural purportedly upwards motion observed with the Reverse Escher Machine, however not fully confirmed, level was used flat horizontally and not all directions of the level were tested: LONGER RANGE REVERSE ESCHER MACHINE (LONGER RANGE REVERSE ESCHER MACHINE) FEBRUARY 26, 2019: Evidence of automatic motion with no altitude loss in the NIBW4: PMM EQUAL ALTITUDE LOSS? (PMM EQUAL ALTITUDE LOSS?) MARCH 8, 2019: Perpetual Motion Secrets (Perpetual Motion Secrets by Nathan Coppedge on Official Nathan Coppedge Blog) MARCH 21 - 22, 2019: Tandem experiments with the Escher Lever (M.C. ESCHER OVER-UNITY MACHINE (M.C. ESCHER OVER-UNITY MACHINE) ) and Vertical Lever (REAL-WORKING PERPETUAL MOTION EXPERIMENT (REAL-WORKING PERPETUAL MOTION EXPERIMENT)) indicate full cycles are possible with twisted cardboard in some very precise configurations (building on the Successful Over-Unity Experiment 4) and Vertical Lever is capable of something close to a full automatic cycle. **MARCH 26, 2019: FIRST EVIDENCE OF SUFFICIENT HEIGHT!**  APRIL 4, 2019: Further more careful suggestion that either the REVERSE ESCHER (QUICK ACCELERATION W/ REVERSE ESCHER) or the Original ESCHER MACHINE (ESCHER OR REVERSE) work with level. **MAY 9 - 10, 2019: FIVE ADDITIONAL EQUATION VARIATIONS FOUND: ***Spiral Cone:* Here the Spindle weight has the added weight, which is usual for the long end. If we assume the Spindle is 1X mass, this device follows the same rules as the first class of devices in spite of the use of a pendulum-like element. *Double Seesaw Motive Mass Machine:* The inertial resistance from the first seesaw must be << 1/2 of the second mass. Also, the motion of the second mass must be fairly close to horizontal, but never exactly horizontal. *Tilt Motor:* Table resistance = < 1/2 mass of rolling cone. *Natural Torque Device: *Assuming added mass of +1 on lever end, the weight of the wheel and the lever should average to the counterweight mass range which begins above the average +1 and ends at double that value - 1. *Original Escher Machine: *Momentum * Wedge factor = > 1/2 effective mass.*** ***During the longer motion the ball must move with net upwards motion. Downwards motion of course is easy.*** ****Note: All these five devices gave maxed out values of == <150% conventional over-unity.* **May 15, 2019: Fairly authentic ****Perpetual Motion Flying Machines** (https://nathancoppedge.quora.com/Perpetual-Motion-Flying-Machines)** invented.**  MAY 18, 2019: Information made available on “TOP 10” devices with maximum ratings of almost 150% conventional over-unity: Nathan Coppedge’s TOP 10 PERPETUAL MOTION MACHINES … —The History of Perpetual Motion Machines ",
            "date": "Answered May 20, 2019",
            "views": "274",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Lawrence",
                "href": "/profile/Jeff-Lawrence-80"
            },
            "answer_text": "Watching the Amazon rainforest burn. Watching the separation of immigrant children in Texas. Watching rural American family farms suffer. Watching mass shootings and police brutality on TV. And watching trump, Pence and McConnell not care. And conservative judges not care. However I am very optimistic about 2020 and the next decade. Young people will turn it around very soon. ",
            "date": "Answered December 23, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bob Rich",
                    "user_href": "/profile/Bob-Rich"
                }
            ]
        }
    ]
}