{
    "title": "What is the history of the United States of America? - Quora",
    "tags": [
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Rogers",
                "href": "/profile/Jon-Rogers-83"
            },
            "answer_text": "What is the start of American history? Great question. In answering it, I focus on it's precise meaning because, I agree that \"Definitions do matter.\" The start of \"American History\" in this question, means the beginning of the American Social Experiment that began in the age of Enlightenment during the revolt that took place in the British Colonies on the North American Continent in the late 1700s. Much had been written and debated about Political and Social systems prior to this time with the British Philosophers, Locke, Hume and others giving credit to the idea that the population might have more and more say in the powers that ruled over them at the time. I believe the true beginning of \"American History\" was when the Declaration of Independence, stating their grievances against the British Crown, outlined the set of principles that rephrased the various Colonies revolt into becoming the establishment of a society that identified, established and protected the Individual Citizen as the supreme ruler of their Society and Country. The timeless phrase, \"We hold these truths to be self evident that all men are created [socially and politically] equal. . .\" began a new era in the history of modern western Social arrangements. American History began with the Declaration and was established by the Constitution. The Declaration declared \"Why\" they fought and \"what\" they wanted to build. The Constitution declared the \"HOW\" they were going to do it. Those two founding documents changed human history. Today, they illuminate and educate people on a timeless principle, If you don't rule yourself, someone else will step in and rule over you. If you don't support yourself, then you are a servant to those who do support you. If you do not stand for your own independence, with truth, honor and SELF discipline, then you will be 'trained to follow' \"leaders\" who will control your destiny. \"America\" says we, you and I, individual citizens, are the last defense of Freedom. The founding fathers paid in blood to gain it, and if we lose it, future generations will have to pay in blood to get it back. You see, I disagree with the statement, \"The Past itself does NOT exist! It is gone forever and can never repeated as many erroneously believe. \" The past exists in the changes created by our forefathers that we live in today. We inherit what they have done. Their Past actions live on today, around us and in us. But what we do, also changes the future. And our children and grandchildren will have to live with our deeds. American History began a great change in human history. The last chapter is yet to be written. Are we capable of maintaining what we have been given? Or will we be corrupted and lose it. It is OUR choice that matters. The Future History of Humanity awaits our answer. ",
            "date": "Answered November 24, 2019",
            "views": "213",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elizabeth Lane",
                    "user_href": "/profile/Elizabeth-Lane-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shakeel Alibhai",
                "href": "/profile/Shakeel-Alibhai-1"
            },
            "answer_text": "(I’m going to assume that you mean the United States of America, and not the continents North and South America. The question’s topics reflect this.) The history of the United States of America is quite long and complex, but I’ll try to summarize it. Native Americans lived in America for a long time.Then Europeans came to America (including present-day Canada, Mexico, etc.)The Europeans took the Native Americans’ land and established colonies.In 1776, the 13 British colonies in the present-day United States declared their independence from British rule.A war ensued, which the United States won. The war ended in 1783.The now-former colonies established a government based on a document that they wrote called the “Articles of Confederation.”The Articles of Confederation were very weak, however, and they were subsequently replaced by a new document: the Constitution of the United States.George Washington was elected the 1st president of the United States after the Constitution was ratified.In 1803, the United States purchased the Louisiana Territory from France. This greatly expanded the size of the United States.In 1812, the United States went to war with Britain again. The war was fought to a draw and ended with a treaty in 1814 (although the last battle was fought in 1815).In 1846, the United States went to war with Mexico. The war, which ended in 1848, was won by the United States. The United States seized a huge portion of territory from Mexico in the war.In 1853, the United States purchased some more territory from Mexico. This event is known as the Gadsden Purchase.In December 1860, South Carolina, one of the states of the United States, seceded from the United States.Other states followed South Carolina in early 1861. They organized their own country: the Confederate States of America.The American Civil War was fought between the United States (in present-day northern and western United States) and the Confederate States (in present-day southern United States).The American Civil War ended in 1865. The United States defeated the Confederate States, and the union was preserved.In 1867, the United States purchased Alaska from Russia.In 1898, the United States went to war with Spain. Of the territory that the United States gained from Spain as a result of the war, it still has Puerto Rico and Guam. The United States also paid Spain $20 million.Also in 1898, the United States annexed Hawaii.The United States joined World War I in 1917 and World War II in 1941. (Pearl Harbor, in Hawaii, was attacked in 1941, which is what led to the United States entering the war.) From 1929 to 1941 — the majority of the “interwar period” — the United States, among other countries, suffered from the Great Depression, a time of severe economic hardship.From 1947 to 1989/1998, the United States was locked in a dispute with the Soviet Union. The United States supported the spread of capitalism, while the Soviet Union supported the spread of communism.The United States fought in the Korean War from 1950 to 1953, and the Vietnam War from the 1950s/1960s to 1973.The 1960s also saw the Civil Rights Movement, in which African-Americans gained equality. (Racism was unfortunately very prevalent in the United States prior to this.)On September 11, 2001, America was attacked by terrorists of Al-Qaeda. The Taliban government in Afghanistan supported Al-Qaeda, so the United States, and their allies in NATO (the North Atlantic Treaty Organization), invaded Afghanistan.The United States, among other countries, experienced the “Great Recession” from around 2007 to 2012. That was also a time of economic hardship, although not as severe as the Great Depression.The United States, and some of their allies, invaded Iraq in 2003. That war lasted until 2011 (although it led to the Iraqi Civil War from 2014–2017, although the United States did not directly fight in that).",
            "date": "Answered December 11, 2017",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "JOey GRiffin",
                    "user_href": "/profile/JOey-GRiffin-23"
                },
                {
                    "user_id": "Shiladitya Dash",
                    "user_href": "/profile/Shiladitya-Dash"
                },
                {
                    "user_id": "Himanshu Sharma",
                    "user_href": "/profile/Himanshu-Sharma-3566"
                },
                {
                    "user_id": "Bhavya Gandhi",
                    "user_href": "/profile/Bhavya-Gandhi-22"
                },
                {
                    "user_id": "Rims Gaut",
                    "user_href": "/profile/Rims-Gaut"
                },
                {
                    "user_id": "Umair Munir",
                    "user_href": "/profile/Umair-Munir-12"
                },
                {
                    "user_id": "Cheeco Bean",
                    "user_href": "/profile/Cheeco-Bean"
                }
            ]
        }
    ]
}