{
    "title": "What has been the impact of Islam and Christianity in Africa? - Quora",
    "tags": [
        "Africa",
        "Islam",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Innocent Masengo",
                "href": "/profile/Innocent-Masengo"
            },
            "answer_text": "I will talk about Christianity since I am a Christian. The first formal schools were set up by Christian missionaries. They were called mission schools. Most of these were pivots upon which modern public schools, colleges and universities are built.Christian Missionaries set up hospitals and other health facilities and their accompanying health training schools for nurses and other health workers. They laid foundation for modern day health facilities and medical training facilities.Christianity put a blade on polygamy and other traditions deemed undesirable. Polygamy still persists today but on a much low scale. The same way as many other rituals and practices like human sacrifice, witchcraft and worshipping trees and hills.Christianity shaped the political terrain to some extent. In Uganda, for example, the first political parties divided the population based on religious lines, and pitied Catholics against Anglicans. It was so bad that it led to blood shed. At the height of such rivalry, in my grandfather's village, Catholics would go defecate in the Anglican churches, and the Anglicans would respond in kind. These religious sentiments are still traceable in Uganda’s political discourse. This was not exclusive to Uganda. Many other African countries experience(d) similar or related situations.Christianity led to an identity crisis among Africans. They are still caught between religion and tradition. They go to church on Sunday and visit ancestral shrines on Monday. Marriage must consist of a traditional wedding and a church wedding. The naming system: a child is given two names; a traditional name usually called a family name or sur name, and a “Christian” name also called the first name. Most Africans, if pushed, will fall on either side of the fence.Christianity, on one hand, has also produced lazy and weak-willed Africans who have interpreted the Bible to their convenience, that, they can pray and do no work, and wealth will just happen to them. They recite scripture out of context, such as “Happy are the poor for they will inherit the kingdom of heaven”. Many go on to pray all day without work, and sleep in church, and reduce themselves to begging as they wait for a miracle. This has partly given rise to pastors who scam gullible Christians, promising them miracles if they “sow a seed” to God via the pastor. So, religion has in a way impoverished Africans further.Christianity, on the other hand, has given rise to a morally upright crop of Africans that is shaping the modern African society through the teaching and application of biblical principles in all spheres of influence, otherwise called the Seven Mountains. One example of such Christians is Zimbabwean-South African entrepreneur Strive Masiyiwa. Such Christians influence society through writing, teaching, lifestyle, family/parenting, and philanthropy.There may be more ways in which Christianity has affected Africa. I have largely based on my Ugandan experience, and I am aware that these cut across other African countries. This is however not to deny that there are some peculiarities. ",
            "date": "Updated January 7, 2018",
            "views": "953",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rahman Mohammed Abdul",
                    "user_href": "/profile/Rahman-Mohammed-Abdul"
                },
                {
                    "user_id": "Ramesh Bollineni",
                    "user_href": "/profile/Ramesh-Bollineni"
                },
                {
                    "user_id": "Samuel Ntege",
                    "user_href": "/profile/Samuel-Ntege"
                },
                {
                    "user_id": "Kebe Adunmadon",
                    "user_href": "/profile/Kebe-Adunmadon"
                },
                {
                    "user_id": "Adams Patton Pedro",
                    "user_href": "/profile/Adams-Patton-Pedro"
                },
                {
                    "user_id": "Osahon Akharoh",
                    "user_href": "/profile/Osahon-Akharoh"
                },
                {
                    "user_id": "Yaqub Odemona",
                    "user_href": "/profile/Yaqub-Odemona"
                },
                {
                    "user_id": "Adzka Mumtaz",
                    "user_href": "/profile/Adzka-Mumtaz"
                },
                {
                    "user_id": "Tswelo Moshe",
                    "user_href": "/profile/Tswelo-Moshe"
                },
                {
                    "user_id": "Jonathan Musere",
                    "user_href": "/profile/Jonathan-Musere"
                }
            ]
        }
    ]
}