{
    "title": "What is the healthiest canned food? - Quora",
    "tags": [
        "Canned Foods",
        "Survival"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lou Heavner",
                "href": "/profile/Lou-Heavner"
            },
            "answer_text": "Most canned foods should be pretty healthy. I would stay away from the more processed foods in a can. Sardines, salmon, and anchovies packed in water or olive oil would be good. Canned vegetables are generally ok, but not always as tasty as fresh or frozen. Again, look for vegetables packed without a lot of other stuff. I avoid grains and legumes since I follow a paleo/primal diet. Green beans, carrots, tomatoes, artichokes, chilies, and mushrooms are good examples. Asparagus and spinach would be healthy, but in my opinion, don’t taste very well out of a can. If you do dairy, canned evaporated or condensed milk are fine, but i’d Shy away from the sweetened varieties. Fruit is ok out of a can. Often it is heavily sweetened with corn syrup. Look for canned fruit that is packed only in its own juice with no sugar added. Pickles and olives are also ok out of a can (or jar). ",
            "date": "Answered October 14, 2018",
            "views": "255",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quang Trung",
                    "user_href": "/profile/Quang-Trung-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate",
                "href": "/profile/Kate-2559"
            },
            "answer_text": "It’s great to have some healthy canned foods in your pantry to pull from, especially when you’re at a loss for what to cook for dinner. I like to have black beans, pinto beans, kidney beans, garbanzo beans, cannellini beans. I usually have some canned lentils as well. I also like to keep canned artichokes (in water), olives, vegetarian baked beans, tomatoes, and diced green chilies on hand. I follow as close to a whole-food plant-based diet as possible and find that having these items on hand I’m able to pull together a dinner with just a few added ingredients, sometimes dinner is a baked potato with baked beans and some frozen broccoli on nights I don’t feel like cooking. I also like to use smashed garbanzo beans to make a mock “tuna fish” salad. Or canned lentils with chopped carrot, red onion, tomatoes, and some fresh parsley and balsamic vinegar. ",
            "date": "Answered January 31, 2020",
            "views": "80",
            "upvotes": "0"
        }
    ]
}