{
    "title": "What did the Nazis do to the Jews? - Quora",
    "tags": [
        "Nazism",
        "Nazi Germany",
        "Jewish Ethnicities and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Evee Megann",
                "href": "/profile/Evee-Megann"
            },
            "answer_text": "First of all, the Jewish was made to be a minority by Hitler introducing the terms “Herrenvolk” ( the master race) and the Untersmichen ( undesirables), and obviously the Aryans were the master race, and the Jewish was the undesirables, for example, the Jews, the black people, Gypsies, disabled people and the ‘Slavs’ (Slovakians). By Hitler introducing these terms, it sent some people incredibly big-headed, and so the respect from the German people towards the Jews had almost completely banished. This was taken even further when Goebbels had introduced propaganda making the Aryans look muscular and hardworking, and almost beautiful, whilst portraying the Jewish as fat, ugly and paedophiles, which of course due to the anti-Semitism of the Germans, people sadly believed and enforced their children to stay away from any Jewish people. The Nazi’s also introduced eugenics, a lesson which taught which genes were better than others, for example, the Aryan genes were superior to the Jewish genes. The Nazi’s created this lesson as they wanted more and more people to believe them, and attempted to back their ideologies with science to make ‘proof’ of what the Jews were really like in Nazi’s eyes. All school curriculum books and subjects had to be ‘Nazi-approved’, which basically meant there had to be some anti-Semitism in there. I once read a textbook question which stated… “If the Nazi party could lend a loan to two Aryans who wanted to get married of 1000 rentenmarks, and eventually had children to increase the Aryan population, or keep a mentally disabled Jew alive at 4RM (rentenmarks) a day for the rest of their lives, which one would be more efficient?” The Nazi's involved either anti-Semitism or militarisation in all of their school curriculum in order to brainwash the children as they grow up. After a French Jew had shot a Nazi officer in France, the German people found an excuse to lash out at the Jewish community, in ‘Kristallnacht’ (night of the broken glass). This was the first time that the abuse towards the Jewish turned from verbal to physical, as synagogue’s were burnt, Jewish businesses were smashed up and robbed, Jewish books were burnt and Jewish people were physically assaulted. The Nazi's let this take place for a day before they decided it would look bad if they didn't stop it. However, the made the Jewish community pay for all of the damage done, as well as cleaning up all of the streets of debris from the happenings of Kristallnacht. The Nazi's then enforced the Nuremburg laws. These stated that the Jews weren't allowed in certain public places such as the theatre, swimming pool or parks. This is also the law of the famous ‘star of David’ armband which was forced upon the Nazi's to wear wherever they went. Not only this, but they also stated that Aryans could not marry Jewish people, and that all Jewish women must be sterilised, meaning they would no longer be able to have children. Hitler enforced these laws to ensure that whilst the Aryan population was growing, the Jewish population was eventually dying out, making Germany ‘great again’. The t4 programme was eventually set up, as instead of looking after a disabled person for 4RM a day, they began to execute them, at first by bullet, and then by gas, before their bodies were burnt into ashes and sent into the air. However, this was later enforced to the Jewish as well, as when all Jewish were evicted from their houses and businesses, and were rounded up and sent into ghettos whilst waiting to be deported to another country, it was apparently taking too long, and there were ‘too many’ of them. This where concentration camps for the strong, and at first, healthy Jewish people would go to work in order to ‘help’ the Nazi part get out of their increasing debt of rearmament and unemployment schemes. on the contrary, weak, old or ill Jewish people would be sent in another direction, to be gassed straight away. ",
            "date": "Answered April 11, 2017",
            "views": "320",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Wang",
                "href": "/profile/Sean-Wang-165"
            },
            "answer_text": "To paraphrase, Very bad things. They first dehumanized them, and they were still able to be Jews, but they could not be Jews. There were anti-Semitic movies. There were anti-Semitic books (der giftpilz). There were anti-Semitic posters. I’m crappy at the magic three, so I’ll make it the magic four. There were anti-Semitic EVERYTHINGS! They second expanded this, as they conquered new countries. Jews were squeezed into ghettos and packed in houses. There were several families per room, and routine mistreatment, malnutrition, and deportations whittled down the population. But it was not enough. They third ended this, in the Final Solution. Exterminaion. Concentration camp. Work makes you free: the work made you free-to die as a blessing, not a curse. Mengele. The angel of death. Fourth, it ended. But it never really ended. ",
            "date": "Updated May 4, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raunakk Chandhoke",
                    "user_href": "/profile/Raunakk-Chandhoke"
                },
                {
                    "user_id": "JJ Hood",
                    "user_href": "/profile/JJ-Hood-1"
                },
                {
                    "user_id": "Abhinav Rachakonda",
                    "user_href": "/profile/Abhinav-Rachakonda"
                }
            ]
        }
    ]
}