{
    "title": "What has the black community appropriated from the Jewish community? - Quora",
    "tags": [
        "Community",
        "Judaism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Clamage",
                "href": "/profile/Marc-Clamage-1"
            },
            "answer_text": "What has the black community appropriated from the Jewish community? Who cares? Appropriation is something that people who feel they’re getting the short end of the stick worry about. Social winners don’t care about this stuff. Sure, tell everyone you’re the real Jews (wink, wink).[1] Same goes for New Age Kabbalah[2] and “faux mitzvahs.”[3] We don’t care. It’s a compliment, right up until the point that you try to appropriate our lives rather than our traditions. Then, in the words of a great Jewish superhero,[4] “It’s clobberin’ time.” Footnotes[1] Black Hebrew Israelites - Wikipedia[2] Kabbalah Centre - Wikipedia[3] New teen trend: ‘Faux Mitzvahs’[4] Thing (comics) - Wikipedia",
            "date": "Answered November 13, 2019",
            "views": "150",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Seth Chazanoff",
                    "user_href": "/profile/Seth-Chazanoff-1"
                },
                {
                    "user_id": "Yonatan Rocha",
                    "user_href": "/profile/Yonatan-Rocha"
                },
                {
                    "user_id": "R Moses",
                    "user_href": "/profile/R-Moses-1"
                },
                {
                    "user_id": "Ari Einat",
                    "user_href": "/profile/Ari-Einat"
                },
                {
                    "user_id": "Rebekah Orea",
                    "user_href": "/profile/Rebekah-Orea"
                },
                {
                    "user_id": "Mitch Cohen",
                    "user_href": "/profile/Mitch-Cohen-20"
                },
                {
                    "user_id": "Jonah Stern",
                    "user_href": "/profile/Jonah-Stern"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malik Wright",
                "href": "/profile/Malik-Wright-39"
            },
            "answer_text": "The Jewish Rabbis and sages don't speak about when the bad figs went into Egypt (Sahara) and never returned back to the land. They also don't speak about how after the Syrian wars there were no lost tribes, because King Hezekiah called all 12 tribes to the Passover. They also don't talk about how in Ezra the good figs from Babylon came back with children from marriages from forbidden nations, like the Hittites and Canaanites. And they also don't talk about how Ham wasn't cursed and only Canaan was cursed. And they also don't talk about the fact we aren't black but are brown. From my statements alone we can conclude so much. We so called blacks don't follow their traditions, because the actual tanakh tells us everything we need to know. We see this Jewish nation as a mongrel people, and we remember the mixing in Ezra and remember many people blocked from the heritage and we look at them and see exactly that. And we go and ask them what happened to Israel that went into Africa? If I am mixed with blood of Indians and Brittish is that Ammonite, is that Hittite, is that Canaanite? But are the Jews who follow the Babylonian Talmud Ammorites? Us blacks aren't actually following them at all, we don't acknowledge them as Israel whatsoever. This is why we don't join them, remember in Deuteronomy we were commanded not to make pacts with these people, and most of us haven't. ",
            "date": "Answered November 14, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deana Nicole",
                    "user_href": "/profile/Deana-Nicole-5"
                }
            ]
        }
    ]
}