{
    "title": "What led the Southern states to secede from the Union in 1860 and 1861? - Quora",
    "tags": [
        "Southern States",
        "Secessionism in the USA",
        "The American South",
        "Political History of the United States of America",
        "U.S. Civil War",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "History of the United States of America",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Schundler",
                "href": "/profile/Michael-Schundler"
            },
            "answer_text": "They believed Federalism was leading to the erosion of states’ rights. The slavery issue was one of many where the South disagreed with the prevailing sentiment of the country and were concerned that the prevailing sentiment would lead to abolition of slavery. The South had adopted slavery early. The massive amounts of cheap land on the frontier drained the “working” class from the southern states as these individuals sought their fortunes on the frontier. So the southern plantation owners began to substitute “free” labor with slave labor. At the time, this initially began, slavery was a common institution throughout the world. As far back as 1662, the British began using African slaves when slaves from India and Native American slaves had not worked well on their sugar plantations. So taking a page from the British in the Caribbean, the British in the southern colonies began importing slaves to solve their labor issues. Then the cotton gin made southern cotton very competitive and so massive amounts of additional acreage were brought under cultivation exacerbating the already short labor supply. And the demand for slaves exploded. Suddenly, slave labor unpinned the southern economy. Throughout the 18th century, sometimes referred to as the Age of Reason, the concept of unalienable rights began to emerge and take form and beliefs in unalienable rights raised serious concerns over the morality of slavery. Almost immediately after our nation came together under the Constitution, the first shot was fired… the importation of slaves would end in 1807. I wonder if the idea was that with no more importation, the institution of slavery would end as those slaves “aged”. If so, that assumption was wrong. The South had built their economy on slave labor and so convinced itself that slavery was not “evil”, even if did not comport with the Declaration of Independence where we announced “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty, and the pursuit of Happiness.” While the South had legitimate reasons to fear Federalism, it is my opinion that the issue of slavery was never a “right” granted to the states. From the beginning the a human’s unalienable rights and the associated “secondary” rights outlined in the Bill of Rights were in fact the responsibility of the Federal government to protect. As such, the Federal government was actually slow to emancipate the slaves and the South while fearing Federalism were wrong to have continued the institution of slavery no matter how important it was to its economy… the decision to secede was largely a function of its failure to fully embrace the rights of man on which our government was designed to defend. ",
            "date": "Answered April 23, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Joosse",
                    "user_href": "/profile/Chris-Joosse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Vanderpool",
                "href": "/profile/Ben-Vanderpool"
            },
            "answer_text": "It wasn't so much a person as an ideology. The southern states recognize that slavery was under attack by the north and over the years before the civil war, banded together to protect their “right” to own slaves. The states realized they were stronger together. When abraham Lincoln ran for president, the south recognized that he was a threat to them. So when lincoln was elected, the only course of action, in their eyes, was to secede. It wasnt one person who led the states, but one ideology. ",
            "date": "Answered April 23, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaimi McEntire",
                    "user_href": "/profile/Jaimi-McEntire"
                }
            ]
        }
    ]
}