{
    "title": "What happened to the oil deposits that are older than 100 million years? - Quora",
    "tags": [
        "Oil (fossil fuel)"
    ],
    "response": [
        {
            "author_info": {
                "name": "TJ Berens",
                "href": "/profile/TJ-Berens"
            },
            "answer_text": "What happened to the oil deposits that are older than 100 million years? ALL oil was created over 100 million years ago. Basically, all the oil was created during the Carboniferous period (An amazing coincidence no?) ;p The Carboniferous period was a time when conditions on earth were very different, and, plankton and algae, when they died, decomposed into materials that they do not decompose into any more (Oil is basically decomposed plankton and algae, that decomposed in a particular way) Petroleum - Wikipedia Kerogen - Wikipedia Petroleum geology - Wikipedia Exploration & Production Geology The Carboniferous Period Carboniferous - Wikipedia So, basically, all of the oil we can use commercially was from about 300 millions years ago, to about 360 million years ago, and, that is basically it. :D ",
            "date": "Answered July 9, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Oates",
                "href": "/profile/William-Oates-11"
            },
            "answer_text": "Some of them have been produced, some have cooked down to methane and other gaseous hydrocarbons, and some remain in the ground. ",
            "date": "Answered July 8, 2020",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Fessenden",
                    "user_href": "/profile/Tom-Fessenden"
                },
                {
                    "user_id": "George Gogue",
                    "user_href": "/profile/George-Gogue"
                },
                {
                    "user_id": "Todd Lovett",
                    "user_href": "/profile/Todd-Lovett-1"
                }
            ]
        }
    ]
}