{
    "title": "What are some examples of forced migration? - Quora",
    "tags": [
        "Migrations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Noel",
                "href": "/profile/Lawrence-Noel"
            },
            "answer_text": "Forced migration will occur when the living environment becomes physically or socially unsustainable. If people live in low-lying coastal areas that are subject to global warming, they may be forced to relocate due to rising sea levels. People living on islands have begun to experience that already. If there is conflict in an area in which two opposing armed forces meet, the residents are likely to move out of harm’s way rather than become victims of the conflict. When a group of people is singled out as undesirable in an environment in which the majority of residents is willing to use violence to enforce its will, people will leave the area in search of another place to live. People living close to a source of danger, such as an active volcano, may be forced to migrate as the frequency and violence of the volcanic activity becomes greater. This would be especially true if the geological features of the environment are changed by the activity. Loss of food sources can also cause people to migrate. Pollution of croplands or bodies of water may force people to leave the area in order to find other sources of sustenance. Essentially, any condition of life that results in an ongoing threat to life itself or to the quality of life will cause people to migrate elsewhere. ",
            "date": "Answered November 16, 2016",
            "views": "7",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryszard Rakowski",
                    "user_href": "/profile/Ryszard-Rakowski"
                },
                {
                    "user_id": "Hardip Singh",
                    "user_href": "/profile/Hardip-Singh-42"
                },
                {
                    "user_id": "Kumari Juli",
                    "user_href": "/profile/Kumari-Juli-1"
                },
                {
                    "user_id": "Ellie Platt",
                    "user_href": "/profile/Ellie-Platt-7"
                },
                {
                    "user_id": "Arafat Sk",
                    "user_href": "/profile/Arafat-Sk-6"
                },
                {
                    "user_id": "Ananya Chowdhury",
                    "user_href": "/profile/Ananya-Chowdhury-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "S Kosasih",
                "href": "/profile/S-Kosasih"
            },
            "answer_text": "War. Natural disasters. Very high level of hatred between groups of ethnicities and legal favoritism Poverty and no hopes for the future Religion controlled countries There are many more but these are the usual reasons why people migrate to other countries. In case of “forced” migration, might be just war and extreme natural disasters. ",
            "date": "Answered July 23, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hardip Singh",
                    "user_href": "/profile/Hardip-Singh-42"
                }
            ]
        }
    ]
}