{
    "title": "What did people think of King Henry VIII of England? - Quora",
    "tags": [
        "King Henry VIII (historical figure)",
        "History of Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lissa Bryan",
                "href": "/profile/Lissa-Bryan"
            },
            "answer_text": "If your question is about the ordinary people of England in the era, the answer becomes a little complicated. People in the Tudor era were taught from birth about the “great chain of being,” the social order that had been ordained by God. In essence, God selected each person to occupy their position in the world, either for their virtues/brains or because of their sinful nature. Thus, a duke and a starving peasant both “deserved” their state because God had ordained it. Each person had their duty in life to serve those God had placed above them, and service to that person was as service to God. Of course, we have to consider personal resentments and human frailty in this equation, but people had this lesson sternly impressed upon their minds that defiance of that social order was sinful. Kings, especially, were the choice of God to rule over a nation. Henry VIII took this to especial extremes when he declared himself not only head of the temporal realm of his kingdom, but the spiritual as well in making himself Head of the Church. Once kings were crowned and anointed, they were supposed to be accountable only unto God. Questioning the king or speaking out against him could have severe consequences. Henry’s records are rife with reports of people being punished for speaking out against his treatment of Katharine of Aragon or his marriage to Anne Boleyn. Then Henry made silence a treasonous act - a man could be convicted of treason if he refused to swear Henry’s marriage to Anne was legit and Henry was head of the church. Most of the criticism of a king’s reign fell on his advisers. Criticizing the king directly was dangerous; saying his advisers were giving the king bad information or leading him astray was a much more acceptable alternative. That’s one of the reasons Henry VIII decided to execute two of his father’s ministers as soon as he took the throne. It was a highly popular decision because those men had been in charge of Henry VII’s hated policies. Katharine of Aragon herself held to this notion. As late as 1527, she was telling her partisans that Henry didn’t really want to leave her and that her poor treatment wasn’t his fault. It was the fault of wicked people around him, preventing him from coming to visit her, and if he would just come to speak with her, everything would go back to the way it was immediately. Henry VIII also knew the value of what we’d call today “the cult of personality.” He carefully stoked his personal popularity among the people with sudden and unpredictable displays of generosity and magnanimity. He was the master of the grand gesture. He also controlled his public image, insisting on artistic representations which highlighted his personal strength and virility (his daughter, Elizabeth, learned much from him about the power of public image.) He was their “bluff King Hal,” a gregarious and generous man, and even his endless parade of wives was presented as being “for England” — his effort to provide the kingdom with heirs and stability. It’s human nature, when presented with something that seems immutable and unchangeable, to express adherence — sometimes even enthusiastic support. But the emerging Protestant ideology didn’t hold to the notion of “the great chain of being.” While not true equality as we think of it, the Protestant school of thought held that men were equal in the sight of God, and concepts that had been unquestionable in the past were now being challenged. ",
            "date": "Answered December 23, 2018",
            "views": "189",
            "upvotes": " View 163 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen Leach",
                    "user_href": "/profile/Stephen-Leach"
                },
                {
                    "user_id": "Erin Quinn",
                    "user_href": "/profile/Erin-Quinn-85"
                },
                {
                    "user_id": "Raffael Garcia Marquez",
                    "user_href": "/profile/Raffael-Garcia-Marquez"
                },
                {
                    "user_id": "Paul Richard",
                    "user_href": "/profile/Paul-Richard-8"
                },
                {
                    "user_id": "Eliza Enciso",
                    "user_href": "/profile/Eliza-Enciso"
                },
                {
                    "user_id": "D.M. Burke",
                    "user_href": "/profile/D-M-Burke"
                },
                {
                    "user_id": "Adrianne Wood",
                    "user_href": "/profile/Adrianne-Wood-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Baroness-Machiavelli"
                },
                {
                    "user_id": "Dedra Cee Sanchioni",
                    "user_href": "/profile/Dedra-Cee-Sanchioni"
                },
                {
                    "user_id": "Mary Choromokos",
                    "user_href": "/profile/Mary-Choromokos"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Orchard",
                "href": "/profile/John-Orchard-14"
            },
            "answer_text": "A challenging question! “What did people think of King Henry VIII of England?” What did… Ok, so we are not speaking about what people DO think of Henry VIII, but only about what they did think about him. The trouble is it is not clear whether ‘people’ refers to people that are in the here and now, or whether they are people of the past - and then how long past? This is not an exercise in semantics, but a necessary series of reflections, because the answer will, indeed must, be dependent on the question ‘who?’, or ‘which people?’, as well as the period in time in which they live(d). I am fairly certain that descendants of close relatives of Richard III would have a curiously different view to Henry than, say descendants of Henry VII. If the people doing the thinking were near contemporaries of Henry VIII, then they would be considerate in expressing any opinion because it was a subject that was potentially life threatening in what was, still, an absolute monarchy with a largely advisory parliament (except in matters of taxtation of the people). Those people who loved later, but still within the Tudor or Stuart eras, Shakespeare being a great example, would have bene positively gushing about him. It was still necessary to justify that Henry VII had been a legitimate king, and thereby validating those who came later. Most people who came later tended to focus on the six wives, the fact that he had that many, and the fact that they met the various ends that they did. The politics that underpinned these events has largely been glossed over, although more recent media productions on the lives of the various Tudors, and their households, have been more nuanced in their approach to reporting history. Many will think good or bad about the fact that his actions led to Roman Catholicsim being banned in England and its adherents restricted in their ability to worship or in holding official office, and the fact that if they failed to attend Anglican churches then they were heavily fined for recusancy. Most people will be familiar with his image from the paintings by Holbein and others, and will be aware that he was overweight in middle age. My guess is that very few people give him any more thought than that. ",
            "date": "Answered December 23, 2018",
            "views": "474",
            "upvotes": "0"
        }
    ]
}