{
    "title": "What is the most expensive item you've ever bought? - Quora",
    "tags": [
        "Expensive Things",
        "Pricing",
        "Online Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sati Marie Frost",
                "href": "/profile/Sati-Marie-Frost"
            },
            "answer_text": "That would be my car. I never really planned to buy a car, never really wanted one, but we drove past the dealer and I saw it and suddenly I knew I had to have it. This happens on a fairly regular basis, but never before (or again) with cars. Typically it happens with places or people. I live my life according to the whims of fate, and the voices in my head. From time to time I’ll see a person, or the name of a place, and I’ll get a jolt that feels like getting punched in the solar plexus except kind of nice…and then the voices in my head start up their chorus, which is one of a handful of refrains. They might say, There’s something you have to do. Or There’s somewhere you need to be. Or There’s someone you need to help. Those are the main three, though occasionally they’ll say something new. Usually when they start up, I scan the crowd - or a map, or a list of cities, whatever - and something will jump out at me and give me that nicely-punched feeling again, and I’ll know that’s where I have to go. When I get there, I use my instincts to figure out what I’m supposed to do. Occasionally this involves plane tickets and passports. Once I found myself in Denmark, another time in Washington D.C. It’s always interesting dealing with customs when they ask me why I’m visiting and I haven’t a clue. Anyway, on this day, the voices said You need to buy that car. So I told mom to stop her car, and went to talk to the dealer. He was an absolute crook, and if I’d been planning on buying a car I never would have bought from him, but I wasn’t planning on buying a car, I didn’t want a car, and the voices didn’t want a random car, they wanted this car. So I talked to the dealer, he told me he’d just got it - possibly a lie, who knows - and that it would likely go soon, but if I could get financing, he could hold it till tomorrow. I went home, put on my most responsible-looking suit - the black one that had a miniskirt without a thigh slit - and a top of Mom’s, went to the bank, and asked for money. This was 2005, age of the subprime mortgage, and they didn’t give a shit that I didn’t have any assets and my job paid less than minimum wage. Luciano the Armani-model-banker gave my bank statements a cursory look, set up a 5-year plan for me, and I walked out a half hour later with a £2500 loan. I went to the dealer, signed the papers, gave them a check - probably the last thing I used my checkbook for - and that same day was the proud owner of a shiny red MX-5. (Miata in the US, Eunos Roadster in Japan, where it was imported from. It’s been a PITA to get pieces, I can tell ya. For some reason they’re just slightly different from the U.K. version.) Shit. Now what do I do? I don’t have a driving license. I took maybe six lessons. Then The Incident happened, and suddenly I was brain-damaged and spine-damaged and had no coordination - everything had to be learned again, from swimming to using chopsticks, and some things, like piano, I never relearned - and there was no way in all the nine worlds that I’d be able to learn to drive. I gave the car to my mom. She said she’d drive it occasionally, but it was too flashy for daily use. Then, a few weeks after she said that, her Fiesta gave up the ghost and we didn’t have the money to repair it (again), so she sold it to the mechanic down the road who wanted a beater for his teenager, and - grudgingly at first - started driving my MX-5 full time. She often said she felt silly driving it, but more than once I caught her speeding along with the top down, Tupac playing on the CD player at full blast. I still have no idea why I bought that car. ",
            "date": "Answered October 4, 2020",
            "views": "746",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carsten Sorensen",
                    "user_href": "/profile/Carsten-Sorensen-3"
                },
                {
                    "user_id": "Jennifer Edeburn",
                    "user_href": "/profile/Jennifer-Edeburn"
                },
                {
                    "user_id": "Trevor Reeves",
                    "user_href": "/profile/Trevor-Reeves-29"
                },
                {
                    "user_id": "Michael McClennen",
                    "user_href": "/profile/Michael-McClennen"
                },
                {
                    "user_id": "Jan Jones",
                    "user_href": "/profile/Jan-Jones-32"
                },
                {
                    "user_id": "Ashley Bodnarchuck",
                    "user_href": "/profile/Ashley-Bodnarchuck"
                },
                {
                    "user_id": "Dia Osman",
                    "user_href": "/profile/Dia-Osman-1"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                },
                {
                    "user_id": "Roger Still",
                    "user_href": "/profile/Roger-Still-1"
                },
                {
                    "user_id": "Steve Watson",
                    "user_href": "/profile/Steve-Watson-108"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Murphy",
                "href": "/profile/Jay-Murphy-52"
            },
            "answer_text": "When I was 24 years old, I bought myself a nearly $2000 (USD) purse. This is it right here. It’s called the Gucci Mini Sega in metallic gold. All the whimsical luxury websites wrote had product descriptions of it that liken the bag to a piece of priceless art history. The esteemed Gucci, 2018 Spring Collection, whimsical SEGA arcade pattern, a throwback to retro.  At that period in my life, I was in between universities. I had graduated with a BS and an MS and I was applying to further programs. In the “wait” time, I was feeling quite down with a low opinion of myself, despite having graduated at the literal top of my class. I was grateful for my life, my experiences, and my family, but I just felt like I had no skills. I felt like I had achieved nothing. I’ve always been a rather quiet, studious kid. I take things way too intensely and seriously. I had become quite antisocial too by the end of my first round of university and as I waited on another acceptance, I found some comfort in the internet. Like most millennials and gen-z’s, I was obsessed with watching Youtube vlogs. I don’t know how it happened, but I ended up binging luxury channels. Here I saw all of these adults, younger than me and older than me, with Chanel and Gucci and Louis Vuitton. They seemed so put together. Well dressed and beautiful with huge collections of designer items. Like they had the entire world at there fingertips. So successful. Meanwhile, I was sitting on the other side of the world, watching them, studying chemistry, and looking rather homeless. And not in a fashionable way. The truth is, I really wanted to feel good about myself. I wanted something that would be a measure of some kind of success—I don’t know why my two diplomas didn’t fill that role for me. And deep down, I’ll admit, I wanted to be a lady. Studying rough science made me feel smart, but had also turned me into someone who felt I couldn’t dress up. My friends and colleagues knew me as the ugly girl who didn’t wear make-up or more than sweats/jeans. That’s another story. I just rambled a lot. But from what I’ve said, you can tell I was Lost in the Sauce(TM). I had a lot of emotions and none were good. I got sucked into the hype of “label mania” and “beauty/fashion gurus” as I sat, wanting to be someone going places. I took their purchasing advice just as seriously as I did anything else… [Side note: I had always been frugal too. My parents would make fun of me in a loving way because I was cheap. I never shopped. I would save any money I made and when I stopped working to study full time, I barely used the money my parents would give me. It came to the point where my mother sat me down one day and *asked* me to buy some clothes. She too was tired of me looking homeless. LOL! She said I never bought anything for myself. I told her I didn’t want to waste money and she said they gave me “pocket change” because they could afford to. (Yes, I have AMAZING parents.)] Then, BOOM. I happened to come into the “inheritance” of a few savings bonds in my name. AKA they were lost in the house and then given to me. I cashed them to the bank and got $4000. A few luxury vlogs later and, yikes. I was convinced that buying a designer bag would change my life. I never thought wanted to be a cool kid. Apparently, I did, and I acted out at freaking age 24. And so, a few clicks later and Harrods got an order from yours truly. I bought the mini sega bag. It came in a gorgeous Harrods box which inside contained another beautiful box and dustbag that looked like this:  And I pulled out the bag… It’s hideous. It’s hideous and it’s so dang small. My mother blinked in incredulity: “That’s it?” She was clearly unimpressed with the world of luxury.  But I had just spent just under $2000 for this bag with my own money and armed with my YouTube luxury designer knowledge, I asserted that YES. This was the bag. It was a work of art. It was going to save me. Well, the joke is on me. I kept the bag. I’ve worn it once. I hate wearing it because the crossbody is far too long on my 5ft frame. It’s too small to hold much of anything. And the one week I wore it, it got two obvious scratches in the gold metallic foil. And sadly, it didn’t make me feel as great as I thought it would. Now I own a piece of luxury and I felt the same as I did when I didn’t have it. I just had less money in the bank. To summarize: my soul was empty and so was my wallet. It was a stupid purchase in the sense of fashion. It was trendy and as soon as I got it, my style changed in a matter of months as I moved to Europe. It was also a stupid purchase in general for someone who isn’t actively making money. You don’t waste money when you don’t have an income; I want to slap my younger self for being a gullible idiot. My disclaimer is, just a week after I bought that Gucci bag (before it even arrived), I used the rest of my savings bond money to buy a Louis Vuitton Alma BB. So I had zero savings bond money left. It was a dumb choice. Definitely, the dumbest thing I’ve done in my entire life. My one and only rebellion. The Alma BB? I use regularly and will for the rest of my life. I am determined to get my worth out of it. It looks good with every outfit, surprisingly. And I do get lots of compliments on it. It’s sturdy and holds most things I need. Still a bad purchase, but I can work with that.  As for the Guccy? It sits proudly in its Gucci box, in a Harrods box in my summer room at my parents’ house. Hashtag Gucci gang. I can’t even sell it because it’s not worth it. The trendy bags aren’t good for resale. Besides, it is *ugly*. I call it my luxury trash bag. Moral of the story… Neither of those bags made me feel anything like I wanted them to. Because material items were not my issue. Self-esteem is my issue. And I battle with it while not spending thousands of dollars on ridiculous items now. Thankfully, my mistake was not at the cost of any money I personally made or my parents made. I am growing more confident and classy on my own, from the inside. The bags are just accessories and the lifestyle social media sells isn’t real. I knew it, but I didn’t want to believe it. You don’t need these things to bring happiness.  My advice is: If you’re determined to buy luxury in any case, just buy it pre-loved and save money.If you’re going to make a mistake, try not to make an expensive one.PS. My parents think my mistake is hilarious. Pictures not mine; from Google. ",
            "date": "Answered March 1, 2020",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tim Perry",
                    "user_href": "/profile/Tim-Perry-49"
                },
                {
                    "user_id": "Samarth Mair",
                    "user_href": "/profile/Samarth-Mair"
                }
            ]
        }
    ]
}