{
    "title": "What major events happened 90 years ago? - Quora",
    "tags": [
        "Historical Events",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Niek Dautzenberg",
                "href": "/profile/Niek-Dautzenberg"
            },
            "answer_text": "I am writing this in 2018, so 90 years ago is 1928. Some important events of 1928 are: January: Frederick Griffith report the results of the griffith’s experiment. With this, he indirectly proves the existence of DNA.  12 March: The St. francis Dam in California collapsed, resulting in minimal 431 deads. How many people died is estimated around 600. before:  after:  May 3: The Jinan incident took place, an armed confict between Japan with assistance from northern Chinese warlords against the Kuomingtang’s southern army. There are more than 6000 casualties. Memorial Hall of jian incident:  May 31: South africa adopts a new flag replacing the Red Ensign. The flag is nowadays a symbol of apartheid.  June 9: Charles Kingsford Smith and his crew completes the first flight over the Pacific Ocean. They flown form Oakland to Honolulu then Fiji and finally to Brisbane.  October 1: Joseph Stalin launches the first five-year plan.  Octrober 8: Chiang Kai-Shek is named as Generalissimo (the highest millitay rank) of the Nationalist Goverment of China.  1 November: Turkey switched from a arabic to a latin based turkish alphabet.  Some iconic film characters appear for the first time in 1928: May 15: Mickey and Minnie Mouse have their first appearance in a short animated film named Plane Crazy from Disney.  November 10: The MGM lion roars for the first time at the beginning of the film White Shadows in the South Seas.  Source: 1928 - Wikipedia ",
            "date": "Answered July 14, 2018",
            "views": "134",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jaris Almazani",
                    "user_href": "/profile/Jaris-Almazani"
                },
                {
                    "user_id": "Cillian Flood",
                    "user_href": "/profile/Cillian-Boulian-Flood"
                },
                {
                    "user_id": "Adam Bohannon",
                    "user_href": "/profile/Adam-Bohannon-4"
                },
                {
                    "user_id": "Anders Kouru",
                    "user_href": "/profile/Anders-Kouru"
                },
                {
                    "user_id": "Jeremy Selby",
                    "user_href": "/profile/Jeremy-Selby"
                },
                {
                    "user_id": "Spencer Burrows",
                    "user_href": "/profile/Spencer-Burrows"
                },
                {
                    "user_id": "Miles Kessler",
                    "user_href": "/profile/Miles-Kessler"
                },
                {
                    "user_id": "Monty Patton",
                    "user_href": "/profile/Monty-Patton"
                },
                {
                    "user_id": "Benedikt Donat",
                    "user_href": "/profile/Benedikt-Donat"
                },
                {
                    "user_id": "Jay Ellis",
                    "user_href": "/profile/Jay-Ellis-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Leavy",
                "href": "/profile/John-Leavy-4"
            },
            "answer_text": "1929 February 14, in Chicago: The rivalry between Al Capone and Bugs Moran, resulted in seven of Moran's gang members being lined up against the inside wall of a garage, and immediately mowed down with Tommy guns. It became known as the St. Valentine's Day Massacre.  March 4: Herbert Hoover inaugurated as 31st President of the United States. March 23: The first telephone installed on President Hoover's desk in the White House. April 26: This date saw the landing of the first non-stop flight from England to India. May 16: The first academy awards known as the Oscars were presented. May 2: A raid on a brothel in Harlem, results in the arrest of Billie Holiday (14) and her mother for prostitution.  May 28: The first all color talking picture “On With the Show” is released in New York City. June 7: The Vatican City gained independence from Italy. June 25: The building of the Boulder Dam (Hoover Dam) is authorized by ...you've guessed it, President Hoover. August 29: After only 21 days, the German airship Graf Zeppelin completes a round the world flight. October 28: On this date came the Wall Street Crash which heralded the Great Depression and lasted until the mid 1930's.  November 20: Salvador Dali has his first one man show. Other important events of 1929: In the United States, the first car radio is made by Motorola. The US Population reaches 120 Million. A total of over 200,000 die from Influenza Epidemic world wide. The soft Drink 7-up is invented by Charles Leiper Grigg.  The First Public phone booths appear in London. In Switzerland there begins the manufacture of the first gasoline powered chain saw. That’s all folks. ",
            "date": "Updated August 12, 2019",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olivia Al Qutshan",
                    "user_href": "/profile/Olivia-Al-Qutshan"
                }
            ]
        }
    ]
}