{
    "title": "What happened between the Old Testament and the New Testament? - Quora",
    "tags": [
        "Jesus in the Old and New Testament",
        "The Old Testament",
        "Catholicism",
        "Jesus",
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Simpson",
                "href": "/profile/John-Simpson-4"
            },
            "answer_text": "The 400 years of silence refers to the time  between the Old Testament and New Testaments, during which God did not  speak to the Jewish people. The 400 years of silence began with the  warning that closed the Old Testament: “Behold, I am going to send you  Elijah the prophet before the coming of the great and terrible day of  the LORD. He will restore the hearts of the fathers to their children  and the hearts of the children to their fathers, so that I will not come  and smite the land with a curse\" (Malachi 4:5-6) and ended with the coming of John the Baptist, the Messiah’s forerunner.  At the time of Malachi’s warning, about 430 B.C., the Jews had returned  to Palestine from the Babylonian captivity (as merchants, not  shepherds). The Medo-Persian Empire still ruled Palestine, and the temple had been rebuilt. Both the Law  and the priesthood of Aaron’s line had been restored, and the Jews had  given up their worship of idols. Nevertheless, Malachi’s warning was not  without cause. The Jewish people were mistreating their wives, marrying  pagans and not tithing, and the priests were neglecting the temple and  not teaching the people the ways of God. In short, the Jews were not  honoring God. In 333 B.C., Palestine fell to the Greeks, and in 323 B.C. it fell to  the Egyptians. The Jews generally were treated well throughout those  reigns, and they adopted the Greek language and many of the Greek  customs and manners, and in Egypt the Old Testament was translated into  Greek. That translation, the Septuagint, came into widespread use (and  is quoted frequently in the New Testament).  Jewish law and the priesthood remained more or less intact until  Antiochus the Great of Syria captured Palestine in 204 B.C. He and his  successor, Antiochus Epiphanes, persecuted the Jews and sold the  priesthood, and in 171 B.C. Epiphanes desecrated the Holy of Holies.  This desecration resulted in an uprising by Judas Maccabeus of the  priestly line of Aaron, and in 165 B.C. the Jews recaptured Jerusalem  and cleansed the temple. However, fighting continued between the Jews  and the Syrians until the Romans gained control of Palestine in 63 B.C.,  at which time Pompey walked into the Holy of Holies, once again  shocking and embittering the Jews. In 47 B.C., Caesar installed  Antipater, a descendant of Esau, as procurator of Judea, and Antipater  subsequently appointed his two sons as kings over Galilee and Judea.  As the New Testament opens, Antipater’s son, Herod the Great, a  descendant of Esau, was king, and the priesthood was politically  motivated and not of the line of Aaron. Politics also resulted in the  development of two major factions, the Sadducees and the Pharisees. The  Sadducees favored the liberal attitudes and practices of the Greeks.  They held to only the Torah as regards religion but like all aristocrats  they did not think God should have any part in governing the nation.  The Pharisees were conservative zealots who, with the help of the  scribes, developed religious law to the point where the concerns and  care of people were essentially meaningless. Additionally, synagogues,  new places of worship and social activity, had sprouted up all over the  country, and religious and civil matters were governed by the lesser and  the greater Sanhedrins, the greater Sanhedrin being comprised of a  chief priest and seventy other members that handed out justice,  sometimes by 39 lashes administered with full force. Between the time of Malachi and the coming of the Messiah, several  prophecies were fulfilled, including the 2,300 days of desecration  between 171 and 165 B.C. (Daniel 8:14), but neither the fulfilled prophecies nor the 400 years the nation was given to study Scripture, to seek God (Psalm 43-44)  and to prepare for the coming Messiah, was put to good use. In fact,  those years blinded and deafened the nation to the point where most of  the Jews could not even consider the concept of a humble Messiah (Zechariah 9:9; Isaiah 6:10; John 12:40).  Almost two millennia have passed since the New Testament canon was  completed, and though the Word is full of grace and truth, and though  the birth, life and death of Jesus fulfilled a staggering array of  prophecies, the Jews as a people have yet to open their eyes and ears.  But Jesus is coming again, and one day a remnant will both see and hear. Read more:  Page on gotquestions.org ",
            "date": "Answered May 20, 2014",
            "views": "22",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shao-Hollywood"
                },
                {
                    "user_id": "Huw E-Maillard",
                    "user_href": "/profile/Huw-E-Maillard"
                },
                {
                    "user_id": "Robert Osowiecki",
                    "user_href": "/profile/Robert-Osowiecki"
                },
                {
                    "user_id": "Sandhya Patil",
                    "user_href": "/profile/Sandhya-Patil-5"
                },
                {
                    "user_id": "Maame Araba",
                    "user_href": "/profile/Maame-Araba"
                },
                {
                    "user_id": "Krisma Adiwibawa",
                    "user_href": "/profile/Krisma-Adiwibawa"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                },
                {
                    "user_id": "Marshall Garrett",
                    "user_href": "/profile/Marshall-Garrett"
                },
                {
                    "user_id": "Crowly Mathew Arackal",
                    "user_href": "/profile/Crowly-Mathew-Arackal"
                },
                {
                    "user_id": "Adam Chen",
                    "user_href": "/profile/Adam-Chen-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Happy Riches",
                "href": "/profile/Happy-Riches"
            },
            "answer_text": "The Bible reveals God’s purpose for mankind. Whether a person accepts this is up to that person. For those who have come to know Lord Jesus Christ, they realize that the Bible bears witness to Him. In fact, when Jesus said that the Bible bears witness to Himself, He was referring to the Old Testament only. The Bible does not tell us what has happened around the world, except for the flood, where certain descendants of Noah settled and the fact that seventy language groups were created. Once we get to Genesis, chapter twelve, Abraham and the purpose of God to deliver mankind from the grip of evil becomes the Bible’s narrative. In the Old Testament, this has included mostly what has happened to Israel and, in particular, once Assyrians had taken the kingdom of Israel captive and resettled the people after it had separated from the kingdom of Judah, the focus is on the Judahites. The book of Daniel predicts events that are to take place from the return of the Judahites, held captive at Babylon, to the death and resurrection of Lord Jesus Christ. In fact, Porphyry and others have claimed that Daniel was written after the fact, because of its accurate time frame. Since the time of the Neoplatonist philosopher Porphyry (c.232 - c.305 AD) the presence of predictive prophecy in Scripture has been denied. Porphyry, an intelligent man, produced a detailed verse by verse study of the book of Daniel in support of his argument for a second century date in volume 12 of his 15 volume work Against the Christians which survives in part in Jerome's 5th century Commentary on Daniel (Wilken, 1984: 139-143). During the Enlightenment many of Porphyry's arguments were revived and these, together with the conviction that predictive prophecy is impossible, still form the basis of liberal views on the book of Daniel.—The Book of Daniel [1] The four hundred or so years between the Old Testament and the New Testament are historically documented in other books that are not part of the sixty-six books of what has become the accepted canon. Those who accept these other historical books found in the Apocrypha, as part of the biblical canon, have a Bible that possesses a record of events that took place during the intertestamental era, which affected the Israelite nation. But what is found in the prophecies of Daniel actually refers to events beyond what happened to Israel during the intertestamental period. One school of thought is that the following books were written in this period: Job, Jonah, Esther, Ecclesiastes, 1 Enoch, Tobit, Jubilees, Sirach, Daniel, 2 Maccabees, 1 Esdras, 1 Maccabees (Intertestamental Chronologies). [2] What happened during the years between Malachi and the birth of John the Baptist, whom Jesus referred to as Elijah who was to come, appears to have been of no account in respect to the purpose of God. For we find that in the last words of the book of Malachi that Elijah was to come and turn the hearts of the people towards God before the people who do not repent are smitten with a curse. “Behold, I will send you Elijah the prophet before the great and terrible day of the Lord comes. And he will turn the hearts of fathers to their children and the hearts of children to their fathers, lest I come and smite the land with a curse.” (Malachi 4:5–6)And the disciples asked him, “Then why do the scribes say that first Elijah must come?” He replied, “Elijah does come, and he is to restore all things; but I tell you that Elijah has already come, and they did not know him, but did to him whatever they pleased. So also the Son of man will suffer at their hands.” Then the disciples understood that he was speaking to them of John the Baptist. (Mathew 17:10–13)Now you have to admit that this is strong evidence of God’s purpose being paramount; especially, when the very last words of the last book of the prophets in the Hebrew Canon speaks of Elijah turning the hearts of the people to the Lord God and Jesus pointed to this being John the Baptist. Plenty of things were happening around the globe during the period between the Old and the New Testaments. But these events had nothing to do with the purpose of God to bring about the salvation of mankind and the righteous judgment of the Evil One—along with those who reject the truth. The Bible records the plan and purpose of God being wrought among men. Just because it is not written in the manner that a person might write a manifesto today, what is written is sufficient to sort the just from the unjust—those who desire the truth from those who prefer evil. Since the last book of the prophets, Malachi, recorded the next event that was to take place in the purpose of God, there was no real need for documentation of the intertestamental period. This is the case, even though events that were to happen during that time are pointed to in the book of Daniel and recorded in the Apocrypha, during the Hellenization of Judah. Malachi (4:5) States That The People Need To Remember The Law Given By Moses Footnotes[1] The Book of Daniel[2] http://kehillatisrael.net/docs/learning/txt/itst_dynasties.pdf",
            "date": "Updated July 17, 2017",
            "views": "38",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daniel P. Clark",
                    "user_href": "/profile/Daniel-P-Clark-2"
                }
            ]
        }
    ]
}