{
    "title": "What percent recovered is New Orleans from Hurricane Katrina? 90%? - Quora",
    "tags": [
        "Hurricane Katrina (2005)",
        "New Orleans",
        "Hurricanes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guy Rich",
                "href": "/profile/Guy-Rich-9"
            },
            "answer_text": "Most of the city is fully recovered, indeed, MOST parts are much better than they were before. Some areas, however, have not fully recovered and some languish in a poor state. New Orleans East and the Lower 9th Ward are not yet near their 2005 status (which admittedly was pretty bad already). New Orleans DOES have a considerable wealth gap (most cities do), but with the exception of Lakeshore/Lakeview it does not consist of extensive “good” and “bad” areas, it is more of a patchwork. Many fine and relatively expensive areas were in the flooded area, the storm (apart from NO East & 9th Ward) did not discriminate. The most valuable land IS now the “batture,” the natural (higher) levees along the river, and most of the richer properties are there because they were settled first. Joseph-Taylor is WAY off base in his 30 minute drive. First, you would be perfectly safe. You would probably not see ANY abandoned factories, businesses, malls, or churches. Indeed, you would see many greatly improved structures. You might see a few empty lots (soon to sport nice new houses). I didn’t move back in to my nice middle class home for 3.5 years. That said it did grow another floor (garage/basement/laundry room bottom), a big raised front porch, and a big raised back deck, new windows, new electrical, and new siding. “Jazzland” was a failed entertainment park built out in the swamp. It will never be rebuilt. It had already failed. Charity hospital was filled with asbestos, so the rehab effort would be hideously expensive. It has been more than replaced with a huge medical district with dozens of brand new buildings and facilities. There are now plans under discussion to move City Hall into a refurbished Charity. The Trade Center’s problems have nothing at all to do with the storm. It has bounced back and forth between offers and plans to repurpose it as hotels and other things. It is a purely business concern. As a resident I often wonder where such bizarrely inaccurate essays as that of Mr. Riddle come from. He clearly hasn’t been in town in the last decade, or was in an altered state (those do occur in the Quarter and the Marigny). A clear illustration of the issue is that I can’t even give an interesting Katrina tour to visitors, everything looks pretty normal. Even the lower 9th looks like a plain old bad neighborhood. I suppose some people could just wish the city ill. You would be mistaken if you skipped it. ",
            "date": "Answered April 6, 2019",
            "views": "96",
            "upvotes": " Answer requested by Richard Nelson",
            "upvoters": [
                {
                    "user_id": "Sydney Almasy",
                    "user_href": "/profile/Sydney-Almasy"
                },
                {
                    "user_id": "Re Young",
                    "user_href": "/profile/Re-Young"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph-Taylor Riddle",
                "href": "/profile/Joseph-Taylor-Riddle"
            },
            "answer_text": "I don’t know much about the statistics, but I have lived in New Orleans off and on my whole life. The first time I moved away from New Orleans, I was very young, and I actually moved to get away front the hurricane in mention. The difficult part is New Orleans is known for having huge wealth gap. The upperclass, majority white, live in the safer neighborhoods. Not just safer in terms of crime and street violence, but in terms of how badly your home will likely be effected during hurricanes. They tend to be further from things such as the levy. With that being said, almost all of the upper-middle class homes were rebuilt in the following 2–3 years after hurricane Katrina. The problem is businesses and the lower income areas. There have been countless amount of people doing rebuilding efforts in the ghettos of New Orleans. They actually have done quite a nice job getting rid of the a lot of ugly looking or abandoned homes. To answer your question, I wouldn’t recommend it, but if you drove up and down the streets of New Orleans for thirty minutes this is what you would see: A lot of huge abandoned factories, business, malls and churches. These buildings have been there and probably will still be there for a very long time. If you drive through the ghettos, it’s still pretty common to find empty homes with spray paint marking how many people went missing or found dead during katrina but the biggest reason you know the reconstruction efforts haven’t gotten too far, theres places where you won’t just find one or two empty homes on the neighborhood block but maybe 5, 6 or 7 houses that are completely horrifying and falling apart. Its not becuase thr city hasn’t gotten around to fixing these places yet, there are certain areas and buildings that may never be fixed up. A lot of these include huge schools, hospitals, and paper factories that are horrifying to the sight     ",
            "date": "Answered April 5, 2019",
            "views": "168",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Re Young",
                    "user_href": "/profile/Re-Young"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Black Perley",
                "href": "/profile/Benjamin-Black-Perley"
            },
            "answer_text": "It’s a quite controversial topic Basically everyone with the financial means to move back has already done so, but there are hundreds if not thousands of people who were either renting or were uninsured owners, many of which had lived here for generations, who lost everything and can’t afford to come back. For them, the only acceptable number is 100%. ",
            "date": "Answered April 6, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Richard Buckley",
                "href": "/profile/Richard-Buckley-52"
            },
            "answer_text": "95% ",
            "date": "Answered May 4, 2019",
            "views": "8",
            "upvotes": " Answer requested by Richard Nelson"
        }
    ]
}