{
    "title": "What do people who left after Hurricane Katrina miss the most about New Orleans? - Quora",
    "tags": [
        "Missing Moments",
        "Hurricane Katrina (2005)",
        "New Orleans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Al Gardner",
                "href": "/profile/Al-Gardner"
            },
            "answer_text": "I think Dan nailed it. I was born and raised in New Orleans and moved to San Diego after Katrina and stayed there for seven years. I moved back to New Orleans for two years and have since moved back to San Diego. The number one thing I miss is Dan’s #1. When you walk down the street, people acknowledge your presence. A head nod, a \"how you doin'\", a nice smile. It creates a sort of community that you don't see many other places. That behavior is a foreign concept in San Diego. When I showed that same sort of friendliness to my neighbors here in San Diego or strangers I would encounter face to face when I’m out for a walk the results were so different. My neighbors would look at you like, what’s his angle. When out for a walk you pass people who look at you until they get close enough to speak and then put their heads down. I’m not by any means trying to say the people aren’t nice here but they just don’t show it in such hospitable ways. It’s a daily struggle for me to adjust to that. I miss all the Mom And Pop one off businesses if you will. I do miss a good thunderstorm as well. *** Sadly what I don’t miss is the systemic poverty and crime that is so pervasive. As much as I love the French Quarter and downtown, as I got older I came to see it for what it is, a modern day plantation. Lot’s of people working for low wages and no chance of advancement. When Katrina pulled the rug off of all of this, it was obvious how important these people were to the success of these businesses. The lack of these workers stifled the re-opening of many businesses who ironically had to offer higher wages to get people to work. They would have never done that before and they don’t do it now. I don’t miss the political system, but honestly the politics and corruption is here to, but far more polished and sophisticated. That said i will never love a city more than my beloved New Orleans! ",
            "date": "Answered May 19, 2016",
            "views": "623",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Plasse",
                    "user_href": "/profile/Bill-Plasse"
                },
                {
                    "user_id": "Arthur Short III",
                    "user_href": "/profile/Arthur-Short-III"
                },
                {
                    "user_id": "Laura Zwickl",
                    "user_href": "/profile/Laura-Zwickl"
                },
                {
                    "user_id": "Oren Milstein",
                    "user_href": "/profile/Oren-Milstein"
                },
                {
                    "user_id": "Nicholas King",
                    "user_href": "/profile/Nicholas-King-24"
                },
                {
                    "user_id": "Amy O'Donnell",
                    "user_href": "/profile/Amy-ODonnell-4"
                },
                {
                    "user_id": "Ella Whitehead",
                    "user_href": "/profile/Ella-Whitehead"
                },
                {
                    "user_id": "Dotsy Maher",
                    "user_href": "/profile/Dotsy-Maher"
                },
                {
                    "user_id": "Ronda Williamson",
                    "user_href": "/profile/Ronda-Williamson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Smolkin",
                "href": "/profile/Dan-Smolkin"
            },
            "answer_text": "When you move from New Orleans, your heart aches for many things. I originally left 10 years ago after the hurricane but make my way back pretty frequently.  While I did move away after the storm, I've gone back time and again to help rebuild. It's a city with plenty of imperfections and one that everyone should have the chance to experience. Here are a few things that come to mind: When you walk down the street, people acknowledge your presence. A head nod, a \"how you doin'\", a nice smile. It creates a sort of community that you don't see many other places.Majestic oak trees lining the streets, with their meandering limbs and roots that burst through the sidewalk.The French Quarter. It's a step into another world, a sort of \"downtown\" experience I've yet to find in any other city.Talented artists abound. Playing instruments, painting wonderful art.Architecture with character.Food that is unrivaled by anywhere else in the country. Few things match the experience of beignets for breakfast, a po-boy for lunch and, well, the best seafood you've ever had for dinner.The people.",
            "date": "Answered September 9, 2015",
            "views": "468",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cindy Traugott",
                    "user_href": "/profile/Cindy-Traugott"
                },
                {
                    "user_id": "April M. Hamm",
                    "user_href": "/profile/April-M-Hamm"
                },
                {
                    "user_id": "Guy Rich",
                    "user_href": "/profile/Guy-Rich-9"
                },
                {
                    "user_id": "Al Gardner",
                    "user_href": "/profile/Al-Gardner"
                },
                {
                    "user_id": "Joseph Williams",
                    "user_href": "/profile/Joseph-Williams-160"
                },
                {
                    "user_id": "Alexandra E. Sutton",
                    "user_href": "/profile/Alexandra-E-Sutton"
                },
                {
                    "user_id": "Idan Elad",
                    "user_href": "/profile/Idan-Elad"
                },
                {
                    "user_id": "Art Zacharczyk",
                    "user_href": "/profile/Art-Zacharczyk"
                },
                {
                    "user_id": "Monya Gray-Scherzer",
                    "user_href": "/profile/Monya-Gray-Scherzer"
                },
                {
                    "user_id": "Edward Claro Mader",
                    "user_href": "/profile/Edward-Claro-Mader"
                }
            ]
        }
    ]
}