{
    "title": "What is Palestine? - Quora",
    "tags": [
        "Foreign Relations of Palestine",
        "Palestine",
        "Israeli–Palestinian Conflict",
        "Word Definitions, Terminology, and Jargon",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Svet Sedov",
                "href": "/profile/Svet-Sedov"
            },
            "answer_text": " Palestine is the state absent on a map, almost. Palestine is recognized by 136 UN members, however, due to the fact that Israel, after the Six-Day war of 1967, entered into the West Bank territory, Palestinians today have a government which doesn't have an integrated state to govern. Instead, patches of lands, which Palestinian authorities control, are intermingled with another ones staying under the Israeli administration. On top of that, Palestinian government remains largely divided between two factions - Hamas, governing the Gaza Strip, and Fatah, directing the West Bank. According to the original design of 1960th, the head of the State of Palestine - the President - is not elected but rather appointed by the Palestine Liberation Organization (PLO). The members of another important Palestinian governmental institution - its National Council - are also chosen by PLO. However, today there's also the Palestinian National Authority - a body elected by popular votes, established in 1994 to govern the Gaza and the West Bank, but, after the split between Hamas and Fatah, it now controls only some areas of the Bank. The economy of Palestine is largely based on the financial assistance. However, such industries as tourism, agriculture and high-tech are also developing in seemingly prohibiting external environment. Palestine today is one of those states which exists simultaneously at the very center of the international politics and completely outside of any types of normal political arrangements. ",
            "date": "Answered December 26, 2016",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benny Fridman",
                    "user_href": "/profile/Benny-Fridman"
                },
                {
                    "user_id": "Varun Shukla",
                    "user_href": "/profile/Varun-Shukla-13"
                },
                {
                    "user_id": "Drew McCormick",
                    "user_href": "/profile/Drew-McCormick"
                },
                {
                    "user_id": "Kartiki Kalbhor",
                    "user_href": "/profile/Kartiki-Kalbhor"
                },
                {
                    "user_id": "Shubham Srivastava",
                    "user_href": "/profile/Shubham-Srivastava-125"
                },
                {
                    "user_id": "Vasil Kolchev",
                    "user_href": "/profile/Vasil-Kolchev-1"
                },
                {
                    "user_id": "Saada Ibrahim",
                    "user_href": "/profile/Saada-Ibrahim-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaruni Milan",
                "href": "/profile/Aaruni-Milan"
            },
            "answer_text": " Palestine was a country in south-west Asia, roughly equivalent to the modern state of Israel which has taken its place. Area about 26000 sq km - the Holy Land of Palestine in the bible was somewhat larger. Palestine was governed by the British,under the Mandate of the League of Nations, from 1920 to 1948. In 1948 the independent State of Israel was proclaimed and many Palestinian Arabs left and became refugees in neighboring countries. Many have waged violent campaigns to regain their homeland. ",
            "date": "Answered April 3, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alpha Cat",
                    "user_href": "/profile/Alpha-Cat-6"
                }
            ]
        }
    ]
}