{
    "title": "What does a Scottish man wear under his kilt? - Quora",
    "tags": [
        "Kilts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debbie Long",
                "href": "/profile/Debbie-Long-4"
            },
            "answer_text": "There was a Scottish guy at University when I was there, but he never wore a kilt, though he spoke with a Scottish accent. I remember one day some of the sillier girls got hold of him and started asking him questions. He took it well until about the end. I think it was on St Andrew’s Day or some Scottish celebration. The conversation went something like this. Why aren’t you wearing your kilt today? I don’t have a kilt. Why not? I don’t want one. Aren’t Scottish men supposed to wear kilts? We hardly wear them in Scottish cities, except on special occasions. But this is a special occasion! We’re not in Scotland, are we? Silly giggles, and then - Do guys wear anything underneath their kilts? (More silly giggles.) Some do and some don’t. But we want to see you wearing a kilt, why don’t you ever wear one? Because I don’t want a lot of silly girls asking if I am wearing anything underneath! End of conversation. I can only give one (sort of) example from my own experience. When I was a teenager we went to a fair that had some Scottish dancing, men in kilts. It was on a stage and the kilts would fly up at times, and it seemed that the men wore matching tartan shorts under their kilts. But there was a very cute boy among them who seemed to be about nine or ten, and once or twice when he was dancing we could see he was wearing white underpants underneath, it was so cute. I teach a dancing group at school where we learn traditional dances from different countries, and I am thinking of going into traditional Scottish dancing (the music will have to come from CDs or other recordings as we have no bagpipes! That was another thing the university girls teased the Scottish guy about.) We will have to try to find the costumes as usual. This is elementary school so there shouldn’t be any problem with wearing. I will naturally require the boys to wear their usual underwear underneath, white if they have them as this attracts less comment if shown. ",
            "date": "Answered December 26, 2019",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Temple",
                    "user_href": "/profile/Bill-Temple-5"
                },
                {
                    "user_id": "Ganesh Karthik",
                    "user_href": "/profile/Ganesh-Karthik-59"
                },
                {
                    "user_id": "Flemming Tibirke",
                    "user_href": "/profile/Flemming-Tibirke"
                },
                {
                    "user_id": "Jay Selinski",
                    "user_href": "/profile/Jay-Selinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Hussell",
                "href": "/profile/Jim-Hussell"
            },
            "answer_text": "The soldiers of the First Foot & Mouth Regiment, the unholy devils in skirts as described by the Burpas of the Khyber Pass, are expressly forbidden to wear anything under their kilts. Most other kilt (in Welsh cilt) wearers are pretty sensible; it’s weather-related, on the whole. As for me, I don’t require any undergarments when I’m wearing my cilt. EDIT: as an addition I ought to add that if you put your hand up a Scotsmans kilt, & cop feel a of a quarter-pounder, you’ve just met one of the McDonalds. ",
            "date": "Updated June 18, 2019",
            "views": "668",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annette Blair",
                    "user_href": "/profile/Annette-Blair-7"
                },
                {
                    "user_id": "Flemming Tibirke",
                    "user_href": "/profile/Flemming-Tibirke"
                },
                {
                    "user_id": "Julie Wallis",
                    "user_href": "/profile/Julie-Wallis-14"
                },
                {
                    "user_id": "Peter de Loriol",
                    "user_href": "/profile/Peter-de-Loriol-1"
                },
                {
                    "user_id": "Ryan K",
                    "user_href": "/profile/Ryan-K-386"
                },
                {
                    "user_id": "John Hill",
                    "user_href": "/profile/John-Hill-753"
                },
                {
                    "user_id": "David Fox",
                    "user_href": "/profile/David-Fox-294"
                },
                {
                    "user_id": "Ronald A. McCallum Hunt",
                    "user_href": "/profile/Ronald-A-McCallum-Hunt"
                },
                {
                    "user_id": "Ashley Dodd",
                    "user_href": "/profile/Ashley-Dodd-32"
                }
            ]
        }
    ]
}