{
    "title": "What are the three main types of human memory? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Shivam Ray",
                "href": "/profile/Shivam-Ray-7"
            },
            "answer_text": "Everything that our brain collects processes and express is of three forms. It may be done by the brain consciously, subconsciously or unconsciously. So is the case with memories. The memories that brain collects can be any of above mentioned nature. The memories that our conscious brain collects are mostly explicit memories. Memories that would be a collection of facts, names or events anything a person can state or declare. Whereas unconscious and subconscious memories are mostly implicit that the person cannot state and is mostly unware of. Take an example of a person who is driving in a highway. He comes across many advertisements that cited in billboards while driving. In one of the advertisements he sees a car which has its name written above it in large letters( Panther). But when asked about the advertisement later on the person doesn't remember it. So while driving he couldn't collect the conscious memories. But when is asked to state a name of an animal starting with P he says Panther instead of Pig which is the most common animal which starts with the letter P. SO hi unconscious or subconscious memory was affected by the car advertisement but he is totally unware of it . ",
            "date": "Answered March 28, 2020",
            "views": "113",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gagandeep Kaur",
                    "user_href": "/profile/Gagandeep-Kaur-501"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cindy Mercredie",
                "href": "/profile/Cindy-Mercredie"
            },
            "answer_text": "The moment I knew you were it, times where you would be watching me do something and I thought I knew what you were thinking too, remember driving through storms like it was nothing and we were safe. The first summer that drive back from the lake and there was lighting in all directions and I knew I was safe with you. We’ve been through too many storms to give up. And I know it’s you asking these questions. You know when I’m awake too, I have a feeling your Really close too ….. like really close and I’ve felt it for a while now but I was uncertain but I know now ",
            "date": "Answered December 5, 2019",
            "views": "117",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}