{
    "title": "What do other countries think about Greece? - Quora",
    "tags": [
        "Greece",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Baker",
                "href": "/profile/Andrew-Baker-88"
            },
            "answer_text": "Hi, I'm from America. For this question I racked my brain and came up with a short list of Greek-Americans I knew here. Just kidding, it wasn't a short list because there are a bunch of Greeks here :) For reference, I live near Chicago. Greektown here is still a thing, but it mostly is now a place where people go to get a bite to eat. Most people who lived there are now spread through the rest of the Windy City and it's surrounding suburbs. But enough about that.  Most people I know think Greek and Greek-American people are pretty fun to be with, even though this might drift into stereotypes at times. Why? Because of the younger people hosting large parties, playing soccer (even though it isn't hugely popular here, Americans tend to think even the most casual athlete as cool), and generally going over to visit their relatives for every single Greek Orthodox holiday or event. And don't forget cooking too. I don't know if this has changed recently, but it used to be the common view among people here that Greek food is close to being worthy of worship. So that's the good things, I guess.  The bad? People will probably have some trouble with your name, at least until they get acquainted with you. Non-Americanized names give most of us problems, as ours are usually some mixture of Anglicized Biblical era and a lot of English-German names too. Sorry...it will happen, that's just an inevitability. But don't feel bad because people tend to screw up even my name. And my name is Andrew Baker. People with Slavic names have extreme trouble too, which is hilarious because most of those people were from families here since the start of the 20th century. People might poke fun at you too, if they are at least acquainted with you. It usually is fairly awkward at first unless you are friends, but your mileage may vary. Americans may not know a whole lot about people from your country or your customs, so you might have to explain why you are celebrating Easter a few weeks after the \"rest\" of us. I don't know is you actually do, sorry for the assumption :( In sum, Americans are pretty chill with Greeks in my experience. You'll probably experience some cultural ignorance but this would be pretty common no matter where you go. As far as immigrating to America, it won't be easy to become a citizen in the short-term. It would probably be a good idea to contact a lawyer who has experience in this kind of thing, as well as look up your chances in Europe or elsewhere. You should be able to live in nations within the Schengen Area, but I am rusty with my EU knowledge. Best of luck! ",
            "date": "Answered May 8, 2016",
            "views": "49",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aggelos Orfanos",
                    "user_href": "/profile/Aggelos-Orfanos"
                },
                {
                    "user_id": "Christopher Poulios",
                    "user_href": "/profile/Christopher-Poulios"
                },
                {
                    "user_id": "Amalia",
                    "user_href": "/profile/Amalia-58"
                },
                {
                    "user_id": "Panagiotis Kyriakopoulos",
                    "user_href": "/profile/Panagiotis-Kyriakopoulos-3"
                },
                {
                    "user_id": "Doretta V",
                    "user_href": "/profile/Doretta-V"
                },
                {
                    "user_id": "Ioanna Bazouki",
                    "user_href": "/profile/Ioanna-Bazouki"
                },
                {
                    "user_id": "George Makedon",
                    "user_href": "/profile/George-Makedon"
                },
                {
                    "user_id": "George Daskalakis",
                    "user_href": "/profile/George-Daskalakis-13"
                },
                {
                    "user_id": "Spyros Gardikiotis",
                    "user_href": "/profile/Spyros-Gardikiotis"
                },
                {
                    "user_id": "Giannis Karalakos",
                    "user_href": "/profile/Giannis-Karalakos"
                }
            ]
        }
    ]
}