{
    "title": "What is it like to live in Kuwait? - Quora",
    "tags": [
        "Living in the Middle East",
        "Kuwait City",
        "Living in Kuwait",
        "Living Abroad",
        "The Middle East"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shanti Fernandes",
                "href": "/profile/Shanti-Fernandes"
            },
            "answer_text": "I will try keep my answer short as many have already answered the question. I will briefly note down the positives and negatives: Positives: Comfortable Life - as mentioned before Kuwait is a small country. Travelling anywhere within the country is not more than an hour’s drive. So travel to & from work or anywhere else takes no more than 30 mins (add another 15 mins for traffic). There are grocery stores within 100 - 200 m of most residential buildings. Most people, especially families own cars, so it is easy to travel to any part of the country . One does not encounter overcrowded trains or buses, nor does it take several hours to reach work or home. Except for those laborers working in construction or out in the sun, most people work in comfort of A/c, as it is a necessity in the hot, desert climate here.Relatively Cheap - Although a lot of people are complaining of the rising costs, I believe living in Kuwait is still relatively cheaper than US or European nations. For one, it is tax free here, so our salaries are not taxed. Same goes for shopping and purchase. The price displayed is the price you pay, unlike other countries where one ends up paying almost double after adding all taxes and fees. Most facilities are still subsidized so basic necessities are covered by government, including healthcare.Good Education - There are many schools in Kuwait to cater to the various nationalities living here. You will find American, British, Indian, Arabic etc schools. Quality of education is at par with those offered in the home countries.Relatively Safe - For most part it is quite safe to live here, except for certain areas where there are a large number of bedouins and at night. Women are able to move freely. Mixed nationalities work and live in peace & harmony.Good Places to Shop & Dine - Kuwait has many places for shopping including some high class malls. There is also a second hand market every weekend, for those looking for bargains. You can find most of the fast food chains here (in fact the food from similar chain of restaurants tastes much better in Kuwait than elsewhere in the world e.g. many people vouch that KFC in Kuwait tastes far better than India and even Canada). Many other chain of restaurants from all over the world are here as well as some great local cuisine. There is an abundance of restaurants (small & big) offering every variety of cuisine to chose from.Negatives: Without family and friends, it can sometimes be boring as there not much to do besides shopping or the occasional movie. There are beaches and public parks where one can go for free. Most other recreational activities require an entrance or membership fee. Also usually people of a community stick together. So it is highly rare to see nationalities mix together socially. Therefore shows, events etc will be targeted to a specific community/nationality with members of other communities rarely joining in.Moves by Government to decrease expat population and balance the demographic imbalance. Currently the expat population to citizens is at a ratio of 70:30. The government is making efforts to reduce expats and increase the citizen population. Therefore it is coming up with many laws and regulations reducing many benefits for expats and increasing expenses in a bid to force people (especially of lower income) to leave. Obtaining visas (for family members), driving licenses, etc has been made tougher. Talks are ongoing in Parliament to increase electricity fees, health insurance fees etc. So it is slowly getting difficult to maintain the same lifestyle.Red Tape & bureaucracy: It is quite an ordeal to go through the red tape while applying for government related services viz, visas, driving licenses, applying for new electricity connection, as one has to visit various department for signatures, stamps etc. One has to deal with harsh, indifferent and rude staff.Extreme weather - Kuwait has extreme climate in summer and winter. Its gets extremely uncomfortable during these with summer temperatures reaching 50 deg Celsius and above while in winter it drops down to 3 deg Celsius. It takes some time to get used to.In conclusion, it is still quite a nice place to live. Its is comfortable and pleasant, once you get adjusted to its realities. ",
            "date": "Updated June 3, 2019",
            "views": "395",
            "upvotes": " View 75 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahmoud Talal",
                    "user_href": "/profile/Mahmoud-Talal-3"
                },
                {
                    "user_id": "Shyam Shah",
                    "user_href": "/profile/Shyam-Shah-9"
                },
                {
                    "user_id": "Aini Gama",
                    "user_href": "/profile/Aini-Gama"
                },
                {
                    "user_id": "Nobody",
                    "user_href": "/profile/Nobody-1354"
                },
                {
                    "user_id": "Gamer Ris",
                    "user_href": "/profile/Gamer-Ris"
                },
                {
                    "user_id": "Sarah",
                    "user_href": "/profile/Sarah-7098"
                },
                {
                    "user_id": "Jory Lory",
                    "user_href": "/profile/Jory-Lory"
                },
                {
                    "user_id": "Venkatesh Mahadevan",
                    "user_href": "/profile/Venkatesh-Mahadevan-4"
                },
                {
                    "user_id": "Misiani Mwencha",
                    "user_href": "/profile/Misiani-Mwencha"
                },
                {
                    "user_id": "B. Raghuram",
                    "user_href": "/profile/B-Raghuram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaushik Kumar",
                "href": "/profile/Kaushik-Kumar-4"
            },
            "answer_text": "There are already many answers in the same thread which answer how it is to live in kuwait as a whole and after reading each one of them you will definitely get a gist as to how it is actually to ‘live’ in kuwait. My answer will vary a based on my experience and I will also try to answer in the most general view possible too.  To answer in one word, life in Kuwait is ‘Monotonous’. Irrespective of how many friends you have or how social you are, eventually life in kuwait will get monotonous and as time progresses you will realize you can only do the same set of things over a span of time and depending on your personality you will either embrace it or let it get to you. I was lucky enough to have many school friends here, as I was brought up in kuwait and I also have other mutual friends who I do hang out with but I have to say, eventually you will wish you were in another place, especially after experiencing living in a country as free as india and my experiences of touring other foreign nations.  There are decent malls, great food, good cafes, world class restaurants. pretty good beaches in kuwait but again thats all. There is a water park and few entertainment parks but you wouldn't want to go there more than a few times. So the point of me saying this is to illustrate that your life will eventually revolve around shopping and eating outside, or watching a movie, especially if your spending time with your family. If you are with your friends there are more options but not as much as you would like and also Alcohol is ‘legally’ banned here which is kinda a downer. Even completely avoiding this fact, there isn't much fun stuff to do here, tourism is dead here, there is nothing really to see that will make you be in awe, the government isn't frankly even making an effort to increase the tourism also. And to really take part in any of these fun activities you will definitely have to shell out good bucks, which you can’t do every weekend. To talk about the people well to be honest the Arabs here are not the most welcoming compared to the other gulf nations. I never really felt like home even though I have spent nearly 20 years here. This is mainly due to the fact that the people here are mostly filthy rich and with that comes the added head weight. Your treatment depends completely from where you are. If you are white skinned( American etc) you are treated just fine. Don’t get me wrong , there are many amazing arabs who are very friendly, but they mostly aren't from kuwait. Again this is not a general view, I have met lot of good arabs who are very friendly and some who well aren't really friendly. On the other hand if you go to Dubai or other parts of the UAE its another scene entirely. The most biggest advantage and disadvantage of living in kuwait, is the relaxed life. You get so used to the luxury and the relaxed culture here ( especially at work) that you don’t really strive to achieve more and more as you progress through time. Again this is not with everyone and every company but thats what mostly happens to the people here. People work here only for the money and to speak more into detail about the money, there is loads of it, as you probably know that the kuwait dinar is the highest valued currency in the world. You will be able to save a good amount of what you earn as it is tax free. If money is all you want, kuwait is the place to be. On the other hand if you want more exposure and growth in life, Kuwait is not the place to be. I attach many of my childhood memories to kuwait and Kuwait is the only place where I get to see all my friends from school, and this truly makes me feel nostalgic every time. I totally love the arabic food and the ease at which you can get what you want here, being a very small place. In kuwait, I also get time to pursue my hobbies and take care of my physical fitness. Kuwait is definitely a pretty good place to live with your family for a few years, but your experience completely depends on how you make it. The more you keep yourself busy the easier it is to get through the slow life. So to sum it up, your life in kuwait depends on how you design it. The more better you manage it, the more chances you can remove the ‘monotonous’ part of the life. Its true with any city, and eventually life does become monotonous, but when your in kuwait you just might experience that part of your life earlier. ",
            "date": "Updated April 11, 2018",
            "views": "763",
            "upvotes": " View 199 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zee",
                    "user_href": "/profile/Zee-126"
                },
                {
                    "user_id": "Aishwarya Ann Mathew",
                    "user_href": "/profile/Aishwarya-Ann-Mathew"
                },
                {
                    "user_id": "Zainab Naharpurawala",
                    "user_href": "/profile/Zainab-Naharpurawala"
                },
                {
                    "user_id": "Adil",
                    "user_href": "/profile/Adil-99"
                },
                {
                    "user_id": "Haya Pearson",
                    "user_href": "/profile/Haya-Pearson"
                },
                {
                    "user_id": "Hosam Khirala",
                    "user_href": "/profile/Hosam-Khirala-1"
                },
                {
                    "user_id": "Venkatesh Mahadevan",
                    "user_href": "/profile/Venkatesh-Mahadevan-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Amoskyrise"
                },
                {
                    "user_id": "Ziaddinè Chahoudi",
                    "user_href": "/profile/Ziaddinè-Chahoudi"
                },
                {
                    "user_id": "Amar Nath",
                    "user_href": "/profile/Amar-Nath-544"
                }
            ]
        }
    ]
}