{
    "title": "What kind of weapon do you think could replace modern firearms? - Quora",
    "tags": [
        "Military Weapons",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathaniel Tokich",
                "href": "/profile/Nathaniel-Tokich"
            },
            "answer_text": "If we wander into unrealistic territory: The Warhammer 40k Lasgun would completely out compete all modern small arms easily. Realistically a firearm that would replace modern firearms needs to out compete the associated costs of the current firearms while maintaining their quality or improving upon them. To give you a general ideal of the costs of firearms: Material costLabor cost to fabricate themTesting costsMunition costsMarketing and sales costsReplacement and maintenance costsTo achieve such reduced costs a business would need to have some serious in connections as well provide a quality firearm that retains it’s low cost and quality over time. However let’s say for the sake of debate that the “new” firearm is just as expensive to make as existing firearms. What does it bring to the table that makes it preferable to the existing hardware? This depends upon what the firearm is intended to be used for. This is because firearms are nothing more than tools designed to complete a specific task. Maybe the firearm uses a new type of ammunition that isn’t compatible with existing platforms? For example caseless ammunition, while this has been tried and failed before we’ll just toy with the idea. So a new firearm that has the same cost, but uses an ammunition that is unique. Let’s give the ammo the benefit of the doubt and say it’s far better than the current munitions available on the market, and reasonably priced as well. Even if the firearm is of equal quality, and its ammunition is better that isn’t enough. Simply because those that control the majority of the market will literally squeeze them out of it if they can. Plus it may not be as easy to come across as other firearms which would inflate it’s cost. So let’s say the firearm can now perform a task the modern firearm cannot, then and only then does it become a viable contender. In this case as a tool it has been designed to complete a specific task. If that task falls outside of what a modern firearm can do, then yes the “new” firearm would replace it as a standard. Here’s a small list of firearms that could replace modern firearms if they flaws were corrected or invented (I know I’m dipping back into potentially unrealistic territory): Coil Guns: If the were designed to be more energy efficient, powerful, light, and robust they would be a serious contender. However they would need to be designed to fire accurate bullets and not spheres.Miniaturized High Power Lasers: In this case it would basically be a lasgun. The likelihood of such a development is in my opinion impossible within an atmosphere.Completely Recoil Free: Imagine hip firing a machine gun, with no recoil. However I think such a weapon breaks physics… We could still try and get close though!Drone systems: While not a direct replacement such a system would require redesigns of existing firearms to support their use within a system that cannot troubleshoot them like a human.Insanely Cheap and High Quality: Imagine for a moment that a new composite was invented that’s ultra light, can take the intense pressures of firing a round, and is super durable. Now make a gun…I chose not to dig into ammunition, cannons, or anything too crazy since the question is about firearms. However I do hope that my input is helpful! ",
            "date": "Answered October 10, 2018",
            "views": "378",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lane Hoover",
                    "user_href": "/profile/Lane-Hoover"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "As Jim says. The modern firearm is at a very high state of perfection for it’s purpose. Reliable, durable, relatively inexpensive. Wide varieties of different types of ammunition available for any conceivable purpose. Incremental improvements in design and functionality will continue, but these will be incremental. I don’t see any practical alternative in the forseeable future. All us science fiction fans love the idea of blasters, laser-guns, phasers, or whatever….. But until the problem of power generation can be solved (which won’t happen soon) all such devices are relegated to large weapons fixed to heavy-duty power-generation devices like ships or heavy land vehicles. The idea of hand-carrying a pistol-sized “phaser” that had the ability to vaporize a human being? Several quantum increases in power-production ability would have to be developed. ",
            "date": "Answered October 11, 2018",
            "views": "142",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pat McCormack",
                    "user_href": "/profile/Pat-McCormack"
                },
                {
                    "user_id": "Lane Hoover",
                    "user_href": "/profile/Lane-Hoover"
                }
            ]
        }
    ]
}