{
    "title": "What is the difference between a duke, an earl, a lord, a marquis, a baron and a count? - Quora",
    "tags": [
        "Aristocrats",
        "Synonym and Antonym Identification",
        "Monarchs",
        "Royalty",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Clack",
                "href": "/profile/Charles-Clack"
            },
            "answer_text": "You can keep the ranking straight with this mnemonic: \"Do men ever visit Boston?\"  Thus: duke, marquis, earl, viscount, baron.    Duke is the highest, most powerful rank.  There are but a handful of dukes.  William the Conqueror was a duke.   Marquis (pronounced markwiss in England) is next, but we'll come back to it.  Counts and Earls are equivalent ranks, so equivalent that the wives of earls have always been called countesses.  (I assume that William the Conqueror brought/made counts, and the native English equivalent rank was Earl.  But if that's true, then how can it be true that the wives of earls have always been countesses?)  What is a count?  He is the ruler of a county.  And now we can go back to consider the marquises.   Marquis:  Some counties are border counties.  A border county is where the action is.  This is where the enemy starts their invasions.  This is the jumping off point for your invasion of the enemy kingdom.   If a border count doesn't wind up dead, it's probably because he's rich enough to keep an unusually large military force.  So, the border count is rich and well armed.  Plus, he's a war hero, right?  Surviving all those battles?  Plus he captures all that loot?    So a border count tends to be more prominent, powerful, and respected than other counts.  And a border (and by extension, a border county) is called a \"mark\" or a \"march.\"  It's not called that because that's where the armies march; that's just coincidence, though often enough you have to send out for new peasants since the armies of both sides marched thru there enough times to dispose of or drive out the old peasants.   So, eventually, border count became a rank above regular count.  Thus: marquis.    Viscount is below count, the same as the vice president is below the president.   And then baron is the bottom of the totem pole.  But these are all barons, to hear some people tell it.  When the king is at odds with his barons, and they're making him sign the Magna Carta, you can bet that the dukes, marqueses, earls, counts, and viscounts are standing with the barons, not with the king.   But, to hear some tell it, a baron is anybody who holds directly from the king.  So the dukes and such are literally barons.  They just don't call themselves that because they have more impressive titles.   Expect all of this to be wrong:  Things can switch up on you every time you cross into a new country or a new century. ",
            "date": "Updated May 11, 2015",
            "views": "2812",
            "upvotes": " View 657 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Hardiman",
                    "user_href": "/profile/James-Hardiman-14"
                },
                {
                    "user_id": "Luke Migliazzo",
                    "user_href": "/profile/Luke-Migliazzo"
                },
                {
                    "user_id": "Valery Lebedz",
                    "user_href": "/profile/Valery-Lebedz"
                },
                {
                    "user_id": "Asif Iqubal",
                    "user_href": "/profile/Asif-Iqubal-45"
                },
                {
                    "user_id": "Jiuyang Xu",
                    "user_href": "/profile/Jiuyang-Xu-1"
                },
                {
                    "user_id": "Xiaoran Ma",
                    "user_href": "/profile/Xiaoran-Ma-2"
                },
                {
                    "user_id": "Anahita Kheiri",
                    "user_href": "/profile/Anahita-Kheiri"
                },
                {
                    "user_id": "Ken Greengard",
                    "user_href": "/profile/Ken-Greengard"
                },
                {
                    "user_id": "Brendan Hugo",
                    "user_href": "/profile/Brendan-Hugo-1"
                },
                {
                    "user_id": "Well Hello There",
                    "user_href": "/profile/Well-Hello-There-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rui Falcão de Campos",
                "href": "/profile/Rui-Falcão-de-Campos-1"
            },
            "answer_text": "Some great answers.I'll just add my ten cents.1. Titles and honourifics different immensely from country to country. The British have their uses, the Slavs from Ukraine, Russia, others, the Germanic yet different ones. The French and the Roman Germanic Empire set standards but are not hallmarks.2. Modernly, younger sons or even daughters of titled noblemen have taken to use a courtesy title, never granted by the fons honoris, which consists in their first name and surname being preceeded by the title below that to which their father is entitled. So a second or third sons of a Count of whatnot, will style themselves, Viscount Edouard, of Whatnot, and Regis, viscount of whatnot.3. Seignour/Senhor/Señor are titles of nobility. They were used by men who could raise and Fred such an host that it took a a banner to keep them together and with a point of reference. Feminine form  being  Lady. They were formally addressed as Very high and mighty Lady Christian name of Whatnot.4. Chevalier, or knight, in my view is also a title of nobility. It designates, as a title of courtesy, the son of any titled man - before the use of courtesy titles became rife - and a low order of ennobled men without means to raise a hord of liegemen.5. In republics, many titles that were given  for one or two lives, perpetuate themselves. Lucky noblemen who would be titleless if not for the Revolutionary grace.6. Bottom line, about titles and honours, rests on two points: (i) how old is the title, honour, and how was it granted and used since; and (ii) is the current incumbent someone who by his talents, bravery, selflessness, and social and monetary position, has shown an unfaltering devotion to king and country and the stature to fill his rank? One may not assume that Francis, the 27th Senhor of Penha Alta, who traces his origins to the Visigoth Kings, and which ancestors fought with the father of the first king in the war of independence in the XIth century, at a time where the wannabe king was a count and his liegemen senhores (lords) of pennon and cauldron, meaning they had a troop, or mere knights, one may not assume that Mr Francis is a lesser nobleman than my great great grandfather' who was offered an earldom for his political sponsorship and 60 million, and paid 30 million to be a viscount with the option of becoming an earl if he paid the second instalment of 30 million. In Portugal a further differential trait lies on the behaviour during the monarchist wars. We have some 9000 alleged  noblemen. But grandpa was one of only 300 officers who were captured by the republicans... Right there, I see 8000 families in dereliction of use. The first and second wars were even more shameful. A Princess came driving a van loaded with carbines from Czechoslovakia to Northwest Spain.  However, less than 100 noblemen were there. All in all, I  count zero dukes or their sons, less than five marquess, perhaps  up to ten earls... and a bunch of kids whose twentieth grandfathers had fought the Moors and the Castilian during the first dinasty. My kids and I often meet our cousins. Ennobled in the XIXth century, because an industrious and clever man made a fortune, with pride ourselves on him, on the fine artist his son was, and mostly on how bravely our men fought the republic and foreign foes. Listen to them, they even  changed name, you'd think their forefathers went to the crusades. And us the elder branch... ",
            "date": "Answered May 11, 2015",
            "views": "379",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Cook",
                    "user_href": "/profile/Ronald-Cook-51"
                },
                {
                    "user_id": "Ben Liechty",
                    "user_href": "/profile/Ben-Liechty"
                },
                {
                    "user_id": "Wolf Halton",
                    "user_href": "/profile/Wolf-Halton"
                },
                {
                    "user_id": "Len Gould",
                    "user_href": "/profile/Len-Gould"
                },
                {
                    "user_id": "Ishmael Hankins",
                    "user_href": "/profile/Ishmael-Hankins"
                },
                {
                    "user_id": "Najash Gafai",
                    "user_href": "/profile/Najash-Gafai"
                },
                {
                    "user_id": "Steven Fletcher",
                    "user_href": "/profile/Steven-Fletcher-16"
                },
                {
                    "user_id": "Gus Williams",
                    "user_href": "/profile/Gus-Williams-17"
                },
                {
                    "user_id": "Fatima Zahroh",
                    "user_href": "/profile/Fatima-Zahroh"
                },
                {
                    "user_id": "Bruno Matias",
                    "user_href": "/profile/Bruno-Matias-1"
                }
            ]
        }
    ]
}