{
    "title": "What courses are related to public health? - Quora",
    "tags": [
        "Learning About Public Health",
        "Public Health and Safety"
    ],
    "response": [
        {
            "author_info": {
                "name": "Empower School of Health",
                "href": "/profile/Empower-School-of-Health"
            },
            "answer_text": "To learn more about and develop a career in public health, a range of courses are available ranging from master’s degree to postgraduate and graduate diplomas, online certificates and diplomas through distance/e-learning. The courses are focused on public health studies across multiple subjects including but not limited to global health, epidemiology, healthcare management and policy planning, nutrition, reproductive and maternal child health, infectious and tropical diseases, pharmaceutical and supply chain management, biostatistics, environmental health etc. Empower is a global health academic, research and consulting institute which works with a vision to empower lives by promoting universal access to health and education. Empower School of Health has trained and educated over 5000 people from over 100 countries including specialists from UNDP, Global Fund, various Ministries of Health, Chemonics International, Management Sciences for health, JSI, CMS, Clinton Health Access Initiative and many more through blended learning approaches including classroom and online capacity building, digital and e-learning and field based learning/internships. Currently Empower offers a host of courses in public health. Some of the courses provided by Empower School of Health are mention below: Certificate courses Certificate Course on Product Selection in Public Health: http://bit.ly/2GvH6haCertificate Course on Quantification and Forecasting in Public Health: http://bit.ly/2GjATUaCertificate Course on Introduction to Procurement Cycle in Public Health: http://bit.ly/2GrXVtcCertificate Course on Inventory Management: http://bit.ly/2V5LRpHCertificate Course on Storage and Distribution of Public Health Products: http://bit.ly/2V4rrNRCertificate Course on Effective Use of Medicine in Public Health: http://bit.ly/2vaRzb7Certificate Course on PSM Support Function and Systems: http://bit.ly/2DvdjTVPost Graduate Diploma course Online Post Graduate Diploma (ePGD) in Global Health Procurement and Supply Chain Management: http://bit.ly/2UzLGnfHere’s what you can expect from these courses: Use of cutting-edge e-learning technologies and instructional design to make learning easy and impactfulOpportunities with leading organizations (UN organisations and MoHs)An online competency assessment tool (CAT)A community of practice (through Empower’s Big Learning Platform as well as LinkedIn)",
            "date": "Answered December 2, 2019",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Empower Pscm",
                    "user_href": "/profile/Empower-Pscm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chellappanpillai S. Radhakrishnan",
                "href": "/profile/Chellappanpillai-S-Radhakrishnan"
            },
            "answer_text": "The Courses in Public Health are meant for those who are responsible for implementing Public Health Policies. Some are meant for Doctors who lead Programmes. Eg: National Malaraia Eradictaion Program, National Leprosy Control Program, National TB Eradication Prgram , Maternal and Child Care program etc. Sanitary Inspectors of Municipalities, Community Health Centre, Urban Health Centres etc are trained for actual on site inspection of vulnerable areas, ensurig preventive actions against spread of communicable diseases etc.. The Public Health Nurses are similarly trained for caring for pre-natal, Confinement, Neo natal and Post natal care of Mothers and infants , and are also expected to provide follow up Immunological services to children till they reach School going age. ",
            "date": "Answered April 19, 2017",
            "views": "481",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ainun Naimah",
                    "user_href": "/profile/Ainun-Naimah"
                }
            ]
        }
    ]
}