{
    "title": "What is best sites for create website? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kiryoz Video",
                "href": "/profile/Kiryoz-Video"
            },
            "answer_text": "There is a lot of websites where you can make your own website just by drag and drop, or filling pre-made templates, to count, wix, weebly, squarspace, wordpress, click funnels, even some hosting companies have their own page builders lime Godaddy among others. The first problem, is that you have the one who will cost you less money and you end up having the same website as the costly solutions. I find that WordPress will be the best, because you can host it on any platform of your choice, you own totally the content, because you can backup all of your files on your hard drive on a daily basis, so whenever you make changes to your website, that will reflect additional folders on your hard drive where other solutions don't let you make this. The second problem, and this is very important is that you have to make a website or a landing page that convert especially in 2020 where the competition is hard. So the website is not only curating texts, videos and images, it's about to retain a visitor especially in the first 5 to 10 seconds of his visit, and let him to keep scrolling until you convince him to be a prospect, lead or follower. This is the game. So i believe that a website is not only a simple design, it's a design plus marketing strategy to close the deal in your mind, that's why i advise you to have a special designer in building yours, who knowa exactly the aim of designing in the way he feels that will convert following your business ides. If you want check this youtube video which help you understand the good and bad of some website builders :  Anyway we can assist you in this, without paying a fortune. Good luck. ",
            "date": "Answered April 14, 2020",
            "views": "521",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angu Vignesh",
                    "user_href": "/profile/Angu-Vignesh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Todd",
                "href": "/profile/Elizabeth-Todd-49"
            },
            "answer_text": "A question needs a lot more details, but I will try to answer it as broad as possible so that you can get enough information for all possible ways. If you want your own portfolio, then I can suggest online services using which you can build up your web page. If you would like to build a complete web site here is some information to consider: If you don’t want unique design and you can not code, then stick to online web site builders. There are easy to use and most have enough features to start off, but their most features are limited, so you can’t be as creative as possible and you can’t actually do everything you might want.Try with Wordpress for more unique designs, it is kind of a web site builder but it is called Content Management System. You will need a hosting for that. Download Wordpress files and install them there, should be easy to do if you will spend couple of hours. There are themes which you can purchase online which will allow you to build any kind of design using their builders.If you would need a very simple and super cheap solution, which can be used also on printed business cards and brochures cause their domains names and links look just super awesome then consider this: Use an online landing page builder.Use online micro-landing page builder, just have a look at following pages created using cool online service and how awesome the domain names look like:  ",
            "date": "Answered January 12, 2019",
            "views": "992",
            "upvotes": "0"
        }
    ]
}