{
    "title": "What is your opinion on Greek literature? - Quora",
    "tags": [
        "Greek Literature",
        "Greece",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Evangelos Mylonas",
                "href": "/profile/Evangelos-Mylonas"
            },
            "answer_text": "As in, contemporary Greek literature? I have my favorites, but the whole scene has been suffering from a case of same-old same-old. It feels impossible to escape from a basic number of plots that keep getting recycled; Male author stand-in negotiates life through the late-60s/early-70s military dictatorship. Does a lot of sex.Male author stand-in negotiates life through the Greek civil war. Does a lot of sex.Female author stand-in negotiates life through a world war and/or the Asia Minor disaster. Does a lot of illicit sex.Lately, there's been a new plot in the form of the Author stand-in negotiating life during the 2008 financial crisis. No one's having any sex. I'm a big fan of what Mexican and New Weird authors, especially Yuri Herrera and Jeff Vandermeer, do with fiction and I find Greek literature's obsession with picking apart our collective past tiring. Having said that, Nikos Mantis transcends all that and I live for the day when he'll get translated in other languages. I also have a soft spot for Vasilis Alexakis. He is something of an aberration in Greek literature, as he writes from a very specific emigré perspective that is not particularly represented. If anyone has any different opinions, please give me your recommendations. I'd love to check them out. ",
            "date": "Answered August 31, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "I’m firmly of the opinion that it exists. Not a doubt in my mind. Like all literature, it varies in quality from writer to writer and work to work. ",
            "date": "Answered August 31, 2020",
            "views": "40",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julia Brown",
                    "user_href": "/profile/Julia-Brown-324"
                },
                {
                    "user_id": "Dimitrios Kalemis",
                    "user_href": "/profile/Dimitrios-Kalemis"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        }
    ]
}