{
    "title": "What are some facts about Hitler? - Quora",
    "tags": [
        "WTF Facts (blog)",
        "Mind-Blowing Facts",
        "Facts and Trivia",
        "Adolf Hitler",
        "Nazi Germany",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wolfgang Von Preusen",
                "href": "/profile/Wolfgang-Von-Preusen"
            },
            "answer_text": "He was born in Braunau, Austria, a border town on the Inn River, across from Simbach, Bavaria. Hitler considered his birth on the Austrian-German border to be highly symbolic of a life-long “divine mission” to unite the two German states (Anschluss). He accomplished this task triumphantly by crossing the border at his birthplace on March 12, 1938, a year before his 50th birthday.His parents had six children together, but only two survived into adulthood; Adolf and his sister Paula Hitler. She never married or had children, and died in Bavaria on June 1, 1960 at the age of 64. Their mother, Klara Pölzl Hitler (Klara Hitler - Wikipedia), died of breast cancer in 1907 (age 47), when Paula was 11 and Adolph was 18. As he was extremely close to his mother, Hitler grieved her early death for the rest of his life.He never finished the equivalent of high school, but was a self taught bookworm who engaged in voracious reading on many topics. He frequented libraries from childhood until the beginning of WWI, devouring works on art, history, geography, opera music, political science, racial theories, and war. His contemporaries considered him to be well-read and intellectual, with an extraordinary power of recall. Modern contemporaries and critics generally concede he possessed a much higher-than-average IQ, but describe him variously as a mad genius.He should have been killed many times in his more than four years of fighting in WWI, but “miraculously” escaped serious injury and death, while many soldiers right next to him were killed by machine gun fire and artillery explosions. Near the end of the war, he was temporarily blinded by a British yellow-cross gas attack, but recovered in a Pasewalk hospital. He was devastated by news of the German surrender, especially by the fact he was not on the battlefield at the end of the war on 11/11/1918.He was fearless on the battlefield, being decorated for bravery in 1914, receiving the Iron Cross (Second Class).He was decorated for bravery again, in 1918, this time receiving the Iron Cross (First Class), a very rare decoration for a mere corporal. The recommending official was his immediate commanding officer, Lieutenant Hugo Gutmann, a Jew.He was a strict vegetarian, did not touch alcohol, hated smoking, and was rumored to be a virgin until the last evening of his life (honeymOOn in the Bunker).He was convicted of High Treason in 1924 for trying to overthrow the German government, and served (reduced) time in prison for this crime. Despite this potentially capital crime,He was legally appointed Chancellor of Germany in 1933 by President Paul von Hindenburg, less than ten years after conviction of treason against the government. This was a stunning reversal of fortune, leading to the rejuvenation of Nazi power.He never acquired German citizenship until less than one year before his appointment as Chancellor.He received 90% Ja (Yes) ballots from German voters when they were asked in an August 19, 1934 plebiscite if they approved of merging the two offices of head of state (president) and head of government (chancellor). With these two positions now merged into one (Fuhrer), this sealed his position as absolute dictator over Germany.He sold more than five million copies of his 1924 autobiography “Mein Kampf” before WWII began, the book having been translated into eleven languages by 1939. Royalties had made him very wealthy even before he took power in 1933. Although he clearly and carefully laid out his plans for conquering Europe, most observers dismissed the book as the rantings of a dreamer.He sailed to Memel in March 1939 aboard the warship Deutschland, at the head of a Kriegsmarine armada. It was the first time Hitler had sailed with the German Navy, the purpose of which was to reclaim and rejoin the Memelland to East Prussia, his last peaceful territorial acquisition before WWII broke out. Memelland had been Prussian for 500 years, but had been stripped from Germany (East Prussia) after WWI by the Allies. In part due to this punitive action,He established his “Wolf’s Lair” (Wolfsschanze) in East Prussia. He made it his “Warlord Headquarters” and spent more time there during WWII than any other place (over 800 days), including Berlin and the Bergholf near Berchtesgaden in Bavaria. His final day in East Prussia was 11/20/1944.He narrowly escaped an assassination attempt on 11/08/1939 when a hidden, powerful time bomb went off near him inside Munich’s Bürgerbräukeller, killing eight people and injuring 57. Hitler had been speaking there within feet of the bomb, but inexplicably cut his speech short and left just before the explosion. Hitler should have been killed in East Prussia on 7/20/1944 when Claus von Stauffenerg’s powerful bomb went off within a few feet of him during a military conference of high ranking officers. Instead, four men died and several were seriously injured, while Hitler walked away. In fact,He kept his appointment calendar for that day, receiving Italian dictator Benito Mussolini at the local train station just two hours after the bomb explosion. He then took his Fascist friend on a tour of the bombed out conference room, explaining it was “miraculous” he survived unscathed.He died as a married man, to Eva Braun, his mistress of over a decade. Historians have always speculated as to whether Mr. and Mrs. Hitler had sex on their wedding night, what kind of sex they had, whether he suffered from ED or monorchism, or in fact whether they died as virgins.He eventually sold ten million copies of his book by the end of WWII in Germany alone, and additional millions were translated and sold abroad.He was appointed to office as Chancellor four and a-half weeks before Franklin Roosevelt took office as U.S. president, and died two and a-half weeks after FDR. Between them, both men had an average of 4,444 days in power.His half-brother’s (Alois Hitler, Jr.) son, William Patrick Hitler, served in the U.S. Navy during WWII. Wounded in action, he received the Purple Heart, and was discharged in 1947. He married a German-American (Phyllis Jean-Jacques) and had four sons. They were born between 1949 and 1965 in the U.S., and would be grand half-nephews of “Uncle Adolf”. As of 2020, it is believed that at least two of these men are still living in the USA (anonymously, having changed their last name for obvious reasons). The youngest would be 55 and the oldest would be 71 They are the last known descendants of the Hitler bloodline.",
            "date": "Updated June 21, 2020",
            "views": "159",
            "upvotes": " View 139 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael C. Goncalves",
                    "user_href": "/profile/Michael-C-Goncalves"
                },
                {
                    "user_id": "Prussian Pewdiepie",
                    "user_href": "/profile/Prussian-Pewdiepie"
                },
                {
                    "user_id": "Socrates Calderon",
                    "user_href": "/profile/Socrates-Calderon"
                },
                {
                    "user_id": "Michael Wood",
                    "user_href": "/profile/Michael-Wood-339"
                },
                {
                    "user_id": "Michael Davis",
                    "user_href": "/profile/Michael-Davis-893"
                },
                {
                    "user_id": "Aaryavarta Dhungel",
                    "user_href": "/profile/Aaryavarta-Dhungel"
                },
                {
                    "user_id": "Nick Polet",
                    "user_href": "/profile/Nick-Polet"
                },
                {
                    "user_id": "Shigeru Andres",
                    "user_href": "/profile/Shigeru-Andres"
                },
                {
                    "user_id": "WHat Relly",
                    "user_href": "/profile/WHat-Relly"
                },
                {
                    "user_id": "Paul Easter",
                    "user_href": "/profile/Paul-Easter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sherif Ahmed 𓎡𓇋𓅓𓎼",
                "href": "/profile/Sherif-Ahmed-𓎡𓇋𓅓𓎼"
            },
            "answer_text": "facts about Hitler.  He practiced his speeches by having photos taken of himself in various poses. Historians agree that he never once visited a single concentration camp.  He reportedly suffered from a fear of cats.  He regularly used cocaine during the war years. He was Austrian, not German, and didn't move to Germany until the start of World War I. He was obsessed with his teenage niece, making her a virtual prisoner in his home and perhaps his lover. Before his father changed it, the family name was Schicklgruber.  He received injections of bull semen to enhance his sexual virility. There's no evidence to support the popular theory that his father's family was Jewish, but family DNA does contain elements common among Jews and Africans. A priest saved him from drowning in a frozen lake as a child, reports suggest.  He had extreme gastrointestinal issues and farted uncontrollably. Records show that he suffered a host of maladies including irritable bowel syndrome and Parkinson's disease. The Allies planned to slip estrogen into Hitler's food in hopes of making him more feminine and less aggressive.  He was the first European leader to ban the operation of human zoos.  He became incredibly paranoid after a food poisoning attempt and had a staff of 15 terrified young women taste test all his meals. After a few rogue Nazi officers almost succeeded in killing him in 1944, he had 5,000 people executed in response.  There were at least 42 known assassination plots against Hitler. He was a big fan of movies and some of his favorites included King Kong and Snow White and the Seven Dwarfs.  He had the plot to kill Winston Churchill with a bomb planted in chocolate. British spies were able to foil the plan, however.  He wanted desperately to be a painter but failed to get into art school — twice. While fighting in WWI, he temporarily went blind from a mustard gas attack.  He spared the life of a Jewish doctor who treated his family during tough financial times and called him \"noble Jew.\" He had a nephew named William Patrick Hitler (right) who fought against the Axis as a member of the U.S. Navy.  He collected Jewish artifacts with plans to build a museum for what he hoped would be an extinct race after World War II.  He was kind of a health nut and didn't eat meat, smoke or drink alcohol by the time of World War II. Though he didn't drink, he was on dozens of various drugs at once. Saddam Hussein's bunker was created by the grandson of the woman who created Hitler's bunker.  His last name comes from the German for \"one who lives in a hut.\" here are some facts about “Adolf Hitler’’ source 33 Little-Known Hitler Facts That Expose The Person Behind The Führer update: you guys are amazing, thanks for all the upvotes ",
            "date": "Updated December 30, 2018",
            "views": "178",
            "upvotes": " View 3.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aman Raj",
                    "user_href": "/profile/Aman-Raj-1286"
                },
                {
                    "user_id": "Sagar Deopa",
                    "user_href": "/profile/Sagar-Deopa"
                },
                {
                    "user_id": "Mike James",
                    "user_href": "/profile/Mike-James-59"
                },
                {
                    "user_id": "Ayaan",
                    "user_href": "/profile/Ayaan-86"
                },
                {
                    "user_id": "David Tondow",
                    "user_href": "/profile/David-Tondow"
                },
                {
                    "user_id": "Parry Cornejo Zamora",
                    "user_href": "/profile/Parry-Cornejo-Zamora"
                },
                {
                    "user_id": "Bhaskar Verma",
                    "user_href": "/profile/Bhaskar-Verma-73"
                },
                {
                    "user_id": "Sean O'Boyle",
                    "user_href": "/profile/Sean-OBoyle-3"
                },
                {
                    "user_id": "Sakthi Tharan",
                    "user_href": "/profile/Sakthi-Tharan-8"
                },
                {
                    "user_id": "Sharath Raj.b",
                    "user_href": "/profile/Sharath-Raj-b"
                }
            ]
        }
    ]
}