{
    "title": "What ethnicity were the ancient Romans? Are modern day Italians ethnically similar to Ancient Romans? - Quora",
    "tags": [
        "Roman Empire",
        "Ancient Rome",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Theodore",
                "href": "/profile/Steve-Theodore"
            },
            "answer_text": "Modern Italians are, by and large, the descendants of ancient Romans. Its believed - though like most things in ancient history, it's debated - that the bulk of the ancient inhabitants of Italy came down from the north in the early Bronze age (like the Greeks, who came down into the Greek peninsula somewhat earlier, they overlaid and mixed with indigenous groups). These new comers spoke Indo-European languages (connected to Greek, Celtic, German, Persian, and Sanskrit language families) and shared some symbols and cultural traits with the other members of that language family (the Nazi's borrowed the swastika as an emblem because it shows up in many of these so-called \"Aryan\" cultures, although many modern scholars don't believe that the linguistic and cultural groupings correspond to \"racial\" ones very tightly). The whole Indo-Aryan migration hypothesis is predictably fraught -- especially in India -- but it does appear that the Bronze age populations of Italy, Greece and Central Europe are ancestrally related in some ways : through language, religious tradition, and social structures. How much of that reflects a large scale migration of a mobile ethnic group -- like the later Germanic invasions of Roman Europe, or the Gallic invasion of Italy -- and how much reflects smaller groups of influential newcomers eclipsing native cultures -- like the Norman conquest of Britain -- is debated. In any event the Indo-European \"Italians\" are broken up into several groups by the time we see them in the historical record. The three main groupings were the Latins - from whom the Romans emerged - on the west coast of the peninsula, the Oscans in the south, and the Umbrians in central and east central Italy. These cultures were related but not identical and the early history of Rome was a mixture of cooperation and competition between the Latins and the other two groups. The final assimilation of these different groups only came about after long political struggles, ending in the Social War (90–88 BC). The historical \"Roman\" population is a the fusion of all these groups. There were also several unrelated groups in the Italian peninsula who were gradually absorbed into the Roman system. The Etruscans in central Italy might be indigenous, or might have come from Asia Minor where they would have been related to Phrygians or Lydians. They dominated Rome early in the city's history, but were defeated and absorbed by around the 3d C BC. Southern Italy and Sicily were extensively colonized by Greeks as early as the 8th century BC (even today there are pockets of Greek speakers -- and you may recall how Michael Corleone in The Godfather falls for Apollonia -- una belleza magari più greca che italiana -- a Greek girl -- in Sicily). Most of these cities were incorporated into Roman territory after the Pyrrhic War. The northern quarter of modern Italy was Gallia Cisalpina: \"Gaul below the Alps\" inhabited by people closely related the Gallic tribes of France. These areas were conquered in the 2d c. BC. During the long Roman hegemony in the peninsula there was considerable mixing between the Italians and other groups, but of course poorer rural populations were less mobile than people are today. While post-Roman Italy had many waves of invaders (among others, the Goths, Lombards, Arabs, and Normans, these groups tended to replace only the upper echelons of society rather than the bulk of the population. Northern Italy is somewhat more \"Germanic\" looking than the south - but that probably reflects the ancient Gallic heritage as much as outside conquest. Southern Italy shows admixtures from around the Mediterranean. However the overall heritage of Italy is a mix of the historic inhabitants of the peninsula in Roman times. ",
            "date": "Updated October 1, 2018",
            "views": "803",
            "upvotes": " View 118 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Just",
                    "user_href": "/profile/Justin-Just-2"
                },
                {
                    "user_id": "Marco Piergentini",
                    "user_href": "/profile/Marco-Piergentini"
                },
                {
                    "user_id": "Golda Burke",
                    "user_href": "/profile/Golda-Burke-1"
                },
                {
                    "user_id": "Dino Karas",
                    "user_href": "/profile/Dino-Karas-2"
                },
                {
                    "user_id": "Chengez Hussaini",
                    "user_href": "/profile/Chengez-Hussaini"
                },
                {
                    "user_id": "Dino C. Dobrowski",
                    "user_href": "/profile/Dino-C-Dobrowski"
                },
                {
                    "user_id": "Will Bildsten",
                    "user_href": "/profile/Will-Bildsten"
                },
                {
                    "user_id": "Rodrigo Fernando Locatelli",
                    "user_href": "/profile/Rodrigo-Fernando-Locatelli"
                },
                {
                    "user_id": "Brian Valerie",
                    "user_href": "/profile/Brian-Valerie"
                },
                {
                    "user_id": "Ste Pinato",
                    "user_href": "/profile/Ste-Pinato"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yannis Gaitanas",
                "href": "/profile/Yannis-Gaitanas"
            },
            "answer_text": "Some of the top answers covered the points about the origin of the ancient people of Rome and the connection modern Italians have with ancient Romans. But I think a lot of point regarding the topic are left out. What do we refer to when we talk about ancient Romans? The initial kingdom-city state? The Republic? The empire? If we take everything into account the history of the Romans ends in 1453. But I’ll get to that later. Let’s see the two questions: 1)What ethnicity were the ancient Romans?Regarding the city of Rome and its region others have said it better than I would so check them out, they should be the top answers.But, there’s an important issue. Rome was such a small state at first that it was a city state more or less. So, apart from the early Rome we should take into account the peninnsula of Italy too. What ethnicities were there? Several.  And after Italy, the Romans subdued several other states and tribes  Mind you, when the above map says, for example,”Iberian tribes”, this doesn’t mean they all spoke the same language in Iberia. Here’s a closer look:  So, there were several languages there too, just as in Italy. And if you see the entire Roman empire, this adds up to many languages, thus many “ethnic groups”. Mind you, after Caracalla’s law every free citizen in the empire was Roman. This means all of those peoples, those ethnic groups, here became Roman:  (The Roman empire in the early 3rd century AD, Caracalla’s time).What ethnicity were they? A whole lot of ethnicities! But it didn’t matter, they were just Romans above all. Even BEFORE that, we had Romans throught the empire of various “ethnicities”. When saint Paul was arrested (1st century AD) he informed the commander that he shouldn’t be flogged since he was a Roman. When the commander said he had paid a lot of money for his own citizenship, Paul replied he had been born Roman. A Jewish from Syria but 100% Roman, born a Roman citizen. Now, let’s move on to the second question:2)Are modern day Italians ethnically similar to Ancient Romans?As other great answers have pointed out, modern Italians definitely originate largely from Romans. But so all of those people from the empire. In fact, the modern Italians as well as the western Europeans are more *distant* from the Romans than the eastern people. You see the Western part of the empire was overrun and conquered by barbarians around the 5th century AD. On the other hand the Eastern part survived.  As a result, lands like northwestern Italy were Roman from the 2nd century BC to the 5th century BC plus a short reconquest by Justinian. On the other hand Egypt had been Roman from the 1st century BC till the 7th century AD, that’s a bit longer.  After Justinians short reconquest, the Roman empire mostly shrank with short restorations of what was basically Balkans and Anatolia. Then, after holding its coastline, the Romans finally lost Anatolia to the Turks. And in the end they lost the Balkans too, along with the New Rome (Constantinople), in 1453 AD.  So, the people of (especially its southern coastal part) Balkans and Anatolia had been Roman since the 2nd century BC up until the 14–15th century. During the first successful revolution in the Ottoman empire, that led to the birth of modern Greece, the people that rose against the Turks were (and called themselves) Romans. So, Greeks first and foremost but also ROMANians (duh) and Albanians (check out the flag) had been Romans under Turkish rule. They had been Romans far longer than the Italians and (especially Greeks and Albanians) had been here from the start. Ethnically these people are de facto similar to the Romans. Thus, many ancient ethnic groups made up the ancient Romans and similarly many modern ethnic groups are ethnically similar to ancient Romans. Trying to pick a modern nation state and identify it with an ancient multinational empire makes little sense and it’s basically wrong. ",
            "date": "Updated July 5, 2020",
            "views": "615",
            "upvotes": " View 136 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marco Piergentini",
                    "user_href": "/profile/Marco-Piergentini"
                },
                {
                    "user_id": "Dino Karas",
                    "user_href": "/profile/Dino-Karas-2"
                },
                {
                    "user_id": "Roar Nybø",
                    "user_href": "/profile/Roar-Nybø"
                },
                {
                    "user_id": "Gwyneth Llewelyn",
                    "user_href": "/profile/Gwyneth-Llewelyn"
                },
                {
                    "user_id": "Hsiaoshuang Chen",
                    "user_href": "/profile/Hsiaoshuang-Chen"
                },
                {
                    "user_id": "Rodrigo Fernando Locatelli",
                    "user_href": "/profile/Rodrigo-Fernando-Locatelli"
                },
                {
                    "user_id": "Colin Piquette",
                    "user_href": "/profile/Colin-Piquette"
                },
                {
                    "user_id": "Carla Schultz",
                    "user_href": "/profile/Carla-Schultz-5"
                },
                {
                    "user_id": "Christian Desaix",
                    "user_href": "/profile/Christian-Desaix"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Wjnaldum901"
                }
            ]
        }
    ]
}