{
    "title": "What are problems with Churches today? What are solutions? - Quora",
    "tags": [
        "Churches",
        "Problem Solving",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beau Mitchell",
                "href": "/profile/Beau-Mitchell-4"
            },
            "answer_text": "Today's churches are out of touch with the world for so many reasons. Technology is one major reason. If you are a Christian and you have an issue that might need the Bible for guidance there is no need to consult your minister anymore, there are usually thousands if not millions of sermons inline that will address the subject. It's also available when you want in in the privacy of your own home. If the issue is embarrassing or personal no one needs to know you watched a video on this issue. Let's say you think you might be addicted to porn, do you really want to come out and tell your minister you can't stop jerking off? There is guidence for this online and no one ever needs to know you have this embaissing issue. So that is the problem. The Solution It's tough for little churches because big successful churches cover this. Joel Olsteen's Lakewood church has a great system in place where you can watch any of his churces previous sermons but not just by Joel himself but also by all his guest speakers. There is a set up on his site that you can actually search a topic also. So as a little church the videos could be uploaded and this includes topics that make people uncomfortable. ",
            "date": "Answered October 25, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Leake",
                "href": "/profile/Chris-Leake-2"
            },
            "answer_text": "Oh my, what a naive question. And refreshingly so. As if Churches were some business in need of ‘turning round’ into profitability again. But nevertheless it’s a question worth trying to answer. Churches, like any clubs, centre around some common interest. What that might be for a church is a curiously difficult thing to pin down. Some would come right out and say: Why, God, stupid! When all the differently nuanced versions of whatever constitutes the medium loosely described as Christianity meet together, I wonder if any two members of the congregation think in the same way about whatever it is they share in common. I like to pose myself a thought experiment. You attend a Church one Sunday. You start to focus on why you’ve come, when suddenly a foreign looking man in fatigues with a large assault rifle stands in the aisle and says: Any of you who call yourself “christians” stay; the rest can leave peacefully. Yes, I know this kind of thing has happened somewhere in the world to others. Are you there for a reason more important than your own life? If not, should you just leave it to those who are there for a reason more important than to bolster traditions, underwrite morality, or at best for the beauty of its rites? Well, at least this starts off the debate. ",
            "date": "Answered October 19, 2018",
            "views": "565",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Taylor Ruhl",
                    "user_href": "/profile/Taylor-Ruhl"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        }
    ]
}