{
    "title": "What caused the end of the Islamic Golden Age? - Quora",
    "tags": [
        "Islamic Golden Age",
        "Golden Ages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sayed Jawad",
                "href": "/profile/Sayed-Jawad-5"
            },
            "answer_text": "We really don't know who or what triggered the decline. The physical end of the civilization definitely happened at the hands of the Mongols. But the Mongols were only the last nail, decadence had started much earlier. Orientalists find Ghazali an easy scapegoat to blame for the decline. The fact that he assumedly crushed philosophical tradition is frequently mentioned as the cause of the decline. However, I happen to have this educated belief that Ghazali was actually the prophet of doom instead of being its catalyst. Ghazali as the genius that he was alarmed the Muslim world of sinking too deep into Hellenistic verbal philosophy and its derived jurisprudence schools of Fiqh. His greatest attacks on philosophy were not because he was against abiogenesis or platonic republican ideals but rather due to the fascination of philosophers like Avicenna and Farabi with religion and metaphysics. In his own right, Ghazali was an Emmanuel Kant (According to Iqbal) of his age, who championed the distinction between religious mystical experience and rational philosophical approach. And this idea that he crushed philosophy is not so true either. Afterall, the greatest Muslim philosopher Averoes came after him and another Great Fakhr Razi was a follower of his own path. Ghazali's revival of Sufism would later, even after the Mongol menace, revive not just Islam but the cultures and traditions Muslims hold so dearly today. If I were to take Ghazali for his word, the two sciences he believed were dead in his time i.e. Ethics and Mysticism were probably the missing elements of Islamic civilization. There is no doubt that at its height of power and influence, Islamic civilization was a literalist Quran worshipping, hellenophile, violent and incompassionate society. Maybe Ghazali, the greatest Muslim of his age had identified the ailment, even if his prescription was not spot-on. ",
            "date": "Answered March 14, 2018",
            "views": "25",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ibn Karim",
                    "user_href": "/profile/Ibn-Karim-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                },
                {
                    "user_id": "Ashutosh Mehndiratta",
                    "user_href": "/profile/Ashutosh-Mehndiratta"
                },
                {
                    "user_id": "Ahmed Abdulnabi",
                    "user_href": "/profile/Ahmed-Abdulnabi-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/سعودية-اشعرية"
                },
                {
                    "user_id": "Joseph Ward",
                    "user_href": "/profile/Joseph-Ward-103"
                },
                {
                    "user_id": "Hassan Hans",
                    "user_href": "/profile/Hassan-Hans"
                },
                {
                    "user_id": "Salima Bale",
                    "user_href": "/profile/Salima-Bale"
                },
                {
                    "user_id": "Abdol Sabor Salek",
                    "user_href": "/profile/Abdol-Sabor-Salek"
                },
                {
                    "user_id": "Mansoor Khagga",
                    "user_href": "/profile/Mansoor-Khagga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noura Omar",
                "href": "/profile/Noura-Omar-6"
            },
            "answer_text": "This question many have tried to answer and its beyond the remit and so long, However, by the early 15 century, Muslim civilisation had experienced attacks from both the crusaders campaigns in Spain, Turkey and Palestine and the famous Mongol invasion of Persia, Iraq and Syria. The famous libraries and learning of the Muslim world came under catastrophic threat during these times of conflict. When Baghdad was invaded in 1258, the attacking Mongol armies destroyed countless manuscripts, while in Cordoba the vast majority of the city’s 600,000 Islamic books were destroyed. Having lost Spain and Sicily, the Muslim world then suffered the onslaught of Timur known as Tamerlane, these devastations together started the decline and eventual fall of islamic civilisation, and the end of this bright period of classical Muslim scholarship. This was accompanied by the rise of the west after the discovery of the new world with all the wealth it bought to Europe and the eventual demise of the silk road along which knowledge had flowed through various cultures. At the same time the Muslim world was weakened by the rise of new inward-looking ideas that deflected intreats away from philosophy, logic and translation of faith into deeds to benefit society. And so the muslim world disintegrated into numerous independent nation-states many of which subsequently experienced colonisation or went to war with each other, even after independence. Neither the people of the state nor their colonial rulers had paid much attention to education or socioeconomic reform leaving these countries in a long struggle for identity and survival in a fast-moving modern world. But as numerous evidence and historical manuscripts shows, the knowledge of the schoolers of Muslim civilisation was far from lost. Thousands of those precious documents of the past, written mainly in Arabic, fill in the archives of the British library, Berlin’s Staatsbibliothek, Paris Bibliothèque Nationale and many others. In Toledo’s cathedral archive today you can still see about 2,500 of the surviving manuscripts that schoolers translated from Arabic to Latin. And it was these Latin translations that fed the scientific and Philosophic revolution of the 1600s and kept the flame of knowledge alive.  Plaza Bib-Rambla from the Arabic (ساحة باب الرملة) was Garnada's main square, it was also the site of a historic cultural tragedy that has burned into the collective memory of the Muslim world and the scientific community Read more : 1001 Inventions - Discover a Golden Age, Inspire a Better Future | 1001 Inventions ",
            "date": "Updated March 9, 2017",
            "views": "116",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Basem Ismail",
                    "user_href": "/profile/Basem-Ismail"
                },
                {
                    "user_id": "Andre Wirajati",
                    "user_href": "/profile/Andre-Wirajati-1"
                },
                {
                    "user_id": "Gia Daniel",
                    "user_href": "/profile/Gia-Daniel"
                },
                {
                    "user_id": "Syed Khalid",
                    "user_href": "/profile/Syed-Khalid-23"
                },
                {
                    "user_id": "Hamza",
                    "user_href": "/profile/Hamza-620"
                },
                {
                    "user_id": "Sam Wazir",
                    "user_href": "/profile/Sam-Wazir-1"
                },
                {
                    "user_id": "Mahia Fairuz",
                    "user_href": "/profile/Mahia-Fairuz"
                },
                {
                    "user_id": "Omar Al Atta",
                    "user_href": "/profile/Omar-Al-Atta"
                },
                {
                    "user_id": "Sheddika Ayesha",
                    "user_href": "/profile/Sheddika-Ayesha"
                },
                {
                    "user_id": "Ashraff Khan",
                    "user_href": "/profile/Ashraff-Khan-10"
                }
            ]
        }
    ]
}