{
    "title": "What is the best way to believe in yourself? - Quora",
    "tags": [
        "Self-Improvement Advice",
        "Understanding Self-Improvement",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keinosuke Johan Miyanaga / 宮永 ヨハン 計之介",
                "href": "/profile/Keinosuke-Johan-Miyanaga-宮永-ヨハン-計之介"
            },
            "answer_text": "Courage and practice. Things that don’t work: Thinking: Just you dancing in your head because you don’t believe in yourself.Persuasion: Convincing anyone of anything is hard and you are no exception.Trying: You try because you can’t and induced belief is brittle regardless of who made you do it.Reading: Only works if a switch was ready to be flipped already. Something someone wrote will not make you confident so don’t accidentally give them credit!Things that work: Practice that skill: Practice always works because something physically changes when you physically practice. And the more you practice the more you will believe in that skill, because belief is physical.Practice being you: Social skills, maintaining your health, building a routine, forming the right habits, etc. All practice, all physical.Defer: Go do something else that doesn’t require confidence. Like, practice.Courage: Courage overcomes fear and any lack of belief. Courage leads to action. Courage leads to belief.So, if we were to merge them all, we have this: Practice Courage: Courage is the skill that would have all your friends believing you’re a hero in no time.Confidence is the lack of concern. It’s the lack of needing courage. It’s the ability to focus on a task without needing to think of yourself, let alone believe in anything. Confidence is being void of doubt. It’s the ability to just do something. No one competent with their skills goes “belief in self, check” before they do something. They just do it. So don’t confuse believing in yourself with confidence. Eliminate doubt and you will not need belief, but you will be confident. And for this, the only answer is practice. If you’re afraid to practice, then you’re back to courage. Belief can remain an outcome. All you truly need is enough courage to compensate for your fears. And ultimately even with belief, not needing it will make you the most confident you’ve ever been. Say you’re playing pick-up basketball. Say you have the ball, everyone is counting on you, and you go for it because you believe in yourself. This happens to me every weekend. But after years of playing, I now know for a fact that this doesn’t work. Believing in myself made me do my hardest. But that didn’t change the outcome. I’d still miss the shot or turn over the ball… but it’d be more personal and stressful. My beliefs would be challenged. I would be challenged. And it would suck. Then I realized. Working harder is just working harder. It can be done without belief. And it turns out, it’s easier without belief. You just need to confirm you’re doing your best. This is the power of knowing, and it does not require belief. Belief doesn’t make your first step quicker. Belief doesn’t make you jump higher. Belief doesn’t make your shots fall. What makes anyone better at anything is practice. What makes anyone confident at anything is knowing they practiced. How common is it to see someone fail because all they did was believe in themselves? How common is it to see someone succeed because all they did was practice, despite not believing in themselves? Belief is overrated. Be brave and humble. That’s all it takes. That’s all anyone needs. For belief, all you need to know is that anything is possible. ",
            "date": "Updated October 1, 2020",
            "views": "28",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kendra Jo",
                    "user_href": "/profile/Kendra-Jo-1"
                },
                {
                    "user_id": "Elisa Edwards",
                    "user_href": "/profile/Elisa-Edwards-8"
                },
                {
                    "user_id": "Abdulai A Rahman",
                    "user_href": "/profile/Abdulai-A-Rahman"
                },
                {
                    "user_id": "Pasupula Praveen",
                    "user_href": "/profile/Pasupula-Praveen"
                },
                {
                    "user_id": "Karthikeyan Shridhar",
                    "user_href": "/profile/Karthikeyan-Shridhar"
                },
                {
                    "user_id": "Vikash Kumar",
                    "user_href": "/profile/Vikash-Kumar-1683"
                },
                {
                    "user_id": "Jayaprakash Arathala",
                    "user_href": "/profile/Jayaprakash-Arathala"
                },
                {
                    "user_id": "Hera Black",
                    "user_href": "/profile/Hera-Black-1"
                },
                {
                    "user_id": "Priti Dhanuka",
                    "user_href": "/profile/Priti-Dhanuka-3"
                },
                {
                    "user_id": "Robert Houston",
                    "user_href": "/profile/Robert-Houston-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunil Kumar",
                "href": "/profile/Sunil-Kumar-12939"
            },
            "answer_text": "The 1% Rich People knows that Knowledge is Power The More you acquire the knowledge the richer you become…..In all aspect of your life … Same is true for Self-Belief… Below is a list of 10 Points in Detail which well help your to boost your Self- Belief !!!  1. Visualize yourself as you want to be. “What the mind can conceive and believe it can achieve.” -- Napoleon Hill Visualization is the technique of seeing an image of yourself that you are proud of, in your own mind. When we struggle with low self-confidence, we have a poor perception of ourselves that is often inaccurate. Practice visualizing a fantastic version of yourself, achieving your goals. 2. Affirm yourself. \"Affirmations are a powerful tool to deliberately install desired beliefs about yourself.\" -- Nikki Carnevale We tend to behave in accordance with our own self-image. The trick to making lasting change is to change how you view yourself. Affirmations are positive and uplifting statements that we say to ourselves. These are normally more effective if said out loud so that you can hear yourself say it. We tend to believe whatever we tell ourselves constantly. For example, if you hate your own physical appearance, practice saying something that you appreciate or like about yourself when you next look in the mirror. To get your brain to accept your positive statements more quickly, phrase your affirmations as questions such as, “Why am I so good at making deals?” instead of “I am so good at making deals.” Our brains are biologically wired to seek answers to questions, without analyzing whether the question is valid or not. 3. Do one thing that scares you every day. “If you are insecure, guess what? The rest of the world is too. Do not overestimate the competition and underestimate yourself. You are better than you think.” T harv eker. The best way to overcome fear is to face it head-on. By doing something that scares you every day and gaining confidence from every experience, you will see your self-confidence soar. So get out of your comfort zone and face your fears! 4. Question your inner critic. “You have been criticizing yourself for years, and it hasn’t worked. Try approving of yourself and see what happens.” -- Louise L. Hay Some of the harshest comments that we get come from ourselves, via the \"voice of the inner critic.\" If you struggle with low self-confidence, there is a possibility that your inner critic has become overactive and inaccurate. Strategies such as cognitive behavioral therapy help you to question your inner critic, and look for evidence to support or deny the things that your inner critic is saying to you. For example, if you think that you are a failure, ask yourself, “What evidence is there to support the thought that I am a failure?” and “What evidence is there that doesn’t support the thought that I am a failure?” Find opportunities to congratulate, compliment and reward yourself, even for the smallest successes. As Mark Twain said, “[A] man cannot be comfortable without his own approval.” 5. Take the 100 days of rejection challenge. “No one can make you feel inferior without your consent.” -- Eleanor Roosevelt Jia jiang has become famous for recording his experience of “busting fear” by purposefully making crazy requests of people in order to be rejected over 100 days. His purpose was to desensitize himself to rejection, after he became more upset than he expected over rejection from a potential investor. Busting fear isn’t easy to do, but if you want to have fun while building up your self-confidence, this is a powerful way to do it. 6. Set yourself up to win. “To establish true self-confidence, we must concentrate on our successes and forget about the failures and the negatives in our lives.” -- Denis Waitley Too many people are discouraged about their abilities because they set themselves goals that are too difficult to achieve. Start by setting yourself small goals that you can win easily. Once you have built a stream of successes that make you feel good about yourself, you can then move on to harder goals. Make sure that you also keep a list of all your achievements, both large and small, to remind yourself of the times that you have done well. Instead of focusing only on “to-do\" lists, I like to spend time reflecting on “did-it\" lists. Reflecting on the major milestones, projects and goals you’ve achieved is a great way to reinforce confidence in your skills. 7. Help someone else.  Helping someone often enables us to forget about ourselves and to feel grateful for what we have. It also feels good when you are able to make a difference for someone else. Instead of focusing on your own weaknesses, volunteer to mentor, assist or teach another, and you'll see your self-confidence grow automatically in the process. 8. Care for yourself. “Self-care is never a selfish act -- it is simply good stewardship of the only gift I have, the gift I was put on earth to offer to others.” -- Parker Palmer Self-confidence depends on a combination of good physical health, emotional health and social health. It is hard to feel good about yourself if you hate your physique or constantly have low energy. Make time to cultivate great exercise, eating and sleep habits. In addition, dress the way you want to feel. You have heard the saying that “clothes make the man.” Build your self-confidence by making the effort to look after your own needs. 9. Create personal boundaries. “Never be bullied into silence. Never allow yourself to be made a victim. Accept no one’s definition of your life, but define yourself.”-- Harvey Fierstein Learn to say no. Teach others to respect your personal boundaries. If necessary, take classes on how to be more assertive and learn to ask for what you want. The more control and say that you have over your own life, the greater will be your self-confidence. 10. Shift to an equality mentality. “Wanting to be someone else is a waste of the person you are.” -- Marilyn Monroe People with low self-confidence see others as better or more deserving than themselves. Instead of carrying this perception, see yourself as being equal to everyone. They are no better or more deserving than you. Make a mental shift to an equality mentality and you will automatically see an improvement in your self-confidence. Thanks Check My other stuffs : 10 mind-blowing points to show why books are our best friends ? 21 Life-Changing Questions You Must Ask Yourself ? What effect does reading for 60 minutes a day have? How Yoga Nidra Can Help You ? How do you make major decisions? I am not a top writer, but upvotes motivates me to write. It matters ! So Please up-vote…. ",
            "date": "Updated December 13, 2019",
            "views": "23",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anusha Rao",
                    "user_href": "/profile/Anusha-Rao-42"
                },
                {
                    "user_id": "Elisa Edwards",
                    "user_href": "/profile/Elisa-Edwards-8"
                },
                {
                    "user_id": "Sh H",
                    "user_href": "/profile/Sh-H-91"
                },
                {
                    "user_id": "Alicia Wong",
                    "user_href": "/profile/Alicia-Wong-81"
                },
                {
                    "user_id": "Surya",
                    "user_href": "/profile/Surya-1129"
                },
                {
                    "user_id": "Pakeeza Batool",
                    "user_href": "/profile/Pakeeza-Batool-8"
                },
                {
                    "user_id": "David Eze",
                    "user_href": "/profile/David-Eze-26"
                },
                {
                    "user_id": "Miranda Urena",
                    "user_href": "/profile/Miranda-Urena-2"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-360"
                },
                {
                    "user_id": "Nikhil Dravid",
                    "user_href": "/profile/Nikhil-Dravid-1"
                }
            ]
        }
    ]
}