{
    "title": "What is Website development? - Quora",
    "tags": [
        "Developments",
        "Websites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Misha Khandelwal",
                "href": "/profile/Misha-Khandelwal-1"
            },
            "answer_text": "Web development is the creation and maintenance of websites; it's the behind-the-scenes work to make a great, fast, and smooth website with a seamless user experience. Web developers, or \"developers,\" do this using a variety of coding languages. Web development services help the business to increase awareness of its products, maintain communication between you and potential customers, sell your products or services, generate leads for the business, and increase the popularity of your business and more. ... Currently the number of websites on the web is in the millions. Web development refers to the construction, creation and maintenance of websites. Although the terms “web developer” and “web designer” are often used synonymously, they do not mean the same thing. A web developer can participate in the design of a website, but can also write web scripts in languages such as PHP and ASP. Also, a web developer can help maintain and update a database used by a dynamic website. Some examples include manually coding web pages in a text editor, creating a website in a program such as Dreamweaver, and updating a blog through a blog website. In recent years, content management systems such as WordPress, Drupal, and Joomla have also become popular means of web development. These tools make it easy for anyone to create and edit their own website using a web interface. While there are several methods of website building, there is often a trade-off between simplicity and personalization. Therefore, most large companies do not use content management systems, but have a dedicated web development team that designs and manages corporate websites. Small organizations and individuals are more likely to choose a solution like WordPress that provides a basic website template and optimized editing tools. ",
            "date": "Answered August 31, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mia Gray",
                "href": "/profile/Mia-Gray-39"
            },
            "answer_text": "Web development is the building and maintenance of websites; it’s the work that happens behind the scenes to make a website look great, work fast and perform well with a seamless user experience. Web developers, or ‘devs’, do this by using a variety of coding languages. The languages they use depends on the types of tasks they are preforming and the platforms on which they are working. Web development skills are in high demand worldwide and well paid too – making development a great career option. It is one of the easiest accessible higher paid fields as you do not need a traditional university degree to become qualified. The field of web development is generally broken down into front-end (the user-facing side) and back-end (the server side). Let’s delve into the details. Comparing Front-End and Back-End Development A front-end dev takes care of layout, design and interactivity using HTML, CSS and JavaScript. They take an idea from the drawing board and turn it into reality. What you see and what you use, such as the visual aspect of the website, the drop down menus and the text, are all brought together by the front-end dev, who writes a series of programmes to bind and structure the elements, make them look good and add interactivity. These programmes are run through a browser. The backend developer engineers what is going on behind the scenes. This is where the data is stored, and without this data, there would be no frontend. The backend of the web consists of the server that hosts the website, an application for running it and a database to contain the data. The backend dev uses computer programmes to ensure that the server, the application and the database run smoothly together. This type of dev need to analyse what a company’s needs are and provide efficient programming solutions. To do all this amazing stuff they use a variety of server-side languages, like PHP, Ruby, Python and Java. What about Full-Stack Development? If both Frontend and Backend development appeal to you, you could consider becoming a Full-Stack Developer. Full-stackers take care of both the front-end and the back-end, and need to know how the web works on all levels, in order to determine how the client- and server-sides will relate. Naturally working up to this level of expertise will take longer, as there is more to learn. Getting Started in Web Development All this may sound daunting at first, but you don’t need to know everything at once. You will grow your knowledge progressively. And things will begin to click. The great news is, learning to become a developer is easily accessible and affordable. This is especially true with OpenClassrooms. Emily Reese, Web developer and Teacher at OpenClassrooms explains, Whatever aspect of web development attracts you, we have programs that can help you reach your goals. No matter your background, you can learn web development. Emily told us, In undergrad, I studied art history and architecture and then decided to become a developer whilst I was working at Kickstarter because I saw how the web could complement creativity in the arts. The same is probably true for any field. Becoming a web professional allows you to participate in absolutely any field, because the web has become universally present in our professional lives. You can be a web developer and specialize in anything from the art world to the automobile industry. The first step is to decide which aspect of web development interests you and then start out with one programming language. For example, if you are interested in front end you can start by learning some HTML and CSS, then start working on projects as soon as you are comfortable with the basics. Our Web Developer Program is a perfect fit for this route. But others may suite you as well. It also helps to join a discussion group or community of other web developers, so that you can troubleshoot, discuss ideas and get inspiration. That’s why you become part of the OpenClassrooms community when you enroll in a program on the site. ",
            "date": "Answered September 3, 2020",
            "views": "124",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linda O'Neill",
                    "user_href": "/profile/Linda-ONeill-71"
                },
                {
                    "user_id": "Jenny Williams",
                    "user_href": "/profile/Jenny-Williams-454"
                },
                {
                    "user_id": "Martin Nova",
                    "user_href": "/profile/Martin-Nova-3"
                },
                {
                    "user_id": "Ankita Trivedi",
                    "user_href": "/profile/Ankita-Trivedi-73"
                },
                {
                    "user_id": "Amelia Carter",
                    "user_href": "/profile/Amelia-Carter-42"
                }
            ]
        }
    ]
}