{
    "title": "What is the most disturbing photograph you’ve taken? - Quora",
    "tags": [
        "Photographers",
        "Photographs",
        "Photography",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Fisher",
                "href": "/profile/Emily-Fisher-32"
            },
            "answer_text": "I suppose if I were to go through my oh so many thousands of photos, I’d find some rather disturbing things, but you can’t make me do that! So let’s go with the one my butt just shot, shall we? Is it called a butt shot, even if the phone wasn’t in your butt pocket? Is there another name for going into your photos and finding a shot you didn’t take, from just a moment ago? An IPS? (Involuntary Photo Snap?) In the end, that’s neither here nor there, because if this is a butt shot, my butt has a serious glitch, and I better see a proctologist ASAP. Maybe I better see a dermatologist, too, because I don’t believe my skin has ever been that kind of color before. And I don’t have filth on my arm, or leg, or whatever fucking limb that is!  I don’t think this bodes particularly well for my new phone, either. Disturbing. ",
            "date": "Answered June 8, 2019",
            "views": "1122",
            "upvotes": " View 194 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George Thomas",
                    "user_href": "/profile/George-Thomas-1275"
                },
                {
                    "user_id": "Julie Botten",
                    "user_href": "/profile/Julie-Botten"
                },
                {
                    "user_id": "Lauren Kennedy",
                    "user_href": "/profile/Lauren-Kennedy-167"
                },
                {
                    "user_id": "Gerard Blais",
                    "user_href": "/profile/Gerard-Blais"
                },
                {
                    "user_id": "Raphael Nephi James Manarpiis",
                    "user_href": "/profile/Raphael-Nephi-James-Manarpiis"
                },
                {
                    "user_id": "Cassidy Bush",
                    "user_href": "/profile/Cassidy-Bush"
                },
                {
                    "user_id": "Shannon Frey",
                    "user_href": "/profile/Shannon-Frey-2"
                },
                {
                    "user_id": "Ahmad Abubakr (احمد ابوبکر)",
                    "user_href": "/profile/Ahmad-Abubakr-احمد-ابوبکر"
                },
                {
                    "user_id": "Harish Mody",
                    "user_href": "/profile/Harish-Mody-1"
                },
                {
                    "user_id": "Darla Olson",
                    "user_href": "/profile/Darla-Olson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pattie Huggins Deitrick",
                "href": "/profile/Pattie-Huggins-Deitrick"
            },
            "answer_text": "This is the famous Thor’s Well, in Oregon. People love to photograph it, but too many people insist on getting too close to its edge. The first picture was shot by photographer Antonette Villanueva. This is the type of shot photographers are trying to achieve. Unfortunately this shot requires you to get way too close to this powerful, majestic beast.  At high tide, the waves roll underneath the bowl, filling it from the bottom until it bubbles out the top or bursts up in violent spray. The water then rolls back into the hole, and it fills and drains endlessly, making Thor’s Well a go-to spot for photographers of all levels. Below is my shot taken from a safe distance. I implored this gentleman not to go too close, as the waves were building, and the tide was coming in. His desire to get ‘That Shot’ nearly ended his life.  He was so close to death, it was the scariest thing I have ever seen, he got knocked off his feet, was on his back in the water aimlessly being tossed about, he lost his camera, he was bloodied and battered. Purely by the grace of God, he is still alive. This happened after sunset. The only light was from the sun’s afterglow. I’m totally fine getting a crappy shot, wave in the background, it’s not dramatic, but I get to go home to my family.  ",
            "date": "Answered January 11, 2019",
            "views": "992",
            "upvotes": " View 782 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Linda Moross",
                    "user_href": "/profile/Linda-Moross"
                },
                {
                    "user_id": "Vladimir Galochkin",
                    "user_href": "/profile/Vladimir-Galochkin"
                },
                {
                    "user_id": "Addae Boateng Adu-Gyamfi",
                    "user_href": "/profile/Addae-Boateng-Adu-Gyamfi"
                },
                {
                    "user_id": "Scott Bedborough",
                    "user_href": "/profile/Scott-Bedborough"
                },
                {
                    "user_id": "Doug Brown",
                    "user_href": "/profile/Doug-Brown-364"
                },
                {
                    "user_id": "Rose Urdank",
                    "user_href": "/profile/Rose-Urdank"
                },
                {
                    "user_id": "Bruce Howard",
                    "user_href": "/profile/Bruce-Howard-86"
                },
                {
                    "user_id": "Rhonda Cline",
                    "user_href": "/profile/Rhonda-Cline-10"
                },
                {
                    "user_id": "H Bransford",
                    "user_href": "/profile/H-Bransford"
                },
                {
                    "user_id": "Aysha Jones",
                    "user_href": "/profile/Aysha-Jones-3"
                }
            ]
        }
    ]
}