{
    "title": "What are the most controversial topics in neuroscience? - Quora",
    "tags": [
        "Controversies"
    ],
    "response": [
        {
            "author_info": {
                "name": "José Francis",
                "href": "/profile/José-Francis"
            },
            "answer_text": "Unfortunatelly, I don't have time now for write about the facts and arguments of each topic, but there are many controversial topics in neuroscience. You could even say that all neuroscience is controversial, if you start to talk and think about cognitive functions and emotions. For start, here goes a list of controversial topics in neuroscience: - Free will. Many scientists argument that we don't have any free will about our actions, and that free will is a necessary ilusion for our brain to function properly. - Consciousness. It has not been even defined yet, and it is difficult to evaluate, and also answer questions like \"Do plants have consciousness?\". - Souls. It may seem like the existence of a soul is not a scientific matter, and it is something in the field of spirituality and superstition. However, until now we cannot say for sure that such a thing like a soul does or does not exist. We have some evidence against and for this idea, and as it is a matter related to religion and human sciences, it is even more difficult to discuss and evaluate. - Emotions. We now know how emotions are generate and how it impacts behavior in some particular situations. However, it remains impossible to determine from where and why some emotions arise, and what it is exactly its function in our brain functioning. - Psychoative drugs. There are controversial facts everywhere when you talk about drugs that mess with neurotransmission, because you will see many different effects and some will say that is awesome in clinical uses, and others will say that is the worst and useless drug ever. Adding to the chaos, you will find many unknown mechanism of action for various drugs, such as mirtazapine, that acts as an agonist and also, paradoxically, as an antagonist of serotonin. - Thinking. It is funny to imagine that we don't know yet how and why exactly we think. Intuitivelly, we know what we are doing and what we are talking about, but we don't know how exactly this kind of things are processed in our brain. I'm being very harsh on these statements, as we actually know much about all the topics listed. Nevertheless, all these issues are really controversial in the neuroscience field, because of the methodological problems that we have and also because of the very nature of neuroscience. That kind of thing is what makes neuroscience so interesting, intriguing and funny! ",
            "date": "Updated May 3, 2015",
            "views": "10",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Monika Puszka",
                    "user_href": "/profile/Monika-Puszka"
                },
                {
                    "user_id": "Chris Modisette",
                    "user_href": "/profile/Chris-Modisette"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Maryam Ali",
                    "user_href": "/profile/Maryam-Ali-229"
                },
                {
                    "user_id": "Ishaan Hiranandani",
                    "user_href": "/profile/Ishaan-Hiranandani"
                },
                {
                    "user_id": "Nick Schmitz",
                    "user_href": "/profile/Nick-Schmitz-10"
                },
                {
                    "user_id": "AJ",
                    "user_href": "/profile/AJ-27"
                },
                {
                    "user_id": "Robin Karlsson",
                    "user_href": "/profile/Robin-Karlsson-9"
                },
                {
                    "user_id": "Rebecca Luna",
                    "user_href": "/profile/Rebecca-Luna"
                },
                {
                    "user_id": "Esteban Baute",
                    "user_href": "/profile/Esteban-Baute"
                }
            ]
        },
        {
            "author_info": {
                "name": "James L Graetz",
                "href": "/profile/James-L-Graetz"
            },
            "answer_text": "I am not a neuroscientist, but am currently studying.  For me the origin of consciousness, and what consciousness is, remains the most contentious issue. Consciousness is something that provokes more questions than answers, and the more you learn and think about it the deeper the rabbit hole becomes.  Does brain equal consciousness? This is the central question in this debate. Are we a bundle of neurons that respond purely to inputs? So much of what we experience with our senses is interpreted by our brain, these inputs contain noise and error, and we are so easily mistaken or manipulated.  What are dreams, and premonitions? Are we truly only our brain? If we are just a bundle of neurons, science will one day be able to construct consciousness. Yet we have not yet been able to agree on what exactly that is. Click through the link for more of the debate. \"consider a television set. We can damage a television set so severely that we lose the image on the screen, but this doesn’t prove that the TV actually produced the image. We know that David Letterman does not live behind the TV screen on which he appears; yet the contention that brain equals consciousness is as absurd as if he did.\" - See more at: Why Consciousness is Not the Brain | SuperConsciousness Magazine ",
            "date": "Answered May 15, 2014",
            "views": "44",
            "upvotes": "0"
        }
    ]
}