{
    "title": "What is the importance of the Philippines’ history to students? - Quora",
    "tags": [
        "Life in the Philippines",
        "History of the Philippines",
        "History Books",
        "The Philippines",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Avinante",
                "href": "/profile/Josh-Avinante-1"
            },
            "answer_text": "The past, it is a dangerous place.It is a story that is full of mystery.It is interesting if not censored just like any other movieBut most important of all, so you would not repeat the same mistakes for your generation. Unfortunately, humans still do. They never learned from the Napoleonic wars and began World War I. They did not learn from World War I and began World War II. They did not learn from Martial Law and began the Extrajudicial Killings.Philippine History for grade school and high school is boring like the multiplication table. You have to mrmorise it so you can understand mathematics. Philippine History for high school was mellowed down for Catholics and children, which made them boring. However, you have to know the people involved and dates they occured to understand the conspiracies that will be taught in college. Then history becomes exciting. Honestly, it is not important. In fact it is destructive and used as propaganda. The past, it is a dangerous place. And history is written by the victors and those who lost are remembered as demons and monsters. And much of real heroes are forgotten and even much more villains now standing as monuments across the archipelago. But you see, humans opted to errect monuments commemorating the haulocaust. massacre of manila. rape nanking, pearl harbor, tirad pass, etc. Because nobody wants to br forgotten no matter how dark the past. And that is why you are made to study Filipino History. ",
            "date": "Answered June 7, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elizabeth Cadavero",
                    "user_href": "/profile/Elizabeth-Cadavero"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herr Vonnische",
                "href": "/profile/Herr-Vonnische"
            },
            "answer_text": "It's frickin simple. To make sure that people will remember the past and hope it either won't happen again or it will repeat. Philippine history is very young and mildly discovered. There are more questions than answers even now, compare to before. If people learn nothing about Rizal, lapulapu, Gomburza, Marcos, Sison, GMA, Yamashita, Quezon, etc. How can they be ready? These are very good lessons when facing the future. How can people find inspiration to do good when they didn't know Manuel Quezon's tackling of the Jewish problem and his sheltering of Jews from the Holocaust? The amount of redaction and censorship once present in the books are frustrating especially for History nerds like me. They are very good sources of lessons even IRL. But access to even the conspiracies is frustrating. ",
            "date": "Answered October 25, 2020",
            "views": "457",
            "upvotes": "0"
        }
    ]
}