{
    "title": "What is the history of China? - Quora",
    "tags": [
        "History of China",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Nghiem",
                "href": "/profile/Matthew-Nghiem"
            },
            "answer_text": "The entire History of China is a lengthy, complex yet unfortunate and tragic story of a people long removed from the former heights of their ancestors’ achievements, now in this modern day and age seeking to reclaim their ancient heritage. Although many sinologists and other experts cannot come to a consensus on just how old Chinese civilization is, whether it be 3,500, 4,000, 5,000 or 6,000 years old, this is indeed the main “TL;DR” of China’s long history: that the Chinese people today are fundamentally survivors, and that China is only a mere shadow of what it used to be relative to the rest of the world. By far the most important part of China’s History is the recounting of its decline from power as one of the greater civilizations of Humanity, and also its long and vexing attempt today to finally reclaim this former glory, in order to once again re-establish China as a “Great Power” of the East Asian periphery. Thus China’s journey today, and all the progress which it has done whether it be in the realm of technology, economy, culture or science, is all geared towards a journey of reclamation first and foremostly. And to be precise, it is a reclamation of not only its identity as the legitimate successor to the old dynasties of China, but also of China’s former historical status in the world. Indeed, it is extremely important especially for those unfamiliar with Chinese History, to understand that despite the existence of such stunning and glistening cities as that of Beijing (pictured below), China has yet to re-attain all of what it has truly lost. And not only that, but also of how China’s long history, motivates it today.   Standard message from me here as usual, don’t read on if you don’t like long answers. Spoiler alert (or actualy really just common sense), as I’m covering such a huge part of China’s entire history, this will be my longest answer ever to date. There are a total of 12,900 words, so make sure you take the adequate breaks required, otherwise you’re going to suffer a lot. Here are the contents of my answer for ease of navigation: Chapter I: “Second to None”: The Pinnacle of Chinese Power and ArroganceChapter II: “On the Edge of Death”: The Beginning of the Decline of Chinese CivilizationChapter III: “A Point of No Return”: The Fall of Chinese CivilizationChapter IV: “The Age of Disunity”: The Republican Period and End of the Century of HumiliationChapter V: “Brave New World”: The People’s Republic and the Return of 5,000 Years of Chinese CivilizationFinal Summary and Author’s Personal Message (to tie up any “loose ends” and conclude the answer) Chapter I: “Second to None”: The Pinnacle of Chinese Power and Arrogance To understand how and why Modern China came about, having been born from the ashes of “Old China”, it is extremely crucial that one understand just exactly what it is meant, by the title “former historical status in the world”, as was claimed at the end of the 4th paragraph above. As I’ve previously already written extensively on the subject matter (the likes of which you can find on my Quora profile description listed in chronological order), this chapter will of course be very highly summarized, and frankly it will feel very “rushed” no doubt. Long ago, in a time when the Chinese knew nothing of anyone but themselves, there was a rumour, that to the western regions at the “edge of the world”, existed many a great flourishing non-Chinese civilizations. It was a rumour which could not be possible the Chinese thought due to the widespread existence of deserts and mountains, which would make life for any potential civilizations greatly inhospitable. Yet in time, necessity finally saw to it that the Chinese would finally journey west, and when they did, they indeed found the civilizations they were looking for: a plethora of non-Chinese yet highly civilized Indo-European societies. There was the Hindu Kingdom of Shendu in the Indus Valley, the Central Asian Kingdoms of Ferghana and Sogdiana, and finally the Middle-Western Empires of Seleucia and Parthia. In time, the Chinese established embassies with all the aforementioned entities, trading with each and everyone of them. Such a phenomena eventually led to the creation of the famous “Silk Road”, the world’s first system of Globalization, facilitating not only the transfer of goods and services from East to West and back, but also the flow of ideas and inventions:  It was here that China under the Han Dynasty (206 BC–220 AD) first saw how much larger and more powerful their empire was compared to the rest of the world. Long unchallenged, and with no rival in sight, a notion of Chinese superiority was on the rise. This was the beginnings of the infamous Chinese Tributary System, a defining relationship which established China as the “Middle Kingdom”, the sole master of the known world. All other empires and kingdoms which were not part of the empire meanwhile, were considered to be inferior. And to prove that they were inferior, the Han demanded each and every year that the submitting nations send their annual gifts to the Imperial Court, to show that they recognized the legitimate notion of Chinese “superiority”. It was a relationship which would shape China’s relationship with the world for the next 2 millenia. It was also one which did not improve, but only got worse as time went on, exacerbating Chinese arrogance to such an unbearable standard under the succeeding Chinese “Golden Ages” of the Tang and Song Dynasties (618–907 and 960–1279 AD respectively). The Cosmopolitan Tang brought China to its greatest extent relative to the rest of the world, in all of Chinese History. Under the wise rulings of such a relatively open, free and progressive dynasty as that of the Tang, China flourished. Buddhism was adopted, Chinese culture spread to Japan, Korea and Vietnam, China’s cities became the largest in the world, and under the Tang, tributes from as far away as the Byzantine Empire came to the Middle Kingdom to show their respects:  The Tang was internationalized to such an extent, that the renowned southern port city of Guangzhou, had a population of 200,000 people, 2/3 of which were immigrants and expatriates from Persia and Arabia alone. Even Chang’an, the capital of the Tang Empire was filled with expatriates and traders from a variety of ethnicities including, but not limited to Arabs, Persians, Indians, Jews, Japanese, Koreans, Vietnamese, Malays, Turks, Tibetans and Byzantines. Entertainers would also commonly journey from distant lands as far as India and Afghanistan in order to find work in China. Sometimes, foreigners even travelled to China to join its renowned Imperial Army. This was a fact which made Chang’an the largest city in the world at 2 million people, and arguably also the greatest, with only Abbasid Baghdad able to match it at its heights, if even then. An artist’s impression of Tang Citizens visiting a Buddhist Shrine (the Tang being as open minded as they were, readily accepted foreign ideologies including Buddhism from India):  Yet even under the Song which is often denigrated in China today for being militarily inferior, a great period of civilized rule begun, whereby the precedent of the relatively free and open society inherited from Tang was allowed to continue. This incentivized the Song to invent Movable Type Printing, the Mariner’s Compass, Tea, the Restaurant, Advertisements, the Mechanical Clock, Gunpowder, Multi-Stage Rockets and even Paper Currency. All of which were used to improve Agricultural, Industrial and other Economic Productions to unprecedented levels, seen only in Europe centuries later, during the Industrial Revolution. Under the Song, China’s Economy reached its almighty zenith, accounting for 50% of the world’s wealth, unlike the Tang before it which had held only 40%, it was a fact which ensured the prosperity of Song citizens from 980–1120 AD at least:  So prosperous in fact was Song, that the Chinese Government were even able to support the funding and establishment of retirement homes, public clinics, and pauper’s graveyards. Even a national State funded school and Welfare System for the elderly was proposed. Thus under the wise rulings of Tang and Song, China entered what Historians identify today as and rightfully so “The Chinese Millennium”, a 900 year long period from the 600s to 1500s. It was a period in which Chinese greatness and therefore arrogance was the dominating force of the world, skyrocketing in comparison to when it had only been slowly accelerating, under the preceding Han Dynasty. During this time, China reigned supreme, rarely unchallenged by anyone anywhere in the world, for the vast majority of those 900 long years. So of course, when the Mongols came and razed Song China in its entirety to the ground, killing 60 million people in the process, the Chinese were annoyed. For in their eyes, how could such a powerful and wise peoples as them have been overtaken by such an “uncivilized” peoples as that of the Mongols? An artist’s impression of the Mongol Invasion of China:  This was a question which would soon be “answered” however, when the Chinese Tributary System finally peaked under the newly established, Ming Dynasty of China (1368–1644), which had just overthrown the Mongols, re-establishing Chinese rule over the Middle Kingdom. The Ming, perhaps seeking to also restore Chinese superiority funded an extremely expensive Tributary mission, popularly known today as the “Seven Voyages of Zheng He” (1405–33). For a period of 28 years, a Fleet composed of 317 ships holding 27,500 men (the equivalent of 50% of London’s 15th Century population) were sent on a total 7 voyages around the world from 1405–33 AD, in order to spread the glory of the Ming Empire:  In the Early 15th Century, China emerged as the most advanced empire on Earth. Its might at sea and on land was unparalleled, and it appeared as though China was destined to continue its glorious journey throughout history, with its dominance in the world secure. Of course, such a vain and arrogant mission, which seeked only to increase the prestige of China in the eyes of the international community, could never last. Indeed in 1433 AD, the ruling Xuande Emperor examined Ming China’s vast financial records, and observed that whilst the Ming Voyages had successfully fulfilled his predecessor’s wish of increasing the prestige of China in the eyes of the International community, it was extremely unprofitable, and brought little material gain to the Celestial Empire. An artist’s impression of the Muslim Eunuch Admiral Zheng He, on his Imperial sponsored voyages:  This was at last, where hundreds of years of Chinese arrogance, which had at first slowly accelerated under the Han, then skyrocketed under the Tang and Song, and now peaked with the Ming, finally begun to actively affect Chinese Foreign Affairs. It was something, that was most evident in the actions of the Ming Emperor. This arrogance affected the Emperor in such a way, that he now thought that despite the voyages going on 28 years, the Ming had nothing to show for it because the outside world was extremely poor, thus they could give nothing of extreme importance to China. And if they had nothing to offer the Heavenly Kingdom, then was there really a reason that China needed to keep in touch with them? There was none he thought. The Voyages, a complete waste of money he thought, should be stopped as to save much needed financing to further fund both physical fortifications and the Imperial Military, in preparation of an “imminent” Second Mongol Invasion. Instead, the Ming Voyages were abandoned, and China turned its attention inwards. Thus unlike the Han, Tang and Song before it, which had been relatively free, open and progressive societies, the Ming was totalitarian, closed minded and deeply xenophobic. Instead, all the resources of the State were poured into projects such as the Renovation of the Great Wall of China (costing the modern equivalent of $360 Billion, utterly spending all of the limited resources of Ming China). The Wall itself despite stretching for 8,850 km, and despite being equipped with 5,723 beacon towers, 1,176 defence fortresses, 3,357 watch towers and 7,062 defence towers, and guarded by 100,000 soldiers kept on 24/7 alert, was also extremely useless:  The issue here essentially, was that China had been a powerful country for far too long. Beginning with the Han, then exacerbated by the Tang and Song, notions of Chinese superiority were in full swing. Long unequalled by anyone in the world, any notion that China somehow was not the greatest any longer, was frankly offensive to such a mighty people as that of the Chinese. And of course when the Ming finally did end Zheng He’s Voyages, it begun a long period of relative isolation from the rest of the world. And this isolation, combined with the totalitarianism and backwardness of the Ming Emperors led to the scientific and technological stagnation of “Merciless Ming”, which would prove to have only the most disastrous of consequences hundreds of years later. Thus ended the “Chinese Millennium”, which begun with the Tang Dynasty in the 600s, finally concluding with the Ming Dynasty in the 1500s. China, long the most powerful “nation” on Earth, was powerful no longer. This became especially true when in 1492, Christopher Columbus begun the European Age of Discovery, with his own discovery of the Americas imminently ensuring the rise of non-isolationist Europe, at the parallel expense of the isolationist Celestial Empire.  Chapter II: “On the Edge of Death”: The Beginning of the Decline of Chinese Civilization The Ming precedent of relative Isolationism from the rest of the world carried on even after the dynasty had fallen. When the last Imperial Dynasty, the nomadic Manchu Qing Empire (1644–1912) came to power, it still refused to model itself on the Cosmopolitan Tang Empire, and instead copied the previous Han Chinese led Ming Empire, and kept its borders relatively shut. It was not just Ming’s isolationism that Qing inherited however, but also its arrogance and the millennia old Chinese notion of Sino superiority. It was a notion which would ultimately lead to the decline of Chinese civilization, and would usher in many countless and needless years of suffering. Even the first clue to China, that there existed “bigger” and worse “barbarians” than the traditional nomadic hostiles of the north, were all but ignored by the Qing. The prime example of this was exemplified in “The Macartney Embassy” of 1793. To make matters worst, China had by this time also expanded to its greatest heights under the Qing Empire, weighing in with an area of 14.7 million km^2, making the Qing the 4th largest Empire by area ever in Human History, which would of course only further increase the arrogance of the Chinese by then:  Anyway, in 1793 George Macartney the First Ambassador to Qing China from the rapidly ascending Western Superpower of the British Empire, visited its Chinese counterpart. Bringing along with him many notable gifts for the ruling Qianlong Emperor such as that of a model of the “Royal Sovereign” (a British “Man of War” class battleship), Macartney stressed that the gifts were given in good faith based upon a relationship of equality of nations, as had long been practiced by the Western Empires based on the notion of “Westphalian Sovereignty”. In the Emperor’s mind however, the Treaty of Westphalia was not only invalid, but also inferior to the traditional notion of Chinese superiroity, as had long been the advocated case under the Chinese Tributary System. According to Qianlong, China was still the greatest civilization in the world, thus the act of giving gifts to him should have been a given, and done regardless of this foreign concept of “equality”. For why shouldn’t the ruler of “all under Heaven” be given gifts? No, just as it was right for the Emperor to sit at the glorious apex of Chinese society, so it was also right for China to sit on top of the world. Thus he viewed the British as merely another “tribute nation”, a country submissive to Imperial authority and though he was pleased with Britain’s gifts (and from a country so far away too), stressed that: “We have never valued ingenious articles, nor do we have the slightest need of your country’s manufactures…Curios and the boasted ingenuity of their devices I prize not.” An artist’s impression of The Macartney Mission to Qing China:  Then came the part which angered the Qianlong Emperor most: Macartney not only insisted that China open up its borders to trade, borders which had long been closed since the end of the Ming voyages in 1433 AD for 360 years, but refused to “Kowtow” to the Emperor, thereby refusing to acknowledge Chinese superiority regarding tributary gifts, or even by physically showing the ultimate sign of submission. For reference, and just in case it is in anyway unclear, the following is a Kowtow:  Macartney’s unwillingness to submit (as he reasoned that no good Christian could bow to a King other than his own), angered the Qianlong Emperor greatly, who then of course furiously sent him away. China, long isolated from the rest of the world, under Qianlong’s vision, was to remain isolated thus “pure”. Annoyed at his failures, in response Macartney directed one last comment towards the Qianlong Emperor, prophesying about the imminent fate which would soon befall upon the Qing according to his observations: “Your Qing Empire is a crazy, first rate man of war, able to overawe her neighbours merely by her bulk and appearance, which a fortunate succession of able and vigilant officers have contrived to keep afloat for these hundred and fifty years past. She may drift sometime as a wreck and then be dashed to pieces on the shore.” It was unfortunately for China, a prophecy which would only prove to be too true. For Macartney having the fortunate privilege of being an observing, and uninvolved third party could accurately see just how truly vulnerable Qing China really was, something which the closed minded Qing Emperors and citizens could never ultimately realize. Truly, it was Imperial China’s last and arguably greatest mistake. For not only were the British the first true superpower of the world, in the true essence of the word unlike the Han or even Tang which were only superpowers of the “known” world, the British were also the first Human society on Earth to have industrialized. An artist’s impression of the Industrial Revolution in Britain, an event which made the British Empire the world’s first true Superpower:  This was a serious matter, for the Industrial Revolution had according to German Philosopher Karl Marx allowed the British to become unimaginably wealthy, and according to him saw wealth creation “on a scale larger than all of Human History to this day (mid-1850s) put together”. Indeed, none of the “Classical” Western Economists, even the famous Adam Smith, the so called “Father of Modern Capitalism” had even considered the vast wealth resultant from Industrialization, to have even been a theoretical possibility. Thus by the time the British finally returned to China in 1839, merely 46 years after the failure of the Macartney Embassy, the differences between Industrial Britain and Agricultural China, initially already clear, were now further exacerbated. On one hand was the modern, industrialized, technologically advanced, and globe spanning superpower of the British Empire. And on the other hand, was the ancient, agricultural, technologically stagnant and regional power of the Qing Dynasty. An artist’s impression of the world renowned Royal Army (during the peak of the Industrial Revolution, Britain’s infamous military armed with only the latest and most sophisticated of firearms was also the greatest, and best trained martial force in the entire world):  It was not a healthy comparison as such, but instead one in which the superior party was self-evident, an obvious fact which still eluded the Qing Administration even leading up to the return of the British. And of course, as a direct result of the consequences of this failure to realize the very real threat which the British now posed to the Empire, Chinese civilization was going to receive its biggest, and most violent wake up call yet. For in the time leading to that crucial year of 1839, the Qing had been faced with 2 immediate pressing issues: an accelerating domestic demand for Opium on one hand, and on the other hand; the increased demand from the West for exclusive Chinese products such as Silk, Porcelain and Tea. The Qing Government desiring neither since they were not only an isolationist nation, but also acutely aware of the negative effects of such a harmful drug as that of Opium, sought to limit International Trade officially under the “Canton System” of 1756, by permitting trade to only be permitted in what is today the city of Guangzhou (Canton). It was something which would not last long however, for despite the existence of the System, domestic demand for such a highly addictive drug as that of Opium, was still on the rise and rapidly so as shown by the following graph:  The powerful multinational corporation of the British East India Company, seeing that the demand for Opium in China was strong and growing, increased its Opium Production in Bengal, India. The reason behind this was in order to auction off the Opium grown in the Subcontinent to independent foreign traders in exchange for silver, in order to strengthen its economic influence throughout all Asia. To make matters worst, Qing “middlemen” inside the Celestial Empire often made massive profits reselling the drug inside Qing China itself. Up until then, the Chinese Economy was extremely prosperous, and held an extremely huge trading surplus with the rest of the world. As a consequence, it had allowed China to expand Foreign Trade at 4% per annum, grow its population from 135 to 300 million people in merely 146 years, and account at its peak in 1820 for 35% of the world’s wealth:  But when the East India Company flooded Chinese markets with Opium, this not only severely decreased its formerly huge trading balance, but also drained the economy of Silver (which was used exclusively in Chinese Foreign Trade), and also increased the number of Opium addicts within the country, severely undermining non-material living standards. Clearly furious, Daoguang, then the ruling Emperor of Qing China, appointed to the office of Viceroy, a man by the name of Lin Zexu who he then commanded to impose the iron fist of the Imperial Court onto the Opium Trade, declaring that Opium henceforth was to be permitted no longer. Adhering to the commands of the Emperor, Lin not only closed the Port of Canton off to any foreign trade, but also managed to confiscate 1.21 million kilograms of Opium in 1839 without any compensation. The British meanwhile, viewed China’s actions as a direct challenge to the prosperity of not only the British Empire, but also that of the Freedom to Trade, which China had so surely made clear through its actions, that it would not play according to the rules of such an oppressive (at least in its eyes) foreign power as that of the British. A portrait of Emperor Daoguang, the man who sought to criminalize the sale, possession and use of Opium in the Qing Empire:  And unfortunately for China, this represented the beginning of the decline of Chinese civilization, and the end of all things good. For in the following June of 1840, the inhabitants of the renowned port city of Canton, caught a small glimpse just beyond the horizon, of what was truly a horrifying sight. A vast, and fully modern army of the industrialized superpower that was the British Empire was spotted, sailing ever so closer to the city. 19 thousand troops, including a retinue of 5,000 British Soldiers, 7,000 Indian Infantrymen, and 7,000 Royal Marines were on board the fleet of 37 fully modernized war vessels. Taking the city of Canton by surprise, they then proceeded to set up a base of operations there, in preparation of what they thought would be a long, brutal and all out war. An artist’s impression of the British steamship “Nemesis” in the process of decimating a Chinese War Junk:  They were wrong. In fact, it only took a total of 2 years for the Royal Army to bring the entirety of the Qing Empire to heel. To make matters worse, in the aftermath of the wars, it turned out that only 69 British Soldiers had actually died directly because of Chinese efforts during the wars. In contrast, 20,000 Qing Soldiers lost their lives in the same 2 year timeframe. China, even up until that very moment of their humiliating defeat, had considered themselves to be the supreme master of all under Heaven. The undeniable fact thus that it had lost to a “tiny” country on the other side of the world, on their own home turf, was an absolutely and horrifically unbelievable nightmare for such a proud, and formerly mighty peoples. In its long and proud history, China had defeated the “barbarians” many a times prior. The Han Dynasty had crushed the Xiongnu Empire, the Tang Court had decimated the Gokturks, and even Ming China had overthrown the Mongols, so why could the Qing then not defeat the British? It was truly a very confusing time for them indeed. The confusion didn’t just end there however. In what must have seemed like a dystopian nightmare come true for the Qing Administration, the ultimate act of humiliation was finally proposed by the British. The embarrassing surrender of Qing, already “hilarious” in its own right, was further exacerbated when the British demanded from China war reparations, the full surrender of Hong Kong over to the British, and also the full opening of the Ports of Canton (Guangzhou), Amoy (Xiamen), Fuchow (Fuzhou), Ningpo (Ningbo), and Shanghai, in what is today remembered as the “Treaty of Nanking” (1842). An artist’s impression of the signing of the Treaty of Nanking between the Chinese and British Empires on board British naval ship HMS Cornwallis:  Unfortunately for the Qing, the Nanking Treaty was only the first amongst many in the series of the“Unequal Treaties” which were imposed onto it. The treaties were so called, because it was essentially one sided and only China was obligated to give what they were promised, the invaders meanwhile had no obligations, and instead only received from the Chinese. Most importantly, the result of the Opium Wars exposed to all China the bitter truth: that not only was the Chinese Navy severely outdated, fighting modern British steamships with wooden junks barely even appropriate enough to fend against a Chinese pirate invasion, but the Qing Army also, was just as incompetent. British soldiers, using advanced muskets and artillery, had easily outmaneuvered and outgunned the Qing Imperial forces in ground battles during the Wars, further exposing the weakness of Imperial China. And not just that, but the Chinese often fought on land with sword and bow against the Musket armies of the British:  In this way, the Opium Wars was a turning point in China’s already long history, marking the beginning of the “100 Years of National Humiliation”, and thus the decline of Chinese civilization into the “dustbin” of history for the rest of the period.  Chapter III: “A Point of No Return”: The Fall of Chinese Civilization Even in the aftermath of the Opium Wars, peace continued to elude China. In fact, things not only didn’t get better, but in fact got worse, much worse. Though the British were the first Western power to have invaded the Middle Kingdom, it was certainly not the last. One by one, the nations of France, Russia, the United States and even Sweden and Norway imposed their wills onto the rapidly decaying Qing Empire, in the forms of further unequal treaties akin to that of the Treaty of Nanking. In this way, the Qing managed to lose hundreds upon thousands of km^2 of land to the various European Empires. The most noteworthy loss of land came with the unequal treaties of Aigun (1858) and Peking (1860), in which the Qing was forced to cede the entirety of Outer Manchuria (land with an area of at least 600,000 km^2) to the Russian Empire. A map of the land surrendered to the Empire of Russia. In olive-brown is the territory ceded under the Treaty of Aigun, in pink is the land lost to the Convention of Peking:  Indeed, Qing China ended up losing so much land not only to Russia, but also to many other industrialized nations, that the People’s Republic of China today only has 2/3 of the former land the Qing Empire once had at its heights. For reference, here is the territory of Qing China at its heights in 1820, superimposed onto the borders of the nations of the 21st century:  In stark contrast, here is the Qing Empire in 1908, merely 4 years away from being replaced with the Chinese Republic, having lost Hong Kong, Macau, large portions of Western and Northeastern Qing China, and of course the Island of Taiwan most notably:  The final straw however, actually came 4 years prior in 1856, a year in which Qing authorities, intending to search for a notorious Chinese pirate, unknowingly boarded a British ship which went by the title of “The Arrow”. Annoyed at what they interpreted as an act of Chinese aggression, the British enlisted the help of the French Empire and in doing so begun the Second Opium War (1856–60) against the Middle Kingdom. It was a conflict in which the Chinese emerged once again in tatters, as this time the unequal treaty of Tientsin (1958) was imposed onto them. It was a completely one sided agreement which contained clauses deeply insulting to the Qing, including a demand which required that all official Chinese documents be written in English henceforth, whilst also accommodated by an edict which granted British warships unlimited access to all navigable Chinese rivers. An artist’s impression of the French Army in the process of routing its Qing counterpart during the Second Opium War:  And not only that, but it lead to the opening of 80 more “Treaty Ports” against the will of the Chinese. The ports of course allowed the invaders to exclusively benefit at the expense of the Qing Economy. At last, the Chinese finally understanding that firstly, the invaders would never stop meddling in China’s domestic affairs, then also recognizing that their beloved country was no longer the greatest in the world, opted for change. And thus in 1861, the Qing Government decided to enact the national policy known today as the “Self-Strengthening Movement” (1861–95) in which it desperately attempted to adopt in full, the ways of the West in order to re-invigorate the dying Qing Empire. It was as one scholar put it, the act of “learning barbarian methods in order to adequately combat barbarian threats”. To this extent, the Qing attempted to replicate all of what they thought had made the West successful. First they examined Western Military and Economic practices, then they set out to study the way in which the West conducted their trade and innovated, and finally they encouraged the act of learning Western languages in order to communicate with the European Empires. Embassies were of course also set up in the West. In this way, they hoped to successfully reform Qing China. China’s “Jinling Arsenal”, one of the many modernized ordinance armouries of the Sino Military, established by the renowned Qing General Li Hongzhang :  Though the idea for change was correct, the way in which they intended to execute it, was not. Instead of entirely reforming the Qing’s Social and Political systems, the reformers instead wrongly suggested that they should strengthen the nation by preserving Imperial rule, whilst maintaining traditional Confucian values, values which more and more seemed obsolete in the face of an ever changing world. This was the great failure of the Qing, as Historian Valarie Hansen recounts: “The educated reform faction joined the Self Strengthening Movement with the motto ‘Confucian ethics, Western science’. China, these reformers said, could acquire modern technology, and the scientific knowledge underlying it, without sacrificing the ethical superiority of its Confucian tradition. As one of their leaders stated: ‘What we have to learn from the barbarians is only one thing: solid ships and effective guns’.” Apparently, even in the last days of the Qing Empire, the national notion of Chinese superiority had still not withered away. The Qing who still thought ever so highly of themselves, insisted that the amount of knowledge they could ever obtain from the West, was surely undeniably limited. Thus, it should not come as a surprise to anyone that despite the Movement lasting for almost 3.5 decades, the only accomplishments which the Qing saw, were mostly superficial in nature. Yes, the Modernization of the Imperial Military including the formation of 4 modern Naval Fleets was a step in the right direction. A photograph of Chinese Battleship “Dingyuan”, the Capital Ship of the “Beiyang Fleet”, 1 of the 4 Modernized Chinese Fleets of the Qing Navy:  However, the fact remains that no real change especially in the realms of the Economy or Military could ever take place, without an equivalent reform in the Social or Political spheres. And to make matters worse, the Qing Administration was not only severely incompetent, and slow to respond to threats, but also severely corrupt and unwilling to co-operate with each other. So of course when the First Sino-Japanese war begun in 1895, it was already over long before it had even begun. It was in fact a war which further showcased the failures of Qing China. The difference this time however was that the prevailing view in the West, was one which was entirely biased in favour of China. William Lang to cite one example, praised the sophisticated training techniques of the Qing Empire, and greatly commended also the 4 modernized Qing Fleets, noticing that they were equipped with the latest advances in both guns and fortifications. In fact, he even famously claimed prior to the Chinese-Japanese War that: “…in the end, there is no doubt that Japan would be utterly crushed” In no way was Lang speaking for himself either, this was the overwhelming consensus of the West, that should a war arise between the Qing and Japanese, China would surely prevail, being the mightier of the 2 nations. Instead, at the decisive Battle of Yalu River (1894), 5 out of the 14 ships of the mighty and modern “Beiyang Fleet” were sunk. This was in stark contrast to the Imperial Japanese Navy, which despite having not a single Battleship class war vessel, lost a total of 0 naval ships. An artist’s impression of the humiliating Battle of Yalu River (note that all the ships on fire down below in the background, belonged to the Qing Navy):  The humiliation of China was thus complete, as Japan traditionally a country once subservient to the Middle Kingdom from the times of the Cosmopolitan Tang onwards, now proved to China that it wasn’t even the most powerful country of Asia, let alone the entire world. A mocking impression of the victory of “small” Japan over “large” China, as was depicted by the Western Political Satirist; “Punch”:  This was a fact which forced China to reluctantly agree to the unequal “Treaty of Shimonoseki” (1895), in which the Island of Taiwan was ceded to the Japanese, a gift which they gladly kept for the next 50 years. In the wake of the Chinese defeat at the hands of Japan, and also the realization that the Self-Strengthening Movement had at last failed, the Qing Administration realised exactly to what extent just how utterly the Chinese had failed to reform the nation. Many Chinese, impressed with what they saw in Meiji Japan as a successful attempt to reform, desired to copy their successes. For the fact remained that only 40 years prior in the 1850s, Japan even more so than Qing China, had been a backward and Feudal society, with only a subsistence led Economy on which to rely upon. Yet, in only 2 generations, the Japanese now had a Constitutional Monarchy with an Industrial Economy, and also the most powerful military in all of Asia, despite being merely a tiny island nation, one which was up until then to bluntly put it, was mostly of historical insignificance. A 19th century artist’s impression of the Satsuma Rebel Samurai’s final surrender to the Westernized Imperial Japanese Army, and therefore also to the Modernization efforts of Feudal Japan, which then swiftly allowed the Japanese to further rapidly modernize:  It was an achievement which contrasted the Self-Strengthening Movement in every way possible, as a prime example of what Qing China should have looked like after the reforms, and not the black hole which it found itself spiralling down inside. With no common consensus on how to accurately reform Qing society, China suffered dearly for the rest of the dynasty’s miserable existence. In spite of this clear trend towards what people now believed was the imminent collapse of the Qing Dynasty however, China was still determined not to give up at least without a fight. For in the time that the Western Empires had been harassing the former Middle Kingdom, anti-Colonial and more specifically anti-Western yet pro-Chinese attitudes in the Empire, were on the rise. Ultra-Nationalistic sentiments, rising to an all time high with the creation of a secret Chinese sect known as the “Society of the Righteous and Harmonious Fists”, led the Qing’s last major rebellion against the invaders. The “Boxers” as they were known in the West, initially unsupported by the Qing Government, first caught the attention of the Europeans when they specifically targeted both non-Chinese, and Chinese alike in a series of routine and methodical executions. Besieging the entire foreign district of Peking (Beijing) for an entire 2 months from June to August 1900, their actions earned them the wrath of the entire Industrialized World. An artist’s impression of the Boxers in the process of specifically targeting foreigners (in this case Christian Nuns) with the intention to torture and murder:  To this extent, the “Eight-Nation Alliance” formed swiftly in response. Represented by an alliance of 50,000 soldiers formed from the nations of the United Kingdom, France, Russia, Japan, Germany, Italy, Austria-Hungary, and the United States. Together they marched on Peking and fought against the populist “Boxer Rebellion”, which now had the full support of the Qing Government. Over the course of several weeks, the Coalition and the Chinese Boxers and Imperial Army clashed, with the foreign alliance emerging victorious at last, in what was a Pyrrhic victory however. For unlike the Opium Wars in which the British had systematically decimated the Chinese, the Boxer Rebellion had been more disastrous in terms of casualties for the non-Chinese, than for the Qing forces. The victorious Army of the United States of America, triumphantly raising the “Star-Spangled Banner” over the walls of Peking:  The aftermath however as was usually the case, proved to be the worst part for the Chinese, further humiliating an already by this point in time, clearly broken nation. On September 7th 1901, the Boxer Protocol was reluctantly signed by the defeated Chinese, providing for the execution of all Qing officials who had supported the Rebellion, the right for the foreign powers to station their troops in China whensoever they pleased, and the payment of the 2017 Silver prices equivalent of $10 billion (more than the annual National Tax Revenue collected), over a course of 39 years to all the victorious parties of the 8 Nation Alliance. By this point in time, the Chinese only ruled over a small amount of the land they formerly owned. Semi de facto rule and control meanwhile, of the spheres of influence, was in the hands of 5 industrialized entities: the Empires of Britain, France, Germany, Japan and Russia. The wealthiest regions of China, especially along the coast or along the Chang Jiang (Yangtze) River, were carved up amongst the 5 powers as is evident down below:  It was fortunately however, the last of the humiliating events which Imperial China would ever again be faced with. The truth was that the Qing Empire’s time to collapse had at last come forth. After decades of tyranny, xenophobia, backwardness and mismanagement under Manchurian mis-rule, Chinese society was at a tipping point, one which only ensured the imminent coming about of the fall of 5,000 years of Chinese civilization from the centre of the world stage. It was then during such a turbulent time, that a Qing dissident living aboard in Hawaii sensing the imminent collapse of the Imperial Government, rallied together a small group of dedicated followers on the island. He argued that the Qing; brutal, corrupt and long destined for collapse needed a final push in the right direction to further seal its fate. Famously declaring in 1904: “expel the Manchu barbarians, revive China, establish a republic and distribute land equally among the people,” Sun Yat-Sen (Sun Yixian) the soon to be “Founding Father” of Modern China cursed the Qing Empire as the main catalyst for China’s backwardness. A portrait of the future founding father of the Republic of China, Dr. Sun Yat-Sen:  He instead advocated for a Republic as the most suitable substitute, to replace the outdated Government of Imperial China. An intelligent man, he further established major political groups such as the “Revive China Society” and the “Tongmenghui”, which not only argued in favour of a Republic, but also in full support of an armed revolution if needed, in order to violently overthrow the Qing. Such was the case for a populist movement as that of Sun’s, that when all of China was finally ready for a Revolution by 1911, it happened spontaneously, rather than solely relying on the command of Sun. A frieze commemorating the righteous “Wuchang Uprising” (October, 1911), a major milestone in the Chinese Revolution of 1911:  The Xinhai Revolution as it was called, ultimately not only ended the Qing Empire but also ensured thus the fall of the Middle Kingdom. And therefore into the dustbin of history with it also, went 2,133 years of Imperial China, ensuring what was also fundamentally the official fall of China from the world stage of power. Thousands of years of Chinese civilization thus, in what was easily one of the most embarrassing events of the Century of Humiliation, was discarded willingly, an action which not only gave the Chinese a huge identity crisis, but also an unquantifiable, yet massive inferiority complex for the next couple of decades, ultimately weakening the resolve of the Chinese for years to come.  Chapter IV: “The Age of Disunity”: The Chinese Republican Period and the End of the Century of Humiliation When the Chinese Republic (1912–49) finally managed to extend control over all of China after overthrowing the Empire, it sought to destroy any traces of the old world. Apart from obviously adopting Western ideas, hairstyles, clothing and institutions including the abolition of the Imperial Examination System, and its subsequent replacing with a more Western form of education, the most notable rejection of the old world was self-evidently physical. Having long been forced by the Manchurian ruling class to adorn a “Queue” on pain of death, Han Chinese men especially were relieved to be liberated of this shameful hairstyle, which marked subservience to the Qing Empire. Shown below thus, is an artist’s impression of this simultaneous physical and spiritual liberation of China by the Republican Army, at last free from the last vestiges of the Qing:  Instead, Western hairstyles were adopted (shown on the far right, the consequence of a failure to adopt a Western haircut, would only earn you scorn amongst the citizens of the Republic for your backwardness, or perceived loyalty to the former Imperial Government):  Apart from that however, the response to Chinese Republicanism from the International Community (by which I mean the West) was unsurprisingly one of hope, optimism and support. The American Reverend, Dr. George F. Pentecost was one of these many such optimistic individuals, and he asserted the following: “As for the Chinese, I have the highest opinion not only of the Chinese character, but also of the Chinese fitness for self-government. I think they are eminently fitted to make a republic successful. China, for instance, is infinitely better fitted than is Russia for development along republican lines. In fact, China has always been practically a republic. It has had its dynasties of rulers, but the political unit of China has always been the village. The village people have always had their influence upon the Government. What is more, the average Chinaman is intelligent.” Like popular Western views many years earlier regarding China’s supposed overwhelming ability to crush Japan (before the First Sino-Japanese War proved otherwise), Pentecost’s and therefore the West’s view was like before, also extremely inaccurate in the exact same way. In reality, China had never, not once in its history ever had a Democratic government, or at least the Multi-Party Western Style Liberal Democracy which the West so advocated even 105 years ago. It was in reality, an overly idyllic and therefore unrealistic view of 5,000 years of Chinese culture. No, instead in China’s lengthy and equally proud history, the Chinese prided themselves on having a well trained, highly efficient (up until the Late Qing) and highly qualified Government, chosen via the Imperial Examination System:  And thus in time when Western Democracy in China unsurprisingly failed after 1 proper and fair election, the West was once again taken aback, surprised that such a “perfect” system of governance, could have failed. In reality, as Historian Michael Dillion explains it: “… there was no common understanding of what that (a Republic) would involve in practice, how it should be implemented and, of more immediate importance, who should be in power.” And the reason for this was of course simple, China for 2,000 long years of its existence, ever since the times of the Han Empire, had instead practiced Meritocracy, a system based on Confucianism and therefore Chinese culture. It had no experience with such a foreign, and “weird” form of governance, and thus Western Democracy of course failed China for the first and last time in its long history. The famous “5-Coloured Flag” of the Newly Proclaimed Republic of China (the 5 colours represented the 5 main ethnicities which united China: Han, Manchu, Mongol, Tibetan and Uighur. The flag was so made to promote racial integration in the new society, in order to promote China as a multi-ethnic society which did not only just belong to the majority Han Chinese ethnicity):  Furthermore in the meantime, the Chinese people sick of the archaic and outdated notion of the Qing Empire, and also of Traditional Chinese culture which they had blamed (and not completely unjustly so) for the demise of Qing China, refused to revert back to the “old ways”, and was instead left in limbo; and thus the fate of the nation was left hanging in the balance along with it. The Chinese people, were a mere shadow of what they used to be. They were broken, defeated, humiliated further and now also without an identity and purpose, due to their willing rejection of Confucianism and Traditional Chinese culture. Perhaps realising that the Chinese needed an ideal behind which they could rally-something to fight for and be proud of- Dr Sun, promoted as an alternative to Chinese culture; the “Three Principles of the People”. It was a nationalistic idea which he hoped would inspire and reinvigorate the Chinese to the best of their abilities. It could be summarized in 3 concepts as Nationalism, Democracy, and the People’s Livelihood. To cut a long story short, it did indeed re-invigorate and inspire the Chinese, but it ultimately failed to keep the country together, and worse, it failed to strengthen or change China for the better. The fact remained that Chinese Republicanism in all its inglorious failures, exacerbated a state of rising Provincialism which had first begun during the Late-Qing period, but now skyrocketed in response to the well known weakness of the new Republic. The end result, was a land divided, separated into regionalism during what is known in history today as the Warlord Era (1928–37), with the ruling Kuomintang (KMT) Nationalist Government formed by Sun, only having proper control over the regions highlighted in blue, of which most notably Guangdong Province in the far south (Sun’s home) fell under KMT rule :  Having fought so hard and for so long to not only rid China of Qing backwardness, but also to strengthen the nation in such a way as to ensure its prosperity, it now seemed as though all these past efforts, had all but been wasted and in vain. China, now having truly descended into the dustbin of history entered an age of disunity, and though this was not the first time that Chinese civilization had entered such a chaotic period, the drawbacks of such a period were further exacerbated by an ever increasing population unprecedented in Chinese history, and the resulting chaos which ensured, brought about by the terrors of modern technology. It was also during this time that the ruling Kuomintang Nationalist Party also underwent a split from the inside into two separate rivalling factions, who in the wake of its founder; Dr. Sun Yat-Sen’s death in 1925, had emerged clearly into the spotlight. On one hand, was the Right Wing who now was led by a man who rejected Sun’s efforts to create a Western Democracy. He instead advocated Traditional Chinese Morality, and Cultural Reform. Chiang Kai-shek, formerly a soldier of the Imperial Japanese Army (IJA), took control of the Right Wing of the Kuomintang Nationalist Party. He is pictured below on the left next to China’s founding father:  Meanwhile, coming to life in 1919 from the anti-Imperialist development that was the “May Fourth Movement”, was the Left Wing of the Kuomintang led by the rapidly rising Communists. Initially it only composed of 50 members back in 1921, but in merely 4 years time, had come to dominate the entire Left Wing of the Party, with members in the tens of thousands all across China. A portrait of the young future Chairman Mao in 1927 (though he was still relatively insignificant at this stage, a young idealist by the name of Mao Zedong who had always been interested in Leftist Politics as a child, having experienced the great sufferings of the Chinese people himself, co-founded the Chinese Communist Party (CCP) in 1921):  With neither side having much affection for the other, a Civil War erupted between the two factions with the precipitation of two noteworthy events. The first took place in April 1927, whereby the Kuomintang massacred 15–20,000 Communists altogether in the city of Shanghai, and the province of Wuhan. The second noteworthy precipitant meanwhile came in July, 1927 when the provincial Government of Wuhan, also forcibly expelled the Communists from the Kuomintang. And in response, the Communists not only officially declared their own “Communist Party of China”, as a separate and independent alternative for China’s future, but also formed the “Workers' and Peasants' Red Army of China”, better known in History plainly as the Red Army (not to be confused with the Soviet Red Army). And when that occurred, the all out, and full scale conflict known as the Chinese Civil War (1927–49) was in full swing. Unfortunately for both the KMT and CCP parties however, a force more unimaginably dangerous, and infinitely more powerful than either sides had set its eyes out on the vast Chinese Republic, with the sole intention to conquer it in all its entirety. Long having had the ambition to conquer China even since the times of the Ming Dynasty 300 years prior, the Empire of Japan under the excuse that the KMT’s Nationalist Armies, had fired upon them at the Marco Polo Bridge Incident in 1937, returned to China in the form of a full scale invasion. An artist’s impression of the 100 man strong Nationalist Army rallying together during infamous Marco Polo Bridge incident, faced against the invading 5,000 strong Imperial Japanese Army. All but 4 men perished heroically defending their beloved country from an unjustified Japanese incursion (it was true that the Nationalists had fired upon them, but only after the Japanese were spotted illegally taking over a Chinese Railway Station):  In the aftermath of the Chinese defeat at the Marco Polo Bridge, and the seizing of the former Ming and Qing Imperial Capital of Beijing, the beginning of the 8 year long unofficial, and undeclared “Second Sino-Japanese War” which lasted from 1937 all the way up until the end of World War II (1939–45) in 1945, was now in full swing. Despite China already having suffered so much up until now during their “Century of Humiliation”, only now near the very end of the period, was the heights of Chinese suffering about to occur under the wrath of the Japanese Empire. The Empire, who did not appear to understand the concept of “mercy”, pushed relentlessly down south from Beijing, conquering city after Chinese city, showing not the slightest hint of humanity nor mercy, not to men, not to women, and not even to children, Wherever they went, death was the order of the day. The greatly infamous “Massacre of Nanking” or “Rape of Nanking” was just one of the many events, which perfectly showcased the brutality of the Empire during the Second Chinese-Japanese war. Here is a photo of such a horrific event, depicting the Japanese preparing to bury alive the citizens of Nanking:  In the weeks leading up to the Nanking Massacre, the Japanese having defeated the Republican Army in Shanghai, turned their attention to the former Early Ming Capital. Chiang Kai-Shek, fearing for the full decimation of some of China’s bravest men, ordered the full withdrawal of all official military garrisons at Nanking, virtually leaving the entire city at the mercy of the coming Imperialists. Commanding the citizens of Nanking to fight to the last man, the cowardly Chiang likely knowing the imminent fate which was to soon befall upon the city (as by now the reputation of the brutality of the Japanese had unfortunately become well known), left only a handful of untrained Auxiliary units, to defend the city against a Japanese assault. Many unsurprisingly ignored his orders, and fled the city as soon as they could. The rest, falsely reassured by the “neutral zones” which a small group of Western businessmen had set up, to ensure the safety of the Nanking’s citizens, instead foolishly remained behind. In doing so, they had hoped that the areas (namely private property which belonged to Western nations), could surely never be breached by the Japanese. A Map of the Nanking’s Safety Zone (the area of such a zone was the equivalent of New York’s Central Park, with the ability to house more than half a dozen safety zones):  History would prove them to be so very wrong of course. The Japanese came on December 13, and unintimidated by the so called “safety zones”, the massacres soon followed. In a course of 6 weeks, 300,000 people were killed, leading to the massacres of entire families, all the while even the elderly and mere infants were targeted for systematic execution. A period photograph depicting the imminent beheading of a Chinese Prisoner of War (POW) by an Imperial Soldier:  And it was even worse for women, of which 80,000 were brutally raped by the Imperial Japanese Army. As for the city of Nanking itself, 1/3 of the city’s buildings were either looted or incinerated to the ground. The Rape of Nanking, was so damaging and inhumane in the way in which it was carried out in fact, that the commanding Japanese General “Iwane Matsui” had even condemned the event upon being informed of its existence on December 18th 1937: \"I now realize that we have unknowingly wrought a most grievous effect on this city. When I think of the feelings and sentiments of many of my Chinese friends who have fled from Nanking and of the future of the two countries, I cannot but feel depressed. I am very lonely and can never get in a mood to rejoice about this victory ... I personally feel sorry for the tragedies to the people, but the Army must continue unless China repents. Now, in the winter, the season gives time to reflect. I offer my sympathy, with deep emotion, to a million innocent people.\" A photograph of Japanese General Iwane Matsui entering the City of Nanking:  The Rape of Nanking to make matters worst, was only the first of many such events, in the beginning of a series of great misfortunes for China, in their 8 long war against the Japanese. This was such, that by the end of the war in 1945, according to Forbes contributor Gordon G. Chang the effect on China was one which was indisputably negative: “Between 14 million and 20 million Chinese died in the “war of resistance to the end” against Japan last century. Another 80 million to 100 million became refugees. The conflict destroyed China's great cities, devastated its countryside, ravaged the economy and ended all hopes for a modern, pluralistic society.” And to make matters worse, throughout the entire course of the war, the Japanese had actually actively mocked the entire Chinese Nation, by claiming that in fact, the Chinese should actually be grateful for the entire invasion (and all the death and sufferings which came along with it), because the Japanese were in fact not actually “real” invaders. No, according to their own twisted world view, the Japanese were only here to “free” China from the chains of backwardness, and instead presented the Empire as the Republic’s only hope to fend against Western Imperialism and Soviet Communism. All this was asserted whilst the Japanese also insisted that only a strict adherence to their honourable ways, could bring about a new era of mutual peace, cooperation, and development among all the countries of East Asia. Thus, the Japanese presented themselves in fact as the “good guys”, whilst insisting that the Chinese merely refused to “co-operate”. And thus under the guise of promoting Anti-Western Imperialism, and pan-Asian co-operation, the “Greater Asian Co-Prosperity Sphere” was established. In reality, it was a false justification in favour of the imperialism of the ever expanding Empire of Japan, which now had dominion over all of Asia, and not just China:  Thus it should come as no surprise to anyone then, that the Japanese Invasion was easily, by the far the most embarrassing event of the entire 100 Years of National Humiliation. And that was also saying a lot, since the entire Century was already composed of nothing but death, suffering and misery. The fact that the Second Sino-Japanese War was the very pinnacle of this angsty desolation, was a fact which spoke for itself. In fact, as is evident down from the graph below, the Chinese Republic’s contracted casualties was surpassed only by the Union of Soviet Socialist Republics (1922–91). As is evident, the vast majority of deaths were derived from Civilian casualties and the murder of innocents, rather than that of belonging to the military:  On the other hand, the war brought a swift halt to the ongoing Chinese Civil War, and for a brief time period, the KMT and CCP agreed to a truce as they fought together against the endless hordes of the Japanese, who fanatical in all their splendour, appeared as though they would never stop. Unfortunately, this unity was not only short lived, it was also a purely superficial one, biding time for both sides as they not only fought against the Japanese, but also secretly conspired against each other, with neither side willing to back down without a proper fight first. As such, when the Japanese finally surrendered in 1945 directly as a result of the Atomic Bombings of the United States of America on the cities of Hiroshima and Nagasaki, the Chinese Civil War immediately resumed. Perhaps simultaneously weakened from the victory of their war against the Japanese, and therefore also arrogant to such an overwhelming extent, Chiang Kai-Shek’s Nationalist Kuomintang eventually lost the war against the Chinese Communist Party, in a conflict which claimed 8 million lives and lasted 4 years. But finally, at last after hundreds of years of death, suffering and misery, the current ruling “dynasty”; the People’s Republic of China was finally proclaimed by Mao Zedong on October 1st, 1949, merely 68 years prior to present day:  And at last with the establishment of the most powerful Chinese political entity since the time of the Early Qing Dynasty under the Kangxi Emperor (reigned 1661–1722), the embarrassing stain on China’s 5,000 year History that was the Century of Humiliation, at last ended finally after 110 years of nothing but starvation and desolation.  Chapter V: “Brave New World”: The People’s Republic and the Return of 5,000 Years of Chinese Civilization Of the 400 million people which lived throughout Mao’s New Republic, 50 million were drug addicts. 320 million were illiterate, neither having the capability to read nor write, and the national life expectancy was estimated only at 35 years of life on average. The Chinese Economy was virtually non-existent, and the oppression of women despite laws which had outlawed otherwise, failed to eradicate both polygamy, concubinage, child betrothals, and the barbaric practice of footbinding. Footbinding, was by far the most revealing sign of the traditional status of women in Imperial China (only from the Song Dynasty onwards 1,000 years ago however and not before); as one of total inequality. It was a cruel practice, which had traditionally advocated in favour of forcefully snapping the bones of a woman’s feet, in order to artificially force them to be smaller than what it otherwise would be. An image comparing the sizes of modern footwear, in comparison to that of a footbound shoe, dating from hundreds of years ago during the times of Imperial China:  Unsurprisingly, the practice resulted in lifelong disabilities and ensured that any woman unfortunate enough to fall victim to such a barbaric practice, could never again walk properly for the rest of her life. This was a phenomena which deeply implied the inequality of women, especially as the practice was primarily carried out in order to please the men of Imperial China, who considered the practice to be sexually arousing, who longed to see the “dainty” way in which the women would struggle to walk. An image comparing the physiology of a normal foot on one hand, and that of a bound foot on the other:  As such, faced with such a myriad of problems, including issues which concerned the spheres of Economics, Socio-Politics, and the “Great Rejuvenation of the Chinese Nation”, Mao Zedong, the “First Emperor” of the “Red Dynasty”, went swiftly to work. He was determined to create a modern, industrialized nation which could in time ensure the imminent return of 5,000 years of Chinese civilization, to the centre of the world stage once more, as had long been the case under the Imperial Chinese Han, Tang, Song and Early Ming Dynasties. To this extent, the first reforms to take place thus were Economic, in nature. Mao begun by building en masse throughout China, a great many deal of infrastructure projects, overseeing the construction of Dams and Irrigation wherever it was possible. Though an ultimately devastating event known as the Great Leap Forward (1958–62) did however majorly set China’s Economy back a couple of steps in the wrong direction, Mao ultimately learnt from his mistakes and instead promoted the individualization of farms, greatly incentivizing Agricultural Production, which ultimately acted to strengthen the Chinese Economy. Mao however was an extremely intelligent man, who knew that in order to truly promote change, he had to capture the hearts of the people. As such, whilst the Economic reforms occurred, Mao also greatly attempted to inspire the people to labour through his various distributed posters which encouraged the Chinese Workers in this particular case, to “Produce more! Contribute more!”:  By far the most notable reform which acted to simultaneously decrease illiteracy, whilst promoting Economic growth, was the simplification of the Chinese written language. This particular reform was ultimately successful and thus saw literacy rates at 84% by the time Mao at last finally retired in 1974. Promoting nation-wide the very real need for China to industrialize, in order to prevent what people thought was an imminent second Century of Humiliation, the Chinese people fought and laboured hard such, that their hard work all soon paid off. With the exception of the disaster that was the Great Leap Forward, China’s Economy ultimately recovered, having long been neglected. By the end of the Mao Era, China’s GDP grew at an average annual rate of 6.2%. Steel Production meanwhile rose from 1.4 to 32 million tons, Coal from 66 to 617 million tons, Cement from 3 to 65 million tons, Timber from 11 to 51 million tons, Electricity from 7 to 256 billion KWH, Crude Oil from Nil to 104 million tons; and Chemical Fertilizer from 39,000 kg to 8.7 million tons. A People’s Republic era poster celebrating Mao’s order to Industrialize by any means necessary, in order to protect what was still ultimately a weak and growing nation. The caption reads “We are proud of participating in the founding of our country's Industrialization”:  For all intents and purposes, Mao’s China whilst definitely not a complete success due to the embarrassing existence of poorly implemented events, such as the Great Leap Forward, or the Cultural Revolution (1966–76), was ultimately a success. In such a short time period, Mao had transformed the formerly backward and feudal nation of China, into once more a powerful nation, thus ensuring the return of 5,000 years of Chinese civilization to the centre of the world stage once more. However, even Mao’s many failures such as the Cultural Revolution (which the author of this answer truly with all his heart absolutely hates with a burning, fiery passion), still had many positive effects resultant of the fertile period of great change, promoted by Mao. The skyrocketing equality of women, in an effort to reject the old world, was one such effect. The Cultural Revolution was the catalyst for the decision to finally make women the indisputable equal of their male counterpart, a right which was officially safeguarded in Article 96 of the Constitution of the People’s Republic of China (1954): “Women in the People’s Republic of China enjoy equal rights with men in all spheres of political, economic, cultural, social and family life.” However, it cannot be denied that the Cultural Revolution, though the right thing to do at the time, was perhaps something which should have been toned down a lot more. The obvious major drawback of it, was of course Mao’s refusal to reconcile Maoist China, with its ancient and glorious heritage: the exclusive right to which China owned, passed down from generation to generation for 5,000 years. It was an action, which up until very recently even in the early 21st Century, gave the Chinese people both a huge inferiority complex, and an equally huge identity crisis, one which even in 2017, is only beginning to finally end. The Liberation of Women, the only good facet from the chaos that was the Cultural Revolution. Mao, upon famously declaring that “Women hold up half the Sky” in 1968, ensured that the equality (mostly) of women in the People’s Republic of China would be officially provided for:  Thus by the end of the Mao Era, the great success of People’s Republic of China’s first “Emperor”, could be summarily characterized by: The full unification of China under one centralized Government, which actually held de facto control over the Nation, unlike in the Republican times in which Warlords split the country into multiple warring factionsThe doubling of China’s population to 930 million individualsThe vast dismantling of wealth inequality between the various social classesThe full introduction of electricity even to the furthest, most desolate corners of ChinaThe full restoration, maintenance and upgrading of infrastructure to an appropriate standardThe growing ascension of the GDP of the Chinese Economy by 500%The full elimination of drug (especially Opium) addiction in the Chinese NationThe full provision of basic necessities to all of China, including complete access to basic food, water and shelterAnd perhaps most importantly, the full liberation and education of Chinese womenAt last, after hundreds of years of death and suffering, Chinese civilization returned to the world with a bang, under the wise rule of the People’s Republic of China:  For all intents and purposes, Mao Zedong was essentially a second version of the First Emperor of Imperial China; Shi Huangdi. And the early People’s Republic of China, was essentially the second First Imperial Chinese Dynasty, the Qin Empire. Both brought much needed peace and security to a formerly dying land, and both did much to benefit China, despite making many critical mistakes. Perhaps unhappy however with the efforts of Mao, his famous successor “Deng Xiaoping”, the next “Emperor” of the Red Dynasty still thought (and correctly so) that China would be much better off, if it were to reform itself in the most fundamental and at the time, also radical of ways. Famously proclaiming prior to the great reforms of 1979, that “it does not matter whether a Cat is black or white, as long as it catches Mice”, China’s famous and world renowned Market Capitalist reforms were initiated, transforming China’s Economic System from that of a struggling Planned Command Economy, into a dynamic “Social Market Economy, with Chinese Characteristics” in 1979. And when Deng carried out what he had promised to do, the results were unbelievably wild. China, prospered like it had never before. In all the 5,000 years for which Chinese civilization had been around, never had the Chinese accomplished so much, with so little, in such a small amount of time:  The Chinese coastal areas benefitted the most, as the likes of Tianjin, Beijing and Shanghai all became “Tier 1” Cities, the most internationalized, advanced and prosperous cities in all of China. This was of course a phenomenon which became most obvious with the city of Shanghai, the development gap in the 20 year time period from 1990–2010 which can be seen below:  And as a result, Modern China has successfully done what Qing China failed to do during all throughout the failure that was the Self Strengthening Movement. Instead of being an isolationist country, Contemporary China is reaching out to the world, in recent times creating its own Asian Infrastructure Investment Bank (AIIB) in order to rival that of the United States’ World Bank:  Furthermore, it has also proposed 4 years prior to this day, the re-introduction of the famous Silk Road of Imperial China, back into contemporary China in the form of the “One Road, One Belt” Initiative:  And unlike the Qing which suffered foreign invasion after foreign invasion, the Chinese Nation, today has finally learnt the ultimate lesson: that a strong and capable Military, will of course always be required to halt the expansion of potential imperialists. To this extent, they have been building towards and improving especially in the realm of Naval advances, in comparison to Qing China under the Self Strengthening Movement:  The major milestone in China’s Navy, of course came in as late as April this year, in what was an unprecedented success for the Middle Kingdom’s Military; its first domestically crafted Aircraft Carrier “CV-17 Type 001A Shandong” was first inaugurated, ready to be introduced to China’s rapidly growing Carrier Fleet:  And though it is of course still very much inferior to the “Supercarrier” of the current and only reigning Superpower of the entire world, that is the Superpower of the United States of America…  … the Chinese people, industrious, more powerful and more keen to learn than ever before, have already begun their long journey on the path to greatness, with the plan for 4 more, newer and better Carriers. This will of course all be done in an attempt to at last peacefully even the balance of powers between it and the United States of America, by not only deterring a possible American initiated conflict, but also to thus force Washington back to the “Third Island Chain”, in the long run:  After all, the Chinese still very much so scarred from their experiences derived from the Century of Humiliation (an event in which the United States participated in), are of course not impressed with the following scenario, which serves no purpose other than to make clear to the Chinese of one sure thing: National weakness will be the catalyst for a Second Century of Humiliation:  The return though, of Chinese civilization was not just an exaggeration however. No, in fact far from it, the official Chinese announcement to the world of their return, was conducted all the way back in 2008, a period of merely 9 years ago. Long removed from the world stage, ashamed of who they were; as mere shadows of what their ancestors used to be, all Chinese people knew, upon the raising of that shiny crimson red flag, that China, never again to be so weak once more would suffer through such a humiliating experience ever again. It was the ultimate proof that Chinese Civilization, after a sudden departure from the centre of the world stage was now back again at last, this time here to truly stay. It was a fact which the entire world had once known, then forgotten, and now in Beijing where all Mankind once more willingly flocked to the Middle Kingdom, this time not for war, but for peace (in the Beijing Olympics of 2008), it too also realized the true return of Chinese power. “The Dragon”, long dormant had now at last awoken in this new age of Digitalization, upon the edge of the so called “4th Industrial Revolution”, keen not to miss its chance to stay ahead once and for all of the entire world. It was easily the proudest moment for all Chinese people anywhere in the world, as they realized that China was here to stay, never again would they let it collapse:  In this way, like how the Mao Era resembled the Qin Dynasty of China which unified the entire country, but also at a huge cost, Deng’s Post-Reform Era can in fact also be likened to that of the succeeding Han Dynasty, which stabilized and introduced to the world, Chinese civilization. And likewise, the contemporary People’s Republic of China, is also stabilizing and introducing its great civilization to the entire world once more.  And thus, this was, is and will be for a long time; the History of China for not only 5,000 years of Chinese civilization, but also for thousands upon thousands of untold years to come.  Final Summary and Author’s Personal Message (to tie up any “loose ends” and conclude the answer) This was possibly the most important and longest answer I have ever written in all the two years that I have been on Quora, thus far. For people who do not understand China’s long and proud history, they miss the chance to truly understand the return of China in what is popularly being called “The Chinese Century”. China has returned to power, and now it wants the respect it once had. For thousands of years China was either one of the greatest, or the greatest and most advanced civilization on Earth, then it missed the Industrial Revolution and suffered greatly. And now that it is finally back, now is the time more important than ever before, to understand just what such an old and wise civilization as that of China, so desperately desires. It is simple, respect is all it wants. It does not want those 1 million surrounding US military bases around it, and it does in fact want peace. However, this is truly an impossible task, if all the world does is provoke it at a Government-Government level, or even People-People level (especially on Quora for example). This of course does not justify some of China’s actions which are clearly unfair, but that is beside the point ultimately. The 5,000 year old civilization that is China, and you must understand this, is entirely motivated today because of the Century of Humiliation. Any attempts to bully it, by threatening it with Economic sanctions as Donald Trump has so foolishly done, is in the grand scheme of things, entirely redundant. Try respecting the Chinese for a change, it will make all the difference in the world.  Sources Utilised Throughout My Answer (also for further reading): tributary system | Chinese historyMacartney EmbassyPeace of Westphalia/Treaty of WestphaliaIndustrial Revolution - Facts & Summary - HISTORY.comEffects in the 18th/19th Century - 5 Effects of IndustrializationOpium Wars | Definition, Summary, Facts, & Causes(1850-1864) | Asia for Educators | Columbia UniversityTreaty of Aigun | Sino-Russian relationsThe Self-Strengthening MovementSino-Japanese War | 1894-1895Boxer Rebellion - Facts & Summary - HISTORY.comfamily, childhood, death, school, young, old, information, born, college, marriageThe 1911 Xinhai RevolutionThree Principles of the People - WikipediaChiang Kai-shek - Facts & Summary - HISTORY.comMao Zedong | Biography & FactsThe Chinese Civil WarSECOND SINO-JAPANESE WAR (1937-1945)Nanjing Massacre - Facts & Summary - HISTORY.comGreater East Asia Co-Prosperity Sphere - WikipediaCCP social reformsGreat Leap Forward | Chinese historyCultural Revolution - Facts & Summary - HISTORY.comReform of the Economic System, Beginning in 1979",
            "date": "Updated January 27, 2018",
            "views": "164",
            "upvotes": " View 340 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Xorex",
                    "user_href": "/profile/Xorex"
                },
                {
                    "user_id": "Jorhan Wu",
                    "user_href": "/profile/Jorhan-Wu"
                },
                {
                    "user_id": "Ft Z",
                    "user_href": "/profile/Ft-Z-2"
                },
                {
                    "user_id": "Chen Nan",
                    "user_href": "/profile/Chen-Nan-19"
                },
                {
                    "user_id": "Eugenia Tse",
                    "user_href": "/profile/Eugenia-Tse-2"
                },
                {
                    "user_id": "Ritik Anand",
                    "user_href": "/profile/Ritik-Anand-11"
                },
                {
                    "user_id": "Gordon Chao",
                    "user_href": "/profile/Gordon-Chao-2"
                },
                {
                    "user_id": "Freddie Wu",
                    "user_href": "/profile/Freddie-Wu"
                },
                {
                    "user_id": "Tong Jin",
                    "user_href": "/profile/Tong-Jin-17"
                },
                {
                    "user_id": "Frank Wynn",
                    "user_href": "/profile/Frank-Wynn-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ye",
                "href": "/profile/Nathan-Ye-4"
            },
            "answer_text": "I'm gonna try to be very short  First there were a bunch of nation states who were at constant war. Then one guy conquered them all and born was a country with one leader. His dynasty rules for a couple years, then the empire broke off into nation states which was called the three kingdoms period because of 3 major factions. Eventually one of them one and then it was a full country again. This went on with a new dynasty every three hundred or so years such as tang or song dynasties. Then, ghenghis khan invaded China and rules for 100 ears under the yuan dynasty. Then a couple people started a revolution against the Mongols and then became the Ming dynasty. This is most commonly known as the best time ever in China's history along with the Tang Dynasty. Eventually they were kicked out by the Qing dynasty who were Manchu nomads from the north. They were isolationists and so as the world went on improving technology, China stayed the same. This had disastrous results, China was bullied into many unfair treaties and when we resisted, they came at us with rifles and cannons while we charged them with spears. That is why the wing dynasty is looked as one of the worst dynasties in chinese history. Eventually they fell to the nationalists in the taiping and 1911 revoloution. They had a idea of a nation state based on the values of the US. It was headed by sun Yat Sen who is seen as the forefather of the chinese republic. The republic had good ideals but they were too influenced by secret societies and warlords who still controlled vast amounts of land. At the time, future communist leader Mao Tse Dong was a librarian at a university. He formed the chinese red army in 1927 and started a guerrilla war against the nationalists. Forward to 1937, Japan invaded China and the communists and nationalists united against the Japanese and managed to hold them off for 8 years. After the war, the Chinese army were now equal in terms of manpower. Due to the good leadership of the communists, and the bad leadership of the nationalists, they lost and went to Taiwan and the people's republic of China was declared. Forward a few years, Mao died and deng xiaoping became chairman, he opened the borders and chinese market to foreign investment. That is where China is now ",
            "date": "Answered April 14, 2015",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Verma",
                    "user_href": "/profile/Abhishek-Verma-2589"
                },
                {
                    "user_id": "Giorgio Bassa",
                    "user_href": "/profile/Giorgio-Bassa"
                },
                {
                    "user_id": "Renato J. Rael",
                    "user_href": "/profile/Renato-J-Rael"
                },
                {
                    "user_id": "Xi An Chan",
                    "user_href": "/profile/Xi-An-Chan"
                },
                {
                    "user_id": "Farhana Farooq",
                    "user_href": "/profile/Farhana-Farooq-1"
                },
                {
                    "user_id": "Gary Huang",
                    "user_href": "/profile/Gary-Huang-29"
                },
                {
                    "user_id": "Kongkai Hsu",
                    "user_href": "/profile/Kongkai-Hsu"
                },
                {
                    "user_id": "Aman Bharti",
                    "user_href": "/profile/Aman-Bharti"
                }
            ]
        }
    ]
}