{
    "title": "What is the real reason why President Marcos was ousted? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jun Dalisay",
                "href": "/profile/Jun-Dalisay"
            },
            "answer_text": "Because there was a snap election in Feb 1986. Normally, there wouldn't be any snap elections because the country was in Martial Law from 1972. But Reagan was elected in 1980 and he told Marcos that in order to get more loans, he should scrap Martial Law in 1981 and hold normal elections.I think Reagan's plan was for Marcos to lose and then he will lend to the new President. 1981 Philippine presidential election and referendum - WikipediaBut Marcos ‘won’, and so Reagan stopped lending, leading to the 1983 Crisis.The 1983 Crisis attracted the opportunist Ninoy to come back (why didn't he just come back in 1981 for the election?). This spooked Imelda who had him assassinated, which then triggered mass unrest which then triggered the opposition to lobby for snap elections.Officially (COMELEC), Marcos won that snap election. But unofficially (NAMFREL), Cory won, and so all groups, including the US, got together to remove Marcos. 1986 Philippine presidential election - WikipediaCory was able to borrow money again (as Reagan had hoped) to pay for the borrowings made by Marcos (which Reagan would not have gotten back otherwise). BusinessWorld | A brush with debtThis whole borrowing mess triggered coups, until Ramos came to power who solved the borrowing problem by selling the country through privatization. A President’s legacyIn a nutshell, Marcos was ousted because of money, as unpaid debts. ",
            "date": "Answered March 4, 2020",
            "views": "106",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ROBERTO-DIEZA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alvin Co",
                "href": "/profile/Alvin-Co"
            },
            "answer_text": "If my recollections were correct; Marcos health was declining at that time and Imelda Marcos prefers Fabian Ver as he has been the most loyal to the First Family and its not hard to see Marcos Jr. will takeover afterward but the old Marcos prefers a committee headed by Enrile and other ministers, I think this was an arrangement between Marcos and Enrile before the assassination of Aquino. For Enrile and others appointed as successors by the old man it will be their deaths if Imelda got her way since Imelda likes her enemies perfectly dead then just make a media spin-off that Enrile and company were staging a coup so Enrile made a move ahead of schedule, as Defense Minister at that time he got support within the Philippine Army specifically the ambitious young military officers group called RAM then the Catholic church also intervened and called for the public to help Enrile and barricade Camp Crame and it became Edsa Revolution. ",
            "date": "Answered August 24, 2020",
            "views": "17",
            "upvotes": " Answer requested by Mitch Canaro"
        }
    ]
}