{
    "title": "What are the differences between a flexible and a rigid constitution? - Quora",
    "tags": [
        "Flexible Constitution",
        "Constitutions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Stillman",
                "href": "/profile/Peter-Stillman-3"
            },
            "answer_text": "My answer would be the opposite of Kelleher’s: First, I am not sure what the meaning of ‘flexible’ vs ‘rigid’ is. Is the US constitution ‘rigid’ — or rigid when the Republicans are in a majority on the court? I think not: I think the current ‘conservatives’ are as activist as any Warren court (look at Alioto’s decisions, for instance, or Thomas’s recent majority opinion in the American Express case), and I think that previous ‘rigid’ ‘conservative’ courts were just legislating their economic or other ideas onto the constitution: look at the New Deal cases (at least in my interpretation), or Dred Scot for that matter. Or, to approach the issue in another way, is Plessey v. Fergusson an example of a thankfully rigid constituton at work, and Brown v. Board of Education an example of a flexible constitution? Second, to deal in stereotypes, do you think that the US’s written (and therefore more rigid?) constitution is markedly different from the UK’s unwritten (and therefore more flexible?) constitution? Although the exact definitions of freedoms are different, both support freedom of speech, the press, assembly, religion, the UK may do better on the right to vote, etc. Third, I would think that, however you define rigid and flexible, you would admit that a rigid constitution needs to have flexibility built in (think about how Lincoln won the Civil War) and, conversely, a flexible constitution needs to have rigidity built in (or, as I would prefer to phrase it, needs to have clear principles, so that you know that the constitution supports, e.g., freedom of assembly, but you are willing to have it enforced to a greater or lesser degree — think how limited freedom of assembly is in the US at present [and, if you can’t, think about all the restrictions NYC put on the anti-Iraq War march]). Fourth (although this circles back to the first), I think that an emphasis on constitutions and on asking whether they are rigid or flexible is probably asking the wrong question, or is assuming an essentialist view of what is really a matter of political activity and practice. It is not the constitution’s words or content that matters (so long, of course, as basic principles are articulated) so long as citizens and politicians and judges work to stay within — and to articulate their policies within — the parameters of the constitution. (For example, Nixon was called to account in Watergate not only (I’d say not primarily) because of the words of the constitution but because Republicans in the Senate thought he was acting beyond the rule of law and American constitutional norms.) (When Trump tweets that he can rescind birthright citizenship by executive order, I worry, because he does not seem to want to be constrained by American constitutional rules and practices.) (I also disagree with Kelleher because he seems to suggest only two possibilities — a rigid constitution or an administrative state — but I think that both in theory and in practice there are a variety of possibilities, and because I am not sure that a rigid constitution or an administrative state are necessarily opposites: I do not know why you cannot have an administrative state that is limited by an extensive bill of rights, by legislature, and by judicial decisions.) ",
            "date": "Answered November 12, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Jameson",
                "href": "/profile/Edward-Jameson"
            },
            "answer_text": "Original Question: What is the difference between rigid constitution and flexible constitution? No Original Question Details  These are terms that describe methods of Constitutional interpretation. The term “rigid constitution” would describe what is more commonly known as the Original Intent method of Constitutional interpretation and the term “flexible constitution” would describe what is called the Living Document method of interpretation. The Original Intent method of Constitutional interpretation argues that the intent of the authors matters beyond just the language of the Constitutional provision. Their argument is that these provisions were enacted for very concrete and limited purposes, and that any interpretation of any Constitutional provision not directly anticipated by the Framers is Unconstitutional. The Living Document method of Constitutional interpretation argues that what matters is “getting the sense” of the provisions correct; that the Framers could not have anticipated our modern world, and that the precise language does not matter nearly so much as the underlying principles. Both views are wrong. The proper method of Constitutional interpretation is Original Textualism. What that means is that the Constitution, and indeed all laws, should be interpreted in terms of the meaning of the words and phrases at the time the law or Constitutional provision was adopted¹. Now to many, this may seem indistinguishable from an original intent method of interpretation. But here is an example of the difference. Back in the 1980s and 1990s many jurisdictions in the United States passed laws that created penalty enhancers if a perpetrator “used a gun in the commission of a crime.” Now at the time, it was undoubtedly the case that legislators had in mind such things as robberies, rapes and possibly kidnappings perpetrated with the assistance of a gun. There was a case that came up where a man traded a gun for drugs. Now since purchasing drugs was illegal, and since the gun facilitated the sale, the state subjected him to the penalty enhancer for “using a gun in the commission of a crime.” The Supreme Court ultimately upheld this abuse of the law. It was an abuse of the law, because at the time that law was passed, if you had asked anyone to describe what “use a gun in the commission of a crime” meant, that person would not have answered, “trade it for something that is illegal to buy.” This ultimately was a “living document” and thus incorrect interpretation. Now let’s take an alternative scenario. Suppose a guy walks into a doctor’s office, and he asks the doctor to forge a medical record and let’s the doctor know he is carrying a gun and will use it. Now, legislators might not have envisioned that specific circumstance, but it still fits the elements of “using the gun in the commission of a crime,” because the person who used the gun was using the threat of shooting someone in order to get that person to comply with the wishes of the person carrying the gun. Someone who goes by Original Intent would not permit the penalty enhancer in the doctor’s office case, because that particular situation would not have occurred to the legislators. But the Original Textualist would see that the term “use of a gun in the commission of a crime” fit exactly the meaning of the term at the time the law was passed, even if the situation was one the legislators may not have anticipated. By and large it comes down to this. Both the Original Intent and Living Document schools of interpretation would permit broad favoritism to those who are well connected and can afford expensive legal talent. Original intent interpretations leave huge gaps in our legal structure that the well heeled can exploit. Living document interpretations are fodder for lying liars and their stinking lies, or should I say, those who only want to pay lip service to the law. Original textualist interpretation, on the other hand provides a very robust method of interpretation that is extremely resilient.  ¹ Adoption in this case means the time at which the particular legislative body finalized the language of the bill or the proposed Amendment. This can be important with respect to Amendments that have a very long ratification window, such as the 27th Amendment. ",
            "date": "Answered June 24, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        }
    ]
}