{
    "title": "What is the difference between being smart and being intelligent? - Quora",
    "tags": [
        "Getting Smarter",
        "Self-Improvement Advice",
        "Comparisons",
        "Smart People",
        "Intelligence",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aryan Agarwal",
                "href": "/profile/Aryan-Agarwal-307"
            },
            "answer_text": "geniusWhile there is certainly no one-size-fits-all formula for intellectual brilliance, there are certainly several traits that many gifted people share in common. The following are just a few of those traits that have been proven to be commonly associated with genius. After all, it’s as they say – great minds think alike. 1) Curiosity  It probably doesn’t come as much of a surprise that some of the smartest people on Earth have also been the most curious about the world around them. After all, it takes an incredible amount of inquisitiveness for a child to question why an apple falls from a tree instead of rising up into the skies and being swallowed up by the ether. It would never even occur to most of us to question something as utterly fundamental as that. I mean, can you even imagine that conversation? 2) Social Isolation  At least during the early phases of their lives, most gifted children face a certain degree of social isolation. Contrary to popular belief, this is not because of any inherent social deficiencies in intelligent individuals. While geniuses, like anybody else, may have poor social skills, this is very far from being a universal trait, and as they grow older, most gifted children learn to adjust better with their environment. The chief cause of social isolation among the gifted population, however, is the lack of peers who are on their level intellectually. This leads to a situation where a gifted child cannot find many friends who would be interested in talking about the things that interest them. I mean, how many 12-year-olds would be thrilled about being dragged into a conversation about nuclear fission and the merits of multiparty democracy over a two-party system? Not many, I am sure. And as can be expected, the normal topics of conversation of their peer group would bore a gifted child to no end. This leads to a situation where many gifted children are often more comfortable conversing with people nearly twice their age, than with their own classmates. However, as such children grow up, they must learn to adapt to their environment and develop interests that would allow them to step out of their comfort zone and experience the world to the fullest. 3) Predilection To Addictive Substances  It has been proven time and again through research, gifted individuals ‘search for evolutionary novelty’ – in other words, they seek out new experiences and ideas in order to analyze and understand them. They are more open to new experiences than the average person might be. In some cases, this might lead to a desire to try out the socially ‘forbidden’ experiences and ideas, such as the intake of drugs and other intoxicants. Counter-intuitively, exceptionally intelligent people run a greater risk of becoming junkies than does your average Joe, who would be more cautious in such a situation. A visit to the campus of any of the most prestigious universities in the country would confirm this hypothesis. The best and the brightest are also the most experimental in the narcotics department. 4) Socialism and Liberalism  Expanding on the last point about openness to new ideas, the smartest of us are also the most likely to be socially liberal and politically socialist or communist. This is because, since the beginning of trade-based transactions in human history, markets have always been ruled by what is called the ‘market mechanism’. Capitalism is just how we rolled until Marx came along, with his new ideas about state-controlled economies and classless societies. It made sense, historically, to abide by the prevalent rules of society and not get offed by the kangaroo courts. As such, in their search for novelty, the gifted are more likely to lean towards a more liberal and libertarian worldview, to a greater or lesser extent. 5) Night Owls  The phrase “burning the midnight oil” was taken a little too seriously by our geniuses. Research shows that gifted individuals are more likely to be night-owls than early birds. This leads back to the question of evolutionary novelty. As humans have been creatures of the daylight since time immemorial, the gifted are irresistibly drawn towards the night – simply because it’s the road not taken by most others. Gifted individuals experience a peak in energy levels after dark, and are more likely to be natural insomniacs than the general population. SmartsThere are two types of smarts: street smarts and book smarts. I hope you have both. Street smarts mean you are aware of your surroundings and know how to prepare for and respond to various types of adversity. You won’t invite trouble and you’ll know how to handle it if it does come your way. Book smarts mean you’re studious and good at school. You pass tests with good grades. You can spout off facts, handle math and science, and make references to art and literature. People who are good at trivia are considered smart. Both of these are good to have in your arsenal but if I could only have one, I’d have street smarts. At least I’d know how to minimize my chances of getting my ass kicked, and if it did get kicked, I’d know how to probably stop it from happening again. Street smarts mean you probably won’t let pride be an obstacle when opting for practicality so you can care for yourself and your loved ones. I see book smarts being celebrated quite a bit, but it’s more of a status symbol and not so useful in daily life. There’s confusion about how the smart kids in school, and the college-educated (the higher ranked the school, the better), will make all the money and have the best lives. That’s actually not logical. Yes, some of these people will have good lives, but it’s in no way a given that because you’re book smart, you’ll do well in life. If you go to an Ivy League or similar school, you will have a chance at being part of the elite network that runs the world. And that will mean you’re set (for a certain type of life). But education and college in themselves won’t save you from anything. Your life will still involve suffering. It will still ask you to make deals that make you uncomfortable. You will need grit, backbone, and courage to navigate it all. They don’t teach you that in school. It’s not part of the curriculum. Thank You For Reading My Answer:- ",
            "date": "Answered March 3, 2020",
            "views": "39",
            "upvotes": " View 76 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pallavi Oraon",
                    "user_href": "/profile/Pallavi-Oraon-2"
                },
                {
                    "user_id": "Ethan Spencer",
                    "user_href": "/profile/Ethan-Spencer-15"
                },
                {
                    "user_id": "Kevin Mubanga",
                    "user_href": "/profile/Kevin-Mubanga-2"
                },
                {
                    "user_id": "Jackson Lasance",
                    "user_href": "/profile/Jackson-Lasance"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Niharika",
                    "user_href": "/profile/Niharika-317"
                },
                {
                    "user_id": "Lena-Marie",
                    "user_href": "/profile/Lena-Marie-124"
                },
                {
                    "user_id": "Jonathan Fenile de Castro",
                    "user_href": "/profile/Jonathan-Fenile-de-Castro"
                },
                {
                    "user_id": "Chetan Rajput",
                    "user_href": "/profile/Chetan-Rajput-64"
                },
                {
                    "user_id": "Ravi Patel",
                    "user_href": "/profile/Ravi-Patel-1196"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Gill",
                "href": "/profile/Jay-Gill-30"
            },
            "answer_text": "Intelligence is having a good understanding or a high mental capacity; quick to comprehend. Intelligence can be displayed or characterized by quickness of understanding, sound thought, or good judgment: Once there was a person who was roaming around in some place and saw a big septic tank. Septic tanks are used to store human waste, feces etc. He was just looking inside the septic tank, out of curiosity and fell into the septic tank. Inside the tank, he got really scared and perturbed with the smell etc. He, all of a sudden started yelling fire, fire, fire. Someone passing by heard the word fire and immediately called the fire brigade. The fire brigade came and they started looking for fire the man inside the septic tank was still shouting fire, fire. They saw him and rescued him from the septic tank. The fire crew officer asked him, why you were shouting fire when there is no fire. Then the man who just got rescued by fire crew said very intelligently “ sir if I was shouting shit shit would you come? :-) So this person displayed a quick understanding of the situation and by using good judgment he decided to shout a word fire. A completely irrelevant word for his situation but it worked. When a person is inherently intelligent they can also be smart but ONLY a smart person may not be very intelligent by nature. Because smartness comes from the situation or circumstances they are facing. Like people come with various ways to save taxes. Slowly they become smart at saving money legally or not so legal but if they do not have the circumstances of the heavy tax burden they will never come up with these tricks. So smartness is mainly situation/circumstances dependent but intelligence can be inherent trait like in the above example this person is not going to fall into the septic tank, again and again, to come up with a quick wit to rescue himself. That is why the word street smart was coined. People get into some routine bad circumstances and they come up with smart ideas to overcome it by trial and error method and eventually becomes smart. Intelligence is having the faculty of reasoning and understanding too. Once there was a professor who was very intelligent and wise. In photography department, one student stole the very expensive camera. the head of the dept. felt very bad and sent the circular that we will punish & rusticate the student who has stolen the camera. But the professor announced in his class, that whoever has taken the camera ( please see the word choice taken not stolen) please put it back into my car in the next 3 hours. And the camera was returned within 1/2 hour. One student out of momentary weakness took it out but was feeling very guilty already and with Dept head’s circular, he was not able to gather the courage to return the camera. But when professor announced in a very polite way he instantly returned the camera. One professor’s faculty of reasoning and understanding with intelligence saved one student’s life and his future.Not only he covered up the student’s momentarily weakness he also did not disclose his identity. You can see now, there is a difference in being smart and being intelligent. Most likely intelligent people will have higher EQ and smart people may be having good IQ. It is very rare to see a person with higher IQ and EQ at the same time. ",
            "date": "Answered August 1, 2017",
            "views": "338",
            "upvotes": " View 99 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dilip Chavan",
                    "user_href": "/profile/Dilip-Chavan-5"
                },
                {
                    "user_id": "Ethan Spencer",
                    "user_href": "/profile/Ethan-Spencer-15"
                },
                {
                    "user_id": "Jatin Yadav",
                    "user_href": "/profile/Jatin-Yadav-276"
                },
                {
                    "user_id": "Darlene Quandt",
                    "user_href": "/profile/Darlene-Quandt-1"
                },
                {
                    "user_id": "Bhakti Hemdev",
                    "user_href": "/profile/Bhakti-Hemdev-1"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Eric Mwakulila",
                    "user_href": "/profile/Eric-Mwakulila"
                },
                {
                    "user_id": "Imli YD",
                    "user_href": "/profile/Imli-YD"
                },
                {
                    "user_id": "Stephanie Tsoungui",
                    "user_href": "/profile/Stephanie-Tsoungui"
                },
                {
                    "user_id": "B Kumar",
                    "user_href": "/profile/B-Kumar-187"
                }
            ]
        }
    ]
}