{
    "title": "What are the five greatest performances in the history of cinema? - Quora",
    "tags": [
        "History of Film",
        "Cinema of India",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saad Aziz",
                "href": "/profile/Saad-Aziz-7"
            },
            "answer_text": "To hell with the obvious and the most famous perfomnces These are the greatest i can think of as i read your question Jack O'Connell in Starred up You will literally want to run a mile as the movie ends  Jude law in Dom Hemingway Never i mean never will you come across a beast like him  James McAvoy in Filth Adrenalin Adrenalin Adrenalin  Kay Kay Menon as Luke in Paanch The evil scum Luke but you will still root for the guy  And Tom Hardy in Lawless Not a lot of dialogues but even the way he Stands will be goals  Brad Pitt in Legend of the Falls and in A River runs through it ",
            "date": "Answered July 18, 2016",
            "views": "393",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nadi M Dixit",
                "href": "/profile/Nadi-M-Dixit"
            },
            "answer_text": "George C Scott in PattonGregory Peck in To Kill a MockingbirdMarlon Brando in GodfatherDaniel Day Lewis in There Will be BloodRussel Crowe in A Beautiful MindAudrey Hepburn in The Roman HolidayMark Rylance in Bridge of SpiesHeath Ledger in The Dark Knight,Anthony Hopkins in The Silence of the Lambs.Asked for five, have more, I know but I am sure that there are more who deserve to be on this list, these are those that came to my mind at the moment. ",
            "date": "Updated October 11, 2016",
            "views": "446",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriel Tiller",
                    "user_href": "/profile/Gabriel-Tiller"
                },
                {
                    "user_id": "Penelope Gianelli",
                    "user_href": "/profile/Penelope-Gianelli"
                },
                {
                    "user_id": "Jithu Anirudhan",
                    "user_href": "/profile/Jithu-Anirudhan"
                },
                {
                    "user_id": "P K Geetha",
                    "user_href": "/profile/P-K-Geetha"
                },
                {
                    "user_id": "Arun Sathyan",
                    "user_href": "/profile/Arun-Sathyan-1"
                },
                {
                    "user_id": "Manas Sharma",
                    "user_href": "/profile/Manas-Sharma-33"
                }
            ]
        }
    ]
}