{
    "title": "What is happening with Azerbaijan and Armenia? - Quora",
    "tags": [
        "Azerbaijan (country)",
        "Armenia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Bittlingmayer",
                "href": "/profile/Adam-Bittlingmayer"
            },
            "answer_text": "If you know the Kosovo situation, the Nagorno-Karabakh situation will sound familiar. There was violence and a war from 1988 to 1994, where the Republic of Nagorno-Karabakh, backed by Armenia, voted for, declared and achieved de facto but not de jure independence from Azerbaijan.  30000 Azeris and Armenians died, almost a million become refugees. See: When did Nagorno-Karabakh become part of Azerbaijan? Is Azerbaijan right in claiming it? 1994 - Ceasefire and Armament A ceasefire was declared, but Azerbaijan was not content.  Nagorno-Karabakh troops and Armenian troops are on its territory.  Azerbaijan is also on Nagorno-Karabakh territory and small bits of Armenian territory. Azerbaijan continued threatening to attack, and buying weapons with oil money.  2015 - Falling Oil Prices, Threats from Azerbaijan In early 2015, the New York times reported: Mr. Aliyev warned darkly that Azerbaijan, which has an economy seven times larger than Armenia’s, planned this year to spend more than double Armenia’s entire annual budget of $2.7 billion on strengthening its military. In August: “The time has come,” Azeri Defense Minister Zakir Hasanov said while visiting troops near the Nagorno-Karabakh conflict zone, according to a statement on the ministry website on Thursday. “Our people have run out of patience and demand that we take action to drive the enemy out of our lands.” Most analysts note that falling oil prices created pressure against the regime of Ilham Aliyev, the hereditary dictator of Azerbaijan. 2016 - Attack on Nagorno-Karabakh In April, Azerbaijan attacked the Republic of Nagorno-Karabakh, which is backed by Armenia. See: What caused the recent re-escalation of the Nagorno Karabakh conflict? From The Washington Post: Here are the 5 things you need to know about the deadly fighting in Nagorno Karabakh:  ",
            "date": "Updated April 10, 2016",
            "views": "13",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Rahali",
                    "user_href": "/profile/Adam-Rahali"
                },
                {
                    "user_id": "Arian Tari",
                    "user_href": "/profile/Arian-Tari-1"
                },
                {
                    "user_id": "Sana Khoury",
                    "user_href": "/profile/Sana-Khoury"
                },
                {
                    "user_id": "Anahit Ararat",
                    "user_href": "/profile/Anahit-Ararat"
                },
                {
                    "user_id": "Akshat",
                    "user_href": "/profile/Akshat-124"
                },
                {
                    "user_id": "Mikayel Nshanyan",
                    "user_href": "/profile/Mikayel-Nshanyan"
                },
                {
                    "user_id": "Paul Huth",
                    "user_href": "/profile/Paul-Huth"
                },
                {
                    "user_id": "Nur Taufik Dian",
                    "user_href": "/profile/Nur-Taufik-Dian"
                },
                {
                    "user_id": "Kewan Shirazi",
                    "user_href": "/profile/Kewan-Shirazi"
                },
                {
                    "user_id": "Laurence Kueffer",
                    "user_href": "/profile/Laurence-Kueffer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Stewart",
                "href": "/profile/Ann-Stewart-116"
            },
            "answer_text": "Armenia: a country situated in the South Caucasus region. The history of Armenia dates back to 4000 B.C. There are thousands of records claiming that Armenians lived in this region and had their kingdom. Artsakh: a country situated in the South Caucasus region near Armenia. 99% of the residents of the Artsakh Republic are Armenians. In 1920 the Soviet Republic decided to gift this land to Azerbaijan, to stabilize the relationships with Turkey with its head Mustafa Ataturk. Azerbaijan: a country established in 1918. What is happening now: Azerbaijan, together with Turkey, and massive involvement of foreign mercenaries transferred from the Middle East, started large-scale military hostilities against the Republic of Artsakh on September 27 and continues them till this moment, The cities of Stepanakert and Martakert are attacked with the use of long-range missiles and the involvement of the air force. The deliberate targeting of the civilian population and infrastructure of Artsakh by the military-political leadership of Azerbaijan is a gross violation of the international humanitarian law and the latter will bear full responsibility for this war crime. Moreover, Azerbaijan not only attacks the Artsakh Republic but also the city of Vardenis with its near villages in Armenia. ",
            "date": "Answered October 4, 2020",
            "views": "120",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Santosh Chaudhari",
                    "user_href": "/profile/Santosh-Chaudhari-29"
                }
            ]
        }
    ]
}