{
    "title": "What is your 20-year gap photo? - Quora",
    "tags": [
        "Personal Photos",
        "1980s",
        "Gap Years",
        "Digital Photography",
        "20s (age)",
        "Photographs",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Hamilton",
                "href": "/profile/Elizabeth-Hamilton-8"
            },
            "answer_text": "Here I am, in high school, way too cool for the Chinese buffet my grandparents took me to.  Boy was that the late ‘90s. Check out the choker, the dark glossy lips, the gelled hair, the tribal tattoo tee, and above all, the teeny-weeny glasses. Things were better at that time than they’d ever been before, because I was on Paxil and because the reason I was on Paxil had moved out permanently and I would never have another interaction with him again. I was learning that I wasn't going to get punished just for living; I was learning not to jump at shadows. I was lonely, though. I didn’t attend the only high school in the county, and the other homeschoolers in our small town were . . . the weird kind. Not good weird, either. I was disliked at our church, because my parents were divorced and because we were poor and because I asked annoying questions. Also, they hated the way I dressed, and I leaned in to my natural inclination toward the dramatic and macabre, cobbling together goth getups from what I could find at Goody’s Family Clothing and the makeup aisle at Eckerd Drugs. You could tell to look at me that I didn't belong in that community. Rachel Held Evans, two years older than myself, was liked by all; she had two devoted parents and asked reasonable questions and dressed like a normal human being. She wouldn’t start to annoy the church until after this photo was taken. Things would go on getting better, much, much, better after that. I’d go off the Paxil and never need it again. I’d move far away to a city made of concrete with a smoggy sky overhead, and have a six-year stint at a reputable architectural firm, working as a designer on Department of State projects. I’d timidly show up at a new church, in black lipstick and chains and an ultra-short lacy skirt, and be immediately, scandalously assigned a female deacon who asked where I bought the skirt. My mom would send me clippings from the local newspaper, which published cute commentary from Rachel on small-town life. Eventually Rachel would get a book deal and start appearing at conferences and engaging in the national conversation between post-evangelicals and the frustrated, outraged last relics of the Moral Majority. In the DC metro, I’d make good friends, I’d sit through a lot of lunch meetings in uncomfortably warm blazers, I’d discard the miserable, pinched religion of my childhood, I'd watch with great amusement as Rachel and John Piper tweeted disdainfully at each other, and I’d start to believe that life is a good thing and that love is a real thing and that God isn’t opposed to either of those notions. I’d return to Tennessee, bringing a curly-haired child with me, and I’d make new friends. I’d buy a house near the river, in a city where the sky is clear and there are green things growing everywhere, and I’d plant a garden that would immediately get hilariously out of control. I’d read my favorite stories to my curly-headed child, and go hiking in the mountains, and I’d make myself a headpiece to wear to a comedy horror show.  Guys, life is good, when it’s not horrible. Life is short, and precious. There’s nothing like becoming a parent to kick in the ol’ mortality awareness. Rachel left two kids behind when she died suddenly of a reaction to a routine antibiotic, just a few weeks after a young mom treasured by my community was killed by a distracted driver. When I took this photo, I was still waking up crying some mornings, shaking with grief at the loss of a friend, and at the knowledge of a little boy without his mother, and at the cosmic insult of Rachel's death coming so close on the heels of that first blow, and at the much-too-close awareness that my family, my motherhood, is fragile. I recently emailed my college theology professor, telling him, I arrived at Marymount believing I didn't have value--another relic of the Reformed upbringing, and especially of growing up a girl in a community that believed girls were created to make life easier for boys. You, and Dr. Meden, and my pastor up the road at Memorial Baptist pulled me out of that belief. The three of you took my questions seriously, treated me like a colleague-in-training, and generally showed joy instead of contempt when discussing the human species. I'd never seen anybody behave that way before, and seeing all three of you model good will at the same time smashed my old hermeneutic and handed me a new one. From Dr. Meden I learned that it was okay to strive to do the work that I cared about, and to prioritize the weakest and most unnoticed people who'd be interacting with my work; from Dr. Smith at Memorial I learned that a trustworthy leader doesn't see humility as weakness or cruelty as strength, and readily admits to having gaps in their knowledge and expertise; from you I learned that, when trying to suss out God on Earth, the quality of love is a pretty good indicator. What lessons for our time. 2020 has brought a pandemic, the resurgence of bald-faced white supremacy previously unseen by my generation, and a presidential campaign hinged on national policy and personal behavior that sets a man against his father, a daughter against her mother, and a daughter-in-law against her mother-in-law. The preachers that Rachel battled with have desperately proclaimed their traditional values while their congregations turn away from Paul and Ronald Reagan toward Joe Arpaio and Laura Ingraham, watching in dismay as the antagonism their communities directed at divorced women, gay couples, and Muslims transfers smoothly to Democratic neighbors and to Black and Hispanic Americans. The sort of people who disliked me when I was a teenager look at me now and see one of their own, and no amount of morbid makeup or threatening costuming affects that, because people are looking to draw their ingroup lines around identities of whiteness and of native English speakers as the community diversifies. The religious landscape that I grew up in has been plowed under. I worship in a community that often concludes its services with the admonition to remember that the world is now too dangerous for anything but truth, and too small for anything but love. The world has changed around me, but I’ve changed, too. Compared to 20 years ago, I’m confident, I’m overwhelmingly grateful, I’m thrilled, I’m unstoppable, I’m terrified.  ",
            "date": "Answered June 29, 2020",
            "views": "331",
            "upvotes": " View 230 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sejal P",
                    "user_href": "/profile/Sejal-P-9"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "M. Zain Gohar",
                    "user_href": "/profile/M-Zain-Gohar"
                },
                {
                    "user_id": "Kalani Wilson",
                    "user_href": "/profile/Kalani-Wilson-1"
                },
                {
                    "user_id": "Will Sindberg",
                    "user_href": "/profile/Will-Sindberg"
                },
                {
                    "user_id": "Abraboina Rishikesh",
                    "user_href": "/profile/Abraboina-Rishikesh"
                },
                {
                    "user_id": "Andrew Ao",
                    "user_href": "/profile/Andrew-Ao"
                },
                {
                    "user_id": "Mary Katherine Keller",
                    "user_href": "/profile/Mary-Katherine-Keller"
                },
                {
                    "user_id": "Ali Bossmann",
                    "user_href": "/profile/Ali-Bossmann"
                },
                {
                    "user_id": "Elle Acheé",
                    "user_href": "/profile/Elle-Acheé"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavleen Smoot",
                "href": "/profile/Bhavleen-Smoot"
            },
            "answer_text": "I’ll start with one of me when I was 5 yrs old, I was a happy kid, often running around, getting into mischief- my father was a bit on the strict side so I was well mannered and did not get into trouble due to the fear of punishment.  Here is one of me in high school:  The photo above was one of me experiencing culture shock of being in a foreign country on your own, trying my best to do as well as possible and trying to “fit in” with the societal expectation. I was not doing well in math, just barely passed my pre-calculus class and trying to understand why the writing course was so difficult- I would get a ‘C’ for my Literature class. I was coming from a country which taught most of the courses in Bahasa (I was in a public school in Malaysia before I went to America). I felt socially isolated and did not feel I could connect with anyone. I used to hide in my room often, and not eat dinners and gave the excuse that I was studying. I was anorexic, and bulimic- the residential parent of the building I was living in recognised that I was showing signs of isolation and reported it to the school psychologist. The school psychologist invited me into her office to talk about anorexia and bulimia and how badly it could affect my body, I denied that I was anorexic or bulimic. She placed a packet of scientific studies on the detrimental effect on my GI tract, my throat (changes in the cellular structure which could lead to cancer) and the overall effect on my bones in the long term in my hole peg. I found it and read them. I slowly recovered by being more involved in sports, I enrolled in the JV basketball team, I played basketball on my own when I was lonely and it cured my loneliness and because I was surrounded by other teammates when we practiced together- I bonded with other girls and was less likely to fall back to my social withdrawal. My grades were affected and I was not a straight A student- this resulted in me having a very low self esteem and believing that I was never good enough to have a good profession. It was one of the most difficult periods of my life, where understanding everything around me and blaming myself for all my inadequacies. A few teachers reached out to me to help me overcome my psychological problems and helped with my depression. I met some exceptional professors when I was doing my undergraduate degree that encouraged some positive values within me. They saw how much time I invested in my courses, how I spent my summers doing research and learning. Most of my experiences which I invested in (research) and fellowships taught me that most things in life required “doing” and cannot be learned in books. Working in various industries taught me that communication is key and using the right vocabulary, at the right time with the right people can prevent conflict. I learned to work with people of different personalities and is a skill I will continually use throughout my life. This is one of the both of us:  Between then and now: I graduated with a Bachelors in Neuro-PsychologyI went to grad school (as a visiting scholar) and did research with some exceptional professors (in Massachusetts)- decided that a PhD was not something I wanted to pursue.Still in the process of getting my physiotherapy degree (in Australia).Moved 11 times: through 3 countries (Malaysia, United States, Australia) and through 4 states (California, New York, Massachusetts, Hawaii) through 3 islands (Big Island: Hawaii, Oahu: Hawaii, Australia: currently)Found my best friend and got married in city hall (celebrating our 7th anniversary in a few weeks).Started and left countless jobs in various industries (banking, security, hospitality, data analysis), was working 3 jobs at a time to make ends meet (social work, data analysis and hospitality)- learned a lot from each industry and it has helped me tremendously. I am maintaining a work and study schedule as it is the only way I can afford to stay and get my degree.Was in an abusive relationship (someone was controlling me and I was left feeling hopeless often) and managed to leave and survive.Was homeless and experienced extreme poverty and in extreme weather conditions.Started writing on Quora and started a youtube channel.Wrote 2 poetry books- and started a poetry IG account.Became extremely fit and started doing monkey bar workouts when I was in Hawaii.Overcame my fear of swimming, and swam in the great blue sea daily when I was in Hawaii and still maintains 20 laps every week or twice a week (in a pool).Owned a company, and closed it due to moving but remained in contact with many clients of whom I served and cherished greatly.Started doing research in a field I am invested in currently (Physiotherapy) in Australia in two specific specialities.Was hit by a car as I was biking to campus, almost got run over by a 16 wheeler during the dead of winter in Cambridge, also was slammed in the face by a door as I was biking in Brooklyn- had a fracture on the first one, the second one resulted in my bicycle turning into mush but I jumped out in time and the third I had minor injuries.Still do not have a driver’s licence and still use a bicycle as my mode of primary transportation- which meant I biked in the snow during the winters in Boston and still bike during the winters here.Still do not earn enough to have proper heating in our home, which means I usually get home very late to do essentials- eat dinner, and jump into a sleeping bag and jump up and onto my bike as soon as I am awake.Started fasting to provide emotional support to my best friend due to his chronic health condition, and has taught me the value of food.I have learned that: You will lose often, but what matters is how you get up after being destroyed and starting again. Failing is just a necessity for you to learn what is needed so that you can perfect yourself.Every criticism can be used to your advantage. Learn not only from your parents, but from everyone around you. Learn to be kind to everyone, as everyone is fighting a battle you do not know of, each individual are in their own life experience, suffering in their own way (do not undermine their pain and suffering). Learn to empathise and listen.To write down my feelings and monitoring how I felt and what I can do to change that (my happiness and safety is important). I cannot help others if I am hurt and unhappy.To let go of societal expectations and do what I believe to be right, within me, and to stand by my decisions despite the outcomes.To be grateful for the life that was bestowed to me, to be grateful that I have a life, that I have a body that functions well, and a wonderful best friend.Owning up to my shortcomings and mistakes and to try better the next time around.Taking ownership for the decisions I make (daily) the small and the large ones.Setting up a good sleep, exercise and mindfulness schedule.Having a journal to schedule my requirements and appointments and to DO things that I wrote down that I wouldUsing a timer saves me from being distracted- to schedule work and restMy happiness depends on what I do today, no one can read my mind and what helps me (hence I take full responsibility for my actions and my happiness)Scheduling breaks is necessary for my happiness and productivity, one cannot be efficient when they are constantly on overdrive and are exhausted.People will accuse you, hurt you, use you and destroy you for their own benefit- understand that none of it is in your control and has nothing to do with who you are and everything to do with who THEY are. It would be best to make a note of individuals who are hurting you and distance yourself from them, best to never communicate with them and ask them to lose your number.If you treat others with kindness and respect, most often than not, they will do the same, however, there are horrible individuals out there who do not treat others with the same values (just do your job and move on).I hope you learned something new today, I’d appreciate it if you gave it a thumbs up or share, as it could reach others~ If you’ve come this far, thank you for reading! I believe the Quora Community to be a very caring, kind hearted community~ Feel free to share the post if you believe that you have gained anything from it~ Have a wonderful day! Kindly, BhavleenIG: Login • InstagramYoutube: Artemis Vertex ",
            "date": "Updated July 15, 2020",
            "views": "192",
            "upvotes": " View 156 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Solis",
                    "user_href": "/profile/Andrew-Solis-18"
                },
                {
                    "user_id": "Sejal P",
                    "user_href": "/profile/Sejal-P-9"
                },
                {
                    "user_id": "Phoebe Rueda",
                    "user_href": "/profile/Phoebe-Rueda"
                },
                {
                    "user_id": "Deepayan Paul",
                    "user_href": "/profile/Deepayan-Paul-1"
                },
                {
                    "user_id": "Brittanie Tyson",
                    "user_href": "/profile/Brittanie-Tyson"
                },
                {
                    "user_id": "Amy Chase",
                    "user_href": "/profile/Amy-Chase-6"
                },
                {
                    "user_id": "Karess McGrath",
                    "user_href": "/profile/Karess-McGrath-1"
                },
                {
                    "user_id": "Becci Winkler",
                    "user_href": "/profile/Becci-Winkler"
                },
                {
                    "user_id": "Marc von Brockdorff",
                    "user_href": "/profile/Marc-von-Brockdorff"
                },
                {
                    "user_id": "Kathy Terwilliger",
                    "user_href": "/profile/Kathy-Terwilliger-1"
                }
            ]
        }
    ]
}