{
    "title": "What is the difference between concentration camps and death camps? Were concentration camps ever used to detain Nazi POWs? - Quora",
    "tags": [
        "British WWII History",
        "Auschwitz-Birkenau Concentration Camp",
        "POW/MIA",
        "Concentration Camps",
        "The Holocaust",
        "Adolf Hitler",
        "Nazi Germany",
        "Republican Party (US politics)",
        "Democratic Party (US politics)",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Jones",
                "href": "/profile/Mike-Jones-169"
            },
            "answer_text": "Let’s break this down, shall we? “Concentration camps” have existed in many places and times other than Nazi Germany; the US has used them against Native American populations, such as the Cherokee before they were forcibly relocated to Oklahoma in the Trail of Tears. But this question is clearly asking in the context of Nazi Germany. So let’s consider that. The first concentration camps (Konzentrationslager in German) were opened in 1933. They were initially used to imprison German Communists, Socialists, Roma, Jehovah’s Witnesses and various other people labeled as “deviants”. Notice anyone missing? Yes, Jews weren’t included at first. After only a couple of years, though, Jews, Soviet POWs, various clergy who didn’t support the Nazis, Serbs, and disabled people were also being sent to the camps. Some of the Jews had come to Germany as refugees fleeing pogroms in Eastern Europe, and were labeled as “invaders” and “diseased” to build public support for sending them to the camps. Forced labor was common in the camps, and there was a broad disregard for human life there, but the purpose of the camps was to segregate (“concentrate”) “undesirables” and get work from them, not to kill them. It was a common practice to separate children from families in the concentration camps. There were over two dozen main concentration camps and a number of smaller ones. In 1941, the Nazis opened the first extermination camps. These were built expressly for the purpose of killing large numbers of people. There was a different word for these camps: Vernichtungslager. There were a relatively small number of these camps, some built as part of existing concentration camps (such as Auschwitz). Most were built in Poland, both because it had the largest Jewish population in Europe and to keep it out of sight of German civilians. Auschwitz-Birkenau (also known as Auschwitz II), Treblinka, Belzec, Chelmno, Sobibor, Majdanek, Maly Trostinets, and Sajmiste were responsible for the deaths of over 3 million people in 1940–45. All were in Poland except the last two, which were in Belarus and Serbia respectively. Auschwitz-Birkenau and Treblinka were responsible for nearly 2/3 of the total. I do not know if any of the concentration camps were used in areas occupied by the Allies to hold Nazi POWs. ",
            "date": "Answered June 20, 2019",
            "views": "904",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dirk Patze",
                    "user_href": "/profile/Dirk-Patze"
                },
                {
                    "user_id": "Lucia R. Hicks",
                    "user_href": "/profile/Lucia-R-Hicks"
                },
                {
                    "user_id": "Tim Chiswell",
                    "user_href": "/profile/Tim-Chiswell"
                },
                {
                    "user_id": "Scott Brickner",
                    "user_href": "/profile/Scott-Brickner"
                },
                {
                    "user_id": "Andrew Wheeler",
                    "user_href": "/profile/Andrew-Wheeler-27"
                },
                {
                    "user_id": "Adam Serafini",
                    "user_href": "/profile/Adam-Serafini-4"
                },
                {
                    "user_id": "Gregory A. Swarthout",
                    "user_href": "/profile/Gregory-A-Swarthout"
                },
                {
                    "user_id": "Colin Yao",
                    "user_href": "/profile/Colin-Yao-7"
                },
                {
                    "user_id": "Kihiro Tanakamaru",
                    "user_href": "/profile/Kihiro-Tanakamaru"
                },
                {
                    "user_id": "Mark McCoy",
                    "user_href": "/profile/Mark-McCoy-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Pagano",
                "href": "/profile/Richard-Pagano"
            },
            "answer_text": "I recently viewed a documentary about Americans captured at the beginning of the Battle of the Bulge. The Germans sought those prisoners who were Jewish. Evidently their dog tags had an “H” on it. “H” for Hebrew. The Germans found about eighty Jewish prisoners. However they identified others who looked Jewish or were troublemakers. Eventually over 350 men were sent to Camp Banka (not sure of the spelling). These POW’s were treated like concentration inmates and were used as slave laborers in the mines, given starvation rations and deprived of medical care. As the Allies approached the camp, the prisoners were force marched to the east. Those who could not keep up were executed. Finally they were liberated by American troops. The commander of the camp eventually was sentenced to life imprisonment but was released after five years. Politics and the “Cold War” trumped the quest for justice. There should be a memorial honoring the the men who died in the camp and on the march. ",
            "date": "Answered June 21, 2019",
            "views": "173",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phillip Bouchard",
                    "user_href": "/profile/Phillip-Bouchard"
                },
                {
                    "user_id": "Arlen Robinson",
                    "user_href": "/profile/Arlen-Robinson-2"
                },
                {
                    "user_id": "Amber Drake",
                    "user_href": "/profile/Amber-Drake-24"
                }
            ]
        }
    ]
}