{
    "title": "What is the best description of the Victorian era? - Quora",
    "tags": [
        "Poetry",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Loura Lawrence",
                "href": "/profile/Loura-Lawrence"
            },
            "answer_text": "Change, disease, extremes, harshness, ingenuity. There was extreme wealth for some, extreme poverty for others. Harsh treatment of the body (for the soul’s sake), including restrictive clothing; harsh treatment of criminals; harsh treatment concerning morals by (often hypocritical) society; harsh treatment (in general) of children by caretakers; harsh treatment of women by men. Part of this was for the preservation of the soul, since life tended to be short. At the same time, it was an era of beautiful art, writing, and music; an era of inventions (trains, cash registers, the Chicago World’s Fair) and infrastructure; an era of science, medicine, and learning. Perhaps rather ironically, it was also an era of disease (but then what era isn’t?). Diseases like typhoid, tuberculosis (called “consumption” then), scarlet fever, and more. Germ theory was just beginning to take root, but it was far from popular. Crowded and dirty cities due to industrialization contributed to the spread of disease, not to mention the many people living in poverty. ",
            "date": "Answered August 15, 2016",
            "views": "31",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Robinson",
                    "user_href": "/profile/Harry-Robinson-86"
                },
                {
                    "user_id": "Em Hira",
                    "user_href": "/profile/Em-Hira"
                },
                {
                    "user_id": "ها جر",
                    "user_href": "/profile/ها-جر-1"
                },
                {
                    "user_id": "Alex Hermanbaus",
                    "user_href": "/profile/Alex-Hermanbaus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alfred Molison",
                "href": "/profile/Alfred-Molison"
            },
            "answer_text": "Dirty, dangerous, shitty. New Orleans, where my dad was from in the 19th century.: Dead mules in the street, drunken sailors wandering the streets. Whores leaning out the windows shouting to get customers. Denge fever, diptheria, typhus, deadly, child killing diseases like chicken pox, whooping cough, mumps and measles. Street gangs running the city from top to bottom. Out and out, unmitigated racism, sexism and discrimination. Outhouses. Washing your body once a week, maybe. Walking almost everywhere because horses, cabs, and even trolleys cost a lot. No minimum wage. Unions are illegal and don't admit black people anyway. No safety regulations. Poisons marked as cures for illness. No restaurant inspections. No phones, no radios, no tv. One advantage: Make your own music and entertainment. ",
            "date": "Answered December 10, 2016",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joanne Garcia",
                    "user_href": "/profile/Joanne-Garcia-3"
                },
                {
                    "user_id": "Tracie Johnson",
                    "user_href": "/profile/Tracie-Johnson-6"
                },
                {
                    "user_id": "Harry Robinson",
                    "user_href": "/profile/Harry-Robinson-86"
                },
                {
                    "user_id": "Isabella Vera",
                    "user_href": "/profile/Isabella-Vera-1"
                },
                {
                    "user_id": "Sumeet",
                    "user_href": "/profile/Sumeet-37"
                }
            ]
        }
    ]
}