{
    "title": "What is it like to live in Paraguay? - Quora",
    "tags": [
        "Visiting and Travel in Paraguay",
        "Paraguay",
        "Living and Traveling",
        "Visiting and Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Lopz",
                "href": "/profile/Alex-Lopz"
            },
            "answer_text": "I guess the answer should be “what is it like living in Paraguay” compared to what? Your expectations will always be colored by your background. I cannot cover every possible aspect, but I will try to mention some topics that can give a more realistic overview than the previous answers. Paraguay is a land of contradictions. Living there can be at times both very challenging and very easy. Challenging because you must face the problems you’d expect in one of the most unequal societies in the world and easy because people are laid-back, friendly, cost of life is relatively low (for European/North American standards), and it is sunny and warm most of the year. However if your income is low, or let’s say you earn the same as the average Paraguayan, you’ll live in constant uncertainty. Having said that, as Paraguay’s socioeconomic (and cultural) inequality has deep historical roots, most regular Paraguayans, those underemployed and earning minimum wage or lower, have learned to accept their fate (although they should frankly rebel peacefully) and try to enjoy their lives as much as they can. That is not a small feat, for such people life can be tough. The government does not provide a safety net as the one you would expect in Western European countries such as France or Germany. The ruling business elite runs the country almost unopposed and takes its cues mostly from the political right wing of the United States. As a result, taxation on corporations is ridiculously low. A considerable amount of revenue for the state comes from taxes such as the VAT, as you would expect from politicians following a very conservative playbook. Hence public services are underfunded and inadequate. Also as expected, the ruling conservative politicians tend to blame the poor for their own predicament and ignore long-standing systemic problems that make social mobility extremely difficult. There is a constant push for “trickle-down economics” and for privatizing everything. The case of privatization is made increasingly as a cure for rampant corruption in many state-run enterprises that tend to be inefficient. However, people who advocate privatization tend to gloss over the fact that state-run enterprises such as the national power company or the post office should operate with the goal of providing a service to every citizen even in the most remote areas of the country as a matter of principle and not on the basis of whether there is a profit to be made, but I digress. The state remains the biggest employer as landing a public servant job is, more often than not, the result of political activism and not based on merit. Many Paraguayans dream of getting a job in public service as they are on average better paid and offer more benefits than those in the private sector. You may also be expected to pay bribes not only in your dealings with public servants of all kinds, but also for almost anything if you are not willing to wait forever for the wheels to turn in your favor. Corruption is rampant and unfortunately part of the Paraguayan way of life. In fact, certain parts of the country, especially those that are scarcely populated and near an international border are effectively run by international organized crime cartels. Even the most expensive private health insurance companies (which are otherwise quite good) will not cover you if you get a so-called catastrophic illness so your only hope within Paraguay in such cases is usually the IPS (unless you are terribly rich). The IPS, the only health insurance scheme that covers catastrophic illnesses is state-run and limits its coverage to premium paying members. For some unfathomable reason, membership is limited to private sector employees and as a result in an attempt to save the lives of family members and friends many pretend to hire them as employees so they can qualify for IPS membership. Unfortunately, due to questionable political decisions the IPS is woefully underfunded and extremely inefficiently managed. Using the fact that IPS membership is limited to the private sector as a reason, some governmental institutions are recently paying for (in some cases high-end) private insurance for their public servants. A move met with harsh criticism and considered as yet another unjustified perk for public servants only. Another option in case of a catastrophic illness is usually to go abroad for treatment either to a private clinic (usually Brazilian) if your income is very high, or to a state-run Argentinian hospital if your income is not that high. If your income is not that high or decisively in the lower end of the spectrum you may face complete financial ruin, and also may have to resort to raffles among friends, charity lunches/dinners and the like to scrap as much cash a possible. Most people live near Asuncion, but away from the city center. Public transport is outsourced to private bus companies that offer substandard service in order to maximize profit. As sprawling is increasingly a problem and Paraguayan urban planning in the Greater Asuncion makes little sense, commuting times to Asuncion, where many companies have their offices, are very long at peak hours. Powerful bus, and trucking lobbies make every attempt to block the implementation of means of transportation other than buses and trucks. There is no railway system neither on the surface nor underground. Street crime, especially mugging done by gun-toting assailants on motorbikes is on the rise. As a result the government has decided to make steps toward militarizing police with the creation of an elite force of heavily armed police on motorbikes that is said to gradually increase in number and to expand their beat. Considering a more community oriented policing does not appear to cross anyone’s mind neither at the decision making level nor in the media. The latter seem to find militarization of the police a brilliant solution to street crime. With the exception of a handful of elite institutions such as the National Technical High School, public education ranks among the poorest in the world. This makes private schools basically the only option for an optimal education, but the range is very wide and quality tends to be a function of how much you can pay. A school offering the usual infrastructure and program of a regular public school in, say, Germany, will cost you a great deal of money. People tend to be very religious and extremely socially conservative as a result. “Asados” (grill parties) are very common and an excellent venue for making new friends and having a good time. Being a vegetarian may be trickier than in other countries, especially outside Asuncion. “Yerba Mate” tea, either cold (terere) or hot (mate), is more popular than coffee. Paraguayans are also enthusiastic drinkers of pop, especially of coke. They can gulp litters and litters of the stuff. Hope this is useful. ",
            "date": "Updated June 21, 2018",
            "views": "62",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcos Rodes",
                    "user_href": "/profile/Marcos-Rodes"
                },
                {
                    "user_id": "Ahmad El-Sheikh",
                    "user_href": "/profile/Ahmad-El-Sheikh-3"
                },
                {
                    "user_id": "Mirela Van Wijngaarde",
                    "user_href": "/profile/Mirela-Van-Wijngaarde"
                },
                {
                    "user_id": "Norma Flores-Allende",
                    "user_href": "/profile/Norma-Flores-Allende"
                },
                {
                    "user_id": "Salim Ammar",
                    "user_href": "/profile/Salim-Ammar-3"
                },
                {
                    "user_id": "Bill Pinder",
                    "user_href": "/profile/Bill-Pinder-1"
                },
                {
                    "user_id": "Michael Jessop",
                    "user_href": "/profile/Michael-Jessop-2"
                },
                {
                    "user_id": "Carlos Schvartzman",
                    "user_href": "/profile/Carlos-Schvartzman"
                },
                {
                    "user_id": "Rodrigo Fernando Locatelli",
                    "user_href": "/profile/Rodrigo-Fernando-Locatelli"
                },
                {
                    "user_id": "Pablo Lu",
                    "user_href": "/profile/Pablo-Lu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diego Galeano",
                "href": "/profile/Diego-Galeano"
            },
            "answer_text": "I've been living in Paraguay most of my life. I love Paraguay for many reasons, but especially the people and the culture. Paraguayans are one the warmest and happiest people I've ever met (I am not saying this because I am Paraguayan, I've been in many countries and I've met many people). According to 2012 Gallup Poll, Paraguay is the happiest country in the world.  What is it that makes people in Paraguay so happy? Is it the fact that they get on balance 2803 hours of sunshine per year, for an average of 7.7 hours per day? Or could it be because the economy is growing at such a fast pace that people are starting to be lifted from poverty? If you’ve ever been to Paraguay and met with her people, you’ll know very quickly that these polls are accurate. Paraguayans are some of the kindest, warmest people on the planet, with a can-do attitude that permeates the rest of its culture. People are not ruled by clocks or deadlines, but live by a casual nature that doesn’t bring as much stress as much of the Western countries endure. Being late for things isn’t only acceptable, it’s the norm! Paraguayans live by what is known to newcomers as “Paraguayan time,” which means, it’s no big deal if things start a little later than they were posted. With plenty of great food, music, and an amazing culture, it’s no wonder that Paraguayans are so happy. They’ve been in one of the world’s best kept secrets: Paraguay is an incredible place to live.@Be Happier. Move to Paraguay?   The people usually would say \"hello, hi, bye\" on the streets, even though they don't know you personally. The fun thing is, for example, you are going to the bus, and the people next to you might just started talking to you as if you were his/her friend, it´s amazing. That's why when I leave home I never feel in a strange place, it´s like you always feel at home with such a culture.  Even though there are high rate of poverty in the country, I can tell you that the poor people are the happiest, they would tell you \"If I have something to eat today, I am happy, thanks God!\". Also, most of the people are very involved in their communities and if you live there you probably may know almost all your neighbours and hang out sometimes.  If you ever go to Paraguay, you might feel this! Enjoy! Hope this may answer a bit your question! ",
            "date": "Answered February 6, 2016",
            "views": "101",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gregg Arius",
                    "user_href": "/profile/Gregg-Arius"
                },
                {
                    "user_id": "Pardeep Kamal Rishi",
                    "user_href": "/profile/Pardeep-Kamal-Rishi-1"
                },
                {
                    "user_id": "Josh Minshew",
                    "user_href": "/profile/Josh-Minshew"
                },
                {
                    "user_id": "Sharon Weiss",
                    "user_href": "/profile/Sharon-Weiss-6"
                },
                {
                    "user_id": "Attis Fdelin",
                    "user_href": "/profile/Attis-Fdelin"
                },
                {
                    "user_id": "Katie Welch",
                    "user_href": "/profile/Katie-Welch-9"
                },
                {
                    "user_id": "Jesper Saakes",
                    "user_href": "/profile/Jesper-Saakes"
                },
                {
                    "user_id": "Jeff Dyke",
                    "user_href": "/profile/Jeff-Dyke-2"
                },
                {
                    "user_id": "Chris Ebbert",
                    "user_href": "/profile/Chris-Ebbert"
                },
                {
                    "user_id": "Tammy Peterson",
                    "user_href": "/profile/Tammy-Peterson-25"
                }
            ]
        }
    ]
}