{
    "title": "What are the best corporate culture example? - Quora",
    "tags": [
        "Startup Culture",
        "Organizational Culture",
        "Corporate Culture",
        "Company Culture",
        "Office and Workplace Culture",
        "Corporations",
        "Management",
        "Culture (social science)",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaushiki Kesarwani",
                "href": "/profile/Kaushiki-Kesarwani"
            },
            "answer_text": "Google London Office   There is actually a list of companies appreciated for their work culture. But something that really distinguishes many other firm to Google is- Google doesn't stops at evolving at any space. Name it and they are there. Just like it's technical space, it is too good for the people who work on these Innovative tasks. They really have different and smart process for intake of employees but once you are there, the rest is settled. It was in one of the magazines in my teens that I came across an article on Google. Google doesn't asks it's employees to be on desks and benches to work. They feel working from comfort zone can bring the most out of a professional. They don't ask it's employees to be Suited Up. They have already created so much of stuff that to Showcase them as Serious Employees with Professional Clothing is just not needed. They are quite ahead in technology even with Pyjamas and sofaa. Infact, the employees are given access to sports and games in their office and once they are tired of all the things, they can work! So work becomes a fun. Because fun was made work. Whatever I am writing is just a small part of their fabulous work culture. To find more you can Google for Google! I am attaching some of the pictures to depict the work culture at Google. Enjoy! Google New York City Office   Google Dublin Office    Google Amsterdam Office     Google Tel Aviv    Some other Google office pictures   Image Source Google ",
            "date": "Answered May 8, 2019",
            "views": "467",
            "upvotes": " View 206 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Faiz Karim",
                    "user_href": "/profile/Faiz-Karim-11"
                },
                {
                    "user_id": "Adil Sheikh",
                    "user_href": "/profile/Adil-Sheikh-102"
                },
                {
                    "user_id": "Manmohan A Hebbar",
                    "user_href": "/profile/Manmohan-A-Hebbar"
                },
                {
                    "user_id": "Laxmi Srinivas",
                    "user_href": "/profile/Laxmi-Srinivas-1"
                },
                {
                    "user_id": "Aditya Mittal",
                    "user_href": "/profile/Aditya-Mittal-88"
                },
                {
                    "user_id": "Siddarth",
                    "user_href": "/profile/Siddarth-52"
                },
                {
                    "user_id": "Rajesh Menon",
                    "user_href": "/profile/Rajesh-Menon-23"
                },
                {
                    "user_id": "Deepak Barde",
                    "user_href": "/profile/Deepak-Barde-5"
                },
                {
                    "user_id": "Hosalikar Siddhant",
                    "user_href": "/profile/Hosalikar-Siddhant"
                },
                {
                    "user_id": "Akhil Koshy",
                    "user_href": "/profile/Akhil-Koshy-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roopali Kurve",
                "href": "/profile/Roopali-Kurve"
            },
            "answer_text": "Hello Prasenjit, I may not be able to give you a specific examples [ and there are many already mentioned in answers]. Best as per me would depend on various factors as per company. However - To answer this in generic terms:- I would first look at -what is the meaning of ‘culture in a company’. My view is - Culture of a company if simply put includes - ‘work’ environment [how people work], - and mission , value system of company [founders] , ethics, what is expected by all, goals /objectives. This would define how the company functions and ‘expects its employees to work’, ‘behaviours’ that are expected and accepted. Thus as per my view example of :- Best culture is where the employees are happy and the environment is such where they get “motivated” to work. By this I mean the culture [best] should be such where the employees wait to get to work, feel appreciated, truly recognised and contribute effectively. The values and ethics of - the company and employee should align ! - For eg:- If an individual is used to an open management then if the management is more formal /traditional - then he/she may feel curbed. Or An individual may feel that Recognising/Rewarding - good work is important.. and if the company does not have that option and has only fixed pay system - then he/she may not feel motivated. HOw recognition is given also matters. Reason this is important:-Building a company - includes increasing productivity and profitability. Happy, motivated - employees means they contribute to great ideas, initiatives and there is increase in productivity which help build company. —→ People you employ are important part of the reason for company success. Thus The culture of the company should be suitable for [match] - the kind of people /talent that company wishes to hire. It is good to look at examples - but ultimately a company has to decide what is the ‘best’ culture it wishes/will create to ensure this. Things to keep in mind for ensuring a good culture- i] Define your values, mission - company culture. ii] Hire employees who fit the work culture. Ask the right questions during interviews -iii]Let each employee know about the values, mission, culture of company. - iv] Be clear on your values/ethics- what is acceptable behaviour by all - v] Give recognition for those who show great examples of following the values/culture - vi] Keep re-enforcing the values you have. - vii] Review the values/culture from time to time to see how it helps in building right environment / getting the right people. - viii] Owner /Management need to Set an example themselves in following the values, culture they have. Wishing you the very best and success ! ",
            "date": "Answered June 16, 2019",
            "views": "151",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Prasenjit Mitra",
                    "user_href": "/profile/Prasenjit-Mitra-8"
                }
            ]
        }
    ]
}