{
    "title": "What is the real situation in the Nagorno-Karabakh conflict? - Quora",
    "tags": [
        "Republic of Artsakh",
        "Artsakh",
        "Nagorno-Karabakh War",
        "Azerbaijan (country)",
        "Armenia",
        "Situations",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Armen Mkrtchyan",
                "href": "/profile/Armen-Mkrtchyan-18"
            },
            "answer_text": "Active military operations in Nagorno-Karabakh continue and their intensity increases due the use of heavy weapons on both sides. The Armenian and Azerbaijani Armed Forces are forced to use means of fire destruction to defeat the enemy’s manpower, the personal and real estate, military equipment. Theoretically Azerbaijan can overcome Armenia in fight for Nagorno-Karabakh, however in practice the situation is not in Baku’s favor. Since the beginning of military operations the Azerbaijani army has lost more than 800 servicemen, 2 thousand are wounded, about 200 Azerbaijani tanks, 7 helicopters, 1 airplane and 70 UAVs are destroyed. Against it the moral spirit of the Azerbaijani military personnel falls, the number of desertions increases. People from command staff of Azerbaijan Armed Forces express their angst at this adventure in which Ankara dragged Baku. While many Azerbaijan soldiers are dying in the conflict Turkey stands aside. Despite the Turkey’s promises, they haven’t support Azerbaijan in deeds. Earlier president Recep Tayyip Erdogan says it will back Azerbaijan with all means necessary. He also was quick to voice support for Azerbaijan, labeling Armenia \"the biggest threat to peace in the region.\" The Turkish leader called on \"the entire world to stand with Azerbaijan in their battle against invasion and cruelty.\" However, Ankara refuses to engage in open confrontation. Prospects of participation of Azerbaijan in the Nagorno-Karabakh conflict remain doubtful. Further military operations will lead only to new senseless losses among the Azerbaijani military. ",
            "date": "Answered October 1, 2020",
            "views": "97",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maitena Tigranyan",
                    "user_href": "/profile/Maitena-Tigranyan"
                },
                {
                    "user_id": "Anna Karenian",
                    "user_href": "/profile/Anna-Karenian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Karenian",
                "href": "/profile/Anna-Karenian"
            },
            "answer_text": "One can follow the situation in Nagorny Karabakh (Artsakh) in the local mass media. Karabakh internet massmedia use .am (Armenian) domain: See, e.g. ArtsakhPress.Am, ArtsakhTert.Am, etc ",
            "date": "Answered October 2, 2020",
            "views": "213",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murad Farhad",
                    "user_href": "/profile/Murad-Farhad"
                },
                {
                    "user_id": "Maitena Tigranyan",
                    "user_href": "/profile/Maitena-Tigranyan"
                },
                {
                    "user_id": "Parthena Tigranyan",
                    "user_href": "/profile/Parthena-Tigranyan"
                },
                {
                    "user_id": "Gregory Davidian",
                    "user_href": "/profile/Gregory-Davidian-1"
                }
            ]
        }
    ]
}