{
    "title": "What are the archaeological sources? - Quora",
    "tags": [
        "Learning About Archaeology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Thomas George",
                "href": "/profile/Ben-Thomas-George-1"
            },
            "answer_text": "Archaeological sources are mainly divided into Artifacts, Ecofacts and Literature. Artifacts are those remains at an archaeological site that are formed due to the human intervention. For example: pottery found at a excavation site. Ecofacts are those remains that are left as a result as result nature. For example: pollen grains and animal remains found at a site. the pollen suggests the environmental conditions of the era to which it belongs. While animal bones help to understand the faunal remains. It also helps to understand what all animal existed, what we hunted for food and what were domesticated by humans. Literature is the beginning of historical era. History is limited to the literature, but archaeology uses the same literature to pin point the exact place to which the literature refers. For example: A. Cunningham uses the travelogues of Yuan Chwang and Fa Hein to find the Buddhist site Taxilla. There are various other sources like coins that comes under numismatics, dendrochronology..etc. ",
            "date": "Answered July 19, 2018",
            "views": "61",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-75"
                },
                {
                    "user_id": "Harold Sherman",
                    "user_href": "/profile/Harold-Sherman-8"
                },
                {
                    "user_id": "Andy Sewell",
                    "user_href": "/profile/Andy-Sewell"
                },
                {
                    "user_id": "Swadesh Halder",
                    "user_href": "/profile/Swadesh-Halder-1"
                },
                {
                    "user_id": "Michael La Tour",
                    "user_href": "/profile/Michael-La-Tour"
                },
                {
                    "user_id": "Steve George",
                    "user_href": "/profile/Steve-George-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Bainton",
                "href": "/profile/Barry-Bainton"
            },
            "answer_text": "The question is ambiguous! What are sources of archaeological methods, reports, studies, theories, etc? Or, do you mean what are resources one needs to do archaeological research and/or analysis? I suggest that you check out Portal:Archaeology - Wikipedia This a broad look at the many aspects of archaeology as it relates to anthropology and other disciplines. ",
            "date": "Answered May 20, 2018",
            "views": "28",
            "upvotes": " View 6 Upvoters"
        }
    ]
}