{
    "title": "What is the difference between Aphrodite and Eros? - Quora",
    "tags": [
        "Aphrodite (Greek goddess)",
        "Greek Mythology",
        "Ancient Greece",
        "Greece",
        "Mythology"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Boll",
                "href": "/profile/James-Boll"
            },
            "answer_text": "Aphrodite was the Greek goddess of sexual pleasure and procreation. Like most ancient gods, there is no single established \"actual\" mythology from which to pull information; since only poets with the greatest skill and renown have been preserved. What our few sources have in common is that a) she was an incredibly beautiful woman, b) she had some relation to god-king Zeus, and c) she was notoriously unfaithful, seductive, and promiscuous. Zeus wanted to lock her away because he was afraid the gods would erupt in chaos at the sight of her.  Eros was a Greek god of desire and sexual attraction. The cult of Eros had largely died out by the Classical era, before which he was incorporated into the much larger and more popular cult of Aphrodite. In some myths, he's a primal god, one of the first to burst forth from creation, and is the source of all the world's desires, good and bad. In later myths, he's depicted as the son of Aphrodite, usually as a child with a bow and a quiver of arrows. He can make human, gods, and animals fall in love by shooting them with arrows.   Aphrodite and Eros are both usually labelled as deities of \"love;\" though I think this is only the case in the word's most vulgar (?) sense. However, it is necessary to note, here, an enormously relevant aspect of the Greek language: there are no less than four different words for love. English, unfortunately, only has one. \"I love chocolate\" is the same as \"I love my wife.\" In Greek, however, we have Eros, Storge, Philia, and Agape.  Eros is the love of sexual attraction or erotic desire; sometimes though, it is used for general desires, \"I want\" -- desires that coincide with needs. Storge is the love of familiarity, usually through family. Philia is the love of true friendship, the love you would bear for those who share in common factions and activities. Agape is the love of charity, the love of stranger, that causes you to give to the poor, support the homeless, visit the imprisoned, feed the hungry, and care for creation.  So you see, to call either the \"Greek god of love\" would be a misnomer, especially to the Greeks. ",
            "date": "Answered May 5, 2015",
            "views": "81",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harley Combest",
                    "user_href": "/profile/Harley-Combest"
                },
                {
                    "user_id": "Sean Connolly",
                    "user_href": "/profile/Sean-Connolly-11"
                },
                {
                    "user_id": "Aaron Michaels",
                    "user_href": "/profile/Aaron-Michaels-10"
                },
                {
                    "user_id": "David Nerswick",
                    "user_href": "/profile/David-Nerswick"
                },
                {
                    "user_id": "Wihan Steyn",
                    "user_href": "/profile/Wihan-Steyn"
                },
                {
                    "user_id": "Dana Archer",
                    "user_href": "/profile/Dana-Archer-4"
                },
                {
                    "user_id": "Shay Lempert",
                    "user_href": "/profile/Shay-Lempert-1"
                },
                {
                    "user_id": "Stefan Michaels",
                    "user_href": "/profile/Stefan-Michaels-3"
                },
                {
                    "user_id": "Pieter van der Wilt",
                    "user_href": "/profile/Pieter-van-der-Wilt"
                },
                {
                    "user_id": "Christos Lolos",
                    "user_href": "/profile/Christos-Lolos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Costas Paphitis",
                "href": "/profile/Costas-Paphitis"
            },
            "answer_text": "Aphrodite Cypria/Aphrodite Paphia (Αφροδυτη Κυπρια/ Αφροδυτη Παφια)) Is a Greek Goddess associated with feminine beauty, love, fertility, carnal pleasure, goddess of sex etc. Her name is formed by two words Aphros (Αφρος) Foam and dite (δυτη-δυτος) meaning the deep (sea) (diver in Greek is dites-δυτης) the one who dives deep in the sea. Legend has her come out of the sea foam in a place south-west near Paphos today called <<Petra tou Romiou) a very scenic place during sunset. According to some legends, the genitals of Uranous had fallen into the sea after his son Cronos had cut them off. In some other legends, she is the daughter of Zeus and Dione. She was married to the Greek God Hyphestus but she had many lovers. She is regarded as responsible for starting the Trojan war when she sent her son Eros to shoot the arrow of love into the hearts of Paris and Helene causing them to fall in love. Eros is her son by Ares the Greek God of war. She was worshipped all over the Hellenistic world and festival to her honor called Aphrodisia were held in mid-summer. Remnants of her temple are to be found in a place near Paphos called Yeroskipou (Ιερος κηπος) meaning sacred gardens where sacred prostitution was practiced, again according to some legends. ",
            "date": "Answered October 15, 2018",
            "views": "16",
            "upvotes": "0"
        }
    ]
}