{
    "title": "What if George Washington was never born? - Quora",
    "tags": [
        "George Washington"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Hajek",
                "href": "/profile/James-Hajek-2"
            },
            "answer_text": "Is this really a question? But okay… If Washington was never born, there would still be a revolution, but we most likely would have lost without his leadership role. But let’s day we had won, he would not be the first president of the United States, changing the course of our nations history forever. Him not being born world have a huge ripple/hole in the worlds history from that point on to present day. But, let’s cut down this even further. Washington not being born would be, sorry to say, catastrophic. It’s like asking ‘what if Hitler was never born’, etc.! Washington was the greatest military tachtician the world has ever known. First as president; first as leader of the new Continential Army. His shadow is one still looked up to by all who hold the office. Without him, there may very well not be a war for Independence; or if is one, without his leadership and forward thinking during the war, we may very well be an English territory today, or gain independence in say, modern era. The American people LOVED—no, ADORED Washington. He was, in essence, the Revolutionary War (or at least the embodiment). He was unanimously voted in as Commander-in-Chief of the Continential Army, then TWICE unanimously as the United States’ first president. Without his leadership during the war, moral would cease in my opinion, as he had to beg and plead with his men to stay in and continue fighting (Trenton proved that we could go on). If he was not in charge, Trenton may very well have been an afterthought. Without him, no Civil War; no invalvment in WW1 & 2; no Gettysburg Address; no Washington D.C. (known as the Residence Act of 1790: July 16, 1790)—history if not just the country, but if the world would be drastically altered to a point I can’t comprehend without further knowledge or foresight. ",
            "date": "Answered May 25, 2018",
            "views": "521",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ash White",
                    "user_href": "/profile/Ash-White-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Boyle",
                "href": "/profile/Joseph-Boyle"
            },
            "answer_text": "Never mind his Revolutionary career, let’s look at his first military career as a young man. What if he never touched off the French and Indian war AKA Seven Years War? Britain might not have kicked France out of both North America and India, most likely continuing to compete in both. With the French threat still in place, the Anglo-American colonists could not have thought of revolt. ",
            "date": "Answered May 31, 2018",
            "views": "713",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joey Lin",
                    "user_href": "/profile/Joey-Lin-52"
                },
                {
                    "user_id": "Cody Cowell",
                    "user_href": "/profile/Cody-Cowell-1"
                },
                {
                    "user_id": "Satyam Singh",
                    "user_href": "/profile/Satyam-Singh-23"
                },
                {
                    "user_id": "Phil Wolff",
                    "user_href": "/profile/Phil-Wolff"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Aditya Chhabra",
                    "user_href": "/profile/Aditya-Chhabra-45"
                }
            ]
        }
    ]
}