{
    "title": "What did New Orleans smell like after hurricane Katrina? - Quora",
    "tags": [
        "Hurricane Katrina (2005)",
        "New Orleans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mills Baker",
                "href": "/profile/Mills-Baker"
            },
            "answer_text": "To add to the excellent answers on this page, one thing that stood out to me was that the smells were alarming. If you’ve been around dead animals, people, or various kinds of rot, disease, or decay, you know that some smells seem to really worry your body a lot: they provoke what seems like an instinctual reaction: sub-cognitive disgust, almost physical fright. Around the city, on streets in worse-off neighborhoods (with lots of mold, refrigerators, and who-knows-what-else) and indoors in many places, I’d hit wafts of odor that my body seemed to want to flee, seemed to regard as dangerous, and I’d just have to push through them. So: rotting food, rotting bodies, intense mold and mildew, organic scents cooked intensely in the heat and humidity, mountains of trash, everything everywhere spoiled and teeming to bursting, a kind of hybrid of jungle-tropics-at-their-worst + civilization-crumbled-and-spread-out-to-decompose, all summing to a smell that felt like it might poison you or make you seriously ill. It wasn’t too good. ",
            "date": "Answered November 26, 2018",
            "views": "25",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danielle Nguyen",
                    "user_href": "/profile/Danielle-Nguyen-24"
                },
                {
                    "user_id": "Sydney Almasy",
                    "user_href": "/profile/Sydney-Almasy"
                },
                {
                    "user_id": "Christian Browning",
                    "user_href": "/profile/Christian-Browning"
                },
                {
                    "user_id": "Laura Zwickl",
                    "user_href": "/profile/Laura-Zwickl"
                },
                {
                    "user_id": "Jack Brunell",
                    "user_href": "/profile/Jack-Brunell"
                },
                {
                    "user_id": "Jessica Luc",
                    "user_href": "/profile/Jessica-Luc-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gayle-40"
                },
                {
                    "user_id": "Vo Nghi Nguyen",
                    "user_href": "/profile/Vo-Nghi-Nguyen"
                },
                {
                    "user_id": "Leung Ngai-Hang Zachary",
                    "user_href": "/profile/Leung-Ngai-Hang-Zachary"
                },
                {
                    "user_id": "Ryan Cheu",
                    "user_href": "/profile/Ryan-Cheu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Rogers",
                "href": "/profile/Chuck-Rogers-1"
            },
            "answer_text": "Thanks for the A2A. Some areas were fine. The city went to great lengths to clean up the French Quarter — which also didn’t have as much damage as other areas — in order to get the tourist business back up and running. That’s exactly as it should since tourism fuels the economy here. But the rest of the city was bad. Every home had a refrigerator with food that just sat there for about 6 weeks. The very first thing we did when we got to the house was haul the fridge out the curb. Every couple of days I would go pour a gallon of bleach over it to help keep the stench to a minimum and keep flies away. Not everyone did that, however. On some streets you could smell the mold as you drove by house after house after house that would need to be gutted before it could ever be lived in again. Cars that were submerged also had their own unique smell. It was something I will never forget. ",
            "date": "Answered June 16, 2018",
            "views": "597",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mills Baker",
                    "user_href": "/profile/Mills-Baker"
                },
                {
                    "user_id": "Xavier Cooper",
                    "user_href": "/profile/Xavier-Cooper-12"
                },
                {
                    "user_id": "Sydney Almasy",
                    "user_href": "/profile/Sydney-Almasy"
                },
                {
                    "user_id": "John Wiggins",
                    "user_href": "/profile/John-Wiggins-44"
                },
                {
                    "user_id": "Brett De Haven-Harpster",
                    "user_href": "/profile/Brett-De-Haven-Harpster"
                },
                {
                    "user_id": "James C. Maxwell",
                    "user_href": "/profile/James-C-Maxwell"
                },
                {
                    "user_id": "Ray Jones",
                    "user_href": "/profile/Ray-Jones-140"
                },
                {
                    "user_id": "Steven Michael",
                    "user_href": "/profile/Steven-Michael-13"
                }
            ]
        }
    ]
}