{
    "title": "What is the one thing that everyone should know about your country? - Quora",
    "tags": [
        "General Knowledge",
        "Country Comparisons",
        "Knowledge",
        "Culture (social science)",
        "Learning New Things",
        "Important Life Lessons",
        "Countries of the World",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anji Velagana",
                "href": "/profile/Anji-Velagana"
            },
            "answer_text": " Hi Everyone, Here I would like to tell you a story. Lucy, a foreigner, came to India. She landed at Indraprastha (Delhi) airport & felt blessed to be in Pandavas' land. She came out & had a taxi. On roads, she was surprised to see the pollution & thought the fumes after Kurukshetra continuing still. She took a hotel room, lie down for rest @9pm & woke-up in the daylight. She visited Parliament Bhavan & felt it as a temple for democracy. There she found a hunger strike of people for justice on some issues. Then Lucy realized, \"People have to be in hunger for Justice before Democratic temple.\" She then moved to visit TajMahal & wondered to see cracks on the 7th wonder. As a Devotee of Lord Ram, she went to his birthplace Ayodhya. There she didn't found the temple. She surprised how the dead Ravana destroyed Ram's temple. With the disappointment of Ravana's did, Lucy went west & was impressed with the \"Sardar Patel Statue.\" While spending in Gujarat, she heard 2002 riots, then she felt without the unity, we've \"Statue of Unity.\" After that went to Mumbai & walked through the slums, then she understood a city should've slums to be called financial capital. Lucy entered North-eastern states & impressed with their Buddhists' traditions like China, but she felt, \"Why these sister-states didn't develop like China.\" After that, she came to the joyful city Kolkata and started her journey through a Bullock cart to visit Kali temple, Mother Teresa's tomb & Ramakrishna math. On the way, she found the empty roads because of the political strike of the opposition party. Then she thought Kolkata is not a \"City of Joy\" but the \"City of Strikes.\" She came to south starting with Hyderabad & enjoyed boating in Hussain Sagar. She surprised how Budha is still standing in the middle of polluted water. Then she realized that's why he is Budha. After that, she landed in Bangalore. While eating breakfast in a hotel there, she felt awkward. Even though the food is tasty, she was unable to digest it by seeing the cost. Thereafter she mesmerized to see Mysore palace and Gali Janardhan's house in Karnataka. Lucy then moved to Tamilnadu, and wish to dip in Cauvery before visiting ancient temples. She didn't find water in the river because of deforestation, but she thought Indians are devotional; that's why the rivers dried while having too many dips. Edit: I wrote this story in a sarcastic manner. Image Source: Intrepid travel ",
            "date": "Answered March 13, 2020",
            "views": "493",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sreenivasbhat Pervela",
                    "user_href": "/profile/Sreenivasbhat-Pervela"
                },
                {
                    "user_id": "Aditi Chopra",
                    "user_href": "/profile/Aditi-Chopra-57"
                },
                {
                    "user_id": "Shubham Patra",
                    "user_href": "/profile/Shubham-Patra-3"
                },
                {
                    "user_id": "Ashutosh Nath",
                    "user_href": "/profile/Ashutosh-Nath-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Je M'appel Mentesenot Addisu",
                "href": "/profile/Je-Mappel-Mentesenot-Addisu"
            },
            "answer_text": "So I live in Ethiopia and when we write the year on paper or calendar we add A.M at the end i.e. 2013 A.M “A-m-te Me-he-ret” Which means year of mercy the reason behind this is that the years before the birth of Crist people redeemed them selves through hard work and spilling blood which we have an abbreviation for A.F “A-m-te Fe-da which means year of unpleasant hard work but after the birth of Crist GOD saw us through Jesus with his merciful eyes so we use A.M to symbolize that mercy and I think that is beautiful  LONG LIVE ETHIOPIA ",
            "date": "Answered September 13, 2020",
            "views": "65",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Karalea Kappa",
                    "user_href": "/profile/Karalea-Kappa"
                }
            ]
        }
    ]
}