{
    "title": "What are universals in metaphysics? Why did it cause much controversy back then? - Quora",
    "tags": [
        "Metaphysics",
        "Controversies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Bricker",
                "href": "/profile/Jeffrey-Bricker-1"
            },
            "answer_text": "Universals have fascinated philosophers since Plato. My German Shepherd, named Junebug, is a particular dog. But the concept “dog” is a universal. Philosophers have no problem with particular things, but are puzzled by what universals exactly are. Are they just something the human mind creates when it lumps various particulars that resemble one another together? Or do universals exist, perhaps in another realm? When we recognize a table as a table, does our mind somehow compare our image of the particular table to some mental or metaphysical form of tableness? This may not sound like a terribly interesting issue. But suppose we stop talking about dogs and tables and start asking about the Good, the True, and the Beautiful? Well, if Goodness exists as a universal, then whenever we encounter a particular act and have to judge if it is a good act or a bad act, we can compare the particular to the universal and get an objective answer. This possibility is obviously of interest to philosophers. ",
            "date": "Answered May 28, 2018",
            "views": "109",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "Alexander Serdyukov",
                "href": "/profile/Alexander-Serdyukov-1"
            },
            "answer_text": "Universals are just ideas that can be defined objectively. It all starts merrily enough with geometry and concepts like prime numbers, but once we get to ideas like justice, love, or beauty — objective definitions are quite a bit harder to come by. So the controversy is — do these universals really exist? Which opens an infinite can of worms, naturally: what is real? What does it mean for anything to exist? ",
            "date": "Answered May 25, 2018",
            "views": "59",
            "upvotes": " Answer requested by Quora User"
        }
    ]
}