{
    "title": "What are the best history books? - Quora",
    "tags": [
        "History Books",
        "Best of X"
    ],
    "response": [
        {
            "author_info": {
                "name": "Corwyn Berthier",
                "href": "/profile/Corwyn-Berthier"
            },
            "answer_text": "I do not know the “best,” but I can think of a lot of really great ones. The greatest history books are also literature. Some history books inform us, and do it so eloquently that they impress the information on us as much as tell us. There are some really large documentary history books that are marvels of style and erudition at the same time, and they are a pleasure to read. These sorts of books range from Edward Gibbon’s The Decline and Fall of the Roman Empire, to David Chandler’s The Campaigns of Napoleon. Winston Churchill’s 6-volume history of the Second World War is also in this category. There are also popular books of history that we should not disdain to examine. I agree with Bruce Graham on the excellence of Will & Ariel Durant’s multi-volume The Story of Civilisation series. It contains a lot of information, and it attempts to transform some very complex historical matter into a coherent narrative. It is, indeed, very well written in an old fashioned formal style that appeals to many of us. Somewhere between these two styles are books by people like Alaistair Horne. Horne’s books on France, The Fall of Paris, The Price of Glory, and To Lose a Battle deal with 3 important stages in France’s history, and I found them informative, well-researched, and very literate. Let us not omit historical philosophy. Arnold Toynbee’s enormous A Study of History and Oswald Spengler’s Decline of the West attempt to construct theories of historical development, and examine civilisations and cultures in an attempt to derive support for their ideas. You may not agree with their various theses and hypotheses, but it is a great intellectual workout to examine these matters from their perspective. And Toynbee wrote the most entertaining and peculiar erudite historical prose since Gibbon. Let’s not forget original sources or early examples. Herodotus, Thucydides, and Xenophon are really required reading. Polybius is also worth a look. Julius Caesar’s Gallic War is a laconic classic that lays out Caesar’s war with Gaul. It’s very interesting not only as a factual account, but as a look into the mind of the famous general and politician. If you want to read the official PR version of Roman history from about the time of Augustus, look at Titus Livius’ Ab Urbe Condita (History of Rome). It’s great narrative, even if it’s not precisely reliable when it comes to particulars, and he definitely had an agenda. Later Roman historians worth the time are Tacitus, and the rather scandal-mongering but amusing Suetonius. Gerald Pierson should weigh in on this subject, for very obvious reasons. ",
            "date": "Answered August 31, 2019",
            "views": "23",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajitesh Singh",
                    "user_href": "/profile/Ajitesh-Singh-46"
                },
                {
                    "user_id": "Jeff Schellenberg",
                    "user_href": "/profile/Jeff-Schellenberg"
                },
                {
                    "user_id": "Pim Gauthier",
                    "user_href": "/profile/Pim-Gauthier"
                },
                {
                    "user_id": "Utkarsh Pandey",
                    "user_href": "/profile/Utkarsh-Pandey-163"
                },
                {
                    "user_id": "Cyrus Pacht",
                    "user_href": "/profile/Cyrus-Pacht"
                },
                {
                    "user_id": "Kent Williams",
                    "user_href": "/profile/Kent-Williams-66"
                },
                {
                    "user_id": "Lucy Linh",
                    "user_href": "/profile/Lucy-Linh"
                },
                {
                    "user_id": "Maryanne Slater",
                    "user_href": "/profile/Maryanne-Slater"
                },
                {
                    "user_id": "Ian Carmichael",
                    "user_href": "/profile/Ian-Carmichael-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beverlee Couillard",
                "href": "/profile/Beverlee-Couillard"
            },
            "answer_text": "I can only list those history books I’ve read and liked best: The Devil In The White City by Erik Larsen. 2003.The story of the architect of the 1893 World’s Fair in Chicago, intertwining the story of a serial killer, who used the fair to lure his victims to his incredible nearby hotel, to torture and murder them. This is so well written, that you are “lured” by every page—both stories fascinating and compelling. This book garnered many awards during 2003–2004. Including the National Book Award. I tend to pick books who have won that award; usually guaranteeing a great read, and learning something in the process.Embracing Defeat: The Japanese in the Wake of World War II, by John W. Dover. 1999, NBA book. The aftermath of the war, MacArthur’s administration of Japan. It’s far more interesting and often disturbing that it sounds.Lincoln At Gettysburg: The Words That Remade American, by Gary Willis, 1993 Pulitzer Prize. For me this is one of the most important history books I ever read. Beautifully written, moving and specialBlack Hawk Down: 1999, The Story Of A Modern War by Mark Bowden. I’m sure many saw the fine movie of this book. However, for me, the book was more powerful. It was considered the most intense battle since the Viet Nam war, at that time.Ghosts of Mississippi, by Maryanne Vollers. 1996. This story of the three trials for the murder of Medgar Evers.Shakespeare: The Invention of The Human by Harold Bloom. 1998. There are many who believe that with Shakespeare was the beginnings of seeing people as human beings…more, of course.Strange Vistas: The Selling of Clarence Thomas by Jane Myers & Jill Abramson. 1994. The authors write about the real political machinations that guaranteed Thomas’ appointment, in spite of the many doubts about his worthiness to be on SCOTUS.The Limits of Intervention: How Policy Was Made—And Reversed—In the Johnson Administration, by Towsend Hoopes. 1987. Important in understanding how this disastrous war was continued, and eventually lost.Fire In The Lake: The Vietnamese and Americans in Viet Nam, by Frances Fitzgerald.Tears We Cannot Stop by Michael Erik Dyson. 2007. I just finished this book. Emotionally, this is not an easy book. It is tough, raw, real, and every white person should read it. The NYT review below, says it all.One of the most frank and searing discussions on race ... a deeply serious, urgent book, which should take its place in the tradition of Baldwin's The Fire Next Time and King's Why We Can't Wait.\" The New York Times Book Review. ",
            "date": "Answered June 10, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leah Noel",
                    "user_href": "/profile/Leah-Noel-3"
                },
                {
                    "user_id": "Gerry O'Sullivan",
                    "user_href": "/profile/Gerry-OSullivan"
                }
            ]
        }
    ]
}