{
    "title": "What are the main differences between Norwegian and Scottish people? - Quora",
    "tags": [
        "Norwegian Humour",
        "British Humour",
        "Norwegian Ethnicity and People",
        "Norwegian (language)",
        "Scottish People and Ethnicity",
        "Social Sciences",
        "Norway"
    ],
    "response": [
        {
            "author_info": {
                "name": "Knut Patrick Waldron Gråbø",
                "href": "/profile/Knut-Patrick-Waldron-Gråbø"
            },
            "answer_text": "I have never been in Scotland, but I live in Norway and my interest in history means also that I do know a little bitt about the subject. But do you actually mean “the main differences”? Or “the main similiarities”? The first one is a much bigger question (and more difficult to address) then the last one. I could mention what I know about the similarities. From about the year 1000–1200 a lot of the Scottish coastline and archipelago (The Hebrides for instance) used to belong to Norway. As a part of a peace treaty (Treaty of Perth, 1266) Norway gave up on this terrorities. However it took a long time before their influence went away, and until 1750 there was still a norse language (Norn) spooken on the islands. As a result of that the language was losing its posisjon (to Gaelic and Scottish) Norn slowly died away. But it never completely went away you still find traces of it in local gaelic and scottish dialects, and also regarding place names. You also find a higher amount of words, with norse background, in Scottish then you do in English. (Despite that English is closer related to Scottish then the Scandinavian languages are). Other things: We are coastal countries with long coastlines. These coastlines can also be quite rough. We both have a coastline to the nordic sea. We are also both good postioned regarding oil reserves (Despite that Norway is the only one with control over their own reserves.) ",
            "date": "Answered April 8, 2019",
            "views": "486",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Prem-Sekar-G-R-प्रेम-शेखर-जी-आर"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Murray",
                "href": "/profile/Andrew-Murray-223"
            },
            "answer_text": "Completely different genetics. Different culture. Different language. Different looks. Different attitudes. Different food. Different sense of humour. Some parts of Norway and Scotland have the same rugged looks but it is a different climate. The unwelcome truth is that the most similar people to the Scots (by a mile) are the English ",
            "date": "Answered April 4, 2019",
            "views": "192",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bruce McKenzie",
                    "user_href": "/profile/Bruce-McKenzie-12"
                }
            ]
        }
    ]
}