{
    "title": "What are some of the reasons that the far right is on the rise? - Quora",
    "tags": [
        "Far Right Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Unsworth",
                "href": "/profile/Jack-Unsworth-10"
            },
            "answer_text": "Off the top of my head, I suspect: Rich people meddling in public opinion to oppose tax rises and to oppose the drop in profits to fossil fuel companies that would accompany any actual progress in the environmental movement. How the Koch brothers built the most powerful rightwing group you've never heard ofForeign powers meddling in other countries via internet trolls The Russian troll factory at the heart of the meddling allegationsBoth traditional and internet media that make money from sensationalism, either selling papers by vilifying minorities, or getting clicks by doing the same.That the status quo since the Thatcher/Reagan era has left increasing numbers of people behind, and has left public services tragically underfunded, and so people are turning away from the status quo, either to the moderately further left to find actual solutions, or to the far right to blame immigrants and other minorities.mainstream politicians reacting to all this by latching onto it, and fuelling those flames, in order to further their personal political agenda.I’m not sure what else. I’d say that it doesn’t matter in the grander scheme of things, apart from unspeakable personal and national tragedy, because it is just a blip in an otherwise clear and steady moral and social progress in history. However, the various environmental problems we face now are an existential threat, and can only be solved by an international effort, and not by countries that are destroying the international project. The various environmental projects will make every other problem worse, socially and economically, and pretty much in every way, so this is bad timing for a rise in the far right, really. Any ideas in how to remedy this would be appreciated. ",
            "date": "Answered October 28, 2018",
            "views": "204",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-E-995"
                },
                {
                    "user_id": "Tomasz Sowa",
                    "user_href": "/profile/Tomasz-Sowa-7"
                },
                {
                    "user_id": "Marianne Johns",
                    "user_href": "/profile/Marianne-Johns-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosa Lichtenstein",
                "href": "/profile/Rosa-Lichtenstein"
            },
            "answer_text": "Social media has much to do with this; it has allowed a whole range of wacko right-wing conspiracy theories to proliferate on-line. This development has been amplified by those conspiracy theories being aired on Fox News, by other media centres, and by right-wing ideologues. Here are the details: Analyzing a terrorist's social media manifesto: the Pittsburgh synagogue shooter's posts on Gab All this has taken place at a time when the US and UK military invaded Muslim countries setting off hatred of Muslims in the UK and the USA for their temerity to fight back against these invaders, This provoked several mass migrations from the Middle east and North Africa, particularly after the rise of ISIS (which was itself a consequence of the Iraq and Libya debacles)> The rabid right across Europe and the USA have used this to stir up fear, hatred and suspicion, spreading foul lies about those fleeing the horrendous mess the US and UK created!, Analyzing a terrorist's social media manifesto: the Pittsburgh synagogue shooter's posts on Gab Add to that the following: mass poverty in Latin America, much of it the result of US domination of the region for over a century, has also sparked off mass migration north. The US is now reaping what it sowed — and the Liar-in-Chief is using this to win votes from millions of fellow racists in the USA. This hasn’t been helped by the endemic racism that is still evident in the USA, following on from over two centuries of slavery, Jim Crow, segregation. voter suppression, antisemitism and widespread support for Hitler in the 1930s. American supporters of the European Fascists Notorious Nazi collaborators or sympathisers Nazis & America: The USA’s Fascist Past | History Cooperative German American Bund When Nazis Filled Madison Square Garden American-Nazis-in-the-1930s the-German-American-Bund Indeed, Hitler and the Nazis derived many of their racist ideas from the USA: How the Nazis Used Jim Crow Laws as the Model for Their Race Laws The Horrifying American Roots of Nazi Eugenics What America Taught the Nazis To cap it all, the Sex-Pest-in-Chief has boosted this hate even further, bringing racism and fear into the mainstream, giving the US alt-right a major shot-in-the arm. Clearly, he and those around him have taken tie following piece of advice to heart: “Voice or no voice, the people can always be brought to the bidding of the leaders. That is easy. All you have to do is tell them they are being attacked, and denounce the peacemakers for lack of patriotism and exposing the country to danger. It works the same in any country.” [Hermann Goering.] http://ibertytree.ca/quotes/Hermann.Goering.Quote.65D2 So, it is hardly surprising if we see violence like the following coming from the far right (these examples have been mainly but not exclusively drawn from the USA) — in addition to what we have witnessed over the last week or so, in Pittsburgh, for example: The Resurgent Threat of White-Supremacist Violence A Culture of Violent White Guys Britain First Harrow curry house attacker convicted Court upholds conviction, death sentence in James Byrd dragging death Driver 'hit woman in anti-Muslim attack' Dylann Roof sentenced to death for the murders of nine black church members Neo-Nazi guilty of gay pride attack plan FBI and DHS reported \"persistent\" white supremacy threat in May FBI: Man with white supremacist ties stopped train in rural Nebraska with intent to harm passengers Finsbury Park attacker 'wanted to kill as many Muslims as possible' Four far-right terror plots foiled in the last year as threat rises Heather Heyer, victim of Charlottesville car attack, was civil rights activist \"I laugh at the death of normies\": How incels are celebrating the Toronto mass killing Inside Atomwaffen As It Celebrates a Member for Allegedly Killing a Gay Jewish College Student Jews Top Target For Hate Crimes Last Year In New York City, Again Thomas Mair repeatedly shouted 'Britain First' before killing MP Jo Cox, court hears John Guandolo Wishes He Could Execute People He Thinks Spread Marxist Islam Kansas Trio Convicted in Plot to Bomb Somali Immigrants Majority of 2017 extremist murders in US were committed by right-wingers: Report Mass shooter’s computer shows he was obsessed with Trump, popular far-right causes Neo-Nazi Florida National Guard soldier gets five years in prison on bombmaking charges World's biggest neo-Nazi website orders its fans to target Heather Heyer's funeral New Study: White Nationalists Are Worst Terror Threat Oklahoma City bombing Racist Jacob Goodwin convicted of assault on black man during Charlottesville rally Report: White Extremists Killed More People Last Year Than Any Other Domestic Terrorist Group Nazi 'called for Jews to be eradicated' The alt-right is killing people The Latest: Italian gunman had far-right extremist ties This Neo-Nazi Speech Shows The Rally In Charlottesville Was Always Meant To Be Violent Utah militia leader admits guilt in BLM bomb plot What we know about James-Alex-Fields-charlottesville-driver Man Arrested for Illegal Guns Belongs to Neo-Nazi Group That Wants ‘Ethnostate Rape Gangs’ Neo-Nazi given life for German race murders MP's murder was to be 'white jihad' Fox News, Daily Caller delete posts encouraging people to drive through protests After claiming self-defense, a Klansman pleads no contest to firing gun at Unite the Right Quebec Mosque Shooter Was Consumed by Refugees, Trump and Far Right Australia: https://aic.gov.au/publications/tandi/tandi491 Italy: Rising tide of violence in Italy after the election (follow this Twitter thread for more details): If you want to understand how inflammatory, dehumanising political rhetoric can break a society apart, look no further than Italy. A silent pogrom is happening right now, and its main instigator has a name and a surname: Matteo Salvini. (1)— Leonardo Carella (@leonardocarella) July 27, 2018\n ",
            "date": "Updated November 21, 2018",
            "views": "307",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keith S. Drake",
                    "user_href": "/profile/Keith-S-Drake"
                },
                {
                    "user_id": "Jacob Parodi",
                    "user_href": "/profile/Jacob-Parodi"
                }
            ]
        }
    ]
}