{
    "title": "What happened to dead soldiers in the Civil War? - Quora",
    "tags": [
        "Soldiers",
        "Historical Civil Wars",
        "U.S. Civil War",
        "Military Personnel",
        "History of the United States of America",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Rockefeller",
                "href": "/profile/Keith-Rockefeller"
            },
            "answer_text": "The most basic thing is that the dead were buried. This occurred in a few different ways. In some cases comrades might bury a fallen soldier and try to put up a crude marker. They might try to record where the body was buried and convey that information to the family of the fallen soldier.In large scale actions, the bodies were often left on the field and after the engagement, whichever side held the ground would send parties out to recover the corpses and bury them in singular or mass graves. Priority was given to whichever side won the battle so that if the Union Army controlled the battlefield at the end of the engagement, Union dead were buried first and given more care.Sometimes family members were allowed onto the battlefield to search for their fallen loved ones. They would retrieve the body, have it (possibly) embalmed and put in a casket, then shipped home for proper burial.Severely wounded soldiers who died in a field hospital might be buried at the battlefield cemeteries after the battle. They had a better chance of their remains being shipped home for burial.Soldiers sent to the bigger military hospitals in a major city who died while there might be buried at a Cemetery near the hospital or their remains shipped home.Some severely wounded soldiers would be sent home to recover or be discharged. If they died from their injuries at home, they would be buried in the local or family Cemetery.Unfortunately, there were some men who died and were never recovered. (I haven't seen specific numbers). They would not have been buried and their remains subject to the laws of nature. ",
            "date": "Answered May 8, 2020",
            "views": "119",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Golden",
                    "user_href": "/profile/James-Golden-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Bastian",
                "href": "/profile/Josh-Bastian"
            },
            "answer_text": "Generally during the battle they lay where they fell. Once the battle was over both sides or the side that had control of the field generally dug graves and buried any dead soldiers that they found. Every so often a soldier died in a place that they weren’t found and thus were not buried. Also in some battles soldiers were caught in an area that caught fire and the body was thoroughly burned. In those cases generally the burned remains were buried as best the soldiers were able. Generally there were not individual graves dug merely a long trench or a common hole. A very few soldiers MIGHT be taken from a battle site to a nearby hometown for burial (this was not at all likely for a number of reasons). Similarly an officer MIGHT be removed from the field for a burial elsewhere. I can’t think of any instances off the top of my head where it did happen though and it would have been remarkable or written about in letters if it had happened. Some soldiers were buried in other places than the battlefield though. These were the ones that were mortally wounded but that they attempted to patch up that died days or weeks after the battle. (Stonewall Jackson being a good example). In these instances burial could happen anywhere from home, to the town the army was stationed in at the time, to some other significant city in the life of the soldier. Generally burial parties were not molested by either side in the US Civil War. At several battles both sides were fairly interspersed caring for wounded and gathering their dead for a period of hours or days before resuming the fighting. ",
            "date": "Answered April 7, 2020",
            "views": "141",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bryan Carstensen",
                    "user_href": "/profile/Bryan-Carstensen-1"
                }
            ]
        }
    ]
}