{
    "title": "What are the best historical famous movie sites to visit? - Quora",
    "tags": [
        "Historical Places",
        "History of Film",
        "Movie Recommendations",
        "Fame and Mass Popularity",
        "Website Recommendations",
        "International Travel",
        "Tourism",
        "Visiting and Travel",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shane Michaels",
                "href": "/profile/Shane-Michaels-10"
            },
            "answer_text": " Griffith Observatory, Los Angeles, California. The landmark Griffith Observatory is featured in the James Dean film “Rebel Without a Cause.” Before his death, Dean commissioned a bust of himself, which is now located on the front lawn of the observatory. It has also served as a shooting location for a number of other films, Including: Jurassic Park (1993), La La Land (2016), Transformers (2007), Charlie's Angels: Full Throttle (2003), The Rocketeer (1991), Earth Girls Are Easy (1988), Yes Man (2008), House on Haunted Hill (1999), Queen of the Damned (2002), Les Miserables (1998), Night of the Creeps (1986), Devil in a Blue Dress (1995), Prey (2005).  You can visit the same Lake Retreat where Anakin Skywalker and Padme Amidala hid in Attack of the Clones. George Lucas filmed the scenes at the Villa del Balbainello in Lenno, Italy, overlooking the Lake Como. It was also the location for Anakin and Padme’s weddings in Attack of the Clones. It has had several movies using it including: A Month by the Lake (1995), Casino Royale (2006)   Several Star Wars places can be found in Tunisia. The Hôtel Sidi Driss in Matmatat-Al-Qadimal was used as Luke Skywalker’s childhood home (the Lars homestead) in A New Hope. George Lucas also used various locations in Tunisia to film scenes of the desert planet Tatooine. An old mosque in the ferry port town of Ajim was used to film exteriors of Obi-Wan Kenobi’s home, and the town was also the site of the Mos Eisley Spaceport in A New Hope.  Alcatraz, San Francisco, California. “Escape from Alcatraz” (1979) a thriller starring Clint Eastwood. Alcatraz is a real place that was once a fully functioning jail that housed major criminals like Al Capone. The National Park Service offers tours of “The Rock” by ferry to anyone who wants to visit the allegedly haunted jail. Catch Me If You Can (2002) Escape from Alcatraz (1979) The Book of Eli (2010) Electric Dreams (1984) Alcatraz (2012) Birdman of Alcatraz (1962) Cats & Dogs: The Revenge of Kitty Galore (2010) An Eye for an Eye (1981) ",
            "date": "Answered August 28, 2020",
            "views": "92",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Neil Holman",
                    "user_href": "/profile/Neil-Holman-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deirdre Beecher",
                "href": "/profile/Deirdre-Beecher"
            },
            "answer_text": "I’m taking this from the perspective of places which would be enjoyable places to have a holiday in, as well as being the locations of Iconic movies. I’m also going to avoid the obvious ones, California, New York, London, Paris and Rome which have had thousands of films set in them. Petra, Jordan. Famous from Indiana Jones and the Holy Grail, it combines the beauty of the desert with fascinating ruins of the Nabataean trading civilization which spread far beyond the single iconic tomb featured in the movie. Jordan itself has plenty to offer in terms of history, culture and natural beauty.  Volcanoes National Park Rwanda - Gorillas in the Mist. The joy that people feel when they visit the Mountain Gorillas of Rwanda and Uganda is tremendous. I have seen so many photo’s of people and they all have the same daft grin on their face. Both Rwanda and Uganda are also home to beautiful mountain landscapes and if you want to go full naturalist can also be enjoyed with a safari in the Masai Mara of Kenya. (RIP Dian Fossey).  Forza d'agro, Sicily The Godfather II An iconic movie set on an island with lots to offer. Really you can have any type of holiday you can think of on Sicily from lazy seaside, to art and history, to climbing volcanoes and lets not forget the food! Most of the scenes from the movie are around Messina in the North East of the Island.  Himeji Castle - Ran - There can be few film buffs who don’t want to visit Japan and see some of the locations filmed in Akira Kurosawa iconic samurai movies as well as enjoying the culture, real Japanese food, hot springs and karaoke.  Skeilig Micheal, Ireland - The Last Jedi - Totally biased but the tricky to get to, weather dependent, spiky rocks and 6th century monastery are the most beautiful place in Ireland. Go in May/June when the Puffins are everywhere and necessitated the invention of the Porgs to cover them.  ",
            "date": "Answered September 16, 2020",
            "views": "187",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                }
            ]
        }
    ]
}