{
    "title": "What are the similarities between Napoleon and Hitler? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France",
        "Adolf Hitler"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shrinivas S",
                "href": "/profile/Shrinivas-S-15"
            },
            "answer_text": "Fun fact - the strange 129 year similarities Napoleon became Emperor in 1804 and Hitler in 1933 Napoleon conquered Vienna in 1809 and Hitler in 1938 Napoleon attacked Russia in 1812 and Hitler in 1941 Napoleon lost in 1814 but returned for a final battle, Hitler had lost by 1943 but returned for a final battle Napoleon finally lost in 1816, Hitler in 1945 Both came to power from unlikely backgrounds as they were outsiders; Napoleon a Corsica based Italian ruled France and Hitler an Austrian ruled Germany. Napoleon married twice, Hitler is known to have married once but strong rumours exist that he also married his niece.  Both attacked Russia and lost badly.  Both failed to conquer England and end the war, both tried a reverse blockade of England and failed.    Several other character similarities - Poor background (though Hitler was nearly dirt poor), Continued thirst for power, Came to power by a successful coup, extremely popular with the crowds, use of war to fuel expansion, tried to conquer entire continent, stubborness in the face of defeat, megalomaniacs to the T, purged the existing elite and installed men of merit initially but later fell back upon sycophants,  Resistance in areas hurt them - Spain for Napoleon and Russia for Hitler, end of their reign coincides with complete ruin of their countries.  ",
            "date": "Answered May 6, 2016",
            "views": "77",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Afaunova",
                    "user_href": "/profile/Diana-Afaunova"
                },
                {
                    "user_id": "John Jafar",
                    "user_href": "/profile/John-Jafar-4"
                },
                {
                    "user_id": "Daniel Melnyk",
                    "user_href": "/profile/Daniel-Melnyk-6"
                },
                {
                    "user_id": "Job Gillette",
                    "user_href": "/profile/Job-Gillette"
                },
                {
                    "user_id": "Shaun Mathew",
                    "user_href": "/profile/Shaun-Mathew-15"
                },
                {
                    "user_id": "Digvijay Tiwari",
                    "user_href": "/profile/Digvijay-Tiwari-18"
                },
                {
                    "user_id": "Jess Chaplin",
                    "user_href": "/profile/Jess-Chaplin-2"
                },
                {
                    "user_id": "Royson Mascarenhas",
                    "user_href": "/profile/Royson-Mascarenhas"
                },
                {
                    "user_id": "Derek Hryciuk",
                    "user_href": "/profile/Derek-Hryciuk"
                },
                {
                    "user_id": "Fahim Faisal",
                    "user_href": "/profile/Fahim-Faisal-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Desmond Ng",
                "href": "/profile/Desmond-Ng-23"
            },
            "answer_text": "Both weren't born in the country that they came to rule. (Corsica was bought by France only shortly before Napoleon's birth, and Hitler was born in Austrian) Both were head of a once mighty country that had recently become much weaker.  Both were surrounded by their enemies. Both rapidly conquered Europe using new tactics that defeated superior foes time and time again.  Both invaded Russia and got their armies chewed up in the vast Russian interior. Both faced massive resistance movements in conquered areas that sapped their strength.  Both were continuously opposed by Britain, even when it seemed that they had Europe in their grasp.  ",
            "date": "Answered May 6, 2016",
            "views": "33",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fahim Faisal",
                    "user_href": "/profile/Fahim-Faisal-49"
                },
                {
                    "user_id": "Peter Murphy",
                    "user_href": "/profile/Peter-Murphy-57"
                },
                {
                    "user_id": "Vibhanshu Sharma",
                    "user_href": "/profile/Vibhanshu-Sharma"
                },
                {
                    "user_id": "Jeffrey Woo",
                    "user_href": "/profile/Jeffrey-Woo-9"
                },
                {
                    "user_id": "S. Ranck",
                    "user_href": "/profile/S-Ranck-1"
                },
                {
                    "user_id": "Ezra Melchor",
                    "user_href": "/profile/Ezra-Melchor-1"
                },
                {
                    "user_id": "Faris Hasan",
                    "user_href": "/profile/Faris-Hasan-2"
                },
                {
                    "user_id": "Aneirin Stevenson",
                    "user_href": "/profile/Aneirin-Stevenson"
                },
                {
                    "user_id": "Carla Braun",
                    "user_href": "/profile/Carla-Braun-1"
                },
                {
                    "user_id": "Victor Lugt",
                    "user_href": "/profile/Victor-Lugt"
                }
            ]
        }
    ]
}