{
    "title": "What are some interesting dichotomies? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mitch Mills",
                "href": "/profile/Mitch-Mills"
            },
            "answer_text": "For me, the most interesting dichotomy is that this life is exactly what you believe it to be, yet is also governed by immutable physical laws. It is the resolution of this that I find makes life so very interesting. Of course, it is that an individuals perspective and thus their experience of this life is completely dependent on what they believe it to be, if they believe they are happy and that life is good, so it is and so they are, if they think they are miserable and life sucks, so they are and so it does. But I have yet to see anyone notice a coffee table in front of them, close their eyes, and believe the table into non-existence to the point where they could walk through the space it occupies without barking their shin. They might be able to convince themselves the table is gone to the point where they could no longer see it, but i don't think they could help but feel the pain of smacking their shin on the edge of the table, that is such a painful injury, you know? But sometimes it seems that it isn't so easy to draw the line between what is real, and subject to physical laws, and what is metaphysical, and only in the mind. ",
            "date": "Answered September 11, 2015",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Treichler",
                    "user_href": "/profile/Jonathan-Treichler-1"
                },
                {
                    "user_id": "Andy Anderson",
                    "user_href": "/profile/Andy-Anderson-188"
                },
                {
                    "user_id": "Randy Paul",
                    "user_href": "/profile/Randy-Paul-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugenio Gattinara",
                "href": "/profile/Eugenio-Gattinara-1"
            },
            "answer_text": "Some of them. - All the dichotomies represented by the Yin-Yang symbol.- The dichotomy change-permanence represented respectively by the       philosophies of Heraclitus and Parmenides.- Freud's id-superego dichotomy.- The particle-wave dichotomy in the behavior of elementary particles.- The form-content dichotomy in the arts.- The analytic-synthetic dichotomy of our thought processes.- The dichotomy produced by the left and right hemipheres of the brain.- The character-personality dichotomy. Thank you for asking me. ",
            "date": "Answered September 11, 2015",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tony Nguyen",
                    "user_href": "/profile/Tony-Nguyen-11"
                }
            ]
        }
    ]
}