{
    "title": "What are the worst empires in history? Why? - Quora",
    "tags": [
        "History of Philosophy",
        "Good and Evil",
        "Empires",
        "Evil",
        "The World",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Cadavero",
                "href": "/profile/Elizabeth-Cadavero"
            },
            "answer_text": "Worst empires? Hmm.. there are actually a LOT so here’s just a few I know and found online. NOTE THAT THIS WAS NOT MEANT TO OFFEND ANYONE! THIS WAS LITERALLY PART OF THE HISTORY AND THE SOURCES I GATHERED ONLINE SO IF YOU QUICKLY GET OFFENDED BY IT THEN WELL THAT’S YOUR LOSS BECAUSE THIS IS HISTORY AND THERE’S NOTHING YOU CAN CHANGE AND DO ABOUT IT THIS IS JUST AN OPINION BASED AND DEPENDS ON THE HISTORY ROOTS OF YOUR COUNTRY ALSO THIS WAS NOT IN ORDER (READ IT AT YOUR OWN RISK!) The French Empire - under the reign of Napoleon brought millions of lives lost in Europe due to his barbaric conquests. Even more controversial, however, was the claim of a historian that Bonaparte had ordered the mass execution of Haitians through a gas chamber. Spanish Empire - What? surprised? Actually not really. When Christopher Columbus discovered the “New World” he eventually come to a conclusion on attempting to colonized it. They steal, sacked, enslaved, hanged, raped and murdered indigenous tribes. British Empire - this empire was just the same as both the French and the Spanish. They go to countries and did horrible treatment to the people of the country they colonized. Italian Empire - they literally want to colonize their neighbors just like what the German empire (Nazi) to its neighbors as well. They quickly formed colonies in African nations such as Somalia and Libya. In 1922, under the control of the fascist dictator Benito Mussolini, Italy tried to send even more regions, including Greece and Albania. Basically, “eliminating” those who gets in the way Japanese Empire - we all know that this would be on the list. The Armed Japanese forces colonized it’s neighbors and the Southeast Asia countries (also some of the oceanic countries) They raped, massacred and used the people as a human experiment. Even China and South Korea still hates them even after the Japanese apologize to them many times. Nazi Germany (German Empire) - Ah yes, the reason of billions of deaths on Jews, horrible treatment to some of their people because they weren’t the “master race” like them. Colonized it’s neighbors without mercy and enjoys playing the victims like it’s their toys. They were the definition of sadist. Portuguese Empire - they enslaved African countries. Many tried to gain independence which led to a brutal fourteen-year war that involved a massacre of 500 men, women and children by Portuguese soldiers. Ottoman Empire - this empire basically just sanctioned the genocide against Christian Greeks and to its formal colonies. In the old days they don’t like Christians so they murder them- Ancient Egyptian Empire - Remember the movie about Moses freeing the Israelites from the Egyptian’s cruel slavery? Yeah, it made it on the list. They torture the Jews and enslaved them. They forced them to work and work until they die even at such a young age they’ll be pushing large rocks to the top without stopping for rest. Mongol Empire - Who would’ve guessed tat this empire have the most occupied land and brutally massacre its colonies’ people. The leader of the Mongol Empire was a killing machine and so was his armies. If the city responded to their wishes, they would be forgiven and allowed to live, but if they did not, their city remained destroyed, and everything continued killed inside. It estimated that 30 million people were killed during his reign. Belgian Empire - (I was kinda surprised at this) Private property of King Leopold II was known as the \"Congolese butcher\" because he killed millions of Congolese by forcing them to work on rubber plantations. Those who did not complete the quota were sitting or cutting their hands. Dutch Empire - (A little bit surprised as well-) When the Dutch empire occupied Indonesia, they were brutally killed, enslaved for years, just like it’s fellow European empires. Ok that’s all I know for now. Pretty sure that there’s more like the Empires in China did to it’s civilians and the Maori tribes etc.. I’ll say it again for the people that will get mad at my answer. NOTE THAT THIS WAS NOT MEANT TO OFFEND ANYONE! THIS WAS LITERALLY PART OF THE HISTORY AND THE SOURCES I GATHERED ONLINE SO IF YOU QUICKLY GET OFFENDED BY IT THEN WELL THAT’S YOUR LOSS BECAUSE THIS IS HISTORY AND THERE’S NOTHING YOU CAN CHANGE AND DO ABOUT IT! THIS IS JUST AN OPINION BASED AND DEPENDS ON THE HISTORY ROOTS OF YOUR COUNTRY! Sauce: 16 Most Unbelievably Evil Empires In History 25 Most Unbelievably Evil Empires In History Top Ten Most Brutal Empires In History ",
            "date": "Answered September 3, 2020",
            "views": "440",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Wang",
                    "user_href": "/profile/David-Wang-1388"
                },
                {
                    "user_id": "SHRADDHA SINGH STUDENT VK",
                    "user_href": "/profile/SHRADDHA-SINGH-STUDENT-VK"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eutychius Kaimakkamis",
                "href": "/profile/Eutychius-Kaimakkamis"
            },
            "answer_text": "There are several empires throughout history that ultimately did more harm than good to the territories they controlled, but my “first prize” goes to the Belgian colonial Empire. Belgium was one of the latest players in the grand colonial empire “game”, but arrived just in time to contest the colonization of Africa, managing to secure a massive amount of territory in the Congo (modern Democratic Republic of Congo) and a few other territories around it, plus a foothold in China after the latter was essentially segregated into European spheres of influence. The Belgian rule over Congo wasn’t merely about transferring power and securing a colonial domain, it was about sheer resource extraction and local populace exploitation. Belgium being a small country with few natural resources used the natural riches and resources of the Congo to fund its industrialization process and fulfill their ambitions into becoming a relevant colonial power (fat chance). The process was horrid and inhumane in several ways: First of all, King Leopold II essentially owned the Congo as his own property for over 20 years between 1885 and 1908 when it became an official colony under the domain of Belgium. He used the Congo solely as a means to enhance his riches and make a profit out of the occupation. Imagine a feudal lord, but owning a land of over 50 million people without any overarching authority. Secondly, the Congo peoples were used as nigh-slaves to gather resources such as ivory and rubber. The labour was enforced via use of extreme violence: They tortured, mutilated and even downright murdered millions of natives for this purpose. Thirdly, a factor outside of Belgian control was the spread of diseases like smallpox among the inhabitants who were not predisposed to them. The result of this along with the aforementioned forced labour practices was an estimated 10 million deaths which was approximately 20–25% of the entire local population of that period. And lastly, there was heavily-monitored and strict racial segregation that lasted in some forms even up to the late period before the Congo’s independence. Now, Belgium didn’t do just harm, for example it played a big role in the later urbanization of the country and the development of a European-style economic activity which helped many natives to rise from poverty. However, that was only instigated in the latter 10–15 years of the Belgian Congo and did next to nothing to make up for the brutal exploitation of the late 19th/early 20th century. A testament to the cruelty of the Belgian rule is perhaps the most famous of “what a human is capable to do to another human being” stories, “Heart of Darkness” by Joseph Conrad who used his own personal experiences in the Congo as inspiration for the plot. ",
            "date": "Answered April 7, 2017",
            "views": "43",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Li Song",
                    "user_href": "/profile/Li-Song-70"
                },
                {
                    "user_id": "Bett Rohner",
                    "user_href": "/profile/Bett-Rohner-1"
                },
                {
                    "user_id": "SHRADDHA SINGH STUDENT VK",
                    "user_href": "/profile/SHRADDHA-SINGH-STUDENT-VK"
                },
                {
                    "user_id": "David Gruber",
                    "user_href": "/profile/David-Gruber-1-1"
                },
                {
                    "user_id": "Eduardo Silva",
                    "user_href": "/profile/Eduardo-Silva-108"
                },
                {
                    "user_id": "Shahran Hussain",
                    "user_href": "/profile/Shahran-Hussain"
                },
                {
                    "user_id": "Nick Mason",
                    "user_href": "/profile/Nick-Mason-21"
                },
                {
                    "user_id": "Angus Simpson",
                    "user_href": "/profile/Angus-Simpson-1"
                },
                {
                    "user_id": "John Donaldson",
                    "user_href": "/profile/John-Donaldson-103"
                },
                {
                    "user_id": "Russell Dunn",
                    "user_href": "/profile/Russell-Dunn"
                }
            ]
        }
    ]
}