{
    "title": "What did World War 2 look like? - Quora",
    "tags": [
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Bazzinotti",
                "href": "/profile/Jay-Bazzinotti"
            },
            "answer_text": "Much has been written about the horror of war from the soldier's viewpoint but little has been written here about what America experienced during the war. My father told me that everyone knew war was coming for years before it did. Germany was a like bee, everyone avoided it in the hopes it would leave them alone, but you knew sooner or later it would sting you. In those days newspapers were much larger in dimensions than they are now and prone to big headlines and poor writing. All you need do is go to any library and look up a newspaper from the 1930s and you will be amazed at how poorly written it is and the sensationalist, breathless nature of the reporting. This wasn't universally true but for the big front page articles it seemed true. It was propaganda designed to sell papers and if people think \"if it bleeds it leads\" is a topic these days, it was must as much so back then -- and worse because there were fewer photos and videos, so the written word was typically the main source of info along with radio. The US was just coming out of depression when the war started. Over a few months every aspect of life changed dramatically and in visible ways. Men were immediately called up to service through the draft. High schools were pushing up graduation dates and lowering standards to get more men into the service quicker. Factories began to run three shifts. There were no longer vagrants and the unemployed hanging around -- anyone could find a job or be drafted. Rationing began to be implemented -- sugar, gasoline, metals, rubbers, shoes. These things became difficult to get. An entire bureaucracy arose where there were ration stamps for everything and profligate waste or driving was viewed with suspicion and seen as anti-patriotic. Even cigarettes changed -- Lucky Strikes used a green circle on its packages but when green coloring became needed for the military, they launched a campaign where they changed their circle to red and made a big deal of \"Lucky Strikes Goes to War\". The circle remains on Lucky Strikes to this day.  People became intimately involved in the war. They were asked, goaded, almost forced into purchasing war bonds to finance the war. This was extremely helpful in keeping down inflation because the government was pushing money out the door as fast as it could print it to pay for war goods, but destroying the money by forcing people to buy bonds. There wasn't much to buy anymore anyway. No passenger vehicles were being made by Detroit anymore. There were no sewing machines. Mail was slower. All civilian industries were given over to making war goods. You can still find guns made by Singer Sewing Machine and the US Postal Service. Consumer goods just could not be made. There was a saying from the Depression that was also in wide use during the war, \"Use it up, wear it out, make it do, or do without.\" because it was very difficult to replace anything. The railroads stepped up to support the effort and were regulated the way they were in WW1. At the time they were beginning the mass migration to diesel-electrics but the government decided this was too disruptive to industry and forced them to stay on steam power and the biggest, most powerful locomotives ever made were produced during this time. Troop trains with Pullman sleepers jamming dozens of soldiers in a single car with luxurious accommodations for officers were a common sight and military trains had priority on the system, even over Milk Trains which carried spoilable  milk from all over the country in ice-filled cars, and which still had to stop on sidings while flat cars of tanks and trucks and passengers cars of soldiers flashed by.  People with loved ones in the service were allowed to put a small flag in their front window with a star for every person in their family serving. If someone died in the service, they got a small flag with a Gold Star. Gold Star  mothers who lost sons were rounded up by the government and driven around to Bond Drives where people were gathered to see celebrities or big time entertainment and then regaled with speeches entreating them to buy bonds. The government's MINIMUM suggestion for bonds was 10 percent of your salary.  Factories everywhere became busy places, running three shifts a day with unlimited overtime for anyone who wanted it because so many men were gone to the Army there were fewer to make supplies. Young woman frequently complained that there were no men around and the few men who were around, the lame or industry-critical, were able to make out quite well. In cities near the embarkation ports social events were held for soldiers heading off to war. It was a time of celebration and sadness and fear. Many women became \"Victory Girls\", who in their excitement became the sexual playthings of soldiers heading off to war. VD warnings became prevalent. As the war raged on people on the coast could easily see explosions in the distance at night as the U-boats sanks everything they could. The beaches in the morning were often covered with thick oil, an oar or flotsam, and sometimes bodies. Neighborhoods were organized into patrols and strangers coming to town looked at suspiciously. There were black out restrictions to prevent German bombers from locating targets and civil monitors to patrol at night and knock on the door telling people to cover up lights. There are many photos of cities like NYC in total blackout during the war and in Boston the golden dome of the State House was painted green to deny the Germans a targetting site or convince them, should they invade, that the top was copper and not the 24K gold plate it really is.  It was a time when anyone could find work and make lots and lots of money, though there was little to spend it on. A birthday cake made with sugar and butter was an enormous luxury. There was always a black market for gasoline but for the most part people remained true to the mission and believed in the government's mission to end the war -- and why not? A large percentage of their sons, fathers, brothers and uncles were fighting \"over there\". Flags were everywhere, people were invested in patriotic acts and duties and symbols. They had maps on their walls and followed the progress of the war fervently. Everyone listened to Roosevelt's fireside chats on the radio and he was like the father to the nation, having served so long that he seemed truly like a father. From people born in the 20s or 30s he was the only leader they ever knew because of his three terms and his steady leadership calmed and encouraged the nation. The newspapers portrayed our enemies as \"Krauts\" and \"Japs\" while our men were steadfast heroes. It is possible to go the Boston Public Library and see the display of war posters there and get a feel of the image the government was selling to America and the world. But the Germans were doing it too, and in some cases better and for longer. When the war broke out Americans had been exposed to many newsreels of German might and power and it terrified everyone. They seemed invincible. The Germans were flying third generation fighters while the average citizen could look up and see American bi-plane fighters in the sky and they knew it was no match. The military at the time was viewed as made up of drunks and hooligans from the Depression and there was real doubt our army could match the Germans in their snappy uniforms and blank, serious faces. The US government went so far as to ban the German film \"Triumph of the Will\", Leni Reifenstahl's propaganda masterpiece, for fear of what it would do to American morale.  American agents investigated people they suspected of aiding the enemy, seizing radios and shutting down amateur radio societies and clubs or watching them closely. My father's family had their short wave removed by the FBI despite the fact they had three sons fighting. But there really were spies among us, and in my neighborhood when an old man died during the 1970s a complete spy set up with German code books and radios was found in his attic. He worked for the railroad and was telling the Germans what supplies were being sent and where.  It was a time of change for racial attitudes as well. There were race riots in Detroit and charges of incompetence and racsism as Blacks were forced into menial and dangerous roles such as loading ammunition ships. In one major incident, known at the Port Chicago Disaster, black workers led by incompetent and poorly trained black petty officers overseen by antagonistic white officers were forced to race each other to see who could load ships the fastest. An accident resulted in the port blowing up killing hundreds, something the Germans were unable to accomplish. Later the black stevedores would mutiny and refuse to work unless conditions changed and this, among other things, changed the attitudes of many whites sympathetic to the blacks and ultimately helped lead to the integration of the Services by Truman. In Europe, Black soldiers were often just used as mules to move freight but where they fought they were accepted by the white soldiers and many fought with distinction.  In the cities it was often a time of raucous parties. Society was being  forced to change at a rapid pace and people were more willing to let go of the old ways and have fun because tomorrow you might be dead or fighting the Germans. \"Eat drink and be merry, for tomorrow we die.\" was a common attitude. And everyone knew a family where a member had died, or received a greivously wounded son missing an arm or leg or worse and tried to bring him back to the world while sheltering him from the curious and the gawkers. Uniforms and flags were venerated. Rumors and stories were rife. People were thrilled to be part of a \"top secret\" enterprise and military lingo and slang became common to use.  When the war ended it was with a giant collective sigh of relief. The rationing continued for awhile and it took years for the country to wind down from a war footing. For decades in Philedelphia one could see a crane with a gigantic barrell for a battleship hanging in space at an abandoned Navy yard. Jobs that were being done \"right now\" at whatever cost it took, were suddenly stopped. I once saw a recent photo of the abandoned Packard Motor Plant in Detroit and in the massive basement, which goes for acres, as far as the eye can see, are brand new engines for Sherman tanks, still in their crates, sitting, rusting, in a foot of water, a testament to the manufacturing ability of the United States. Suddenly, because of Operation Magic Carpet, cities had to absorb thousands and thousands of soldiers returning from the war and not just absorb them, but find a place for them, jobs and roles. One of the best depictions of this is the 1946 movie \"The Best Years of Their Lives\" where four men return from war to a US they cannot understand and where they no longer fit in. They have changed and the US changed too, in a different way. It was hard for many men and from this many motorcycle gangs sprang up, first as a way for disaffected ex-servicemen to find their way through travel and solitude, until they morphed into crime syndicates as they are now.  The government, in its wisdom, began large building projects of tenements and projects as work for soldiers returning home, and the GI bill, which allowed the university system to absorb many men and train them to run the country in the future while slowing down their re-introduction into society. People became more mobile as cars came back, and soon the entire country began a change that culminated in the civil rights, sexual, cultural revolutions of the 60s when people suddenly began to really question the motives of governments and politicians. ",
            "date": "Answered August 15, 2015",
            "views": "4",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott Hollingsworth",
                    "user_href": "/profile/Scott-Hollingsworth-9"
                },
                {
                    "user_id": "Alex Reindl",
                    "user_href": "/profile/Alex-Reindl"
                },
                {
                    "user_id": "Richard E. Rae",
                    "user_href": "/profile/Richard-E-Rae"
                },
                {
                    "user_id": "Awais",
                    "user_href": "/profile/Awais-21"
                },
                {
                    "user_id": "Chris Munch",
                    "user_href": "/profile/Chris-Munch-3"
                },
                {
                    "user_id": "Karteek Makena",
                    "user_href": "/profile/Karteek-Makena"
                },
                {
                    "user_id": "Brandon Lee",
                    "user_href": "/profile/Brandon-Lee-143"
                },
                {
                    "user_id": "Rob Norton",
                    "user_href": "/profile/Rob-Norton-3"
                },
                {
                    "user_id": "Andrew Vazhavilla",
                    "user_href": "/profile/Andrew-Vazhavilla"
                },
                {
                    "user_id": "James Mance",
                    "user_href": "/profile/James-Mance"
                }
            ]
        },
        {
            "author_info": {
                "name": "D.F. Summers",
                "href": "/profile/D-F-Summers"
            },
            "answer_text": "It  depends if you were part of the happenings overseas or if you were viewing it from home. It looked bad and sad from home but it was a lot worse for those who served in the military. It is akin to Vietnam in terms of location. If you were here it was not bad but if you were overseas it was tough  and different, entirely. People just have different \"outlooks\" depending on their \"points of view.\" ",
            "date": "Answered April 21, 2015",
            "views": "304",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olivia Metzger",
                    "user_href": "/profile/Olivia-Metzger-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                }
            ]
        }
    ]
}