{
    "title": "What did Dr. Josef Mengele do to his victims? - Quora",
    "tags": [
        "Depressing Questions",
        "Josef Mengele (Nazi)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tennille Charlton",
                "href": "/profile/Tennille-Charlton"
            },
            "answer_text": "Mengele and the Nazi Doctor's experiments included Freezing/Hypothermia, Genetics, Immunization, Infectious Diseases, Sterelization, Surgery and general torture type \"experiments\" that in all honesty seemed like they were being done just for the phone of it. Many of the things we are told about in movies or documentaries include the injection of dye in to the eyes of victims, experimenting on twins for a number of reasons and sterelization of victims, but of course there was other experiments done in the name of medicine or science by Josef Mengele and the Nazi Doctors including -  High Altitude Experiments –  The experiments were done to investigate the limits of human endurance and existence at extremely high altitudes. The victims were placed in the low-pressure chamber and thereafter the simulated altitude therein was raised. Many victims died as a result of these experiments and others suffered grave injury, torture, and ill-treatment. They were actually highly useful when it came to space travel and other such things in the future even thoughobviously it would have been better to work such things out without this kind of human experiments. Incendiary Bomb Experiments – These experiments were taken out to test the effect o fvarious pharmaceutical preparations on phosphorous burns. These burns were inflicted on the victims with phosphorous matter taken from incendiary bombs, and caused severe pain, suffering, and serious bodily injury. No medical advancement for the future was made with these experiments as far as I amaware. Freezing Experiments – The freezing experiments were probably the most useful of the experiments Mengele and the Nazi doctors did because it really helped with the advancement in treatments and such for hypothermia, so of course these experiments were used to investigate the most effective means of treating persons who had been severely chilled or frozen. The victims were forced to remain in a tank of ice water for up to 3 hours. Extreme rigor developed in a short time. Numerous victims died in the course of these experiments. After the survivors were severely chilled, rewarming was attempted by various means. In another series of experiments, the victims were kept naked outdoors for many hours at temperatures below freezing. The victims screamed with pain as their bodies froze. Sea-water Experiments –  Experiments here were used to study various methods of making sea water drinkable. The victims were deprived of all food and given only chemically processed sea water. Such experiments caused great pain and suffering and resulted in serious bodily injury to the victims.  Malaria Experiments – A horrible experimental process which was supposed to investigate for the immunization and treatment of malaria. The victims were infected by mosquitoes or by injections of extracts of the mucous glands of mosquitoes. After having contracted malaria the victims were treated with various drugs to test their relative efficacy. Over 1,000 victims were used in these experiments. Many died and others suffered severe pain and permanent disability. Typhus (spotted fever) Experiments – Typhus was a massive problem during WWII so in a way it would make sense if any sane person was to look in to vaccinations and treatments which was what Mengele and the Nazi doctors said they were doing to investigate the effectiveness of spotted fever and other vaccines. Numerous victims were deliberately infected with spotted fever virus in order to keep the virus alive - over 90 percent of the victims died as a result. Experimenting with various Poisons – The claim here was they were doing it to investigate the effect of various poisons upon human beings. The poisons were secretly administered to the victims in their food. The victims died as a result of thepoison or were killed immediately in order to permit autopsies. In or about September 1944 the victims were shot with poison bullets and suffered torture and death. Sulfanilamide Experiments –  This was to investigate the effectiveness of sulfanilamide. Wounds were deliberately inflicted on the victims were infected with bacteria suchas streptococcus, gas gangrene, and tetanus. Circulation of blood was interrupted by tying off blood vessels at both ends of the wound to create a condition similar to that of a battlefield wound. Infection was aggravated by forcing wood shavings and ground glass into the wounds. The infection was treated with sulfanilamide and other drugs to determine their effectiveness. Many victims died as a result of these experiments and others suffered serious injury and intense agony. Source:  Medical Experiments of the Holocaust and Nazi Medicine | Josef Mengele, Angel of Death ",
            "date": "Answered April 29, 2016",
            "views": "204",
            "upvotes": " View 86 Upvoters",
            "upvoters": [
                {
                    "user_id": "Revai Rivaille",
                    "user_href": "/profile/Revai-Rivaille"
                },
                {
                    "user_id": "Firyal Nabila",
                    "user_href": "/profile/Firyal-Nabila-1"
                },
                {
                    "user_id": "Yogi Heisenberg",
                    "user_href": "/profile/Yogi-Heisenberg"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Hannah Abigail",
                    "user_href": "/profile/Hannah-Abigail-5"
                },
                {
                    "user_id": "Chase",
                    "user_href": "/profile/Chase-357"
                },
                {
                    "user_id": "Christian Mejia",
                    "user_href": "/profile/Christian-Mejia-31"
                },
                {
                    "user_id": "Jimmy Cash",
                    "user_href": "/profile/Jimmy-Cash-4"
                },
                {
                    "user_id": "Irene Biju Thomas",
                    "user_href": "/profile/Irene-Biju-Thomas"
                },
                {
                    "user_id": "Molly Daunen",
                    "user_href": "/profile/Molly-Daunen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elke Weiss",
                "href": "/profile/Elke-Weiss"
            },
            "answer_text": "WARNING FOR GRAPHIC CONTENT. There’s plenty of documentary evidence. I will give personal testimony. My great aunt was selected for experimentation by Josef Mengele. She was 12, and beautiful, with blond hair and blue eyes. He selected her off the line, said he was a doctor. Her sisters were relieved, their little sister would get medical care. He injected tuberculosis into her spine to see what would happen. The medical equipment wasn’t sterile. No pain relief. She has scars on her body that are horrific. He injected her with other substances, still unknown. One was injected into her cervix. She was left sterile for life. Other substances still give her tremendous pain, even today. She never had children. She desperately watched her sisters marry and have kids and grandkids. She watched bitterly. She watched in pain. She was 12 and innocent when a monster decided to use her as a lab experiment, just because she wasn’t human in his eyes. My great aunt was one of the lucky ones. She told me what happened to the others. To her friends. To the twins. To the Romani children. She testified to it in a video at the Yad V’shem Memorial Archives. Every night she sees it in her nightmares. The experiments. The screams. The pain. The dead. She still wakes up screaming, even today. ",
            "date": "Updated October 25, 2017",
            "views": "4376",
            "upvotes": " View 3.9K Upvoters",
            "upvoters": [
                {
                    "user_id": "Roxor Foxor",
                    "user_href": "/profile/Roxor-Foxor"
                },
                {
                    "user_id": "Marieanne Blount",
                    "user_href": "/profile/Marieanne-Blount"
                },
                {
                    "user_id": "Revai Rivaille",
                    "user_href": "/profile/Revai-Rivaille"
                },
                {
                    "user_id": "Karishma Sankhwar",
                    "user_href": "/profile/Karishma-Sankhwar"
                },
                {
                    "user_id": "Dinesh Raghavendra",
                    "user_href": "/profile/Dinesh-Raghavendra"
                },
                {
                    "user_id": "Riddhesh Dalvi",
                    "user_href": "/profile/Riddhesh-Dalvi-3"
                },
                {
                    "user_id": "Tanya Begum",
                    "user_href": "/profile/Tanya-Begum-5"
                },
                {
                    "user_id": "Jason Shar",
                    "user_href": "/profile/Jason-Shar-1"
                },
                {
                    "user_id": "Alona Daphna",
                    "user_href": "/profile/Alona-Daphna"
                },
                {
                    "user_id": "Varun P",
                    "user_href": "/profile/Varun-P-118"
                }
            ]
        }
    ]
}