{
    "title": "What do Catholic Christians think of Orthodox Christians? - Quora",
    "tags": [
        "Orthodox Church",
        "World Religions",
        "Greek Christian Orthodox Church",
        "Orthodox Christianity",
        "Catholicism",
        "Christians",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Rush",
                "href": "/profile/Adrian-Rush-1"
            },
            "answer_text": "I’m nominally Catholic, but I’ve been exploring Orthodoxy for several years now. I greatly admire that the Orthodox are firmly grounded in tradition and don’t make major changes to their liturgy or theology to accommodate contemporary trends. In comparison with Catholicism, the Orthodox seem far more comfortable living with mystery. Western Christianity as a whole has a legalistic bent to it, but I find it especially pronounced in Catholicism, where everything has to have a precise definition — as if you can place definitions on the divine. The catechism itself reads like a law book, with so much talk about what’s “valid” and “licit.” The legalism places God at a distance, almost turning him into an abstraction, which for me makes it hard to feel a warmth for and a personal connection with God. Paul’s comment comes to mind about how the letter kills but the spirit gives life. I also admire how the Orthodox faith focuses on theosis — taking up our crosses every day, with great humility, while seeing ourselves as chief among sinners, and still struggling up the hill with Jesus in imitation of him, as we try our best, with all our human frailties and failings, to be as much like Christ in our daily lives as we possibly can — and trying, every day, over and over, to be more and more like him, so that our hearts can eventually radiate the love of God into the world. In my opinion, this approach to spirituality is only possible when you treat the church, as the Orthodox do, as a hospital for souls where God is the divine physician, rather than as a courthouse, as Catholics and Western Protestants do, where God is an angry judge demanding we give him a good reason why he shouldn’t send us off to eternal punishment and torture. Also, the Orthodox liturgy is beautiful. Attending an Orthodox service is like being in God’s throne room, offering him praise. It’s an amazing experience. And, as a great admirer of Mary, I think the Orthodox have a more balanced view of her. To the Orthodox, she’s our Champion Leader, joining with us in worship and acting as our human example of how to conform ourselves perfectly to God’s will. Catholicism has never seemed to unwind its medieval view of her as the compassionate Queen Mother who seeks mercy on our behalf with her perpetually enraged son, the King. Accordingly, the Catholics have placed her on a pedestal, out of reach, a person whose example we can never even strive toward because she was given the special gift of being sinless while the rest of us have to struggle with sin. The dogma of the Immaculate Conception, in fact, as a really good example of how the Catholic church ties itself up in knots with its own legalism. Once the church adopted the Augustinian view of Original Sin, it then had to backtrack and figure out how Mary fit into that picture, since Jesus, being divine, couldn’t inherit the sin of his parent. The church had painted itself into a corner and so had to exempt Mary from the stain of Original Sin. For the Orthodox, this isn’t a problem, because they teach that we only inherit the consequences of our ancestors’ sins rather than the stain of the sin itself. So Mary never needed to be exempted from anything. There are things I also dislike about Orthodoxy. One is closed communion, which I also don’t like in the Catholic church. But the big one for me is the ethnocentrism. If you aren’t a part of the ethnic in-group, it can be extremely difficult to fit in to an Orthodox church community. Even in churches where people are generally welcome, it still feels awkward to be in, say, a Greek Orthodox church, watching people of Greek heritage interact, eating Greek food after the liturgy, speaking in Greek to each other, while you’re someone of English descent. This is the one place where Catholicism has a tremendous advantage. As its name implies, it is a universal church. You can go to a Mass on any given day and see white people worshiping next to blacks, Hispanics, Vietnamese, what have you. Meanwhile, a Russian Orthodox church will be filled with mostly Russian immigrant families and their descendants. And if you’re not one of them, you’re often either ignored or viewed with suspicion. For now, I tend to worship in an Eastern Catholic church. The Eastern churches are in communion with Rome, so I can attend and receive the sacraments, but they use Orthodox liturgy, so I can feel the beauty of the Eastern way of worship. It feels a bit like sitting on the fence, and I know the Orthodox take a dim view of Eastern Catholicism, but for now, for me, it’s a means to an end. ",
            "date": "Answered April 20, 2019",
            "views": "43",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chiara Caruso",
                    "user_href": "/profile/Chiara-Caruso-2"
                },
                {
                    "user_id": "Simon Hopwood",
                    "user_href": "/profile/Simon-Hopwood-5"
                },
                {
                    "user_id": "Kaushik Reddy",
                    "user_href": "/profile/Kaushik-Reddy-24"
                },
                {
                    "user_id": "Pety Yanni",
                    "user_href": "/profile/Pety-Yanni"
                },
                {
                    "user_id": "Margaret Carter",
                    "user_href": "/profile/Margaret-Carter-2"
                },
                {
                    "user_id": "Alfred W Croucher",
                    "user_href": "/profile/Alfred-W-Croucher"
                },
                {
                    "user_id": "Perry Lee",
                    "user_href": "/profile/Perry-Lee-36"
                },
                {
                    "user_id": "John Psareas",
                    "user_href": "/profile/John-Psareas"
                },
                {
                    "user_id": "Vestrr Toon",
                    "user_href": "/profile/Vestrr-Toon"
                },
                {
                    "user_id": "Evan Joseph",
                    "user_href": "/profile/Evan-Joseph-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dermot Griffin",
                "href": "/profile/Dermot-Griffin"
            },
            "answer_text": "I am a cradle Catholic and have no desire of leaving the Church. Using simple logic however, I do in fact realize that whatever the Vatican says is not always true. The Pope knows he's not infallible whether you like him or not. I have a great interest in Orthodoxy and some people noticed that I have adopted some Orthodox Christian practices (such as saying the Jesus Prayer) and even some beliefs that their church holds (such as the Recapitulation theory of atonement). If you read up on the history of Christianity you will find that the Jesus Prayer is a universal Christian practice and that the Recapitulation theory of atonement is a universal Christian idea. These practices and ideas including the aforementioned are not strictly for followers of Orthodoxy. I have a fondness of the writings of Gregory Palamas, who developed \"Palamism\" (although the Orthodox do not call it this), and also compare them with the writings of Thomas Aquinas, who developed \"Thomism.\" I also venerate not only saints native to Catholicism (such as Francis of Assisi) but also venerate saints native to Orthodoxy (such as Theophan the Recluse) as well. So, what practices do I do that are \"Roman Catholic?\" Well, I attend Eucharistic adoration once a month. To me, this is sitting before the presence of God, being quiet and talking with Him. I use a standard set of rosary beads and, ironically, I do not say the actual \"Rosary\" much at all. The most important thing for me though is the ritual of the Mass. We can debate Eucharistic theology all day long whether your Catholic, Orthodox, or Protestant (I have a special place in my heart for George Fox and Evelyn Underhill) and let's just say that I take the Eucharist very, very personally and have my own opinion about it which differs from that of both the Catholic Church and Orthodox Churches. All and all, I believe that Christ becomes really present in some inexplicable way during Mass. When I receive Communion, I myself am becoming a Christ, a messiah for others. This whole process of Eucharistic theology whether you dub it Transubstantiation, Metousiosis, Sacramental union, Consubstantiation, or simply believe that there is a spiritual presence, is a divine mystery and should be left that way. Besides the Lord's Prayer, Hail Mary, and Jesus Prayer, I say certain natively Catholic prayers such as the Prayer of St. Francis (but I also say the Prayer of St. Ephrem if we can call that \"Orthodox\") along with attending the Way of the Cross during Lent. I also say the Serenity Prayer (some could call it \"Protestant\" but in the end a prayer is just a prayer) every night before I go to bed. ",
            "date": "Updated July 14, 2018",
            "views": "26",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kaustave Moni Baruah",
                    "user_href": "/profile/Kaustave-Moni-Baruah"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Elvis George",
                    "user_href": "/profile/Elvis-George-4"
                },
                {
                    "user_id": "Evan Joseph",
                    "user_href": "/profile/Evan-Joseph-29"
                },
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "Kathleen Pfeiffer",
                    "user_href": "/profile/Kathleen-Pfeiffer"
                },
                {
                    "user_id": "Teresa Dibitetto",
                    "user_href": "/profile/Teresa-Dibitetto"
                },
                {
                    "user_id": "Leonard Ghigu-Calin",
                    "user_href": "/profile/Leonard-Ghigu-Calin"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Adrian Rush",
                    "user_href": "/profile/Adrian-Rush-1"
                }
            ]
        }
    ]
}