{
    "title": "What is the effect of liberalization in India? - Quora",
    "tags": [
        "Liberalism (politics)",
        "Politics of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vibhas Mehta",
                "href": "/profile/Vibhas-Mehta-1"
            },
            "answer_text": "Massive employment due to the presence BPOs and other multinationals. Also, earlier there were few Indian companies who matched International standards with regards to the quality of services or products or working environment, but in the recent few years, maybe since a decade back we have seen a rise in Indian startups that are trying to imbibe all of the qualities of a good Multinational company. While these are the positive aspects, we have a long way to go. Just how many Indian companies are making their presence felt abroad? You can count them on your fingers! So we have just made a start. Also, some people consider this liberalisation, as a second comeback of Imperialism. The question is not just about the dollar to rupee aspect, but there are many factors. One more effect of liberalization is the pseudo culture, for example when I was working in San Diego based company, one of my colleagues wanted me to get him a pair of Levis jeans as I was going to visit my sister in the US. The next thing I see after my trip from the US was this colleague wearing his levis jeans so low that we could see his Calvin Klein underwear!! Nice way to show off…. But is this what is expected at a corporate environment? So, I think if we as a country want real progress, we should keep some of the above mentioned points in many mind. Thats all I could think of as of now. ",
            "date": "Answered June 16, 2018",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gopalakrishna Rao",
                "href": "/profile/Gopalakrishna-Rao-13"
            },
            "answer_text": "V BECAME LAZY FELLOWS. ",
            "date": "Answered May 27, 2018",
            "views": "17",
            "upvotes": "0"
        }
    ]
}