{
    "title": "What does “the end of history” mean? - Quora",
    "tags": [
        "Phrase Definitions",
        "English (language)",
        "History",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sophie Shulman",
                "href": "/profile/Sophie-Shulman"
            },
            "answer_text": "In 1992 Francis Fukuyama, an American political scientist, wrote an influential book \"End of History and the Last Man\"; ever since the term \"End of History\" is commonly used in his meaning - not to be misinterpreted as the end of everything, all the happenings and events in the universe, which is, of course, meaningless as it would have meant the end of Time, of everything unfolding in time that is being called 'History'.Fukuyama's central idea was that since the French revolution (17989) the human history has showed that the most progressive, hence the best, most viable social contract and political arrangement is the Liberal Democracy that will, therefore, iglobally nevitably prevail in a long run. And then everybody will live under an apolitical government capable of spreading equally all the political, economic, cultural etc achievments among the global population. No more wars, conflicts, peace on Earth, hence the 'end' of historical events as we knew them: the struggles, rivalry, hatred... as there will be no need in them. The book is very well written, easy to read.As we can say now (in retrospect in almost a quarter of century) the History has turned out to be anything but... just the opposite to the Fukuyama's forecast... ",
            "date": "Answered October 22, 2015",
            "views": "28",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Joseph Hunyadi",
                    "user_href": "/profile/Steven-Joseph-Hunyadi"
                },
                {
                    "user_id": "Adam Wesley",
                    "user_href": "/profile/Adam-Wesley-18"
                },
                {
                    "user_id": "David Wright",
                    "user_href": "/profile/David-Wright-403"
                },
                {
                    "user_id": "Siddhant Chimankar",
                    "user_href": "/profile/Siddhant-Chimankar"
                },
                {
                    "user_id": "Mung Awng",
                    "user_href": "/profile/Mung-Awng"
                },
                {
                    "user_id": "Abhishekh Allu",
                    "user_href": "/profile/Abhishekh-Allu"
                },
                {
                    "user_id": "Paul Bish",
                    "user_href": "/profile/Paul-Bish"
                },
                {
                    "user_id": "Gail Ellis",
                    "user_href": "/profile/Gail-Ellis-2"
                },
                {
                    "user_id": "Harshit Agarwal",
                    "user_href": "/profile/Harshit-Agarwal-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dennys",
                "href": "/profile/Robert-Dennys-1"
            },
            "answer_text": "In recent usage in public commentary, it refers to the thesis promoted by Francis Fukuyama in his 1992 book, The End of History and the Last Man. He claimed that driving engines of change throughout history would run out of steam once a truly stable and prosperous government ideology proliferated and supplanted all competitors; and that the fall of Communism meant that Western democratic capitalism was going to prove to be that victor. In fact, the failure of all post colonial and Islamic societys to embrace Americanism since the 90s shows that the theory has holes. ",
            "date": "Answered March 29, 2017",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hamano Akito",
                    "user_href": "/profile/Hamano-Akito"
                },
                {
                    "user_id": "Vincent Villaraza",
                    "user_href": "/profile/Vincent-Villaraza"
                },
                {
                    "user_id": "Dinesh Kumar",
                    "user_href": "/profile/Dinesh-Kumar-8210"
                },
                {
                    "user_id": "David Wright",
                    "user_href": "/profile/David-Wright-403"
                },
                {
                    "user_id": "Siddhant Chimankar",
                    "user_href": "/profile/Siddhant-Chimankar"
                },
                {
                    "user_id": "Paul Bish",
                    "user_href": "/profile/Paul-Bish"
                },
                {
                    "user_id": "Adam Hodgkins",
                    "user_href": "/profile/Adam-Hodgkins"
                }
            ]
        }
    ]
}