{
    "title": "What books published since 1950 will still be well known and widely read in the year 2212? - Quora",
    "tags": [
        "Non-Fiction",
        "History Books",
        "Literary Fiction",
        "Book Publishing",
        "Novels",
        "Literature",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Zimmerman",
                "href": "/profile/Fred-Zimmerman"
            },
            "answer_text": "This is an excellent question because of the depth of time involved. If you asked the same question in 1812 about books published from 1750 to 1812, a couple of patterns would emerge: the poetry has endured, but I don't see that happening with much, if any, of the poetry published from 1950 to 2012... maybe Rage, Rage... http://en.wikipedia.org/wiki/Do_not_go_gentle_into_that_good_night, Sylvia Plath, Ginsburg  (Howl)very little narrative fiction is still accessible to modern readers because of the transformation in culture and mindsetmagisterial works of history (Gibbon) endure as monuments, oft-viewed  but little-climbedWith that preface ... Lord of the RingsThe P.G. Wodehouse Jeeves novels written after 1950 (about half of them)The foundational works of science fiction... FOUNDATION, DUNE, and yes, Heinlein... STARSHIP TROOPERSThese are all fiction set in relatively timeless \"alt.universes\" that I hope will still appeal to some fragment of the population in 2212. I love Don Graham's nomination of THE HERBLOCK book, and I think it is fair to say that the Woodward oeuvre wll still be read in 2212 by historians, they will remain essential primary sources (one hopes, with named sources provided by the Woodward Archive...). Comic art in addition to HERBLOCK ... Charlie Brown -- timelessCalvin and Hobbes -- I think 9 year old boys will still be recognizable in 2212!THE AMAZING SPIDER-MAN (Superman will not last...)",
            "date": "Answered April 15, 2012",
            "views": "285",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alena Tihonova",
                    "user_href": "/profile/Alena-Tihonova"
                },
                {
                    "user_id": "Jeff Mackenzie",
                    "user_href": "/profile/Jeff-Mackenzie"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                },
                {
                    "user_id": "Vaibhav Tiwari",
                    "user_href": "/profile/Vaibhav-Tiwari-2"
                },
                {
                    "user_id": "Aryaman Fasciati",
                    "user_href": "/profile/Aryaman-Fasciati"
                },
                {
                    "user_id": "Arnon Davidovici",
                    "user_href": "/profile/Arnon-Davidovici"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                },
                {
                    "user_id": "James H. Kelly",
                    "user_href": "/profile/James-H-Kelly"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Menderson",
                "href": "/profile/Al-Menderson"
            },
            "answer_text": "A preponderance of American novels here and I guess that reflects the respondents birthplaces perhaps(without checking) and also there are a lot of obviously personal choices here which isn't what the OP asked in the question . I note someone has suggested 'Starship Troopers'...c'mon get real, Heinlen  might be remembered in 2212 but I bet it won't be for this, err 'masterpiece',.Stranger In A Strange Land perhaps but I doubt it. He'll be remembered the same way Trollope is remembered today and who amongst you has read Trollope? So back to the original question, hmm, I'll nominate Tolkien's LOTR because it consistently comes in at number one or close to it on peoples all time great lists but more importantly it's a harbinger isn't it, it popularised fantasy and an enormous industry survives to this day by endlessly churning out variations of the same theme. Harry Potter someone's nominated, I bet you it wont be there in a hundred years apart from it's historical placement; it's not The Wind In The Willows, generations of children will not be read to bed with it and it will date. It also will be remembered as an historical footnote in book sale figures. Quickly now I hear you say so with that, I'd guess they will still be teaching Lord Of The Flies at school and To Kill A Mockingbird, Tim Winton's books perhaps and Carey's  The True History of The Kelly Gang maybe, Catch 22 yes, maybe even Manzoni’s I Promessi Sposi.  Or Ken Saro-Wiwa's Songs in a Time Of War.Haven't even touched on the Chinese writers emerging and the many exciting Russian authors which brings to mind Aleksandr Solzhenitsyn Gulag Archipelago and One Day In The Life Of Ivan Denisovich,Salman Rushdie's works perhaps. I bet there will be some all time greatest Tweets to... ",
            "date": "Answered April 18, 2012",
            "views": "90",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alena Tihonova",
                    "user_href": "/profile/Alena-Tihonova"
                },
                {
                    "user_id": "Raymond Burch",
                    "user_href": "/profile/Raymond-Burch"
                }
            ]
        }
    ]
}