{
    "title": "What are the disadvantages of the Industrial Revolution? - Quora",
    "tags": [
        "Industrial Revolution",
        "Economic History",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Billings",
                "href": "/profile/Tom-Billings-8"
            },
            "answer_text": "First, we start with the *competent* definition of the continuing industrial revolution: \"When a society moves from allocating resources by custom and tradition (moderns read here, by politics) to allocating resources by markets, they may be said to have undergone an industrial revolution\" Arnold Toynbee-1884 This primacy of markets in allocating resources means that old affiliations of tribe, clan, and family are less able to show favor through allocating resources toward family members, whether children, adults, or the aged. This extends to political dynasties as well as on main street. The waves of reaction against the continuing industrial revolution are based in the emotional desire to extend just such resource allocations, when market allocations make that impossible. These waves of reaction, whether aristocratic, racist, socialist, Caliphate Revivalist, or “environmentalist”, seek to divert resources from market allocations to political allocations that satisfy the need of politicians to both make others dependent upon their power, and to make enough people happy that they can increase that power with little objection. These waves of reaction are a secondary result of the changes of the industrial revolution. Still, their assaults on industrial society, and the need to defend against them to preserve industrial society around the world, are a result of that continuing industrial revolution. ",
            "date": "Answered May 24, 2020",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Jordan",
                "href": "/profile/Steve-Jordan-24"
            },
            "answer_text": "Pollution(global warming anyone?) Social unrest(workers earn money but are unable to feed themselves if unemployed--subsistence farmers have food available unless there are crop failures; factory workers are vulnerable to the whims of rich owners). Advanced weaponry(the most devastating wars in human history were possible only by industrialized arms….the production and sale of which still plague the world today because it is so lucrative and pervasive.) ",
            "date": "Answered May 23, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Wainwright",
                    "user_href": "/profile/Peter-Wainwright-1"
                }
            ]
        }
    ]
}