{
    "title": "What happened in the year 1488? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Souhitya Sen",
                "href": "/profile/Souhitya-Sen"
            },
            "answer_text": "I’m not sure what exactly you want to know. I did a quick research regarding any major historical events taking place in the year 1488 and found the following one to be the most interesting- In 1488, Portuguese mariner Bartolomeu Dias became the first European to round the tip of Africa thereby coming in contact with the Indian ocean and opening the possibility of a sea route between Europe and Asia.  The previous overland link between Europe and Asia had been blocked by the Ottomans since 1450, so it was becoming necessary to find an alternative way, through the sea. Bartolomeu Dias, formerly a superintendent of the royal warehouses, was given the responsibility by Joao II, king of Portugal and he sailed off from the port of Lisbon in August, 1487 with 3 ships. He followed the route taken by his predecessor Diogo Cao who had reached up to cape cross in present-day Namibia. He left one of his ships with supplies behind near Angra do Salto, in present-day Angola along with 9 men to guard, and proceeded with the other two. In January 1488, as he attempted to sail off the coast of South Africa, faced fearsome storm and ordered to turn the ships south to about 28 degrees so that the southeast wind takes them around the tip of Africa to Indian ocean. The plan worked fine and they found themselves near a bay (present-day Mossel Bay), almost 300 miles east of cape of good hope. They faced stone pelting from the indigenous tribes from the shores and the crew members became reluctant to move further due to fear of lack of food supply. Bartolomeu appointed a council to decide on the matter and he was given the permission of proceeding for only 3 days more and then come back. 3 days later, he reached Kwaaihoek, near modern day port Elizabeth, on March 12, 1488. During his return, he spotted and mapped the southernmost point of Africa, Cape of Needles and the stormy second cape, “Cape of Storms”, which would later be named “Cape of Good Hope”. A decade later, he would accompany Vasco da Gama, up to Cape Verde and then return to Guinea having settled there a few years earlier. Vasco da Gama would go on to cross Indian ocean and reach Indian mainland in 1498.  Further reading: Bartolomeu Dias - Exploration - HISTORY.com More Events: Historical Events in 1488 ",
            "date": "Answered March 26, 2018",
            "views": "3",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guy Gayson",
                    "user_href": "/profile/Guy-Gayson"
                },
                {
                    "user_id": "Psychotic Joey",
                    "user_href": "/profile/Psychotic-Joey"
                },
                {
                    "user_id": "Dharun Aditya Senthilkumar",
                    "user_href": "/profile/Dharun-Aditya-Senthilkumar"
                },
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Valerie Rawlins",
                    "user_href": "/profile/Valerie-Rawlins-2"
                },
                {
                    "user_id": "Gitanjali Roy",
                    "user_href": "/profile/Gitanjali-Roy-1"
                },
                {
                    "user_id": "Anant Kumar",
                    "user_href": "/profile/Anant-Kumar-14"
                },
                {
                    "user_id": "Emmanuel-Francis Nwaolisa Ogomegbunam",
                    "user_href": "/profile/Emmanuel-Francis-Nwaolisa-Ogomegbunam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian O. Kastner",
                "href": "/profile/Ian-O-Kastner"
            },
            "answer_text": "Feb 3 Bartolomeu Dias discovers Mosselbaai (Angra dos Vaqueros)  Portuguese ExplorerBartolomeu Dias Feb 5 Roman catholic German emperor Maximilian I caught in BelgiumJun 11 Battle of Sauchieburn, ScotlandDec 15 Bartolomeu Dias returns to Portugal after becoming 1st known European to sail round the Cape of Good HopeThat’s about it, I think. It was a rather dull year. Source: https://www.onthisday.com/events/date/1488 ",
            "date": "Answered March 26, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randy Nino",
                    "user_href": "/profile/Randy-Nino"
                }
            ]
        }
    ]
}