{
    "title": "What is the difference between the modern period and the medieval period along with the ancient period? - Quora",
    "tags": [
        "Periodic Table",
        "Middle Ages (era)",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Othala Fehu",
                "href": "/profile/Othala-Fehu"
            },
            "answer_text": "Per Wikipedia, the links are clickable.Prehistory – Period between the appearance of Homo (\"humans\"; first stone tools c. three million years ago) and the invention of writing systems (for the Ancient Near East: c. five thousand years ago).Stone AgePaleolithic – is the earliest period of the Stone AgeLower Paleolithic — time of archaic human species, predates Homo sapiensMiddle Paleolithic — coexistence of archaic and anatomically modern human speciesUpper Paleolithic — worldwide expansion of anatomically modern humans, disappearance of archaic humans by extinction or admixture with modern humans; earliest evidence for pictorial art.Mesolithic (Epipaleolithic) – was a period in the development of human technology between the Palaeolithic and Neolithic periods.Neolithic – a period of primitive technological and social development, beginning about 10,200 BC in parts of the Middle East, and later in other parts of the world.Chalcolithic (or \"Eneolithic\", \"Copper Age\") – this period was still largely Neolithic in character, where early copper metallurgy appeared alongside the use of stone tools.Bronze Age – is not part of prehistory for all regions and civilizations who had adopted or developed a writing system.Iron Age – is not part of prehistory for all civilizations who had introduced written records during the Bronze Age.Protohistory – Period between prehistory and history, during which a culture or civilization has not yet developed writing but other cultures have already noted its existence in their own writings; the absolute time scale of \"protohistory\" varies widely depending on the region, from the late 4th millennium BCE in the Ancient Near East to the present in the case of uncontacted peoples.Ancient history – Aggregate of past events from the beginning of recorded human history and extending as far as the Early Middle Ages or the Postclassical Era. The span of recorded history is roughly less than five thousand years, beginning with the earliest linguistic records in the third millennium BC in Mesopotamia and Egypt.Classical antiquity – Broad term for a long period of cultural history centered on the Mediterranean Sea, comprising the interlocking civilizations of ancient Greece and ancient Rome, collectively known as the Greco-Roman world. It is the period in which Greek and Roman society flourished and wielded great influence throughout Europe, North Africa and the Middle East.Post-classical history – Period of time that immediately followed ancient history. Depending on the continent, the era generally falls between the years CE 200–600 and CE 1200–1500. The major classical civilizations the era follows are Han China (ending in 220), the Western Roman Empire (in 476), the Gupta Empire (in the 550s), and the Sasanian Empire (in 651).Middle Ages (also called Dark Ages) – Lasted from the 5th to the 14th century. It began with the collapse of the Western Roman Empire in 476 and is variously demarcated by historians as ending with the Fall of Constantinople in 1453, merging into the Renaissance and the Age of Discovery.Early Middle AgesHigh Middle AgesLate Middle AgesModern history – After the post-classical eraEarly modern period – The chronological limits of this period are open to debate. It emerges from the Late Middle Ages (c. 1500), demarcated by historians as beginning with the Fall of Constantinople in 1453, in forms such as the Italian Renaissance in the West, the Ming Dynasty in the East, and the rise of the Aztec in the New World. The period ends with the beginning of the Age of Revolutions.Late modern period – Began approximately in the mid-18th century; notable historical milestones included the French Revolution, the American Revolution, the Industrial Revolution and the Great Divergence.Machine Age (1880–1945)Age of Oil (after 1901)World War I (1914–1918)Interwar period (1918–1939)Roaring Twenties (1920–1929)Great Depression (1929–1939)World War II (1939–1945)Contemporary history – History within living memory. It shifts forward with the generations, and today is the span of historic events from approximately 1945 that are immediately relevant to the present time. For example, the Post-Modern movement (Soviet Union and United States, 1973–present)",
            "date": "Answered March 17, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Richter",
                    "user_href": "/profile/Matthew-Richter-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Richter",
                "href": "/profile/Matthew-Richter-2"
            },
            "answer_text": "Although I think the previous answers are very good, I think there is a slightly different interpretation that you may find useful. It should also be noted that these terms really apply to European history and are not universal throughout the world. The “ancient period” encompasses the period from before mankind developed technological skills through to when the Western World (essentially Europe) reached its first height of technological skill and started to slide backward. This is most commonly dated to 476 CE when the last Western Roman Emperor abdicated. The medieval period is defined by a loss if technological skill and increase in superstition. It ends as a renewed interest in scientific and philosophical thought start to take hold. There is less agreement on when the medieval period ends than with the ancient period. Some date it to the fall of Constantinople in 1453. Others, to the colonization of what became the Americas. Another choice is the beginning of the renaissance but that has its own set of complications. The modern period begins when the medieval period ends. As with the ancient period, the modern period is best characterized by the flowering and growth of science, technology, literature and art. ",
            "date": "Answered June 16, 2018",
            "views": "52",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nica Pogoy",
                    "user_href": "/profile/Nica-Pogoy"
                },
                {
                    "user_id": "Doãã Gãlãl",
                    "user_href": "/profile/Doãã-Gãlãl"
                },
                {
                    "user_id": "Deepjyoti Borkataki",
                    "user_href": "/profile/Deepjyoti-Borkataki"
                },
                {
                    "user_id": "Nikki Negi",
                    "user_href": "/profile/Nikki-Negi-7"
                },
                {
                    "user_id": "Soumya Sourav",
                    "user_href": "/profile/Soumya-Sourav-23"
                },
                {
                    "user_id": "Nevyl Doust",
                    "user_href": "/profile/Nevyl-Doust"
                },
                {
                    "user_id": "Trevor Fung",
                    "user_href": "/profile/Trevor-Fung-1"
                }
            ]
        }
    ]
}