{
    "title": "What is the best definition of 'corporate culture'? - Quora",
    "tags": [
        "Ritual Marketing",
        "Corporate Culture",
        "Corporations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Cook",
                "href": "/profile/Jonathan-Cook-18"
            },
            "answer_text": "A good introduction is the book Corporate Cultures by Terrence Deal and Allan Kennedy.  A more in-depth examination is the book The Cultures of Work Organizations by Harrison Trice and Janice Beyer.  In his book Organizational Culture and Leadership, Edgar Schien writes that, in order to connect cultural abstractions with concrete behavior in professional organizations, \"We must avoid the superficial models of culture and build on the deeper, more complex anthropological models.\"  He defines culture as \"a pattern of shared basic assumptions learned by a group as it solved its problems of external adaptation and internal integration\". Schien's definition of culture focuses on the cognitive aspect of culture - the \"assumptions\". This mirrors the lopsided work of marketers, who tend to emphasize messages and ideas over systems of behavior. To compensate for this bias toward abstractions of culture, it will be helpful managers to consider the patterns of culturally meaningful behavior in commercial settings, to apply the concepts of Ritual Marketing in both organizational management and consumer marketing. Culture is more of a frame of interpretation and understanding than a well-bounded object, so it's difficult to pin down what culture is not, except to say that culture, in corporations and elsewhere, is not something that can be reduced to quantitative measures. That's not to say that quantitative research cannot identify and track cultural factors in a corporate setting. Quantitative methods need to be a part of understanding corporate culture. However, culture is a complex, living, changing, holistic phenomenon, and so quantitative assessments of it will always be incomplete clues to a larger whole. Corporate culture is also not isolated. Corporations are embedded in larger cultures.  In our complex society, individuals code switch between cultural systems. This is as much true for corporate employees as it is true for consumers. ",
            "date": "Answered February 4, 2014",
            "views": "311",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kris-Gradz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bretton Putter",
                "href": "/profile/Bretton-Putter"
            },
            "answer_text": "There are numerous definitions for company culture: Nanoheal: Culture is what happens when the boss is not around. Wikipedia: Organizational culture encompasses values and behaviors that \"contribute to the unique social and psychological environment of a business. Hubspot: Culture is a set of shared beliefs, values and practices. Elaine Wherry: Culture = Artifacts + systems and values + truth. Henrik Kniberg: Culture is the stuff people do without noticing it. Kevin Goldsmith: Culture is the manifestation of the shared values of the organization as represented by the actions of its members. Edgar Schein the godfather of company culture defined it as “A pattern of shared basic assumptions that a group has learned as it solved its problems of external adaptation and internal integration, that has worked well enough to be considered valued, and therefore, to be taught to new members as the correct way to perceive, think, and feel in relation to those problems.” If you’re interested in understanding more about culture and culture decks check out my latest book. ",
            "date": "Answered April 11, 2019",
            "views": "144",
            "upvotes": "0"
        }
    ]
}