{
    "title": "What is coma? - Quora",
    "tags": [
        "Comas",
        "Human Brain",
        "Neuroscience",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krutikaa Jawanjal",
                "href": "/profile/Krutikaa-Jawanjal"
            },
            "answer_text": "1. Coma is a state of unconsciousness.2. A person in this state fails to respond to painful stimuli.3. The person does not initiate voluntary actions.4. There are some causes of coma namely, head injury, stroke, tumor, intoxication or even an underlying illness.5. Over 50% of comas are a result of brain trauma or disturbance in the brain circulatory system. Wikipedia, the free encyclopedia Coma - Wikipedia, the free encyclopediaIn medicine, coma (from the Greek κῶμα koma, meaning \"deep sleep\")[1] is a state of unconsciousness in which a person: cannot be awakened; fails to respond normally to painful stimuli, light, or sound; lacks a normal wake-sleep cycle; and does not initiate voluntary actions.[2] A person in a state of coma is described as being comatose. WebMD - Better information. Better health. Coma: Types, Causes, Treatments, PrognosisA coma is a prolonged state of unconsciousness. During a coma, a person is unresponsive to his or her environment. The person is alive and looks like he or she is sleeping. However, unlike in a deep sleep, the person cannot be awakened by any stimulation, including pain.More than 50% of comas are related to head trauma or disturbances in the brain's circulatory system. Mayo Clinic Coma - Mayo ClinicA coma is a state of prolonged unconsciousness that can be caused by a variety of problems — traumatic head injury, stroke, brain tumor, drug or alcohol intoxication, or even an underlying illness, such as diabetes or an infection. ",
            "date": "Answered October 7, 2015",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Asim",
                    "user_href": "/profile/Mohammad-Asim-84"
                },
                {
                    "user_id": "Angel Moreno",
                    "user_href": "/profile/Angel-Moreno-67"
                },
                {
                    "user_id": "Kumar Kapil",
                    "user_href": "/profile/Kumar-Kapil"
                },
                {
                    "user_id": "Vivek Agarwal",
                    "user_href": "/profile/Vivek-Agarwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Jacob",
                "href": "/profile/Nikhil-Jacob-13"
            },
            "answer_text": "In medicine, coma (from the Greek κῶμα koma, meaning \"deep sleep\") is a state of unconsciousness in which a person: cannot be awakened; fails to respond normally to painful stimuli, light, or sound; lacks a normal wake-sleep cycle; and does not initiate voluntary actions.  A person in a state of coma is described as being comatose  A comatose person exhibits a complete absence of wakefulness and is unable to consciously feel, speak, hear, or move.For a patient to maintain consciousness, two important neurological components must function. The first is the cerebral cortex—the gray matter that forms the outer layer of the brain. The other is a structure located in the brainstem, called reticular activating system (RAS). Injury to either or both of these components is sufficient to cause a patient to experience a coma Generally, a person who is unable to voluntarily open the eyes, does not have a sleep-wake cycle, is unresponsive in spite of strong tactile (painful) or verbal stimuli, and who generally scores between 3 and on the Glasgow Coma Scale is considered in a coma ",
            "date": "Answered March 11, 2016",
            "views": "855",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gegham Movses",
                    "user_href": "/profile/Gegham-Movses"
                },
                {
                    "user_id": "Sob Dragneel",
                    "user_href": "/profile/Sob-Dragneel"
                },
                {
                    "user_id": "Kosha Dand",
                    "user_href": "/profile/Kosha-Dand"
                }
            ]
        }
    ]
}