{
    "title": "What is the global scenario of Covid-19? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Yamin Raj",
                "href": "/profile/Yamin-Raj-1"
            },
            "answer_text": " The economic effects of a pandemic mainly depend on the extent to which countries are connected to global production networks. In this article, we include the production barriers caused by the COVID-19 shock in a Ricardian model with sector tires, semi-finished goods trade, and sector heterogeneity of production. We use the model to quantify the welfare effect of the product failure that started in China and quickly spread around the world. We note that the COVID-19 shock has a significant impact on most economies of the world, especially when some of its personnel are quarantined. In addition, we demonstrate that global production links play a clear role in amplifying the effect of the production shock. Finally, we show that the economic effects of the COVID-19 shock are heterogeneous across sectors, regions, and countries, depending on the geographical spread of industries in each region and country and their degree of integration into the global production network.  The COVID-19 pandemic and the future of globalization Rabat - The dizzying speed of the cross-border spread of the new coronavirus has exacerbated the problems of globalization. Closed borders, forced social distance and self-isolation, travel bans, paralyzed supply chains, and export restrictions have led many to wonder if globalization itself could be a victim. the pandemic. The global crisis we face in 2020 is the worst pandemic the world has known since the Spanish flu of 1918-1920 flooded the world and caused an unprecedented economic recession. In contrast to the 2008 global recession, when world leaders came together to save the global financial system from collapse, the coronavirus pandemic has not received a uniform and globalized response.  The impact of the COVID-19 pandemic poses a fundamental question: how will the pandemic affect globalization in the future? \"The health crisis associated with the COVID-19 epidemic should lead us to establish new decision criteria in terms of global economic governance,\" said economist Thomas Piquette. Globalization is currently in crisis, which is why the world needs to reform its goals and vision on the basis of social and humanitarian solidarity. The pandemic has hit both developed and developing countries and has seen EU countries' infrastructure collapse in light of COVID-19. In an analysis of Foreign Policy magazine, Richard Fontaine said that \"the nature of the next globalization phase of globalization will be the bigger issue against which many of the major political debates of the coming years will take place.\" The world needs to rethink the future of globalization because the pandemic will accelerate transformation. France and Germany have not only suspended cross-border travel but have also banned the export of face masks. In Europe, the isolationist policy, national self-protection policy appeared in the midst of the crisis. France and Germany have refused to supply medical supplies to the most vulnerable countries of the European Union, such as Greece, while Cuba has offered to help Europe fight the pandemic. Cuba's offer came despite continued sanctions and economic blockades, indicating that the European Union is no longer an example of solidarity or cooperation. The world is now confronted with a new form of \"non-united\" globalization between the countries of the north and the countries of the south. Another dangerous global trend that emerged during the pandemic is \"brutal\" economic globalization which marks the trade war between the United States and China, with each side trying to build a new international order.  However, the two superpowers have both proved unable to coordinate effectively on a large international scale due to the health crisis. It is certain that the coronavirus pandemic will lead the world towards a new architecture of globalization. In the absence of effective international coordination and international health solidarity, the industrialized countries in the field of medical biology have failed to eliminate a microscopic virus. Initially, the United States and Europe attempted to fight the pandemic by engaging in plumbing procedures, disrupting public life, and shutting down institutions and businesses, with the exception of the winning pharmaceutical companies. incredible sums, for economic reasons dictated by the \"wild neoliberalism\" which rules the world. Given the increase in the number of deaths, the United States and Europe have taken exceptional measures, similar to China. From closing internal and external borders, from travel bans, from the use of the military to the implementation of isolation measures, governments risk the lessons of their democracies. Maintaining social distance and self-isolation continues worldwide, although this may lead to the deterioration of democracy and human rights, the tendency to the tyranny of power, the collapse of markets and the global economic system, and the abandonment of certain principles of liberal thinking supporting the system of economic globalization. The global health crisis demonstrated the lack of international solidarity when states closed their doors to the outside world, or as sociologist Edgar Morin called it \"selfish closure\". Each country is confronted with a national challenge which once again increases the relationship between sovereignty and globalization. The countries have renounced part of their sovereignty in favor of globalization without translating this capitulation into economic and social solidarity. Meanwhile, the world is frightened and concerned about the widespread of the epidemic in Third World countries, particularly in Africa. The pandemic could be a breakthrough for poor countries with limited resources and people in conflict zones. In an analysis for Bloomberg, Robert Kaplan said, “The second stage of globalization is different. Globalization 2.0 is about dividing the world into powerful blocs with their own fledgling armies and separate supply chains, about the rise of autocracies and the social and class divisions that caused nativism and populism, combined with fears of the middle classes in western democracies. For some, it is a story of new and re-emerging world divisions, kinder to the pessimists. \"  The coronavirus pandemic will mark potential global economic, political, and geopolitical turmoil in the coming decades. Consequently, we hope that the world will have the possibility of implementing a new model of globalization and an alternative international system that pushes the world economy towards solidarity and a form of fair globalization for the benefit of humanity. Such reform can also put an end to corrupt neoliberalism and encourage world leaders to adopt sustainable development rules to deal with potential environmental and epidemiological threats. The pandemic will certainly highlight the risks inherent in excessive dependence on global supply chains, lead to a renationalization of production and put a new emphasis on the idea of ​​international interdependence. The likely result is an acceleration of long-standing changes towards a new, different, and more limited form of globalization. The challenge for the future is even to steer the international order in the right direction by regulating and easing the burden of globalization. However, this requires enhanced international cooperation. The threat of the pandemic has caused a global crisis, it is vital that the world create mechanisms to respond to the disease with effective international solidarity and united society.  COVID-19: What is the future of globalization? In recent weeks, we have tried to look at the challenges of the globalization process from different angles. (Express illustrations) The economic crisis that has besieged the world since the start of the Covid-19 pandemic has raised some questions about the future of globalization. Several Western commentators have questioned whether the pandemic would pose a threat. This is not a new question: since the mid-1990s, or since its inception, many have questioned the future of globalization. The \"great recession\" of 2008 raised new doubts about this, some of which reduced the problem to financial globalization. Uncertainties about the future of globalization have arisen as a result of the disruption caused by the 'major lockdown' in all major economies except China. The continuing unrest is reminiscent of the 'Great Depression' of the 1930s when most economies became protectionist. In this context, the likely impact of the \"large freeze\" on world trade volumes is another worrying sign. The World Trade Organization had predicted that world trade volumes could fall by 13 to 32% in 2020. The worst scenario of declining trade volumes in the WTO is far worse than the impact of the \"Great Depression\" on trade; between 1929 and 1932, trading volumes decreased by almost 25%. In recent weeks, we have tried to look at the challenges of the globalization process from different angles. Several commentators have argued that the global economy is experiencing a \"slowdown\" or even a \"globalization phase\", but these trends should not mean the end of globalization. Others have pointed out that the global economy faces multiple challenges, not least because of the intense economic rivalry between the United States and China, as the two countries sought to gain importance. How serious would all these developments be for the future of globalization that the world has known for at least three decades?  There is no doubt that globalization did not inspire much confidence, as many of the professed virtues were not entirely clear. The process was to create a robust global economy that in turn would benefit all participating countries. However, that expectation was far removed as the global economy struggled to overcome the remnants of the \"great recession.\" In the five years prior to 2008, the global economy had grown by more than 5% annually, but between 2010 and 2019, expansion had declined to 3.8% and had declined to just over 3% in the past five years. The most worrying aspect of globalization is that major economies are showing signs of decoupling from the global economy. For all major advanced and emerging economies, their trade-to-gross product (GDP) ratios, an indicator of openness, have declined. The largest trader, China, has emphasized this trend. In 2008, China's trade-to-GDP ratio was close to 58%, but ten years later it was barely 38%. India also showed a similar trend, with the trade / GDP ratio reaching nearly 56% in 2012, but dropping to 43% in 2018. Another indicator of decoupling is the contraction of global value chains (GVCs) or production networks.  Global value chains have characterized the era of globalization as production lines have been cut and cut across national borders, increasing interconnection between countries. Data from the Organization for Economic Cooperation and Development (OECD) shows that between 2005 and 2015, exports from the main advanced and emerging economies were more based on national value-added, or in other words, the import content of exports decreased. For example, the national content of Chinese exports reached nearly 74% in 2005 and increased to 83% in 2015. Members of the Association of Southeast Asian Nations (ASEAN), one of the most involved in global value chains, have also gradually but surely increased their dependence on domestic suppliers to fuel their exports. If the untying of economies and world markets were to undermine the globalization process, the political responses of several countries to save their economies in the depths of the current crisis would certainly pose greater threats. The United States was at the forefront of the CARES Coronavirus Aid, Relief and Economic Security Act, which generated $ 2.2 trillion, or about 10% of the country's GDP, economy. Subsequently, several US agencies announced a multitude of programs, all of which aim to revive national companies. The intention of these agencies is to support these companies to enable them to compete with China in the world market, but the factor that could raise the alarm for globalization is the revival of the Chinese economy long before the other major economies cannot return. normality. It is therefore entirely possible that China could further strengthen its position in the world economy. If this possibility really becomes a reality, would traditional advocates of globalization accept the new standard?  Some thoughts on COVID-19 and globalization Since the beginning of the globalization of COVID-19, the buzzword has become a buzzword again. Many claims that COVID-19 caused de-globalization. Others claim that globalization started even before COVID-19. A closer look at these arguments shows that demoralization largely means the end of neoliberal globalization. However, the alternative interpretation of globalization suggests a different conclusion. While many recognize that globalization has been around for centuries, the discursive explosion of the term globalization in the social sciences coincides with the end of the Cold War. (James and Steger, 2014) The end followed by the third wave of democratization, the neoliberal restructuring of the so-called Third World countries, China's integration into the WTO, and the pursuit of the elimination of trade barriers in various parts of the world for research into globalization. (Huntington 1991; Fukuyama 1992; Harvey 2005; Friedman 2006;) Suddenly globalization became a buzzword in the social sciences in the 1990s. (James and Steger, 2014) In the early 1990s, the United States, its allies, and primarily self-conceived international organizations such as the IMF, World Bank, and WTO, played a more important role than any other actor in technical mechanisms to articulate global flows of services, goods, labor, and capital. , entrepreneurship, and knowledge. For example, there was substantial agreement among the researchers about the interpretation of globalization as Westernization, Americanization, new imperialism, or modernization among others in the early 1990s. (Sen 2002) As social scientists reflect the main patterns From the evolution of their time, it seems that a brief period of priority for the United States and its allies in world affairs has influenced the terminology researchers to use in their research on globalization. Since globalization has been widely interpreted as a phenomenon orchestrated by the West and concerns unilateral flows, forced convergence and economic restructuring (assimilation, clash of civilizations, dissemination, erosion, etc.) have also become the buzzwords of studies on globalization. (Huntington 1993)  Others have interpreted globalization as a unique natural process or as \"the end of history\". (Fukuyama, 1992) The best-selling books of the period \"The third wave: democratization in the late 20th century\" by Huntington and later in the early 2000s \"The world is flat: a brief history of the 21st century\" by Friedman is the product of the same concept of globalization. The rationality or general belief behind this conceptualization was the victory of liberal democracy over monarchism, fascism and communism was the last synthesis of the Hegelian dialectic. (Macintosh, 2015) As a result, the further expansion of liberal democracy and the neoliberal reform of the world economy have become a modus operandi. (Harvey, 2005) Since neoliberal globalization is interpreted as inevitable, structural adjustment programs have proven to be the only way to appropriate them. As a result, the countries of Latin America and Africa have become the object of painful structural adjustment programs, which have largely failed. (Harvey, 2005)  The “rapid rise of the rest” (India, China, Brazil, and South Africa), the enlargement and further consolidation of the EU as a global player, and the revival of Russia in the 2000s reflect on academics about globalization. (Zakaria 2009; Amsden and Alvin 2002) \"allegedly\" a sponsor of globalization - the United States has turned out to be the losers, while others like China have emerged as a beneficiary and have presented a real challenge to American hegemony. Multipolarity has prevented the interpretation of globalization as an irresistible force for transformation emerging from a single-center because no country had (had) the means to articulate the objectives of globalization. The “rise of the rest” has also led to changes in global formats to tame globalization. As a result, G7 has been restored to G8, G8 has become G20 and G20 has been replaced by G77. (Gordon 2011) The academic community has also responded to these tectonic changes. Reflecting on the transformations of the terrain, the terms associated with the interactive and cooperative production of globalization and the particularities of current multipolarity (interaction, cultural exchange, multiculturalism, and knowledge transfer) have been used to study globalization.  Research on contemporary globalization generally departs from earlier normative statements about the nature of globalization. With this in mind, it avoids answering the question of whether globalization is a bad thing or a good thing. Today, globalization is not treated as a perverse force organized from a single center to erase national borders, destroy economies, and level cultural and social norms. He is also not portrayed as a virtuous man who offers well-being to everyone connected to his network. Rather, it is interpreted as a phenomenon that offers both opportunities and threats. According to current understanding, globalization is not somewhere above us, out of human control, but rather a complex matrix of interactions and a network of flows that are manageable. American economist Stieglitz, a Nobel Prize winner, said: Countries that have managed globalization themselves, like those in East Asia, have generally ensured that they have achieved huge benefits and that these benefits have been distributed equitably; they were able to significantly control the conditions in which they found themselves facing the world economy. (Stiglitz 2017, p. 12)  Raphael Kaplinsky also recognizes the agencies of the various actors in the globalization of production by declaring: \"Globalization is the deliberate pursuit of objectives - whether personal, economic, social or political - which enable individuals, institutions and countries to continue operating around the world. the whole world is expanding borders. \"(Raphael Kaplinsky 2005, p. 32). In a similar context, Van de Graaf and Zelli challenge the idea of ​​the global energy problem: The existence of different energy frameworks and worldviews reminds us that \"the\" global energy challenge does not exist; instead, there are many different energy issues, and the priorities and considerations involved reflect different worldviews and values. (Van de Graaf and Zelli, 2016, p. 50) What is going on around the world during the COVID-19 pandemic is more likely to find a better way to manage globalization than de-globalization. In this spirit, proclamations such as \"America First\", \"multilateralism\", \"multiculturalism\", \"pragmatism\" and projects such as \"Belt and Road\", BRICS and many others, and relational strategies to tame globalization compete with each other. Ultimately, the form of globalization in the coming decades will depend greatly on this policy being proposed today. COVID-19 has just made us focus on the processes that have taken place in recent decades.x` ",
            "date": "Answered June 28, 2020",
            "views": "930",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjit Bakshi",
                    "user_href": "/profile/Sanjit-Bakshi-7"
                },
                {
                    "user_id": "Nisha Parmar",
                    "user_href": "/profile/Nisha-Parmar-74"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yogesh Tak",
                "href": "/profile/Yogesh-Tak-3"
            },
            "answer_text": "Current forecasts call for international flows to start growing again as the pandemic comes under control. Thus, 2020 is likely to be a low point for many globalization metrics. But how deep will the plunge really be? How fast can we expect global flows to rebound? And how might future flow patterns look different from the past? None of these questions can be answered definitively yet, but leaders can find clues about the future and actionable implications for their companies by focusing on five key drivers of globalization’s trajectory: 1. Start with global growth patterns, where the key lesson is that international flows tend to swing dramatically with macroeconomic cycles. In good times, they usually grow faster than GDP, and in bad times they shrink faster, too, as people and firms hunker down behind borders. 2. Supply chain policies have come back to the top of the agenda, and shifting approaches have the potential to reshape trade and FDI flows. The key globalization-related debate here is redundancy versus reshoring. Will companies and countries seek greater safety in international diversification, or will they try fostering domestic self-sufficiency? Economic logic almost always favors the former approach, coupled with national stockpiles for true essentials, but politics will sometimes force the latter. 3. Superpower frictions and fragility had already destabilized the international business environment before Covid-19, and the pandemic adds new layers of complexity. It has led to a vast expansion of state power, while introducing pandemic control as yet another arena for ideological competition. In this environment, where companies come from and how well their home country governments get along will matter even more than before to decisions about where to raise capital, which markets to prioritize, and which supply bases to cultivate. 4. Ongoing technological shifts such as the adoption of e-commerce, videoconferencing, and robots have all been supercharged by Covid-19. Before the pandemic, many focused on how new technologies could reduce global flows, e.g. via manufacturers substituting robots at home for low-cost labor abroad. But many pandemic-induced shifts could also strengthen globalization if they are not curbed by protectionist policies. Cross-border e-commerce expands export opportunities, especially for smaller companies. Forced experimentation with remote work, where successful, could spur more services offshoring. And even 3D-printing sometimes leads to more rather than less trade. 5. Public opinion about globalization may take another negative turn due to Covid-19, scaling back the surprisingly strong support for trade and immigration reported in recent polling. More international travel does accelerate the spread of infectious diseases, and economic stress could boost calls for trade protectionism. While robust public health strategies do not require ongoing barriers to globalization, nationalist politicians will point to the pandemic and failures of international coordination in the response to fortify opposition to globalization. Customers and employees increasingly expect corporate leaders to take a stand on social issues, making public opinion about globalization a potential management issue. The blending of anti-globalization and anti-capitalist movements further complicates the role of business in the public debate about globalization. And leaders of multinational corporations face the special challenge of public and government engagement across national divides. Focusing on facts, becoming more sensitive to inequality, and emphasizing real economic contributions can help to support a healthier globalization debate. In conclusion, Covid-19 looks like a “bend but won’t break crisis” for globalization. International flows are plummeting, but globalization — and opposition to globalization — will continue to present business opportunities and challenges. Careful attention to the drivers of globalization’s future can help companies navigate through and even profit from globalization’s turbulence. A volatile world of partially connected national economies expands possibilities for global strategy even as it complicates the management of multinational firms. Now is the time for global corporations to show their value by harnessing the best of the world’s capabilities to end the pandemic and bolster the recovery. ",
            "date": "Answered June 28, 2020",
            "views": "152",
            "upvotes": "0"
        }
    ]
}