{
    "title": "What are some Slavic first names? - Quora",
    "tags": [
        "Slavic Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomislav Perusic",
                "href": "/profile/Tomislav-Perusic"
            },
            "answer_text": "In the Balkans, any name containing slav in it (as in my case): Tomislav, Branislav, Miroslav, Radoslav, Borislav, Vjekoslav, Mislav, Dragoslav, Svetislav, Stanislav, Slaven, Slavko, and also female versions of these names: Tomislava/Tomislavka, Stanislava, Slavenka, Slavica and so on; Many names (not all) containing mir in it: Zvonimir, Krešimir, Ljubomir, Čedomir, Radomir, Želimir, Tolimir, Branimir, Mirko, Mirna (female), Mira (f.), Miroljub, Velimir, Miomir etc. Names containing –ko or –ka (female) as a suffix: Žarko, Ratko, Veljko, Rastko, Željko, Jerko, Borko, Boško, Danko, Stanko etc. Names containing bor: Velibor, Borna, Bora, Borka (f.) Also, names containing ljub, rad, milo/mila, sav, stan; Names containing –dan: Bogdan, Slobodan, Radan, Gordan; Many names ending in –an or –ana (female): Goran, Zoran, Dušan, Vidan, Dragan (excluding Biblical names that took up the same suffix such as Ivan/Jovan, Stefan/Stjepan) and their female versions (Snežana – I think the male version Snežan isn’t used since Snežana is a translation of Snow White – Gordana, Zorana, Dragana, Mirjana etc.) ",
            "date": "Answered September 16, 2020",
            "views": "516",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vidak Nikic",
                    "user_href": "/profile/Vidak-Nikic-1"
                },
                {
                    "user_id": "Julian Fejzo",
                    "user_href": "/profile/Julian-Fejzo"
                },
                {
                    "user_id": "Endri Cara",
                    "user_href": "/profile/Endri-Cara-2"
                },
                {
                    "user_id": "Jonathan Griffiths",
                    "user_href": "/profile/Jonathan-Griffiths-64"
                },
                {
                    "user_id": "Srdjan Malinic",
                    "user_href": "/profile/Srdjan-Malinic"
                },
                {
                    "user_id": "Llazar Gjermeni",
                    "user_href": "/profile/Llazar-Gjermeni"
                },
                {
                    "user_id": "Yllzon Ymeri",
                    "user_href": "/profile/Yllzon-Ymeri"
                },
                {
                    "user_id": "Arber Krasniqi",
                    "user_href": "/profile/Arber-Krasniqi-18"
                },
                {
                    "user_id": "Peter Pang",
                    "user_href": "/profile/Peter-Pang-42"
                },
                {
                    "user_id": "Dritero Ferri",
                    "user_href": "/profile/Dritero-Ferri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Jurníček",
                "href": "/profile/Jan-Jurníček"
            },
            "answer_text": "Czech calendar names of the Slav origin: Mečislav(a), Radomil/Radmila, Dalimil(a), Čestmír, Vladan(a), Břetislav(a), Bohdan(a), Pravoslav(a), Radovan(a), Ctirad, Ctislav, Drahoslav(a) (Drahoš), Vladislav(a), Doubravka, Běla, Slavomír(a), Zdeněk, Zdeňka (Zdena), Milena, Zdislav(a), Hynek, Blažej, Jarmila, Dobromil(a), Vanda (from the Polish name Wanda), Milada, Mojmír(a), Božena, Slavěna, Věnceslav(a), Ljuba, Miloslav(a), Miloš, Milorad, Oldřich, Oldřiška, Lenka (it’s etymology is unclear: it may be a domestic form of the name Helena or Magdalena), Svatopluk, Svatobor, Lumír, Horymír, Vladivoj, Miroslav(a), Kazimír(a), Růžena (Czech form of the name Rosa), Vlastimil(a), Světlana, Radek, Radka (Radoslava), Zbyslav, Slavomil, Veleslav, Vendula, Dušan(a), Rostislav(a), Vojtěch, Jaroslav(a), Jarolím, Vlastislav(a), Blahoslav(a), Radoslav (Radislav), Stanislav(a), Zlatan (Zlatomír), Zlata (Zlatoslava), Ctibor(a), Blažena, Svatava (Svatoslava), Přemysl, Zbyšek, Zbyška, Vladimír(a), Jarmil (Jaromil), Dalibor(a), Dobroslav(a), Slavoj, Zbyněk (Zbyhněv), Milan(a), Květa (Květuše), Květoslav(a), Květomila, Ladislav(a), Lubomír(a), Šárka (Czech female name of very old and obscure origin: Šárka (name) - Wikipedia), Radomír(a), Spytihněv, Bohuslav(a), Libuše, Bořislav (Bořek), Bořivoj, Luboš, Drahomír(a), Vítězslav(a), Věroslav, Ludomír, Miluše, Lada, Soběslav, Radim, Luděk, Vladěna, Bronislav(a), Boris, Boleslav(a), Lubor, Jolana (Jolanta), Ludmila, Naděžda, Jaromír(a), Václav(a), Bohumil(a), Věra (Věroslava), Havel (but it is of Latin origin and means “the inhabitan of Galia”, Gal; similarly Galina/Halina), Vojmír, Liběna, Bohumír(a), Bohdan, Mahulena (perhaps this name originated artificially), Svatoslav (Svatomír), Vratislav(a), Radan(a), Vlasta. ",
            "date": "Answered September 13, 2020",
            "views": "9",
            "upvotes": " Answer requested by Jonathan Griffiths"
        }
    ]
}