{
    "title": "What is history based on? - Quora",
    "tags": [
        "Website Browsing History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean McHugh",
                "href": "/profile/Sean-McHugh-9"
            },
            "answer_text": "What is history based on? Too profound a question to be answered at a length of less than a book. This is a live question for debate especially amongst those who study history at the highest level. I suggest that we should approach the question as an analogy: in anyone’s own experience pf life there are relevant incidents at different times in the cycle of life, which may be evaluated differently at different times of life. In the same way students of history until very recently would accept only a very narrow category of evidence: state-produced written documentation by and large. This has now been replaced by almost a free rein. Anything and everything is accepted if you can justify it and double check it, preferably in another and different strand of evidence. So current history may be said to be based on everything and nothing. ",
            "date": "Answered July 3, 2018",
            "views": "71",
            "upvotes": " Answer requested by Jim King"
        },
        {
            "author_info": {
                "name": "Peter Thomson",
                "href": "/profile/Peter-Thomson-9"
            },
            "answer_text": "Written histories, of course (from Herodotus to the modern day). But also documents (accounts, charters, laws..) inscriptions, graffiti, archeology and whatever else might shed light. So we know of events in classical Athens not just from the histories, but also from statues, law speeches, boundary stones, dedications, archaeological digs, scribbles on walls, mentions in literature..Older histories focus on political and military events - very much the winner’s stories. More recently, there has been an effort to recover a wider range - women, the lower classes, foreigners - so called “subaltern history”. ",
            "date": "Answered July 4, 2018",
            "views": "52",
            "upvotes": " Answer requested by Jim King"
        }
    ]
}