{
    "title": "What are the best resources to learn about archaeology? - Quora",
    "tags": [
        "Learning About Archaeology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Paul",
                "href": "/profile/Richard-Paul-31"
            },
            "answer_text": " Before you start learning archeology, you need a solid knowledge about all epochs of human history from the very beginnings.   Once you have a general overview about the evolution of mankind and the great empires, you should also have knowledge in ethnology and geology as well. You should understand on how humans come together and organized themselves from the very beginning. And you should understand why a mountain chain is there and not elsewhere.  At that point, you should read a basic book on archeology like \"Archeology for Dummies\". Perhaps now you will consider alternatives like history, anthropology or linguistic too.  You can't be skilled in all regions worldwide,  you had to focus on one continent, one empire or one epoche. Often you need language skills too, like Latin, Greek or Ancient German. They are hard to learn and in everydays live useless.  The great problem with archeologist today is, that they rarely are skilled in anything. They grew up collecting their food in supermarkets and living in heated apartments. They have now idea about the live of people thousands of years ago however many books they will read about. Therefore, any practical experience you may get is useful to your research. ",
            "date": "Answered February 27, 2015",
            "views": "746",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Hrahsel",
                    "user_href": "/profile/Eric-Hrahsel"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                }
            ]
        }
    ]
}