{
    "title": "What if I can travel back in time to 1870 in the USA, find a pretty girl to have a relationship with, and take her with me back to the future to present day USA? - Quora",
    "tags": [
        "Time Travel Scenarios",
        "Hypothetical Scenarios",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew P.S. Allen",
                "href": "/profile/Andrew-P-S-Allen"
            },
            "answer_text": "Be prepared for her to have a mental collapse, even if you take her to the backwoods she will still be rammed face first into modern technology. Remember the telegraph and more code was the fastest way to communicate over any sort of distance so what will she make of mobile phones, radio, television. Nobody even dreamed of stainless steel. Electricity? Interesting toy. Remember the light bulb, though invented earlier, was only patented in 1879. Plastic? What's that? Your vehicle? Where are the horses? Where are the steam and rails? What makes those lines across the sky? Airplanes? What are they? How do you think she will cope? She will need ten years of education just to start to understand what is going on. ",
            "date": "Answered February 22, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Swan",
                "href": "/profile/Bill-Swan-4"
            },
            "answer_text": "What if. The pretty girl part sounds attractive, so why not? You might hope that she does not age on the return trip. Maybe you would create the paradox of marrying your great-grandmother. The one who disappeared about 1870, and thus never met your great-grandfather. … and. What’s that? You are your own great-grandfather? Who knew? ",
            "date": "Answered February 22, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jinghao Yan",
                    "user_href": "/profile/Jinghao-Yan"
                }
            ]
        }
    ]
}