{
    "title": "What countries were involved in the Silk Road? - Quora",
    "tags": [
        "Silk Road (online market)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Winter",
                "href": "/profile/Andrew-Winter-54"
            },
            "answer_text": "Okay. The “Silk Road” begins in Northern China, near Beijing. Feeding Beijing was a “silk industry” that may have been spread out as far as Korea and Japan, maybe. So the countries along the silk road include. Mongolia, Afghanistan, Iran, modern Iraq and Syria. In Syria the silk road divided up and served multiple terminal points including Egypt, Syria, Jerusalem, Turkey, and the Byzantine Empire at Constantinople, which lasted until the Turks finally conquered that city in the 15th century. That even officially closed the Silk Road to any and all trade from Western Europe. This, in turn, sparked the Portuguese under Henry the Navigator to explore sea routes around the continent of Africa, which was the beginning of “The Age of Discovery”. Sorry, but everything is connected in this world and it was fun to go there. ",
            "date": "Answered February 20, 2020",
            "views": "425",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jim-Dolan-Farmer"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Can Hacıoğlu",
                "href": "/profile/Can-Hacıoğlu"
            },
            "answer_text": "Please check the map:  The red lines are showing the main Silk Road on the ground and blue lines are showing the main Silk Road on water. There was secondary roads too especially on the western end. Many ports ( from Trebizond to Alexandria almost all Black Sea, Marmara Sea, Aegean Sea and Mediterranean Sea port used for end ) are the ending of the ground Silk Road. At these ports, European Continental Merchants come into play and therefore their routes are not included in the Silk Road. So present time, China, India, Bengaldesh, Tajikistan, Uzbekistan, Turkmenistan, Pakistan, Iran, Iraq, Syria, Turkey, Lebanon, Israel and Egypt are on the Silk Road on ground. China, Vietnam, Phillipines, Singapore, Malaysia, Indonesia, Thailand, Myanmar, Bengaldesh, India, Sri Lanka, Pakistan, Oman, Yemen, Somalia, Saudi Arabia, Sudan, Eritrea, Djibouti, Kenya, Tanzania, Egypt, Turkey, Greece, Cyprus and Italy are on Silk Road on water. I hope my answer helps you. ",
            "date": "Answered February 21, 2020",
            "views": "327",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}