{
    "title": "What are some underrated turning points in history? - Quora",
    "tags": [
        "Underrated Things or People",
        "Important Life Lessons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelsey L. Hayes",
                "href": "/profile/Kelsey-L-Hayes"
            },
            "answer_text": "In the spirit of having just watched “The King,” I’ll say: the death of Edward, Duke of York at Agincourt in 1415. These types of “one guy lives or dies” hypotheticals are pretty common, it’s true, but I can’t recall ever seeing one with Edward as its focal point. Buckle up, this is a wonky one. Edward was the son of Edmund of Langley, the fourth of Edward III’s sons to grow to adulthood. Edward’s younger brother was Richard, Earl of Cambridge, whom Henry V had put to death over the Southampton Plot. The Southampton Plot’s aim was to replace Henry V with Edmund Mortimer, another descendant of Edward III who had been the heir presumptive of Richard II. The Mortimers were descended from Lionel of Antwerp, Edward III’s second son, while Henry IV’s line (and thus Henry V’s) descended from John of Gaunt, the third son, and thus they came from a more junior branch of Edward III’s family (Henry IV essentially ignored — and had the backing to ignore — the Mortimer claim when he deposed Richard II; it helped that Edmund Mortimer was a little kid when this happened). Anyway, Mortimer spilled the beans on the Southampton conspiracy to Henry V, and Cambridge and a few others got the chop. With me so far? Edward, Duke of York did not fall from grace when his brother did. Instead he went to France with Henry V’s forces and, as I said at the beginning, died at Agincourt. He died childless (more specifically, son-less, as only a son would have inherited the dukedom), in his early 40s. Now, it isn’t a given that he would have been able to father children had he survived the battle, but it’s not out of the question that he could have. Dead men aren’t fathering children, but 40somethings who survive a battle still have a chance or two, yes? Edward dying, and dying childless, was a game-changer. Remember Richard, Earl of Cambridge, Edward’s brother who was beheaded for trying to put Edmund Mortimer on the throne? Mortimer wasn’t just Richard’s cousin. He was also his brother-in-law. Edmund Mortimer’s sister, Anne, was married to Richard, Earl of Cambridge. She and Richard had two surviving children, a boy and a girl, before Richard got the chop. The boy, another Richard, became the new Duke of York when his uncle Edward died childless at Agincourt (Richard’s father’s crime didn’t prevent him from getting the dukedom). More than that, Edmund Mortimer died childless himself, in 1425. So Anne and Richard’s son Richard — who had already inherited the York dukedom at the ripe old age of 4 — inherited the Edmund of Langley-based claim to the throne (through his father), and the Lionel of Antwerp-based claim (through his mother), and the Mortimer estates from this second uncle who had died childless. It was the Lionel of Antwerp claim that now technically made the Yorks a higher-level branch than the Lancasters, and helped them make their dynastic case in the eventual Wars of the Roses. Edmund Mortimer had been a loyal official to the Lancastrians and didn’t really press his superior claim; his nephew’s family lacked that compunction. (Richard’s rival for power and influence in Henry VI’s government, John Beaufort, Duke of Somerset, was descended from John of Gaunt and his third wife Katherine Swynford. The Beauforts were legitimized bastards who were barred from the succession by Henry IV. Nonetheless, it was the Beaufort descent that gave the future Henry VII his claim to the throne, apart from the conquest angle. The John Beaufort who sparred with Richard, Duke of York was Henry VII’s maternal grandfather.) Any son that Edward, Duke of York had fathered after Agincourt if he had survived who could have inherited the dukedom instead of his nephew would not have had that superior claim through Lionel of Antwerp, which, again, Richard inherited only because of his mother being a Mortimer. Nor would Edward’s children have inherited all that Mortimer wealth and prestige to help rally support. But Edward’s nephew Richard was something of a mega heir. Richard made things even mega-ier for his own children, by marrying Cecily Neville, whose father’s ward he had been. Cecily was also of Beaufort descent, meaning that her children with Richard were descended from three different sons of Edward III. The Nevilles themselves were a prominent noble family in their own right (Warwick the Kingmaker was Cecily’s nephew). Two of Cecily and Richard’s sons are men you’ve probably heard of: Edward IV and Richard III of England. All of that is to say that without Edward, Duke of York dying at Agincourt, the Wars of the Roses are unlikely to have played out in the way that they did, if they played out at all. His nephew’s double inheritance from two different uncles was a bit of lightning in a bottle; it’s also possible that had Edward lived, even if his nephew Richard still inherited the dukedom eventually, it would have been under different circumstances, and Richard may have married someone altogether different than Cecily Neville (Ralph Neville might have not still held Richard’s wardship, which is what gave him the opening to make that betrothal for his daughter). While Edward’s death isn’t really tied causally to other deaths in the family (insofar as I can tell), a “butterfly effect” situation might have nonetheless been at work. Maybe Henry V lives longer, and Henry VI doesn’t become king until he’s older and more prepared, preventing poisonous rivalries like that between the Yorks and the Beauforts. Maybe John, Duke of Bedford (Henry V’s younger brother) lives longer, in which case, maybe his wife Jacquetta doesn’t marry lowly Richard Wydeville and start a family with him that includes Edward IV’s future queen. If circumstances keep Henry V’s widow, Catherine of Valois, from her entanglement with Owen Tudor, then Edmund and Jasper Tudor don’t exist, and in turn neither does Henry VII. No Wars of the Roses means no Tudor dynasty, no Reformation in England (at least not under those circumstances and at that time), no Elizabeth I or Spanish Armada, possibly no unification of the English and Scottish crowns (only possible because Princess Margaret Tudor married into the Scottish royal family and her heirs had claims to both thrones). The same overall “stuff” might still have happened eventually, but not in the same way or involving the same people. This isn’t limited to just England and Scotland, either. To give but one example, Edward IV’s sister Margaret married Charles the Bold, Duke of Burgundy, a marriage she likely never would have made had her brother not been king (and of course Edward IV and Margaret might not even exist in this scenario). Margaret had no children with Charles; if she had had a son, or if Charles had had a son by a different wife, that son would have inherited. Instead Burgundy went to Charles’ daughter Mary from his first marriage. Margaret was close to her stepdaughter and encouraged Mary to follow through on the marriage pact that had been made for her to Maximilian, son of the Holy Roman Emperor Frederick III. Mary and Maximilian’s son Philip married Joanna of Castile, daughter of Ferdinand and Isabella. Their descendants formed the basis of Habsburg power in Europe for the next few centuries, all the way down to Archduke Franz Ferdinand. And without the Wars of the Roses, it probably wouldn’t have happened that way. (Nor would Joanna’s sister Catherine of Aragon have married Henry VIII of England, who, again, would not have existed.) … And all because a guy died at Agincourt (which is morbidly funny in its own way because Agincourt was otherwise a decisive English victory and there were few notable deaths among the English nobility, but York was one of them, and holy hell did that matter). ",
            "date": "Answered November 2, 2019",
            "views": "69",
            "upvotes": " View 144 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen Leach",
                    "user_href": "/profile/Stephen-Leach"
                },
                {
                    "user_id": "Richard Gardner",
                    "user_href": "/profile/Richard-Gardner-154"
                },
                {
                    "user_id": "Robo Copper",
                    "user_href": "/profile/Robo-Copper"
                },
                {
                    "user_id": "Vienna Harvey",
                    "user_href": "/profile/Vienna-Harvey"
                },
                {
                    "user_id": "David Levitch",
                    "user_href": "/profile/David-Levitch"
                },
                {
                    "user_id": "Cristina Crilu Luciani",
                    "user_href": "/profile/Cristina-Crilu-Luciani"
                },
                {
                    "user_id": "Vijay P",
                    "user_href": "/profile/Vijay-P-357"
                },
                {
                    "user_id": "S. Ranck",
                    "user_href": "/profile/S-Ranck-1"
                },
                {
                    "user_id": "Senjuti Kundu",
                    "user_href": "/profile/Senjuti-Kundu"
                },
                {
                    "user_id": "Stephen Selipsky",
                    "user_href": "/profile/Stephen-Selipsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Che Tianyi",
                "href": "/profile/Che-Tianyi"
            },
            "answer_text": "The rise of the Communist Party of China is the most important turning point in modern Chinese history, In the process of its rise, the Communist Party of China has gone through numerous storms and waves. In these big waves, the most dangerous one is Gu Shunzhang's rebellion. At that time, the Young Communist Party of China was almost wiped out. Gu Shunzhang holds a large number of core secrets of the Communist Party of China, For example, the addresses and names of most organs and leaders of the Communist Party of China. Because he was the early leader of the Communist Party of China and the head of the third special section of the CPC Central Committee, Even he has the key to Zhou Enlai's（founder of the people's Republic of China, first premier） residence. After Gu Shunzhang's rebellion, the underground Party organizations of the Communist Party of China were seriously damaged, Many Communist Party leaders were killed, such as Yun Daiying, Cai Hesen and others. Gu Shunzhang is also recognized as the most dangerous traitor in the history of the Communist Party of China. In fact, there was another time when it was more dangerous, but it was discovered in time by the Communist Party of China, That was Xiang Zhongfa, then general secretary of the Communist Party of China. If CPC didn't find out in time, respond quickly and deploy carefully, The Young Communist Party of China is likely to be uprooted. At that time, an unknown heroine cameforward, Changed the historical trend. Who saved the party? Many references to this matter are vague, Some internal documents, only said Zhou Enlai got the news ahead of time and made a response. But how did Zhou Enlai get the crucial news? Some documents mentioned that the news was spied out by Pan Hannian. But how did pan get the news himself? In such a critical moment, who is going to turn the tide? This man is Huang Mulan, a little man who changes the direction of history. She joined the Communist Party of China at the age of 19. During the first cooperation between the Kuomintang and the Communist Party, she was the Minister of women's Department of Hankou. After the breakdown of Kuomintang communist cooperation, Huang Mulan was appointed secretary of the Secretariat of the CPC Central Committee. In addition to being a secretary, she has multiple identities as an important traffic officer of the CPC, She is also a member of the special section of the CPC Central Committee and works under the leadership of Zhou Enlai. In April 1931, Guan Xiangying, then a member of the Political Bureau of the Communist Party of China, was arrested, Zhou Enlai instructs Huang Mulan to rescue Guan Xiangying at all costs. Huang Mulan soon found Chen Zhigao, a famous lawyer in Shanghai at that time, Chen Zhigao's father served as president of the criminal court in the French concession for 18 years. Chen's father and son were really powerful in the judicial circle of Shanghai at that time, Soon, Guan Xiangying was rescued and Huang Mulan successfully completed his work. However, Huang Mulan was also in great trouble. Chen Zhigao fell in love with her, That's why Chen Zhigao did his best to help rescue guanxiangying. One day, Chen Zhigao and Huang Mulan had a date. They had coffee first and then went to the cinema, Unexpectedly, they met Chen's old classmate Cao Bingsheng while drinking coffee. Cao Bingsheng is a French translator of the concession. He talked with Chen Zhigao about his work, It was mentioned that the concession patrol house had just caught a big head of the Communist Party. He is from Hubei Province. He is in his fifties and has a big nose and golden teeth, One hand is missing a finger, and all moves have not been used for punishment. When Huang Mulan heard it, he was terrified, but still pretended to be nothing, After Cao Bingsheng left, she went home without going to the cinema on the pretext of headache. As soon as she got home, she contacted pan Hannian, and they studied together, Huang Mulan immediately guessed that the traitor was likely to be Xiang Zhongfa. As the general secretary, Xiang Zhongfa knows no less secrets than Gu Shunzhang, It's impossible to imagine the consequences of his treason and whistleblowing. After Gu Shunzhang defected, the Central Committee decided to let Xiang Zhongfa work in the Soviet area, Zhou Enlai told Xiang Zhongfa to move and not to go out. I didn't expect Xiang Zhongfa would still miss her mistress Yang Xiuzhen and go to her house for the night, I was recognized when I went out for a ride in the morning, and I was immediately taken to the patrol room. It turns out that the address of Yang Xiuzhen was revealed by the rebellious Gu Shunzhang, Yang Xiuzhen and Xiang Zhongfa are introduced by Gu Shunzhang. Gu Shunzhang guessed that Xiang Zhongfa might say goodbye to Yang Xiuzhen before leaving Shanghai, As expected,As expected, Xiang Zhongfa is a passionate seed, and his guess is not bad at all. Huang Mulan and pan Hannian immediately informed Zhou Enlai and others of the transfer, At the critical moment, we should ease a disaster. Huang Mulan also made many unimaginable sacrifices for the organization, Seriously, these sacrifices are not what ordinary women can do. Huang Mulan is very beautiful and intelligent. There are many people pursuing her, Not only the celebrities in Shanghai, but also many leaders in the party. For example, Zhou Shushi, later Secretary of the Shanghai Municipal Committee and head of the central organization She once pursued her passionately, but Huang Mulan finally chose He Chang. He Chang became the youngest member of the CPC Central Committee at the age of 21, As a young man, he later served as the deputy director of the General Political Department of the Red Army. However, in order to facilitate underground work, at the request of the organization, Huang Mulan sacrificed her personal feelings and married Chen Zhigao. After the long march of the Red Army, he Chang left behind to fight guerrilla warfare, and later died bravely. During the Anti Japanese War, Huang Mulan was arrested by the Kuomintang and lost his son in prison for two years. Before the liberation of Shanghai, many people were worried that the artillery might destroy Shanghai, After all, Shanghai is China's largest industrial base. It's a pity that it was destroyed. At that time, the Kuomintang army held Suzhou and Hebei, with tall buildings and factories Warehouses and other buildings were used as a cover to block the river with intensive fire. The 27th army of the people's Liberation Army continued to attack, and waves of troops rushed up, However, another wave fell in front of the fire net from the other side of Suzhou River. In the morning of the attack, the South Bank of Suzhou was full of the bodies of the attacking troops, However, it still failed to cross the narrow Suzhou River, which is no more than 30 meters wide. In order not to damage the urban area of Shanghai, the PLA cannot use heavy artillery to attack the city, We can't use explosives to explode, we can only use light weapons to attack. It's very difficult. In order not to damage the urban area of Shanghai, the PLA cannot use heavy artillery to attack the city, We can't use explosives to explode, we can only use light weapons to attack. It's very difficult. Many heroes in the battle of Huaihai and crossing the river fell by the Suzhou River. The soldiers who killed the red eyes angrily questioned the commander, general Nie Fengzhi: \" It's the important building for the bourgeoisie, Or the life of proletarian revolutionary soldiers? \" At this time, Huang Mulan, who had been released from prison, ran around in many ways and contacted many people, Find Chen Zhigao's nephew, Liu Changyi, deputy commander of Songhu police. Liu Changyi led an uprising of more than 40000 people in the 51, 21 and 123 Kuomintang armies, The 27th army rushed across the Suzhou River to wipe out the remnants of the 37th army of the Kuomintang and the traffic police corps. In 1955, the Pan Yang case broke out, and Pan Han was regarded as an internal traitor, Huang Mulan was innocent because he had worked under pan Hannian. In the next two decades, with the repeated injustice of Pan Hannian, Huang Mulan was jailed several times and released several times, but her appeals failed. After rectifying the chaos, Pan Han's case was settled, and so was Huang Mulan, She served as a counselor in the Counselor's office of Shanghai municipal government and died in Hangzhou in 2017. I have experienced so many ups and downs in my life, and suffered all kinds of hardships, But she can laugh at life and live to be 110 years old. Huang Mulan is a little-known person who is still unknown, But it has completely changed the modern history of China and witnessed the modern history of China.      Thank you for reading. ",
            "date": "Answered June 27, 2020",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Mitchell",
                    "user_href": "/profile/Thomas-Mitchell-24"
                },
                {
                    "user_id": "Xu Wentao",
                    "user_href": "/profile/Xu-Wentao-6"
                },
                {
                    "user_id": "Chris Yip",
                    "user_href": "/profile/Chris-Yip-13"
                },
                {
                    "user_id": "Hu Shi Xiong",
                    "user_href": "/profile/Hu-Shi-Xiong"
                },
                {
                    "user_id": "Brian Paul Jenny",
                    "user_href": "/profile/Brian-Paul-Jenny"
                },
                {
                    "user_id": "Atif Ahmed",
                    "user_href": "/profile/Atif-Ahmed-93"
                },
                {
                    "user_id": "Robert Miller",
                    "user_href": "/profile/Robert-Miller-1809"
                },
                {
                    "user_id": "Hoang Ngo",
                    "user_href": "/profile/Hoang-Ngo-50"
                },
                {
                    "user_id": "Hamda Mehmood",
                    "user_href": "/profile/Hamda-Mehmood-1"
                }
            ]
        }
    ]
}