{
    "title": "What makes Spider-Man such a good superhero? - Quora",
    "tags": [
        "Comic Book Superheroes",
        "Superhero and Comic Book Movies",
        "Spider-Man (creative franchise)",
        "Comic Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Nowlan",
                "href": "/profile/Michael-Nowlan-1"
            },
            "answer_text": "Relatable - he's isn't a billionaire or anything special, he's simply a teenage boy that wants to make a change.Sense of humour - although heros like Batman and cool, they can get boring when they are constantly brooding.Costume - unlike most heros, Spider-Man has kept his costume mostly the same throughout the decades as is it very timeless.Powers - who doesn't want to climb walls, swing through the city and do everything else a spider can?Stories - he has had a lot of famous stories throughout the years. Namely “The Death of Gwen Stacey” or “Coming Home” and “Superior Spiderman”.Rogues Gallery - a hero is only as good as their respective villains. And with a list including “The Green Goblin, Venom, and “Doc Ock” it's very arguable that he has the greatest, second only to Batman.Dedication - Spider-Man has been to within an inch of his life countless times, lost loved ones and sacrificed many opportunities to have a private life. Yet despite it all he keeps pushing through, because with great power comes great responsibility.Film - although Spider-Man 3 and the Amazing Spider-Man franchise aren't loved, the first two films are both incredible films and arguably helped start the recognition of Comicbook Movies being a genre that could attract mass audiences, as evidenced by films like Captain America: Civil War where despite everything else that was happening many people cared mostly about the 30 minute appearance of Spider-man.",
            "date": "Answered May 30, 2016",
            "views": "13",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Knight Beribu",
                    "user_href": "/profile/Knight-Beribu"
                },
                {
                    "user_id": "Gaius Cailgula",
                    "user_href": "/profile/Gaius-Cailgula"
                },
                {
                    "user_id": "Jeff Numbers",
                    "user_href": "/profile/Jeff-Numbers"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Andrea-S-33"
                },
                {
                    "user_id": "John Woodworth",
                    "user_href": "/profile/John-Woodworth-11"
                },
                {
                    "user_id": "Michael Fernández",
                    "user_href": "/profile/Michael-Fernández"
                },
                {
                    "user_id": "Ben Grant",
                    "user_href": "/profile/Ben-Grant-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jevon Marqui Presbery",
                "href": "/profile/Jevon-Marqui-Presbery"
            },
            "answer_text": "Spiderman isn’t my favorite superhero, that honor belongs with superman, but i DO feel spiderman is the BEST superhero(yes I am able to distinguish between things I like and something being better than something I like even though I like it). spiderman is the BEST superhero to me because he makes sense, he makes ENOUGH sense that when i read his stories or watch something with him in it i’m like: …ok. Like i said, i love superman and i NEVER find him boring, but i could see how others could, superman CAN do anything, he’s the swiss army knife of powers and people sometimes hate that(along with his smarmy pseudo-golden age boy scout nonsense) batman is to me, much the same way other people view superman, while some will say batman is ONLY a man and as such he has limitations and it makes the story better, i tend to differ, i don’t feel that way, i feel as though batman has a better power than superman EVER will (plot armor/convenience). maybe i haven’t read the right story but it just feels like batman ALWAYS has what he needs on him AT THE MOMENT he needs it, its never like: oh shit, i’m wearing the WRONG utility belt. and I think thats where MY personal problem with batman comes in, I find him to be COMPLETE AND UTTER BULLSHIT, when he’s fighting someone in his weight class he’s great, but when he’s fighting and besting kryptonians and gods and meta humans who can process information at such speeds and levels that he should seem like a statue? I call bullshit on him and they DO IT SO OFTEN. he has been wanked more times by DC and his fans than ron jerome has by a backstage “fluffer” on set of your favorite adult video shoot. its to the point where whenever i see batman do something that should be outside of his abilities its a turn off, i’m like oh thats such bullshit. I don’t have that problem with spiderman, spiderman is the SWEET spot, he’s JUST strong enough that i could see him doing some interesting and amazing things under maximum effort(well outside of the realm of normal humanity too i might add) but still vulnerable enough that he doesn’t run into the superman issue of being non-relatable. you can shoot him, you can burn him, he cannot breath under water OR in space, he can and has been shot before. his abilities are the magic sweet spot for not feeling like he’s full of shit when you read his comics or watch his movies, i could however see how others could find superman boring and I personally think batman is nonsense. ",
            "date": "Answered December 3, 2018",
            "views": "588",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Knight Beribu",
                    "user_href": "/profile/Knight-Beribu"
                }
            ]
        }
    ]
}