{
    "title": "What methods were used by the communist regimes in Eastern Europe to maintain their power and attract people to their side? - Quora",
    "tags": [
        "Eastern Europe",
        "The Cold War",
        "Communism",
        "Soviet Union",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Bryant",
                "href": "/profile/Joseph-Bryant-35"
            },
            "answer_text": "It was the big lie that the working man has a real word to say at the table with the pie. When the communists overthrown the capitalistic regimes across East Europe they had a good mass of people to rely on. The poor, the overworked, the unlucky working class in those countries. They promised the sun and the stars to them and even gave them the impression they got to be in charge of the companies they stole from the capitalists. People believed it at first and even if they did not have a word (as promised) to the table, they still felt at least they got rid of the owners of the factories they were working for before. Things got iffy when people themselves realized that they were tricked into the whole process and the new masters were even worse than the capitalist owners they had before. The owners were replaced with Communist Party activists, who were recruited from the most idiotic elements of the society. The least educated, most ruthless people overall were those who inspected and induced punishment to all levels of companies structures now. When people started to rebel, or even question the actions of that sort, they were picked from homes at night and some disappeared without a trace. That induced horror in the whole population. There were cases I knew personally about kids in university who fought for a girl and one jealous reported the other one to authorities he said something against the regime. The reported one disappeared next day and nobody saw him again anymore. There were revolts, such as those in Hungary in 1956, Czechoslovakia in 1968, Poland in 1970’s and many other smaller ones. They were all dealt with the might of the Soviet army, who drove tanks over the demonstrators and instilled fear and horror among the whole population. The difference between the Nazis and the Communists was that the Nazis found scapegoats (such as Jews, or Slavs, considered inferior) in order to attract the population on their side. They did not terrorize their own people though. They tricked them about the facts and methods, perhaps, but not terrorize them Compared to that, the Soviets and Communists in power in most East European countries were ruthless against their own people. If anyone would say a word or comment about what they did, they were happy if they were thrown in jail, if not disappeared for good. And what happened in those communist jails was worth of the craziest horror movies one could imagine. I’ve seen people who came out, the way they looked before and after and it’s enough to understand. The 50’s and even early 60’s were times of social purges in those countries, with a general terror implemented. Friends and even relatives were not safe anymore with each other, as anyone could “report” anyone else to the authorities and you could just disappear like you never existed. How about that as a method to keep your own population in check? ",
            "date": "Answered May 10, 2020",
            "views": "113",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Thompson",
                    "user_href": "/profile/John-Thompson-1074"
                },
                {
                    "user_id": "Vladimír Galla",
                    "user_href": "/profile/Vladimír-Galla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Piotr Szafranski",
                "href": "/profile/Piotr-Szafranski"
            },
            "answer_text": "The East Block construction should be an at least elective subject in any high school. The whole set of methods used is unfortunately relevant today, it should be known and recognized. One should really appreciate the skill and power the Soviet system developed and employed, to extend and maintain itself across Eastern Europe. Note how much better were the Soviets in keeping that area under control, than the Nazis were. Nazis ruled (1939–45) by unsustainable sheer terror - something which could not be kept too long, as you run out of people to terrorize. Soviets could rule in a peacetime, in a sustainable way. The groundwork was laid in 19th century inside Imperial Russia - development of a very advanced secret police. Every country of course has a secret police, just like any country has a military. But there are two special cases. Prussia, where the military had it’s own state, and Russia, which evolved a secret police which came to own the whole country. Just like everybody can easily acknowledge the all-time superiority and perfection of the Prussian (later German) military, one should similarly acknowledge the superiority of Russian secret services. Probably the decisive step in the progress of Russian secret service, a threshold no other services AFAIK crossed on the road to perfection, was the late 19th/early 20th century story of Yevno Azef[1]. He was the Okhrana (Russian secret service name at the time) agent who pretty much organized, and later headed, the most powerful Russian opposition anti-Tsarist party, the Socialist Revolutionary Party[2]. That party won a plurality in the first post-revolutionary assembly in Russia in 1917, ahead of the Bolsheviks. Still, the Bolsheviks took over. People from the Socialist Revolutionary Party were among the first builders of the Soviet Union then, as GULAG slaves. That part of the story (around 1917) still needs a good historian to figure out and write about, but I digress. I just wanted to point out that the strongest anti-Tsar revolutionary Russian party was in fact a creation of the Tsar’s secret police. Our hero, Yevno Azef, in order to get the necessary respect and credit to build the most powerful anti-Tsar party, had of course to accomplish serious things. To that end, the Russian Tsar’s secret police spared twelve prominent Government people, some of them close relatives of the Tsar. These people were, over time, successfully assassinated by Socialist Revolutionary Party combat teams organized and led by Yevno Azef. Such successes ensured the leadership position in the Socialist Revolutionary Party for our hero, and resulted in the Socialist Revolutionary Party getting the street creed as the most effective anti-Tsarist underground organization, leading to a huge recruitment success and an unquestioned opposition leadership position for that Party. Needless to say, in the time available between organizing assassinations of Tsar’s uncles, cousins and assorted ministers, Yevno Azef was dutifully copying the rolls of the Socialist Revolutionary Party members, and passing this data to Okhrana. The fact that he was that Party leader and organizer was making it easier. I should also note that Yevno Azef was a very capable administrator. The Socialist Revolutionary Party had a very good network of underground media, communication network etc etc, mundane things which, nevertheless, take some skill to establish and maintain. Yevno Azef had that skill, hence he was deeply valued, by all Socialist Revolutionary Party members. Note how brilliant that system was. There was a constant supply of suitable candidates for the Russian ministerial positions, no worry it would be ever exhausted. The Tsar’s family was also breeding enough, one cousin here, one uncle there falling down shot or blown up was not endangering that supply either. And surely there was a good supply of speeches for funerals and recruitment process, about how noble it is to work and perhaps die for the Motherland. Which (good of the Motherland) those assassination victims really were serving, more than they knew. This way, the Tsar’s secret service controlled the opposition. Led it, actually. Can you imagine a more stable setup? Whether any particular Russian wanted to work for, or against the government, either way he/she was ending up under the same command. I cannot imagine a better, more stable and safe system. One could protest, against the concept of “perfect Okhrana”, pointing out to the October Revolution. But here I would ask to consider - was the purpose of the Prussian General Staff to preserve the Kaiser, or to preserve the General Staff itself? Think of it. Anyway. I do not want to drag this answer too long. The textbook example described above was one of the tools used in the Soviet Union in early 1920s again, and later in the East Block countries. There were other tools, which I wrote about in other answers, at least partly. Somebody should write systematic “Introduction to Modern Dictatorship Methods 101” lecture notes, we were given that lecture already a couple of times. Footnotes[1] Yevno Azef - Wikipedia[2] Socialist Revolutionary Party - Wikipedia",
            "date": "Answered May 10, 2020",
            "views": "648",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pendaar Pooyan",
                    "user_href": "/profile/Pendaar-Pooyan"
                },
                {
                    "user_id": "Alfredo Perozo",
                    "user_href": "/profile/Alfredo-Perozo"
                },
                {
                    "user_id": "Nguyen-Long Doan-Duc",
                    "user_href": "/profile/Nguyen-Long-Doan-Duc"
                },
                {
                    "user_id": "Robert Szymczak",
                    "user_href": "/profile/Robert-Szymczak-2"
                },
                {
                    "user_id": "Samuel Dey",
                    "user_href": "/profile/Samuel-Dey-1"
                },
                {
                    "user_id": "Jack Spektor",
                    "user_href": "/profile/Jack-Spektor"
                },
                {
                    "user_id": "Mary Carnahan",
                    "user_href": "/profile/Mary-Carnahan-2"
                },
                {
                    "user_id": "Robert Cameron",
                    "user_href": "/profile/Robert-Cameron-16"
                },
                {
                    "user_id": "A. E. Kabir",
                    "user_href": "/profile/A-E-Kabir"
                },
                {
                    "user_id": "John Thompson",
                    "user_href": "/profile/John-Thompson-1074"
                }
            ]
        }
    ]
}