{
    "title": "What is it like to live in Cuba? - Quora",
    "tags": [
        "Life in Cuba",
        "Cuba"
    ],
    "response": [
        {
            "author_info": {
                "name": "Esther Hermida",
                "href": "/profile/Esther-Hermida-1"
            },
            "answer_text": "Thanks for asking! I love sharing my life experience in Cuba. Remember, I was a kid when I moved here so my take on it is limited. Nonetheless here it goes: I have not lived in Cuba for many, many years. I lived there as a child in a very small town. I was happy and carefree and everyone knew who I was. I was brought home by the ear by a neighbor if I got in trouble only if they were able to catch me. I didn’t know I was poor (It wasn’t that my parents were poor, per se, in communist Cuba everyone was considered equally lacking). I just knew that I couldn’t have many things that my other friends had because we were four kids, most of them were only children or their siblings were much older. They shared whatever toys they had with me. My memories are sparse so bear with me. I played with dolls like any other little girl, except that my one and only doll had a face made of plastic. One day I left it at my aunt’s because I was asleep and my parents forgot to bring it back with them. The next day my uncle brought it back with a face that had been eaten away by mice. Bummer! I knew that if my little friend had a pair of skates, we can each take turns using them, we could also just shared and use only one, similar to skateboarding. If one of them had a bicycle we’d take turns riding it for short distances or climb and sit behind her. We explored our surrounds and set out to find toads under rocks; climb trees to get closer to chameleons; steal fruits from our neighbor’s tree and run away with the loot. We got chased by a bull once when we taunted him enough. We were close enough to jump over a fence to safety. We rode in the back of horse and my grandfather’s horse cart whenever he went to his fields. OK, we attended school, too. We loved animals. My sisters and I would tried to save the baby birds that fell off their nests. We buried them when they died and put a little cross so we could find them. We hid a female cat under our bed and she had kittens right there. She was a mute cat and didn’t cry. I can’t remember what happened to all those cute kittens. I may not want to know. To this day my youngest sister sets out food for feral cats. We didn’t have snow but we created our sled out of the thick wood part of a dried up palm frond and run down the dry ditch across the street from our home. It’s a thing, you know. Palm Frond Sledding. Christmas was not celebrated in Cuba but toys were available for sale during that time, I think. One time, It must’ve been the early part of the revolution, my mom found this beautiful black toy piano  with a seat and bought for me. It didn’t last long, she bartered it for bath towels. I cried and she consoled me, that just the way it was. See, my story is really no different from most other children throughout the world. My childhood ended when I was 10 and came to the States with my parents. My mom had to go to work. I was the oldest of my sisters so I had the responsibility of watching over them. So, there my child’s view of life in Cuba. No worries I am not traumatized by this experience. I am a happy adult that appreciates the little things in life. ",
            "date": "Answered November 18, 2017",
            "views": "9",
            "upvotes": " View 70 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward W. Sturm",
                    "user_href": "/profile/Edward-W-Sturm"
                },
                {
                    "user_id": "Krystina Marie Price",
                    "user_href": "/profile/Krystina-Marie-Price"
                },
                {
                    "user_id": "Lisa Penn",
                    "user_href": "/profile/Lisa-Penn-15"
                },
                {
                    "user_id": "Vincent Pabon",
                    "user_href": "/profile/Vincent-Pabon"
                },
                {
                    "user_id": "Michelle Buonasaro",
                    "user_href": "/profile/Michelle-Buonasaro"
                },
                {
                    "user_id": "Pedro Castro Alvarez",
                    "user_href": "/profile/Pedro-Castro-Alvarez"
                },
                {
                    "user_id": "Jason Salyer",
                    "user_href": "/profile/Jason-Salyer-5"
                },
                {
                    "user_id": "Saswat K.Levin",
                    "user_href": "/profile/Saswat-K-Levin"
                },
                {
                    "user_id": "Ana Gutierrez",
                    "user_href": "/profile/Ana-Gutierrez-133"
                },
                {
                    "user_id": "Taylor LeBlanc Thorne",
                    "user_href": "/profile/Taylor-LeBlanc-Thorne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fabri Silva",
                "href": "/profile/Fabri-Silva"
            },
            "answer_text": "Growing up in Cuba in the 90s was (I found out later) like growing anywhere in the Western world in the 80s or 70s. As kids, we played outside all the time, with other kids from our street, or even several streets away. By the time I was 12, I knew every corner of my neighborhood. We had free roam on a 2 mile radius that included houses, apartment buildings, several parks, two rivers, three different woodlands, two abandoned factories, one abandoned warehouse that still contained plenty of rusting heavy machinery. Most of us had no toys, so we invented them out of whatever and it was alright. We did not have much to eat, so we climbed trees and snacked on their fruit and enjoyed the sight from up there. When I was 5 years old I told my mom one day that I did not want to go to school, she beat me so hard before sending me there that I got a fever (it was the first time she hit me and only one of three). I learned that school was very important that day, so much that she would do something I knew pained her. So we got beatings sometimes, and we learned from that. Not having much to eat, we learned to share with ours friends whatever we had, so that they would do the same in return when they had and we didn't. We had bullies and we had bullied like everyone else, but we didn't have suicidal kids over that.As teenagers in the late 90s, we started understanding better all of the material things we lacked, but we had a lot of fun, a lot of friends, we partied with what we had, and danced to whatever, whenever. We also started knowing that one day we would have to 'leave' (emigrate). Many of us lost friends to emigration then.As young adults, life started to suck, there wasn't much to do, and there weren't many ways to make a living or start building a future. So many of us left. Yet I still have friends in Cuba, and they still find a way to be happy, many times even happier than a lot of people I meet here (US). Living in Cuba is hard, and it's very different than living in many other places, but it's not necessarily a bad thing, and it's certainly not a completely unhappy, unlucky thing. ",
            "date": "Updated May 12, 2012",
            "views": "295",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward W. Sturm",
                    "user_href": "/profile/Edward-W-Sturm"
                },
                {
                    "user_id": "Krystina Marie Price",
                    "user_href": "/profile/Krystina-Marie-Price"
                },
                {
                    "user_id": "Lisa Penn",
                    "user_href": "/profile/Lisa-Penn-15"
                },
                {
                    "user_id": "Daniela Anet Castillo-Brunet",
                    "user_href": "/profile/Daniela-Anet-Castillo-Brunet"
                },
                {
                    "user_id": "Elia Giavelli",
                    "user_href": "/profile/Elia-Giavelli-1"
                },
                {
                    "user_id": "Saswat K.Levin",
                    "user_href": "/profile/Saswat-K-Levin"
                },
                {
                    "user_id": "Jonathan Mpungu",
                    "user_href": "/profile/Jonathan-Mpungu"
                },
                {
                    "user_id": "Cristian Dominguez",
                    "user_href": "/profile/Cristian-Dominguez-4"
                },
                {
                    "user_id": "Tiago João",
                    "user_href": "/profile/Tiago-João-3"
                },
                {
                    "user_id": "Ana Gutierrez",
                    "user_href": "/profile/Ana-Gutierrez-133"
                }
            ]
        }
    ]
}