{
    "title": "What battle tactics did Attila the Hun use? - Quora",
    "tags": [
        "Tactics",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Link",
                "href": "/profile/Timothy-Link-4"
            },
            "answer_text": "As another answer stated, the Huns were classic steppe nomads like the Scythians, Cimmerians, Sarmatians, Dahae, and others. They were notably the first known Turkic tribe to come off the steppe around 370 when they arrived at the Danube-Rhine frontier. Many argue that they either were the Xiongnu that fought and, at one time, dominated, Han China or an offshoot (as it was a tribal confederacy). However, aside from originating in Mongolia (the Mongols and the tribes that they conquered, e.g. the Keraits, Naimans, etc, were also Turkic) and a subtle, kinda reaching similarity of “Hun” to the Chinese name (which is Hsiang-nu in the alternative transliteration — and nope, I have no idea how that's properly pronounced), there isn't really any convincing evidence that they were the same people. The Hums were a steppe “horse people” (as John Keegan called them) but there were specific differences in their tactics. Standard steppe cavalry tactics and battle were, in a nutshell, a protracted and vicious guerrilla campaign abbreviated into the alotted time a pitched battle. They would usually be made up of 50–80% light cavalry armed mainly with their signature weapon, the recurve composite bow, and usually a simple, brutal shock weapon: one of various style maces, or a one-handed axe like the Sagaris. They wore little if any armor and rode “steppe ponies,” or breeds more akin to wild, pre-domesticated horses, which were notably small, usually around 12 hands or 120 cm as horses are measured, all but a few of which are extinct (a small number of Prezwalski's Horses remain in Ukraine, where they have thrived in — of all places — the Chernobyl “Forbidden Zone”; it is likely that they avoid the more contaminated or radioactive parts much like they instinctively dig under snow to graze). The remainder would be comprised of a tribe's nobility, who could afford the gear needed for heavy cavalry tactics. Archaeological evidence also shows a marked disparity in the average height of steppe nobility compared to their rank-and-file, which was likely due to a higher protein and overall higher calorie diet. They would fight as lancers using the first known, archetypal cavalry lance, the kontos (lit. ancient Greek for “barge pole”) which was used in classic massed charges, held in both hands on one's right side, just like Macedonian phalangites held the Sarissa, so that 1/3 to 1/2 of its total length (about 12 feet) projected ahead of their mount's head. Their mounts were often much larger than those ridden by the regulars of the tribe as well (no more than 15 hands tall however). They were essentially identical to the elite cavalry of the late Roman/Byzantine, Parthian, and Safavid empires, though armor was usually scale, lamellar, or even stiffened leather versus mail or plate armor (though many began to amass classic hoplite style gear from Athenian colonies, whether through trade or plunder). As a rule, steppe cavalry, just like modern guerrillas, avoided any engagement for as long as possible, due to the the precarious nature of an all-cavalry force and simple pragmatic battlefield logic, which was perhaps their greatest advantage ahead of mobility: when you grow up in landlocked Central Asia and actually survive, the rigors and hardships of campaigning are not such a big deal, and there is no middle ground between a skirmish and all out, vicious, all encompassing total war. That includes pretenses and conventions that all of our cultures developed over time that guide the conduct of battle and war, such as the traditions that developed for prisoner swaps and the very concept of simple pitched battles. We developed the practice and conduct for fighting pitched battles as a result of specific conditions imposed by settled, agriculture-based communities where each side had to find a time and place to mutually agree on duking it out, or what we might call a battle space. Keep in mind too that the template for battles was based on simple footsoldiers and lumbering armies with a massive footprint, especially with regard to logistics, that — again — had to find a particularly spacious area where they could fight, and any pre-battle maneuvers (e.g. to gain a superior position from which to fight) were limited to the speed that their slowest men could maintain. For steppe nomads, almost none of these conditions applied. They had no need for finding mutually agreeable battlefields — the 5,000 mile long expanse of plains and deserts in which they all lived in a state of continuous warfare for pasture and grazing rights, was more than suitable and remained so for every hour of the day, all year round. When they wanted to attack one another, there was no time like the present, whether it was an elaborate ruse and ambuscade or simply assaulting rival tribes. They fought until the other side was annihilated. End of story. And on the steppe that might entail a day of fighting or even a week, and the “site” of said battle was largely irrelevant when both sides are highly mobile and even “self-contained” soldiery using steppe tactics — it could be a Marathon sized battlefield, it could be 50 miles or more. They did not care. When a tribe defeated another, they would usually be absorbed just like prehistoric war bands in Europe (a process given the weird name of ethnogenesis), “they” meaning the surviving soldiers, enslaved, and even more desperate leftovers. This occurred when Temujin conquered all of the tribes in the eastern steppe zone and became Chinggis Khan, and it occurred much more haphazardly with the Huns as they reached the Pontic Steppe (largely what is now Ukraine) and came across the Goths and Alans. The way that they easily scattered these tribes that were an existential threat to the Romans is plenty of evidence that they were savagely effective fighters. When you remove these conditions from warfare, there are no forbidden or taboo means to win, and whether the other side mocks you for apparently fighting in a cowardly manner en route to their annihilation does not weigh on one's conscience. This allowed tribes like the Huns to fight in a relatively passive manner, avoiding engagement until the enemy was exhausted and devoid of discipline. This was sped along by volleys of arrow fire, usually fired “arcade” style, or in a near 45° angle, similar to a Howitzer, which increased their range by two or even three times, but also meant they would be less accurate. When arcade volleys landed on a target at a near 90° angle, however, the results were vicious and likely more than compensated for the lack of accuracy by spreading terror throughout the enemies numbers. At the Battle of Carrhae for example we hear of arrows nailing shields to forearms among other ghastly injuries. The arcade volley was a tried and true tactic right up into the era of effective firearms, especially when used by enemies who wisely knew how and — thanks to the horse, were able to — maintain a space safe from their enemy's reach but within killing distance. Volleys were mixed with targeted shooting that each man would take as opportunity presented itself. The other side was also manipulated, just like a herd of animals, into variously precarious situations. This is where the lancers were used, as a volley would scatter an army's numbers and render them essentially one massive exposed flank, into which the lance equipped men charged with terrifying results. A premodern cavalry charge was an all encompassing sensory Hell that, for a few moments that seemed like aeons, saw horses displace soldiers with their sheer weight while men and horses were impaled. This would further serve the purpose of spreading terror to break and annihilate an enemy. What's more, heavy cavalry could merely approach and make their enemy instinctively huddle together, which made them far more vulnerable to arrow volleys. Far more prevalent though was the practice of engaging and breaking away, as if retreating — the feigned retreat, which was the specialty of the steppe fighter. This would be used by light and heavy cavalry alike, to lure an opponent into trying to pursue and wipe one's numbers out, as if you were broken, panicked, and vulnerable. They inevitably lost cohesion and discipline pursuing their much faster foe, at which point the feigning force would wheel around and tear into them. This was a tried and true, endlessly proven tactic, even against enemies who knew it was coming. In the late sixth century military treatise The Strategikon, the Byzantine Emperor Maurice advises the reader to simply avoid trying to pursue and wipe out the retreating Hun-style army, regardless of the strategic implications. The Huns followed these basic principles as other steppe migrants did, but they were far more aggressive. Whereas others would keep their distance to wear the foe down with volleys, the Huns were perfectly happy to ride up to a target and blast them from less than 50 yards, and their bows were perfectly able to pierce the armor of the time from that distance. They also seem to have utilized a nasty trick around the Roman testudo formation, whereby they would fire a volley to make the Romans lift their shields overhead and immediately follow it up with straight trajectory fire that would then rip a formation into several terrified pieces. They were nasty and merciless, and they appear to have brought a whole new generation of steppe technology as well. Their bows were heavier and thus more powerful, with dramatically recurved limbs that better distributed the draw weight and were asymmetrically shaped specifically to fire around a horse's head. And, again, they were not as passive as other nomads, and the armor piercing ability they gained simply by riding up closer to their enemies cannot be overstated. They were also early adopters of the saber style shock weapons too, and favored a large, heavily weighted single edged blade similar to an Ottoman yatagan, which were notorious for basically removing whatever limb they hit. Add to all of this that the Huns had been mercenaries in Roman service who were thus very aware of Roman strategy and abilities, and it's hardly surprising that fighting the Huns sapped the Western Roman Empire, while the Eastern Empire basically adopted the Hun model to reform their armies. ",
            "date": "Answered September 3, 2018",
            "views": "729",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mxl Lv",
                    "user_href": "/profile/Mxl-Lv"
                },
                {
                    "user_id": "John Rooney",
                    "user_href": "/profile/John-Rooney-98"
                },
                {
                    "user_id": "Ray Dennis Davis",
                    "user_href": "/profile/Ray-Dennis-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kedia Prateek",
                "href": "/profile/Kedia-Prateek"
            },
            "answer_text": "Attila's forces in the beginning mostly depended on his cavalry - horse archers to be precise. They would launch an offensive on the enemy forces and then retreat leaving their front-line fighters in confusion. It can be attributed to the fact that Hunnic forces were barbarians from the steppes of Asia who had better command on riding horses and can therefore use horse archers better than anyone else during that time. Roman forces which always fought in formations couldn't stand a chance against such an attack. This offense would be followed by the cavalry attacking the dismantled army and morally wounding the enemy forcing them to withdraw or get defeated.  Apart from this, Attila claimed to have the sword of Mars - the Roman God of War. This increased the moral of his army who would see him as invincible and at the same time install fear in his opponents. He would also threaten to burn down places of worship of the eastern roman empire if he wasn't given the tributes. Thus, blackmailing was also one of his tactics. ",
            "date": "Answered June 19, 2014",
            "views": "75",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ray Dennis Davis",
                    "user_href": "/profile/Ray-Dennis-Davis"
                },
                {
                    "user_id": "Anthony Vonpischke",
                    "user_href": "/profile/Anthony-Vonpischke"
                },
                {
                    "user_id": "Tim Wolfe",
                    "user_href": "/profile/Tim-Wolfe-19"
                },
                {
                    "user_id": "Tugul Amar",
                    "user_href": "/profile/Tugul-Amar"
                },
                {
                    "user_id": "Edgaras Taraškevičius",
                    "user_href": "/profile/Edgaras-Taraškevičius"
                },
                {
                    "user_id": "Severin Silmedin",
                    "user_href": "/profile/Severin-Silmedin"
                },
                {
                    "user_id": "Ging Chen",
                    "user_href": "/profile/Ging-Chen"
                },
                {
                    "user_id": "Bala Krishna",
                    "user_href": "/profile/Bala-Krishna-8"
                },
                {
                    "user_id": "Rahul Ram",
                    "user_href": "/profile/Rahul-Ram-19"
                },
                {
                    "user_id": "Christopher Carswell",
                    "user_href": "/profile/Christopher-Carswell"
                }
            ]
        }
    ]
}