{
    "title": "What is the reason of less development of Satara City? - Quora",
    "tags": [
        "Satara, Maharashtra, India",
        "Reason",
        "Cities and Metropolitan Areas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitin Vinayak Date",
                "href": "/profile/Nitin-Vinayak-Date"
            },
            "answer_text": "25 years ago  Satara was seen as a pensioners city. After setting up of 2 MIDC areas , some industrial units were set up by corporates like Bajaj , Universal Luggage, Patheja group, Alfa Laval etc. However due to labour unrest the Satara MIDC reputation got a bad name and new units were reluctant to come here. Existing units were also not working properly and most of them either wound up or relocated to other safe places. The contractors and suppliers to these industries suffered a lot as they were depending solely on the industries here.  There was no political backing or support to industries and very less development took place. Further , due to proximity to Pune , a big city nearby , trade and commerce never developed here as people would prefer Pune for all major requirements.  Satara is again coming to life and new SME units are operating satisfactorily now. It is well connected by National Highways and Railway to many parts in India. Has good source of water supply as two rivers ( Krishna and Venna ) pass thru Satara. It has robust agricultural surrounding including sugar factories and very hard working and adventurous farmers. Many farmers are setting up Poly houses and green houses and doing hi tech farming. So, potential is immense, just need some visionary leader who will take it to a higher level.  ",
            "date": "Answered May 7, 2016",
            "views": "799",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chinmay Kshirsagar",
                    "user_href": "/profile/Chinmay-Kshirsagar-5"
                },
                {
                    "user_id": "Shubham Jagtap",
                    "user_href": "/profile/Shubham-Jagtap-72"
                },
                {
                    "user_id": "Shubhankar Gurav",
                    "user_href": "/profile/Shubhankar-Gurav"
                },
                {
                    "user_id": "Sagar D",
                    "user_href": "/profile/Sagar-D-86"
                },
                {
                    "user_id": "Pooja Naik",
                    "user_href": "/profile/Pooja-Naik-10"
                },
                {
                    "user_id": "Narayan Ghorpade",
                    "user_href": "/profile/Narayan-Ghorpade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Shetty",
                "href": "/profile/Vishal-Shetty-3"
            },
            "answer_text": "Why cant we relate development of any city with local leadership? Important part for any city development is perfect balance of industries, educated people and skillful employees, transportation and local leadership. Now in case of satara i will say there is no big industrial area though we have satara MIDC but it stands nowhere in competition, average monthly salary for educated employees in satara is near about 10k-12k and for uneducated its 5k-6k. Now satara has no IT companies if you consider the case every year 2k-3k engineers pass out in satara but as we dont have IT companies in satara maximum of people travel to pune for employement. Go to pune and see how many satarkars are settled there, no industries results in no skilled educated employees. Now i m 25 years old and since last 10 years i have seen zero development in satara, no new industries, no IT companies, no town planning, no traffic management, no city expansion, no new transport facilities, no expansion of tourism , no educational investment , no highways and no roads ..... Who is responsible for this ??? Local leadership is total responsible for this. Since last 10 years project of flyover at shivaji circle satara was pending in mantralay for sanction, you know very well whose govt was in Maharashtra since last 10 years but this proj has now started once govt changed in maharashtra. Its time for all people of satara to rethink upon their leader who can take both city and their people at new level. Satara has lot of potential to grow but..... ",
            "date": "Answered June 22, 2016",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vaibhav Pol",
                    "user_href": "/profile/Vaibhav-Pol-8"
                },
                {
                    "user_id": "Jayesh Jadhav",
                    "user_href": "/profile/Jayesh-Jadhav-42"
                },
                {
                    "user_id": "Prasanna Kumar",
                    "user_href": "/profile/Prasanna-Kumar-696"
                },
                {
                    "user_id": "Ram Chakravarti",
                    "user_href": "/profile/Ram-Chakravarti"
                },
                {
                    "user_id": "Jyotishwar Bhosale",
                    "user_href": "/profile/Jyotishwar-Bhosale"
                },
                {
                    "user_id": "Paul D'souza",
                    "user_href": "/profile/Paul-Dsouza-41"
                },
                {
                    "user_id": "Shubham Jagtap",
                    "user_href": "/profile/Shubham-Jagtap-72"
                }
            ]
        }
    ]
}