{
    "title": "What is the relationship like between Greece and Turkey? - Quora",
    "tags": [
        "Greek–Turkish Relations",
        "Foreign Policy of Turkey",
        "Greece",
        "Turkey (country)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raymond Lockey",
                "href": "/profile/Raymond-Lockey"
            },
            "answer_text": "Tense, even more so with the abandonment of a secular government in Turkey and its turn towards regional hegemony.  Turkey consistently violates Greek airspace with its fighter jets, even though Greece is also a NATO and EU member.  The proxy war between Turkey and Greece over Cyprus is still fresh in the minds of the politicians and populations of both nations. If it were not for the fact that Turkey is a NATO member, too, a military confrontation between both nations instigated by Turkey would be an even larger possibility.  While trade exists between both nations, that is the business communities working together, not the political structures of both countries.  I know Greek and Turkey businesses who actually have good relations with one another, even if there politicians do not.  So from a personal basis, people in both countries find common ground to interact well with one another.  Isn't that too often the problem in the world?  People get along, but their governments don't.  ",
            "date": "Answered March 24, 2016",
            "views": "18",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Konstantina Drosopoulou",
                    "user_href": "/profile/Konstantina-Drosopoulou"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "John Symeonides",
                    "user_href": "/profile/John-Symeonides-1"
                },
                {
                    "user_id": "Dionisia Petra",
                    "user_href": "/profile/Dionisia-Petra"
                },
                {
                    "user_id": "Chris Tanzier",
                    "user_href": "/profile/Chris-Tanzier-1"
                },
                {
                    "user_id": "Alkis TX",
                    "user_href": "/profile/Alkis-TX"
                },
                {
                    "user_id": "Selena Berkan",
                    "user_href": "/profile/Selena-Berkan"
                },
                {
                    "user_id": "Nikos Tzoumerkas",
                    "user_href": "/profile/Nikos-Tzoumerkas"
                },
                {
                    "user_id": "Robin Daverman",
                    "user_href": "/profile/Robin-Daverman"
                },
                {
                    "user_id": "Rajkumar Chharush",
                    "user_href": "/profile/Rajkumar-Chharush"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cagri Cinar",
                "href": "/profile/Cagri-Cinar"
            },
            "answer_text": "There is always tension between governments of the Greece and Turkey. This is mostly because of greek invasion on Turkey during 1920s after losing the war against Turkey, Greeks slaughtered all the Turkish villages while falling back to Aegean Sea. When the relations started to get better during 70s. Coup took over Greece and started racist and aggressive campaign to unite with Cyprus. The coup government knew that they can’t unite with Greece, while Turkish people live there (The population ratio was 3 greek to 1 Turkish). They started to slaughter Turkish people to make sure to unite with Greece. As a guarantor Country, Turkey had to help the Turkish people in Island and started the Operation Peace in 1974 and had the Turkish people under protection on the North side of the Island. The coup government in Greece had collapsed. Since then there is always problems with Greece. ",
            "date": "Answered July 19, 2019",
            "views": "339",
            "upvotes": "0"
        }
    ]
}