{
    "title": "What is the earliest reference to soldiers marching in formation, either on route or into battle? - Quora",
    "tags": [
        "Ancient Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Muir",
                "href": "/profile/Bob-Muir-19"
            },
            "answer_text": "I cannot answer for troops on the march, but one of the earliest formations adopted for the battlefield was the phalanx. This was a densely packed, but ordered, mass of men with long spears, each man protected by his comrades to his right and left. Variations of this appear throughout history. The Scottish Schiltrons and the Spanish Tercios were revisions of this basic formation and it was also used in a heavily modified form by the Swiss mercenaries for over two centuries. ",
            "date": "Answered October 25, 2020",
            "views": "37",
            "upvotes": " Answer requested by Bruce Taylor",
            "upvoters": [
                {
                    "user_id": "Conor Howard",
                    "user_href": "/profile/Conor-Howard-13"
                },
                {
                    "user_id": "John Hopkins",
                    "user_href": "/profile/John-Hopkins-473"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralf Conrad",
                "href": "/profile/Ralf-Conrad"
            },
            "answer_text": "Building Armies with different branches like Archery, Stone Slinger, Cavalry (mounted on horses or carriages or elephant), heavy Infantry (close formations), light Infantry (skirmisher) made it necessary to get those and keep them together under their own order for an effective usage. You can not say in detail who at first wrote a “book of marching order”, when people did write (if they did) about other things. ",
            "date": "Answered October 25, 2020",
            "views": "34",
            "upvotes": " Answer requested by Bruce Taylor"
        },
        {
            "author_info": {
                "name": "Wyndham Whynot",
                "href": "/profile/Wyndham-Whynot"
            },
            "answer_text": "Purely a guess, but I’d presume it relate either to the battle of Qadesh/Kadesh or the battle of Jericho. Although, I have no doubt that a number of stone reliefs are references to soldiers marching in formation. ",
            "date": "Answered October 24, 2020",
            "views": "164",
            "upvotes": " View 2 Upvoters"
        }
    ]
}