{
    "title": "What kind of schooling is the best in the 21st century? - Quora",
    "tags": [
        "Education in Aruba",
        "Education in Eritrea",
        "Education in Guyana",
        "Education in Belize"
    ],
    "response": [
        {
            "author_info": {
                "name": "Advait Pai",
                "href": "/profile/Advait-Pai-4"
            },
            "answer_text": "Hello, Being a student myself I am unaware of he various schooling methods present, so I will just provide my opinion on what might be the ideal system where students can learn and develop life skills at the same time. First of all I would like to clarify that I kind of dislike the Indian Education System. Till 10th grade the schooling is mostly based on rote learning and basic applications of some concepts, which might make someone think it is easy to score marks but at he same time such a system doesn't generate knowledge or life skills in students. According to me a schooling system should be one where a person gains some amount of knowledge and information on various subjects taught to him, but the content should include topics which are extremely essential for his life. For example, why do 15 year olds need to memorize geographical conditions suitable for like verious different crops, or why does one have to remember the names ms functions of all cell organelles. Rather school should be a place where they gain more important facts concerning their life that they will be living. Rather than teaching them differentiation and integration, teach them how the financial system works, how it ‘integrates' various concepts of commerce because ultimately the world that they are going to live in revolves around money and nothing else. It is more necessary to know how to live your life ahead and be able to survive well in his fast changing world and have the ability to surpass any obstacle that comes. Some skills like first aid and CPR are a must and classes on sex education should gain greater importance. School shouldn't be a place where we just know and learn facts but should be a temple of true knowledge which guides us on the right path and helps us make our life choices whether is be our career or something more personal. Another very important thing missing in schools is the compulsory addition of sports for at least 3 hours a week. Recently we had students from Denmark visit our school and I was jealous on learning that they had 6vhours of sports at school each week. Sports not only refreshes the brain but also motivates us to be better at a secondary skill. Altogether I would conclude by saying that if schooling changes for the better, it would impact the society positively. For another interesting take on school I highly suggest watching this video:  Hope this helped! -Advait ",
            "date": "Answered February 3, 2019",
            "views": "152",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Siddhant Chandan",
                    "user_href": "/profile/Siddhant-Chandan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopinath V",
                "href": "/profile/Gopinath-V-80"
            },
            "answer_text": "This is a question asked every where and it the buzz… Schooling is always a best place to understand the society, remain patience for a better and best results, to earn we have to learn, how do our friends have difference of opinion, attitude and writing, speaking skills…know the culture of other countries … so many a things… unfortunate it is always given a bad taste that the whole education system is not in a good order … change is inevitable and schooling is not the one left out in the changing scenario … ",
            "date": "Answered February 13, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}