{
    "title": "What are some of Emilio Aguinaldo's major contributions? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Robert T. Wagner-Foundation",
                "href": "/profile/Robert-T-Wagner-Foundation"
            },
            "answer_text": "Oh, (as we say in northern Florida) ya’ll er gonna luv this one…. Contributions? By Aguinaldo? Well, we already know what he was most famous for: Hijacking the revolution against the Spanish from its originator, the amazing Andres BonifacioMurdering Bonifacio and his brother after a nonsensical kangaroo court trialTaking a bribe from the Spanish to quit hostilities and live in Luxury in Hong Kong, abandoning his noble troopsMurdering the finest general officer in the Katipunan, Antonio Luna, at the height of conflict with the AmericansWhat I write next is REALLY going to piss off the vast MINORITY, and it is hardly ever mentioned by historians, even those so-called “questionable revisionists”. Emelio Aguinaldo’s greatest and singular positive contribution to the Philippines was the fact that the Americans found out, almost too late, what a spoiled-rotten, degenerate, homicidal maniac the onerous little Ilustrado was, and thus made the conscious decision not to abandon the people of the Philippines to him and his nightmarish plans. The Anti-US 1%’ers will scream bloody hell, but they know the truth. Yes, there was a solid element of colonial avarice behind the American annexation of the islands, along with a justifiable desire to keep them out of the hands of France and Germany, but an altruistic desire to lift the Filipino people out of the terrible societal malaise that had been perpetuated by the Spanish through their Ilustrado lackeys was more than evident. This brings me back to Andres Bonifacio, a common man of meager beginnings with a big brain who had educated himself in English and consumed books on the lives of American Presidents, the examples of which invigorated him into open revolt against the Spanish with the hope of establishing US-style democracy as the new governmental system. Bonifacio’s legend was made known to and instantly respected by the US military in July of 1898. When his murderer, Aguinaldo, showed up in Singapore asking for American help after taking the “Biak-Na-Bato” money from the Spanish and leaving his own people in a lurch, it was obvious what made McKinley come to his decision. I’ll bet anyone reading this that, had Bonifacio been in charge of the Katipunan instead of Aguinaldo, The Philippines under Bonifacio’s leadership would have become a major US ally in the region, not a colony, as was the case in Cuba. The coup de grace for Aquinaldo’s contributions to the Philippines was his jumping on board with the Japanese during WWII, and voluntarily making radio broadcasts demanding that MacArthur and Filipino Resistance Fighters surrender. As was done when he was captured in 1901, the US again granted him amnesty after the war. No one who has ever studied “El Presidente” would ever suggest that, had the shoe been on the other foot, he would have done the same. ",
            "date": "Answered December 1, 2019",
            "views": "52",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Denise Antoneth Plangca",
                    "user_href": "/profile/Denise-Antoneth-Plangca"
                },
                {
                    "user_id": "Jessie",
                    "user_href": "/profile/Jessie-639"
                },
                {
                    "user_id": "Leila May Jimenez",
                    "user_href": "/profile/Leila-May-Jimenez"
                },
                {
                    "user_id": "AImee Dela Cruz",
                    "user_href": "/profile/AImee-Dela-Cruz"
                },
                {
                    "user_id": "Ramon Asuelo",
                    "user_href": "/profile/Ramon-Asuelo"
                },
                {
                    "user_id": "Carlo Uy",
                    "user_href": "/profile/Carlo-Uy-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Germaine Tang",
                "href": "/profile/Germaine-Tang"
            },
            "answer_text": "As the revolutionary, he defeated the army of Governor General Blanco in Cavite when the revolution had started. He is also the leader of revolutionaries in Cavite for your information. As the president, he ordered the creation of the Philippine flag and composition of the national anthem, and declared the nation’s independence from Spain on June 12, 1898. After that he spent 2 years running away from pursuing American forces until his capture in 1901 with the help of some traitors from Pampanga. ",
            "date": "Answered November 17, 2017",
            "views": "154",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AImee Dela Cruz",
                    "user_href": "/profile/AImee-Dela-Cruz"
                },
                {
                    "user_id": "Julianne Milar",
                    "user_href": "/profile/Julianne-Milar"
                },
                {
                    "user_id": "Kenneth Beloy",
                    "user_href": "/profile/Kenneth-Beloy-1"
                },
                {
                    "user_id": "Krizel Joy Delagado",
                    "user_href": "/profile/Krizel-Joy-Delagado"
                },
                {
                    "user_id": "Gie-Anne Rosales",
                    "user_href": "/profile/Gie-Anne-Rosales"
                },
                {
                    "user_id": "Florian Ocan",
                    "user_href": "/profile/Florian-Ocan"
                },
                {
                    "user_id": "Sean Huertas",
                    "user_href": "/profile/Sean-Huertas"
                },
                {
                    "user_id": "Marc Adrian Aguilar",
                    "user_href": "/profile/Marc-Adrian-Aguilar"
                },
                {
                    "user_id": "Sherlyn Juanitez",
                    "user_href": "/profile/Sherlyn-Juanitez"
                },
                {
                    "user_id": "Quennie Zyra Vayson",
                    "user_href": "/profile/Quennie-Zyra-Vayson"
                }
            ]
        }
    ]
}