{
    "title": "What is contemporary art in the Philippines like? - Quora",
    "tags": [
        "Art of the Philippines",
        "Contemporary Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Fairbanks",
                "href": "/profile/Philip-Fairbanks-1"
            },
            "answer_text": "There’s a very active art and music scene here. I recently visited Angono, the “art capital of the Philippines” which is in Rizal, considered the cultural capital of the islands. There are a number of galleries and museums in Angono and elsewhere. The Laguna region also has several graphic artists, indie komiks writers and artists and there’s a “zine scene” (self published magazine) that’s very lively with several conferences per year.  I have met a handful of indie komiks artists and authors when I visited the Komikon Grande festival in Pasig last November. Malantot by Iya Regalario, JV Tanjuatco’s Mythopolis, everything I’ve read by Lady Storykeeper, there’s so much great work coming out of the Filipino indie komiks and zine scene that I’ve seen so far and still getting into it.  If you’re going to visit and interested in the art scene, there are many galleries and museums in Metro-Manila, but make sure to check out Angono, Rizal as well. You can check out the art and sculptures in Balaw-Balaw or Nemiranda Arthouse while you wait on food if, like me, you love eating as much as feasting on beautiful art. If you get down around the Higantes festival in November you can also see the gigantic papier mache “puppets” (so large they’re operated from inside like a reverse marionette). The artist who founded Balaw Balaw restaurant and gallery is also the one who spearheaded the revival of traditional Higantes parade festival in the 80’s as well. I got a chance to talk to his son during my trip to Angono last year.  ",
            "date": "Answered January 23, 2019",
            "views": "31",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yuvraj Singh",
                    "user_href": "/profile/Yuvraj-Singh-3531"
                },
                {
                    "user_id": "Dave Miel",
                    "user_href": "/profile/Dave-Miel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joey Guadalupe",
                "href": "/profile/Joey-Guadalupe"
            },
            "answer_text": "2 of the most known Filipino artist in the Philippines are Fernando Amorsolo and Malang Manansala. They are considered national artists. Amorsolo: my personal favorite. His works usually depicts the typical Filipino farm life, the beauty of the Philippine countryside, the honor of work, and women.             Manansala: whereas Amorsolo depicts the farm life, Manansala depicts the street life of the poor.         ",
            "date": "Answered July 3, 2017",
            "views": "3",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Miel",
                    "user_href": "/profile/Dave-Miel"
                },
                {
                    "user_id": "Ringo Torao",
                    "user_href": "/profile/Ringo-Torao"
                },
                {
                    "user_id": "Philip Fairbanks",
                    "user_href": "/profile/Philip-Fairbanks-1"
                },
                {
                    "user_id": "Rheimaru Fayharth Boado",
                    "user_href": "/profile/Rheimaru-Fayharth-Boado"
                }
            ]
        }
    ]
}