{
    "title": "What made the Roman Army so powerful? - Quora",
    "tags": [
        "Roman Legions",
        "Roman Army",
        "Ancient Warfare",
        "Roman Empire",
        "Ancient Rome"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Mann",
                "href": "/profile/Alex-Mann-32"
            },
            "answer_text": "The Roman society. The real reason the Romans were unbeatable is always overlooked. Like everyone, I will go on about equipment, training, tactics and the like; but the biggest thing that enabled Rome to never lose was Roman culture.  You see, Rome was tenacious beyond reason. They just didn’t lose: if a battle was lost, or even if five Legions were lost, that didn’t mean Rome lost — it was just a small setback on the path to total, uncontested victory. The Romans just did not ever accept defeat. After the Battle of Cannae, Hannibal had totally eliminated the largest army Rome had ever assembled. Rome was open to attack, and Hannibal had beaten everything Rome could throw at him. Any reasonable nation would surrender right then and there, or at least try to negotiate. Not Rome, though — Rome just prepared for a siege and started drafting a new army. Surrender was never even considered… There were times when Rome lost battles, but it never cost Rome the war. They would win, even if it was through pure exhaustion. Hannibal won every battle, except for one. No matter how well he did, Rome kept coming, and after decades of conflict, Hannibal eventually lost. No matter what, Rome just kept coming, and this made them the worst enemy you could face.  THEIR EQUIPMENT: The Romans all had iron armor, iron weapons and strong shields, with every Legionnaire given a helmet, sword, large shield, iron chest armor, iron grieves and iron arm guards. They were among the most heavily armored armies in history. This heavy armament made them nearly unstoppable in the field. In open conflict, you’d always be outmatched. These guys were hard to kill, even if you could get past the rows of swords and heavy shields.Most armies at the time were made of up of roughly 90% Militia and 10% armored warriors. The Militia had light equipment, no armor, and maybe a spear, while the armored warriors sported a small amount of bronze or iron armor. The Romans were more of a 70/20/10 split, though: 70% would have extremely expensive and high-quality equipment, 20% would be Archers and have no armor, and about 10% would be Cavalry. Man to man, they were far better equipped than any other army on earth at the time.   THEIR TRAINING: Roman Legionnaires were trained — this was actually unusual for the time. The barbarian tribes and other empires would have a small core of trained warriors, but most armies were really just hordes of peasant farmers given a spear and a shield. The Roman Legions, on the other hand, were actually trained before they took to the field. They would drill fighting techniques, working as a unit, how to build forts quickly, and how to take commands on the fly. It is hard to overstate just how important this was. Most nations fielded armies with virtually no training; their men were given spears and pointed in the right direction. The Romans could form complex formations on the fly. They could retreat, turn or advance with only the wave of a flag. They could form into a Testudo formation to block all incoming arrows in under 10 seconds. The ability to get 25,000 men to work together in unison within seconds was something the rest of the world only dreamed of…  THEIR TACTICS: We often have this image of two armies just smashing into one another and the battle being pure chaos. This is actually false, and armies would instead meet up with their men in tight formations.  The Romans had a great method for fighting battles: What they would do was organize into big squares, basically. The man at the front would stab and fight for 6 minutes, and then a signal would sound. Once the signal sounded, the Legionnaire at the front would swap with the Legionnaire behind him and move to the back of the square. While there, he could get treated if he were injured, get some water, and then rest for a while. For every hour of battle, a Legionnaire would only have to fight for 6 minutes. This meant that the front ranks of the Roman army were always rested and ready to fight. Other armies did not do this, and after 10 minutes, the men at the front were exhausted and usually killed. While the other army got tired and started to break, the Roman Legions could keep pushing forward all day. These Legions could literally fight for twelve hours and still not be totally exhausted. This made them nearly unbeatable in the open. Everyone, from Boudica to the Parthians, would learn this lesson…  THEIR ABILITY TO BUILD: Roman Legions could throw up a fort in an hour or two, at the most. This seems crazy to us, but it was true… Roman Legions would travel with all of their equipment. Each small unit of men had their own pack animal, tents, wood, food, water and equipment. Every night the Romans would stop, throw together a makeshift fort with walls, watch-towers and gates, and then rest in the safety of their fort. Just imagine trying to fight an enemy like this. If you gave them two hours, on top of a hill there would suddenly be a fort up there. Taking forts is costly and difficult, and many armies lost to the Romans because of this.  At the Battle of Alesia, Caesar had the Gauls trapped inside a large town. In order to keep them from breaking out, he built miles of walls around the city and totally surrounded the Gauls. A Gallic relief army was approaching, though, so Caesar built another ring of walls around his first wall. This was something no other army could do… There are countless examples of this: they built bridges, massive towers, huge ramps and underground tunnels. They could out-engineer engineers, and were a mobile construction crew that carried their materials with them.  THEIR AUXILIARIES: The Romans had fantastic Heavy Infantry, and they knew it. In a stand-up Infantry brawl, Rome was nearly unbeatable, and they conquered nearly all of Europe on the back of these Heavy Infantrymen.  However, Rome did not have great [or even good] Cavalry, and they knew this. There is evidence that Caesar had no Cavalry at all when he went about conquering Gaul. To fill this void, Rome would use Auxiliaries. An auxiliary soldier was a non-Roman soldier that served in the Legions in a specific role. For instance, Caesar utilized Gallic auxiliary Cavalry to great effect, as the Gauls were fantastic horsemen. When Rome conquered some new tribe, they were usually very gentle and non-invasive. They would require men to fight in the Legions, though, and were keen to find good Horsemen, Archers, or other types of Infantry. Rome would go on to utilize these various Auxiliaries to great effect. Sarmatian Cavalry, Numidian Cavalry, Spartan Hoplites, all could be found in the Roman Legions, and this filled any gaps left by Rome's over-emphasis on Heavy Infantry.  THEIR LOGISTICAL ABILITY: As I said, the Romans were able to bring everything with them. They had pack animals and large baggage trains with every Legion, and this enabled them to travel deep into enemy territory. Food is often overlooked in the history of warfare. People love battles, but they forget that battles are fought by people, and people need food. The Romans didn’t forget this, though; they brought literal tons of food with them, and this gave them some breathing room when conducting sieges or operating deep in enemy territory.   THEIR ORGANIZATION: The Roman Legions organized themselves in fascinating ways. The name of the game in all warfare is small unit tactics: the smaller each command unit is, the more flexible your army is. If your army can only move as one big unit, it is practically worthless; but if your army can do a myriad different things at once, its tactical potential is boundless…  Here is how the Roman Legion was generally organized: The Contubernium: This was the smallest unit in the Roman army [think of modern Infantry Squads]. It was made up by 8 Legionnaires and 2 slaves/servants. These men slept together [not like that…], ate together, fought together, and if one of them died, the others would take care of their fallen comrade’s family. Each Contubernium carried its own supplies on its own pack animal. In addition, each man in a Contubernium had a specific job: one Legionnaire was a cook, another was the hunter, another was a blacksmith, one was an engineer, and one of them lead the unit. The leader was the Decanus, and was selected by a vote within the Contubernium.The Century: This was the next unit up [think of modern Infantry Companies], and was made up of 10 Contubernium, meaning 80 Legionnaires and 20 slaves/servants. It was lead by a Centurion, who was selected from the leadership of the Legion (typically, the most experienced Legionnaires were given this job).The Cohort: This was made up of 6 Centuries [think of modern Infantry Battalions], and totaled about 480 Legionnaires and 120 slaves/servants. Each Cohort had a unique trumpet call, and could be ordered around individually. The leadership of a Cohort was interesting: of the 6 Centurions, the most experienced was the leader of the Cohort.The Legion: 10 Cohorts made up a legion [think of modern Infantry Regiments or Brigades]. A Legion’s leadership was interesting: there were 3 leaders — a Legate was the leader appointed by the Senate; the military Tribune was elected by the People; and a camp Prefect was elected by the Legionnaires. So each command unit of a Legion represented the People, the Senate, and the Legionnaires.In every Legion, there was a mix of bottom-up and top-down leadership. There were leaders selected by the People, by the Senate and by the Legionnaires. Whenever a decision was made, all three of these groups were represented, and this was an incredibly versatile and organized structure — it allowed for good decisions to be made, and ensured no one man could recklessly destroy the Legion.  ROMAN MEDICINE:[*Credit to Tony Birchill for coming up with this point.] During the life of the Roman Empire, the best most doctors could hope to do was to not make things worse. There were many, though, that were able to make things noticeably better… When injured in battle, Roman soldiers could expect to have their wounds treated, provided they were not too severe. While Roman medicine was primitive compared to our own, it was on the cutting edge of medical technology for the time. Roman doctors took after the Greek tradition of medicine, and approached healing from a scientific perspective, rather than spiritual. Doctors would have a set of seemingly modern instruments (pictured below), and would be able to perform basic procedures to help relieve pain and heal injured Legionnaires. You could even compare this style of medicine to that used in the American civil war.  The tribes and empires that Rome faced were not as competent when it came to medicine. The Persians would go on to lead the world in medical technology after the fall of Rome, but this was in large part due to Roman and Greek influence jump-starting the concept.  *IMPORTANT NOTE Many people have pointed this out, so I will add it briefly: the army I described above is the atypical Roman military that we all imagine. While this was indeed the military Rome used during the peak of its power, it did change quite a lot over time… I am going to shortly cover it all here, so that everyone can at least have a glimpse of how the Roman military changed over the years: • 509 BC — 300[ish] BC: Rome used a Greek-style Phalanx. For those that do not know, this system relies on Heavy Spearmen standing in a tight formation, with their large shields forming a wall. This formation was nearly unbreakable, and could fight for hours; however, it was terrible on rough terrain, and was also slow to move around. This changed during the Second Samnite War, when Rome realized that more mobile flexible Infantry was required to fight the new wars it began to find itself in. • 300[ish] BC — 101 BC: The Manipular Legion was introduced in the Second Samnite War, as Rome required a more modern, flexible army to fight in the difficult terrain it found itself in. The army was broken down into five types of soliders: The Hastati: These were the average grunts, with light bronze chest armor, shin guards, a shield, a sword and two javelins. They were similar to Legionaries in all but their armor. These guys would engage in hand-to-hand combat similarly to the later Legions, already with the rotation of the front line.The Principes: These were more experienced Hastati — typically, they would have slightly better armor, but not always. These guys would fight after the Hastati were tried. This worked well because as a battle went on, a tried enemy would find itself facing down fresh veterans, and this often broke opposing armies.The Triarii: These were the hardened veterans of the Roman military. They fought in a Phalanx, and remained in reserve in case of disaster.The Velites: These were light skirmishers, armed with javelins or slings.The Equites: This was the Cavalry. The Cavalrymen (Eques) were usually equiped with a round shield, and armed with a spear and sword. Stirrups had not yet been invented, so they would rarely charge into an enemy army head-on — they would attack skirmishers, flank enemy armies, or engage other Cavalry units.Now, here is the kicker: not only were these men unpaid, but they also bought and financed ALL of their own equipment. Imagine a U.S. Marine not only being unpaid, but having to go out of his/her pocket for uniforms, weapons, equipment and ammunition, provisions… Only land-owning citizens could join up, and buying military gear and going off to serve was seen as honorable and noble. The richest families who could afford horses were Equites, while the average land-owner was a Hastati — and the poor, the Velites. Not having to equip or pay for an army obviously had its advantages, but at the same time, good luck keeping a 100% unpaid, volunteer army in the field for very long — also, when only land-owners can serve, your recruitment pool is very limited… • 101 BC — 290 AD: This is when the Cohort system I described above became the primary way Rome fought, restructuring the Legion. In 101 BC, a man named Marius decided to reform the Roman military and create this new system we are all so familiar with. He had found that Rome needed professional soldiers and more recruits in order to fight its ever-larger wars. They needed to keep Legions in the field and away from home for years or decades, and they needed to be able to rely on these Legions to be professional. Marius would introduce the first set of reforms, with his contemporaries eventually refining the system over time into what we all know and love. • 290 AD — 476 AD: These are the chaotic years. Diocletian would reform everything in a desperate attempt to save the empire. With a lack of recruits, money and time, the Roman army became increasingly weaker. Eventually, it would be a mix mash of barbarian mercenaries, recent immigrants who did not speak Latin, and the occasional Italian officer. The quality and availability of armor would decrease, and training standards would be laxed. In the end, you would be hard-pressed to tell apart the Roman army and the barbarian horde it was fighting… ",
            "date": "Updated April 28, 2020",
            "views": "903",
            "upvotes": " View 3.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Philip Tilden",
                    "user_href": "/profile/Philip-Tilden-5"
                },
                {
                    "user_id": "William Michael Fenton",
                    "user_href": "/profile/William-Michael-Fenton"
                },
                {
                    "user_id": "Hutomo Aksan",
                    "user_href": "/profile/Hutomo-Aksan-3"
                },
                {
                    "user_id": "Napoleon Bonapart",
                    "user_href": "/profile/Napoleon-Bonapart-5"
                },
                {
                    "user_id": "Sas Sassy",
                    "user_href": "/profile/Sas-Sassy"
                },
                {
                    "user_id": "Kyth Caign",
                    "user_href": "/profile/Kyth-Caign"
                },
                {
                    "user_id": "Erik Cortese",
                    "user_href": "/profile/Erik-Cortese"
                },
                {
                    "user_id": "RISHABH RAVIPRASAD",
                    "user_href": "/profile/RISHABH-RAVIPRASAD"
                },
                {
                    "user_id": "Keisi Lesi",
                    "user_href": "/profile/Keisi-Lesi-1"
                },
                {
                    "user_id": "Hunter Haley",
                    "user_href": "/profile/Hunter-Haley-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David M. Prus",
                "href": "/profile/David-M-Prus"
            },
            "answer_text": "Size. The Roman army was big. It was a profitable career after Marius, and before then was a militia of a large population. The Romans could lose tens of thousands of men and still go on to win the war.Tactics and leadership. The Romans were skilled. They studied battles and adapted to enemy tactics. Their armies were flexible, and the Roman system rewarded veterans, allowing for skilled soldiers to climb the ranks of leadership. Men like Lucullus, Marius, Sulla, Pompey, Scipio, Caesar, and many many others won their glory by brilliant battlefield exploits. They were also skilled diplomats-so while the Romans fought as infantry, they could rely on allies and auxiliaries to provide archers, skirmishers, slingers and cavalry.Organization. The Roman army was very well organized. Instead of a big mass of men, it was subdivided endlessly, with each unit having a measure of autonomy. Where a general was not present or able to lead a smaller unit, the officer could take command of the situation and the men could still receive leadership. No matter how big the army, or how confused the battle, a Roman army would be able to keep organized and controlled. Each unit used flags and music to communicate with each other for a larger coordinated effort.Equipment. All Roman soldiers were well protected and armed-iron helmets and torso armor, as well as a large wooden shield kept them safe. Spears, javelins and darts (depending on the era) allowed for some distance, while their sturdy two-bladed swords could both slash and thrust efficiently in close-quarter combat. In addition to their weapons, Romans carried their supplies on their backs to be self-sufficient, and each man carried a water skin, rations, a wooden stake and an entrenching tool. Finally, Romans were skilled artillerists, adopting Greek war machines and improving on them. Bolts, incendiaries, stones, and darts were thrown by powerful torsion engines both on the battlefield and against fortificationsTraining. Roman soldiers would spend months marching, drilling, fencing, and engaging in brutal mock combat. Regulations were strictly enforced, and punishments ranged from exile to beatings to death. A Roman soldier would be hardened by training before he ever drew blood on the battlefield.",
            "date": "Answered July 4, 2018",
            "views": "2",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Brady",
                    "user_href": "/profile/Patrick-Brady-50"
                },
                {
                    "user_id": "Bryan Jones",
                    "user_href": "/profile/Bryan-Jones-155"
                },
                {
                    "user_id": "Charlotte Little",
                    "user_href": "/profile/Charlotte-Little-28"
                },
                {
                    "user_id": "Pauline Ward",
                    "user_href": "/profile/Pauline-Ward-27"
                },
                {
                    "user_id": "Brandie Pierce",
                    "user_href": "/profile/Brandie-Pierce-4"
                },
                {
                    "user_id": "Julian Wilson",
                    "user_href": "/profile/Julian-Wilson-80"
                },
                {
                    "user_id": "Sreeram Unnithan",
                    "user_href": "/profile/Sreeram-Unnithan"
                },
                {
                    "user_id": "Jordyn Mendola",
                    "user_href": "/profile/Jordyn-Mendola"
                },
                {
                    "user_id": "Priscilla Scott",
                    "user_href": "/profile/Priscilla-Scott-27"
                },
                {
                    "user_id": "Lee Taylor",
                    "user_href": "/profile/Lee-Taylor-360"
                }
            ]
        }
    ]
}