{
    "title": "What led to the rise of the Ottoman Empire? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mert Cebeci",
                "href": "/profile/Mert-Cebeci-2"
            },
            "answer_text": "There are some factors, so I should make a short list: Solid Organization: Ottoman Empire was built on a solid organization. In every aspects of a state, Ottomans were well-organized. Justice system, trading, politics, military, diplomacy, economy, everything was well organized. While it’s rivals were struggling with feudalism, Ottoman Empire was already optimized feudal structure to it’s benefit.Innovative State Mind: Ottoman Empire was only a Beylik once, which means a Principality. House of Ottomans were Oghuz Turks, who were Muslims but still very much Turkic, and they were progressive and innovative, until Selim I took Egypt and the title of Caliph with it. For example, Mehmed the Conqueror used huge cannons to bring down Constantinople’s unbreachable walls, while their rivals mostly using catapults and trebuchets. Also, Ottoman Army was one of the first armies that utilized firearms. So, Ottoman Empire was always one step ahead from their rivals.Geographically Lucky: Ottomans were luckier than most of other Turkish Beyliks, being neighbors with collapsing Byzantine Empire was a blessing for Ottomans. While their equals fought each other to death, Ottomans fought against “infidel” Byzantine, which made Ottomans favorite in jihadists eyes, and even other beyliks send troops to Ottomans to use Ottomans as a buffer between them and Byzantine threat. Ottomans used this force into perfection.Invincable manpower: Ottomans, once they conquered most of Anatolia and Greece, had the most manpower in both Balkans and Middle East. Plus they used Devshirme System to utilize non-Muslim boys. This manpower allowed Ottomans to resist even united Crusader armies by themselves. This manpower, combined with organized army structure, innovative rulers and Turkic warrior traditions, allowed Ottomans take Balkans one handedly.Strategic Invasions: Ottomans NEVER forced a region into submission after one war. If the region looks hardy and resistant, they always propose vassalizing them, and whether they accept or not, Ottomans vassalize them one way or another. Then they just place Turkish people and make locals get warm to Turkish traditions and rule, then Ottomans, when they feel like it’s time, they just integrate the vassal into empire. This tactic never disappointed Ottomans in history as I know.So these are the reasons I know about Ottoman rise. I hope you like it. ",
            "date": "Answered February 17, 2018",
            "views": "95",
            "upvotes": " View 49 Upvoters",
            "upvoters": [
                {
                    "user_id": "Just Simple",
                    "user_href": "/profile/Just-Simple-13"
                },
                {
                    "user_id": "Isaac Lloyd",
                    "user_href": "/profile/Isaac-Lloyd-23"
                },
                {
                    "user_id": "Mus Mus",
                    "user_href": "/profile/Mus-Mus-38"
                },
                {
                    "user_id": "Mary Abdul",
                    "user_href": "/profile/Mary-Abdul-2"
                },
                {
                    "user_id": "Khairunnisa Kamaruzaman",
                    "user_href": "/profile/Khairunnisa-Kamaruzaman"
                },
                {
                    "user_id": "Andrew Broski",
                    "user_href": "/profile/Andrew-Broski"
                },
                {
                    "user_id": "David Badejo",
                    "user_href": "/profile/David-Badejo-1"
                },
                {
                    "user_id": "Arda Sonmez",
                    "user_href": "/profile/Arda-Sonmez-1"
                },
                {
                    "user_id": "Robert Allender",
                    "user_href": "/profile/Robert-Allender-1"
                },
                {
                    "user_id": "Eman A.R.M.Y",
                    "user_href": "/profile/Eman-A-R-M-Y"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lemmy Friedric Nieztche",
                "href": "/profile/Lemmy-Friedric-Nieztche"
            },
            "answer_text": "There are many reasons, i can answer that i have known;1-) Military: First of all, Ottoman Roots are belong to Central Asia their military tactics are usually became succesful in Middle East and Eastern Europe. But that’s not the only reason, for example Mamluks were A turkic Country too as well as Safavids are too. They used chemistry in war a lot. Conventional war machines such as cannons were dominant in Ottoman Army. Until 18th century Ottoman Empire’s war technology was the best in world. Also they used central powers. İn a war all tropps were controlled by the Sultan. However in Europe Central Powers were weak, the main troops were controlled by different Barons. So sometimes Barons refused to go in a war, or didn’t obey King’s orders etc. That Means fail! After Reunasans and Reform movements, Barons lost power and so that Kings become stronger. As you mentioned. After this era Ottoman reign declining. And at last Janisseries were the loyal troops to Sultan2-) Tax System: Even Ottoman Empire was an İslamic State, Goverment didn’t mention people’s religion. Do your duty, pay your taxes you’re fine. Surely as being an İslamic State they get more taxes from other religious groups. 3-) Byzantine Heritage: Ottoman Empire used Byzantine Heritage a lot, so that some historians called Ottoman Empire “ İslamic Byzantine(Roman Empire) or other Turkic States used to call Ottoman Sultans: “ Sultan Of Rum”( Roman Sultan) As you know Roman Empire was lasted almost 1500 years. Many Empires which was stronger than Roman Empire was collapsed but Roman Empire had remained until 1453. Because they have a well system. Ottomans used this system in their goverment also. There are a lot of details in this system but “ Do your duty, pay your taxes your life, your goods and your honour is safe” is the most important one. ",
            "date": "Answered August 28, 2016",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Badejo",
                    "user_href": "/profile/David-Badejo-1"
                },
                {
                    "user_id": "Robert Allender",
                    "user_href": "/profile/Robert-Allender-1"
                },
                {
                    "user_id": "Burak Madan",
                    "user_href": "/profile/Burak-Madan"
                },
                {
                    "user_id": "Mohammed Kalam",
                    "user_href": "/profile/Mohammed-Kalam-1"
                },
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                },
                {
                    "user_id": "Sheila Coldiron",
                    "user_href": "/profile/Sheila-Coldiron"
                },
                {
                    "user_id": "Arslan",
                    "user_href": "/profile/Arslan-7"
                },
                {
                    "user_id": "Ahmet Arslan",
                    "user_href": "/profile/Ahmet-Arslan-3"
                },
                {
                    "user_id": "Mahmut Furkan Yilmaz",
                    "user_href": "/profile/Mahmut-Furkan-Yilmaz"
                },
                {
                    "user_id": "Murat Ka",
                    "user_href": "/profile/Murat-Ka-1"
                }
            ]
        }
    ]
}