{
    "title": "What are some small, seemingly insignificant things, that changed the course of history forever? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Nathan Worrell",
                "href": "/profile/Nathan-Worrell-2"
            },
            "answer_text": "Gaius Julius Caesar's grandfather (also called Gaius Julius Caesar) had too many children and inadvertently created the Roman Empire. Gaius Julius Caesar (the grandfather, called Julius Caesar II by historians) had at least 3 children: Gaius Julius Caesar (father of the dictator), Sextus Julius Caesar and a daughter Julia. He may of had a second daughter, called Julia Minor or Julilla. This normally wasn't too bad for senatorial Roman family, but this family wasn't really normal. The Julii Caesarones were one of the oldest and most prestigious families in Rome, it was said they were descended of Latin kings who predated Rome itself. By the 1st century BC however the family's fortunes had dwindled. To qualify as for the senatorial class in Rome one had to own a certain amount of land. Julius Caesar II had just enough land to remain in the Senate but he wasn't rich enough to reach the consulship. He couldn't provide a valuable dowry for his daughters so no senators wanted to marry them and when he died his lands would be divided between his sons and neither would have enough to remain in the Senate. This left grandpa Caesar in a quandary over what to about his children’s futures. This was common among Rome's oldest families and many simply vanished from history. But one day grandpa Caesar arranged a marriage for his eldest daughter Julia to an elderly senator who had no famous ancestors but was extremely rich, Gaius Marius of Arpinum. Marius was from a rich Italian family who had had a successful military career and reached the rank of praetor bit he couldn't reach the consulship because he was considered to be a “new man”. Grandpa Caesar found the solution to his family problems by marrying Julia to Marius. By marrying Julia Marius was attaching himself to one of the oldest and most respected families in Rome, allowing him to eventually win the consulship. In exchange Marius agreed to marry Julia with no dowry (he was rich, he didn't need the money, only the name) as well as provide grandpa Julius’ sons with patronage and support in their own political careers. So this seemingly innocuous aristocratic marriage has the dual effect of not only thrusting Marius into the consulship for an unprecedented 7 times, during which Marius defeated the Germanic invasion of Italy and reformed Rome's armies into the famous fighting force it's known for today, but it also kept the Julius Caesar family in the senatorial class. This of course allowed the famous Julius Caesar Dictator to use the army created by Marius to eventually overthrow the Republic and set off the chain of events that led to more than 400 years of Roman Imperial dominance (1500 years if you include Byzantium). It's also possible, though not specifically stated in the historical sources, that Julia Minor was also grandpa Caesar's daughter. Julia Minor was the wife of Lucius Cornelius Sulla, the first Roman to march on Rome and declare himself dictator. Sulla was a protégé of Marius and by marrying Marius’ wife's sister Sulla was pinning his fortune to Marius’ rising star. Eventually Sulla and Marius became bitter enemies jockeying for control of Rome, purging eachother's supporters when they took control. Grandpa Caesar's wise marriage arrangements meant that the Julii Caesarones had a foot in both camps, which meant they were able to survive the first round of civil wars which would eventually wipe out most of the other ancient Roman families. ",
            "date": "Answered September 1, 2016",
            "views": "716",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Clark",
                "href": "/profile/Matthew-Clark-38"
            },
            "answer_text": "Ptolemy, who died in 168, estimated the size of the Earth as too small, which overestimated the distance to the eastern coast of Asia. While Eratosthenes found 700 stadia for a great circle degree on the globe, Ptolemy uses 500 stadia in the Geography. Because Ptolemy derived many of his key latitudes from crude longest day values, his latitudes are erroneous on average by roughly a degree (2 degrees for Byzantium, 4 degrees for Carthage), though capable ancient astronomers knew their latitudes to more like a minute. (Ptolemy's own latitude was in error by 14'.) He agreed (Geography 1.4) that longitude was best determined by simultaneous observation of lunar eclipses, yet he was so out of touch with the scientists of his day that he knew of no such data more recent than 500 years before (Arbela eclipse). When switching from 700 stadia per degree to 500, he (or Marinos) expanded longitude differences between cities accordingly (a point first realized by P.Gosselin in 1790), resulting in serious over-stretching of the Earth's east-west scale in degrees, though not distance. (Source: Ptolemy) Years later, Christopher Columbus came along.    The educated opinion in Columbus’s day was that the earth was a sphere about 24,000 miles in circumference. Therefore, since China was some 8,000 miles to the east, the conventional wisdom held it impractical to sail west for 16,000 miles to reach the orient. That is why Columbus had such a hard time finding people to support his idea. Columbus had calculated the earth’s circumference at only 18,000 miles, and he also believed Ptolemy’s over-estimation of the eastward region of Asia. Combining these two errors, he came to the conclusion that Japan was only about 3,000 miles to the west of the Canary Islands. Chris made some additional mistakes. He believed the length of a degree was 56.66 miles, when it is actually nearly 69 miles (at the equator). It is possible that if Columbus was correctly informed on the earth’s circumference and the length of a degree, he might have stayed home. Ptolemy’s mistaken calculations were a good mistake for Chris and his crew. (Source: The Error of Christopher Columbus) ",
            "date": "Answered April 14, 2015",
            "views": "863",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Therrell Gaskins",
                    "user_href": "/profile/Therrell-Gaskins"
                },
                {
                    "user_id": "Francisco Manuel Bernal",
                    "user_href": "/profile/Francisco-Manuel-Bernal"
                },
                {
                    "user_id": "Łukasz Golon",
                    "user_href": "/profile/Łukasz-Golon"
                }
            ]
        }
    ]
}