{
    "title": "What is the origin of the Ukrainian coat of arms? - Quora",
    "tags": [
        "Coats of Arms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Lyashenko",
                "href": "/profile/Alex-Lyashenko-1"
            },
            "answer_text": "Thank you for interesting question. First I will give the known facts, and then - their interpretations. The facts What we know definitely is the fact that the Princes of Rus (please mind, Rus is not Russia) from Rurik dynasty had personal emblems. Actually it was not a coat of arms, but rather a personal seal. Heraldry arose in the XIIth century, and we are talking about the Xth. From the archeological materials we can see that every Prince slightly (sometimes not slightly) changed the emblem. The scholars have made \"a family tree\" of emblems of Rurikovichs.  Modern coat of arm of Ukraine is the emblem of Volodymer the Great. 11 gold and about 300 silver coins of Volodymer with this emblem have come down to our time.  This is the silver one. By the way we even have some bricks from that time with the Prince emblem.  When Ukraine renewed its statehood in 1918 this coat of arms was officially adopted on March 22, 1918. Mykhailo Hrushevsky, then the leader of Ukrainian People's Republic wrote on February 28, 1918: \"Ukrainian People's Republic, having become a new state, independent, had to choose a state emblem. And as Ukraine was before the independent state and now has restored the state being, of which we were deprived by the Moscow violence, the most natural is to turn to the state signs or coats of arms used in the olden days. The oldest such sign was used on the Kyiv money in the days of Volodymer the Great, his coat of arms is our restored Ukrainian state coats of arms. This is absolutely correct. \" In 1991 this coat of arms was confirmed. The origin of the coat of arms of Ukraine from the personal symbol of Prince Volodymer is directly recorded in the Constitution of Ukraine: “The head element of the great Sovereign coat of arms of Ukraine is the Sign of the Prince Volodymer the Great (Small State Emblem of Ukraine)”. That is, Ukraine officially declares the continuity of the modern state from Rus. Modern coat of arms is slightly different from the Volodymer emblem.  Interpretations What does the emblem mean? This question is much more difficult to answer. Let me briefly observe the most popular assumptions. Some researchers see in this emblem an attacking falcon. Falcon as dynastic emblem of Rurikovich. Opponents denied this, since the falcons and eagles are depicted on the coats of arms with their heads up - just such a picture of a bird is a symbol of power that has a divine origin. Since the emblem was slightly changed before the Baptism of Russia, other scholars say that the Falcon is not a dynastic but a religious sign symbolizing the sanctifying effect of the Holy Spirit. The Falcon of the Holy Spirit as the state emblem pointed out that the state carried out a ritual sanctification-initiation, similar to the consecration-initiation of Jesus in Jordan.  Baptizing of Jesus in Jordan Arianic Church in Ravenna (Italy), 5-6 centuries. The Holy Spirit is represented by a white falcon pouring grace. Near Jesus is depicted John the Baptist and the god of the Jordan River in the form of an elder with a jar and a reed. Most of the apostles are young people, one third of them are without beards. They say that Jesus was preaching the Kingdom of God, or the space of the Will. In our coat of arms, the word «Воля» is encrypted. In Ukrainian this word means Will and Freedom.  One more idea. Look carefully at the emblem as it was pictured in old times.  There is also a group of researchers who say that this image is not a Falcon flying down, but a swan that flies up. It is very much alike. In Ukrainian, the Swan is a symbol of regeneration, purity, chastity, proud loneliness, nobility, wisdom, prophetic abilities, poetry, courage, perfection. A pair of swans is devotion and loyalty in married life. In the ancient tradition, the creator of the universe (Diaz, Zeus) embodied the Swan, and the chariot of Sunshine Apollo Hyperborean was drawn by snow-white swans. I guess you understand that the abundance of hypotheses suggests that the exact answer is not known to us. But it does not matter. What matters this is the fact, that we have a wonderful coat of arms that exists on our lands for more than 1000 years. The sources: https://www.radiosvoboda.org/a/29515084.html http://www.chytomo.com/iak-i-chomu-tryzub-stav-herbom-ukrainy-7-faktiv-iakykh-vy-mozhete-ne-znaty/ https://www.ar25.org/article/rozgadano-tayemnyy-sens-gerba-ukrayinskoyi-derzhavy.html ",
            "date": "Answered June 7, 2019",
            "views": "869",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harmen Ströntistel",
                    "user_href": "/profile/Harmen-Ströntistel"
                },
                {
                    "user_id": "Michael Humeniuk",
                    "user_href": "/profile/Michael-Humeniuk-4"
                },
                {
                    "user_id": "Wasyl Kowalenko",
                    "user_href": "/profile/Wasyl-Kowalenko"
                },
                {
                    "user_id": "Ukurainajin",
                    "user_href": "/profile/Ukurainajin"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Ihor Hlubochenko",
                    "user_href": "/profile/Ihor-Hlubochenko"
                },
                {
                    "user_id": "Nathan Rothschild",
                    "user_href": "/profile/Nathan-Rothschild-5"
                },
                {
                    "user_id": "Ryan Buleza",
                    "user_href": "/profile/Ryan-Buleza"
                },
                {
                    "user_id": "Sergiy Yevtushenko",
                    "user_href": "/profile/Sergiy-Yevtushenko-1"
                },
                {
                    "user_id": "Stephan Kaiser",
                    "user_href": "/profile/Stephan-Kaiser-1"
                }
            ]
        }
    ]
}