{
    "title": "What anti-gun slogan makes you laugh until your stomach hurts? - Quora",
    "tags": [
        "Anti-gun",
        "Taglines, Mottos, & Slogans",
        "Laughing",
        "Gun Control in the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyle Jet Li",
                "href": "/profile/Kyle-Jet-Li"
            },
            "answer_text": "this type of logic.  anti gun people allow wooden stock frames but cant allow polymer frames? and adding a heat shield makes it sniper? this is like saying hey! you cant add stuff to your rifle even though you can still buy adjustable stocks, frames, flash hiders, muzzle breaks, and scopes. they are still the same base gun. which makes no sense and i die of laughter when i see these images. also the fact that there is a limit to magazine capacity! wtf  mags do not affect our guns nearly as much as it seems! plus the fact that they add extra weight seems like a fair disadvantage. biden has beat the NRA twice for 2 pointless things that he doesnt understand much about other than being harmful or scary. and honestly when anti gun people think of guns they think as brandon herrera says it “a box that is vaguely weapon shaped and bad shit happens to the person you are pointing it at” and the logic of the federal assault weapons ban. you are banning a select fire pump action or semi auto shotgun because of its name being spas 12 or special purpose automatic shotgun because it has select fire, long mag tube and or a folding stock which we have seen many guns in fact. going by that logic a folding stock ak would be banned. and going by that mag tube logic the benelli m4 with a 14 round mag tube would also be banned! same thing with the “street sweeper” shotgun. its just a shotgun with a integrated drum mag in place of a mag tube. tec 9. we can have ar pistols in 55.6 or 9mm but cant have a tiny semi automatic pistol with a non bullpup mag system??? and here is the kick in the ass. it didnt affect the rate of gun crimes! also elaborating on the phrase “a weapon of war” yes those were designed to be reliable because a millitary wants or needs a new rifle because they might be outdated by new gun technology. and there is most likely going to be a civilian version of that rifle whether you like it or not. plus the fact that the basic bolt actions you call “hunting rifles” were once LITERAL “weapons of war” back in the 1800s. so going by that logic every weapon to ever exist is a “weapon of war” which it isnt! for christ sake learn some history before you act like a cray person. the stupidity of the 1986 full auto weapons ban. this logic is stupid. so, any full auto made after 1986 is “dangerous” and the ones made before 1986 are “safer” and once again as brandon puts it “so i can buy a gatling gun made before 1986 because its “safer” but cant buy a full auto ak?” once again. logic makes no sense and they need to be taught more about the topic before they make laws to the day where even single shot 22’s are banned. or atleast. i hope not… also a funny fact i found was that anti gun people trying to take our right to bear arms cant because of the 2nd amendment and if america violates that then they are in big trouble. i dont know how big of a punishment you get for violating an amendment but pretty sure its not pretty. :) oh man, your boi found another image to cringe at.  look at the designed for hunting part. i want you to tell me dead in the eye that bolt actions were created for hunting. i want you to BRAVELY tell me that those are made for hunting. because they were NOT. once again that very “hunting system” was actually made for war before semi autos were invented. pump actions shotguns. once again the system was used for old trench guns back in wars before the spas 12, saiga 12, and benelli m4 were invented. now look at the weapons made for war section. the m16 and m4 are valid. what ISNT valid though it the ar 15. the armalite 15 is basically a civilian version of the m4 or m16. and very few are made to be full auto while all production models are semi auto.(millitary or factory production being an exception) next you put, oh god what is that thing. the m16 with a scope and barret heat shield and muzzle break. see, this is how much they actually know about guns, which is nothing to begin with. that sniper i am going to assume is a rifle chambered in 50 bmg. for those who dont know, the 50 bmg is a machine gun round for the m1919, a mounted machine gun. so tell me, that i am wrong and stupid and should shut up and go learn something worth my time. but i am not done yet so zip that gun slandering sound maker i call an anti gun mouth before i literally start correcting every claim and every person making guns look bad for future gun owners. the barret m82a1 was the first 50 bmg semi automatic rifle ever. and since then it has become the anti tank and lightly armored personnel’s favorites. still doesnt mean its illegal though. it has been allowed in many countries for videos like gun channels on youtube and experiments for most likely armor of any kind as a final test. oh lord forgive me there is hand guns on there. semi-automatic hand guns were developed after semi auto rifles. and the only one truely designed for war was the m1911. the first modern handgun created. (in my opinion) it had the slide, tilting barrel, and mag system built into in the grip. after double stack mags came to play the m1911 has become more of a display piece than a weapon of war yet still carried for it’s slim profile. and once again all guns were made to carry out a function and to be successful and reliable in doing that function. now onto revolvers. revolvers are once again more of a stylish piece than a weapon of war. although some people carry a revolver it is used commonly to shoot bigger handgun cartridgesfor funstylerevolvers have been known for their system which rarely or never jams. people who carry revolvers usually look for reliability and the power of the cartridge. ",
            "date": "Updated October 28, 2020",
            "views": "44",
            "upvotes": " View 124 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Rymer",
                    "user_href": "/profile/Tom-Rymer"
                },
                {
                    "user_id": "Rob Sykes",
                    "user_href": "/profile/Rob-Sykes-13"
                },
                {
                    "user_id": "Bryan Potratz",
                    "user_href": "/profile/Bryan-Potratz"
                },
                {
                    "user_id": "James Williams",
                    "user_href": "/profile/James-Williams-2496"
                },
                {
                    "user_id": "Phil Leary",
                    "user_href": "/profile/Phil-Leary"
                },
                {
                    "user_id": "John Schlosser",
                    "user_href": "/profile/John-Schlosser"
                },
                {
                    "user_id": "Stacy Queen",
                    "user_href": "/profile/Stacy-Queen-5"
                },
                {
                    "user_id": "Stephen Hjellum",
                    "user_href": "/profile/Stephen-Hjellum"
                },
                {
                    "user_id": "Devin Wilson",
                    "user_href": "/profile/Devin-Wilson-1"
                },
                {
                    "user_id": "Eric Solis",
                    "user_href": "/profile/Eric-Solis-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nate Ciccotelli",
                "href": "/profile/Nate-Ciccotelli"
            },
            "answer_text": "Well, I couldn't find the ad I was looking for, but this one will do:  For any who don't know, the black gun is an AR-15 platform rifle. That gun uses an intermediate powered round like the .223. The gun is semi-auto and has never been used by any military for combat purposes. The one specifically pictured is chambered in .22LR, suitable for hunting squirrels and rabbits and not much else. The gun below it is an M-1 Garand battle rifle. That gun uses the 30–06 round, which is a common high powered hunting round. The M-1 was the standard issue battle rifle for the US military during WW2 and during the Korean War. It is also semi-auto and has a much longer range than the AR. So to recap: the ad says that the intermediate powered, never-been-military-issued rifle is a weapon of war too high powered for civilians. And the the high powered, military-issued-in-2-wars rifle is ok for civilian use. Just goes to show that groups like Everytown and Moms Demand Action base all their claims and demands on the appearance of a gun rather than its actual performance. Also shows just how truly ignorant those groups are about the one thing they stand against. Ads similar to the one above always make me laugh. EDIT 10/24/20: So there have been several comments questioning whether or not this ad is real. Understandable. It's difficult to believe anyone can be that ignorant. Whether or not it's genuine, I cannot say 100%. To find that ad, I did a google image search for \"stupid everytown gun ads\". I scrolled quite a way down before I came across it (as I mentioned earlier, I was looking for a different ad I'd seen a while ago). I took a screenshot on my phone of the ad above and cropped out the time/battery/connectivity icons from the phone, as well as the caption under the pic. After all the comments questioning the ad's authenticity, I decided to post the un-cropped screenshot. I'll let you all decide if it's real.  To me it had just the right ring to be real, but this is the internet… ",
            "date": "Updated October 24, 2020",
            "views": "222",
            "upvotes": " View 2.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Sparazynski",
                    "user_href": "/profile/David-Sparazynski"
                },
                {
                    "user_id": "David Franklin Hammack",
                    "user_href": "/profile/David-Franklin-Hammack"
                },
                {
                    "user_id": "Greggii Kemp",
                    "user_href": "/profile/Greggii-Kemp"
                },
                {
                    "user_id": "Lucas Lee",
                    "user_href": "/profile/Lucas-Lee-57"
                },
                {
                    "user_id": "Fesal Deari",
                    "user_href": "/profile/Fesal-Deari"
                },
                {
                    "user_id": "Shounak Hinge",
                    "user_href": "/profile/Shounak-Hinge"
                },
                {
                    "user_id": "Ben Rent",
                    "user_href": "/profile/Ben-Rent"
                },
                {
                    "user_id": "Krrish Kapoor",
                    "user_href": "/profile/Krrish-Kapoor-4"
                },
                {
                    "user_id": "Oskar Dirlewanger",
                    "user_href": "/profile/Oskar-Dirlewanger-4"
                },
                {
                    "user_id": "Samuel Westbrook",
                    "user_href": "/profile/Samuel-Westbrook-2"
                }
            ]
        }
    ]
}