{
    "title": "What are the main causes that Robert Clive won the war and established the British Empire in India? - Quora",
    "tags": [
        "Robert Clive",
        "Crown Rule in India (1858-1947)",
        "British Empire",
        "History of Great Britain",
        "History of India",
        "Historical India",
        "World History",
        "Military History and Wars ",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Animesh Sabat",
                "href": "/profile/Animesh-Sabat"
            },
            "answer_text": "In 1757 CE, the English East India Company led by Robert Clive defeated the Bengal Subah of Nawab Siraj-ud-daulah in Plassey and established the British Empire in India. The victory of the British in this battle led to our European rule in India for 200 years! This along with the Second Battle of Tarrain are considered the 2 most important turning points in Indian history.  When we compare the Battle of Plassey with the battle of Tarrain we see certain similarities: A young and energitic king who is extremely patriotic and powerful ( Siraj-ud-daulah and Prithviraj Chauhan)An ambitious invader who wants to establish a new culture in India as well as loot the present riches ( Mu’izz-al-din Muhammad Ghori and Robert Clive)A traitor who betrays his own country as well as the king who is a son like figure to him ( Jayachandra of Kannauj and Mir Jafar)An unfortunate end to the young kingEstablishment of a new era for centuriesLooking at this, we can come to the conclusion that we have repeated some of the same mistakes throughout history due to which our country has been enslaved. Therefore it is important for us to study these instances in detail, learn from our mistakes and ensure we never repeat it. Now, lets analyze the Battle of Plassey: Background:  The Bengal Nawabs ( see flowchart) had long declared their sovereignity from the Mughal Empire and ruled Bihar, Bengal and Orissa. The dynasty begun when Murshid Quli Khan eliminated Mughal Influence in Bengal and established the Nasiri Dynasty. However the dynasty ended when his general Aliwardi Khan overthrew his grandson Sarfaraz Khan and established the Afshar Dynasty. In 1756, Aliwardi Khan died and was succeeded by his grandson Siraj-ud-daulah.  Nawab Siraj-ud-daulah There were multiple reasons for conflicts between the Bengal Nawabs and the English East India company: Every Nawab of Bengal from Murshid Quili Khan to Siraj-ud-daulah was an extremely strong ruler who asserted their power and autonomyThey refused to grant the Company concessions, demanded large tributes for the Company's right to trade, denied it any right to mint coins, and stopped it from fortifying its basesIt accused the Company of deceit under the allegations of depriving Bengal of its rightful revenue and undermining the dignity of the NawabThey particulary blamed the company for refusing to pay taxes, writing disrespectful letters, and trying to humiliate the nawab and his officialsOn the other hand the company felt that the Nawab was making unjust demands and ruining the trade of the company. They called for removal of duties to allow trade to flourish. It also wanted permission to buy villages and build forts to help improve tradeWar: As mentioned in the above section, the tensions between the Bengal Nawabs and the English East India Company peaked during the reign of Nawab Siraj-ud-daulah. The Nawab was disturbed when he heard of the recent battle of Arcot in which Robert Clive had deposed Nawab Chanda Sahib of Arcot and replaced him with Nawab Muhammad Ali. Fearing that he would be the next target of the company, he ordered the British who were busy fortifying Calcutta to leave at once. However the head of the English East India company of Bengal was not as clever as Robert Clive. Instead of taking a diplomatic decision, he began preparing to defend the half fortified territory. The gallant Nawab easily overpowered the British and recaptured Calcutta including Fort William ( the fort which was the source of all problems to begin with). However Robert Clive ( who was in the deccan at the time) decided to avenge the insult suffered by the company. He oragized his forces and mounted an attack on Calcutta. This time, the company prevailed and Fort William was recaptured. Nawab Siraj-ud-daulah was forced to allow the British to continue fortifying the city. However the devious Robert Clive did not believe in giving his rivals a second chance. He decided to eliminate his enemy forever.  At this point Clive began analyzing the Nawab and came to the following conclusions: Despite having a huge army, the Bengal army was largely weak due to lack of training and action.The Nawab also lacked modern weapons such as those of the BritishThough these points were very powerful realization’s, they were not enough to secure a victory. This was because Nawab Siraj-ud-daulah still had an army of 50,000 soldiers while Robert Clive had only 3,000 men ( just like the Second Battle of Tarrain, where Mu’izz had a smaller army). It was at this point that Robert Clive discovered a secret that would eventually establish British Rule in India. He found out that Siraj’s distant relative and general Mir Jafar had always wanted to be the next Nawab of Bengal. He met up with Mir Jafar in secret and offered to make him the next Nawab of Bengal provided he helped the British. The treacherous general agreed and a plan was made.  The two armies met at the Battle of Plassey (1757). The Bengal army was divided into 3 sections, one led by Siraj-ud-daulah the second by Mir Jafar and the third by Siraj’s loyal general Mir Madan. The British were divided into 6 sections. The Nawab gained an early advantage due to his allaince with the French. However, a heavy thunderstorm turned the situation around. The British used tarpaulins to protect their ammunition, while the Nawab's army took no such precautions. As a result, their gunpowder got drenched and their rate of fire slackened, while Clive's artillery kept up a continuous fire. However Siraj’s loyal general Mir Madan did not know this and charged at the British, hoping to achieve a quick victory by attacking unorganized forces. But the plan backfired, the artilery was so strong that the entire wing led by Mir Madan was destroyed and he was himself killed. When Nawab Siraj-ud-daulah heard of this, he ordered Mir Jafar to wait for his signal and gathered his own army to attack the British. Siraj expected Mir Jafar to charge when his section of the army was weakened. However no such thing happened. The army led by Mir Jafar simply stood there despite Siraj’s repeated signalling. The young Nawab stood betrayed and realized his downfall was near. Thus he attempted to escape using a camel. The Bengal army was routed and Mir Jafar was declared the new Nawab. Aftermath: Robert Clive knew that it would be extremely risky to let the deposed Nawab go. Therefore he sent his forces to pursue and capture Siraj. He met up with Mir Jafar ( who was so indebted to the British that he did whatever they told him to do) and further secured his claim by eliminating generals loyal to the previous regime. Then on 2 July 1757, he brutally executed the young Nawab Siraj-ud-daulah thereby sealing Mir Jafar’s accession. In order to give a clear message to other kings and citizens, he had the body of Siraj cut into pieces and paraded around the city, even in front of the late Nawab’s mother!  Masouleum of Siraj-ud-Daulah The war had various effects, both political and economic. However the most important fact was that the Company now had control over one of the most resource rich lands, thereby giving them an economic boost. This boost would eventually allow them to rule all of India Conclusion: Though there were multiple factors that contributed to the establishment of the British Empire via the Battle of Plassey, the main reasons were that Siraj-ud-daulah was young and inexperienced, the climatic factors during the war and the treachery of Mir Jafar. It is due to this reason that the name Mir Jafar is synonymous with traitor. When we see the similarities between the Second Battle of Tarrain, we come to the conclusion that though excellent military strategy of the opponent and favourable climatic conditions had a role, the two great freedom fighters ( Prithviraj Chauhan and Nawab Siraj-ud-daulah) would not have met their end if not for the traitor. Jai Hind Jai Bharat ",
            "date": "Answered October 30, 2020",
            "views": "275",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Esha Sharma",
                    "user_href": "/profile/Esha-Sharma-258"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murad Baig",
                "href": "/profile/Murad-Baig"
            },
            "answer_text": "Robert Clive’s often unprincipled audacity was perhaps the main reason that the English company of traders was able to steal a march over their French, Portuguese, Dutch and other European rivals. As with Shivaji, nearly a century earlier, his personality had been substantially shaped by a very troubled childhood. He, like Shivaji, grew up as a wild boy roaming with his gang of young friends and learned to be an independent and fearless leader who was to defeat much more powerful foes because he did not follow many of the expected conventions of warfare. Clive, born in 1728, and was the eldest son of thirteen children. He had been sent away to live with an aunt, grew up as an aggressive boy who roamed the town of Market Dreyton near Shropshire extorting money from shopkeepers. He was reportedly “addicted to fighting” and these qualities of courage, aggression and leadership was to change the course of the British in India. Though he had only a little education his father bought him a position as a `factor’ (clerk) in the East India Company in 1744. After a long voyage he took up his position in Fort St. George that later became Madras (Chennai). The First Carnatic War broke out soon after with the British fighting the French. Madras was captured and the captive garrison was required to swear to not fight the French. Clive refused and with a few followers escaped and walked south disguised as natives to Fort St. David (Cuddalore). Here he opted to join the company army and soon distinguished himself in a battle against the French in 1747. Soon after, he led a successful attack against the army of Tanjore that was to become the Second Carnatic War. In these and especially in the siege of Arcot Clive demonstrated great courage, leadership and the audacity. After two years in England he returned in 1755 as Deputy Governor of Cuddalore. Disasters in Bengal made the English send him to Calcutta that he helped recover from Siraj ud Dawlah the Nawab of Bengal after the infamous `black hole’ incident where some 141 Brirish prisoners died of asphixation in a tiny cell. The British boldly forces attacked the Nawab's camp during the early morning hours and Clive marched his small force through the Nawab's camp, despite being under heavy fire from all sides. By noon, Clive's force broke through the besieging lines and arrived safely at Fort William. In 1757 Britain and France were once again at war and Clive sent the fleet up the river against the French colony of Chandernagore while he besieged it by land. There was a strong incentive to capture the colony, as capture of a previous French settlement near Pondicherry had yielded huge prizes. Some officials of the Nawab's court formed a confederacy to depose the Nawab Siraj uddin ed by Mir Jafar, the Nawab's commander-in-chief. Admiral Watson, Governor Drake and Mr. Watts and Clive agreed to give the office of viceroy of Bengal, Bihar and Orissa to Mir Jafar, who was to also pay one million sterling to the Company for its losses in Calcutta and the cost of its troops. Clive employed Umichand, a rich Bengali trader, as an agent between Mir Jafar and the British. Umichand threatened to betray Clive unless he was guaranteed £300,000 in the agreement. To dupe him a fictitious duplicate agreement was shown to him with a clause to this effect. It was clearly an example of Clive's unscrupulousness. On 21 June 1757, Clive arrived on the bank opposite Plassey with an army of 1,100 Europeans and 2,100 sepoys with 9 field-pieces. The Nawab had drawn up 18,000 horse, 50,000-foot and 53 pieces of heavy ordanance, served by French artillerymen. For once in his career Clive hesitated, and called a council of sixteen officers to decide, as he put it, \"whether in our present situation, without assistance… would it be prudent to attack the Nawab, or whether we should wait till joined by some country (Indian) power.\" Clive himself headed the nine who voted for delay but, probably because of a letter received from Mir Jafar changed his mind. After heavy rain, Clive's 3,200 men and 9 guns crossed the river and took possession of the grove and on 23 June an engagement took place that lasted the whole day, during which remarkably little actual fighting took place. Gunpowder for the cannons of the Nawab was not well protected from rain and impaired them. Except the 40 Frenchmen and the guns which they worked, the Nawab’s army could do little to reply to the British cannonade. Clive had however already made a secret agreement with aristocrats in Bengal, including Jagat Seth and Mir Jafar and Clive restrained further attack for he trusted that Mir Jafar would abstain. He was fully justified in his confidence in Mir Jafar's treachery to his master, for he led a large portion of the Nawab's army away from the battlefield, ensuring a defeat. Clive lost hardly any European troops. 22 sepoys were killed and 50 wounded. It is curious in many ways that Clive is now best-remembered for this battle, which was essentially won by treachery rather than through fighting or any brilliant military tactics. The Battle of Plassey however established British military supremacy in Bengal, and was to lead to their conquest of India. In 1760, the 35-year-old Clive returned to Great Britain with a huge fortune of at least £300,000. His rough manner was not liked and many were jealous but he was made Baron Clive of Plassey as well as a member of the House of Commons. Clive left India for the last time in February 1767. In 1772 Parliament opened an inquiry into the Company's practices in India. Clive's political opponents turned these hearings into attacks on him. Questioned about some of the large sums of money he had received while in India, Clive pointed out that they were not contrary to accepted company practice and defended himself by stating \"I stand astonished at my own moderation given the opportunities for greater gain”. The vote completely exonerated Clive, who was commended for the \"great and meritorious service\" he rendered to the country. But he was deeply hurt and on 22 November 1774 died, aged just forty-nine. It was alleged that he had stabbed himself or cut his throat with a penknife or had taken an overdose of opium. ",
            "date": "Answered October 29, 2020",
            "views": "174",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vijay Anand",
                    "user_href": "/profile/Vijay-Anand-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aalha Singh",
                "href": "/profile/Aalha-Singh"
            },
            "answer_text": "There are soany causes of defeat of Sirajuddaula the Nawab of Bengal against lord Clive of East Ibdia Company but the main one due ti which nawab lost the war is cheating /deceive by his vazier Mir Jafar. This reason is above all and nawab has no scope to escape. By his act Mir Jafar is known as the most famous traitor in Indian history even above Jai chand who did it in 1192 ad against his brethern Prathviraj Chauhan. So he got the top slot as traitor and left jaichand behind in this act. So he is greatest traitor india ever produced and finally he was also faced same fate and deceived by his own son in law mir quasim in same manner. He ruled for very small time. ",
            "date": "Answered October 25, 2020",
            "views": "142",
            "upvotes": " Answer requested by Laxmi Devi"
        }
    ]
}