{
    "title": "What made the Tsar Bomba so powerful? - Quora",
    "tags": [
        "Tsar Bomba",
        "Weapons and Warfare",
        "Warfare and Nuclear Weapons",
        "Military Weapons",
        "Nuclear Weapons",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Pickering",
                "href": "/profile/Matt-Pickering-3"
            },
            "answer_text": "It was not new technology. It was simply a scaling of the available nuclear material and design to produce a larger yield. There is no upper limit to the power of a fusion weapon given the amount of fuel available. The Tsar Bomba was a completely impractical weapon and built at a time when high-yield weapons were at their zenith for development and testing. It was so heavy it was questionable whether or not it could have been turned into a deliverable bomb, its carrier aircraft was hideously vulnerable to interception and from the effects of the bomb itself and was terribly wasteful of fuel. And the Tsar Bomba was artificially limited in yield by using a lead tamper instead of U-238. Had uranium been used, the yield would have been over 100Mt, would have vaporized the dropping aircraft and dropped massive fallout over large areas of Russia. Other than the yield of the Tsar Bomba as being the most powerful explosion ever detonated by human beings, it isn’t that impressive technically or historically. The Castle Bravo test that ran away to three times its projected yield was far more influential. Both in terms of damage and fallout, the political damage and the fact it was discovered common lithium-7 could be used as nuclear fuel, changing weapons design going forward. The Soviet Union deployed a handful of multi-megaton warheads at 25Mt. Primarily as bunker busters to carve Cheyenne Mountain and other US bunkers out of the landscape. The heaviest US warhead at 9Mt was built for the same job. These warheads have long since been retired as accuracy has increased to the point to make them unnecessary. ",
            "date": "Answered January 9, 2017",
            "views": "43",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ptawde",
                    "user_href": "/profile/Ptawde"
                },
                {
                    "user_id": "Charles Reed",
                    "user_href": "/profile/Charles-Reed-109"
                },
                {
                    "user_id": "SK Maurya",
                    "user_href": "/profile/SK-Maurya-51"
                },
                {
                    "user_id": "Nikola Rašić",
                    "user_href": "/profile/Nikola-Rašić"
                },
                {
                    "user_id": "Justin Nguyen",
                    "user_href": "/profile/Justin-Nguyen-90"
                },
                {
                    "user_id": "Bharat Choudhary",
                    "user_href": "/profile/Bharat-Choudhary-62"
                },
                {
                    "user_id": "Warren Taylor",
                    "user_href": "/profile/Warren-Taylor-14"
                },
                {
                    "user_id": "Joshua Goins",
                    "user_href": "/profile/Joshua-Goins-1"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-1379"
                },
                {
                    "user_id": "Mike Stork",
                    "user_href": "/profile/Mike-Stork-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Tan",
                "href": "/profile/Evan-Tan-46"
            },
            "answer_text": "Scale and fusion. Here is how a normal nuke works: A neutron hits a big atom. Big atom splits apart and releases 3 more neutrons. 3 neutrons hit 3 big atoms. You get the point. Said “big atom” is usually uranium or plutonium. (There are more details, but I’m making this simple.) Here is how the Tsar Bomba works: First, there’s a nuke. Then the pressure and heat from this nuke reaches some hydrogen in the core. Something interesting happens. Hydrogen is the smallest atom possible. At such high pressures and temperatures, two hydrogen atoms can merge together into one. This releases a lot of energy, and more neutrons. Now, if you’ve been paying attention, you know what those neutrons can do. They can make even more uranium/plutonium fission. That’s a lot of energy. Why could the Americans never reach this power? Simply because the Russians went big. Castle Bravo, the biggest American bomb, relied on a similar principle but using lithium, also a small atom. Castle Bravo = 4.5 metres long, 1.3 metres in diametre Tsar Bomba = 7.9 metres long, 2.1 metres in diametre The Tsar Bomba was 4.58 times larger by volume. That is why it was so powerful. In truth, if Castle Bravo was the size of the Tsar Bomba, it would be much more powerful. But the Tsar Bomba is just big. ",
            "date": "Answered September 27, 2018",
            "views": "517",
            "upvotes": "0"
        }
    ]
}