{
    "title": "What do Catholics think of Martin Luther? - Quora",
    "tags": [
        "Martin Luther (historical figure)",
        "Catholics",
        "Catholicism"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Hough",
                "href": "/profile/James-Hough-1"
            },
            "answer_text": "I was raised in the Lutheran Church. In seven grade you must begin three years of regular Sunday classes to be confirmed. I made it about one month into these and decided that Martin Luther was nuts, and promptly left the Lutheran Church. Four years later I became a Catholic, and several years after that I started studying in a Catholic minor seminary to be a priest. I was fascinated by Martin Luther, and did a lot of reading concerning him. I found out that the man was probably mentally ill and emotionally unbalanced, he entered an Augustinian Friary for all the wrong reasons, and never quite got with the program. Subsequently, I have found out that Luther’s story was not all that uncommon for religious and priests of the 16th century. As any half-way educated Catholic can plainly see by reading his 95 Theses, Luther knew little to no Theology and seemed to be remarkably ignorant of his Catholic faith. We also know - from his own writings, that, although he was very diligent about his teaching and other duties, he failed to pray - at all, and would get so upset as to lock himself in his cell for long periods to try and force himself to pray. He never succeeded. He finally left his Friary - without permission, and proceeded to BREAK all of his solemn vows of poverty, chastity, and obedience. He became a foul mouthed bigot who hated Jews, hated the Bible, loved his women, and loved his “good German beer”. To read his “theology” is painful, and most of it will not get past the censors, due to his atrocious language. He completely gave up on God ever changing us and said we should commit adultery as many times as possible so that God would have more to forgive. He completely overthrew centuries of Christian theology, and sentenced generations of people to no sacraments - which are God’s ordinary means of giving us grace to live a Christian life. Of course, Martin Luther never thought that was necessary anyway. ",
            "date": "Answered July 31, 2017",
            "views": "31",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Berg",
                    "user_href": "/profile/Edward-Berg-1"
                },
                {
                    "user_id": "Michael Esser",
                    "user_href": "/profile/Michael-Esser-3"
                },
                {
                    "user_id": "Sean Mende",
                    "user_href": "/profile/Sean-Mende"
                },
                {
                    "user_id": "Robert Mccabe",
                    "user_href": "/profile/Robert-Mccabe-22"
                },
                {
                    "user_id": "Rach Elle",
                    "user_href": "/profile/Rach-Elle-16"
                },
                {
                    "user_id": "JaQuan Senegal",
                    "user_href": "/profile/JaQuan-Senegal"
                },
                {
                    "user_id": "Julie Nickell",
                    "user_href": "/profile/Julie-Nickell-1"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Chris Nash",
                    "user_href": "/profile/Chris-Nash-10"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda deMerle",
                "href": "/profile/Linda-DeMerle-1"
            },
            "answer_text": "He wrote a good song. We were at the end of Mass, one day, singing, “\"A Mighty Fortress Is Our God,” and my Baptist husband was incredulous. As we left church, he remarked that he couldn't believe that we were singing a Martin Luther song. I guess we just don't hold grudges like the others do, even though they killed as many of us as they say we did of them. Seriously, most Catholics don't give Martin Luther a thought, unless they have an unusual interest in history. History, unfortunately, is mostly written by non-Catholics, which is why my kids came home from school telling me that someone asked them why Catholics sacrifice babies. Just ridiculous shyte. And to think the other side of my family were Massachusetts Puritans. It gives me shivers. Personally? I think that Martin Luther was an earnest young man, sincere about his faith, who was shocked to learn that not everyone was as pure in their motives as he was and that he became disillusioned, of course, zeroed in on the indulgences offender, took a stand with the pope, who did not support the wrongs, reportedly, got caught up in the reformers’ agenda, and used, because when it was over and he wanted to weigh in on the big stuff, they rejected him and turned him out. He meant very well. His ideals failed, for he wanted a reformed Catholic Church, really, and from what I have read, died considering himself a devout Catholic, who still believed Catholic teaching, including the Holy Trinity, the Real Presence of Christ in the Eucharist and the honoring of Mary and was distressed at the disunity which now came from everyone interpreting scripture for themselves, without teachers. Now, this is from what I have read. Keep in mind that history is basically old gossip. ",
            "date": "Answered July 27, 2017",
            "views": "25",
            "upvotes": " View 44 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Franklin",
                    "user_href": "/profile/Henry-Franklin-3"
                },
                {
                    "user_id": "Robert Mccabe",
                    "user_href": "/profile/Robert-Mccabe-22"
                },
                {
                    "user_id": "Julie Nickell",
                    "user_href": "/profile/Julie-Nickell-1"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                },
                {
                    "user_id": "John Grantham",
                    "user_href": "/profile/John-Grantham-2"
                },
                {
                    "user_id": "Alfred Santos",
                    "user_href": "/profile/Alfred-Santos-6"
                },
                {
                    "user_id": "Patiwat Panurach",
                    "user_href": "/profile/Patiwat-Panurach-1"
                },
                {
                    "user_id": "Sebastian Müller",
                    "user_href": "/profile/Sebastian-Müller-51"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                }
            ]
        }
    ]
}