{
    "title": "What did China import from the silk road, historically? - Quora",
    "tags": [
        "Silk Road (historical trade route)",
        "History of China"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bartram",
                "href": "/profile/John-Bartram"
            },
            "answer_text": "Though I cannot offer an expert, comprehensive answer, I can just mention: Rome shipped so much gold eastwards that it ruined the Empire’s finances.Silk was then restricted to the elite.Roman gold coins have been found across India: they were used to date archaeological sites.A merchants storeroom was found underground in Afghanistan; it contains some of my favourite glassware:Begram : The GlassEnamelled glass depicting a gladiator, found at Begram, Afghanistan, which was once part of the Greco-Bactrian Kingdom, but was ruled by the Kushan Empire during the contemporaneous Roman Principate period, to which the glass belongs, 52–125 AD (although there is some scholarly debate about the precise dating).[3] More:    ",
            "date": "Answered July 18, 2020",
            "views": "339",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Holt",
                    "user_href": "/profile/Adam-Holt-28"
                },
                {
                    "user_id": "Jenni Jones",
                    "user_href": "/profile/Jenni-Jones-21"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                },
                {
                    "user_id": "Gia Dinh Hang",
                    "user_href": "/profile/Gia-Dinh-Hang"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Darmawan",
                "href": "/profile/Jake-Darmawan"
            },
            "answer_text": "Rome glass ( looked like regular clear glass today )persian rug, a lot of persian rugidk china is the big exporter in silk road, their export is way bigger than their import. the make a insane amount of money through silk road. as u can see some of the import is not that significant. they view glass as exotics good, but they can do without it unlike rome and silk ",
            "date": "Answered July 18, 2020",
            "views": "174",
            "upvotes": "0"
        }
    ]
}