{
    "title": "What do Norwegians think of foreigners who speak Norwegian? - Quora",
    "tags": [
        "Norwegian Ethnicity and People",
        "Norwegian (language)",
        "Foreigners"
    ],
    "response": [
        {
            "author_info": {
                "name": "Helge Kåre Fauskanger",
                "href": "/profile/Helge-Kåre-Fauskanger"
            },
            "answer_text": "Well. “Foreigners who speak Norwegian” are most typically immigrants from Middle-east countries, as well as some immigrants from Eastern Europe (particularly Poland) in recent decades. As for the Polish guest workers, I find that I have developed positive connotations to their particular accent. I find it quite pleasant. It may be because these workers are often more smiling, polite, pleasant and service-minded than their Norwegian counterparts, especially when you encounter them as shop attendants. As for first-generation immigrants from (in particular) Pakistan, their accent and grammar are typically pretty atrocious. It could hardly be different; their native tongue is so very unlike Norwegian. Most speak well enough to get along in everyday life, doing low-status jobs Norwegians in many cases don’t want. Some such jobs (like cleaning floors) may not require too much verbal interaction with Norwegians in the first place. Yet very many Middle-eastern immigrants also end up as taxi drivers, for whatever reason. I have interacted academically with a man of Greek extraction who speaks excellent Norwegian, even to the point of delivering lectures to Norwegian students at university level. Of course I can quickly tell that he isn’t a native speaker, but I don’t find his accent distracting or unpleasant in any way. Grammatically he is down to such hard-to-shake mistakes as occasionally getting the gender of nouns wrong (foreigners always have a tendency to inflect the small category of Neuter nouns according to Common Gender patterns, since the Common class is so much larger). ",
            "date": "Answered September 9, 2016",
            "views": "63",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Violet",
                    "user_href": "/profile/Sharon-Violet"
                },
                {
                    "user_id": "Kim E Ellingsen",
                    "user_href": "/profile/Kim-E-Ellingsen"
                },
                {
                    "user_id": "Per Svein Hansen",
                    "user_href": "/profile/Per-Svein-Hansen"
                },
                {
                    "user_id": "Christoph Adam",
                    "user_href": "/profile/Christoph-Adam-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                },
                {
                    "user_id": "Jenny Storhaug-Meyer",
                    "user_href": "/profile/Jenny-Storhaug-Meyer"
                },
                {
                    "user_id": "Peter Lund",
                    "user_href": "/profile/Peter-Lund-3"
                },
                {
                    "user_id": "Daniel Gracia",
                    "user_href": "/profile/Daniel-Gracia-5"
                },
                {
                    "user_id": "Calum Cooper",
                    "user_href": "/profile/Calum-Cooper-3"
                },
                {
                    "user_id": "VaL",
                    "user_href": "/profile/VaL-96"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mojtaba Talaian",
                "href": "/profile/Mojtaba-Talaian"
            },
            "answer_text": "I think Norwegians like those foreigners who do not speak Norwegian because those who speak Norwegian are mostly those who have settled in the country for good, but…All people like to interact even with foreigners in their own language. I remember I was some three months living in Norway and attended a party with neighbors. I spoke a very elementary English and barely could communicate about everyday life matters. A lady was talking to me and pressed me to speak Norwegian. I was shy but everybody was drinking so I began to say something in Norwegian, the lady hugged me and was so happy that I spoke in Norwegian, even it was a very poor level of the language. That was the case when Norwegians had not met people from the Middle East and observing one from there to speak Norwegian, was exciting for them. Now after so many years and hundreds of thousands foreigners from almost every country in the world in the country the filling of exotic is long gone. ",
            "date": "Answered August 4, 2019",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Violet",
                    "user_href": "/profile/Sharon-Violet"
                },
                {
                    "user_id": "Mandana Malek",
                    "user_href": "/profile/Mandana-Malek"
                },
                {
                    "user_id": "Axel Felix",
                    "user_href": "/profile/Axel-Felix-3"
                },
                {
                    "user_id": "Danko Tosanovic",
                    "user_href": "/profile/Danko-Tosanovic"
                },
                {
                    "user_id": "Moneymaker Online",
                    "user_href": "/profile/Moneymaker-Online"
                }
            ]
        }
    ]
}