{
    "title": "What is the history of the American Revolution? - Quora",
    "tags": [
        "The American Revolutionary War",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "James M. Volo",
                "href": "/profile/James-Martin-2066"
            },
            "answer_text": "The American Revolution was NOT caused by Tea or Taxes. That’s a school-boy’s understanding of a very complex topic. In almost every case a widespread and unremitting contempt for established authority coupled with a libertarian leave-me-alone attitude seems best to unify many of the cross-generational attitudes toward government passed down among the most radical of Anglo-colonials. To consider the Boston Tea Party as an isolated incident, however, is equivalent to watching only a small part of the second act of a long three-act play—no matter how dramatically staged or well written, much is missed. The Tea Party was a brief tableau among the many scenes composing an economic and political crisis that ultimately produced a revolution. That which went before is necessary to the meaning and understanding of what took place, and that which follows provides the observer with context and closure. The idea of “taxation without representation” was important but not complete in and of itself — it rhymes! That’s why people remember it. These are more than curious or passing inquiries for it is by the means of a wider knowledge that centuries-old connections between fundamental principles are made. There are important connections between the Magna Carta of 1215 and the Declaration of Independence of 1776, between the battle for political freedom in Scotland at Stirling Bridge in 1297 and the battle for independence in Massachusetts at Concord Bridge in 1775, between the evangelical revolution of John Knox in 1560 and the political revolution of Samuel Adams in 1773, and between the Declaration of Rights in 1689 and the Bill of Rights a century later—and among all of these and more and the present day (2011). Through insights like this, the interested observer gets a center-front seat to the entire drama—all three acts from the prelude to the climax to the final curtain call. The cast of characters is immense and appropriate to the significance of the drama: firebrand radicals and a subjugated but hardworking populace; a youthful king, devious advisors, corrupt officials, and greedy businessmen; self-interested conspirators, dedicated ideologues, an army of occupation, and an arrogant navy; animated mobs and passive extras; and more than one buffoon to provide comic relief — much more than can be presented here. In a period that valued formality and ceremony in society, common sense restraint and essential decorum were conspicuously absent from many political processes. There is ample evidence that Anglo-Americans affected and were affected by occurrences that took place right across the globe. They were expansionists, not isolationists. Theirs was the first emerging economy of the New World in an era during which Europe attempted to colonize and overrule the global. Anglo-Americans were a conscious part of the empire and lawfully subject to its legitimate ruler, who from 1760 to his death in 1820 was King George III (Hanover). Americans today bristle at the concept that they are subjects in any way. They believe that government should be subject to its citizens, not the other way round. Yet no serious American in 1773, even among the radicals, ever questioned the King’s legitimate right to govern the empire, only the necessity that he continue his absolute rule in America. Because the American Revolution gave birth to a nation, it has received the attention of uncounted historians, yet few have produced serious studies of the role of tea in America or of the integration and implications of business, society, politics, and religion in an import-based, mercantile economic model like that in the colonies. It must be remembered, moreover, that the American Revolution began as a crisis of trust, over-taxation, debt, and out of control spending coupled with an arrogance of big government, partisanship, and demagoguery. This may sound familiar to the modern reader. The British government, in the person of its monarch and its ministers, had a long history of extending its sovereignty over unwilling peoples. These included the Welsh, the Scots, and the Irish; the Native Americans of Trans-Appalachia and Canada; and the populations of India, Australia, and parts of Africa and Indonesia. British policies of the 18th century that spawned the Revolution were designed to defend the empire from foreign threats. American colonials did not consider themselves either threatening or foreign. They began their revolt to reinstate their rights as Englishmen. The signs of unrest appearing in the newssheets and diaries of the 18th century provide evidence of this underlying turmoil and are eerily similar to those troubling reports populating the tweets, blogs, and facebook pages of an on-line America in the 21st century—unresponsive and arrogant government officials, insecure borders, foreign intrigue, ethnic, racial, and religious hatreds, unfunded mandates, increasing taxation, ill-advised legislation, uninhibited corruption and cronyism, big business bailouts, bloated government spending, excessive executive compensation, partisan bickering, an angry and outspoken populace, and an economy seemingly on the verge of collapse under the weight of senseless regulations, a deficiency of currency, monetary devaluation, a lack of credit, a debt crisis, and a questionable leadership. Sound familiar, yet? During the Constitutional Convention (1787) virtually every conceivable principle, device, or structural form of government in effect at the time or conceived in the pen of political theorists up to that time was discussed. Locke, Swift, Hobbs, Voltaire, Montesquieu, and others were quoted, dissected, debated, applied, discarded, and reapplied. Districting schemes, election laws, rotation in office, popular representation, executive prerogatives, voter manipulation, checks on the popular will, the rights of states and individuals, and other facets of governance were all considered. Much of the debate between the parties focused on whether the Constitution should be a strictly or loosely interpreted, and many of the positions taken by the delegates on any one issue smelled of political expediency. If strictly interpreted as the Anti-federalists wanted, the federal government would only have the powers specifically given to it in the final document. The Tenth Amendment of the Bill of Rights, added later, would specifically reserve all other powers to the states or the people. Loose interpretation would allow for the expansion of federal powers into areas not specified in the founding document. That’s not Tea and Taxes!  See: Amazon.com: The Boston Tea Party: The Foundations of Revolution eBook: James Volo: Kindle Store  ",
            "date": "Answered December 26, 2019",
            "views": "762",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Sersen",
                    "user_href": "/profile/Matthew-Sersen-16"
                },
                {
                    "user_id": "Leroy Leland",
                    "user_href": "/profile/Leroy-Leland"
                },
                {
                    "user_id": "Cindy Guan",
                    "user_href": "/profile/Cindy-Guan-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allan Honeyman",
                "href": "/profile/Allan-Honeyman"
            },
            "answer_text": "I think the basic thing that led to the American Revolution was not the theoretical, (Montesquieu division of powers, or John Locke’s argument that men, [we would now say people], are created by God as inherently free - “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights” is lifted straight from Locke), but rather that the great big Atlantic Ocean which sat between Great Britain and us. Communication in this era was difficult and long. GB took the view that the Englishmen living in North America could take care of themselves for the time being. Technology moves right along and ships made the trip with greater safety and greater speed. This enabled GB to ship a ton of troops to fight the French and Indian war to protect her colonies from the depradations of the French. GB won, but she won at great cost, and that led to probably the most famous cause of the war, the Stamp Act. GB felt, that the cost of the war should be born by the colonies that profited from its successful prosecution. After all, nobody in London or Liverpool was in danger, right? So, all imported tea had to have a tax stamp affixed, and since Americans had become addicted to that wonderful beverage that came from another colony, India, they felt it would defray the cost of the war. Well, this led to the Boston Tea Party, the cry of No Taxation Without Representation, the formation of the Sons of Liberty, and the rest, as they say, was history. The thing is, having been left alone for roughly 140 years the colonists were used to governing themselves, voting their own taxes and generally being ignored by GB. It was the shock of what they saw as arbitrary taxes that galvanized them into action. The idiotic reaction of the Brits to this, among them the Boston Massacre, and the suppressive acts of 1764, took the simmering discontent and moved on to a full boil. Voila, Revolution! ",
            "date": "Answered October 24, 2016",
            "views": "800",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Engraced Dairo",
                    "user_href": "/profile/Engraced-Dairo"
                },
                {
                    "user_id": "Kirk Ramble",
                    "user_href": "/profile/Kirk-Ramble-1"
                }
            ]
        }
    ]
}