{
    "title": "What is the most significant event in history influenced by humans? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Michael Green",
                "href": "/profile/Michael-Green-512"
            },
            "answer_text": "the single most fundamental that helped life was the discovery of fire. Closely followed by the learning of agriculture (they could still use berries, shrubs etc before this, it is seconded to the creation of fire as the latter means that population could not only survive the colder climates of the ice age better, but could also move around easier too). The invention of the wheel ( I cannot believe any of the answers yet do not have this to be honest) - mde movement easier and revolutionised warfare. The invention of lever/ pully/ cog systems - it made buildings better. learning to mine and hand in had with this, metal crafting. learning to cure and preserve meats (they had salted pork and beef strips given to soldiers as early as the Roman occupation of Britain, these kinds of meal could be eaten on the march - they would march for 40 miles per day, build fortifications and still need to be able to have the energy to fight. I said at the start the the single most fundamental for life was fire, however on par with this, is the discovery of weapons and other tools being used for multiple purposes. Yes, you could hide in cave, how about being able to drive sticks into the grounds deep enough to keep out animals? Using a blunt instrument to do this, ohh and this same tool can kill the wolf — yay food!. ..swords, Spears, the bow….then artillery… after this, ships, gunpowder etc. Slavery  They say that the oldest profession in the world is prostitution. No it isn’t, if a cave man wanted sex, it wasn’t given up, the woman got raped. People have been doing this since the start of time, prostitution really took hold when the need for sex for men on campaigns or travelling traders needed meeting. But slavery? People have been forcing others to do their bidding via brute force most probably since societies have been formed. Yes, slavery was only really efficient when carried out by settled, agricultural type societies as they would require at least a small surplus of food; the Mongols were nomads though, they practiced not only mass murder but slavery massively. Slavery made not only mass amounts of people endure suffering, torture, death and rape at the hands of horrible people, it also meant that labor was cheaper, more cities and cultures were destroyed, more empires and stronger empires were formed at the expense of others suffering and feudalism came about - the Romans started this because as the empire grew, slaves were so abundant that soldiers returning from war either needed to turn to crime, protection or could not get work. Therefore making it so that farmers were having to work for less than the price of a slave, then the collapse of the empire made it so that those able to pay others for protection were fighting and killing people, so the peasants looked for protection. ",
            "date": "Answered July 16, 2018",
            "views": "74",
            "upvotes": " Answer requested by Josh Knight"
        },
        {
            "author_info": {
                "name": "Charlie Scene",
                "href": "/profile/Charlie-Scene-7"
            },
            "answer_text": "The Roman Empire, spread civil law and roman law to most of western europe and influenced politics, economy and culture to this day.The islamic conquests, solidifed islamic infleunce in the balkans, middle east and north africa, leading to many things like the rise of continental empires and the discovery of americaThe world wars.The colonial empires.",
            "date": "Answered July 10, 2018",
            "views": "27",
            "upvotes": " Answer requested by Josh Knight"
        }
    ]
}