{
    "title": "What are the most impressive feets of engineering in the 20th century? - Quora",
    "tags": [
        "History of Engineering",
        "20th Century",
        "Buildings",
        "Architecture",
        "Civil Engineering",
        "World History",
        "Mechanical Engineering",
        "Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "John E Sarna",
                "href": "/profile/John-E-Sarna"
            },
            "answer_text": "As a Systems Engineer and later a Civil Engineer, three amazing 20th century engineering feats stand out for me. They're so different, it's difficult to rank them, so I'm simply going to list them and let you choose from among them. - Building the first vehicle to get a man to the moon and back (alive). This is a subset of William Vietinghoff's parallel post answering this question with the development of rocket engines and associated vehicles to explore space, but I like to think of an engineering feat as a single project, so I'm going with the moon mission. - Building the Panama Canal. I'd say the best read for this is David McCullough: The Path between the Seas (1977). - The Manhattan Project to build the first atomic bomb. I'd say the best read for this is Richard Rhodes: The Making of the Atomic Bomb (1986). While the inclusion of only projects build by the U.S.on this list may lead to some considering me xenophobic, that's simply my judgement. Moreover, it seems to me that the U.S. has taken on the mantle of ancient Rome in building an empire based on engineering, except ours is also based on fossil fuels and economics rather than slaves and war. Why the U.S. rather than Europe or other countries? You may as well ask why Rome rather than Greece, Persia or other countries. My thoughts go to the Butterfly Effect Theory. ",
            "date": "Answered August 14, 2019",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Vietinghoff",
                "href": "/profile/William-Vietinghoff"
            },
            "answer_text": "I admit I am prejudiced because my career has been in the aerospace industry, but I submit that the most impressive feats of engineering have been the creation and use of rocket engines and associated vehicles to explore space. There are many other examples of amazing feats of engineering in the design and construction of buildings, bridges, processing facilities, dams, power generating stations, communication systems, aircraft. But in the case of rocket-propelled vehicles, they have to be right the first time and all the time. If there is something an engineer isn’t satisfied with in the design and operation of a gasoline refinery, he can go back and fix it. Once you have hit “ignition start” on a vehicle headed for the moon, you can’t pull over to the side of the road and work on a problem. ",
            "date": "Answered August 12, 2019",
            "views": "27",
            "upvotes": "0"
        }
    ]
}