{
    "title": "What historical events have evidence from different perspectives or sources? - Quora",
    "tags": [
        "Historical Events",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "What historical events have evidence from different perspectives or sources? Every single one. I’m going to provide an example of a simple, minor example of how much of written history is full of shit, then I’m going to provide a complicated one where we can see how convoluted a ‘history’ can become and a primary definitive view, right or wrong, will only exist once enough of the participants/observers have passed. I’d the good fortunate to know an actual military historian. I’d read something about some issue items that I carried in the 10th Mountain Division, LI. i know when I went to Panama and Europe years earlier. I know what I carried as a pack and gear. So I read something online, from the US Army and from other sources regarding the gear and an actual article mentioned that it wasn’t received by regular Army units until YEARS AFTER I got out. So either we time traveled to get the stuff or the official history from the quartermaster corps was utter shit. So I mentioned that obvious incongruency to an actual historian. Someone who studied this stuff professionally. He was nonchalant, smiled a bit. He then said the academic version of me discovering in person what many historians know, that the written official accounts are often utter shit and inaccurate, but they eventually get accepted, generally, one version of ‘reality’ gets accepted. that got me reading a bit more. Then, somethings can be changed for political correctness, reality VS orders, etc to the point that knowing what happened is very difficult to tell: The Reality of De-segregation of the US Army in regards to the Korean War is an excellent example of ‘History’ being confusing. This isn’t about racial issues, it’s about how agendas, perspectives and first person accounts differ. Now what kick started this was in the early to mid 1990’s some European American veterans of the Korean War were astonished to discover they didn’t know it but back during the War, they were African Americans back then, when they were told by 1990’s historians that they were an African American unit, based on an attachment/detached status, and falling under another command, that was segregated and African American, which was incorrect as that unit was supposedly desegregated. This was a hot topic almost thirty years ago. For political correctness, a unit like the one mentioned was not only Segregated, but now African Americans, contrary to the veterans ethic background. In other Some combat unit during the chaos of the initial North Korean attack, conducted a solid rear action as a covering force for rapidly retreating units. Their stubborn resistance at the cost of many lives allowed the US Army to form a strong point of the Pusan Perimeter. Revision took place in the Army history. This is the official record. But it contradicted the reality of the soldiers who were then alive, and who still had reunions, and the reality of the US Army. Executive Order 9981 came in July1948. It desegregated the US Army. <Poof!> Actually, it began the process and the US Army was damn slow in some places. The Korean War began June 25, 1950.  This is November, 1950 on the Pusan Perimeter. This is a pretty integrated unit. There will be people who say that photograph is deliberately staged to show an integrated COMBAT unit, or it’s of a combat support or combat service support unit placed on the front. Others will say their combat arms unit was integrated. Now here’s a maddening part of the whole situation, twenty-five to twenty seven or so years ago, when this came up, and revisions of unit histories too place, the veterans themselves gave conflicting accounts but that means that 1st Person, I was there perspectives can be based on valid personal experiences, use of words and memory. For example, one Korean War veteran will say that in his combat arms unit, they were desegregated, after the war began, (post 1950) as they received replacements that included African Americans. Another may say they were NEVER desegregated through the war, and when pressed would say there were African Americans within the unit, down to Platoon and Squad level, but they lived in a separate barracks, rather than being assigned billets based on units, so they were segregated within the unit. A third veteran said that he was combat arms, and they were integrated very rapidly after the Executive Order, given by Truman, so it was already occurring BEFORE the Korean War. I honestly think that all three are correct. Different experiences in different units. Different perspectives based on word use as well. This is why we need to record and get the impression of as many people as possible rather than rely upon unit histories and official army records. Note the article below: Racial Integration of Combat Units  1948 The Korean war was one of the first American wars in which military units were not segregated according to race. In 1948, President Harry S. Truman's Executive Order 9981 ordered the integration of the armed forces shortly after World War II, this was because southern representatives would have stopped it from passing in congress. For instance, in May 1948, Richard B. Russell, a Democratic Senator from Georgia, attached an amendment to the Selective Services bill then being debated in Congress. The Russell amendment would have granted draftees and new inductees an opportunity to choose whether or not they wanted to serve in segregated military units. Russell's amendment was defeated in committee. Truman signed Executive Order 9981 on July 26, 1948. In June 1950 when the Selective Services Law came up for renewal, Russell tried again to attach his segregation amendment, and again Congress defeated it. At the end of June 1950, the Korean War started. Most black soldiers served in segregated support units in the rear. The remainder served in segregated combat units, mostly the 24th Infantry Regiment. The first months of the Korean War were some of the most disastrous in U.S. military history. The North Korean People's Army nearly drove the American-led United Nations forces off the Korean peninsula. Faced with staggering losses in white units, commanders on the ground began accepting black replacements, thus integrating their units. The practice occurred all over the Korean battle lines and proved that integrated combat units were a viable option. On July 26, 1951, the US Army formally announced its plans to desegregate, exactly three years after Truman issued Executive Order 9981. This was confusing as shit when one listened to veterans from that era. Now, the Korean War veterans, like the World War II veterans are sadly passing away and eventually, we’ll not have any accounts they didn’t put down and a version of reality which may or may not be accurate will go down in history. ",
            "date": "Answered October 24, 2020",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Holder",
                    "user_href": "/profile/Richard-Holder-46"
                },
                {
                    "user_id": "Allen Thompson",
                    "user_href": "/profile/Allen-Thompson-3"
                },
                {
                    "user_id": "Juliano Camargo",
                    "user_href": "/profile/Juliano-Camargo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dora Miraflores",
                "href": "/profile/Dora-Miraflores"
            },
            "answer_text": "The American history. Compare the sources from the first nation people and the way the most of the white Americans knowledge of their history. There are incredible lots of things which just are forgotten or ignored. ",
            "date": "Answered October 24, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Beth Sandomierski",
                    "user_href": "/profile/Beth-Sandomierski"
                }
            ]
        }
    ]
}