{
    "title": "What share of India's colonial GDP was exported to Britain? - Quora",
    "tags": [
        "India's Contribution to the UK",
        "Historic GDP Estimates",
        "Impact of Colonial Rule on India",
        "India's GDP"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Roberts",
                "href": "/profile/Andrew-Roberts-11"
            },
            "answer_text": "GDP is a 1950s metric, so you’ll have to rely on the Maddison Project estimates, of per capita GDP(PPP), and the British India census population numbers. Anyway given Maddison estimated the populus individually generated $683–698 (1990 PPP Dollars), a year, in the 1940’s, and the 1941 British India Census offers a population of 292,164,791. Which combined gives a 1990 dollars figure of around $201.5 bn of equivalent 1990 FIAT dollar purchasing power, which equates to roughly $28bn or £7bn GDP(PPP), of 1940′s era GOLD backed purchasing power. I haven’t looked up the Purchasing power parities (PPP) multiplier he assumed for 1940’s India, but lets assume it’s the World Banks 0.3, so to turn the purchasing power equivalent, into a nominal GDP, to work with, we punch a few numbers in: Nominal GDP Calculation: 0.3 * ((292164791 * $690) * 0.14) / 4.03 Given: Gold standard: $4.03 = £1,0.14 = scaler to convert a 1990 to 1945 $, given the an average US inflation rate of 4.45%, per Calculate the value of $1 in 1990Giving a range for the nominal British Indian GDP of £2.0 - £2.5 billion, in the 40’s. Trade and Current account figures for the 1940’s can be found in the likes of: India as a creditor: sterling balances, 1940-1953, Marcelo de Paiva Abreu eg.  So in 1939–40 British India’s net exports, of goods and services (including military) to Britain netted the colony around 3.8% of its £2.1bn nominal GDP (£80m/£2100m). While during WWII British India gained 10–16% of its nominal GDP (1944: £402m/£2500m), through the provision of goods and services to the UK. Simply have a Google, decade by decade, for the trade figures, and repeat the process, to hit the first expeditions in 1603:  From: East India Company - Wikipedia Note: French India, Portuguese India, Princely states, … are not included in the trade figures, or population estimates, though much of Bangladesh and Pakistan are. See also: How many tons of gold did the British loot from India? ",
            "date": "Updated December 21, 2018",
            "views": "264",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Caroline Walker",
                    "user_href": "/profile/Caroline-Walker-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Peterson",
                "href": "/profile/Benjamin-Peterson-2"
            },
            "answer_text": "It depends entirely on time period. 1770, 1830, and 1890 would look very different from each other. I’m also not sure if the question is really asking about exports to the UK as a % of GDP, or if it includes (for instance) tax revenues sent to the UK and investment capital from UK to India. ",
            "date": "Answered July 21, 2017",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eduardo Coltre Ferraciolli",
                    "user_href": "/profile/Eduardo-Coltre-Ferraciolli"
                }
            ]
        }
    ]
}