{
    "title": "What are the positive effects of the Great Awakening on Christianity? - Quora",
    "tags": [
        "The Great Awakening"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Brown",
                "href": "/profile/Mark-Brown-5"
            },
            "answer_text": "First I'd define Great Awakening.  There have been three in American History.  The primary effects have been in the United States, but there have been larger impacts as well.  The first Great Awakening is typically dated to the 1730-40's.  The question asks about the effect on Christianity, so I'm going to avoid the secular impacts normally cited.  The largest effect of the First Great Awakening on Christianity is probably the initial harvest of African Americans.  The Black Church really dates from this Great Awakening.  So think of everything that the Black Church has given to Christianity and that comes from this first Spiritual movement.  The second ultimately positive (I think) is the beginnings of breaking with a moribund state church.  Preachers in the First Great Awakening started to emerge from the \"confessionalization\" that had dominated the state churches of Europe.  Kierkegaard is the high brow European fruit of this.  Much more emphasis was placed on the heart or the will as compared to the pure intellectual content of the faith.  A faith that could actual change lives instead of a dead law was being re-born. The Second Great Awakening is typically dated to the early 1800's.  This one is much tougher.  I'm at a loss to really describe positive effects of this revival.  The center-piece of this revival really is Charles Finney and the anxious bench or psychological methods to spur \"conversions\".   I see it more as a reaction to the first GA.  Where the preachers of the first GA were content to proclaim the gospel and let the spirit work, when the returns proved not as great or when the soil became harder, they turned away from the gospel to various law based \"new methods\".   Where the gospel would lead us to understand a varying response, the 2nd GA sought to usurp the role of the Holy Spirit.  And being separated from the intellectual foundations much of its fruit was far a field.  The greatest positive effect I would put down as making concrete in reality what was implicit in Paul's letter to Philemon, that slavery was sinful.   Paul's great Galatians appeal to freedom that in Christ there is neither slave nor free found its realization because of the 2nd GA. The third GA is tougher to pin down, but I'd put it on what is often called the Azuza Street revival.  What came out of that is the Pentecostal movement and a greater emphasis on Spiritual Gifts.  The greatest results of this I think are more about the spread of the Gospel to Latin America, Africa and China.  Where Christianity is growing today is the result of the charismatic revival sending missionaries out that were empowered to impact the people of those places. ",
            "date": "Answered July 6, 2015",
            "views": "32",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Jamison",
                    "user_href": "/profile/Bob-Jamison-3"
                },
                {
                    "user_id": "Deloris Moore",
                    "user_href": "/profile/Deloris-Moore"
                },
                {
                    "user_id": "James Emmans",
                    "user_href": "/profile/James-Emmans-1"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warren Kramer",
                "href": "/profile/Warren-Kramer"
            },
            "answer_text": "Since there have been three historical events in US history to which the name Great Awakening has been attached, I'm going to offer a general answer that covers all three, and spiritual revivals in general. Every organized religion tends to grow stale over time, in that the activities begun, usually for a very good reason, tend to become rituals for which the reason becomes obscured or even forgotten.  This is what had happened with the Church by the time of the Protestant Reformation, which could well be called a \"revival.\" Salvation by grace through faith in Christ had given way to practices like the selling of indulgences. The Reformation restored the foundational belief of salvation by grace through faith in Christ. It doesn't take many generations for even a revived Church to begin to rely more on tradition and ritual than on its founding principles. Most Christian denominations that have been around for long enough have experienced this.  Revivals like the Great Awakenings are usually a call to return to the foundations of faith. They tend to strip away the practices that are extra-biblical, along with the traditions and rituals that have often obscured these foundational biblical beliefs. Revivals are well-named, in that they do not simply swell the ranks of churches, they revive the resolve of members and new converts to a pure faith and to good works which are evidence of that faith. The Great Awakenings were no exception. ",
            "date": "Answered July 9, 2015",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Jamison",
                    "user_href": "/profile/Bob-Jamison-3"
                },
                {
                    "user_id": "David Bailey",
                    "user_href": "/profile/David-Bailey-11"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                }
            ]
        }
    ]
}