{
    "title": "What is the first decade of the 20th century? - Quora",
    "tags": [
        "20th Century",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Torres",
                "href": "/profile/Carlos-Torres-931"
            },
            "answer_text": "Well, this decade was called the nineteen-tens if you didn’t know. But, there was a lot that happened during that decade, and here are a list of some of the things that happened in that time: Sinking of the RMS Titanic The Great War Treaty of Versailles The Fall of the Ottoman and Austro-Hungarian Empires  The First Red Scare The Russian Revolution and The Rise of the Soviet Union It is also weird that, given the fact that a lot happened in the 1910s but is not given a name, but the next decade not a lot happened but it was named something. Because, the 1920s is also known as the ¨Roaring 20s¨, but that was only for the US. ",
            "date": "Answered October 27, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak Rajbahar",
                    "user_href": "/profile/Deepak-Rajbahar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Jo",
                "href": "/profile/Jeff-Jo-4"
            },
            "answer_text": "What is the first decade of the 20th century? The intent of this question is a little ambiguous, but the literal interpretation is not. The ten years from, say, 2007 to 2016, is a decade. So is “the 1960s.” Any span of ten consecutive years is a decade. What is confusing to some, is when such periods of time are ordered within another. The 20th Century (of the Common Era) is the years 1901 to 2000. The First Century was the years 1 to 100, since there was no year 0 in the Common Era. So the first decade to include part of the 20th century was the decade from 1892 to 1901. The first decade entirely in (that is, “of the”) the 20th Century is unambiguously 1901 to 1910. ",
            "date": "Answered July 30, 2020",
            "views": "352",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erik Leander",
                    "user_href": "/profile/Erik-Leander-3"
                }
            ]
        }
    ]
}