{
    "title": "What kind of punishments would Hitler and Stalin have done to each other had either one of their armies captured them alive? - Quora",
    "tags": [
        "Joseph Stalin",
        "Adolf Hitler"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pablo Novi",
                "href": "/profile/Pablo-Novi-1"
            },
            "answer_text": "A HUGE BIG LIE; PERHAPS THE BIGGEST BIG LIE IN ALL OF HISTORY? BOTH HITLER AND STALIN HAVE BEEN “UNIVERSALLY” CONDEMNED; BUT WERE THEY REALLY LIKE TWINS? WERE BOTH: EGO-MANIACAL, ONE-MAN DICTATORS? Virtually every last person on Earth has been educated (brainwashed) to believe that Stalin was at least as nasty as Hitler AND that both were ego-maniacal one-man dictators. IF that WERE the case; then the early answers to this question might make some sense. HITLER W-A-S A 100% PUPPET (OF THE SUPER-RICH GERMANS): But this assumption is DEAD-WRONG. Second of all, NEITHER was an ego-maniacal, one-man dictator - both were instruments of an entire class of people. Hitler was 100% the puppet (“creation” if you will) of the German super-rich - the second he might have veered from THEIR agenda would have been the last second of his life; and he KNEW this 100%! STALIN FOUGHT ALL HIS LIFE AGAINST THE SUPER-RICH: HE W-A-S A 100% SERVANT OF THE VAST MAJORITY (almost none of you have ever heard what is about to be spelled out here - but PLEASE, give it a read WITH some real openness to the possibility that what virtually every human being has been taught about Stalin was not true). STALIN PUT OTHERS FIRST, EVERY DAY OF HIS ADULT LIFE: Stalin risked his life everyday for 15 years, during the Russian Revolution; and spent 13 of those years in prisons, usually in freezing-cold Siberia. After the Revolution was won, the country withdrawn from WW1, and the Civil War won; he, as #1 leader of both the Bolshevik Party (the CPSU(b)) and the State (the USSR) then worked for the next 30 years, 14 hours a day. During that time he had 2 sets of clothes, slept mostly on a small cot near his office where he worked those 14 hour-days; didn’t cash most of his checks (he had a drawer full of uncashed checks). But, didn’t I say that, similar to Hitler, he was the “instrument of an entire class of people”? Yes, but the class of people he was the instrument of, was the working class MAJORITY - that’s precisely who he worked for for some 45 years of his life (before and after the victory of the Russian Revolution). STALIN WAS NO EGO-MANIACAL, ONE-MAN DICTATOR; BUT THE EXACT OPPOSITE: No one-man dictator, much less an egomaniacal one, would take such incredible risks for 15 entire years; no one-man dictator, much less a ego-maniacal one, would work that hard every day for 30 more years; and not spend a red cent (lol) on himself. The very words preclude the very behavior! HITLER, ON DIRECT ORDERS OF HIS SUPER-RICH GERMAN BOSSES, WOULD HAVE PUNISHED STALIN LIKE “HELL ON EARTH”: GIVEN THAT, Hitler would have surely either: tortured Stalin slowly to death; or offered to trade him in exchange for every last top General that the USSR had captured. BUT STALIN WOULD HAVE BROUGHT HITLER TO TRIAL & THEN, FOUND GUILTY, HAVE HAD HIM IMMEDIATELY EXECUTED: But Stalin would have simply brought Hitler to an open, public trial; where he’d be LEGALLY tried, “innocent until proven guilty”; and once the judge / jury had found him guilty; would have immediately executed him. How can we KNOW this? Because this is, in fact, what was done, under Stalin’s leadership (he made ZERO individual decisions, he spoke openly, publicly, repeatedly about the fact that individual decisions are wrong 99 times out of 100; so ALL decision-making in the USSR and Party HAD to be done collectively - and, it’s a well-established fact, that Stalin often was out-voted - yet, every single time he WAS outvoted; he dutifully carried out the decision of the majority - again, the exact opposite of an ego-maniacal one-man-dictator. HOW CAN THIS BE, GIVEN EVERYTHING WE’VE BEEN LED TO BELIEVE?: STALIN WAS NO DICTATOR, HE WASN’T EVEN IN THE MAJORITY OF THE LEADERSHIP: Then how do I explain the tons of false accusations and wrongful executions which DID happen while Stalin led the Party and State? Because, if YOU think about the FACT that he was often out-voted; the implication is clearly that he was actually in the MINORITY within the Party and State - and lots of things were done, some extremely serious things, that he didn’t even know about; or was helpless to prevent (at least until he found out and could then correct, as much as could be). ENEMIES OF THE MASSES WERE (UNKNOWN TO STALIN) IN CHARGE: Since (limited) access to the Soviet Archives was recently granted, it has been established beyond any shadow of a doubt that the TWO SUCCESSIVE HEADS of the USSR’s version of the FBI, were both enemy agents; who abused their power to heavily damage the Party & State by accusing and executing innocent people. The absolute proof of this (and a top agent of the OSS, the forerunner of the CIA reported back to his command about this), is “95% of all those accused at the Moscow Trials was guilty as accused; and most of the last-to-be-tried, were those who had earlier framed the innocent ones”. Let’s stick that in our “pipes” and smoke on it for awhile, shall we? STALIN’S SON W-A-S CAPTURED BY THE GERMAN NAZIS! N.B. The OP’s scenario almost did take place; the Nazis captured one of Stalin’s sons! They offered to trade him in exchange for a top-rank German General (who, upon release, would have helped slaughter millions more Soviet citizens). Stalin, putting the good of the entire Soviet people above the good of his son; refused to accept this offer. Still one more HUGE PROOF that he was neither ego-maniacal, nor any one-man-dictator.  REFERENCES: 4 BOOKS BY GROVER FURR (world expert on the Stalin-Era USSR; and one of the very few people on the planet to have been granted access to: the Soviet Archives, the Hoover Institute Archives & the Trotsky Archives): 1 & 2: “Trotsky’s ‘Amalgams’” (Vol. 1 & 2) (Trotsky was one of the earliest, and clearly one of the top 3 leading, sources of the “anti-Stalin paradigm”. btw, it has now been proven that Trotsky approached the German (and Japanese) high command(s); to work as their collaborator (in killing off the top Soviet leaders and wrecking the Soviet State) in exchange for Nazi recognition & support of his control of the USSR, IF their plans succeeded.). Furr documents ALL of this. 3: “Khrushchev Lied” (Having praised Stalin endlessly in life; only after Stalin’s death did Nikita attack Stalin. He accused him of SIXTY-ONE (count ‘em!) MAJOR CRIMES - Furr establishes that in SIXTY cases, he lied. In the 61st case, Furr was not able to establish the truth one way or the other). 4. “Blood Lies” (The World’s capitalists, recognizing full well, and from the beginning, the danger to THEM of Socialism in the USSR; had to and did attack the leader for 30 years of the USSR with all their might. Their #1 “expert” was Robert Conquest - every few years he simply doubled the number of Stalin’s “victims”; until he reached 66 million! A “worthy successor” of such billionaire-driven Big Lie campaigns is Timoth Synder, author of “Bloodlands”. Furr establishes that every major accusation Synder makes against Stalin is false!) ",
            "date": "Answered March 18, 2018",
            "views": "689",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Akshay Singhania",
                    "user_href": "/profile/Akshay-Singhania-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominico Mucci",
                "href": "/profile/Dominico-Mucci"
            },
            "answer_text": "Hard to answer. They may have just jailed their opposite numbers for life. As leaders often have a respect for other leaders though they don't for the soldiers. They need to teach the people leaders are untouchable lest they face the same fate. That said I think they would have executed their opposite number for war crimes or some other charge. First they would possibly have paraded them for the people. Then either hanging, firing squad or guillotine in Germany. ",
            "date": "Answered March 18, 2018",
            "views": "69",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip Peterson",
                    "user_href": "/profile/Philip-Peterson-8"
                },
                {
                    "user_id": "Tristan Dorame",
                    "user_href": "/profile/Tristan-Dorame"
                }
            ]
        }
    ]
}