{
    "title": "What is the best way to remember the dates and years in history? - Quora",
    "tags": [
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gene Palmiter",
                "href": "/profile/Gene-Palmiter"
            },
            "answer_text": "Dates are arbitray. You can call anything year one and go from there.  What is important is how they relate to each other. Fortunately that's how the brain works too. Some dates are easy to remember.  1492 when Columbus sailed the ocean blue he was financed by the King and Queen of Spain who had just chased the Mislims out of Spain. That puts us close to a date for the highwater mark for the Muslims in Europe.  Raz Dracul, Dracula, in Transylvania also fought the Muslims and died about fifty years before that.  The removal of that threat gave Spain the opportunity to think about establishing trade with the East but by land they had more Muslims to contend with and by going around Africa they had the Portuguese.  It all ties together and requires remembering one date.  I have a military background so I block things around wars.  Napoleon sold us the Louisiana Purchase to keep the British from taking it.  Jefferson was the President who bought it and he was President in 1800. Britain took (impressed) sailors off our ships because they were short for their wars with Napoleon. Napoleon's rifles were much the same as Washington's but by our civil war they were much different and that ties into the industrial age with telegraphs and trains and the beginning of mass production.  Another half a century and we have a world that we would recognize with cars and phones and World War One.  If war doesn't interest you maybe fashion is what ties it together,  or technology.  As proof that it works,  I didn't look any of this up ... one thing just tired to another. Pretty soon you will encounter a number perhaps at a cash register and recall what happens around that time. ",
            "date": "Answered September 26, 2015",
            "views": "16",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rahul Patil",
                    "user_href": "/profile/Rahul-Patil-675"
                },
                {
                    "user_id": "Naveena Jangam",
                    "user_href": "/profile/Naveena-Jangam"
                },
                {
                    "user_id": "Keith MacFarland",
                    "user_href": "/profile/Keith-MacFarland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjun Varma R",
                "href": "/profile/Arjun-Varma-R-1"
            },
            "answer_text": "I don't know if this would work for everyone, but from my experience, it was a lot easier to learn dates when you connected it with the date of birth or some significant date of some one you can easily relate to. For example, I could memorize the birthday of Swami Vivekananda as 12th January 1863 by relating it to 1 day less than my birthday…and he was 6 years elder to Gandhiji (I bet you know his birthday 2nd oct 1869). Similarly, it was on gandhiji's birth centenary year that the Americans landed on the moon. Similarly, you can connect the battle of Plassey in 1757 exactly a hundred years before the first war of independence 1857. And so on and on… Making a timeline and relating the position of the event in it is the key. ",
            "date": "Answered March 7, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Albin James",
                    "user_href": "/profile/Albin-James"
                },
                {
                    "user_id": "Sreedeep Menon VP",
                    "user_href": "/profile/Sreedeep-Menon-VP"
                }
            ]
        }
    ]
}