{
    "title": "What is the max capacity of human memory? - Quora",
    "tags": [
        "Capacity",
        "Human Memory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kurt Spurgin",
                "href": "/profile/Kurt-Spurgin"
            },
            "answer_text": "The maximum capacity of the human memory is probably (and for all practical purposes) infinite. There are many calculations of the capacity of the human brain based on the number of neurons and synaptic connections and so on. However, all of these calculations fall far short of the actual capacity of the human brain/memory. Memory in the human brain does not work like a computer; memory is not stored in a single synapse. Memory is spread out over multiple neurons and multiple synapses. It is more like a pattern of activity spreading across specific parts of the brain rather than being limited to particular synapses. Additionally, each individual neuron is not a static entity. The dendritic spines of neurons are constantly extending and retracting and thickening and stabilizing. It is an extremely dynamic environment with new connections being made constantly. If your brain needs more synapses it simply grows more dendritic spines and makes more connections. Axons are highly branched and dynamic as well, interacting with multiple neurons and multiple synapses. Furthermore, even when the synapse is erased, molecular and chemical changes from memory formation remain within the cell itself. We are just now beginning to understand the role that the support network of neuroglial cells play in memory formation. Early evidence suggests that glial cells have a more significant impact than we previously imagined. Plus there are additional paracrine factors within the brain wherein neurotransmitter hormones are released by the soma and dendrites of neurons into the extracellular environment. When all of these factors are considered it becomes apparent that the human brain is very different from a computer. It is a dynamic, fluid, ever changing, and infinitely variable living thing with essentially unlimited capacity. ",
            "date": "Answered June 4, 2018",
            "views": "800",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Camila Bottene",
                    "user_href": "/profile/Camila-Bottene"
                },
                {
                    "user_id": "Digvijay Singh",
                    "user_href": "/profile/Digvijay-Singh-1960"
                },
                {
                    "user_id": "Saveeza Kabsha Abbasi",
                    "user_href": "/profile/Saveeza-Kabsha-Abbasi"
                },
                {
                    "user_id": "Aparna Pattayil Pramod",
                    "user_href": "/profile/Aparna-Pattayil-Pramod"
                },
                {
                    "user_id": "Pamela Wright",
                    "user_href": "/profile/Pamela-Wright-50"
                },
                {
                    "user_id": "Marek Świderski",
                    "user_href": "/profile/Marek-Świderski-1"
                },
                {
                    "user_id": "Lauren Henry",
                    "user_href": "/profile/Lauren-Henry-33"
                },
                {
                    "user_id": "Christian Farmer",
                    "user_href": "/profile/Christian-Farmer-1"
                },
                {
                    "user_id": "Bibekananda Hansda",
                    "user_href": "/profile/Bibekananda-Hansda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rithwik Maya Rajesh",
                "href": "/profile/Rithwik-Maya-Rajesh"
            },
            "answer_text": "Most computational neuroscientists tend to estimate human storage capacity somewhere between 10 terabytes and 100 terabytes, though the full spectrum of guesses ranges from 1 terabyte to 2.5 petabytes . (One terabyte is equal to about 1,000 gigabytes or about 1 million megabytes; a petabyte is about 1,000 terabytes.) The math behind these estimates is fairly simple. The human brain contains roughly 100 billion neurons. Each of these neurons seems capable of making around 1,000 connections, representing about 1,000 potential synapses, which largely do the work of data storage. Multiply each of these 100 billion neurons by the approximately 1,000 connections it can make, and you get 100 trillion data points, or about 100 terabytes of information. Neuroscientists are quick to admit that these calculations are very simplistic. First, this math assumes that each synapse stores about 1 byte of information, but this estimate may be too high or too low. Neuroscientists aren’t sure how many synapses transmit at just one strength versus at many different strengths. A synapse that transmits at only one strength can convey only one bit of information—“on” or “off,” 1 or 0. On the other hand, a synapse that can transmit at many different strengths can store several bits. Secondly, individual synapses aren’t completely independent. Sometimes it may take several synapses to convey just one piece of information. Depending on how often this is the case, the 10-to-100-terabytes estimate may be much too large. Other problems include the fact that some synapses seem to be used for processing, not storage (suggesting that the estimate may be too high), and the fact that there are support cells that might also store information (suggesting that the estimate may be too low). Even if we accept that the storage capacity of the brain is between 10 and 100 terabytes, estimating how much of that space is “used space” versus “free space” is very difficult—the brain is simply much more complex than an external hard drive. Not only do some parts seem to be involved in many different memories at once, but this stored data is often being corrupted and even lost. One thing is certain: The notion that humans only use 10 percent of their brain is a myth—information may be stored in every part of the brain. ",
            "date": "Answered October 27, 2018",
            "views": "136",
            "upvotes": "0"
        }
    ]
}