{
    "title": "What are your favorite political cartoons? - Quora",
    "tags": [
        "Political Humor",
        "Political Cartoons",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernesto Gasulla",
                "href": "/profile/Ernesto-Gasulla"
            },
            "answer_text": "This one by Argentinian cartoonist Quino:  The cartoon is about how mass media manipulates our opinions, in this case, posting the exact same image with very different captions, and the 1st and 6th images have completely opposite meanings. Unfortunately, I have to translate the text, which puts me in the position of trying to match Quino’s unique writing skills, plus adding ugly red numbers to the b&w cartoon. I’ll try not to screw up too badly. All the geographical locations and names (save for Geneva and UNICEF) are made up by Quino (don’t try to Google them). Bogrovo: A soldier of the army supporting the democratic president Mazevich gifts chocolate to a mother whose home was destroyed by terrorist guerrillas.San Juan de Talpingo: An agent from the Narcotics division checks the documents of a country woman. Many use their children to smuggle drugs hidden in their toys.Mahíli: To celebrate Army Day, an ancient tradition in this small country is for women to gift soldiers with Kaoé sweet tarts, made with Puáj seed.Geneve: A UNICEF report claims that the number of children suffering from sexual abuse is on the rise. In the picture, a mother trades her daughter to an unknown soldier for a chocolate bar.Káfara: A young kaffarite thanks a soldier from the Avengers for Peace corps with a poem, for having killed the malufite children who had stolen her doll.Bogrovo: A Patriot Front guerrilla fighter gifts chocolate to a mother and her little daughter, whose home was destroyed by the army of bloodthirsty president Mazevich.",
            "date": "Answered September 16, 2019",
            "views": "948",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Wang",
                    "user_href": "/profile/Dan-Wang-60"
                },
                {
                    "user_id": "Michael Trick",
                    "user_href": "/profile/Michael-Trick-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Latagia Copeland-Tyronce",
                "href": "/profile/Latagia-Copeland-Tyronce"
            },
            "answer_text": "Interesting question. I absolutely love political cartoons and have always loved one cartoonist in particularly... Herblock (Herbert Lawrence Block). Herblock’s cartoons are, not only influential and hilarious, but convey a level of truth and realism that is rarely displayed. He was truly fearless and no one was safe. Moreover, Herblock was one of the few people (and cartoonists) who publicly criticized President Dwight D Eisenhower's laxed stance of civil rights in the 1950s (this alone makes him my favorite). Herblock is also the person who coined the term “McCarthyism.” Just an awesome political satirist. I hope that answers your question:) ",
            "date": "Answered August 13, 2017",
            "views": "931",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Parker",
                    "user_href": "/profile/Michael-Parker-120"
                },
                {
                    "user_id": "Michael Litt",
                    "user_href": "/profile/Michael-Litt-13"
                },
                {
                    "user_id": "Todd Grimm",
                    "user_href": "/profile/Todd-Grimm-5"
                },
                {
                    "user_id": "Brian Wolbert",
                    "user_href": "/profile/Brian-Wolbert"
                },
                {
                    "user_id": "Rehan Abid",
                    "user_href": "/profile/Rehan-Abid"
                }
            ]
        }
    ]
}