{
    "title": "What is the most useful creation done by humans? - Quora",
    "tags": [
        "Creation (creativity)",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Wayne Bryan",
                "href": "/profile/Scott-Wayne-Bryan"
            },
            "answer_text": "Language. Hands down. It provided the body for knowhow (read memes) to become an independent form of life and begin evolving thousands of times faster than genes. Learned wisdom was so exceptionally useful that it overwhelmed all other selective pressures shepherding the evolution of our species. A mind better able to assimilate and warehouse knowhow could outwit prey, parasite, and peer. Could thrive despite a wide variety of genetic deficiencies like blindness. Could coordinate with other minds to form a super organism vastly more powerful and resourceful than anything that had or ever could evolve genetically. Today memes are on the verge of commandeering the very process of evolution itself by replacing the random mutation of genes with deliberate engineering. They’ve already—through us—constructed a computational and communications infrastructure vastly more capable of hosting them than human minds. Many folks reading this will disagree and consider knowhow to be merely an artifact of humanity. But will that argument hold up after we manage to engineer artificial sentience? When our cognitive technologies reach a point where they’re full self-sustaining—even if they aren’t organic (carbon based) at that point. Perhaps it’s impossible. I’m pretty sure that the religious folks believe there’s something extra—something genuinely transcendental necessary for a soul to emerge from mere physiology. I betting that there isn’t. That there’s nothing to stop future cell phones from being better people than the most wonderful humans that have ever existed. Let’s just hope they don’t injure themselves laughing at our foolishnesses. ",
            "date": "Answered September 15, 2020",
            "views": "24",
            "upvotes": " Answer requested by Veronica Kunasekaram"
        },
        {
            "author_info": {
                "name": "Robert Dusemund",
                "href": "/profile/Robert-Dusemund"
            },
            "answer_text": "There are different ones in different groups. From an evolutionary point of view, these are the ability to think causally, to speak this out, and then to preserve what is spoken permanently - i.e. writing. And vice versa, reading it, discussing the thought and developing it further, and so on. From a technical point of view: recognizing the different properties of materials -> stone + momentum cracks nut (or skull). Stone attached to a stick = more momentum = more power etc. the recognition of the laws of leverage. etc. etc. Every discovery and invention is the best at its time. When done, it has solved a problem or made difficult or arduous work easier. And almost every invention will be replaced by a better or more economical one as technology or science advances. Only our specific evolutionary achievements have not developed significantly in the last 10,000 years. Yes, unfortunately one could assume that the cognitive development of the broad masses is on the decline again. ",
            "date": "Answered September 15, 2020",
            "views": "9",
            "upvotes": " Answer requested by Veronica Kunasekaram"
        }
    ]
}