{
    "title": "What goods from Europe did the Dutch East India Company bring to trade in Asia? - Quora",
    "tags": [
        "Dutch East Indies",
        "The Dutch East India Company",
        "British East India Company (1600 - 1858 AD)",
        "Asia",
        "Historical India",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriela Nitti",
                "href": "/profile/Gabriela-Nitti"
            },
            "answer_text": "Dutch East India Company, like other European trading companies, used gold, silver and copper to buy spices such as salt, pepper, nutmeg, cloves and cinnamon. Also cotton and silk. Bengal Opium as well as it was smoked as a recreational drug. Initially, Europe had very little to offer apart from woolen cloth and bullion. Jan Pieterszoon Coen (1587–1629), who served the Dutch East India Company first as director general and later as governor-general, developed a master plan to deal with this conundrum. Witnessing the success of his Portuguese rivals in Asia, he stressed the importance of creating an extensive intra-Asian trading network spreading from Mocha on the Arabian Peninsula to Hirado in Japan, which would enable the company to gain such high returns that the profits from intra-Asian trade could pay for the return goods sent to Europe. Textiles from Gujarat were to be traded for pepper and gold in Sumatra; pepper from Banten on West Java for silver rials and textiles from Coromandel in India; Chinese merchandise such as iron ware, silk, porcelain, and gold for sandalwood, pepper, and rials in Banten, and so on. ",
            "date": "Answered November 12, 2019",
            "views": "532",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gurkirpal Sandhu",
                    "user_href": "/profile/Gurkirpal-Sandhu"
                },
                {
                    "user_id": "Ramya Sharma",
                    "user_href": "/profile/Ramya-Sharma-53"
                },
                {
                    "user_id": "Devinder Singh",
                    "user_href": "/profile/Devinder-Singh-311"
                },
                {
                    "user_id": "Rajdeep Singh",
                    "user_href": "/profile/Rajdeep-Singh-799"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "H.S.B",
                    "user_href": "/profile/H-S-B-5"
                },
                {
                    "user_id": "Gajanan Siraskar",
                    "user_href": "/profile/Gajanan-Siraskar"
                },
                {
                    "user_id": "Rakesh Patil",
                    "user_href": "/profile/Rakesh-Patil-522"
                },
                {
                    "user_id": "Satya Parkash Sud",
                    "user_href": "/profile/Satya-Parkash-Sud-1"
                },
                {
                    "user_id": "Karthik Iyer",
                    "user_href": "/profile/Karthik-Iyer-211"
                }
            ]
        }
    ]
}