{
    "title": "What is the most historically accurate religion? - Quora",
    "tags": [
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "What is the most historically accurate religion? The true religion teachings teach compassion, patience, feeding the hungry, defending the oppressed, self-constraint, forgiveness; those should bring people together and should transform earth into a paradise The manipulated teachings are based on boasting, promote hatred, skepticism, lack of faith and unnecessary conflicts There is only one God who has revealed the same message to all prophets. The same message revealed to the prophets by the same God must be consistent Although the core religion teachings guide us to believe in God and to do good deeds to help others, scholars of each religion have distorted some teachings in order to claim that their religion is the only true religion and that they have the only way for salvation. Jewish scholars teach that Jews are the chosen people of God Christian Scholars teach that they are the predestined, the glorified, and the chosen before the creation of the world Muslim Scholars teach that Jews are cursed, Christians are misguided, and that Muslims are the truly guided people (they should have taught that the Muslims who do not follow the prophets’ teachings are also cursed) Brahmins teach that God created them from his mouth to glorify them and created some other castes from his feet to let them serve the Brahmins - – Laws of Manu Chapter 1 They wanted to indoctrinate people that the bad caste discrimination is ordained by God; that is how Hindu priests manipulate the Hindu scripture to their benefits. All those scholars are not teaching the core message that God has revealed to the prophets. The common ground of religion teachings includes: In obedience and repentance is your salvation, if you obey and do good deeds, you will be blessed, if you disobey you will be lost; that is the clear message. That message is the most consistent message by Moses, confirmed by Jesus and by Islamic teachings It would not be accurate to say that Judaism is the right religion because there are many additions and changes to what God has revealed to Moses, David, Solomon, Isaiah, etc. It would not be accurate to say that the current teachings of Christianity are the true religion because most of the current teachings are the attractive teachings which are not consistent with the strict teachings of Jesus. It would not be accurate to say that all the current teachings of Islam are the true religion because there are many teachings which contradict the core verses of Qur’an. Prophets did not teach that God has preserved the holy book; they have advised that there would be changes and have warned of such additions and manipulation. Amos 8:11-12 teach that People will be thirsty for the true word of God but they will not find it anywhere Psalm 56:5 teaches ‘All day long they twist my words’ Jeremiah 8:8 teaches the lying pen of the scribes has distorted the word of God Jeremiah 5:30-31 teach that the priests have distorted the religion teachings and that the people love those distorted teachings People are confused by the contradicting teachings, they try to search the internet for the true word of God, but they find many distorted teachings Instead of the true teaching ‘You shall not murder ‘in Exodus 20:13 and Deuteronomy 5:17 The scribes who glorify defeating their enemies ignored the true teaching and added some verses to justify the killing like Exodus 23:23, Numbers 31:16-18, Joshua 6:20-21, Judges 15:14-16 and Judges 16:30 Instead of ‘Nation shall not lift up sword against nation, neither shall they learn war anymore’ in Isaiah 2:4, they have justified atrocities. Instead of the true and most consistent teachings of ‘blessings for obedience and curses for disobedience’ in Leviticus 26, Deuteronomy 28, Deuteronomy 11:26-28, Deuteronomy 4:40, Deuteronomy 6:24-25, Deuteronomy 7:12-15, and Deuteronomy 8, they teach that God has chosen them regardless of their obedience as in the distorted teachings of Deuteronomy 9:5-6 and Deuteronomy 7:6-8 Jewish scholars teach that Jews are the unconditionally chosen people of God; that is wrong according to the teachings of Moses like Exodus 19:5, Leviticus 18:4-5, Leviticus 26, Deuteronomy 11:18-20, 11:26-28 , Deuteronomy 28, Deuteronomy 30:15-16 , and Deuteronomy 30:19, Deuteronomy 32:46-47 Moses did not teach that the Jews are the only chosen people; the correct definition of the chosen people of God as taught by Moses is an open invitation to each person to be a chosen son of God by obedience, by maintaining justice, by applying one measure or one law for Jews and Non-Jews, for taking care of the orphans, the widows, and the strangers Jewish scholars do not teach the original teachings anymore; they teach the distorted teachings of Deuteronomy 9:5-6 and Deuteronomy 7:6 in order to claim that God has chosen them regardless of the condition of obedience Those claims were not taught by Moses, David, Solomon, Isaiah, or by the Prophets; those prophets have warned of the wrong teachings When Jacob’s descendants wanted to glorify him, they claimed that he wrestled with God and was saved. The verses in Genesis 32:24-30 teach that Jacob was able to wrestle with God; he said to God \"I will not let you go unless you bless me” Instead of the true and strict teachings of Jesus in Matthew 7:21-27, Luke 13:25-27, Matthew 22:35-40, Luke 10:25-28, Matthew 25:35-45, Mark 12:28-34, Mark 10:17-19, Matthew 19:16-19, Luke 18:18-20, Luke 6:46-48, John 14:15 and John 14:21 most Christian scholars like to boast and teach the attractive teachings like Romans 8:30, 1 Thessalonians 5:9, Ephesians 2:5, Ephesians 2:8-9, Romans 3:28, Galatians 2:16, Colossians 2:14 and Ephesians 1:4 When the scribes wanted to support the doctrine of atonement, they have added verses like Matthew 18:11 For the Son of Man has come to save that which was lost The bible footnotes explain that verse Matthew 18:11 was not in the original old scriptures Hebrews 9:22 “without the shedding of blood there is no forgiveness” is a misunderstanding of verse Leviticus 17:10-14 which is not about atonement but is about dietary laws. God has clarified that blood in meat is not good for health; that clarification was necessary to the people who did not have advanced medical tools to know that eating the meat with the blood still in it is bad for health The true word of God is not what is written by the unknown writer of Hebrews; it is what has been taught by Moses, David, Solomon, Isaiah, Jesus and the Prophets who taught the forgiveness is possible by obedience, repentance, and prayers Proverbs 16:6 teaches that “In mercy and truth atonement is provided for iniquity.” Psalm 69:30-31 teaches that praise worship is better than sacrifice 2 Chronicles 7:14 teaches that forgiveness is obtainable without a blood sacrifice ‘If my people who are called by my name will humble themselves, and pray and seek my face, and turn from their wicked ways, then I will hear from heaven and will forgive their sin’ Jonah 3 teaches that people are forgiven when they repented and fasted, without offering any sacrifice and without shedding any blood. When the scribes and scholars wanted to gain more authority, they added verses like Mark 16:15 and Matthew 28:18 Bible footnotes confirm that [The earliest manuscripts and some other ancient witnesses do not have verses Mark 16:9–20] Just search the bible footnotes or search the internet about the verses Mark 16:9–20 - you will also find that Matthew gospel includes many verses of Mark gospel which was written earlier When the scribes wanted to support the doctrine of Trinity; they have added verses like 1 John 5:7 “For there are three that bear record in heaven, the Father, the Word, and the Holy Ghost: and these three are one” The bible footnotes explain that verse 1 John 5:7 was not in the original old scriptures. The bible footnotes show many other additions in King James Version which were added to support the claims of the trinity and which were not in the old scripture; examples are: In I John 4:3 ‘CHRIST is come in the flesh’ is an addition In Matthew 8:2, 9:18, 15:25, 18:26, 20:20, Mark 5:6 the word ‘bow down' was changed to ‘worshiped’. Jesus referred to himself as “son of man”. Jesus was not all-knowledgeable and he prayed to GOD, so this is enough to say that he wasn’t God nor did God come down to earth to be Jesus. Jesus said, “And this is life eternal, that they might know You the only true God, and Jesus Christ, whom You have sent.” John 17:3 Jesus said that he does not know everything; he said that only God knows But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father Mark 13:32 Jesus said that he is not equal to God “I can of mine own self do nothing: as I hear, I judge and my judgment is just; because I seek not my own will, but the will of the Father which hath sent me.” John 5:30 Jesus said, “The Father is greater than I.” John 14:28 “Jesus answered them, and said, my doctrine is not mine, but his that sent me.” John 7:16 Jesus prayed to God as written in Mark 1:35, Luke 5:16, John 17:11, Matthew 26:39, Luke 10:21, Luke 22:44 “my Father and your Father; my God and your God” John 20:17 The disciples did not pray to Jesus, they prayed to the God and Father of Jesus “Blessed be the God and Father of our Lord Jesus Christ…” 1 Peter 1:3 The Muslim scholars who justify killing of innocent people are not true Muslims because they do not obey the Qur’an verses like 5:32, 4:90, 2:190, 8:61, 17:33, 25:68 and 6:151 which teach ‘You shall not kill - God has made life sacred’ The Muslim scholars who teach to kill the unbelievers are mistaken; verse 9:6 is enough proof for their mistakes, because Muslims are supposed to protect the unbelievers and they cannot protect them after killing them The Muslims who justify killing of those who leave Islam are mistaken because they do not obey the Islamic teachings like Qur’an verses 2:256, 16:125 and 18:29 which teach Freedom of Religion The Muslim scholars who justify the killing of the hostages are mistaken; verse 8:70 proves that the hostage is not to be killed, because Muslims are supposed to comfort the hostages and they cannot comfort them after killing them The Muslim scholars who teach that Islam is the only true religion are mistaken; they have been ordered to believe in what has been revealed to Moses, Jesus and other Prophets as taught in Qur’an verses 3:84, 4:136, 4:152 and 42:13 The Muslim scholars who teach that the fate of people had been determined before they were born and before they had any chance to do good or bad are mistaken; they ignore the basic Qur’an verses like 4:147, 4:152, 6:48, 6:54, 17:15, 45:15,43:72, 16:35, 19:63, 19:76, 20:112, 34:50, 37:39, 39:41, 39:70, 40:17, 47:17, 55:60, 56:24, and 18:107 The verses teach that God does not predestine people’s fate but gives them the choice either to obey and do good deeds or to rebel and do evil deeds; there is no punishment for those who choose to obey and to thank God. Brahmins urge simple people to donate and offer generous gifts to the Brahmins claiming that people will get hundred-thousand-fold rewards – Laws of Manu Chapter 7 An offering to Brahmins saves from misfortune and from great guilt. – Laws of Manu Chapter 3 Brahmin sanctifies any company (which he may enter), seven ancestors and seven descendants, and he alone deserves (to possess) this whole earth – Laws of Manu Chapter 1 Chapter 7 teaches that Kings should honor Brahmins, should be lenient towards Brahmins, and should consult them in important decisions and should always obey them Hindu priests teach that money given to Brahmins is declared to be an imperishable treasure for kings Chapter 8 teaches that Brahmins are the masters of everything and authorizes Brahmins to decide in justice and law matters Chapter 9 provides exceptional inheritance rights to Brahmins Chapter 11 entitles Brahmins to take the law into their own hands and settle the disputes without referring to law and justice system of other castes Brahmin is the image of God and is the master of all castes – Laws of Manu Chapter 2 and 10 Bhagavad Gita indoctrinates the military leaders to obey the Brahmins even if the military leaders were asked to kill their family members More Gods mean more temples. More temples mean more donations, offerings, and generous gifts to Brahmins. Moses warned of the expected turning from the way he has commanded Jews, in Deuteronomy 31:27-29 he used strong words like “For I know how rebellious and stiff-necked you are. If you have been rebellious against God while I am still alive and with you, how much more will you rebel after I die!” And “For I know that after my death you are sure to become utterly corrupt and to turn from the way I have commanded you. In days to come, disaster will fall on you because you will do evil in the sight of God and arouse his anger by what your hands have made” Jesus has warned the priests who spend more time in the houses of widows. In Matthew 23:14 he said “Woe to you, scribes and Pharisees, hypocrites, because you devour widows' houses, and for a pretense you make long prayers; therefore you will receive greater condemnation” In Matthew 7:15-20, Jesus warned of the false teachers who mislead people Beware of the false prophets, who come to you in sheep’s clothing, but inwardly are ravenous wolves The same teaching is also written in Luke 6:43-44 As Moses and Jesus warned of the false teachers who explain religion to their benefits, the prophet of Islam has also warned of those who ignore the true teachings and teach different teachings “I will say those people are from me. It will be said, 'You do not know what changes and new things they did after you.' Then I will say, 'Far removed (from mercy), far removed (from mercy), those who changed (the religion) after me!” That is recorded in Bukhari 7051 Book 92, Hadith 4 and in Volume 9, Book 88, Hadith 174 The best advice is to follow the common ground of the clear teachings as taught by the prophets. The same message revealed to the prophets by the same God must be consistent, clear and easy for all people regardless of their level of education or experience The common ground of religion teachings includes: If you obey and do good deeds to help others then you will be saved and blessed; if you disobey, you will be lost and cursed; that is the clear message. That message is the most reiterated message by the wise inspired teachers, Moses, David, Solomon, Isaiah, confirmed by Jesus and by Islamic teachings  The following answers include the details: Sabri Shahin's answer to What are God's greatest teachings? Sabri Shahin's answer to How do we know our purpose of existence in this world? Sabri Shahin's answer to What makes a person truly happy? Sabri Shahin's answer to What is the most important thing in this life? in Life is Beautiful Sabri Shahin's answer to What are some life philosophies that cut across all cultures? Sabri Shahin's answer to What are the differences between the Holy books of different religions? Do all of them promote love & humanity? Sabri Shahin's answer to If God is loving and caring, why does evil and suffering still exist? Sabri Shahin's answer to Is it true that everyone is born innocent? Sabri Shahin's answer to What's wrong with Hinduism? Sabri Shahin's answer to Can all religions be correct? Can multiple gods exist? Sabri Shahin's answer to How do I know if I will only live once or reincarnate? ",
            "date": "Updated June 6, 2020",
            "views": "53",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Umar Kamara",
                    "user_href": "/profile/Umar-Kamara-5"
                },
                {
                    "user_id": "AAMNA FALAK",
                    "user_href": "/profile/AAMNA-FALAK"
                },
                {
                    "user_id": "Syed Amaan",
                    "user_href": "/profile/Syed-Amaan-83"
                },
                {
                    "user_id": "Kumar Shaibul Haq",
                    "user_href": "/profile/Kumar-Shaibul-Haq"
                },
                {
                    "user_id": "Akash Jash",
                    "user_href": "/profile/Akash-Jash"
                },
                {
                    "user_id": "Angelo Pernazza",
                    "user_href": "/profile/Angelo-Pernazza-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Alden Marshall",
                "href": "/profile/David-Alden-Marshall"
            },
            "answer_text": "Christianity. Not only did the followers of Jesus claim he was crucified, but even the enemies of Christianity. The great Jewish historian Josephus taught the crucifixion happened. Did he believe the Christians? No. They had no status. He believed the Jewish leaders who were also witnesses to the crucifixion. Also the great Roman historian Tacitus recorded that the crucifixion of Jesus really happened. No, he did not believe the Christian accounts either. He believed Pilate and the other Roman eyewitnesses. The resurrection is also well attested. No liar would record that a woman was the first witness to the resurrection , for they had no status then. When the disciples proclaimed that Jesus was risen, all the authorities had to do was to produce the body, and Christianity would have died then. They did not only because they could not. ",
            "date": "Answered April 6, 2017",
            "views": "18",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hityourshotsbudd",
                    "user_href": "/profile/Hityourshotsbudd"
                },
                {
                    "user_id": "Francis Altitude",
                    "user_href": "/profile/Francis-Altitude-1"
                },
                {
                    "user_id": "El Breadgüino",
                    "user_href": "/profile/El-Breadgüino"
                },
                {
                    "user_id": "Alexander Gent",
                    "user_href": "/profile/Alexander-Gent"
                },
                {
                    "user_id": "Tyrannosaurus Tyrannosaurus",
                    "user_href": "/profile/Tyrannosaurus-Tyrannosaurus"
                },
                {
                    "user_id": "Jacob Smith",
                    "user_href": "/profile/Jacob-Smith-123"
                },
                {
                    "user_id": "ML and Twilight Fan",
                    "user_href": "/profile/ML-and-Twilight-Fan"
                },
                {
                    "user_id": "Marier Villarreal",
                    "user_href": "/profile/Marier-Villarreal"
                },
                {
                    "user_id": "Russel Zuarez",
                    "user_href": "/profile/Russel-Zuarez"
                },
                {
                    "user_id": "Paula del Rosario",
                    "user_href": "/profile/Paula-del-Rosario"
                }
            ]
        }
    ]
}