{
    "title": "What are some interesting facts about the Middle Ages? - Quora",
    "tags": [
        "Unknown Historical Facts",
        "Middle Ages (era)",
        "History of Europe",
        "Aging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Haseeb Ahmad",
                "href": "/profile/Haseeb-Ahmad-92"
            },
            "answer_text": " In European history, the Middle Ages, or Medieval period, lasted from the 5th to the 15th century. It began with the collapse of the Western Roman Empire and merged into the Renaissance and the Age of Discovery. See the fact file below for more information about the Middle Ages. The Middle Ages refers to a time in European history from 400-1500 AD. It occurred between the fall of the Roman Empire and the Renaissance.Historians usually divide the Middle Ages into three smaller periods called the Early Middle Ages, the High Middle Ages, and the Late Middle Ages.During much of the Middle Ages, people in Europe were fighting against the Islamic Empire to take back the Eastern Mediterranean, especially Jerusalem, for the Christian religion. These wars were called the Crusades.The Middle Ages was defined by a Feudal system in much of Europe. This system consisted of kings, lords, knights, vassals and peasants. The people who were part of the church played an important part also. When a person was born into a certain group, they rarely moved to another level.The Feudal system was the law of the land, and the way that the upper class maintained control over the lower class. The upper class provided protection to the lower class and in exchange, the lower class worked for the upper class. The kings and lords lived in castles and were attended to by their personal servants, called vassals. The soldiers that fought for the king and lords were called knights. When conflict arose, the peasants would leave their fields and villages and come into the safety of the castle walls.Kings ruled by what they believed was their “Divine Right”. This meant they believed God made them the King, and their kingdom was passed down through generations.Many fairy tales have their roots in the Middle Ages. When you read about castles and the characters that lived and around them, these stories are being told about this time in history.Castles were built for the lords and kings who lived in them. The bigger and stronger the castle, the more wealthy the person who had it built. The poor lived in huts made from sticks, straw and mud.The church had a great influence over the people. The peasants believed that the harder they worked, the more of their money they gave to the church, and the more they served the church, the better the after-life would be for them.By the early 1300s, however, Europe suffered from both war and disease. The wars were made much worse by the Black Death, or bubonic plague, which spread along the Silk Road from China to Europe starting in 1328, killing millions of people and causing the collapse of the Mongol Empire. By the 1400s, after the plague, Europe looked very different, and the wars were over, and Middle Ages were coming to an end.References: Article: Middle Ages Facts Source: https://kidskonnect.com/history/middle-ages/ Author: NA Date: NA Image: https://mrgrayhistory.wikispaces.com/file/view/E_Middle_Ages_-_Town.jpg/244139543/960x608/E_Middle_Ages_-_Town.jpg ",
            "date": "Answered May 1, 2017",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Owens",
                    "user_href": "/profile/David-Owens-175"
                },
                {
                    "user_id": "Ronda Hauser",
                    "user_href": "/profile/Ronda-Hauser-2"
                },
                {
                    "user_id": "Lincoln Spaur",
                    "user_href": "/profile/Lincoln-Spaur-1"
                },
                {
                    "user_id": "Caleb Patterson",
                    "user_href": "/profile/Caleb-Patterson-7"
                },
                {
                    "user_id": "Riaan Engelbrecht",
                    "user_href": "/profile/Riaan-Engelbrecht"
                },
                {
                    "user_id": "Akarsh Aman",
                    "user_href": "/profile/Akarsh-Aman"
                },
                {
                    "user_id": "Bima Sakti",
                    "user_href": "/profile/Bima-Sakti-2"
                }
            ]
        }
    ]
}