{
    "title": "What are some Ottoman inventions? - Quora",
    "tags": [
        "Historic Inventions",
        "Ottoman Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Niki Gamm",
                "href": "/profile/Niki-Gamm"
            },
            "answer_text": "Quite a few inventions and discoveries occurred during the 500+ years that the Ottoman Empire existed. These were in such areas as astronomy, optics, mechanics and engineering. According to Zakaria Virk’s internet article on Science and Technology in the Ottoman Sultanate, these included “the first mechanical alarm clock, the first spring-powered astronomical clock, the first watch measured in minutes and the first clocks measured in minutes and seconds.” As well a rudimentary steam engine and steam turbine and a telescope were developed. All of these were the work of Taqi al-Din (1526–1585). See his observatory workshop below.  Hezarfen Ahmed Celebi (1609-1640) was the first man to fly any measurable long distance when he took off from Galata Tower in Istanbul across the Bosphorus to Uskudar – a distance of 3358 meters. By the first quarter of the 18th century, the Ottomans had discovered a vaccine against smallpox. A witness of this was Lady Mary Wortley-Montague, the wife of the British ambassador, who subsequently brought this to the attention of British doctors. At some point during the 1720s the Ottomans seem to have invented a submarine or at least a submersible vehicle that was used during one of the many festivals held in that decade. However neither the plans nor the vessel have come down to us today. In the area of ceramics, Ottoman craftsmen experimented with colors and slips for various wares and in particular found a tomato red color that was particularly popular among the Ottomans and in exports to European countries. However, the secret of producing it has been long lost. The Ottomans have also been created with having the first military marching band, called the mehter band. The men in the band would walk in front of the Ottoman army playing marching songs and accompanied with drums of various sizes and the zurna (a woodwind instrument like an oboe). ",
            "date": "Answered September 16, 2017",
            "views": "36",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ryan Oliveira",
                    "user_href": "/profile/Ryan-Oliveira-1-1"
                },
                {
                    "user_id": "Huseyin Tugrul Buyukisik",
                    "user_href": "/profile/Huseyin-Tugrul-Buyukisik"
                },
                {
                    "user_id": "Tosca Tossoun",
                    "user_href": "/profile/Tosca-Tossoun"
                },
                {
                    "user_id": "Harun Rashid",
                    "user_href": "/profile/Harun-Rashid-455"
                },
                {
                    "user_id": "Bulent Ferik",
                    "user_href": "/profile/Bulent-Ferik"
                },
                {
                    "user_id": "Ahmet Fatih Cihan",
                    "user_href": "/profile/Ahmet-Fatih-Cihan"
                },
                {
                    "user_id": "Michael Balmer",
                    "user_href": "/profile/Michael-Balmer-6"
                },
                {
                    "user_id": "Mehmed Iv",
                    "user_href": "/profile/Mehmed-Iv"
                },
                {
                    "user_id": "Sakuraa Nur",
                    "user_href": "/profile/Sakuraa-Nur"
                },
                {
                    "user_id": "Mustafa Aytöre",
                    "user_href": "/profile/Mustafa-Aytöre"
                }
            ]
        }
    ]
}