{
    "title": "What do you think was the worst Chevy ever made, and why? - Quora",
    "tags": [
        "Chevrolet (car company)",
        "The Worst Thing",
        "Car Care",
        "Automotive Industry",
        "Cars and Automobiles",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Turner",
                "href": "/profile/Terry-Turner-9"
            },
            "answer_text": "As others have mentioned, the Vega was a deeply flawed design. I bought a used ’72 hatchback off my BIL in the late ‘70s, and flogged that car unmercifully on construction sites and curvy back roads. I kept a couple spare spark plugs and a socket wrench in the glove compartment because the #1 cylinder fouled its plug about once a week. I never changed the oil in that thing, because I figured the oil didn’t stay in it long enough to get dirty. I could be tracked anywhere in the county by following that amazing blue cloud that spewed out the tailpipe. But Chevy has made other mistakes over the years. The early Corvairs (pre-1965) were pretty lame. The Chevette was automotive engineering to suit the government. The Citation (and all the other X-body GM cars) were pretty bad. More recently, the Cavalier sorta sucked. I was excited when Chevy took the Corvette out of production for a whole year of retooling in 1983. I expected great things! The C3s had been things of beauty (though the later ones lacked power due to EPA requirements), lean and muscular in appearance. Then the C4 came out in 1984, looking for all the world like a shoebox with red holes in the back end. Even the wheels/tires looked square. What a butt-ugly car! ",
            "date": "Answered October 26, 2019",
            "views": "482",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hilda Cole",
                    "user_href": "/profile/Hilda-Cole"
                },
                {
                    "user_id": "Douglas Filter",
                    "user_href": "/profile/Douglas-Filter"
                },
                {
                    "user_id": "Kevin Davidson",
                    "user_href": "/profile/Kevin-Davidson-9"
                },
                {
                    "user_id": "Stuart James",
                    "user_href": "/profile/Stuart-James-88"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                },
                {
                    "user_id": "David Burgess",
                    "user_href": "/profile/David-Burgess-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Douglas",
                "href": "/profile/Jeffrey-Douglas-5"
            },
            "answer_text": "My first car was one of these:  You probably don’t recognize it. 1.4 liter engine, 2 barrel Holly carborator, this manual transmission nightmare was once the best selling small car in America. Rolled out as the answer to the heavy, problem riddled Vega, they strapped this mean machine down with a light aluminum engine, this bad boy got some pretty good gas mileage. And in all seriousness, it’s engine could not get you to the speed limit. The car struggled to get to 55…ever. It did zero to 60 in…never. Maybe could hit 59 with a very long downhill. Problems were, it was a piece of crap. The engine overheated if the car stopped for more than a few seconds in hot weather. Defrosters were a known issue. Rear wheel drive on that small car meant it had no traction. So my worst—the Chevy Chevette! ",
            "date": "Answered October 26, 2019",
            "views": "47",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Einar Nordvik",
                    "user_href": "/profile/Einar-Nordvik"
                },
                {
                    "user_id": "Sean McKiernan",
                    "user_href": "/profile/Sean-McKiernan"
                },
                {
                    "user_id": "Paul Ward",
                    "user_href": "/profile/Paul-Ward-10"
                },
                {
                    "user_id": "Joe Zbiciak",
                    "user_href": "/profile/Joe-Zbiciak"
                },
                {
                    "user_id": "Jack Valleli",
                    "user_href": "/profile/Jack-Valleli"
                },
                {
                    "user_id": "Jocelyn Hurtubise",
                    "user_href": "/profile/Jocelyn-Hurtubise-1"
                },
                {
                    "user_id": "G John Wimmbauer",
                    "user_href": "/profile/G-John-Wimmbauer"
                },
                {
                    "user_id": "Thomas Sinclair",
                    "user_href": "/profile/Thomas-Sinclair-13"
                },
                {
                    "user_id": "Timothy Bunting",
                    "user_href": "/profile/Timothy-Bunting-1"
                },
                {
                    "user_id": "Jon Neal",
                    "user_href": "/profile/Jon-Neal-10"
                }
            ]
        }
    ]
}