{
    "title": "What are the chances that Henry VIII is in hell right now? - Quora",
    "tags": [
        "Hell (company)",
        "King Henry VIII (historical figure)",
        "The Papacy",
        "Hell",
        "Heaven",
        "Afterlife",
        "History of Great Britain",
        "Catholicism",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Goode",
                "href": "/profile/Mary-Goode"
            },
            "answer_text": "My money is on a solid yes. Henry was selfish. Henry was cruel. Henry was gluttonous. Henry was profligate with money and in spite of the Church’s many crimes of the age, they pale in comparison to some of the things Henry did. Henry overnight made hundreds of priests and nuns homeless. The ones who objected and tried to put up a fight or killed. Henry looted the monasteries: there were no Monuments Men back then to save the priceless manuscripts and documentation of England's past. If Henry could not read it, he had no interest in it. Off the top of my head, there was only one other who did what Henry did-his name was Chairman Mao. Most history books Britons learn from do not capture that the scale of destruction and damage done. Like Mao, Henry VIII destroyed a nation’s memory of itself. Monks in the middle ages and a bit later were the intellectuals of the age: it is no accident that Oxford was founded by monks. There is a huge gap in the record because of Henry and later his son Edward. If you look around the Louvre or stroll around portions of France, their medieval art and architecture is well preserved. To be fair, many of the old medieval buildings of Paris are gone, however the layout of the streets in some areas is still intact. Notre Dame de Paris has been severely damaged, but it is well documented what she looked like when Le Duc found her and there are sketches of her from ages before. She is 800 years old and she is a masterpiece, second only in importance to Saint Peter’s Basilica itself. (I studied her in college and I'm an artist by trade. I know what I am talking about.) With any luck, she will be restored and lovingly and very gently brought back to her old self. (Hopefully someone in the French government will remember that the Walt Disney Company is sitting on a giant trove of drawings they can use for reference: a lot of people forget that in the late 90s Disney sent a small army of artists to sketch her as she was in order to make the Hunchback of Notre Dame. If you are reading this and are a Paris official who can speak English, I am giving you an enormous hint!) Medieval peasants often couldn't read and learned their catechism by the stained glass windows in churches and cathedrals. Glaziers of the era wanted to create a wonderland painted in light so it would reflect all over place. Paris is otherwise packed with other medieval cathedrals like Sainte Chapelle and Saint Denis. It has beautifully carved examples of the Madonna in museums around the land. In comparison, very little remains in England, far less. Fountains Abbey would have been absolutely gorgeous to behold, an easy rival for something like Saint Denis, but it is gone. Henry saw to that. Henry was also a pig with women. I can almost see the look on God's face before he went down the booby hatch. “It is the FATHER that determines the sex, you twit!! I had no problem with your daughter, Mary, reigning in her own right. It is why she was spared!! Her grandmother was one of the most powerful women in Europe at one point. But now thanks to you, you have damaged her so badly that I will have to put her out of her misery. You should've never taken her from her mother. You should've never made the decision to abandon her. I sent you one of my greatest gifts: a life to look after, mentor, and love. I knew you had the ability to think outside of the box. I wanted you to use that ability to break the curse of Queen Maude. Instead, you sinned by lying to me, repeatedly breaking the ninth commandment. You broke most of the seven deadly sins. You even broke number one, which is difficult to do. Your idol was your ego. You presumed to speak for me. I never told you to slaughter anyone who got in your way.” “You were a terrible king, a terrible father, an unspeakably bad husband, and had a talent for making every relationship you've ever had wither and die. You murdered all those people, Henry, and don't delude yourself that you didn't. Most committed no crime. Not even Anne. Jane is here with us, so is your mother, so is Katherine. You are never going to see them again. That privilege I reserve for those who have been good and loving. NOW DOWN THE HATCH WITH YOU!!! ",
            "date": "Answered September 25, 2020",
            "views": "121",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Spence",
                    "user_href": "/profile/Mike-Spence-11"
                },
                {
                    "user_id": "Bruce Taylor",
                    "user_href": "/profile/Bruce-Taylor-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kinsella",
                "href": "/profile/John-Kinsella-7"
            },
            "answer_text": "“At the end there was no master and servant, no prince and churchman; just a priest preparing a departing soul for eternity. Cranmer begged Henry to give a sign that he trusted Christ for salvation and, in response, he felt the grip on his hand tighten slightly. It was an evangelical departure: no anointing; no reading of Latin prayers; just a simple acknowledgment of the all-sufficient atoning work of Christ. Cranmer would have been glad of that.” (Wilson, D. In the Lion’s Court: Power, Ambition, and Sudden Death in the Reign of Henry VIII, 2001 Pg. 496). Having defended the 7 Sacraments of the Catholic Church against the Reformers, ironically Henry was deprived of one of these sacraments - the anointing of the sick sometimes called the last rites. Instead he got the assurances that his Anglican Church could give him. With regard to who is in Hell, this is not a matter for speculation; only God sees into the soul of each man. ",
            "date": "Answered July 13, 2019",
            "views": "582",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Petnel",
                    "user_href": "/profile/Mary-Petnel"
                },
                {
                    "user_id": "Bernadette McGarry",
                    "user_href": "/profile/Bernadette-McGarry-1"
                }
            ]
        }
    ]
}