{
    "title": "When were paint rollers invented? Did people used to paint entire rooms with a brush? - Quora",
    "tags": [
        "Paint Roller",
        "Paint Brushes",
        "Paint"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Gage",
                "href": "/profile/Andrew-Gage-7"
            },
            "answer_text": "I always wonder why people ask questions on Quora that can be answered by a simple Google search. But you asked, so here’s your answer. According to SoftSchools.com, the paint roller was invented by a Canadian named Norman Breakey in 1940. Breakey didn’t have the capital to make his roller a success, but other entrepreneurs took the idea and turned it into a household item. Prior to that, people had only brushes to paint rooms with. But those brushes came in different sizes for different applications. A typical wall brush was about an inch thick so it could hold a lot of paint, and was usually about 5–6″ wide. Brushes for trimming out rooms and for painting woodwork were about 2–3″ wide. Narrower angled brushes for painting windows (called sash brushes) were between 1/2″ and 1″. A paint contractor would have a variety of brushes for each job, and also for separate colors or sheen levels, because until latex paint was developed all paint was made in an oil base and had to be cleaned in turpentine. The easiest way to clean the brushes was to suspend them in a can of turpentine by putting a nail or a dowel through the hole in the handle and resting the nail/dowel across a coffee can containing turpentine so that the brushes sat completely immersed in the solvent overnight. In the morning, the paint solids would have settled to the bottom of the can and the brush would be relatively free of paint. If you were a professional painter, that was far too long to wait to change colors or sheens. The thought of painting a room with only a brush today might concern the average person because it would be challenging to do such a large job without ridges and brush marks appearing everywhere. However, back in the day paint contained linseed oil which took a long time to dry, and so ridges in the paint left by brush bristles would flatten out as the paint film dried. The paint roller has made the task of painting go more quickly and smoothly, however some artisans still paint using only brushes. especially when they are going for a specific look or technique. ",
            "date": "Answered March 19, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ig La",
                    "user_href": "/profile/Ig-La"
                },
                {
                    "user_id": "Paige Murphy",
                    "user_href": "/profile/Paige-Murphy-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Williams",
                "href": "/profile/Shane-Williams-120"
            },
            "answer_text": "I don’t know when they were invented, yes they painted rooms with brushes. There are still people who fi this and hired people to do so, I do not. ",
            "date": "Answered July 17, 2018",
            "views": "178",
            "upvotes": "0"
        }
    ]
}