{
    "title": "When Abraham and his family lived in Mesopotamia, were they Canaanites or Akkadians? - Quora",
    "tags": [
        "Canaanites",
        "Abraham (biblical figure)",
        "Israelites",
        "Mesopotamia",
        "Abrahamic Religions",
        "Ancient Civilizations",
        "Ancient History",
        "The Bible",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter Smyth",
                "href": "/profile/Walter-Smyth"
            },
            "answer_text": "Abraham probably did not exist and there is no proof Hebrews ever lived in Mesopotamia. Akkadians never spoke the Hebrew language. What is known is the Hebrews originated from the Canaanites in the Levant because Hebrew is a Canaanite language in origin. Hebrew language - Wikipedia Akkadian language - Wikipedia DNA has also shown that the Jews, Hebrews and Israelites, originated from the Canaanites just like other indigenous people of the Levant, the Syrians, Lebanese, Samaritans: The Genomic History of the Bronze Age Southern Levant The closest descendants of the ancient people of Mesopotamia are the Yazidi and Assyrians: A glimpse at the intricate mosaic of ethnicities from Mesopotamia: Paternal lineages of the Northern Iraqi Arabs, Kurds, Syriacs, Turkmens and Yazidis ",
            "date": "Answered October 23, 2020",
            "views": "92",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Jorge Rodriguez",
                    "user_href": "/profile/Jorge-Rodriguez-397"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Pearlman",
                "href": "/profile/Roger-Pearlman"
            },
            "answer_text": "Neither.He was of Shem (Semite) via Ever (Hebrew - Apiru).That living in Ur, that was most probably founded by the Shemite Reu.Who founded it about 1850 anno-mundi.So DURING The Ice ages, (that spanned 1657–1996 anno mundi based on recent advances in science (also scriptural testimony) and NOT millions of years ago until 12k +/- current inflated consensus.Now as we did not start to disburse from Bavel till the 1996 approx End of The ice ages and were all one big family (comprised of 70 main families), where anyone lived at the time, means zero when it comes to saying which nation they were from, as ALL the nations lived in close proximity.Abraham 1948–2123) already 48 by the start of that dispersion.Now clear in scripture ‘Abraham the Ivri’ so of Ever so a Hebrew-Apiru.reference ‘Torah Discovery Chronology’ for the alignment of Torah Testimony and ancient civ. volume III of the YeC Moshe Emes series for Torah and science alignment.. ",
            "date": "Answered October 27, 2020",
            "views": "13",
            "upvotes": " Answer requested by Gohan Saiyan",
            "upvoters": [
                {
                    "user_id": "Ira Chalphin",
                    "user_href": "/profile/Ira-Chalphin"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moataz El Shafie",
                "href": "/profile/Moataz-El-Shafie"
            },
            "answer_text": "From their names, place of birth (Ur, Iraq) and historic time, they were Assyrians and their language must had been Aramaic. Ab-Raham= father of many in Aramaic Sarai (Aramaic) Hebrew (Sarah) noble woman or lady. Jerusalem (Uru Salim original Aramaic). Home of peace Urusalim was mentioned in Middle Kingdom, Egypt, long before the Arabs and the Isralites. Remember that Hebrew and Arabic were derived from Aramaic, not the other way around. So, names the Ab-Raham, Sarai, Izak, Ismail, Jerusalem, Misir (Egypt) are all derived from Aramaic. ",
            "date": "Updated October 25, 2020",
            "views": "70",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roger Pearlman",
                    "user_href": "/profile/Roger-Pearlman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Grogan",
                "href": "/profile/Jeremy-Grogan-3"
            },
            "answer_text": "Ezekiel 16:3 And say, Thus saith the Lord GOD unto Jerusalem; Thy birth and thy nativity is of the land of Canaan; thy father was an Amorite, and thy mother an Hittite. Ezekiel 16:45 Thou art thy mother’s daughter, that lotheth her husband and her children; and thou art the sister of thy sisters, which lothed their husbands and their children: your mother was an Hittite, and your father an Amorite. ",
            "date": "Answered October 23, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Mathews",
                "href": "/profile/Mark-Mathews-75"
            },
            "answer_text": "Neither one. Look it up. Him and his half Sister were from the land of UR. S. Iraq they were Syrian, Same Father different Mothers, him and his Half Sister his wife Sari= Sarah. At the end of the Tower of Babble. In Persia, Iraq area. Genealogy Hebrew from Shem out of the Boat of Noah. ",
            "date": "Answered October 23, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Roger Pearlman",
                    "user_href": "/profile/Roger-Pearlman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Krakowsky",
                "href": "/profile/Susan-Krakowsky"
            },
            "answer_text": "They spoke Canaanite. They had Canaanite names. When they got to Canaan they had zero difficulty communicating with local folks. They sound to me like Canaanites. ",
            "date": "Answered October 23, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Duebel",
                "href": "/profile/Larry-Duebel"
            },
            "answer_text": "Extrabiblical sources say Abraham lived with Noah and Shem for 39 years. Based on that I would guess that Abraham was a Shemite. ",
            "date": "Answered October 23, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter "
        }
    ]
}