{
    "title": "When was the Declaration of Independence signed? - Quora",
    "tags": [
        "Declaration of Independence of the United States",
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Bar",
                "href": "/profile/Steve-Bar-1"
            },
            "answer_text": "The Declaration of Independence wasn’t signed on July 4, 1776.On July 1, 1776, the Second Continental Congress met in Philadelphia, and on the following day 12 of the 13 colonies voted in favor of Richard Henry Lee’s motion for independence. The delegates then spent the next two days debating and revising the language of a statement drafted by Thomas Jefferson. On July 4, Congress officially adopted the Declaration of Independence, and as a result the date is celebrated as Independence Day. Nearly a month would go by, however, before the actual signing of the document took place. First, New York’s delegates didn’t officially give their support until July 9 because their home assembly hadn’t yet authorized them to vote in favor of independence. Next, it took two weeks for the Declaration to be “engrossed”—written on parchment in a clear hand. Most of the delegates signed on August 2, but several—Elbridge Gerry, Oliver Wolcott, Lewis Morris, Thomas McKean and Matthew Thornton—signed on a later date. (Two others, John Dickinson and Robert R. Livingston, never signed at all.) The signed parchment copy now resides at the National Archives in the Rotunda for the Charters of Freedom, alongside the Constitution and the Bill of Rights. ",
            "date": "Answered June 30, 2015",
            "views": "722",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stuart Davis",
                    "user_href": "/profile/Stuart-Davis-3"
                },
                {
                    "user_id": "Sara Matthews",
                    "user_href": "/profile/Sara-Matthews-5"
                },
                {
                    "user_id": "Kevin Spence",
                    "user_href": "/profile/Kevin-Spence-1"
                },
                {
                    "user_id": "Scott Young",
                    "user_href": "/profile/Scott-Young-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Hogan",
                "href": "/profile/Matthew-Hogan-10"
            },
            "answer_text": "Whose Declaration of Independence? Orig. Question: “What year was the Declaration of Independence signed?”  Declaration of independence - Wikipedia Albanian Declaration of Independence November 28 1912 Argentine Declaration of Independence July 9 1816 Armenia First Republic of Armenia May 28 1918 Belgium Belgian Declaration of Independence October 4 1830 Independence of Brazil September 7 1822 Bulgarian Declaration of Independence September 22 1908 Catalonia Declaration of the Catalan Republic as a state of the Iberian Federation April 14 1931 Declaration of the Catalan state within the Federal Republic of Spain October 6 1934 Central America Act of Independence of Central America September 15 1821 Declaration of the Establishment of the Sovereign and Independent Republic of Croatia June 25 1991 Declaration of Independence of the Republic of Crimea March 11 2014 Ukraine Czechoslovak Declaration of Independence October 18 1918 Dominican Declaration of Independence February 27 1844 Finnish Declaration of Independence December 6 1917 Galicia Declaration of the Republic of Galicia June 27 1931 Georgia Democratic Republic of Georgia May 26 1918 Greek Declaration of Independence January 1 OS 1822 Hungary Hungarian Declaration of Independence April 14 1849 Icelandic Declaration of Independence June 17 1944 Iraq Declaration of Independence October 3 1932 Declaration of the Independence of India January 26 1930 Indonesia Proclamation of Indonesian Independence August 17 1945 Israeli Declaration of Independence May 14 1948 Katangan Declaration of Independence 1960 Korean Declaration of Independence March 1 1919 Kosovo declaration of independence February 17 2008 Proclamation of the Republic of Kosova September 22 1992 Latvian Declaration of Independence November 18 1918 Liberia Liberian Declaration of Independence July 16 1847 Act of Independence of Lithuania February 16 1918 Declaration of Independence of the Mexican Empire (real independence) September 28 1821 Declaration of Independence of the Republic of Moldova August 27 1991 Moroccan Declaration of Independence January 11 1944 Declaration of the Independence of New Zealand October 28 1835 — Declaration of Independence of the Turkish Republic of Northern Cyprus November 15 1983 Padania Padanian Declaration of Independence September 15 1996 Pakistan Resolution March 24 1940 Palestine Palestinian Declaration of Independence November 15 1988 Peru Act of the Declaration of Independence of Peru July 28 1821 Philippine Declaration of Independence June 12 1898 Rhodesian Unilateral Declaration of Independence November 11 1965 Romanian Declaration of Independence May 22 1877 Slovakia Slovak National Council's Declaration of Independence of the Slovak Nation July 17 1992 Slovenian Declaration of Independence June 25 1991 Sri Lanka Declaration of Independence of Sri Lanka (Then known as \"Ceylon\") February 4 1948 Texas, Republic of Texas Declaration of Independence March 2 1836 Tibet Tibet's Declaration of Independence February 13 1913 Declaration of Independence of Ukraine August 24 1991 United States Declaration of Independence July 4 1776 Venezuelan Declaration of Independence July 5 1811 Proclamation of Independence of the Democratic Republic of Vietnam September 2 1945 ",
            "date": "Answered July 19, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caryn Wesner-Early",
                    "user_href": "/profile/Caryn-Wesner-Early"
                },
                {
                    "user_id": "Peter Josefsson",
                    "user_href": "/profile/Peter-Josefsson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Farrell",
                "href": "/profile/Mark-Farrell-23"
            },
            "answer_text": "August 2, 1776. On the night of July 4th, 1776 the DOI was taken to John Dunlap's print shop in Philadelphia, with Jefferson, Franklin and Adams, where 200 broadsides were printed. The only names on if were John Hancock's and the Secretary of the Second Continental Congress Charles Thompson. In late July Hancock purchased a parchment and had a handwritten DOI written that was not signed until August 2, 1776.  ",
            "date": "Answered August 27, 2019",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deborah Geyer",
                "href": "/profile/Deborah-Geyer"
            },
            "answer_text": "July 4, 1776. And Boy, was there ever a Bicentennial Party all Over this country! I (and family), were in the Heart of it. In Philadelphia, Pennsylvania. Seven (7) Million people crammed into just city blocks! Oh, what a Glorious Day That Was! We four arrived Very early in the city. People were just ‘setting up’ (as it were). We all decided to attend an all-denomination religious service, in a tent, that brought home what was Really important to us: Freedom. Then we decided to position ourselves right near a TVcameraman/camera. We watched and waited for the day to unfold. And boy, did it ever! Parades and a President. Now if This doesn’t give you the ‘sweet shivers’, nothing will. Oh, by the way, my parents Did get to view us after all. The cameraman filmed us as he spliced in the President’s speech and panned us four ‘kids’ listening to the Commander-in-Chief. What a Rush! We’ve been all over the world to places both mystical and magical. But This One day in celebration of our country’s birth, was an experience None of us would Ever forget. ",
            "date": "Answered June 1, 2019",
            "views": "211",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "ABCDiamond",
                "href": "/profile/ABCDiamond"
            },
            "answer_text": "Not sure that anyone is sure. Q: What year was the Declaration of Independence signed? From various sources: Most of the delegates signed on August 2, 1776, some delegates added their signatures after August 2. 34 delegates signed the Declaration on July 4, and that the others signed on or after August 2 56 delegates eventually signed the Declaration. ",
            "date": "Answered July 13, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dwight Gray",
                "href": "/profile/Dwight-Gray-3"
            },
            "answer_text": "July 2, 1776, our independence formally declared. For the next two days there were revisions to the original text submitted by Thomas Jefferson. Final approval, of the DOI came from the continental Congress, on July 4th 1776. The document was signed on Aug 2 1776 at Independence Hall, Philadelphia! ",
            "date": "Answered January 2, 2020",
            "views": "147",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gavin Helmsen",
                    "user_href": "/profile/Gavin-Helmsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Dougan",
                "href": "/profile/Michael-Dougan-7"
            },
            "answer_text": "How to Search: Google Offers Free Online Classes ",
            "date": "Answered June 1, 2019",
            "views": "170",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Burch",
                    "user_href": "/profile/Greg-Burch-2"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Ng Tat Kit",
                    "user_href": "/profile/Ng-Tat-Kit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Jones",
                "href": "/profile/Stephen-Jones-275"
            },
            "answer_text": "Whose Declaration of Independence? The Haitian Declaration of Independence was proclaimed on January 1, 1804 in the port city of Gonaïves by Jean-Jacques Dessalines, marking the end of the 13-year long Haitian Revolution. ",
            "date": "Answered November 6, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Robida",
                "href": "/profile/Chris-Robida"
            },
            "answer_text": "The Declaration of Independence was approved by Congress on July 4th, 1776. This final draft was signed almost a month later, August 2, 1776. ",
            "date": "Answered November 6, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ally Wang",
                "href": "/profile/Ally-Wang-12"
            },
            "answer_text": "On June 11, 1776, Thomas Jefferson and a committee started to draft the Declaration. It was signed on August 2, 1776. ",
            "date": "Answered November 2, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Newkirk",
                "href": "/profile/Paul-Newkirk-1"
            },
            "answer_text": "The DOI was not a law, it was a letter to a King. Do you ratify a YOUR letters? ",
            "date": "Answered September 17, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vahe Demirjian",
                "href": "/profile/Vahe-Demirjian"
            },
            "answer_text": "1776 ",
            "date": "Answered August 27, 2019",
            "views": "4",
            "upvotes": "0"
        }
    ]
}