{
    "title": "When did professional armies become the norm for the great powers? - Quora",
    "tags": [
        "Military Power",
        "Armies (non-specific)",
        "World History",
        "Warfare",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "James M. Volo",
                "href": "/profile/James-Martin-2066"
            },
            "answer_text": "The 15th century in particular was an era of change in military science. Many of the same forces that inspired the Renaissance in science, art, literature, governance, and society brought about changes in the right form of war. In those days, there was just barely the hint of nationalism – the concept of being French, German, or Dutch was in its infancy. Italy itself would not solidify until the 19th century. The armies of this period were commanded by a wide variety of leaders, from mercenary pauper knights and condottiero to nobles and kings. The soldiers themselves often formed a polyglot mass of individual warriors and groups, who fought for no nation state of their own and fashioned themselves “Free Companies”.  As the medieval world gave way to the early modern around 1500, European warfare was utterly transformed. A common soldier with a gunpowder weapon could removed a noble enemy who had spent a lifetime training as a warrior. The scale of war grew as well. Armies that had contained thousands of soldiers in the 15th century turned into tens of thousands in the 16th, 17th, and 18th. The wars of this period also represented a revolution in military technology and tactics — some historians consider them the dividing point between modern and medieval times. In Western Europe, and particularly in France, nobles and kings relied heavily on mercenary contingents to provide continuity and professionalism among their short-term feudal levies. In times of peace, however, these free companies often proved more of a menace to the kingdom than a security solution — pillaging, raiding, and murdering indiscriminately. The French solution to this problem was to establish during the 15th century a standing army composed of 20 companies d’ordonnance, each under the command of a reliable noble captain. The establishment of the companies d’ordonnance has been identified as the death knell of the feudal military and social system in France, and the beginning of modern military professionalism. The remaining “free” companies, denied the benefits of indiscriminate pillage and raiding, soon went elsewhere principally to become mercenaries (or their equivalent) in Italy. By 1559, the political map of Italy had been largely negatively affected: the Mezzogiorno and Milan were under Spanish control; the House of Savoy settled in Turin and made Italian its official language; Florence absorbed Siena into a Tuscan state; and the Papacy initiated a counter-reformation at the Council of Trent. Continuing religious conflict culminated in the Dutch Revolt in the Spanish Netherlands known as the Eighty Years’ War (c.1568 - 1648) and the Thirty Years' War (c. 1618 – 1648), which devastated the German states and killed one-third of their population.  The Military Revolution is a theory that a series of radical changes in military strategy and tactics during the 16th and 17th centuries resulted in major lasting changes in governments and society. Warfare became central to the European state, and the transformation had a major impact on government bureaucracies, taxation, and the national economy. Innovations in tactics, drill and doctrine, especially by the Dutch and Swedes (ca. 1560–1660) led to a need for more and better trained troops and thus for permanent forces (standing armies). The concept has fueled debate in historical circles for decades, during which the theory has been continually redefined and challenged. The Military Revolution Debate [Rogers, Clifford J., ed. (1995)]  The Battle of Blenheim (1704) was a model of international co-ordination and co-operation, with the two allied forces attacking simultaneously. John Churchill, First Duke of Marlborough, as his first official act, assisted in remodeling of the British Army. Marlborough’s long career as a soldier and statesmen spanned the reigns of five monarchs. His greatest success came in the War of the Spanish Succession (1701-13), where Britain fought with a coalition of European powers to contain French expansion. His battlefield successes were combined with personal courage, wider organizational and political skills, a gift for logistical planning, and the ability to co-operate effectively with his allies. The organization of a system of Local and Provincial Militias around this period in several countries contributed to the extension of the manpower base of the national armies, although foreign mercenaries still remained a considerable percentage in all European armies. Some historians have challenged the existence of a “military revolution” and have proposed alternative explanations. Many revisionists among military historians reject completely the idea of a military revolution and base their position on close analysis of the gradual and uneven transformation of tactical, operational, and technological aspects of European warfare. Myths of military revolution: European expansion and Eurocentrism - J.C. Sharman, 2018 See: The Companies of Death: Mercenaries of the Late Middle Ages ",
            "date": "Answered October 23, 2020",
            "views": "267",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allen Haddick",
                    "user_href": "/profile/Allen-Haddick"
                },
                {
                    "user_id": "Jeffrey Furgerson",
                    "user_href": "/profile/Jeffrey-Furgerson-2"
                },
                {
                    "user_id": "Al Chang",
                    "user_href": "/profile/Al-Chang-11"
                },
                {
                    "user_id": "Dyson Ye",
                    "user_href": "/profile/Dyson-Ye"
                },
                {
                    "user_id": "Federico Perez",
                    "user_href": "/profile/Federico-Perez-29"
                },
                {
                    "user_id": "Nothanael Leon",
                    "user_href": "/profile/Nothanael-Leon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Rohde",
                "href": "/profile/Michael-Rohde-22"
            },
            "answer_text": "Standing armies are expensive. Some of the great families of the Middle Ages could afford to maintain forces but nation states were still a future development. The Romans were able to support one for some time with their war booty before then, but they were the exception. Real standing armies were developed after the Middle Ages. ",
            "date": "Answered October 23, 2020",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nothanael Leon",
                    "user_href": "/profile/Nothanael-Leon"
                }
            ]
        }
    ]
}