{
    "title": "When was Psalms 83 written by Asaph? - Quora",
    "tags": [
        "Psalms",
        "Hebrew Bible",
        "Bible Verses",
        "The Old Testament",
        "Bible Study",
        "The Bible",
        "Christianity",
        "Books",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Johnson",
                "href": "/profile/Jeff-Johnson-493"
            },
            "answer_text": "in reply to your query regarding Ps 83 superscription [Asaph] the following are research reference notes showing named researches notes [quotes] and along with historical notes of research and scriptural cross-references: Writers: David and others writing Completed: c. 460 B.C.E. A son of Levi through Gershom. (1Ch 6:39, 43) During King David’s reign (1077-1038 B.C.E.) Asaph was appointed by the Levites as a chief singer and player of cymbals, accompanying the Ark as it was brought up from Obed-edom’s home to “the City of David.” (1Ch 15:17, 19, 25-29) Thereafter Asaph, along with Heman and Ethan, served before the tabernacle in directing the music and singing. (1Ch 6:31-44) Like Heman and Jeduthun (apparently the same as Ethan), Asaph is called a “visionary,” who did “prophesying with the harp.”—1Ch 25:1-6; 2Ch 29:30; 35:15. The name “Asaph” appears in the superscriptions of Psalm 50 and Psalms 73 to 83. Since Psalms 79 and 80 mention events that took place after the time of the Levite musician Asaph, some of these psalms must have been written by his descendants. Hence, the name “Asaph” is evidently to be understood as including the whole line of descent that started with him. There being no indication in the contents of Psalm 73 that it came from a later period, we may conclude that the writer was the Levite musician himself, a contemporary of King David. The superscriptions for Psalms 50 and 73 to 83 credit these songs to Asaph. However, it seems likely that the name is there used as referring to the house of which he was paternal head, since some of the psalms (Ps 79, 80) evidently describe events later than Asaph’s day. According to the superscription, Psalm 83 is “a melody of Asaph.” The composer of the psalm was likely a descendant of the Levite Asaph, a prominent musician during the reign of King David. In the psalm, the psalmist begs Jehovah to take action so as to uphold His sovereignty and make His name known. The psalm must have been composed some time after Solomon’s death. Why? Because during the reigns of David and Solomon, Tyre’s king was friendly toward Israel. By the time Psalm 83 was composed, the inhabitants of Tyre had turned against Israel and had sided with its enemies. Reasonably, therefore, the book of Psalms must have been complete in the third century B.C.E., when work on this Greek translation began. The Dead Sea Psalms Scroll provides evidence of the accurate preservation of the Hebrew text. Although about 900 years older than the generally accepted Masoretic text, the contents of this scroll (41 canonical psalms, whole or in part) basically correspond to the text on which most translations are based. Noted Professor J. A. Sanders: “Most of [the variants] are orthographic and important only to those scholars who are interested in clues to the pronunciation of Hebrew in antiquity, and such matters. . . . Some variants commend themselves immediately as improvements of the text, especially those that offer a clearer Hebrew text but make little or no difference in translation or interpretation.”​—The Dead Sea Psalms Scroll, 1967, p. 15. From ancient times, the book of Psalms has been divided into five separate books, or volumes, as follows: (1) Psalms 1-41; (2) Psalms 42-72; (3) Psalms 73-89; (4) Psalms 90-106; (5) Psalms 107-150. It appears that the first collection of these songs was made by David. Evidently Ezra, the priest and “skilled copyist in the law of Moses,” was the one used by Jehovah to arrange the book of Psalms into final form.—Ezra 7:6. The book of Psalms is the Bible’s largest single book. As evidenced by Psalms 90, 126, and Ps 137, it was long in the writing, at least from the time Moses wrote (1513-1473 B.C.E.) until after the restoration from Babylon and probably Ezra’s day (537–c. 460 B.C.E.). Thus, the writing is seen to span approximately a thousand years. The time covered by the contents is much greater, though, starting from the time of the creation and epitomizing the history of Jehovah’s dealings with his servants down to the time of the composition of the last of the psalms. Book Three (Psalms 73-89). At least two of these, Psalms 74 and 79, were composed following the destruction of Jerusalem in 607 B.C.E. They lament this great catastrophe and implore Jehovah to help his people ‘for the sake of the glory of his name.’ (79:9) Psalm 78 recounts the history of Israel from the time of Moses until when David “began to shepherd them according to the integrity of his heart” (78 vs. 72), and Psalm 80 points to Jehovah as the real “Shepherd of Israel.” (80 Vs. 1) Psalms 82 and 83 are strong pleas to Jehovah to execute his judgments against his enemies and the enemies of his people. Far from being vindictive, these petitions are to the end “that people may search for your name, O Jehovah . . . , [and] that people may know that you, whose name is Jehovah, you alone are the Most High over all the earth.” (83:16, 18) Last in this section comes Psalm 89, highlighting “Jehovah’s expressions of loving-kindness,” as shown preeminently in his covenant made with David. This is for an everlasting heir to David’s throne, who will rule to time indefinite before Jehovah!​—89 Vss. 1, 34-37. ",
            "date": "Answered October 26, 2020",
            "views": "180",
            "upvotes": " Answer requested by Allen Roscoe",
            "upvoters": [
                {
                    "user_id": "Allen Roscoe",
                    "user_href": "/profile/Allen-Roscoe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Casey Buckler",
                "href": "/profile/Casey-Buckler-1"
            },
            "answer_text": "Thank you for your question! It's quite difficult to provide a more accurate date than the 10th or 9th century BC. However Asaph was a servant in the sanctuary along with the Sons of Korah, and obviously David, which meant they would have been in charge of the services of songs. It is a written account of Asaph serving in this role found in 1st Chronicles 9:19. Knowing that Psalm 83 was written as a community lament over warfare with surrounding enemies, not only did they petition the Lord for victory but they also asked the Lord to convert these enemies which would essentially make for a more peaceful area to live and raise generations of your Family. So, what I'm getting at is, if you could identify who the specific battle was against or under what flag these enemies fought, you may be able to get a more accurate answer as to when the Psalm was penned. I would assume it was written pre-battle? I don't know how much this helps you but maybe consider reading the writings of Josephus or anyone who kept records of direct Assyrian or Persian attacks on Israel outside of Kings and Chronicles. I hope I've helped in some way! ",
            "date": "Answered October 24, 2020",
            "views": "157",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Maria Oorial",
                    "user_href": "/profile/Maria-Oorial"
                },
                {
                    "user_id": "Will Jones",
                    "user_href": "/profile/Will-Jones-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herb Swanson",
                "href": "/profile/Herb-Swanson-1"
            },
            "answer_text": "When was Psalms 83 written by Asaph? Asaph The name Asaph (אָסָ֔ף|Ἀσάφ) is found forty-six times in the Hebrew Bible;1 with a similar frequency in the Greek Bible.2 Who is Asaph? When did he live? Who composed the “Psalms of Asaph”? When were they composed? We had previously taken the view that these Psalms best related to the time of the Babylonian Captivity (circa 597-586 BC), because the subject matter is so similar. Our recent studies have forced us to reexamine this issue: I was wrong. The Psalms of Asaph are about events preceding and surrounding the life of David; they center on the loss, twenty-year absence, and return of the Ark; they focus on the true and false worship that repeated throughout Judges; they point out that the return of the Ark is not a revolving door returning to the false repentance of Judges: they have nothing to do with the Babylonian Captivity other than that they are a precursory warning of Babylon; of the voice of John, “You generation of vipers, who warned you to flee from the coming wrath. For eternity, around the eleventh and tenth centuries BC, Asaph warns us that false repentance is a death path: that the way of life is the way of the Publican, “Lord, be merciful to me a sinner.” I was so very wrong. We now believe that Asaph can only be dated to a period contemporary with David (1040-1010-970 BC respectively, birth, ascension, and death). Asaph may have also, in his old age, outlived David to fall asleep during Solomon’s reign: we do not have exact dates. So, this Asaph, the son of Berechiah (his mother?), the close associate or even brother of Heman; worked with Heman and others, as a leading temple singer, around the time when David organized the Levitical singers into twenty-four courses or divisions. Asaph also played the cymbals. Asaph’s duties were carried out “before the Ark” and were sometimes called prophesy. In answer to the four questions… Asaph is a Levite, a temple singer, a contemporary of David and Heman; Asaph lived around 1040-970 BC; Asaph composed all twelve of the Psalms that bear his name; All twelve of the “Psalms of Asaph” were composed around the late eleventh to tenth centuries BC. Sons of Asaph One alternative to the view we have chosen is that the Sons of Asaph wrote some or all of the Psalms of Asaph. There is an overwhelming probability that such a singing group existed; one among David’s twenty-four temple courses or divisions. We know that many of the Sons of Asaph were singers; that the group continued at least until the times of Nehemiah (fifth century BC); thus, it is unlikely that all of these were Asaph’s literal descendants, spanning five centuries or more. Thus, the “Sons of Asaph”, is more likely to be the name of one of David’s temple courses, the one first led by Asaph; it is unlikely to be entirely composed of Asaph’s literal children. This does not mean that the group, the “Sons of Asaph”, ever wrote any Psalms at all. In the case of the Sons of Korah, Psalms bear the name, Sons of Korah: we know that the infamous Korah was deceased and is unlikely to have written any Psalms. None of the Psalms of Asaph is attributed to the Sons of Asaph, as the Psalms of the Sons of Korah are; or by any other designation that might suggest that someone other than Asaph himself wrote the Psalms. So, we reject the idea that any of the Psalms of Asaph was written by anyone other than Asaph himself. Assyria In opposition to our view, we note that: Asaph has written concerning “the Assyrian”;3 — and again, “Asshur has helped the children of Lot”.4 These comments seem to indicate a later date; they require some sort of response. We note that Psalm 82 LXX (83 MT) is especially concerned with “Edom, Ishmaelites, Moab, and Hagarenes; with Gebal, Ammon, Amalek; the Philistines, and Tyre”: except for Edom, the Philistines, and Tyre, most of these populate Transjordan. The phrase, “Asshur has helped the children of Lot”, specifically names Lot: Lot’s children were Ammon and Moab, the two big Transjordan power tribes. The verses that follow specify, “Midianites, Sisera, and Jabin; Oreb, Zeeb, Zebah, and Zalmunna”.5 This sounds a lot like Jephthah’s summary of Israelite conditions in the first three-hundred years of Judges (1364-1064 BC).6 Assyria existed from around 2500 BC.7 In their power struggles with Babylon,8 it was imperative that Assyria not be outflanked on the west of the Euphrates River. Yes, this territory was mostly worthless desert; yet, Ishmaelites and Hagarenes dwelt there; Ammon and Moab were the big power players. The judicious use of camel caravans to support Ammon and Moab; repress Babylon and Egypt; maintain friendly relationships with Edom; and prevent Israelite expansion was in Assyria’s best interests. We do not know; there are no known records: yet, Assyrian involvement is not improbable, and caravans across the desert are not impossible.9 By the Battle of Carchemish (605 BC), Assyria is crushed and entirely out of the picture. Besides, Assyria was always adversarial with Babylon: Assyria could never be a cooperative force, working with Babylon and others for the downfall of Judea in the sixth century BC. On the other hand, Assyria is very much in position to be a supportive force to Israelite adversaries around 1064-970 BC, or even earlier: Assyria remains a continuous power throughout the period. So, the naming of Assyria in these Psalms of Asaph is no impediment whatsoever to their eleventh to tenth century BC composition: rather, the mention of Assyria tends to reinforce this early date. Be well. ",
            "date": "Answered October 24, 2020",
            "views": "148",
            "upvotes": " Answer requested by Allen Roscoe",
            "upvoters": [
                {
                    "user_id": "Allen Roscoe",
                    "user_href": "/profile/Allen-Roscoe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Page",
                "href": "/profile/Steve-Page-96"
            },
            "answer_text": "The real question is, when was this written? The psalm describes a coalition of all the enemies of Israel/Judah banding together, including Asshur = the Assyrians. The Assyrians weren’t a factor during the time of David and Solomon when Asaph apparently lived. That implies that the psalm was written later, but before the Babylonian era starting around 615 BCE. IMO, possibly, this psalm was written around the time of Hezekiah, after the Assyrians deported Israel and turned their sights on Judah. The “coalition of nations” was a poetic device, although I expect that many in Judah felt that the whole world was against them. The author(s) then dedicated the psalm to Asaph; perhaps they were his descendants or they were part of a school that honored him. Again, I’m speculating on this. ",
            "date": "Answered October 24, 2020",
            "views": "161",
            "upvotes": " Answer requested by Allen Roscoe"
        },
        {
            "author_info": {
                "name": "Alberto Beron",
                "href": "/profile/Alberto-Beron"
            },
            "answer_text": "Asaph was appointed by the Levites as Chief of Singers and Player of Cymbals accompanying the Arc as it was brought form Ebed-edom’ home to “the City of David.” This happened during the Reign of King David ( 1077 to 1038 B.C.E. ). The Superscriptions for Psalms 50, and 73 to 80 credit these songs to Asaph. However, it seems likely is there used as referring to the House of of Asaph, which he was paternal, head. Since some of the Psalms ( Ps 79, 80 ) evidently describes events later than Asaph’s days.( Ps 79, 80 ). Evidently Asaph did not write Ps 83, but one of his descendants. ",
            "date": "Answered October 24, 2020",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christina Williams",
                "href": "/profile/Christina-Williams-38"
            },
            "answer_text": "“The dating of the composition of the Psalm is debated, but the reference in verse 9 to Assyria is by many sources seen as an indication that the Psalm was written during the time of Assyrian ascendancy, the 9th to 7th centuries BC. Others have placed the composition of the psalm between the time of Saul to the age of the Maccabees, suggested by Theodore of Mpsuestia.” Quoted source… Psalm 83 - Wikipedia ",
            "date": "Answered October 24, 2020",
            "views": "153",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Matt Kylie",
                "href": "/profile/Matt-Kylie-2"
            },
            "answer_text": "This psalm is titled A Psalm of Asaph. The author Asaph was probably the great singer and musician of David and Solomon’s era (1 Chronicles 15:17-19, 16:5-7, 25:6). 1 Chronicles 25:1 and 2 Chronicles 29:30 add that Asaph was a prophet in his musical compositions. Some commentators connect this psalm with 2 Chronicles 20:1-37 and the victory won in Jehoshaphat’s time. Others see the collection of 10 enemies set against Israel as not referring to one specific occasion, but to the constant danger of extermination Israel lived under – relevant in both the ancient and modern world. ",
            "date": "Answered October 24, 2020",
            "views": "156",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Michael Delaney",
                "href": "/profile/Michael-Delaney-163"
            },
            "answer_text": "We do not know when the Psalms of Asaph were written ?.He was the head of his house and his son's were musicians and singers in the temple choir . One of my favourite Psalms is Psalm 73 composed by a son of Asaph showing how we can loose our spiritual way if a problem becomes great in our Personal life and mind. See Asaph at JW. Org. Enjoy your research. ",
            "date": "Answered October 25, 2020",
            "views": "239",
            "upvotes": " Answer requested by Allen Roscoe"
        },
        {
            "author_info": {
                "name": "Jason McMahon",
                "href": "/profile/Jason-McMahon-6"
            },
            "answer_text": "Of this Psalm the title is, \"A song of a Psalm of Asaph.\" We have already often said what is the interpretation of Asaph, that is, congregation. That man, therefore, who was called Asaph, is named in representation of the congregation of God's people in the titles of many Psalms. But in Greek, congregation is called synagogue, which has come to be held for a kind of proper name for the Jewish people, that it should be called The Synagogue; even as the Christian people is more usually called The Church, in that it too is congregated. Exposition on Psalm 83 ",
            "date": "Answered October 24, 2020",
            "views": "8",
            "upvotes": " Answer requested by Allen Roscoe"
        },
        {
            "author_info": {
                "name": "Bruce Can",
                "href": "/profile/Bruce-Can-1"
            },
            "answer_text": "Being this is attributed the last of Asaph's Psalms. We look at verse 7. Where we find the Amalek spoken of and whom they are joining themselves to. Can not be later than king Jehoshaphat. So the time of 2 Ch.20:14. ",
            "date": "Answered October 24, 2020",
            "views": "53",
            "upvotes": " Answer requested by Allen Roscoe"
        }
    ]
}