{
    "title": "Where did the Silk Road start and end? What is the history behind it? - Quora",
    "tags": [
        "FBI Shuts Down Silk Road (September 2013)",
        "Silk Road (online market)",
        "Silk",
        "Fabrics and Textiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ruby Tsao",
                "href": "/profile/Ruby-Tsao"
            },
            "answer_text": "I wrote a paper on the Silk Road with history and its connection with today’s Belt and Road Initiative: THE SILK ROAD By Ruby Tsao (Author of JOURNEY TO CHINA—-History and Travel; BA, NATIONAL TAIWAN UNIVERSITY, MA, UNIVERSITY OF MICHIGAN) Legend has it that silk was discovered by Yellow Emperor’s wife Leizu 嫘祖 (2600 BC) when a cocoon fell in her tea and started to unravel into silk threads. We can believe its history as ancient as the invention of many Chinese characters with the “silk” component: 丝， 绸，组，织，经，纬… The word for paper 纸 showed first paper was silk)…. The invention of Chinese characters was credited to Chang Jie 昌颉, also a contemporary in Yellow Emperor’s time. He may have started the process, but many characters were likely invented and added by others over the years. However, this gave credibility to the legend of silk’s origin from Leizu. The term “Silk Road” was coined by a German scholar in the 19th Century. The land route SILK ROAD stretched from China’s Xi’an to the Mediterranean Sea for some 4000 miles (6437 KM). It started during the Han Dynasty (206 BC—220 AD). In 138 BC, the great emperor Han Wudi sent imperial envoy Zhang Qian 张骞 on a trade route across the border to the west. Before the use of coal to fire bricks, rammed earth was used to build the Han Great Wall to protect the trade routes from nomadic raids. Camels and horses were used to transport silk from China coveted by Romans. Silk was cool and flowing; it absorbed dye for colorful designs on the fabric. China invented various equipment of weaving and looming to produce several kinds of silk called 绫纙绸缎. It was the high tech of ancient times. Silk was used as currency along the Silk Road. When it reached Rome, the price of silk increased 100 times--one pound of silk cost 12 ounces of gold. Julius Caesar led the fashion in silk himself. Camels and horses carried merchandise from Chang’An (today’s Xi’an) westward over mountain passes and deserts to form a network of routes for trade in silk and tea in exchange for horses and spices as well as gold, precious metals, jade and ivory. Zheng He 郑和of Ming Dynasty led seven naval expeditions (1405–1433) to open the Silk Road of the Sea to reach as far as Africa preceding Columbus by some 80 years. The expeditions were for trade and cultural exchange, not for invasion of colonies. Perhaps more significant than trade, cultural interaction flourished along the routes. The Tang Dynasty (618—907) was a period of cultural achievements. The capital Chang’an was an international metropolis teeming with thousands of foreigners: Turks, Iranians, Japanese, Koreans, Malays…as students or merchants. China exported inventions like paper, printing, gun powder, paper money, porcelain, tea….and Chinese culture of philosophy, religion, poetry, art, calligraphy…. (In China, gun powder was used for fireworks, not firearms. It was called gun powder after the West used it in weapons). China contributed in cultural exchange while importing material goods. The Chinese were known for their love of jade since ancient times. Yumen Guan (Gate of Jade) was established in the Han Dynasty to collect taxes on jade imports. GENGHIS KHAN Genghis Khan swept through Asia and Europe to build a vast empire. Along the way, except men with skills, males were killed, and females became wives of Mongols. It is estimated that today there are over 10 million of Mongol descendants in Silk Road countries. Muslim craftsmen were spared to serve in the empire. They brought Islam religion with them where they traveled. This helped the spread of Islam to other parts of Asia. Before the use of coal to fire bricks in ancient times, the Great Wall was built with rammed earth. It had deteriorated after over 1000 years. Genghis Khan had no trouble to cut through the barrier. Genghis Khan was told by his Han advisor: “You can conquer the world on horseback, but you cannot rule the world on horseback”. His grandson Kublai Khan was influenced by Chinese culture. With the help of Han officials, he established the Yuan Dynasty (1280-1368) with the capital in Beijing. With assimilation in Han culture, the Mongols became peaceful people. This was an important period of cultural exchange between the East and the West. MARCO POLO Venetian merchant and explorer Marco Polo (1254-1324) was one of the first Europeans to travel on the Silk Road. He overcame hardships over mountains including the Himalayas, and Taklimakan deserts on the land route to reach China. He stayed in China for 17 years and returned to Europe on the maritime Silk Road via Sumatra and India to reach Hormuz and Constantinople (today’s Istanbul). He became a prisoner of war when he returned to Italy. Of the early travelers to China, he was the most famous because his book “Travels of Marco Polo” -- penned by his cellmate, introduced a mysterious and fabulously rich China to the Europeans for the first time. Europeans were fascinated by the tales of fabulous riches. Columbus carried this book when he set out in his voyage to find China. When he reached America, he thought he landed in India. Thus, he called the natives “Indians”. TRADE AND CULTURAL EXCHANGE Paper making, printing, silk textiles, porcelain making…. were exported from China while spices, fruits and vegetables like watermelon, tomatoes, potatoes and onions were introduced to China. China made significant contributions to the world in culture and technology in the exchange. Asian countries embraced Chinese culture. Notably, religions began to flourish along the Silk Road. Buddhism entered China in the 1st Century from India where it entered a period of decline. Today, only 1% of population in India are Buddhists. Buddhism went through a transformation and spread to Korea and Japan from China. Subsequently, Islam, Judaism and Christianity spread across Eurasia. Confucius (551 BC-479 BC) has had a profound influence in China, Japan, Korea and other Asian countries. He never claimed divinity. Not professing to understand the afterlife, his concerns were to serve humans in this life. He preached love and respect and learning from others without the one exclusive God in religion. Because Confucianism preceded these religions, they have co-existed peacefully in China throughout history. There has not been a war in the name of God. THE MODERN SILK ROAD In 1992, the Eurasian Continental Bridge was established by rail starting from Lian Yun Gang 连云港 on China’s east coast going west across China to connect to Kazakhstan, Byelorussia, Poland and Germany to end at Rotterdam of the Netherlands for a total length of 11,000 kilometers. Today, high speed trains and new ports have been built to fulfill many countries’ need for modern infrastructure. The modern One Belt One Road Initiative was proposed in 2013 based on the historical Silk Road on land and the Maritime Silk Road of the sea, created by Zheng He’s 7 naval expeditions (1405—1433), preceding Columbus. We look forward to increasing stability and prosperity in Asia as well as peace, trust and cooperation with the great powers of the West. Belt and Road initiative is a blueprint for world peace and prosperity to build on the historical connections in the spirit of cooperation and win-win for all. ",
            "date": "Answered October 4, 2020",
            "views": "256",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mahendra Mathur",
                "href": "/profile/Mahendra-Mathur-2"
            },
            "answer_text": " The Silk Road connected the East and West from China to the Mediterranean Sea. The Persian Royal Road ran from Susa, in north Persia to the Mediterranean Sea in modern day Turkey and featured postal stations along the route with fresh horses for envoys to quickly deliver messages throughout the empire. Herodotus,writing of the speed and efficiency of the Persian messengers, stated that “There is nothing in the world that travels faster than these Persian couriers. Neither snow, nor rain, nor heat, nor darkness of night prevents these couriers from completing their designated stages with utmost speed\" The name Silk Road comes from the popularity of Chinese silk with the west, especially with Rome. The Silk Road routes stretched from China through India, Asia Minor, up throughout Mesopotamia, to Egypt, the African continent, Greece, Rome, and Britain. Paper, which had been invented by the Chinese during the Han Dynasty, and gunpowder, also a Chinese invention, had a much greater impact on culture than did silk. The rich spices of the east, also, contributed more than the fashion which grew up from the silk industry. The historian Durant writes, “The Romans thought silk a vegetable product combed from trees and valued it at its weight in gold. Much of this silk came to the island of Cos, where it was woven into dresses for the ladies of Rome and other cities; in A.D. 91 the relatively poor state of Messenia had to forbid its women to wear transparent silk dresses at religious initiations”. Durant continues: “Italy enjoyed an 'unfavorable’ balance of trade – cheerfully [buying] more than she sold” but still exported rich goods to China such as “carpets, jewels, amber, metals, dyes, drugs, and glass”. The Byzantine emperor Justinian (527- 565 CE), tired of paying the exorbitant prices the Chinese demanded for silk, sent two emissaries, disguised as monks, to China to steal silk worms and smuggle them back to the west. The plan was successful and initiated the Byzantine silk industry. When the Byzantine Empire fell to the Turks in 1453 CE, the Ottoman Empire closed the Silk Road and cut all ties with the west. The greatest value of the Silk Road was the exchange of culture. art, religion, philosophy, technology, language, science, architecture, and every other element of civilization. The closing of the Silk Road forced merchants to take to the sea to ply their trade, thus initiating the Age of Discovery which led to world-wide interaction and the beginning of a global community. ",
            "date": "Answered October 15, 2016",
            "views": "211",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kow Teng Wong",
                    "user_href": "/profile/Kow-Teng-Wong"
                },
                {
                    "user_id": "Edwin Nasson",
                    "user_href": "/profile/Edwin-Nasson"
                },
                {
                    "user_id": "Deveshwari Rawat",
                    "user_href": "/profile/Deveshwari-Rawat"
                },
                {
                    "user_id": "Pooja Tandon",
                    "user_href": "/profile/Pooja-Tandon-40"
                },
                {
                    "user_id": "Liz Turner",
                    "user_href": "/profile/Liz-Turner-38"
                },
                {
                    "user_id": "Yvonne Wood-Antonuccio",
                    "user_href": "/profile/Yvonne-Wood-Antonuccio"
                },
                {
                    "user_id": "Peter Sowmy",
                    "user_href": "/profile/Peter-Sowmy"
                },
                {
                    "user_id": "Kimberly Stuart",
                    "user_href": "/profile/Kimberly-Stuart-6"
                },
                {
                    "user_id": "Mark Allen",
                    "user_href": "/profile/Mark-Allen-15"
                },
                {
                    "user_id": "Balaji Waghmare",
                    "user_href": "/profile/Balaji-Waghmare-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Araya Rezaie",
                "href": "/profile/Araya-Rezaie"
            },
            "answer_text": "While the wrong answer is from china to europe but that is like saying it whent from persia to korea(which it did) the wright answer is one of these three It started from japan and ended in britain this is some thing i dont like imean you really sea a lot of silk road things in europe untill the Renaissance and thats becouse it was made in europe and imported from persia not china and the further you get from somewhere the more expensive it becomes also persia did its best to not connect the east to west and the road dosent even go to europe and just stops at constantinoplePersia to china the heavy hitters and builters of the road this is what i personally agree with imean the royal road and the sea silk road were built by persia and china had the resources persia whanted for more about there relations go read my answer Is there a good book to read about the history of the relation between Iran and China going back to the ancient time?If you consider the sea silk road it hasent even ended its just been expanded so it connects every where this is also some thing i agree with",
            "date": "Answered July 30, 2020",
            "views": "428",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ward Miller",
                "href": "/profile/Ward-Miller"
            },
            "answer_text": "The Silk Road started at a border fortress in Western China known as the “Gate of the Barbarians”. It went west to Rome. For many centuries, only the Chinese knew that silkworms made cocoons on the branches of mullberry trees. So, if you wanted silk, you had to trade with China. Enter the humble middle-eastern merchants. They would contact nobles in Europe and tell them “The road to the east is long and extremely dangerous. For a modest fee, we will endure these hardships to bring you silk.” This went on for quite some time. Then, a European went to Asia and asked to see how silk was made. What nobody knew was, this man’s walking stick was hollow. When he realized that silkworms were the key, he took a few and hid them in his hollow stick. When he got back to Europe, the Chinese lost their monopoly on silk, and the merchants lost their customer base. ",
            "date": "Answered March 11, 2018",
            "views": "49",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pierre Tsang",
                    "user_href": "/profile/Pierre-Tsang-2"
                },
                {
                    "user_id": "Kow Teng Wong",
                    "user_href": "/profile/Kow-Teng-Wong"
                },
                {
                    "user_id": "Rob Chukwu",
                    "user_href": "/profile/Rob-Chukwu"
                },
                {
                    "user_id": "Nupur Vyas",
                    "user_href": "/profile/Nupur-Vyas-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Jones",
                "href": "/profile/Peter-Jones-342"
            },
            "answer_text": "In China, they usually mark Xi’an as the beginning of the road but the land routes terminate in a mix of places in Europe, while the sea routes are also varied. The Silk Road concept dates back to more than 2,000 years ago when sea and land routes connected China to the Middle East and Europe. There were various different routes as well even if collectively the term ‘Silk Road’ is now used, especially with its recreation by modern China. ",
            "date": "Answered February 20, 2018",
            "views": "31",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Badri Shrestha",
                    "user_href": "/profile/Badri-Shrestha-8"
                },
                {
                    "user_id": "Anika Nawshin",
                    "user_href": "/profile/Anika-Nawshin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Barfield",
                "href": "/profile/Jim-Barfield-1"
            },
            "answer_text": "It started in China and was a supplier to Elizabethan England, circa 1700’s.  It had started much earlier to other parts of the world.  For a long time people in England believed that it was the most efficient and the only way to get spices from India.  Then Christopher Columbus set sail in search of a new India (the West Indies) and America was discovered. ",
            "date": "Answered October 28, 2016",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Trei Capati",
                    "user_href": "/profile/Trei-Capati"
                }
            ]
        }
    ]
}