{
    "title": "Where the was first recording studio? - Quora",
    "tags": [
        "Specific Recording Studios",
        "Vinyl Records",
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donald Larter",
                "href": "/profile/Donald-Larter-1"
            },
            "answer_text": "In Thomas Edison’s laboratory in Menlo Park, New Jersey. From the online website “America’s Story” comes the following:  Thomas Edison and the First Phonograph \t\t\t \t\t\t\t\t\t \t\t\t \t\t\tAugust 12, 1877 The next time you listen to a favorite album, you can thank Thomas Edison for discovering the secret to recording sound. Before there were CD players and tape decks, there was the phonograph. August 12, 1877 is the date popularly given for Thomas Edison's completion of the model for the first phonograph. Edison was trying to improve the telegraph transmitter when he noticed that the movement of the paper tape through the machine produced a noise resembling spoken words when played at a high speed. Experimenting with a stylus (hard-pointed instrument like a large needle) on a tinfoil cylinder, Edison spoke into the machine. Do you know the first words ever recorded?  The above picture is not likely a picture of the very first recording, which was made with a phonographic device which used recording rolls, a recording stylus (probably made of steel), and some aluminum foil. Nevertheless, the picture shows a later incarnation of the recording process which involved a flat disk, probably made of shellac or some other inscribable material. To Edison's surprise, the cylinder recorded his message, \"Mary had a little lamb.\" People had a hard time believing his discovery at first, but soon doubt turned into awe as Edison became known as \"The Wizard of Menlo Park,\" after the name of the city in New Jersey where he did his work. Sound recording was rapidly becoming an American industry. As a young boy growing up in the late 19th century, Harry Reece remembered the invention of the phonograph as one in a series of technological marvels: \"Electric lights were something to marvel at . . . the old Edison phonograph with its wax cylinder records and earphones was positively ghostly . . .\" Here you can listen to one of the early musical recordings. ",
            "date": "Answered April 12, 2019",
            "views": "125",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                },
                {
                    "user_id": "Robert Lang",
                    "user_href": "/profile/Robert-Lang-125"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Hamlyn",
                "href": "/profile/Nick-Hamlyn"
            },
            "answer_text": "The answer to this question, along with the answers to every other question regarding significant musical firsts, can be found in my book, The First Time – A Book of 20th & 21st Century Music Firsts. The first recording studio was opened by the New York Phonographic Company in 1890, the same year that the first commercial recordings were made available to the public (on cylinders). ",
            "date": "Answered April 16, 2019",
            "views": "26",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Favio Velarde",
                "href": "/profile/Favio-Velarde"
            },
            "answer_text": "Abbey Road is considered the first recording studio, but previous recordings were made and sold by Thomas Edison. Although the French made the first recordings in history, Edison’s invention, the phonograph, was the first machine to both record sounds and play them back.  ",
            "date": "Answered April 22, 2019",
            "views": "36",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edith Prescott",
                    "user_href": "/profile/Edith-Prescott-1"
                },
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dinah Mitchell-Brown",
                "href": "/profile/Dinah-Mitchell-Brown"
            },
            "answer_text": "Well, the first one that I know of is Thomas Edison's lab in Menlo Park, NJ. He recorded himself reciting Mary Had A Little Lamb. I know there were recordings made of Enrico Caruso and I think that was the early 1900's. But I don't know where he recorded. As far as in the U.S. musical recordings - I don't know who made the first recordings, maybe Eddie Cantor. You might look him up on Google and see what it says. ",
            "date": "Answered April 16, 2019",
            "views": "43",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Dill-Peterson",
                "href": "/profile/Timothy-Dill-Peterson"
            },
            "answer_text": "Probably the test shed at Eddisons ",
            "date": "Answered March 24, 2019",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Veronica Della Vedova",
                    "user_href": "/profile/Veronica-Della-Vedova"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Van Wagner",
                "href": "/profile/Eric-Van-Wagner-1"
            },
            "answer_text": "The first purpose built recording studio was EMI Studios - now known as Abbey Road Studio. The studios opened on November 12th, 1931 and the inaugural session was Edward Elgar conducting Pomp and Circumstance (that piece that always plays at graduation). ",
            "date": "Answered March 23, 2019",
            "views": "49",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Ira DonEgan",
                "href": "/profile/Patrick-Ira-DonEgan"
            },
            "answer_text": "google tell me about this: https://en.wikipedia.org/wiki/History_of_sound_recording ",
            "date": "Answered March 24, 2019",
            "views": "35",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ronald Stevens",
                    "user_href": "/profile/Ronald-Stevens-35"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                }
            ]
        }
    ]
}