{
    "title": "Where does the Muslim religion come from? - Quora",
    "tags": [
        "Practicing Muslim",
        "Muslim Speakers",
        "Sunni Muslims",
        "History of Religion",
        "Philosophy of Religion",
        "Atheism",
        "Muslims",
        "Islam",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Junaid Moola",
                "href": "/profile/Junaid-Moola-2"
            },
            "answer_text": "Islam is not a \"new\" religion, it dates back to over 4000 years with Abraham the father of the monotheistic religion. The king of Egypt gave his daughter princess Haga to serve Sarah as gift to atone for his poor behaviour. Later she became his 2nd wife that bore their 1st son Ishmael. Just like lucifer jealousy consumed Sarah, she *\"REJECTED\" Haga and son by exiling her to the wilderness of *Paran. This bloodline continued down through the princes of Kader, all the way down to prophet Muhammad (saw). There's a religious debate as to which son the test of sacrifice was called upon but one can determine if you only have one son at the time, it would make it much harder as to having two? Abraham and his rejected son Ishmael built the Kabba on a *foundation/base that was laid already as the first place if worship. This place of worship out in an abandoned wilderness concern him but Lord told him, don't worry for they will come like ants out of every part of the world to pay their respects. A prophet was sent to every nation until they strayed of the part by been tempted by the devil, followed their whims and fulfilling their desires. Islam believes in all the prophets that came before and still followings the law and commandments given to Mose, the Palms, the Gospel words spoken only by Jesus, and the Qur'an given to prophet Muhammad (saw) for the Creator is constant and unwavering. Jesus was absolutely clear as day that he was not sent for any other nation other than the lost house of Israel, he did not come to break the law but rather fulfill it right up to last dot. Don't call him good when God was good. Non shall enter heaven if they did not follow the law, the prophets and if they claim they love him but didn't follow him then they are bunch of liars. Soteria, Aeacus, Attis, etc.. where existing pagan god's of salvation by blood, son of god, etc... Since Roman Saul came along with his so called inconsistent vision (version)of *bright shiny light (3 times), this gave the now new born \"Christian Paul\" Carte Blanche powers to sell his new concept to his pagan Romans friends, by replacing all their pagan god's with a all in one new superhero \"saviour Jesus\". They were impressed but because they were still weak, reserved and sceptical about giving up their cultural ways and following the laws with regards to wine, swine, circumcisions, etc. they didn't bite. (Oh what the heck! do what you, I really don't care, you all going to hell away pagans)  So he improvised by abandoning the law by referring it to been a burden of the past... then justified his actions by saying so we may win more in numbers and he did ;)  *For the devil shall appear in a bring shiny light and lead you astray like all the other previous Nations before... Well done guys. (Incidentally, his so called witnesses that were with him magically disappeared without getting to testifying to the council/church if they did or didn't see or hear anything as per his inconsistent vision) About 381 years later pagan Roman Constantine continued Paul's legacy by improvising new pagan beliefs when he unified the churches by introducing into the council of the church i.e. The hold spirit to form part of the concept of their trinity god. The cross that was a Chi-rho good luck symbol.  Saturn their sun god celebrated his birthday on the 25 December so years later Christmas became a day to celebrate for the Christians. They also decided SUNday would be a of rest for the Christians to honour the Saturn SUN god. The Saxon goddess Easter also became a day of celebration for the Christians. They placed a gag and band order on any scriptures that didn't conform to the pagan Roman councils ethos.  Pagan Constantine only \"accepted\" Christianity on his death bed on his last breath.  Let's not even talk about the concept of mistletoe and Thanksgiving bloodbath that happened to the native Americans. The old and new testament mention about the Jews and Christians will not fulfill the law and the commandments and the kingdom shall be taking away and given to another... *The holy one shall raise forth from mount Paran with a firey/might law along with 10 000 saints with fire in their right hand... *The rejected builders shall become the cornerstone and it shall be marvelous in the Lord's eyes for they shall produce the fruits. *Who sets it's measurements and lines. The holy one shall fill the heavens and earth with the splendor of the Lord's praise. The comforter shall convict the world about righteous and sin. Shall tell of things to come... The conquest of Mecca the holy one/comforter prophet Muhammad (saw) marched into with 10 000 saints with torches of fire in their right hand. He gave his last sermon on the mount Paran/mountain of light(jabal nur). He delivered the completion of the mighty/fiery law... The Qur'an. Read his last sermon. There are about 2.5 million towns, etc in the world with an average 2 mosque in each town calling out 5 times a day for prayer and praising God, that's 25 million times if not more a day the heavens and the earth are filled with the splendor of the Lord's praises. There's about 1.8 billion Muslims, if half had to pray as we should, that would be about 4.5 billion fruits produced in just one day, if not more. Then there's a supplication dua made after the prayer, that's another 4.5 billion. Also there is about 40 little grateful prayers made throughout the day from the time we open our eyes until we go back to sleep, that's 100 million You do the maths of how much fruits are produced in just one day? *Jesus said in a one of his parables about the 3 farmers, the 1st who had the knowledge, he just sat and did nothing with it. The 2nd learnt from the first but he did not use it by doing his own thing and messed it up. The 3rd who took the knowledge from both and put it to good use to produce the fruits... The comfort is in our prayers. However the comforter finish convict the world of righteousness and sin. Last sermon. The comforter finish tell us about things to come, here and gone already.... The rise and fall of the Roman and Persian empires, which were the super powers of the day. Technology: Flying planes, Laptops, smart devices, smart watches, CCTV, etc... The type of shameless dressing that women would wear, hairstyles, abortion, decline/decay in morality/society and aids. Skyscraper buildings  Science i.e. such as the big bang theory, the two oceans, embryology, etc... *See Golden key point of the earth about the Kabba in Mecca/Paran and measurements/lines. There is just way too many things, I could just go on and on... #Conclusion: The Muslim religion is Islam that come from the one and only true Creator of the heavens and the earth that was delivered by the last and final prophet Muhammad (saw) Seriously, one need to start read the Qur'an and Hadiths objectively in order to understand it's message for one's own true salvation. You don't have to become a Muslim (although its better for you), become a true Christian and love Jesus the way the Lord intended and NOT Paul's or Constantine's pagan version. Ps. Please forgive me if I have offered anyone. Forgive my spelling and grammar. Feel free to spread this information. I invite you to cross check my information. Thank you. ",
            "date": "Answered June 14, 2019",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jonathan-Smith-1743"
                },
                {
                    "user_id": "Khalid Ebrahim",
                    "user_href": "/profile/Khalid-Ebrahim-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Broberg",
                "href": "/profile/Karl-Broberg"
            },
            "answer_text": "Muslims believe the Koran was given directly from Gabriel, God’s messenger, and is a holy book without error. The religion is from the revelations of one man, namely, Muhammad. No Muhammad, no faith. The traditions have been written much later after he passed on. They believe the book itself is a miracle and therefore from God as inspired. ",
            "date": "Answered June 19, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carl Myers",
                "href": "/profile/Carl-Myers"
            },
            "answer_text": "The same place as every other religion - some human’s imagination of how to control or exploit their fellow, more gullible humans. ",
            "date": "Answered June 14, 2019",
            "views": "49",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avery Kendall",
                    "user_href": "/profile/Avery-Kendall"
                },
                {
                    "user_id": "Mike Rommel",
                    "user_href": "/profile/Mike-Rommel"
                },
                {
                    "user_id": "Graham Surawski",
                    "user_href": "/profile/Graham-Surawski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Rowland",
                "href": "/profile/Ian-Rowland-13"
            },
            "answer_text": "It was made up, based on the Abrahamic religions, by a man living in the Middle East, who claimed to be a prophet, over a thousand years ago… ",
            "date": "Answered June 14, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avery Kendall",
                    "user_href": "/profile/Avery-Kendall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tobias Glendening",
                "href": "/profile/Tobias-Glendening"
            },
            "answer_text": "What we recognise as Islam came from Saudi Arabia where the prophet Muhammad preached about his visions and miracles. He spread the Qu’ran or word of god/Allah. He conquered the peninsula and his successors spread it and formed caliphates with the largest being the Umayhid caliphate. ",
            "date": "Answered June 14, 2019",
            "views": "41",
            "upvotes": "0"
        }
    ]
}