{
    "title": "Where can I watch 'Scam 1992: The Harshad Mehta Story' (2020 TV series) online? - Quora",
    "tags": [
        "Harshad Mehta",
        "TV Show Recommendations",
        "Scams",
        "Entertainment",
        "2020 (year)",
        "Streaming Video Content",
        "Website Recommendations",
        "Television",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lakshay Arora",
                "href": "/profile/Lakshay-Arora-27"
            },
            "answer_text": "SCAM 1992 - The Harshad Mehta Story Teaser Five thousand crore rupees were withdrawn from State Bank of India. There is no account of this money. Somewhere, it is not known to whom the money was given. After this, a name comes up Harshad Mehta. Gradually, Khulat is a scam that shakes the financial system of India. Its broker is Harshad Mehta. Sony Liv is bringing the story of this broker. Sony Liv's web series 'Scam 1992- The Harshad Mehta Story' is coming. The story of this scam will be told in this web series by Hansal Mehta. Sony Liv has teased it. The teaser shows the story of the Times of India office in April 1992. In which a bank employee mentions in front of a journalist, how he spends five thousand crores of rupees without any reading and writing. The teaser has a dialogue- When there is money in the pocket, the horoscope does not matter to Saturn. This is my astrology. Shareeb Hashmi appears at the beginning of the teaser. Shareeb has previously been a part of Sony Liv's famous web series Asura. At the same time, he has also shared the screen with Manoj Bajpayee in Amazon Prime Video's web series The Family Man. At the same time, Shreya Dhanvantari will also be seen in this web series. She is playing the role of journalist Sucheta Dalal. Prateik Gandhi will be seen by the audience as Harshad Mehta. Let me tell you that Prateik Gandhi was famous in 2014 in the Gujarati film Be Yaar. After this, movies like Rong Side Raju got even more recognition. Talking about Hindi films, Prateek Salman Khan's production house, under the production house Lavayatri and friends have also been seen. However, the symbol face is not visible in the teaser. It is special that apart from this web series, the story of Harshad Mehta will be shown in Abhishek Bachchan starrer film Big Bull. Big Bull is also rumoured to be released online. ",
            "date": "Updated October 28, 2020",
            "views": "615",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mukund Anandan",
                    "user_href": "/profile/Mukund-Anandan"
                },
                {
                    "user_id": "Vanish Jain",
                    "user_href": "/profile/Vanish-Jain"
                },
                {
                    "user_id": "Ayush Shahi",
                    "user_href": "/profile/Ayush-Shahi-22"
                },
                {
                    "user_id": "Krishna Pratz(కృష్ణ ప్రతిభ)",
                    "user_href": "/profile/Krishna-Pratz-కృష్ణ-ప్రతిభ"
                },
                {
                    "user_id": "Sanghamitra M.S",
                    "user_href": "/profile/Sanghamitra-M-S"
                },
                {
                    "user_id": "Rafsan Noon",
                    "user_href": "/profile/Rafsan-Noon"
                },
                {
                    "user_id": "Amit Laskaria",
                    "user_href": "/profile/Amit-Laskaria"
                },
                {
                    "user_id": "Shivam Kansagara",
                    "user_href": "/profile/Shivam-Kansagara"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-9080"
                },
                {
                    "user_id": "Chirag Miglani",
                    "user_href": "/profile/Chirag-Miglani-8"
                },
                {
                    "user_id": "Yashraj Singh Rathor",
                    "user_href": "/profile/Yashraj-Singh-Rathor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anuj Mishra",
                "href": "/profile/Anuj-Mishra-59"
            },
            "answer_text": "The Hansal Mehta-coordinated web arrangement Scam 1992 has dazzled fans all over India. The web arrangement takes the watcher on an excursion exhibiting the whole Harshad Mehta trick of 1992. The chief and the skilled gathering of entertainers make the arrangement an intriguing watch and has increased huge fascination from a few crowds. Fans are anxious to watch the show and along these lines here is a knowledge on where to watch trick 1992.  Where you watch “Scam 1992” There are 2 ways to watch this serious: 1> Scam 1992 is a Sony selective web arrangement and in this manner one can watch the whole 10-section arrangement on the web on the Sony Liv site or on the Sony Liv application. The account of the Scam 1992 can without much of a stretch be seen on those stages only. 2> You can download “THOP TV” and watch free. For Thop Tv you need to install APK file in android phone/TV and enjoy. If you face any problem drop your issue in comment section. This is really a good good very good series. I love the dialogue “RISK hai to ISHQ hai” 5 star out of 5 star. :) Here you watch “Scam 1992” trailer >>>>  Hope my answer is helpful for you all. ",
            "date": "Answered October 24, 2020",
            "views": "329",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Somesh Agrawal",
                    "user_href": "/profile/Somesh-Agrawal-32"
                },
                {
                    "user_id": "Piyush Lashkari",
                    "user_href": "/profile/Piyush-Lashkari-3"
                },
                {
                    "user_id": "Manish Chaudhary",
                    "user_href": "/profile/Manish-Chaudhary-186"
                },
                {
                    "user_id": "Soumyadeep Mondal",
                    "user_href": "/profile/Soumyadeep-Mondal-30"
                },
                {
                    "user_id": "Santhosh Ramesh",
                    "user_href": "/profile/Santhosh-Ramesh-5"
                },
                {
                    "user_id": "Yashraj Singh Rathor",
                    "user_href": "/profile/Yashraj-Singh-Rathor"
                },
                {
                    "user_id": "Hasin Zaidi",
                    "user_href": "/profile/Hasin-Zaidi"
                },
                {
                    "user_id": "Jay Palrecha",
                    "user_href": "/profile/Jay-Palrecha"
                },
                {
                    "user_id": "Sahana Um",
                    "user_href": "/profile/Sahana-Um"
                },
                {
                    "user_id": "Jugraj Singh",
                    "user_href": "/profile/Jugraj-Singh-82"
                },
                {
                    "user_id": "Debabrata Subudhi",
                    "user_href": "/profile/Debabrata-Subudhi"
                },
                {
                    "user_id": "Sanjay Cooldude",
                    "user_href": "/profile/Sanjay-Cooldude"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yashraj Singh Rathor",
                "href": "/profile/Yashraj-Singh-Rathor"
            },
            "answer_text": "It will be available on SonyLIV, most probably. The release date is not known yet.  Here is the trailer:  ",
            "date": "Answered August 20, 2020",
            "views": "349",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suraj Kumar",
                    "user_href": "/profile/Suraj-Kumar-11526"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-9080"
                },
                {
                    "user_id": "Arun K M",
                    "user_href": "/profile/Arun-K-M-2"
                }
            ]
        }
    ]
}