{
    "title": "Where did the term vittles come from? - Quora",
    "tags": [
        "Phrase Origins",
        "Etymology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ann Carlyle",
                "href": "/profile/Ann-Carlyle"
            },
            "answer_text": "Q: Where did the term vittles come from? According to Culinary Lore: Vittles DefinitionVittles is an old-time word for food which we tend to associate with the rural South, cowboys, pioneers, mountain men, and the like. It actually comes from Middle English, by way of French.  Some cowboys out on the range having some vittles, chuckwagon in the background, c. 1880-1910. It is sometimes suggested that victuals is the proper way of saying vittles and that vittles is simply a vulgar misspelling of a more refined word. The history of the word in English and in French tells a different story. Vittles is actually a shortened and simplified spelling of the Middle English word vitailles, which arrived via the Old French word of the same spelling. It has been used in English since at least the early 1300’s. The word vitailles was in use when it was discovered that the original origin of the word was the Latin word victualia. This caused some to imagine a ‘proper’ course of action would be to respell vitailles as victailles, which became the curious word victuals, supposed to be the proper spelling of vittles. Vittles actually remained the most common use of the term, but the confused etymology caused many to think that vittles, all along, had been a misspelling and mispronunciation of victuals, which is pronounced without the ‘C’ as VIH-tuhl. This practice of attempting to refine English by aligning words with their supposed Latin etymons is actually fairly common, and is yet another way that English spelling can be so confusing, as unnecessary letters are added to “Latinize” English words.  Just for curiosity’s sake, here is a list of other words that were Latinized. For the first words in the list, the pronunciation of the words never changed, only the spelling. Here are some other examples: dette to ‘debt’ to match Latin debitum and dubitaresisours to ‘scissours’ to scissors to match Latin scissorlangage to ‘language’ to match Latin languareceite to ‘receipt’ to match Latin receptum (the word recipe came from receipt)samon to ‘salmon’ to match Latin salmoquire to ‘choir’ to match Latin chorusaventure to ‘adventure’ to match Latin adventura (pronunciation changed to pronounce the ‘d’)avis to ‘advice’ to match Latin advisum (‘d’ pronounced)perfeit to ‘perfect’ to match Latin perfectusWhat is the Origin of 'Vittles' for Food? ",
            "date": "Answered February 9, 2020",
            "views": "853",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Cherry",
                    "user_href": "/profile/Doug-Cherry-1"
                },
                {
                    "user_id": "Laurie Tomchak",
                    "user_href": "/profile/Laurie-Tomchak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karla Toper",
                "href": "/profile/Karla-Toper"
            },
            "answer_text": "Yes. It is a colloquial sort of screw up of an actual old archaic term: victual. (An old word for food or provisions, often used in ship- readying terminology; as in: “The ship is properly victualed.”) The word victual is from the Latin word “victus” meaning nourishment. Old English and cockney speech has a harder time pronouncing some of the Latin turned English words, so things like “victuals” come out to sound like vittles. I’ve heard a few people from rural and Southern US use the term occasionally. ",
            "date": "Answered February 23, 2020",
            "views": "336",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Green",
                "href": "/profile/Jeff-Green-40"
            },
            "answer_text": "It is straight English, a variant spelling of victuals, which follows the well trodden path from Latin to Old French to Norman French to English. Victus and later victualis mean food in Latin. ",
            "date": "Answered February 9, 2020",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laurie Tomchak",
                    "user_href": "/profile/Laurie-Tomchak"
                }
            ]
        }
    ]
}