{
    "title": "Where are the oldest trees in the world? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Matt Pizzuti",
                "href": "/profile/Matt-Pizzuti-2"
            },
            "answer_text": "When trying to identify the oldest trees in the world, there’s an obvious answer, plus a few additional candidates. Every continent may have a very old specimen here and there. However it’s likely that the region that hosts the world’s oldest trees is the Western part of North America. Bristlecone pine  The most obvious answer to this question—the oldest tree based on counting the growth rings on a single trunk—is the Bristlecone pine, Pinus longaeva, with identified specimens that are more than 5,000 years old. It’s likely that there are other living bristlecones, whose rings have not yet been counted, that are even older. Bristlecones live in high mountains in the U.S. states of California, Utah, Nevada and Colorado, in dry, cold, rocky and windy places where other trees can’t survive. At high altitudes the growing season may be as short as 2–3 months, so the trees grow extremely slowly and tend to be small trees even when very old. The sparse vegetation limits fire danger and the climate is also inhospitable to decay, so the dead branches last for centuries too, giving the bristlecone forest a very distinguishable, gnarled and ancient look. An ancient aspen grove in Utah  You can stretch the definition of “tree” to come across an even older organism in Utah, a massive aspen grove called Pando that consists of 100-year-old trees that are clones of a tree that sprouted from seed at least 80,000 years ago. The quaking aspen, Populus tremuloides, frequently sprouts new trunks from its roots. As an opportunistic organism, the tree spreads rapidly after a fire when competing pines and firs have been cleared away. The aspen roots remain alive and protected under the soil and are ready to quickly sprout. All of the individual trees that grow from the same root system will be genetically identical, and although the roots connecting them may eventually rot away, many scientists still refer to the “clonal colony” as a single tree. Over centuries, aspen colonies can expand, retreat, or migrate, meaning that it’s hard to accurately date them. When it comes to Pando, 80,000 years is a low estimate (some think it could be a million years old)! It’s also possible that other unnamed aspen groves could be much older than Pando. Why North America? It’s funny the Western U.S. is known for so many record-breaking trees. It contains the oldest trees, the biggest tree (the giant sequoia, Sequoiadendron giganteum), and the tallest living tree (the coastal redwood, Sequoia sempervirens). In fact, the tree with another record—the fattest trunk—is the Montezuma cypress, Taxodium mucronatum, not too far away in Mexico. I have a couple ideas for why that may be. One, the obvious one, is that a lot of scientific articles come from the United States and Americans look the closest at their own trees, ignoring possibly older specimens that could exist elsewhere. In the future we may discover older trees in Africa or Asia. I think there’s another possible answer and it is that the Western United States was one of the last places in the world to be logged. By then, the environmental movement could protect some of the trees. Europe and Asia have many climates that are hospitable to big, old trees, but Europe was deforested hundreds of years ago and Asia’s most favorable climates for old trees have hosted organized civilizations for more than 4,000 years. The Western United States was protected by its remoteness and by large mountain ranges, which makes logging difficult. It started to be heavily logged in the 1880s and onward, but the loss of some really remarkable giant trees sparked the environmental movement to start protecting them. ",
            "date": "Answered March 20, 2018",
            "views": "531",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Penney",
                    "user_href": "/profile/David-Penney-2"
                },
                {
                    "user_id": "Dazz Jones",
                    "user_href": "/profile/Dazz-Jones-1"
                },
                {
                    "user_id": "Sylvia Bailey",
                    "user_href": "/profile/Sylvia-Bailey-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preksha Agrawal",
                "href": "/profile/Preksha-Agrawal-2"
            },
            "answer_text": "Until 2013, the oldest individual tree in the world was Methuselah, a 4,845-year-old Great Basin bristlecone pine (Pinus longaeva) in the White Mountains of California.  Researchers at the Rocky Mountain Tree-Ring Research Group then announced the age of another P. longaeva also located in the White Mountains — this one 5,062 years old. 6 of the Oldest Trees in the World What Is the Oldest Tree in the World? ",
            "date": "Answered March 20, 2018",
            "views": "351",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donny Yap",
                    "user_href": "/profile/Donny-Yap"
                },
                {
                    "user_id": "Saishyam Zambre",
                    "user_href": "/profile/Saishyam-Zambre"
                },
                {
                    "user_id": "M. A. Steinberger",
                    "user_href": "/profile/M-A-Steinberger"
                }
            ]
        },
        {
            "author_info": {
                "name": "M. A. Steinberger",
                "href": "/profile/M-A-Steinberger"
            },
            "answer_text": "Pinus longaeva, the Bristlecone pine, is the species with the longest-lived individuals. They are native to, and live in the White Mountains, which form the eastern boundary of the Owens Valley. That is California, for those unfamiliar with the US. They thrive at those high altitudes. ",
            "date": "Answered March 20, 2018",
            "views": "643",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rick Marsh",
                    "user_href": "/profile/Rick-Marsh-8"
                },
                {
                    "user_id": "Ananda Brown",
                    "user_href": "/profile/Ananda-Brown-2"
                },
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "Geoffrey Brickley",
                    "user_href": "/profile/Geoffrey-Brickley"
                },
                {
                    "user_id": "Heinrich Müller",
                    "user_href": "/profile/Heinrich-Müller"
                },
                {
                    "user_id": "Amar Oesterly",
                    "user_href": "/profile/Amar-Oesterly"
                },
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Beth Goldowitz",
                    "user_href": "/profile/Beth-Goldowitz"
                },
                {
                    "user_id": "Jacob Sommer",
                    "user_href": "/profile/Jacob-Sommer-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Sandbrook",
                "href": "/profile/David-Sandbrook"
            },
            "answer_text": "Bristlecone Pines in eastern California and Nevada. The same adaptation that lets them survive in a harsh environment (poor soil, arid, and extreme cold) also contributes to their longevity. ",
            "date": "Answered March 20, 2018",
            "views": "6",
            "upvotes": "0"
        }
    ]
}