{
    "title": "Where are modern Irish people descended from? - Quora",
    "tags": [
        "Descendants",
        "Irish Ethnicity and People",
        "Genealogy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Gilmore",
                "href": "/profile/Christopher-Gilmore-2"
            },
            "answer_text": "The only thing I can add to Grainne’s fascinating answer is that linguistically, the Irish Celts appear to belong to a different language family, and by extension ethno-cultural, branch of Celts than the Brythonic tribes of pre-Anglo-Saxon Britain (also known as the Britons). These Celts are of course otherwise known as Gaels. This division is still seen today between the two surviving branches of the Insular Celtic family of languages (the Brythonic family - Welsh and Breton and the Goidelic or Gaelic family - Scots Gaelic and the Irish language). In fact, Scotland’s historic national language and today regional language of the Highlands and Islands (their version of Gaelic) and the name of the ethnic group itself (the Scots) can actually be attributed to Irish settlers who arrived from Ulster (northern Ireland) during the 5th to 6th centuries. Hitherto, what is now Scotland, the Romans called it Caledonia, was inhabited by a mysterious confederation of Celtic tribes known as Picts (from the Latin Pictae or “painted ones,” because they liked to paint themselves blue). Little is known of the Picts, but it is often assumed that they likely spoke a Brythonic Celtic language akin to Welsh. As with the Angles and Saxons in England, the Gaels from Ireland (or “Scots”) became the dominant ethno-linguistic group in Scotland and probably assimilated the Picts and the various other Celtic peoples north of the Forth of Foyle. I have no idea how or when this division between Gael and Briton emerged within the Celtic family, but it is there and definitely significant. From what I understand, the Irish and Scots Gaelic languages have far more in common with each other than they do with Welsh or Breton (and vice-versa on the Brythonic side of the scale). It’s an interesting question to ponder precisely where the original Gaels of Ireland came from and who inhabited the island before them (we know that there were people there). But otherwise, as with the Scots, Welsh and English, the Irish have a diverse ancestry and much of what is told by ancient folklore has to be taken with an enormous grain of salt. Aside from Ireland’s Gaelic and earlier Bronze Age and Stone Age settlers, there were of course other waves of settlement: Celtic Britons - I have read before that there is limited evidence of Britain’s Celtic tribes establishing somewhat of a presence in Ireland, which given the later Gaelic settlement in Scotland is fascinating. The Norse - As with Scotland and England, Viking raids plagued Ireland throughout the Dark Ages, and at times, the Vikings established a considerable political presence in each country. In Ireland they founded the cities of Dublin, Waterford and Wexford (correct me if I’m wrong). However, their political power was broken by the Irish High King Brian Boru at the Battle of Clontarf in 1014. Regardless, as with Scotland and England, the Danish, Norwegian and Swedish Vikings undoubtedly left a genetic mark on Ireland. The Old English - English and Norman settlers who arrived following the invasions of 1169 and 1171 and initially settled around the Pale of Dublin. Many, probably most, Irish whose surnames begin with Fitz are at least partially descended from this group. They eventually adopted Ireland’s Gaelic language and customs, becoming more Irish than the Irish themselves, and by the time England was imposing its Protestant Reformation on Ireland they found themselves on the same side as the Catholic Gaelic natives. The Protestant Planters (mostly Scottish) - An effort after the Protestant Reformation by the English crown, and later the double monarchy of England and Scotland, to colonise Catholic Ireland and turn it Protestant. Most of the settlers, largely Scottish Presbyterians, were settled on confiscated lands in Ulster; however, there were sizeable Protestant “plantations” (colonies) in Leinster and Munster. ",
            "date": "Answered December 8, 2016",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Anderson",
                    "user_href": "/profile/William-Anderson-338"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Vince Kehoe",
                    "user_href": "/profile/Vince-Kehoe"
                },
                {
                    "user_id": "Pamela S. Hawn",
                    "user_href": "/profile/Pamela-S-Hawn"
                },
                {
                    "user_id": "Pieter Cornelis Wilhelmus Schraa",
                    "user_href": "/profile/Pieter-Cornelis-Wilhelmus-Schraa"
                },
                {
                    "user_id": "Maggie McQuaid",
                    "user_href": "/profile/Maggie-McQuaid-2"
                },
                {
                    "user_id": "John A. MacKay",
                    "user_href": "/profile/John-A-MacKay"
                },
                {
                    "user_id": "Vinicius Moura de Oliveira",
                    "user_href": "/profile/Vinicius-Moura-de-Oliveira"
                },
                {
                    "user_id": "Anmol Raina",
                    "user_href": "/profile/Anmol-Raina-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eamon O'Kelly",
                "href": "/profile/Eamon-OKelly"
            },
            "answer_text": "It’s not clear whether you are asking who the Irish people are primarily descended from (a) genetically, or (b) culturally. Depending on which question you are asking, the answer will be different. If it’s genetics you’re after, then we are primarily descended from stone-age hunter-gatherers who arrived in Ireland 10,000 years ago, just after the last ice sheets receded. The recent development of DNA analysis by historians has led to the startling discovery that the peoples of northwestern Europe (i.e., Great Britain and Ireland, northern and western France, northern Iberia) share a close common ancestry going back to the end of the last ice age. Although many other peoples have come into the region during that time (including the iron-age peoples misidentified as “Celts”) and added their genes to the mix, those ancient post-Ice Age settlers are the foundation of the northwestern European gene pool, including that of Ireland. In the intervening years, various others have added their genes to the mix as well, including Norse (Vikings), Angl0-Normans, Flemings, Welsh, English, Scots, French Huguenots, Palatine Germans, more English, and Ashkenazi Jews. If it’s our cultural antecedents you're looking for, then the first traces of people who could reasonably be regarded as “Irish” date back about 2,300 years. That’s when the first traces appear in Ireland of a Q-Celtic language that evolved into Old Irish. Thereafter, the island developed a culture, political structures, customs and laws that were markedly different from those of Great Britain and the nearby continental countries. I think it fair to say these are the people from whom the modern Irish are descended. Who were these first Irish and where did they come from? Nobody really knows. For a long time, historians equated the so-called Celts with the La Tene culture that arose in central Europe (present-day Switzerland and Austria) in the last few centuries B.C. and spread outward through most of Europe and even via the Balkans into Anatolia. The Celtic languages appeared to have emerged at around the same time as the sophisticated La Tene technology. Thus, it was reasonable to hypothesize that the La Tene “Celts” had conquered and displaced the original inhabitants of much of Europe, including the western fringes and isles, where their Irish, Scots, Welsh and Breton descendants flourish to this day. This theory has been undermined by more recent research, though it still has many supporters. First, (a) La Tene artifacts have been found in large areas of central and eastern Europe where there is no evidence that “Celtic” languages were ever spoken, and (b) no La Tene artifacts have been found in many parts of Ireland and Great Britain that seem indisputably to have been Celtic speaking. Recent research by ethnolinguists suggests that not only did the La Tene material culture and the Celtic languages not spread simultaneously, but the languages are much older than had previously been thought. There is a theory gaining traction (dubbed “Celts from the West”) proposing that the Celtic languages originated in the Iberian peninsula and spread from there along the Atlantic seaboard, perhaps as a lingua franca among interlinked trade networks. I discuss some of this in my answer to What should everyone know about Irish history? and in the comments thereto. For a detailed look at the origins of the Irish, I recommend : Amazon.com: The Origins of the Irish (9780500293300): J. P. Mallory: Books Also worth a look: Amazon.com: The Isles: A History (9780195148312): Norman Davies: Books I have not read the following (yet), but they look like they would be well worth checking out too: Celtic from the West; The Atlantic Celts ",
            "date": "Answered December 12, 2016",
            "views": "14",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Mandić",
                    "user_href": "/profile/David-Mandić"
                },
                {
                    "user_id": "Gearóid Mac Gunna",
                    "user_href": "/profile/Gearóid-Mac-Gunna"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Ben Toynton",
                    "user_href": "/profile/Ben-Toynton"
                },
                {
                    "user_id": "Pamela S. Hawn",
                    "user_href": "/profile/Pamela-S-Hawn"
                },
                {
                    "user_id": "Cathy White",
                    "user_href": "/profile/Cathy-White-58"
                },
                {
                    "user_id": "Dan Nyhan",
                    "user_href": "/profile/Dan-Nyhan"
                },
                {
                    "user_id": "Leonie Barkarne",
                    "user_href": "/profile/Leonie-Barkarne"
                },
                {
                    "user_id": "Luis M. Gonzalez",
                    "user_href": "/profile/Luis-M-Gonzalez"
                },
                {
                    "user_id": "Cynthia Colby",
                    "user_href": "/profile/Cynthia-Colby-1"
                },
                {
                    "user_id": "Barry Blatt",
                    "user_href": "/profile/Barry-Blatt-1"
                },
                {
                    "user_id": "Joe Ken",
                    "user_href": "/profile/Joe-Ken"
                },
                {
                    "user_id": "Anmol Raina",
                    "user_href": "/profile/Anmol-Raina-4"
                },
                {
                    "user_id": "Gráinne McKeown",
                    "user_href": "/profile/Gráinne-McKeown"
                },
                {
                    "user_id": "Jimmie Byrne",
                    "user_href": "/profile/Jimmie-Byrne"
                },
                {
                    "user_id": "Maggie McQuaid",
                    "user_href": "/profile/Maggie-McQuaid-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gráinne McKeown",
                "href": "/profile/Gráinne-McKeown"
            },
            "answer_text": "This question isn’t very clear. I think that you're asking what groups of people have come to Ireland and settled here thus ‘producing modern Irish people’. Of course the Ireland of today is home to people from all over the world but I'm going to assume that you are talking about ‘ethnic Irish people’ Nobody's quite sure where the first Irish people came from. A common school of though is the Iberian Peninsula (where Spain and Portugal is). This school of thought has taken some knocks when examined in recent years. It appears to be made up. They undoubtedly came from somewhere in Europe though. The first Irish people (commonly called Celts).The Normans.The Vikings.Various British people. This group in turn had their own various groups which Ireland didn't have. The Romans, the Anglos and the Saxons are all groups who made it to Britain but not Ireland. They probably made it into the Irish gene pool though because of the British.",
            "date": "Answered December 7, 2016",
            "views": "483",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Anmol Raina",
                    "user_href": "/profile/Anmol-Raina-4"
                },
                {
                    "user_id": "Christopher Gilmore",
                    "user_href": "/profile/Christopher-Gilmore-2"
                },
                {
                    "user_id": "Roger Fentiman",
                    "user_href": "/profile/Roger-Fentiman"
                },
                {
                    "user_id": "Vinicius Moura de Oliveira",
                    "user_href": "/profile/Vinicius-Moura-de-Oliveira"
                }
            ]
        }
    ]
}