{
    "title": "Where did spice originally come from? - Quora",
    "tags": [
        "Spices",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "M Arkandiptyo",
                "href": "/profile/M-Arkandiptyo"
            },
            "answer_text": "All depends. Every spice, like every other plant, have their particular origins. There is no one particular place in the world where all spice originates. These are just some example of the popular ones: Pepper - India Cinnamon - Southeast Asia Clove & Nutmeg - Indonesia Vanilla - Mexico, Central America Chilli - Central America However, seeing this we can see the one particular similarity of those origins - They all are hot and humid, tropical areas. ",
            "date": "Answered December 13, 2015",
            "views": "767",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Soham Kar",
                    "user_href": "/profile/Soham-Kar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lou Heavner",
                "href": "/profile/Lou-Heavner"
            },
            "answer_text": "Plants. It’s difficult to get more specific. Garlic powder, onion powder, turmeric and others come from roots, bulbs, or tubers. Herbs come mostly from leaves, like parsley, rosemary, and thyme. Cinnamon comes from bark. Many spices come from the fruit or seeds of the plant. Cayenne pepper, poppy seeds, nutmeg, and black pepper are examples. ",
            "date": "Answered March 1, 2019",
            "views": "171",
            "upvotes": " Answer requested by Louie S. Lalic",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/2016-5"
                },
                {
                    "user_id": "Ken Adams",
                    "user_href": "/profile/Ken-Adams-86"
                },
                {
                    "user_id": "Guru Prasad Iyer",
                    "user_href": "/profile/Guru-Prasad-Iyer"
                },
                {
                    "user_id": "Rahul K Jha",
                    "user_href": "/profile/Rahul-K-Jha-1"
                },
                {
                    "user_id": "Yuan Kae Chin",
                    "user_href": "/profile/Yuan-Kae-Chin"
                },
                {
                    "user_id": "Titus Agung",
                    "user_href": "/profile/Titus-Agung"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Green",
                "href": "/profile/Emma-Green-70"
            },
            "answer_text": "Most of the spices that we use - world’s popular spices - come from India: cinnamon, saffron, nutmeg, black pepper, red chili powder, curry, cardamom, cumin, cloves, coriander…  Source: 70% of spices come from India - BuzzKid.net ",
            "date": "Answered May 14, 2016",
            "views": "671",
            "upvotes": " View 6 Upvoters"
        },
        {
            "author_info": {
                "name": "Frieda Nagel",
                "href": "/profile/Frieda-Nagel"
            },
            "answer_text": "Generally spices are seeds, nuts and or bark from various plants and even trees. This is why to get the most punch and flavour you toast them. Heat releases the essential oils and excites the molecules. Herbs are generally leaves and roots from plants and benefit from crushing fresh leaves to release their flavours. ",
            "date": "Answered March 1, 2019",
            "views": "127",
            "upvotes": "0"
        }
    ]
}