{
    "title": "Where is the world’s oldest city located? - Quora",
    "tags": [
        "Locations",
        "Oldest",
        "Geography",
        "Cities and Metropolitan Areas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Gavi",
                "href": "/profile/Michael-Gavi"
            },
            "answer_text": "In Syria, Damascus. Damascus, Arabic Dimashq, city, capital of Syria. Located in the southwestern corner of the country, it has been called the “pearl of the East,” praised for its beauty and lushness; the 10th-century traveler and geographer al-Maqdisī lauded the city as ranking among the four earthly paradises.  The city’s Arabic name derives from Dimashka, a word of possibly pre-Semitic etymology, suggesting that the beginnings of Damascus go back to a time before recorded history. The city is commonly called al-Shām, the vernacularname of Syria as a whole, which is said to mean “the left” or “the north,” where the region is situated relative to the Arabian Peninsula. Owing to associations of Damascus with Aram, the biblical capital of the Aramaeans, some Arabic sources link Damascus and the Iram dhāt al-ʿimād(“Colonnaded Aram”) mentioned in the Qurʾān, an identification that has long been disputed. Also contended has been the association of Damascus with Jilliq, a fertile pre-Islamic site whose name derives from a word of unknown origin in use by the Ghassānids active there in the 6th century (see Ghassān). The city is still known by its popular epithet al-Fayḥāʾ(“the Fragrant”), earned perhaps for the freshness of its surrounding orchards and gardens. Many scholars believe that, among the ancient cities of the world, Damascus is perhaps the oldest continuously inhabited. Over the centuries, Damascus has been conqueror and conquered, wealthy and destitute, and capital of empire and small states. Its fame has been sustained by its continuous prominence as a commercial and intellectual centre. Its life has been nourished periodically by immigrants from the hinterland and from the Mediterranean Basin and Southwest Asia. Often a focus of contention by powers of East and West, Damascus’s fortunes have frequently been linked to those of distant capitals, most notably Ashur, Antioch, Rome, Baghdad, Cairo, and Istanbul. Now a burgeoning metropolis of the Middle East, it retains, as it has through centuries of triumph and disaster, an indomitable spirit and a considerable charm. ",
            "date": "Answered January 6, 2020",
            "views": "215",
            "upvotes": " Answer requested by Lydia Mimiaga",
            "upvoters": [
                {
                    "user_id": "Owen Brown",
                    "user_href": "/profile/Owen-Brown-239"
                },
                {
                    "user_id": "Max Broberg Hansen",
                    "user_href": "/profile/Max-Broberg-Hansen"
                },
                {
                    "user_id": "Peter Spencer",
                    "user_href": "/profile/Peter-Spencer-2"
                },
                {
                    "user_id": "Fred Belland",
                    "user_href": "/profile/Fred-Belland"
                },
                {
                    "user_id": "Kevin Richardson",
                    "user_href": "/profile/Kevin-Badiambila-Frédéric"
                },
                {
                    "user_id": "Gary Meaney",
                    "user_href": "/profile/Gary-Meaney"
                },
                {
                    "user_id": "Malachi Martinez",
                    "user_href": "/profile/Malachi-Martinez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pablo Djankowicz Ruizinowitz",
                "href": "/profile/Pablo-Djankowicz-Ruizinowitz"
            },
            "answer_text": "World’s oldest city, eh? I’ll go by continent, and I will go by “continuously inhabited”: Europe: Plovdiv, Bulgaria (according to archeological evidence founded at around 5000 BC, with historical reference to it in ancient Greek documents going back to 1350 BC). North America: Cholula, Mexico (according to archeological evidence founded at around 500 BC, with historical reference to it in ancient Mayan documents going back to 700 AD) South America: Cuzco, Peru (according to archeological evidence founded at around 1000 AD, with ancient Inca myths recorded by the Spanish stating the foundation of this city at around 1250 AD). Asia: Jericho, West Bank/Israel (according to archeological evidence founded at around 10,000 BC, with historical reference to it in ancient Mesopotamian and Egyptian documents going back to 3000 BC). Africa: Luxor, Egypt (according to archeological evidence founded at around 6000 BC, with historical reference to it in ancient Egyptian documents going back to 3200 BC) Oceania/Australia: Honolulu, Hawaii, U.S. (according to archeological evidence founded at around 1300 AD, with historical reference to it in chronicles of European explorers from the late 1700s AD). ",
            "date": "Answered January 3, 2020",
            "views": "426",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Henry Smith",
                    "user_href": "/profile/James-Henry-Smith-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aston Rose",
                "href": "/profile/Aston-Rose"
            },
            "answer_text": "Around 10,000 years ago, the first man-made construction project took place in present-day Turkey. This was a temple of some sort, and I guess you could call it the oldest city in a way. The definition of a city is a large town and the definition of a town is a built-up area with a name, defined boundaries, and local government, that is larger than a village and generally smaller than a city. That would mean our 10,000-year-old temple doesn’t qualify for the award. After looking up the definition for government, (defined as the group of people with the authority to govern a country or state; a particular ministry in office.), I have come to decide that a dictator doesn’t really count and neither, therefore, do multiple ancient or very old societies ruled by a single person. This means I’ll have to find the first governments, and, after researching ancient history and politics, I have found your answer. The oldest city in the world, according to these new criteria, appears to be in Sumer in Ancient Mesopotamia. This is probably highly debatable, but here is my opinion on the subject. Here’s what Google says about Sumer: As one of the first urban civilizations in the world, the Sumerians established the world's first and oldest government. By the 4th millennium BCE, Sumer was divided into many city-states which were ruled by a priestly governor or king. I hope I answered your question well enough :) ",
            "date": "Answered January 15, 2020",
            "views": "75",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Dimitar-Esperanto Berberu",
                "href": "/profile/Dimitar-Esperanto-Berberu"
            },
            "answer_text": "Consider that cities were destroyed & later rebuilt by various peoples.List of oldest continuously inhabited cities Luxor in (ancient) Egypt since 3200 BC, population: 507k- North AfricaByblos (Jubayl) Levant since 3000 BC, pop: 40k - LebanonYanshi, Henan (Erlitou Site) since 1900 BC, pop: 830k - ChinaDamascus Levant since late 2nd millennium BC, significant later, pop: 1.7m - Syria ",
            "date": "Answered January 3, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mohamed Amin",
                "href": "/profile/Mohamed-Amin-277"
            },
            "answer_text": "There is a disagreement between historians regarding the oldest inhabited city and still until now in the world. Some historians said it is the Palestinian city of Jericho and some historians said it is the city of Damascus in the Levant. Most probably, it is the city of Jericho, which is located in Palestine. ",
            "date": "Answered January 3, 2020",
            "views": "74",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Barrie Nigel Thurlow",
                "href": "/profile/Barrie-Nigel-Thurlow"
            },
            "answer_text": "Thank you most kindly for asking me about this, Lydia. Well, I don't think that the question which may be the world's oldest city has been definitely established yet; but here is a link to an article about some of the candidates, which I very much hope you'll find interesting: https://www.wisegeek.com/what-are-the-oldest-cities-in-the-world.htm With every good wish, Barrie ",
            "date": "Answered January 5, 2020",
            "views": "65",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Edouard Slive",
                "href": "/profile/Edouard-Slive"
            },
            "answer_text": "Damascus, the capital of modern-day Syria, is largely believed to be the world’s oldest city, with evidence of its habitation up to 11000 years ago. ",
            "date": "Answered January 4, 2020",
            "views": "22",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Jack Penland",
                "href": "/profile/Jack-Penland-2"
            },
            "answer_text": "The world’s oldest city is Jericho, in the Palestinian territories. It has been continuously inhabited since 9000 BC, more than 11,000 years. The world's 20 oldest cities ",
            "date": "Answered January 8, 2020",
            "views": "32",
            "upvotes": " Answer requested by Lydia Mimiaga"
        }
    ]
}