{
    "title": "Where is Durga Puja celebrated in Kuala Lumpur? - Quora",
    "tags": [
        "Durga Puja Festival",
        "Kuala Lumpur, Malaysia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranjal Sengupta",
                "href": "/profile/Pranjal-Sengupta"
            },
            "answer_text": "In Kuala Lumpur there are a couple of places where DurgaPuja is celebrated. The more prominent one being the Malaysia Bengalee Associations’s Durga Puja which was first started in the year 1984. There is a registered Bengal House Poojabari in Port Dickson, but Durga Puja is held every year at different venues. Only Kali Puja is held at Pooja Bari. For more info check out this link: Malaysian Bengalee Association Another place where Durga Puja is organised is at Vivekanand Ashrama at Brickfields by Abhijaan Recreation Club. For more details you may check this link: Abhijan Recreation Club - Malaysia ",
            "date": "Answered October 9, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samrat Sengupta",
                    "user_href": "/profile/Samrat-Sengupta-24"
                },
                {
                    "user_id": "Anand Gupta",
                    "user_href": "/profile/Anand-Gupta-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amala Nagappan",
                "href": "/profile/Amala-Nagappan"
            },
            "answer_text": "I am guessing you are asking about Navratri? If so there are very few temples in the city that don’t celebrate it. The big Amman temples in KL like the Sri Mahamariamman Temple, Kuala Lumpur at Jalan Tun H S Lee, City Centre, 50000 Kuala Lumpur, Wilayah Persekutuan Kuala Lumpur, Malaysia had a very grand celebration. Hope you go and enjoy. ",
            "date": "Answered September 27, 2017",
            "views": "931",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ram Sankapal",
                    "user_href": "/profile/Ram-Sankapal"
                },
                {
                    "user_id": "Michael Carlos Singh",
                    "user_href": "/profile/Michael-Carlos-Singh"
                },
                {
                    "user_id": "Hanabi",
                    "user_href": "/profile/Hanabi-6"
                }
            ]
        }
    ]
}