{
    "title": "Where did the Huguenots go? - Quora",
    "tags": [
        "Huguenots",
        "History of France",
        "History of Europe",
        "France",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geren Nichols",
                "href": "/profile/Geren-Nichols"
            },
            "answer_text": "South Africa Huguenot heritage in South Africa. If you see a French name in the Springboks there is probably a Huguenot ancestor. South Africa national rugby union team - Wikipedia Many went to Berlin in Brandenburg. The Huguenot Refuge in Brandenburg - Musée protestant French Cathedral, Berlin - Wikipedia La Rochelle - Wikipedia was one of three French citys allowed Protestant worship after 1573. New Rochelle, New York - Wikipedia was a Huguenot settlement. French law from the French Revolution in 1790 featured a right of return. This was ended for persons who had not received already renewed French citizenship in 1945. ",
            "date": "Answered March 25, 2020",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter de Loriol",
                "href": "/profile/Peter-de-Loriol-1"
            },
            "answer_text": "All over the known world at the time who were protestant, to countries, states, colonies and enclaves: Switzerland, Holland, protestant German states, England, Norway, Sweden and the New World. ",
            "date": "Answered March 19, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Petja Jäppinen",
                    "user_href": "/profile/Petja-Jäppinen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Todd Clepps",
                "href": "/profile/Kevin-Todd-Clepps"
            },
            "answer_text": "They still exist in France and other nations. Huguenots are French Protestants,many migrated to Britain due to anti-Huguenot persecution in France.Sir Lawrence Olivier was of partial french Huguenot descent. ",
            "date": "Answered March 19, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Aurand",
                "href": "/profile/Jerry-Aurand"
            },
            "answer_text": "You’ll be amazed: Descendants: List of Huguenots - Wikipedia ",
            "date": "Answered March 19, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}