{
    "title": "Where was cuneiform writing invented? - Quora",
    "tags": [
        "Cuneiform",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Girija Devi",
                "href": "/profile/Girija-Devi-76"
            },
            "answer_text": " Cuneiform was one of the earliest systems of writing, invented by Sumerians in ancient Mesopotamia. Source: Wikipedia Cuneiform script is one of the earliest known forms of written expression. Emerging in Sumer around the 30th century BC, with predecessors reaching into the late 4th millennium (the Uruk IV period), cuneiform writing began as a system of pictographs. In the three millennia the script spanned, the pictorial representations became simplified and more abstract as the number of characters in use also grew gradually smaller, from about 1,000 unique characters in the Early Bronze Age to about 400 unique characters in Late Bronze Age (Hittite cuneiform). The original Sumerian script was adapted for the writing of the Akkadian, Eblaite, Elamite, Hittite, Luwian, Hattic, Hurrian, and Urartian languages, and it inspired the Ugaritic and Old Persian alphabets. Cuneiform writing was gradually replaced by the Phoenician alphabet during the Neo-Assyrian Empire, and by the 2nd century AD, the script had become extinct. Cuneiform documents were written on clay tablets, by means of a blunt reed for a stylus. The impressions left by the stylus were wedge shaped, thus giving rise to the name cuneiform (\"wedge shaped\", from the Latin cuneus, meaning \"wedge\"). The cuneiform writing system was in use for more than 35 centuries, through several stages of development, from the 34th century BC down to the 1st century AD.[2] It was completely replaced by alphabetic writing (in the general sense) in the course of the Roman era and there are no Cuneiform systems in current use. For this reason, it had to be deciphered from scratch in 19th century Assyriology. Successful completion of decipherment is dated to 1857. Cuneiform was written on clay tablets, on which symbols were drawn with a blunt reed called a stylus. The impressions left by the stylus were wedge shaped, thus giving rise to the name cuneiform, wedge-writing.The Sumerian script was adapted for the writing of the Akkadian, Elamite, Hittite, Assyrian, and Luwian languages, and inspired the Old Persian and Ugaritic national alphabets. It was widely used in Mesopotamia for about 3000 years, though the syllabic nature of the script as it was refined by the Sumerians was unintuitive to the Semitic speaking. The system consists of a combination of logophonetic, consonantal alphabetic and syllabic signs The cuneiform script underwent considerable changes over a period of more than two millennia. The image below shows the development of the sign SAG \"head\". ",
            "date": "Answered August 10, 2020",
            "views": "193",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Edward Banning",
                    "user_href": "/profile/Edward-Banning"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mushtak Pathan",
                "href": "/profile/Mushtak-Pathan-2"
            },
            "answer_text": "Cuneiform was first developed by the ancient Sumerias of Mesopotamia around 3000 B. C. The first cuneiform writing were pictograph created by making wedge shaped marks on clay tablets with blunt reeds used as a stylus. ",
            "date": "Answered August 11, 2020",
            "views": "9",
            "upvotes": "0"
        }
    ]
}