{
    "title": "Which country is more likely to lose World War 3? - Quora",
    "tags": [
        "World War 3",
        "World Wars",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dillan Vanner",
                "href": "/profile/Dillan-Vanner"
            },
            "answer_text": "Russia and China, maybe even both. It doesn't matter if they both team up, not even them or their allies can win. Why? Well first, let's look at a map of NATO, and see how big it is.  And that's what you call big. That's nearly all of Europe! And we also have the US and Canada. If Russia invades, its required that everybody you see here joins in a war against them. If we start it, then most would join. The US spends around 650 billion dollars on the military, more than Russia AND China combined. Not to mention that the US can use their bases near China to bomb them, hampering their industry, as most of it is in the coastal regions. It would be lucky if Russia and China can bomb them. The US also has more of these…  An Abraham Lincoln carrier battle group from 2000. Yep, 2000! Not to mention Russia’s allies besides China and Pakistan are weak and poor Central Asian and Caucasian countries. If Pakistan joins, then so will India, and Pakistan will get destroyed. So from all of these points, it is likely that the Russians and Chinese would lose in WWIII. BUT In total, each side has 15000 of these total…  If one side gets desperate enough, then Uranium beats everybody and wins. ",
            "date": "Answered June 27, 2017",
            "views": "59",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Rajagopal",
                    "user_href": "/profile/Aditya-Rajagopal-2"
                },
                {
                    "user_id": "Starov Yaroslav",
                    "user_href": "/profile/Starov-Yaroslav"
                },
                {
                    "user_id": "San Goshi",
                    "user_href": "/profile/San-Goshi"
                },
                {
                    "user_id": "Alex Magaña",
                    "user_href": "/profile/Alex-Magaña-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Buzawa",
                "href": "/profile/Carl-Buzawa-1"
            },
            "answer_text": "Assuming a shooting war involving nukes, that involved the destruction of the roads/bridges and other infrastructure arguably the most densely populated, China. If, on the other hand the country, like Russia, has vast spaces but the climate is harsh and the people in St Petersburg or Moscow have no real chance to get out of town before starving and or freezing to death…well not too much better. Even the USA with its multitude of farming areas could expect to “write off” its dense urban cores unless transportation could move vast amounts of food/fuel etc to starving (and after a while gang led) urban residents. Not a pretty picture for anyone, eh. Think casualty rates of 90–95% in China, 90% in Russia and 80% in the USA….sound like a “happy” scenario? Now if no one pulled the nuke trigger but there was a major conventional shooting warChina would be the biggest loser by far. The US Navy or its allies would totally block all fuel arriving from the sea as well as food etc. While China gets SOME fuel from Mother Russia, and produces some food not nearly enough. Meanwhile, neither Russia nor the USA is particularly susceptible to either naval or aerial “blockades” as they can produce all the raw materials they need. Not a happy scenario for China, meaning their leaders might feel they had no choice but to escalate, as a capitulation would likely mean regime overthrow and probably forfeiture of their lives as their people would likely overthrow and kill them for getting into an unwinnable war. ",
            "date": "Answered May 15, 2019",
            "views": "296",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ali Neill",
                    "user_href": "/profile/Ali-Neill-1"
                }
            ]
        }
    ]
}