{
    "title": "Which were the first states to secede and why? - Quora",
    "tags": [
        "Secessionism in the USA",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin M Fox",
                "href": "/profile/Kevin-M-Fox-1"
            },
            "answer_text": "South Carolina seceded from the Union in December 1860 shortly after Lincoln was elected president. Lincoln and the then new Republican Party wanted to limited slavery and prevent its expansion into newly admitted states. At one time Virginia was the most populous state in the Union and thus pushed the Virginia Plan to be adopted where the popular vote would rule supreme over the minority’s rights. People decrying the electoral college today as a remnant of slave holding states are ignorant of this fact. Anyway as the non-slave states’ (Northern states) population grew, the Southern slave-holding states maintained political power on the national level by having an equal number of slave states to free states. This was exemplified by a balance in the Senate. Moreover, to keep the South complacent, Northern politicians bent over backwards to appease the South by kowtowing to them by supporting or at least not attacking slavery as an institution. These politicians were known as dough faces. Several presidents such as Franklin Pierce were considered Dough Faces. Lincoln would not kowtow. The South fearing a loss of power and prestige, broke away with the intent to keep slavery and thus seceded and formed the Confederacy. They tried and failed. In suppressing the rebellion, the Union accelerated the demise of slavery in the United States. The struggle for civil rights continues. When calls for secession emerged after Trump’s election in 2016, the detractors again were echoing what the slave holders had done when they saw some of their influence decreasing. Be careful what is called for in the heat of passion. The virulent belief that you’re right doesn’t excuse the mayhem that will occur. The instigators would most likely lose but not before causing much pain and destruction just because they insisted they were right. ",
            "date": "Answered March 31, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Walker",
                    "user_href": "/profile/David-Walker-925"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Mitchell",
                "href": "/profile/Michael-Mitchell-116"
            },
            "answer_text": "Though many justification have been advanced for the secession and creation of the Confederate States, such as the particularly vague“states rights”, as you see below in their Declaration of Secession, South Carolina was the first state to secede. The next paragraph lists a single justification, the institution of slavery…Revisionist history teaches more noble justification but, read the Declarations of the states involved. Slavery is the first justification for all but one. We, the People of the State of South Carolina, in Convention assembled do declare and ordain, and it is hereby declared and ordained, That the Ordinance adopted by us in Convention, on the twenty-third day of May in the year of our Lord One Thousand Seven hundred and eighty eight, whereby the Constitution of the United States of America was ratified, and also all Acts and parts of Acts of the General Assembly of this State, ratifying amendment of the said Constitution, are here by repealed; and that the union now subsisting between South Carolina and other States, under the name of \"The United States of America,\" is hereby dissolved. The General Government, as the common agent, passed laws to carry into effect these stipulations of the States. For many years these laws were executed. But an increasing hostility on the part of the non-slave holding States to the institution of slavery, has led to a disregard of their obligations, and the laws of the General Government have ceased to effect the objects of the Constitution. ",
            "date": "Answered March 31, 2020",
            "views": "49",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Mark Farrell",
                    "user_href": "/profile/Mark-Farrell-23"
                }
            ]
        }
    ]
}