{
    "title": "Which pharaoh died during or at the end of the Israelite captivity? - Quora",
    "tags": [
        "Pharaohs",
        "Israelites",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony - Antonakis Maritis",
                "href": "/profile/Tony-Antonakis-Maritis"
            },
            "answer_text": " The name most commonly associated with the Pharaoh of the Exodus is Ramses (often spelled as Ramesses or Rameses). This is the name used in movies such as The Ten Commandments, The Prince of Egypt, and Exodus: Gods and Kings. While this connection may be common in pop culture, the Bible doesn’t give an explicit name for this ruler. Determining exactly who the Pharaoh of the Exodus was isn’t something answerable using Scripture alone. An additional difficulty in naming the Pharaoh of the Exodus is that Egyptian history is erratic and notoriously unreliable. Archaeologists note that Egyptian records often overlap, contradict each other’s dates, and leave out major historical events. This is especially true if the events are unflattering to the reigning Pharaoh. Determining the time period when Jewish slaves would have been held in Egypt, then, becomes trickier than simply comparing Egyptian records to non-Egyptian records. In order to harmonize the book of Exodus, Egyptian history, and secular archaeology, one has to be open-minded about potential dates for the events recorded in all three sources. Given that flexibility, there is one possibility for the Pharaoh of Exodus: Neferhotep I, Pharaoh of the 13th Dynasty. Consider the following historical facts: Neferhotep’s dynasty began because his predecessor, Amenemhat III, had no surviving sons and his daughter, Sobekneferu, was childless. This would explain why, in Exodus 2, Pharaoh’s house takes in an orphaned Hebrew child. Sobekneferu could have been the Egyptian princess who drew Moses out of the Nile and named him. Neferhotep I presided over Egypt during an era of profound chaos, described in the Ipuwer Papyrus: “Plague stalks through the land and blood is everywhere. . . . Nay, but the river is blood . . . gates, columns and walls are consumed with fire . . . the son of the high-born man is no longer to be recognized. . . . The stranger people from outside are come into Egypt. . . . Nay, but corn has perished everywhere.” Few monuments from the period survive. Neferhotep was not succeeded by his son Wahneferhotep but rather by his brother Sobkhotpe IV. This fits with the story of the biblical Pharaoh, who lost a son to the final plague of Egypt, the death of the firstborn (Exodus 12:29). There is no surviving mummy of Neferhotep. The lack of remains is to be expected if Neferhotep was among those swept away during the crossing of the Red Sea (Exodus 14). Other historical tidbits about the era of Neferhotep I overlap with the biblical story of Exodus. These include evidence of a slave town, Kahun, which appears to have been hastily abandoned, as Scripture describes. Staves shaped like snakes have been found, dated to this same time period, echoing the tricks of the Pharaoh’s magicians (Exodus 7). Shortly after Neferhotep’s reign, Egypt was overrun by the Hyskos, an unlikely event unless the nation was profoundly weakened. Unfortunately, the realities of ancient Egyptian history make it all but impossible to say for certain which Pharaoh is described in the book of Exodus. It may even have been a Pharaoh whose memory has been completely obliterated by time and forgotten by history. That anonymity could even be a deliberate punishment, another reminder that supposedly divine rulers are nothing compared to the one true God. At the very least, available evidence supports the biblical Exodus as a real, historical event. Read Tony’s article on LinkedIn, Medium, BlogSpot, WordPress, Prince Dom ",
            "date": "Answered January 7, 2020",
            "views": "206",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Courtney Chapman",
                    "user_href": "/profile/Courtney-Chapman-8"
                },
                {
                    "user_id": "Chavoux Luyt",
                    "user_href": "/profile/Chavoux-Luyt"
                },
                {
                    "user_id": "James Elmore",
                    "user_href": "/profile/James-Elmore-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Richter",
                "href": "/profile/Matthew-Richter-2"
            },
            "answer_text": "This question has a number of problems that make it difficult to answer. The Israelites were in Egypt for a number of generations in which time a number of Pharaohs died. The Israelites, according to the Bible entered Egypt by choice not as slaves. Most scholars believe that slavery was not common in Egypt and, unless captured in war, slavery was usually entered into voluntarily. These aspects of Egyptian society begs the question, “Were the Israelites actually captives or slaves in Egypt?” In order to answer the question we need to know when the Israelites were in Egypt. We believe the Israelite departure from Egypt related in Exodus occurred during the reign of Ramses II (1279 - 1213 BCE). There is no direct proof that this is correct but there is a lot of archaeology evidence to indirectly supports it; including the first mention of the Israelites as a people occurring on a stele during the reign of Ramses son and immediate successor. But when did the Israelites enter Egypt? The most accepted theory on when the Israelites entered Egypt is during the reign of the Hyksos during the Second Intermediate period. The only reason for this theory that I’ve ever heard is that the Israelites could have come in with the Hyksos when they invaded Egypt. This theory places the Israelite entry somewhere between 1674 to 1535 BCE. These dates work with the accepted chronology as a date much earlier might be too soon based on when believe the period of the Patriarchs was. I can’t contradict these dates but I’m skeptical. Skepticism aside, and ignoring the captivity questions, if we assume that the Israelites were in Egypt for over 400 years between the 18th and 12th centuries BCE a lot of pharaohs died during their stay. The currently accepted list of Pharaohs would shows over 80 Pharaohs ruling and dying in this period but there could have been pharaohs we don’t know about. It is also possible that some Pharaohs on the list are duplicate entries as Pharaohs frequently had up to four different names. ",
            "date": "Answered December 30, 2019",
            "views": "72",
            "upvotes": "0"
        }
    ]
}