{
    "title": "Which modern day people are descended from the vikings? - Quora",
    "tags": [
        "Vikings",
        "Genealogy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger H Werner",
                "href": "/profile/Roger-H-Werner"
            },
            "answer_text": "Wow. this is a fascinating subject and one that isn’t as easy to understand as it may seem. First language: Who were the Vikings? Danes, Norwegians, Swedish? In fact in the 8th through 11th centuries, ‘the Viking Era,’ these nations didn’t exist. Historians and archaeologists define Vikings by those speaking Old Norse, which includes people from the modern nations indicated. Norwegians seem to have headed west, the Danes south, the Swedes southeast. I am unaware of conflicts between Norse groups over settlements so perhaps distribution is this simple…but I doubt it. Genetics: Norse have a rare mtDNA haplogrouping including I and X, and, the more common Y-haplogroups I1, R1a, and R1b(R21+). Presence of the mtDNA genetic markers would tend to indicate northern European ethnicity while R1a and R1b(R21+) may represent a proto-European chomosome originated in the area between the Black sea and the Ural Mountains including the Transcaucasus region. I must note that those studying genetic haplogroupings do not agree on distribution and to date, I haven’t read a single technical paper that suggests anyone really understands what these various distribution maps really mean. Nevertheless, they are fascinating especially when considered with other lines of evidence. For maps look up mtDNA or Y-DNA haplogroups on google and you will get a sense for the disagreements. History: Vikings settled in French Normandy (French word roughly meaning Norse). They occupied parts of the British Isles (northern Scotland Shetland, Orkney, Isle of Man, North Umbria) and to a lesser degree in Ireland (around Dublin). Until 1471, the Shetland and Orkney islands, along with Caithness until 1476, were part of the king of Norway’s feudal lands. They were ceded to the Scottish king when an unpaid dowry resulted in the forfeiture of this Earldom to Scotland. History with Speculation: Perhaps the most well known Scottish-Norwegian was Earl of Orkney Henry Sinclair. Some historians believe that he reached Nova Scotia by 1400. Most historians reject this idea but how can one explain extant tombstones bearing Templar crosses in remote parts of Nova Scotia dating to the 15th century? Henry Sinclair was a well known sea captain who possessed a fleet of ships and he certainly knew about Greenland, Iceland, and the Faroe Islands, as they were Norse settlements subject to his liege lord, the King of Norway. Henry is reported dead by 1400 but his body was never buried. He was presumed by family to have been lost at sea? The romantic in me, along with a willingness to consider all opinions, prevents me from dismissing the unusual. I have seen reliable photographs, taken by a professional surveyor friend, of pre-Columbian European evidence from Nova Scotia. This information remains unpublished. My facebook page has a photograph of one of the headstone. I spent 5 years researching the image caduceus and the only comparable image I found was in an obscure book on the Armenian Orthodox Church—single snake winding around a cross. The image has both a traditional interpretation and an esoteric one. The entire date wasn’t visible in a photo reproduction but the second half, the death date, indicated the year ‘14- -.’ Henry Sinclair’s son William began construction of Rosslyn Chapel on 20 September 1456 with permission to build a chapel granted in 1446. Rosslyn has so much esoteric imagery that it’s impossible to briefly describe. The St. Clair (or Sinclair) family has owned its Rosslyn lands since 1290. Eupedia.com has many excellent maps on genetic and languages, while a review of wikipedia under ‘Viking Expansions’ offers a map of lands Vikings settled and raided. This map indicates a Viking enclave by the 11th century on the European side just west of modern Turkey maps of European, North African, Near Eastern, and Central Asian haplogroupings but they probably weren’t a significant genetic component of this region. The areas raided were far greater then settlements. Viking Rus formed the palace guard of the Byzantine emperor from the mid 10th to the end of the 4th Crusade in they late 13th century. The ranks of this group were swelled after William the Bastard's victory over Harold at Hastings, in 1066. History: Normans settled in Sicily and extreme southern Italy by the 11th century (Bohemond of Sicily fought in the First Crusade and became King of Antioch in 1097). Norse also settled in Latvia and Estonia in the early 9th century before following the rivers south to found Kyivian Rus by 862 and after 1199, the principalities of Novgorod, Chernigov, Galicia-Volhynia, and the Grand Duchy of Moscow (the founders of the Russian Empire—lots of Germanic/Nordic, e.g., Aryan blood in European former USSR. Vikings also settle in Faroe Island, Jan Mayen Island, possibly Svalbard (Spitzbergen), Iceland, Greenland, and the very northern tip of Newfoundland (L’Anse aux Meadows) by the 10th through 12th centuries. A second Viking archaeological site on a southern Newfoundland peninsular found in 2016 may represent a second Viking settlement. A very rusted Viking style battle axe was found in Minnesota farmer in 1898 but it remains unclear if Vikings explored the North American interior from Hudson Bay. At least there is no clear definitive physical evidence but a fair amount of cicumstantial historical evidence. Norse sagas describe some rather amazing stories and they must be read to be appreciate (most are translated to English), including the disappearance of an entire Norwegian fleet northwest of its last reported sighting off West Greenland. Just myths and legends? I don’t think they should be taken as fact on face value but dismissing out of hand is equally ahistorical. The West and Middle Greenland settlements began with a 300 - 400 year warming period ending at what is called the Little Ice Age in the 15th century. No one knows what happened to the last settlements but Danish records indicated the yearly ship stopped sailing decades before the settlement ended. They may have died naturally, been killed, or absorbed by Greenland natives in the mid-15th century but as far as I know there has been no genetic study of Greenland’s native population. There was an established Roman Catholic bishopric in West Greenland and Columbus certainly knew of Greenland’s existence before sailing west. I don’t think I missed anything but if that happen please don’t hesitate to contact me. ",
            "date": "Updated July 25, 2019",
            "views": "96",
            "upvotes": " View 87 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kris Chisholm",
                    "user_href": "/profile/Kris-Chisholm-1"
                },
                {
                    "user_id": "Elizabeth Stepp",
                    "user_href": "/profile/Elizabeth-Stepp-4"
                },
                {
                    "user_id": "Sorin cr SoRin",
                    "user_href": "/profile/Sorin-cr-SoRin"
                },
                {
                    "user_id": "Sweety Singh",
                    "user_href": "/profile/Sweety-Singh-339"
                },
                {
                    "user_id": "Alice",
                    "user_href": "/profile/Alice-1051"
                },
                {
                    "user_id": "Jennifer Hughes",
                    "user_href": "/profile/Jennifer-Hughes-224"
                },
                {
                    "user_id": "Jennifer Keckler",
                    "user_href": "/profile/Jennifer-Keckler-3"
                },
                {
                    "user_id": "Vegard Ryan",
                    "user_href": "/profile/Vegard-Ryan"
                },
                {
                    "user_id": "Darren Sherman",
                    "user_href": "/profile/Darren-Sherman-2"
                },
                {
                    "user_id": "Staffan Linde",
                    "user_href": "/profile/Staffan-Linde"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Bäckström",
                "href": "/profile/David-Bäckström"
            },
            "answer_text": "If you by Vikings mean all those taking part in the raidings of western and eastern Europe between 750–1070 I would say that most people of European decent has some Viking ancestory. The first problem we have is to define who took part in the raidings. Most probably the Danish, Norwegian and Swedish kings at the time engaged both Finns and Vends and maybe also Poles and Kievans since they were vassals or allies. The vikings settled along the entire atlantic coast from Iceland to Portugal and along the shorts of the Russian rivers all the way from the Baltic sea to the Black and Caspian seas. The Viking kings and there successors such as the Normans in France and on Sicily, the Russian kings, princes, and emperors married with all the noble houses of Europe. The Viking era ended some 40 generations ago and since then we have had the German conquest of eastern Europe followed by the crusades, the black death at least 10 wars including countries people of mentioned origins which all made people move around. On this came colonialism and imperialism which primarily was driven by the british and the french from regions of those countries dominated by ancestors of Viking settlers. In short; most people of European decent is in one way or the other related to vikings, goths, Franks, Romans, Huns, Hungarian knights, Mongolian khans and so on. The most related to Vikings though is people living in northern Europe and the Anglosphere. ",
            "date": "Answered August 26, 2017",
            "views": "253",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sweety Singh",
                    "user_href": "/profile/Sweety-Singh-339"
                },
                {
                    "user_id": "Alice",
                    "user_href": "/profile/Alice-1051"
                },
                {
                    "user_id": "BEVERLY L Racey",
                    "user_href": "/profile/BEVERLY-L-Racey"
                },
                {
                    "user_id": "Dave Smith",
                    "user_href": "/profile/Dave-Smith-2181"
                },
                {
                    "user_id": "Christine Coakley",
                    "user_href": "/profile/Christine-Coakley-4"
                },
                {
                    "user_id": "Edward Chmielowski",
                    "user_href": "/profile/Edward-Chmielowski-1"
                },
                {
                    "user_id": "Barry Conner",
                    "user_href": "/profile/Barry-Conner-2"
                },
                {
                    "user_id": "Mohammad Yamini",
                    "user_href": "/profile/Mohammad-Yamini"
                },
                {
                    "user_id": "Peter Guerrero",
                    "user_href": "/profile/Peter-Guerrero-2"
                },
                {
                    "user_id": "Joe Woolley",
                    "user_href": "/profile/Joe-Woolley-2"
                }
            ]
        }
    ]
}