{
    "title": "Which is older, Devanagari or Sanskrit? - Quora",
    "tags": [
        "Devanagari (script)",
        "Sanskrit (language)",
        "Linguistics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yayati Ekbote",
                "href": "/profile/Yayati-Ekbote"
            },
            "answer_text": "All the answers above are good. But somethings need to be kept in mind. There is lot of debate over the period of Rigveda. Some believe, it dates back to 3300 BC or even much before. But we find no written proof until Panini's grammer \"Ashtadhyayi\" which is said to be written in 4th century BC. The Rigveda text has lot of reference to holy river \"Saraswati\". But considering the other contexts of text, the area which could be visualized does not have such river. Later, the plate tectonic movement study proved that nearly about 3300-3100 BC, lot of underground movement happened due to which the river dried away. Currently the Ghaggar river from himachal pradesh is what believed as Saraswati river.But the point is, if Rigveda mentions the drying up of the river and there is proof of plate movements, then we have to believe that Sanskrit, as a language predates the written form with a large margin.More over, the discovery of 'Avesta' in Iran and its texts as 'Yasanas' which are believed to be written around 1500 BC. The yasanas couldn't be read or understood without sanskrit. And it has lot of references to what we believe as \"Mythology\". The \"Angra Mainyu\" of Avestan text is nothing but 'Indra' in vedic context.Anyways, the main point is devnagari is a script and Sanskrit is a language and the language predates the script. ",
            "date": "Answered May 22, 2014",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshya Biswal",
                    "user_href": "/profile/Akshya-Biswal-3"
                },
                {
                    "user_id": "Sai Venkat Kumar",
                    "user_href": "/profile/Sai-Venkat-Kumar-5"
                },
                {
                    "user_id": "Dinesh Roy (दिनेश रॉय)",
                    "user_href": "/profile/Dinesh-Roy-दिनेश-रॉय"
                },
                {
                    "user_id": "Nitesh Kanwar",
                    "user_href": "/profile/Nitesh-Kanwar-1"
                },
                {
                    "user_id": "Rajkiran Panuganti",
                    "user_href": "/profile/Rajkiran-Panuganti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saket Sinha",
                "href": "/profile/Saket-Sinha-3"
            },
            "answer_text": "Thanks for A2A. Devanagri is a Script, whereas Sanskrit is a Language. Devanagri Script is derived from the Nagri Script, which has been derived from Brahmi Script.Links that can help you understand more: नागरी लिपि - विकिपीडिया  - This link is not very complete but the list on the right side gives a clear picturehttps://en.wikipedia.org/wiki/Brahmi_script - Tells the detials about Brahmi scripthttp://hi.wikipedia.org/s/7ox - Check the various scripts shown in the link.Now coming to the actual question :  Sanskrit has no native Script. Yes it adopted devanagri as script, The alphabets are based on Brahmi script.Other than devanagri sanskrit has been written in Bhujimol Script(Bihar and Nepal regions of present) The begining of sanskrit has been traced back to 1500–1200 BC, as per Pāṇini, Sanskrit had evolved out of the earlier \"Vedic\" form. While, Devanagari Script is a part of Brahmic scripts and is a descendent  of Gupta script. Now the Gupta script itself evolved in about 4th Century and as per wikipedia, Devanagri evolved in 8th Century which is way late than the Sanskrit. So based on these informations we can say that Sanskrit is indeed older. ",
            "date": "Answered June 3, 2013",
            "views": "121",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vinayak Gautam",
                    "user_href": "/profile/Vinayak-Gautam-6"
                },
                {
                    "user_id": "Satria Pg",
                    "user_href": "/profile/Satria-Pg"
                },
                {
                    "user_id": "Pavan Kumar Mudiraj",
                    "user_href": "/profile/Pavan-Kumar-Mudiraj"
                },
                {
                    "user_id": "Prasanna Vengatesan",
                    "user_href": "/profile/Prasanna-Vengatesan"
                },
                {
                    "user_id": "Jade Chen",
                    "user_href": "/profile/Jade-Chen-40"
                },
                {
                    "user_id": "Andrew Dunbar",
                    "user_href": "/profile/Andrew-Dunbar-3"
                },
                {
                    "user_id": "Vedarthananda Swami",
                    "user_href": "/profile/Vedarthananda-Swami"
                },
                {
                    "user_id": "Sachchidanand Swami",
                    "user_href": "/profile/Sachchidanand-Swami"
                },
                {
                    "user_id": "Hari Iyer",
                    "user_href": "/profile/Hari-Iyer-79"
                },
                {
                    "user_id": "Herdeep Singh",
                    "user_href": "/profile/Herdeep-Singh-3"
                }
            ]
        }
    ]
}