{
    "title": "Which tribe of people live without clothes? - Quora",
    "tags": [
        "Tribalism",
        "Anthropology",
        "Demographics",
        "The Human Race and Condition",
        "Fashion and Style",
        "Clothing and Apparel",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ajay Kumar (AJ)",
                "href": "/profile/Ajay-Kumar-AJ-26"
            },
            "answer_text": "Actually I would love to answer your question. Because I see your question is more towards seeking the tribes who have well preserved their culture even in the 21st century rather than calling it as a source of pornography. If you feel blessed to be born in the 21 st century surrounded with modern technologies and gadgets, then you must know that our world is full of people who still are unaware of all these conveniences. These are men and women born in the ancient tribes who have no idea what lies in the world outside the jungle or island or mountain they live in. In fact, they are so unfriendly and unacceptable to outsiders that they are capable of killing, frightening or eating them too! If you try to get too close to them, you might have to pay with your life because these uncivilised tribal do not understand the rules and regulations of the world. All they follow is their culture and tradition and listen to the elders of their family. The images may offend you, or you are otherwise not supposed to view such material, scroll no further. • • • • Meet the naked tribes of Nigeria. Koma: Despite being in the 21st century, these rural communities have managed to preserve their culture and continue to practice nudity. Majority of the Koma hill-dwellers depend on farming, hunting and gathering forest products like bananas, locust beans and canarium used for body lubrication. The Koma people believe in a supreme being called Zum or Nu. Reportedly, some International NGOs are working with the communities to help preserve the Koma culture and promote tourism.  Sentinelese Tribe of North Sentinel, Andaman Well Sentinelese tribal must be the most unfriendly lot in the whole wide world! The remoteness of this more than 60,000 year old tribe, who live on North Sentinel Island in Andaman, is such that Indian government has put a ban on tourists and travellers on going near them as they are uncivilized, dangerous and can kill outsiders within a blink of eye. They have no idea what lies in the outside world while outside world is unaware of how they live, the language they speak or what they call themselves as no one till date has been able to find a way inside the island. The world was quite surprised when the entire tribe survived the wrath of 2004 Tsunami that claimed thousands and lakhs of innocent lives. During that time the government had sent a few helicopters over the island to check on them but they drove them away by shooting arrows at them!  Xingu tribe: You will be able to find them in the Brazilian Amazon. Men wear a loincloth that covers their genitals. Women wear a thin belt of vegetable fiber around the waist. They wear anklets, bracelets and necklaces in everyday life, and elaborate headdresses for festivals. They have many cultural similarities despite their different ethnologies. Xingu people represent fifteen tribes and all four of Brazil's indigenous language groups, but they share similar belief systems, rituals and ceremonies.   ",
            "date": "Answered June 26, 2020",
            "views": "661",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Jeevan Pandey",
                    "user_href": "/profile/Jeevan-Pandey-33"
                },
                {
                    "user_id": "Kamal Pallav",
                    "user_href": "/profile/Kamal-Pallav"
                },
                {
                    "user_id": "Vivek Kumar",
                    "user_href": "/profile/Vivek-Kumar-10191"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vileen Agnihotri",
                "href": "/profile/Vileen-Agnihotri"
            },
            "answer_text": "I am myself a one man tribe. I live totally alone in my flat. I do not wear any clothes, when I am alone in my flat. I feel totally free, and relaxed by living this way. I am a very happy, healthy satisfied, never-to-be-married single man. One may confirm this by opening my profile. There is nothing vulgar, indecent or obscene in my pics I live simple pure liberated life using logic, imagination. Vileen Agnihotri ",
            "date": "Answered June 26, 2020",
            "views": "111",
            "upvotes": " Answer requested by Shalinee Tirpude"
        }
    ]
}