{
    "title": "Which English king was worse, John, Henry VIII, Richard the Lionheart, Charles I or Henry III? - Quora",
    "tags": [
        "Henry III of England",
        "John, King of England",
        "King Charles I (England, Scotland and Ireland)",
        "Richard I, the Lionhearted",
        "King Henry VIII (historical figure)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Etienne Hanratty",
                "href": "/profile/Etienne-Hanratty"
            },
            "answer_text": "As people, John and Richard were pretty unsavoury. Henry VIII started well and only became a tyrant midway through his reign, after which he certainly made us for it. Henry III strikes me as a nice, but ineffectual sort of chap and Charles was a product of his times whose biggest mistake was probably to believe his own hype. Of the five, Henry III and Charles unwittingly contributed to the growth of parliamentary democracy by failing to stand up to Simon De Montford and by winding up parliamentary respectively. In spite of themselves, they left a positive legacy. Dependent on your perspective, Henry VIII either freed England from the yoke of the church or he gave rise to the sectarianism which was so damaging in subsequent centuries. In each case, there’s an argument that they left the country in a better place than they found it, although in Henry VIII’s case, it’d have been a tough job getting there. Richard might be an iconic figure but it’s hard to see what he left behind. All of which leaves John. Granted, his reign saw Magna Carta. If I was feeling charitable, I could say that that puts him on a par with Charles, as someone whose objectionable behaviour made him a catalyst in the evolution of democracy. The difference is that Charles believed in the divine right of kings and acted accordingly-and probably wasn’t even disproportionately tyrannical for the times-whereas John was a medieval gangster As king, he presided over the loss of most of our continental territories, got us made subject to a papal interdict and lost the Crown Jewels in the Wash. Worse, he was just as much of a failure as a human being. He rebelled against his father and brother, probably murdered a nephew who had a better claim to the throne and dumped his wife for a younger woman without even bothering to invent a church and change the course of ecclesiastical history. Even the Shakespeare play he inspired is so bad that nobody ever performs it. It has to be Johnny Softsword, a horrible person and a dreadful king. ",
            "date": "Answered September 21, 2018",
            "views": "113",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victoria White",
                    "user_href": "/profile/Victoria-White-228"
                },
                {
                    "user_id": "Abhishek Chakrabarti",
                    "user_href": "/profile/Abhishek-Chakrabarti-3"
                },
                {
                    "user_id": "Monique Trapani",
                    "user_href": "/profile/Monique-Trapani"
                },
                {
                    "user_id": "Réka Nagy-Buza",
                    "user_href": "/profile/Réka-Nagy-Buza"
                },
                {
                    "user_id": "Suzi Macgregor",
                    "user_href": "/profile/Suzi-Macgregor"
                },
                {
                    "user_id": "Jenny Till",
                    "user_href": "/profile/Jenny-Till-1"
                },
                {
                    "user_id": "Linda Markey",
                    "user_href": "/profile/Linda-Markey-1"
                },
                {
                    "user_id": "Alicia Heller",
                    "user_href": "/profile/Alicia-Heller-2"
                },
                {
                    "user_id": "Kerry George",
                    "user_href": "/profile/Kerry-George-3"
                },
                {
                    "user_id": "Christine Nally",
                    "user_href": "/profile/Christine-Nally"
                },
                {
                    "user_id": "Diane Tabbott",
                    "user_href": "/profile/Diane-Tabbott"
                },
                {
                    "user_id": "Jane Howitt",
                    "user_href": "/profile/Jane-Howitt-2"
                },
                {
                    "user_id": "Joanne McKinnis",
                    "user_href": "/profile/Joanne-McKinnis"
                },
                {
                    "user_id": "Terri Gnazari",
                    "user_href": "/profile/Terri-Gnazari"
                },
                {
                    "user_id": "Louis Weinblatt",
                    "user_href": "/profile/Louis-Weinblatt"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Judy-C-42"
                },
                {
                    "user_id": "Jane Mooberry",
                    "user_href": "/profile/Jane-Mooberry"
                },
                {
                    "user_id": "Kirk Roberts",
                    "user_href": "/profile/Kirk-Roberts"
                },
                {
                    "user_id": "Jan Leonardy",
                    "user_href": "/profile/Jan-Leonardy"
                },
                {
                    "user_id": "Amy Hindmand",
                    "user_href": "/profile/Amy-Hindmand"
                },
                {
                    "user_id": "Karen Benedict",
                    "user_href": "/profile/Karen-Benedict-5"
                },
                {
                    "user_id": "Tracie Dacre",
                    "user_href": "/profile/Tracie-Dacre"
                },
                {
                    "user_id": "Megan Troche",
                    "user_href": "/profile/Megan-Troche"
                },
                {
                    "user_id": "Lara L. Rizzuto",
                    "user_href": "/profile/Lara-L-Rizzuto"
                },
                {
                    "user_id": "Mad Abril",
                    "user_href": "/profile/Mad-Abril"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alicia-R-28"
                },
                {
                    "user_id": "Daniel Reed",
                    "user_href": "/profile/Daniel-Reed-47"
                },
                {
                    "user_id": "Chris Young",
                    "user_href": "/profile/Chris-Young-114"
                },
                {
                    "user_id": "Gael E Phillips",
                    "user_href": "/profile/Gael-E-Phillips"
                },
                {
                    "user_id": "Shannon Thomson",
                    "user_href": "/profile/Shannon-Thomson-35"
                },
                {
                    "user_id": "Kelli Burnett",
                    "user_href": "/profile/Kelli-Burnett-1"
                },
                {
                    "user_id": "Lynne Clwyd",
                    "user_href": "/profile/Lynne-Clwyd"
                },
                {
                    "user_id": "Diane Broome Masters",
                    "user_href": "/profile/Diane-Broome-Masters"
                },
                {
                    "user_id": "Brian Mayer",
                    "user_href": "/profile/Brian-Mayer-7"
                },
                {
                    "user_id": "Halina Minadeo",
                    "user_href": "/profile/Halina-Minadeo"
                },
                {
                    "user_id": "Renata Veloso",
                    "user_href": "/profile/Renata-Veloso-1"
                },
                {
                    "user_id": "Alicia Veal",
                    "user_href": "/profile/Alicia-Veal-1"
                },
                {
                    "user_id": "Hans Garcia",
                    "user_href": "/profile/Hans-Garcia-2"
                },
                {
                    "user_id": "Stacey Lynn Vermilyea",
                    "user_href": "/profile/Stacey-Lynn-Vermilyea"
                },
                {
                    "user_id": "Lisa Marie",
                    "user_href": "/profile/Lisa-Marie-317"
                },
                {
                    "user_id": "Druzy Miller",
                    "user_href": "/profile/Druzy-Miller"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                },
                {
                    "user_id": "Daniela Romero",
                    "user_href": "/profile/Daniela-Romero-9"
                },
                {
                    "user_id": "Harry Nagel",
                    "user_href": "/profile/Harry-Nagel"
                },
                {
                    "user_id": "Georgia Fleming",
                    "user_href": "/profile/Georgia-Fleming-4"
                },
                {
                    "user_id": "James Titchen",
                    "user_href": "/profile/James-Titchen"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Peter Bartley",
                    "user_href": "/profile/Peter-Bartley-3"
                },
                {
                    "user_id": "Adi Redzic",
                    "user_href": "/profile/Adi-Redzic-1"
                },
                {
                    "user_id": "Nathan Donaldson",
                    "user_href": "/profile/Nathan-Donaldson-4"
                },
                {
                    "user_id": "Nathan Shea Ouedraogo",
                    "user_href": "/profile/Nathan-Shea-Ouedraogo"
                },
                {
                    "user_id": "Mark Dornan",
                    "user_href": "/profile/Mark-Dornan"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Leah Earl",
                    "user_href": "/profile/Leah-Earl"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Miles Kennedy",
                    "user_href": "/profile/Miles-Kennedy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irene Ambrose",
                "href": "/profile/Irene-Ambrose"
            },
            "answer_text": "It really depends on what you call 'worse', personally or what happened during their reigns. Henry 111 was crowned as a young boy and had little control over anything until years later, and then was pretty much not too interested in anything but his own architectural projects, and as mentioned before, he allowed a rudimentary parliament to gain more influence via Simon de Montfort's rebellion. However his Uncle Richard and father John had left the country virtually penniless since Richard bled it dry firstly to go on crusade and then to ransom him after he was captured on his way back. Richard did literally nothing for England but be a hero type for some as fighting was what kings did. John was a decent enough fighter on occasion but had all his continental territories rising up at more or less the same time and at the end of his life faced a French invasion backed by some of his own aristocracy. He was an able administrator and more interested in that than fighting, hence the chaos with the French he left for his son's guardians to take care of. Then again he probably didn't intend to die when his son was so young. The facts he divorced his first wife and married another woman can't be held against him ,lots of people did that if they could afford to and get it past the church. Neither was the fact the country faced an interdict; that happened quite a lot too through history, and to Henry V111 and Elixabeth 1 among others. Also primogeniture wasn't the law then, Richard designated John his heir, and his nephew Arthur had been fighting him (and besieging his own grandmother) so was a threat to the throne, which really didn't need a young stroppy King on it at that stage. John wasn't a very pleasant person but there's no proof he murdered Arthur and he did preside, albeit unwillingly, over Magna Carta. Henry V111 and Charles 1 were something else again; Henry has been discussed so much it would take hours to re-hash that. Charles was an unlucky King, and that's always a bad thing (for the King). He was unwillingly to bend at all in an age when so many things were being questioned. He was right in one thing, though. The court which tried him had no authority to do so. ",
            "date": "Answered January 5, 2019",
            "views": "634",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Monique Trapani",
                    "user_href": "/profile/Monique-Trapani"
                },
                {
                    "user_id": "Etienne Hanratty",
                    "user_href": "/profile/Etienne-Hanratty"
                },
                {
                    "user_id": "Linda Brown",
                    "user_href": "/profile/Linda-Brown-423"
                },
                {
                    "user_id": "David Birkman",
                    "user_href": "/profile/David-Birkman"
                },
                {
                    "user_id": "Kelli Burnett",
                    "user_href": "/profile/Kelli-Burnett-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erin Marie",
                "href": "/profile/Erin-Marie-369"
            },
            "answer_text": "England has had so many bad kings I restrict my own mental worst list to the ones who got deposed, which still leaves us with five. Based on this, I’d have to say Charles I was the worst. That said, John I was lazy, one of the worst qualities in any monarch, and had a cruel streak a mile wide. Henry VIII caused centuries of domestic turmoil. You can draw a line between his claim to be King of Ireland and the Anglo-Irish conflicts of the ’90s and today. Henry III was in his own way worse than John, although without the cruel streak. He gets exempted from most worst lists only due to being one of the few kings to be a good and loving parent, and building Windsor Castle. Richard the Lionheart, in my opinion, is not bad so as much not interested in England compared with his other dominions. If John’s sin was sloth, Richard’s was pride, and this is what caused the failure of the Crusades and Richard’s capture, which prevented him from ever really succeeding as monarch. I’d also like to nominate George IV for worst king. He may not have presided over any glaring foreign disasters like his father, but he is by far the most unlikable and contemptuous monarch I’ve read about, and lacked even the personal ambitions or energy of other bad kings. Henry VIII at least knew his kingship was for more than funding expensive parties. ",
            "date": "Answered September 21, 2018",
            "views": "394",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Dornan",
                    "user_href": "/profile/Mark-Dornan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Reedman",
                "href": "/profile/Janet-Reedman"
            },
            "answer_text": "Well, I’d take out Henry III. He was ineffective rather than bad but perhaps a little underrated too. I admit not to know much about Charles I but he seemed ineffective more than anything. I loathe Henry VIII, a true tyrant who may have had up to 75,000 of his own subjects killed. He abolished the monasteries not because of their ‘corruption’ but so he could lay his mitts on the money—which he blew totally. Richard Lionheart didn’t give 2 hoots about England; he was all about war for the sake of war,and if the people were bled dry, so what. He was worse than ineffective. John, despite the rep, COULD be an able administrator but his own personality and chasing the baron’s wives didn’t help his case. He could be incredibly cruel—starving prisoners to death was a specialty. Anyway…I’m going with ‘my hero’—Henry the Big Fat Eighth ",
            "date": "Answered September 21, 2018",
            "views": "298",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Rodgers",
                    "user_href": "/profile/John-Rodgers-169"
                },
                {
                    "user_id": "Marisa Kimura",
                    "user_href": "/profile/Marisa-Kimura"
                },
                {
                    "user_id": "Linda Brown",
                    "user_href": "/profile/Linda-Brown-423"
                },
                {
                    "user_id": "Alicia Veal",
                    "user_href": "/profile/Alicia-Veal-1"
                },
                {
                    "user_id": "James W Clarke",
                    "user_href": "/profile/James-W-Clarke-1"
                },
                {
                    "user_id": "Nathan Donaldson",
                    "user_href": "/profile/Nathan-Donaldson-4"
                },
                {
                    "user_id": "Mark Dornan",
                    "user_href": "/profile/Mark-Dornan"
                },
                {
                    "user_id": "J. Peltosaari",
                    "user_href": "/profile/J-Peltosaari"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bogin",
                "href": "/profile/John-Bogin"
            },
            "answer_text": "My first comments on this question is; which of these kings were English? Although both King John and King Richard were born in England neither of them, nor John’s son Henry III, spoke English as a first language or could really be regarded as English. Henry IV is considered to be the first king of England (after Hastings) to speak English as his first language. King Charles was scotch being born in Dunfermline. So; by default King Henry VIII was the worst – and the only English King on the list. Going to the other side of the question as it was meant to be asked I will say King Charles, or as he was known at the time ‘The Man of Blood’ was the worst. By his attitudes, lies and deceit he started the English Civil Wars. There were three in total. The English Civil wars went on to engulf all parts of the British Isles and brought about the rise of Oliver Cromwell. A man who is still hated by many people. Figures for the total number of people killed in the three Civil Wars are hard to determine but I can easily see them being in the region of 250,000 or about 2.5% of the population ",
            "date": "Answered September 21, 2018",
            "views": "344",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrian Mould",
                    "user_href": "/profile/Adrian-Mould"
                },
                {
                    "user_id": "Linda Brown",
                    "user_href": "/profile/Linda-Brown-423"
                },
                {
                    "user_id": "Tessa Reynolds",
                    "user_href": "/profile/Tessa-Reynolds"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cinthia King",
                "href": "/profile/Cinthia-King"
            },
            "answer_text": "Historians are pretty clear that king John was the worst king in British history. His incompetenty, backstabbing and self-serving behavior is legendary. To illustrate how bad he was, the Magna Carta was created out of desperation, specifically to limit the powers of King John. He was ruining the country. Never before had a king’s powers been limited but John was so bad it was either that or assassination. Knowing how many terrible kings there had been up to then, for him to be the first who’s powers were limited, says a lot about how bad he was. It’s one reason no King since has ever been named John ",
            "date": "Answered October 29, 2018",
            "views": "210",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Baker",
                    "user_href": "/profile/Simon-Baker-121"
                },
                {
                    "user_id": "Alicia Veal",
                    "user_href": "/profile/Alicia-Veal-1"
                },
                {
                    "user_id": "James W Clarke",
                    "user_href": "/profile/James-W-Clarke-1"
                },
                {
                    "user_id": "Curtis Arnold",
                    "user_href": "/profile/Curtis-Arnold-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Awuku",
                "href": "/profile/Christopher-Awuku-1"
            },
            "answer_text": "John wasn’t all bad, in that he did have strong administration in parts. But I think there was much tension due to the bad rule of his brother, Richard Lionheart. Had he not died, I feel he may have suffered his own Barons’ War. Though I’d go for Charles I. He was arrogant, and was to influenced by his cousing the King of France, whilst not realising that England had a different mode of kingship. ",
            "date": "Answered September 21, 2018",
            "views": "163",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linda Brown",
                    "user_href": "/profile/Linda-Brown-423"
                },
                {
                    "user_id": "James W Clarke",
                    "user_href": "/profile/James-W-Clarke-1"
                },
                {
                    "user_id": "Mark Dornan",
                    "user_href": "/profile/Mark-Dornan"
                },
                {
                    "user_id": "J. Peltosaari",
                    "user_href": "/profile/J-Peltosaari"
                }
            ]
        }
    ]
}