{
    "title": "Which are the most famous and notorious swords in world history? - Quora",
    "tags": [
        "Sword Fighting",
        "Swords",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Longzi Tran-Huu",
                "href": "/profile/Longzi-Tran-Huu"
            },
            "answer_text": "In world history, I wouldn't know, because most people simply don't know much about Swords and Kantei.  In fact, most people would answer the way too famous Excallibur. But this sword doesn't exist, and if it does, what people are worshipping is not Excallibur itself, since they have no idea of what this sword actually looks like. :v  So it's not Excallibur. But in Japan... their is a lot of famous Swords (Meitô), noteworthy Swords (Meibutsu), National Treasures (Kokuhô) and highly precious blades.  The most notorious would be the Tenka Goken (Five Swords of Tianxia) and among them either Dôjigiri Yasutsuna or Mikazuki Munechika.  Masamune is the most famous Katana-kaji  2nd is Muramasa.  But beside Honjo Masamune itself, their is no single sword who is really more famous than the others. And his most famous katana are Honjô and Kanze, but Kanze don't really have epic deeds recorded, most people won't immediately think of Kanze when they think of Masamune greatest masterpiece...  In general, Swords made by Ko-Bizen Tomonari would have an higher cost.  For the Shintô period, Swords made by Kotetsu are simply more famous than the others, even when they are not better in Kireaji or more good looking than other Nihontô. Just my personal feeling, but from a pure art point of view, Ikkanshi and Jitsua are far better than Kotetsu.  If you go on the Touken Ranbu wiki, you will find a lot of famous, precious and ancient Nihonto.  If you ask for those with the greatest legendary deeds, I would answer O-Tengu Masaie and Hachimonji-Chogi.       Basically, Yagyû Sekishûsai was fighting a giant tengu in the forest behind his manor, in Yagyu no sato. When he slayed him, Sekishûsai felt their was something strange with the corpse... check up... instead of a dead humanoid crow he finds a giant boulder cleaved in two !  Impossible ? Sekishusai was a Kensei, a saint swordsman. People who consider miracles from Christian Saint possible but not those from Shinbutsu-Shugo saints, those are hypocrites. :p   As for Hachimonji-Chôgi... a daimyo of the Satake clan was wielding it in a battle, and he slew a samurai horseman with it. Kabutowari, the helmet splitting technique / phenomenon, really existed and still exist in Japan. But lord Satake didn't just made a small cut in the helmet and bald head of his foe... he splitted him from the Kabuto to the saddle, cleaving it completely. Considering how it fell from the horse forming, on the ground, it formed the 8 (hachi) ideogram (monji).  Chôgi was a member of the 10 disciples of Masamune.  Their is also the super badass Yoto Raigiri, but I don't know much about it and never saw it. It would be quite hard to find it anyway, because it's overflooding with Naruto spam. x)  Same for Hachimonji, never saw it's picture. Not from near at least, it was probably a replica. Their is a wikipedia article...  雷切 - Wikipedia But no picture.  It's kidna the same problem with Muramasa, their is a shit-load epic deeds attributed to them, and they are everything a Wazamono katana should be... but their is no single sword more famous than the others, with how the blade actually looks well known, a nickname attributed...   All of that is because few people in modern Japan know about Tomonari, (or Go-Yoshihiro, or Chogi or...), even fewer are those who know Hachimonji, but all of them know Masamune and Excallibur and such trivias without real lore.  ...  Westerners katana-bashing on YouTube can say whatever they want about european Swords being equel to Katana, but the truth is their is few to no surviving Swords from Medieval period, or Viking Swords... their are only sword corpses. In other words, Nihontô are Superior in lifespan, at the verry least.  If their are surviving european Swords, healthy, forged by a famous swordsmith and having a nickname, I would like to know. ",
            "date": "Answered July 30, 2015",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jun Orphancross",
                    "user_href": "/profile/Jun-Orphancross"
                },
                {
                    "user_id": "Denis Grammakov",
                    "user_href": "/profile/Denis-Grammakov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Dedrick",
                "href": "/profile/Joseph-Dedrick"
            },
            "answer_text": "Claymore(The Scottish Highlander two handed sword)  Katana(The sword made famous by the Japanese samurai)  Gladuis(The classic roman legionary short sword)   Excalibur(aka the sword of King Arthur)  This is just to name 4 there are plenty more out there. ",
            "date": "Answered January 5, 2015",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Evatt",
                    "user_href": "/profile/Samuel-Evatt"
                },
                {
                    "user_id": "Zach Sekaran",
                    "user_href": "/profile/Zach-Sekaran"
                },
                {
                    "user_id": "Victor Summers",
                    "user_href": "/profile/Victor-Summers-2"
                },
                {
                    "user_id": "Harsha Bhat",
                    "user_href": "/profile/Harsha-Bhat-5"
                }
            ]
        }
    ]
}