{
    "title": "Which are the most horrible weapons in WW2? - Quora",
    "tags": [
        "War History",
        "Weapons",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bolitho",
                "href": "/profile/John-Bolitho-1"
            },
            "answer_text": "Napalm. Inflammable, but it sticks to what is burning. The Americans used this against German bunkers and fortifications in the late stages of WW2, and against Japanese soldiers fighting on the Pacific Islands. Incendiary bombs. All the nations used them. The Germans managed to create a “firestorm” where the influx of fresh air sustains the fire, in London’s Docklands and in Coventry during the Blitz of 1940–41 (winter). The Allies returned the favour— first successfully in 1943, destroying the centre of Hamburg. But then to several other German cities (where the meteorological conditions were just right) culminating in Dresden in 1945— memorably narrated in Kurt Vonnegut’s Slaughterhouse Five (he was a POW in Dresden when it occurred). And on to Japan under USAAF Gen Curtis E LeMay, where the firebombing of Tokyo killed more people than the atomic bombing of Hiroshima. Bacteriological and chemical weapons. The Japanese used these against the Chinese, and tested them on POWs. The Germans used them against the Jews in, for example, the Warsaw Ghetto, and against several million civilians in the concentration camps. Mines. The German Teller mine would spring up and spray steel balls at groin height. Atomic weapons. The names Hiroshima and Nagasaki will be etched forever on the tombstone of Western Civilization. Regardless of the merits or demerits of the use of atomic weapons on Japan (debate still rages) the actual use of these weapons was horrible, and that they might be so used again remains our greatest nightmare. And these were small weapons in terms of explosive power (20 megatonnes of TNT equivalent), a fraction of modern weapons (anywhere from 1- 50 times more powerful, the largest “Tsar Bomba” a USSR test under Kruschev, was c. 1500 times more destructive). ",
            "date": "Answered June 10, 2018",
            "views": "316",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vian Cheung",
                    "user_href": "/profile/Vian-Cheung"
                },
                {
                    "user_id": "Nanang Sugianto",
                    "user_href": "/profile/Nanang-Sugianto-14"
                },
                {
                    "user_id": "Drew Jenner",
                    "user_href": "/profile/Drew-Jenner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Becker",
                "href": "/profile/Richard-Becker-19"
            },
            "answer_text": "While many people have had very good answers to this question... the most horrible and devastating weapons ever used in the Second World War was, obviously, the two atomic bombs used in August 1945. So devastating were these two bombs, each capable, even in its early developmental form, of essentially destroying a city, that they have never been used again in any subsequent conflict. Which is very fortunate as now even more powerful fusion bombs are available, which use atomic bombs similar in destructive power to the first ones to trigger an even more powerful thermonuclear explosion… even more devastating in its effects, as was proven in various tests by the nuclear powers, before such above ground testing was banned by treaty. ",
            "date": "Answered August 18, 2018",
            "views": "54",
            "upvotes": "0"
        }
    ]
}