{
    "title": "Which is the world's richest country and poorest country? - Quora",
    "tags": [
        "Poorest Countries in the World",
        "Richest Countries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deepak Khatri",
                "href": "/profile/Deepak-Khatri-56"
            },
            "answer_text": "Well, according to the IMF (International Monetary Fund) or Me also richest country in the year of 2017 is Luxembourg. How I will tell you see the thing is, In order to determine the richest countries in the world you must know first what is Gross Domestic Product of GDP per capita at nominal values. Now GDP is defined by production of goods and services by a particular Nation. Below here I am presenting the list of Richest and Poorest countries in 2017 Luxembourg ($101,994):- Luxembourg is a small European country, surrounded by Belgium, France and Germany. 2. Switzerland ($80, 674):- Switzerland is a mountainous Central European country, home to numerous lakes, villages and the high peaks of the Alps.  3. Qatar ($76, 576):- Qatar is a peninsula Arab country whose terrain comprises arid desert and a long Persian Gulf coastline of beaches and dunes.  4. Norway ($74, 825):- Norway is a beautiful Scandinavian country encompassing mountains, glaciers, and deep coastal fjords.Oslo is the capital city.  5. United States of America ($55, 805):- The Unites States of America is a country of 50 states covering a vast swath of North America with Alaska in the northwest and Hawaii extending the nation’s presence into the Pacific Ocean. 6. Singapore ($52, 880):- Singapore is an island city-state off southern Malaysia, it is a global financial center with a tropical climate and multicultural population. 7. Denmark ($52, 114):- Denmark is a Scandinavian country comprising the Jutland Peninsula and numerous islands. Copenhagen is the Capital city. 8. Ireland ($51, 350):- Ireland greatly occupies most the island of Ireland, off the coast of England and Wales. Dublin is the Capital city. 9. Australia ($50, 900):- 10. Iceland ($50, 850):- Iceland is a Nordic Island nation, which is popular in its dramatic landscape with volcanoes, geysers, hot springs and lava fields. Now. list of Poorest countries according to (World Economic Forum) Congo ($394):- Congo is a country located in Central Africa. It shares borders with the Central African Republic and South Sudan to the north; Uganda, Rwanda, Burundi and Tanzania to the east; Zambia to the south Angola to the southwest and the Republic of the Congo and the Atlantic Ocean to the west. 2. Zimbabwe ($589):- Zimbabwe is a landlocked country located in southern Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa, Botswana, Zambia and Mozambique. 3. Burundi ($648):- Burundi is also a landlocked country in the African Great Lakes region of East Africa, bordered by Rwanda to the north, Tanzania to the east and south, and the Congo to the west. 4. Liberia ($716):- Liberia, is a country on the West African coast. It is bordered by Sierra Leone to its west, Guinea to its north and Ivory Coast to its east. 5. Eritrea ($792):- Eritrea, is a country in the Horn of Africa, with its capital at Asmara. It is bordered by Sudan in the west, Ethiopia in the south, and Djibouti in the southeast. 6. Central African Republic ($827):- The central African Republic is a landlocked country in Central Africa. It is bordered by Chad to the north, Sudan to the northeast, South Sudan to the east, the Democratic Republic of the Congo to the south, the Republic of the Congo to the southwest and Cameroon to the west. 7. Niger ($853):- Niger is a landlocked country in Western Africa named after the Niger River. Niger is bordered by Libya to the northeast, Chad to the east, Nigeria and Benin to the south, Burkina Faso and Mali to the west, and Algeria to the northwest. 8. Malawi ($893):- Malawi is a landlocked country in southeast Africa that was formerly known as Nyasa land. It is bordered by Zambia to the northwest, Tanzania to the northeast, and Mozambique on the east, south and west. 9. Madagascar ($972):- Madagascar is an island country in the Indian Ocean, off the coast of East Africa. 10. Afghanistan ($1, 072):- Afghanistan is a landlocked country located in South Asia and Central Asia. So, Now I hope you got your answer properly. Thanks for giving the time. ",
            "date": "Answered January 3, 2018",
            "views": "114",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allan Kay",
                    "user_href": "/profile/Allan-Kay-8"
                },
                {
                    "user_id": "Aaron Ramsey",
                    "user_href": "/profile/Aaron-Ramsey-101"
                },
                {
                    "user_id": "Kofi Chandler",
                    "user_href": "/profile/Kofi-Chandler"
                },
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                },
                {
                    "user_id": "Kodi Arasan",
                    "user_href": "/profile/Kodi-Arasan"
                },
                {
                    "user_id": "Thomas Reipa",
                    "user_href": "/profile/Thomas-Reipa"
                },
                {
                    "user_id": "Dwight Gray",
                    "user_href": "/profile/Dwight-Gray-3"
                },
                {
                    "user_id": "Peter Dalas",
                    "user_href": "/profile/Peter-Dalas"
                },
                {
                    "user_id": "Imani Martin",
                    "user_href": "/profile/Imani-Martin-9"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-617"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amol Sadawarti",
                "href": "/profile/Amol-Sadawarti-1"
            },
            "answer_text": "Top 10 List of Richest Countries In The World 2017 The richest countries in the world can measured by GDP (Gross Domestic Product). The developed countries GDP is comparatively greater than the developing countries Per capital income is greater than developing once and because of that the economy of the country became stronger. Usually the countries who has reserves like oil, gas and energy they considered as the richest countries in the world. The richest countries are fully developed and the citizens of that country could enjoy the high standards of living like basic needs of life human rights, health, food, education, clean water, transport facilities, infrastructure, and equalities political atmosphere should be good as well. The richest countries their Tourism industry is fully developed and a country have beautiful destination which attracts visitors around the globe it can play very important role in rise of the economy of that country. Here is the list of the top richest countries in the world 2017 measured by GDP rate of the country. 10. San Marino -GDP per capita $64,443 San Marino is one of the wealthiest country in the world with the GDP (per capita) of $64,443 in Europe its economy is considered as the most stable economy and with low tax rates and low rate of unemployment. It is fully developed country world witnessed its infrastructure and use of modern technology it is only country with more vehicle then people. The economy of the country depends on its finance sector, banking field, industrial zone and tourism sector. San Marino has the world’s first democratic government and it is the fifth smallest country in the world with rich economy. 9. United Arab Emirates -GDP per capita $67,696 United Arab Emirates when the whole world wanted to visit a beautiful richest country it should be Dubai the infrastructure of Dubai is so powerful and modern that no one could ever miss the chance to visit it. It shows the strong tourism impact on the whole world, its economy reliant on its big oil and gas resources which makes Dubai the richest country in the world with the GDP of $67,696. Employment rate is very high anyone can find easy job opportunities here Dubai has the record holder of world’s tallest building Burj khalifa with 828m. Dubai is on the richest countries list and it well deserves one. 8. Norway -GDP per capita $69,296 The nation is called Nordic nation with the per capita income of $69,296 it is a Scandinavian country with high mountains, deep coastal lines, glaciers and beautiful landscape. Norway has been an emerging economy and now with the best growth in GDP and developed its economy with capital reserves, assets, oil and gas reserves, development in technology and human index, highly living standards with big employment opportunities and industrial sector is become the part of richest countries in the world. It is the stable and well organized country with wooden houses which seek the attention of the people and they surely wanted to visit it once in lifetime. 7. Ireland -GDP per capita $69,374 The economist said Ireland has the best quality of life and it is among the richest countries in the world measured by its GDP of $69,374 with the population of almost 5 million people. The human lives in this country could enjoy the luxuries of high standard living the economy of Ireland is highly depends on the trade industry, textiles, mining, food production and banking sector. It is the country of high technology and innovations in new products due to growth in every sector it is called as Celtic tiger. It is the hub of tourism and this sector help the economy of Ireland toward the highest ranking. 6. Kuwait-GDP per capita $71,263 Kuwait is an Arab country it has the strongest economy with all relied on petroleum reserves it has the sixth largest oil and petroleum reserves. The GDP of Kuwait $71,263, and the economy is based on other industries like shipping, oil industries, water desolation and banking Kuwaiti dinar is the highest current valued currency in the world. Kuwait has the largest human development index it is one of the best employment provider country in the world and people move here with heavy cost just to find out the luxuries and secured future. Kuwait city is one of the eye candy destinations of the world just because of its beautiful buildings and eye catching resorts. 5. Brunei -GDP per capita $79,710 In south East Asian a very small but the richest country is Brunei with the GDP of $79,710 the country is large exporter of natural gas and also its economy is accounted by crude oil and natural gas production. The distinctive pieces of land are cause of attraction for the tourists and Brunei is blessed with natural and beautiful destination. It has developed infrastructure and highly developed human index with low tax rates and high employment opportunities in the world like all other countries who has oil and gas reserves Brunei government also lead their economy toward the strongest economies in the world. 4. Singapore -GDP per capita $87,082 In southern Malaysia Singapore is an Iceland state .The country has GDP about $87,082 it has the highest per capita income with low tax rates and its economy is known as the most business friendly, freest, and strongest. It is one of the least corrupt country and very developed in Technology and innovation of new products it has also multicultural nation and highly developed trade market which helps its economy towards boost. Its finest destination attracts the tourists to visit Singapore places like woodland, central area, or Tengeh Reservoir. Singapore wealth is depends on chemical export industry, tourism, and banking sector. 3. Macao -GDP per capita $96,147 Macao is another on the list of richest countries of the world it has the richest economy in term of GDP of $96,147 and its strong economy depends on gambling and tourism people admire this country because of the dream destinations and strong infrastructure. Macao is the only territory where gambling is legal in china region. The swelling numbers of tourist and center of china gamblers helped Macao to rose its GDP and became among the highest ranked richest in the world. Macao is a developed country with a very low rate of unemployment it is one of the Asian regions which has the highest human development index. 2. Luxembourg -GDP per capita: $101,936 Luxembourg is a small country this nation is the world’s second investment fund center with the GDP of $101,936 with is nine times the world average it’s a developed country with various industries like rubber, chemicals, and other industries, mostly rural with natural parks and surrounded by Germany, France, and Belgium. Unemployment rate is low here and quality of living with all essential needs is very high. It has stable economy which is depend on banking sector, steel industry. Luxembourg is favorite place for tourist as well because of its capital Luxembourg City which has great destination with old culture like Esch-sur-Alzette, Esch-sur-Sûre and many. Luxembourg is a symbol of wealth and world richest countries. 1. Qatar -GDP per capita: $129726 Qatar is an Arab country and ranked top of the richest countries, the GDP of Qatar is $129,726 highest per capita income in the whole world. It is a developed country with industries like Urea, Steel plants, ammonia fertilizers the state of Qatar is rich with natural resources like gas reserves and oil reserves which plays the major part in the rise of its economy with employment opportunities for foreigners as well. Because of its economic growth and wealth Qatar has been chosen to host the FIFA 2022 and will became the first ARAB nation to have this Opportunity and hold this record as well. Just test table Rank Country GDP per capita Qatar GDP per capita: $1297262. Luxembourg GDP per capita: $101936 3. Macao GDP per capita $96147 4. Singapore GDP per capita $87082 5. Brunei GDP per capita $79710 6. Kuwait GDP per capita $71263 7. Ireland GDP per capita $69374 8. Norway GDP per capita $69296 9. United Arab Emirates GDP per capita $67696 10. San Marino GDP per capita $64443 ",
            "date": "Answered July 7, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Huzaifa Sims",
                    "user_href": "/profile/Huzaifa-Sims"
                },
                {
                    "user_id": "Martin Andrews",
                    "user_href": "/profile/Martin-Andrews-21"
                },
                {
                    "user_id": "Alan John",
                    "user_href": "/profile/Alan-John-33"
                }
            ]
        }
    ]
}