{
    "title": "Which disease is known as the Black Death? - Quora",
    "tags": [
        "Plagues",
        "Bubonic Plague",
        "Death and Dying",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chiranjeet Laha",
                "href": "/profile/Chiranjeet-Laha"
            },
            "answer_text": "The Black Death was a devastating global epidemic of bubonic plague that struck Europe and Asia in the mid-1300s. The plague arrived in Europe in October 1347, when 12 ships from the Black Sea docked at the Sicilian port of Messina. People gathered on the docks were met with a horrifying surprise: Most sailors aboard the ships were dead, and those still alive were gravely ill and covered in black boils that oozed blood and pus. Sicilian authorities hastily ordered the fleet of “death ships” out of the harbor, but it was too late: Over the next five years, the Black Death would kill more than 20 million people in Europe—almost one-third of the continent’s population. Today, scientists understand that the Black Death, now known as the plague, is spread by a bacillus called Yersina pestis. (The French biologist Alexandre Yersin discovered this germ at the end of the 19th century.) They know that the bacillus travels from person to person through the air, as well as through the bite of infected fleas and rats. Both of these pests could be found almost everywhere in medieval Europe, but they were particularly at home aboard ships of all kinds—which is how the deadly plague made its way through one European port city after another. ",
            "date": "Answered September 8, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aletti Canessio",
                "href": "/profile/Aletti-Canessio"
            },
            "answer_text": "It's a nickname given to the Great Plague that hit in the decade 1340-1350. The disease didn't grow in Europe, but probably in east Asia. It reached Europe through commercial routes and used rats and fleas as principal means of infection throughout the human population. The epidemic took one of the greatest death tools ever, wiping out well over 40% of Europe's 14th century population and a total that oscillate between 75 and an unbelievable 200 million people. ",
            "date": "Answered September 9, 2019",
            "views": "27",
            "upvotes": "0"
        }
    ]
}