{
    "title": "Which is better in your opinion: Aristotle or Plato? - Quora",
    "tags": [
        "The Republic (Plato)",
        "Greek Philosophy",
        "Socrates",
        "History of Philosophy",
        "Aristotle",
        "Plato",
        "Philosophers",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Curtis Adler",
                "href": "/profile/Anthony-Curtis-Adler"
            },
            "answer_text": "It is difficult, and perhaps even somewhat pointless, to compare Plato and Aristotle as philosophers, since what we know of them is limited by the works of theirs which have survived: Aristotle’s popular writings have been destroyed: what remains are for the most part his “lecture notes”: dense and sometimes cryptic writings almost lacking stylistic flair. By contrast, we have little idea of how Plato conducted his school, how he was as a teacher. Instead, we have his dialogues — strange hybrids occupying a grey-zone between tragic poetry and scientific discourse, and (as Nietzsche brilliantly noted) as much the forerunner of the novel as of positive scientific discouse. These dialogues are brilliant dramatic works in their own right — but, especially if we take these in as a whole, it is never clear what Plato’s own philosophical position is… Of course, there is his theory of the forms (ideas), which Aristotle, himself Plato’s student, understands as the essential doctrine of his master. Yet we don’t know how Plato’s believed in ideas — or, better, how he understood the relation of philosophical discourse itself to a doctrine that, in a certain way, exceeded the limits of discourse. And moreover, there is every indication that Plato himself subjects the doctrine of the forms, at least as presented in his middle period, to great scrutiny, and also transforms his understanding of politics. With Aristotle, by contrast, we don’t always understand what he is saying — his language is often far more demanding, precice, challenging than Plato’s. But we know how he is saying it: namely as a “scientific” theory, discourse. Indeed, Aristotle’s entire project is predicated on the conviction that langauge can disclose reality the way it is, so long as we attend carefully to the ambiguities and multiple valences of the words that we use. ",
            "date": "Answered April 5, 2019",
            "views": "41",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Sikandar Ali",
                    "user_href": "/profile/Sikandar-Ali-400"
                },
                {
                    "user_id": "Christopher Dumas",
                    "user_href": "/profile/Christopher-Dumas"
                },
                {
                    "user_id": "James Bancroft",
                    "user_href": "/profile/James-Bancroft-7"
                },
                {
                    "user_id": "Joseph David",
                    "user_href": "/profile/Joseph-David-69"
                },
                {
                    "user_id": "Nitesh Kumar",
                    "user_href": "/profile/Nitesh-Kumar-4972"
                },
                {
                    "user_id": "Matt Perryman",
                    "user_href": "/profile/Matt-Perryman"
                },
                {
                    "user_id": "Leon Tan",
                    "user_href": "/profile/Leon-Tan-5"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Philip Wik",
                    "user_href": "/profile/Philip-Wik-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "For myself, I do not think that one should be preferred over the other, and that is because both philosophers are part of a long sequence of contributors in philosophy. So it may not be entirely reasonable or practical to think that one can be preferred over the other. I have long considered whether it is fact that Aristotle should be credited with everything he wrote about logic and nature, if the assumption is that he created the whole of it. I think that Aristotle was able to build upon the contributions of many philosophers. What is known is that Aristotle’s writings have come down to us and we can credit Aristotle for having written about this knowledge. Similarly, Plato wrote about the dialogues of Socrates and I think it might be impractical to try to establish one as preferential over the other. The singular fact is, that the philosophers worked out the basic architecture of mind and thought. Aristotle can be regarded as the Greek recipient of all the knowledge that had been published before. Aristotle was able to organize much of that and to give it a final formulation. We now benefit from that final formulation. When I see the name Aristotle I regard him as the culmination and apex of all the Greek Philosophers and probably also as a person familiar with much of the philosophy in the world known to him at that time. Consider also if you enumerate great minds in Greece: Anaxagoras c.500–c.428 bc (This is the philosopher who “dropped a bomb” on everyone with his proposal for Mind (Nous). Eratosthenes 276 BC – c. 195/194 BC Who measured the earth accurately Granted, some things are known about them and what they wrote; but it would be a mistake to think we know all about them or have everything that they wrote or compiled or taught. ",
            "date": "Updated March 28, 2020",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakshi Shree",
                    "user_href": "/profile/Sakshi-Shree-6"
                },
                {
                    "user_id": "Sikandar Ali",
                    "user_href": "/profile/Sikandar-Ali-400"
                },
                {
                    "user_id": "Ramon Gonzales",
                    "user_href": "/profile/Ramon-Gonzales-45"
                },
                {
                    "user_id": "Anubhav Balodhi",
                    "user_href": "/profile/Anubhav-Balodhi"
                },
                {
                    "user_id": "Afifa Sarwar",
                    "user_href": "/profile/Afifa-Sarwar"
                }
            ]
        }
    ]
}