{
    "title": "Which civilisation was the first to use a currency? - Quora",
    "tags": [
        "Civilization",
        "Currencies",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Seamus Williams",
                "href": "/profile/Seamus-Williams-2"
            },
            "answer_text": "The History of Money Talking about the history of money may seem like a strange concept. Hasn’t money been around for most of human history? Isn’t money just a way to pay for something? Is there really much of a history behind money? Money is actually a general term for a concept that has changed throughout history and is still changing today. The history of money has played critical roles throughout many other parts of history and it’s not going away anytime soon. Without further ado, let’s talk about where money came from and where it’s going today. - The beginnings of civilization and the barter system Money is as old as human civilization itself. The first “money” was discovered in Anatolia – the birthplace of human civilization. That money was obsidian, and it was extremely valuable due to its use in crafting high-quality tools. Between 12,000 and 9,000 B.C., early civilizations used a number of different valuable items as early forms of money. Along with obsidian, for example, early civilizations were known to use cattle as a bartering tool. Of course, trading obsidian and cattle is more of a bartering system than an actual currency. But money is a general term for any object that is accepted as payment for goods and services. Today, most of our money is currency. But if you paid the pizza delivery guy using seashells, then those seashells would be considered money as well (and the delivery guy would probably be really sad). -     The main difference between the early history of money and today’s money is that early money had multiple uses. You could use cattle and obsidian as a form of wealth storage and you could use it to pay for things. You could also use both cattle and obsidian for more practical purposes. If you ever needed to eat, for example, then you could slaughter your cow. If you needed tools, you could use your obsidian. Today’s money is totally inedible and cannot be crafted into very many usable tools. As you may have realized, these types of money transactions are limited by one major flaw: there needs to be a “coincidence of wants”. What if someone doesn’t need cattle or obsidian? How are you going to pay that person? This is not an ideal system. Ultimately, in ancient times, the things with the greatest utility were accepted as the best forms of money. Most people in early civilizations could find a good use for a cow, for example, which is why they were happy to accept a cow as payment. - Ancient Babylon sets the first rules governing money The Code of Hammurabi is the best preserved set of legal principles from the ancient world. Along with telling us about the laws and punishments of ancient Babylon, it tells us how they viewed money and market transactions. Hammurabi’s Code set a number of money-related principles that would form the basis for the currency of future civilizations. Those rules included: Set interest rates for debtFines for wrongdoingCompensation for victims of criminal activityLegal contracts regarding business practices and private propertyOver time, these practices came to be accepted throughout Babylon and the rest of Mesopotamia. However, nobody had yet created a common currency system. Money exchanges were usually performed with gold bars or silver bars. The value of a metal bar was assessed based on its weight. While Babylon lacked a common currency, they did create something called the shekel, which was a defined amount of weight for different materials. You might be asked to pay a shekel of barley as a fine, for example, or a shekel of gold. - Who made the first currency? Early Chinese civilizations were the first to use standardized currency. As early as 1,000 B.C., the Chinese were creating miniature knives and spades that had a symbolic value instead of a practical value. A few centuries later, civilizations in China, India, and the Aegean region all started developing coins as currency. Coins were different depending on where they were made. Chinese coins, for example, had a small hole in the middle that allowed them to be conveniently strung together. Greek coins, on the other hand, were branded with insignia. During this period – between 700 B.C. and 500 B.C. – many coins were made from electrum. Electrum is a naturally-occurring alloy of gold and silver. The only major group known to use gold coins at this time were the Lydian merchants. The Kingdom of Lydia was located in modern-day Turkey and holds the title of the first known civilization to use gold coins. Why would people make coins out of metal instead of other materials? The first major reason is that metal coins carried some inherent value. They could be melted down and used to make weapons, tools, armor, and other practical things, for example. Just like the cattle and obsidian ore used in years past, metal coins carried practical value along with their official stamped value from various nations. -Johnson Hur - Coins and Currency In 600 B.C., Lydia's King Alyattes minted the first official currency. The coins were made from electrum, a mixture of silver and gold that occurs naturally, and stamped with pictures that acted as denominations. In the streets of Sardis, circa 600 B.C., a clay jar might cost you two owls and a snake. Lydia's currency helped the country increase both its internal and external trade, making it one of the richest empires in Asia Minor. It is interesting that when someone says, \"as rich as Croesus\", they are referring to the last Lydian king who minted the first gold coin. Unfortunately, minting the first coins and developing a strong trading economy couldn't protect Lydia from the swords of the Persian army. (To read more about gold, see What Is Wrong With Gold?) - Not Just a Piece of Paper Just when it looked like Lydia was taking the lead in currency developments, in 600 B.C., the Chinese moved from coins to paper money. By the time Marco Polo visited in 1,200 A.D., the emperor had a good handle on both money supply and various denominations. In the place of where the American bills say, \"In God We Trust,\" the Chinese inscription warned, \"All counterfeiters will be decapitated.\" Europeans were still using coins all the way up to 1,600, helped along by acquisitions of precious metals from colonies to keep minting more and more cash. Eventually, the banks started using bank notes for depositors and borrowers to carry around instead of coins. These notes could be taken to the bank at any time and exchanged for their face values in silver or gold coins. This paper money could be used to buy goods and operated much like currency today, but it was issued by banks and private institutions, not the government, which is now responsible for issuing currency in most countries. The first paper currency issued by European governments was actually issued by colonial governments in North America. Because shipments between Europe and the colonies took so long, the colonists often ran out of cash as operations expanded. Instead of going back to a barter system, the colonial governments used IOUs that traded as a currency. The first instance was in Canada, then a French colony. In 1685, soldiers were issued playing cards denominated and signed by the governor to use as cash instead of coins from France. - Money Travels The shift to paper money in Europe increased the amount of international trade that could occur. Banks and the ruling classes started buying currencies from other nations and created the first currency market. The stability of a particular monarchy or government affected the value of the country's currency and the ability for that country to trade on an increasingly international market. The competition between countries often led to currency wars, where competing countries would try to affect the value of the competitor's currency by driving it up and making the enemy's goods too expensive, by driving it down and reducing the enemy's buying power (and ability to pay for a war), or by eliminating the currency completely. - Mobile Payments The 21st century gave rise to two disruptive forms of currency: Mobile payments and virtual currency. A mobile payment is money rendered for a product or service through a portable electronic device such as a cell phone, smartphone or PDA. Mobile payment technology can also be used to send money to friends or family members. Increasingly, services like Apple Pay and Samsung Pay are vying for retailers to accept their platforms for point-of-sale payments. - Virtual Currency Bitcoin​, invented in 2009 by the pseudonymous Satoshi Nakamoto, became the gold standard--so to speak--for virtual currencies. Virtual currencies have no physical coinage. The appeal of virtual currency is it offers the promise of lower transaction fees than traditional online payment mechanisms and is operated by a decentralized authority, unlike government issued currencies. - The Bottom Line Despite many advances, money still has a very real and permanent effect on how we do business today. (Follow the development of money in the United States in The History Of Money: Currency Wars.) By Andrew Beattie Updated Dec 29, 2015 ",
            "date": "Answered January 11, 2019",
            "views": "173",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill William",
                    "user_href": "/profile/Bill-William-30"
                },
                {
                    "user_id": "Alan Smith",
                    "user_href": "/profile/Alan-Smith-1077"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Benveniste",
                "href": "/profile/Michael-Benveniste-1"
            },
            "answer_text": "It depends on your definition of currency, and even then it may not be possible to establish the first civilization. The use of grain and cattle as a medium of exchange likely dates to 9000 B.C. or earlier.Standardized units of precious metal (coins) may have been invented first by the Lydians, on the isle of Aegina, on Crete, by the Mahajanapadas of the Indian subcontinent, or in Anyang. Different people have different opinions.The first paper money was almost certainly used in China. That said, even before 1000 B.C. people deposited gold with the temples of Babylonia and received clay tablets as receipts. It’s likely that these tablets were used in trade; if so, they might have been a primitive form of currency.",
            "date": "Answered October 10, 2019",
            "views": "58",
            "upvotes": " Answer requested by Alan Smith"
        }
    ]
}