{
    "title": "Which are Ukraine's most historical monuments? - Quora",
    "tags": [
        "Historical Monuments",
        "Historic Preservation",
        "Monuments",
        "Russia–Ukraine Conflict (2014–present)",
        "Ukraine",
        "Architecture",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gurnoor Kaur",
                "href": "/profile/Gurnoor-Kaur-263"
            },
            "answer_text": "Saint Sophia Cathedral and Kiev Pechersk Lavra (1990)wo separate, but adjacent complexes, Saint Sophia Cathedral and Kiev Pechersk Lavra have both had an important influence in Eastern Orthodox Christianity. These two religious sites, in a sense, were the epicenter of the Eastern Orthodox faith as it spread throughout the Russian world from the 17th to the 19th centuries.n recognition of their historical significance, they were jointly named as a World Heritage Cultural Site in 1990. Additionally, they have been named (as separate entities), to Ukraine’s Seven Wonders list.  Lviv Historic Centre Ensemble (Lviv’s Old Town) (1998)Dating back to the late middle ages, Lviv was a flourishing administrative, religious and commercial center, attaining cultural and architectural influence from around Europe. Today, many of the Old Town’s buildings are virtually intact, giving visitors a fascinating glimpse into the past. Struve Geodetic Arc (2005)A chain of survey triangulations stretching from Hammerfest in Norway to the Black Sea, through 10 countries and over 2,820 km (1,752 miles).The 1816 to 1855 survey by von Struve sought to establish the exact size and shape of the earth. Sofiyivsky ParkLocated in Uman, Cherkasy Oblast, Sofiyivsky Park is one of the most famous examples of late 18th / early 19th century European landscape garden design to be preserved to the present time. Kiev Pechersk Lavra (Monastery of the Caves)Founded as a cave monastery in 1015, the Kiev Pechersk Lavra is considered one of the most sacred places in Eastern Orthodox Christianity.Spread over a large territory, the complex is composed of the Upper (Near Caves) and Lower (Far Caves) Lavra territories. Within these territories are numerous architectural monuments, ranging from bell towers and cathedrals to underground cave systems and stone fortification walls. Most notable is the Great Lavra Bell Tower (seen on Kiev’s skyline), and the Dormition Cathedral, which was recently reconstructed after being destroyed in World War II. Kamyanets-Podilsky Historical ComplexLocated in Khmelnytsky Oblast, Kamyanets-Podilsky city center is a testament to numerous nationalities who introduced their personal architecture and culture over the centuries. Sites include Polish, Ukrainian and Armenian markets, an ancient castle, historical homes, buildings, cathedrals and fortifications. Hope you liked them 👆, please upvote if it helped.. 😊 ",
            "date": "Updated October 26, 2020",
            "views": "145",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Janssen",
                    "user_href": "/profile/David-Janssen-6"
                },
                {
                    "user_id": "Anton Danylchenko",
                    "user_href": "/profile/Anton-Danylchenko-1"
                },
                {
                    "user_id": "Symon Jemčenko",
                    "user_href": "/profile/Symon-Jemčenko"
                },
                {
                    "user_id": "Kanhaiya Soni",
                    "user_href": "/profile/Kanhaiya-Soni-32"
                }
            ]
        }
    ]
}