{
    "title": "Which families in the US are considered political dynasties, and why? - Quora",
    "tags": [
        "Political Families",
        "Political History of the United States of America",
        "History of the United States of America",
        "Politics",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Bossman",
                "href": "/profile/Matt-Bossman"
            },
            "answer_text": "There have been/are several, to name a few: Roosevelts – Teddy and FDR (distant cousins) have been Presidents, two of FDR’s sons have been elected to Congress.Kennedys – JFK and RFK both held high government positions, Edward (Teddy) was a long time Senator. Patrick (Teddy’s son) was a RI congressman.Clintons – This one is probably a little premature as the politicians have been limited to one generation (Bill – president; Hillary as Senator, Secretary of State and Democratic presidential nominee).Bushes – Father and son have been presidents. Grandfather (Prescott) was a senator. Son/brother (Jeb) was governor of Florida and ran for the Republican presidential nomination.Cuomos – father and son have been governors of New York.Daleys – father and son both have been mayors of Chicago",
            "date": "Answered October 10, 2019",
            "views": "93",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                },
                {
                    "user_id": "Mark Binfield",
                    "user_href": "/profile/Mark-Binfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francisco Campos",
                "href": "/profile/Francisco-Campos-38"
            },
            "answer_text": "We don’t have political dynasties. There have been incidents when father and son have served as well as a few that involved additional family members. But nothing that remotely could be equated with dynastic rule. ",
            "date": "Answered October 10, 2019",
            "views": "10",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                }
            ]
        }
    ]
}