{
    "title": "Which one is the greatest invention from China? - Quora",
    "tags": [
        "History of China",
        "Innovation",
        "Invention and Inventions",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lai Jin Wei",
                "href": "/profile/Lai-Jin-Wei"
            },
            "answer_text": "The Chinese had many great inventions. Just mentioning one will not be enough, so I will mention all the inventions in which without it we will not live in the world we know of today. In this answer, I will mention the most important Chinese inventions that most people do not know we invented. Guns Though guns are frequently regarded to be a western invention, they actually originated from the eastern civilization of China. During the Song Dynasty an unknown man managed to make a smaller version of the cannon and create the first firearm. Today, in every war, you will find the gun. 2. Porcelain  Porcelain. A glass-like material used to make dishes, vases, cups etc in China. During the Han dynasty, the first porcelain grew to become the materials for great works of art and also for cups, teapots, plates, vases, and more. In most of history, demand for Chinese porcelain had always being high. It was, and still is, one of the most profitable things the Chinese empire has every created, with thousands of wealth entering China from the ancient days for the humble porcelain. China was so famous for it’s porcelain that porcelain had a nickname called China. 3. Mechanical Clock  During Tang Dynasty, the first mechanical clock was created, which is the ancestor of the digital clock that wakes you up every morning. The first mechanical clock was operated by water in the warmer months, and liquid mercury in winter. The water turns a series of cogs and mechanisms which operates the clock, though it doesn't count as a water clock as the water does not tell the time. 4. Alcohol  Though the invention of alcohol is frequently attributed to Arabs, a discovery in 2013 of pottery containing traces of alcohol from 9000 years ago passed the title of the first alcohol brewers from the Arabs, to the Chinese, who discovered this 1000 years earlier than them. Today, this drink is extremely popular in the modern society, perhaps too popular. 5. Rockets  Many people, especially westerners, do not know that the rockets, the invention that took us to the moon and beyond, came from Song Dynasty China, one thousand years ago. Though it was used as a weapon, this invention became one of the things that the west used to assert it’s dominance over science and technology in modern times. But this invention was not western at all, it came one thousand years ago from far off China. 6. Toothbrush  The toothbrush. The object that helps keep our teeth shining white and stop them from falling out. This invention originated in Ming Dynasty, it was bought to the west via the silk road and form then on has been keeping the world with shining white teeth. 7. Banknote  The banknote, the thing we use to pay for our items we buy. This originated from Tang Dynasty China, from then on, the whole world has been printing them over the centuries. There are countless inventions the Chinese made, and they all helped shape the world. ",
            "date": "Answered August 8, 2018",
            "views": "129",
            "upvotes": " View 119 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amadeus Low",
                    "user_href": "/profile/Amadeus-Low"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Jack Mathew",
                    "user_href": "/profile/Jack-Mathew-30"
                },
                {
                    "user_id": "Masami Iwashiro",
                    "user_href": "/profile/Masami-Iwashiro"
                },
                {
                    "user_id": "Ivón Lopez",
                    "user_href": "/profile/Ivón-Lopez"
                },
                {
                    "user_id": "Levin Liu",
                    "user_href": "/profile/Levin-Liu"
                },
                {
                    "user_id": "Michael Hansen",
                    "user_href": "/profile/Michael-Hansen-4"
                },
                {
                    "user_id": "Kevin Chen",
                    "user_href": "/profile/Kevin-Chen-1164"
                },
                {
                    "user_id": "Cho Tze Yun",
                    "user_href": "/profile/Cho-Tze-Yun"
                },
                {
                    "user_id": "ZZ ZH",
                    "user_href": "/profile/ZZ-ZH-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zheng Zhang",
                "href": "/profile/Zheng-Zhang-55"
            },
            "answer_text": "Have you had such an experience before: When feeling an itch on the back, you could not help but give it some scratches using your hands. However, very soon, you found your arms so overstretched and muscles so sore that you had to let go of it. A few seconds later, the itches came back there undoing all your past efforts and continuing to grate on your nerves.  In this emergent situation, as an independent, self-esteemed and elegant man/woman, you do not wish to be “helped” by other people, even your most intimate ones because you feel shy or awkward. So what should I do!!!!!!  Don’t have kittens! Here comes a great gadget Chinese ancestors invented thousands of years ago, one of the greatest inventions in human history. i.e. 不求人 （No Begging）痒痒挠 (backscratcher) ……. or in ancient China 爪杖 （Claw Cane)   Quote from Wikipedia: Backscratchers were also observed to have developed separately in many other areas, such as ancient China, where Chinese farmers occasionally used backscratchers as a tool to check livestock for fleas and ticks. However, in recent history it was unquestionably also employed as a kind of rake to keep in order the huge \"heads\" of powdered hair worn by ladies in the 18th and 19th centuries. In the past, backscratchers were often highly decorated, and hung from the waist as accessories, with the more elaborate examples being silver-mounted, or in rare instances with an ivory carved hand with rings on its fingers. The scratching hand was sometimes replaced by a rake or a bird's talon. Generally, the hand could represent either a left or right hand, but the Chinese variety usually bore a right hand  They come in different materials and shapes today. But I believe Chinese can take the credit for having independently made this invention! Reference Backscratcher - Wikipedia ",
            "date": "Updated August 11, 2018",
            "views": "63",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Meng",
                    "user_href": "/profile/Jason-Meng-6"
                },
                {
                    "user_id": "James Munn",
                    "user_href": "/profile/James-Munn-14"
                },
                {
                    "user_id": "Run Ze Cao",
                    "user_href": "/profile/Run-Ze-Cao-2"
                },
                {
                    "user_id": "Han Wu",
                    "user_href": "/profile/Han-Wu-95"
                },
                {
                    "user_id": "Yin Cao",
                    "user_href": "/profile/Yin-Cao-4"
                },
                {
                    "user_id": "X Chin",
                    "user_href": "/profile/X-Chin-2"
                },
                {
                    "user_id": "Chee Hwee Tan",
                    "user_href": "/profile/Chee-Hwee-Tan-2"
                },
                {
                    "user_id": "J Don",
                    "user_href": "/profile/J-Don-5"
                },
                {
                    "user_id": "Hao Wu",
                    "user_href": "/profile/Hao-Wu-318"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                }
            ]
        }
    ]
}