{
    "title": "Which 19th century book is considered greatest one? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Gareth Shamrock",
                "href": "/profile/Gareth-Shamrock"
            },
            "answer_text": "Middlemarch, Moby-Dick, Madame Bovary and the works of Tolstoy are all strong contenders, but I fully agree with Harold Bloom when he says: “At its most flourishing, in the Democratic Age, the novel’s masters were astonishingly numerous: Austen, Scott, Dickens, Eliot, Stendhal, Hugo, Balzac, Manzoni, Tolstoy, Turgenev, Goncharov, Dostoevsky, Zola, Flaubert, Hawthorne, Melville, James, Hardy, with an epilogue in Conrad... But no nineteenth-century novelist, not even Tolstoy, was stronger than Dickens, whose wealth of invention almost rivals Chaucer and Shakespeare. Bleak House, most critics now tend to agree, is his central work; Dickens had enormous affection for David Copperfield, but this was his Portrait of the Artist as a Young Man. The Dickens cosmos, his phantasmagoric London and visionary England, emerges in Bleak House with a clarity and pungency that surpasses the rest of his work, before and after. No other novel in English invents so much, though perhaps more in the mode of Ben Jonson than of Shakespeare.” Edit: Harold Bloom also agreed, however, that Balzac, Dostoyevsky and Victor Hugo had something at least of Dickens’ breadth in them. So I’d like to make mention of another strong contender: Les Misérables, one of the longest novels in Western literature. In David Bellos’ book “The Novel of the Century: The Extraordinary Adventure of Les Misérables”, the notion posited by the title that “Les Misérables” is the novel of the (19th) century is given a thoroughly good airing. Not least because it proved to have such a considerable impact on French society: Bellos underscores four policy prescriptions the book proposes that have since been adopted by French governments of all political persuasions over the last 150 years. These include allowing convicts to re-enter society without a perpetual black mark against their names (or in the case of Valjean, abolishing the “yellow passport” that makes it difficult for him to find food, lodging and work); amending the penal code to recognize crimes of necessity, so that (for instance) poor people who steal bread to feed their starving children won’t be sentenced to hard labor; creating more employment for the uneducated; and building schools for the poor while making elementary education “universal and obligatory.” Above excerpt from Tobias Greymarch’s review ",
            "date": "Updated January 10, 2019",
            "views": "446",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Smrity Sharma",
                    "user_href": "/profile/Smrity-Sharma-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John C Hoppe",
                "href": "/profile/John-C-Hoppe"
            },
            "answer_text": "There were so very many superb literary works in the 19th century in Europe and the US that it is virtually impossible to give an adequate answer short of a book length survey. It would help if your question was more specific. What are you looking for? Poetry? Novels? History? Political science? Philosophy? Theology? Biography? Travelogue? Personally, I’d suggest Tolstoy (War and Peace, Anna Karenina), Dostoyevsky (Brothers Karamazov, Crime and Punishment); Goethe (Faust); Schopenhauer (World as Will and Idea); Nietzsche (Zarathustra, Beyond Good and Evil); de Tocqueville (Democracy in America); Melville (Moby Dick); Darwin (Origin of Species, Descent of Man); Marx (Das Kapital); Balzac (Comédie humaine); Dickens (almost anything, Oliver Twist, Bleak House); George Eliot (Middlemarch, Great Expectations); Fontane (Effie Brest); Stifter ( Nachsommer); Emerson (Essays); Thoreau (Walden); Mark Twain (Huckleberry Finn, Life on the Mississippi); Claude Bernard (Introduction to the Experimental Study of Medicine); James (Psychology); Mommsen (Roman History); Parkman (Oregon Trail); Harriet Beecher Stowe (Uncle Tom’s Cabin); Kierkegaard (Fear and Trembling); Schleiermacher (On Religion); Poets: Wordsworth, Keats, Byron, Hölderlin, Browning, Baudelaire, Rimbaud, Verlaine, Hugo, Heine, Pushkin, Whitman, Emily Dickinson, et cetera, et cetera. ",
            "date": "Answered May 20, 2018",
            "views": "795",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sweta Vijayan",
                    "user_href": "/profile/Sweta-Vijayan"
                },
                {
                    "user_id": "David Chevance",
                    "user_href": "/profile/David-Chevance"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Sarthis Idren",
                    "user_href": "/profile/Sarthis-Idren"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Weiss",
                "href": "/profile/Paul-Weiss-22"
            },
            "answer_text": "“Best ever” is a tall order. I’m just gonna aim for “generally accepted as good”. And I’m also going to assume we’re talking about English fiction; otherwise we’ll be here forever. Nineteenth century literature is fascinating, partly due to the social, scientific, and intellectual developments that took place during this period: the suffrage movement, Darwin’s theory of natural selection, a fair chunk of the Industrial Revolution, Freud’s psychoanalytic theories… it must have been an exciting time to be a writer. It’s easy enough to find a good selection of writers from this era. A quick google search will yield the likes of Oscar Wilde, the Bronte sisters, Lewis Carroll, Jane Austen, Thomas Hardy, George Eliot, Charles Dickens, Mary Shelley… Over in the States, there’s Nathaniel Hawthorne, Herman Melville, Mark Twain… And how about some poets, while we’re at it? Walt Whitman? Emily Dickinson? Or maybe the Romantics are more your shtick? Keats? Byron? Shelley? Blake? God yes, Blake… get your hands on an illustrated edition. I desperately want to shoehorn Mary Wollstonecraft and John Stuart Mill in there. Just because. So many writers. So many books. So little time. But you’re going to make me pick one at gunpoint, aren’t you? Fine. Emily Bronte - Wuthering Heights. Because I’m ridiculously, incurably sentimental, and the following lines never fail to make me bleed a little inside: “I cannot express it; but surely you and everybody have a notion that there is or should be an existence of yours beyond you. What were the use of my creation, if I were entirely contained here? My great miseries in this world have been Heathcliff’s miseries, and I watched and felt each from the beginning: my great thought in living is himself. If all else perished, and he remained, I should still continue to be; and if all else remained, and he were annihilated, the universe would turn to a mighty stranger: I should not seem a part of it.—My love for Linton is like the foliage in the woods: time will change it, I’m well aware, as winter changes the trees. My love for Heathcliff resembles the eternal rocks beneath: a source of little visible delight, but necessary. Nelly, I am Heathcliff! He’s always, always in my mind: not as a pleasure, any more than I am always a pleasure to myself, but as my own being.” Argh. Swoon. ",
            "date": "Answered May 21, 2018",
            "views": "595",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anne Marie Lowndes",
                    "user_href": "/profile/Anne-Marie-Lowndes"
                },
                {
                    "user_id": "Leeman Cheng (鄭禮民)",
                    "user_href": "/profile/Leeman-Cheng-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Halter",
                "href": "/profile/Ethan-Halter"
            },
            "answer_text": "Probably have to narrow it down to country of origin, or at least language, and maybe genre (fiction or non-fiction, at least) but my gut reaction is to unequivocally answer Moby Dick, at least for American literature. But then I think about all of the great works of fiction and philosophy from England and the continent, not to mention all that I don't know about from elsewhere, and insist that your question, at least until further refined, is meaningless and unanswerable. ",
            "date": "Answered February 19, 2013",
            "views": "442",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emil Kadhum",
                "href": "/profile/Emil-Kadhum-1"
            },
            "answer_text": "Frankly, I'm not the best person to ask as my tastes in literature tend to stay within the last 100 years or so, and I am much more of a non-fiction guy than fiction. Nevertheless, will give you the best with my limitrd experience: Brothers Karamazov — Dostoevsky Crime and Punishment — Dostoevsky War and Peace — Tolstoy The Picture of Dorian Gray — Wilde Dracula — Bram Stoker Adventures of Huckleberry Finn — Twain Again — very limited — and excluding works that I've heard are wonderful, (Little Women, Pride and Predjudice, etc) but havent read. ",
            "date": "Answered May 20, 2018",
            "views": "257",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Shaw",
                "href": "/profile/David-Shaw-4"
            },
            "answer_text": "I don’t know about “best” but here are two of my favorites relating to history. An Introduction to the Study of the Middle Ages (375–814) by Ephraim Emerton 1888. As a history major in college, I have read a lot of really bad history books. This book, happily, is quite a page turner. It is refreshingly politically incorrect, and explains so much that connects the Romans right down to today’s current events. Quite a bit of the book deals with immigration and population movements that are a relevant topic in today’s modern world. This book changed my views on immigration. The second book is “The Crossing” by Winston Churchill 1904. I know this is techinically 20th century but I am including it for this reason. It was written at the beginning of the 20th century about American history events of the late 1700’s. It’s as if today we were writing about the events of WWI. The events are in the past, but the echos still hang in the air. This is historical fiction as told from the point of view of a young lad who stumbles from one significant historical event to another in “Forest Gump” fashion. The author is the very famous writer Winston Churchill, not the equally famous British politician of the same name. ",
            "date": "Answered May 21, 2018",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerry O'Sullivan",
                    "user_href": "/profile/Gerry-OSullivan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Penrose",
                "href": "/profile/Elizabeth-Penrose-1"
            },
            "answer_text": "The best children’s books from the 19th century include certain books of Mark Twain, The King of the Golden River, Lewis Carroll’s Alice books, A Child’s Garland of Verses, the two Jungle Books, and Little Women. Note the word include: please mention ones you knew and loved. ",
            "date": "Answered May 20, 2018",
            "views": "235",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                },
                {
                    "user_id": "Hrishikesh Chaudhary",
                    "user_href": "/profile/Hrishikesh-Chaudhary-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Tygart",
                "href": "/profile/Mark-Tygart"
            },
            "answer_text": "I’m fond of The Proud Tower: A Portrait of the World Before the War, 1890–1914 by Barbara Tuchman, although that is only about the Western Europe and the US. ",
            "date": "Answered May 19, 2018",
            "views": "77",
            "upvotes": " Answer requested by Hamza Jamal"
        },
        {
            "author_info": {
                "name": "John David Baxter",
                "href": "/profile/John-David-Baxter"
            },
            "answer_text": "For me, Charles Dickens, “A Christmas Carol” had a profound impact on public thinking. No Christmas is complete without it. ",
            "date": "Answered May 24, 2018",
            "views": "78",
            "upvotes": " Answer requested by Hamza Jamal"
        }
    ]
}