{
    "title": "Which countries were democracies in the Medieval period? - Quora",
    "tags": [
        "History of Politics",
        "Politics and Government",
        "Middle Ages (era)",
        "Democracy",
        "Government",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason St. Pierre",
                "href": "/profile/Jason-St-Pierre-3"
            },
            "answer_text": "If you’re looking for a place where “every adult male citizen could vote”, there were only two: Iceland and the Faeroe Islands. In both cases, any free man could represent his family at the Thing (Assembly) and participate in governance. However, as others have pointed out, there were a number of other states that had more limited franchises. The English Parliament dates back to the 12th century, for instance, and commoners became able to participate with the establishment of the House of Commons in 1341. A number of Italian cities, most notably Venice, were self-governing republics. One of which, San Marino, retains its independence and government to this day. Keep in mind that apart from Venice, these states were nominally under the rule of the German Empire, but notoriously protective of their independence. A couple of Russian states, most notably Novgorod and Pskov, were also republics. The Roman Senate lasted until the 8th century and the Byzantine Senate lasted until the Fourth Crusade. Both were highly aristocratic, but were representative bodies. The Spanish Cortes Generales, which was largely an advisory body, arguably fall into this category as well. On an institutional level, the Church contained a fair amount of democratic governance. Monks had the right to elect their abbots and, once the rules were finalized, cardinals had the right to choose the pope, and (I’m going from memory on this one) the Knights Hospitaller had the right to choose their masters. ",
            "date": "Answered June 29, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Treky Jimbor",
                    "user_href": "/profile/Treky-Jimbor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Johnston",
                "href": "/profile/Robert-Johnston-35"
            },
            "answer_text": "I presume that the references to ancient Athens and pre civil war USA refers to the disenfranchisement of slaves and the poorer citizens. There was no slavery, or feudal restriction in independent medieval city states like Florence, San Marino and Venice. Although dominated by the richer merchant families there was a wide franchise and near democracy. Powerful cities within kingdoms like London and Paris had a lot of clout and independence with their elected mayors too. In addition, before their takeover by Norway Icelanders had their Althing with legislative but not executive power. ",
            "date": "Updated July 2, 2016",
            "views": "318",
            "upvotes": "0"
        }
    ]
}