{
    "title": "Which U.S. professional sports league will expand into Mexico first, when, where and why? - Quora",
    "tags": [
        "Sports Business",
        "Mexico",
        "Professional Sports",
        "Sports"
    ],
    "response": [
        {
            "author_info": {
                "name": "Douglas Chapel",
                "href": "/profile/Douglas-Chapel"
            },
            "answer_text": "Where:  It would have to Mexico City, no matter the sport.  Mexico City is the largest city in North America, its the commercial and cultural hub of Mexico in addition to the capital, and it's a well-developed Alpha-level global city.  It's hard to see a major sports league going anywhere in Mexico without establishing itself in Mexico City first.  The big challenge for any of the leagues would be having a team playing 7,500 feet above sea level.  That's quite a bit higher than Denver, whose altitude already has a noticeable impact on sports there.  The 1968 Olympics featured a number of world records partially attributed to Mexico City's elevation. Which sport:  As much as I love hockey, we can rule that out.  There are several Canadian cities that need an NHL team before the league would look at a country with no hockey history to speak of.  Baseball seems like a good choice, but if MLB were going to put a team in Latin America, I believe its first choice would be Havana - if politics ever allow that to be a possibility.  Football makes some sense, as the NFL has held successful exhibition games in Mexico City before.  But the NFL's aggressive expansion of the London series makes it clear that their international ambitions are elsewhere.  That would leave the NBA.  The NBA makes some sense if any league were going to go to Mexico City.  Basketball is the most global of the major sports - there are NBA players from every continent, for example.  And the NBA has a decent track record of being the only major team in a city - see Portland, Oklahoma City, San Antonio, Orlando, etc. When:  None of the major leagues has had an expansion since the Bobcats/New Hornets over 10 years ago, so relocation would be the more likely option.  However, if we're talking about the NBA, it is the league that could most easily expand.  Since a roster only has 12 players, the NBA could expand with far less talent dilution that would come with expansion in one of the other leagues.  A new team in Mexico City, paired with the New Seattle Sonics (to keep an even number of teams) could be done probably quickly.  When will that happen?  Well, the NBA isn't currently talking a lot about expansion, so it's hard to predict. Why:  The only reason any league would expand to Mexico would be for money, pure and simple.  Accessing a potential new fanbase of 120 million people, with all of the ticket, merchandise, and TV revenue entailed therein?  Potentially increasing appeal with the ever-growing Mexican-American population?  \"Growing a more global brand,\" or some such thing?  Literally everything is professional sports is driven by economics. ",
            "date": "Answered December 22, 2015",
            "views": "667",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Stagliano",
                    "user_href": "/profile/Tom-Stagliano"
                },
                {
                    "user_id": "David Hood",
                    "user_href": "/profile/David-Hood-2"
                },
                {
                    "user_id": "Krunal Sonpal",
                    "user_href": "/profile/Krunal-Sonpal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristian Montes de Oca",
                "href": "/profile/Cristian-Montes-de-Oca-1"
            },
            "answer_text": "Hi, I don't know about a US professional team or league coming to Mexico (but I will try to answer it), but what about the other way around? Club Deportivo Chivas USA CD Chivas USA  was a football (soccer) team who played on the MLS and the owner has another very very popular team in the Mexican league called, well, Chivas too (or Club Deportivo Guadalajara). The team played for almost 10 years, from 2004 to 2014, and will play with another name in the future. Now, back to the original question. Well, if I had to answer WHICH I would agree with Douglas, and choose Basketball, followed (maybe) by the MLS. WHERE? Even if Mexico City sounds as a good option, it is very far away from the US, so I would choose a border city or other northern states, such as Nuevo Leon or Baja California. WHEN? Probably in 2020 or maybe never. Who knows? WHY? Money, money, money! Do you have any idea of how many Mexicans are fans of the NBA ,the NFL and the MLB? Millions, for sure. ",
            "date": "Answered January 4, 2016",
            "views": "698",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Kerrigan",
                    "user_href": "/profile/Peter-Kerrigan"
                }
            ]
        }
    ]
}