{
    "title": "Which book is good for medieval history? - Quora",
    "tags": [
        "History Book Recommendations",
        "History Books",
        "Middle Ages (era)",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Graham",
                "href": "/profile/Bruce-Graham-1"
            },
            "answer_text": "Thanks for your question. Several suggestions have already been made, so I will try to only suggest books which have not yet been mentioned. If you want a short summary, one of the best standbys is the Oxford University Press ‘A very short introduction to…’ So let’s start with that one [1}:  A very compact overview (144 pages) with a fairly comprehensive bibliography for further investigation of the subjects covered within. A further ‘broad-brush’ book, with more heft to it, but still very readable, is this one [2}:  This book is well written, and very readable. Here is a piece from a review. The author, now deceased… was a professor at Cornell University and one of the world’s preeminent medieval historians and authors during his lifetime. His brilliance and subject mastery are on full display in his ability to concisely unpack the 1000-year history between the fall of Rome and the Reformation in a way that’s interesting, humorous and accessible to the reader. Importantly, he leaves you with an appreciation of the Middle Ages as a significant period of progress, however slow at times, and our modern day connections to its culture, language, art, philosophy, as well its social, political and religious institutions. [3} Now we move from the general to the specific. One book I found particularly interesting is the book on France’s Gothic cathedrals in that God-soaked age:  It is a work of such education and erudition that to sum it up successfully is impossible. All I can do is urge you to read it yourself. If you have any interest in religion, architecture, history, poetry, or philosophy Adams’ Mont-Saint-Michel and Chartres is essential. [4]  In order to see how the modern world got here, we need to go back to signs of recognizable change. Lynn White’s book helps us do that. [5] Joseph Needham called the book ‘the most stimulating book of the century on the history of technology’. [5} Lastly, a threnody for the passing of the Middle Ages, the beautifully written:  …the features Huizinga assigns to the Middle Ages of self-containment and a perfection of attitude and expression in regard to all things, marks Medieval culture at the beginning of the 15th century as a culture at its limits, and one to be inevitably overtaken by Burckhardt’s “universal men” of the Renaissance… [6]  Footnotes: [1} The Middle Ages [2} The Middle Ages (9780618057030): Morris Bishop [3} A fast & funny read on the Middle Ages [4] Adams, Henry Brooks. “Mont-Saint-Michel and Chartes” (1904) [5} https://www.jstor.org/stable/25148163?seq=1#page_scan_tab_contents [6] Book Review of The Waning of the Middle Ages by J. Huizinga, ",
            "date": "Answered February 7, 2019",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shreya Singh",
                    "user_href": "/profile/Shreya-Singh-2259"
                },
                {
                    "user_id": "Arturo Jevons",
                    "user_href": "/profile/Arturo-Jevons"
                },
                {
                    "user_id": "NIHIR Agarwal",
                    "user_href": "/profile/NIHIR-Agarwal-1"
                },
                {
                    "user_id": "Bob Metcalfe",
                    "user_href": "/profile/Bob-Metcalfe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Espen Kulia",
                "href": "/profile/Espen-Kulia"
            },
            "answer_text": "General The History of the Medieval World: From the Conversion of Constantine to the First Crusade by Susan Wise Bauer (2010) From the schism between Rome and Constantinople to the rise of the T’ang Dynasty, from the birth of Muhammad to the crowning of Charlemagne, this erudite book tells the fascinating, often violent story of kings, generals, and the peoples they ruled.  Feudal Society, Volume 1 and Feudal Society, Volume 2 by Marc Bloch (1964)   A Distant Mirror: The Calamitous 14th Century by Barbara W. Tuchman (1978) 319 pages National Book Award for History (1980)ASJA Outstanding Book Award (1980)National Book Critics Circle Award Nominee (1978) The Year 1000: What Life Was Like at the Turn of the First Millennium by Robert Lacey (1998) 230 pages  Medieval Christianity: A New History by Madigan, Kevin J. ( 2015) 'This is a book for beginners' claims Madigan at the beginning of his extensive endnotes. What he means is that this is essentially a textbook--but a very good one. \"Christianity\" here isn't limited to theology or even to church and cloister walls. Madigan sets developments in people's prayer lives, mysticism, sacraments, heresy, and the fight against heresy in broader religious, political, and social contexts.[1]  Byzantium: The Surprising Life of a Medieval Empire by Herrin, Judith ( 2006) A very well-written introduction to Byzantium that approached the topic thematically rather than chronologically. High recommended for newcomers to Byzantine history![2]  The Time Traveller's Guide to Medieval England: A Handbook for Visitors to the Fourteenth Century by Ian Mortimer (2008)  The Inheritance of Rome: Illuminating the Dark Ages, 400-1000 by Chris Wickham (2009)  The Making of the Middle Ages by Southern, R.W. ( 1953) An examination of the eleventh and twelfth centuries in western Europe by one of the greatest medievalists of the twentieth century.  The Plantagenets: The Warrior Kings and Queens Who Made England by Dan Jones (2012)  Norman Conquest of England (1066-) 1066: The Year of the Conquest by David Howarth (1977) Drawing on a wealth of contemporary sources, David Howarth gives us memorable portraits of the kings: Edward the Confessor, Harold of England, William of Normandy, as well as the leading political figures of the time. Howarth describes the English commoners: how they worked, fought, died, and how they perceived the overthrow of their world from their isolated shires.  The Norman Conquest by Marc Morris (2012) A lively subject, depicted with dash and color, brought to bright life with telling detail. Morris gives a compelling account of the invasion by William the Conqueror in 1066 and the violent struggle thereafter. Morris provides a much-needed, modern account of the Normans in England that respects past events more than present ideologies.- The Times (London)  Viking Age (793–1066) The Viking World by Brink, Stefan ( 2008) A book which combines many short chapters on any topic relevant to Vikings or the Scandinavian late Iron Age. A strong point is that many chapters are written by the relevant specialists instead of a single author who is trying to specialize in everything. A bad point is that this means that there's not much of a central theme connecting the chapters, which makes this more of a reference work than a bedtime story.[3]  Crusades (1096 and 1291) The Crusades: The Authoritative History of the War for the Holy Land by Thomas Asbridge (2010) Asbridge is one of the leading modern scholars of the crusades, and this books is not only expansive in its scope, covering the crusading movement from genesis to the aftermath of the fall of Acre, but it is also quite readable. Plus it's quite inexpensive for a scholarly work. Heavily focused on the Third Crusade, particularly on Saladin and Richard.[4]  The Crusades: A Short History by Riley-Smith, Jonathan (2005) “A lively and flowing narrative [with] an enormous cast of characters that is not a mere catalog but a history. . . . A remarkable achievement.”—Thomas E. Morrissey, Church History  Footnotes[1] AskHistorians[2] AskHistorians[3] AskHistorians[4] AskHistorians",
            "date": "Answered February 5, 2019",
            "views": "825",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arishina Goswami",
                    "user_href": "/profile/Arishina-Goswami"
                },
                {
                    "user_id": "Tyler Paiva",
                    "user_href": "/profile/Tyler-Paiva"
                },
                {
                    "user_id": "Ed Ortiz",
                    "user_href": "/profile/Ed-Ortiz-10"
                }
            ]
        }
    ]
}