{
    "title": "Which country has had the most wars? - Quora",
    "tags": [
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Tommi Honkala",
                "href": "/profile/Tommi-Honkala"
            },
            "answer_text": "First of all, I think we need to go around the concept of a country for a bit, because such national entities often change during wars and even as a concept it is very young. Since very few places in the world have not been touched by conflict, we can assume most wars have taken place where humans have lived the longest. Homo Sapiens, the first modern humans, evolved about 200 000 or 250 000 years ago in Africa and began to move elsewhere maybe 70 000 to 100 000 years ago.  We can’t simply answer Africa - in my opinion - because we are still a bit far from definition of a country. The first civilizations appeared around major river valleys, due to easier farming and transportation. Such civilizations were the Mesopotamian, Indus and Yellow river. We are now talking about Neolithic period, less than 10 000 years ago.  Obviously there had been conflicts before real civilizations, but they were much smaller and unorganized. Skirmishes between small farming communities can hardly be called wars between countries. With civilizations came cities and states, meaning organized communities under single political structures. A present-day country is such a state too. Finally, in Mesopotamia, writing was invented around 3100 BC. Writing enabled us to maintain more complex social hierarchies and consolidate power over larger areas and populations. This led to codification of laws and better record-keeping. With written text we can finally talk about declaration of war in modern sense.  With this information, my best estimate is that the area with most wars in human history, is the Fertile Crescent. Syria, Iraq and many other countries in the area are still unstable today. Still, many African countries can be considered equally torn by war. Also many western countries might look nice and safe, like Britain, even though they have been involved in more than 100 wars. ",
            "date": "Answered October 18, 2017",
            "views": "402",
            "upvotes": " View 205 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jussi Jokela",
                    "user_href": "/profile/Jussi-Jokela"
                },
                {
                    "user_id": "Evan Granados",
                    "user_href": "/profile/Evan-Granados"
                },
                {
                    "user_id": "James Alexander-Rodriguez",
                    "user_href": "/profile/James-Alexander-Rodriguez"
                },
                {
                    "user_id": "Tyler Savage",
                    "user_href": "/profile/Tyler-Savage"
                },
                {
                    "user_id": "Rick Roland",
                    "user_href": "/profile/Rick-Roland-6"
                },
                {
                    "user_id": "Jake Denny",
                    "user_href": "/profile/Jake-Denny-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Long-Living-Stone"
                },
                {
                    "user_id": "Gayle Liman",
                    "user_href": "/profile/Gayle-Liman"
                },
                {
                    "user_id": "Azizbek Avazov",
                    "user_href": "/profile/Azizbek-Avazov"
                },
                {
                    "user_id": "Hansen Holland",
                    "user_href": "/profile/Hansen-Holland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jumare Jaeger",
                "href": "/profile/Jumare-Jaeger-3"
            },
            "answer_text": "The most fought over place on Earth is Constantinople (Istanbul, Turkey). Wikipedia is the source of all of this information. 626. Siege of Constantinople. The Siege of Constantinople in 626 by 80,000 Sassanid Persians and Avars, ended in a strategic victory for the Byzantines (12,000 defenders). The failure of the siege saved the Empire from collapse, 674–678 The First Arab Siege of Constantinople in 674–678 was a major conflict of the Arab–Byzantine Wars. The Arabs lost. Tens of thousands of men were killed on both sides in very heavy fighting. The Arab navy was destroyed by Byzantines throwing jars of Greek fire. The siege was even mentioned in ancient Chinese written histories.  717–718 The Second Arab siege of Constantinople in 717–718 was a combined land and sea offensive by 129,999 the Muslim Arabs of the Umayyad Caliphate against the capital city of the Byzantine Empire, Constantinople. The Arabs lost. The Muslim goal of conquest of Constantinople was effectively abandoned, and the frontier between the two empires stabilized. 1203 The Siege of Constantinople in 1203 was a Crusader siege of the capital of the Byzantine Empire (a the beginning of the Fourth Crusade). The Fourth Crusade was decreed by Pope Innocent III to recapture Jeruselam by an attack through Egypt. However, large numbers of Johnny-come-lately European Crusaders missed he boats that left Italy and traveled overland. Attacking Constantinople had no religious or military purpose - it just happened to be a rich and handy city to sack. 20,000 Crusaders faced 15,000 defenders. The Crusaders burned most of Constantinople and the city surrendered. 1204 The Sack of Constantinople or Siege of Constantinople occurred in 1204 and marked the culmination of the Fourth Crusade. Mutinous Crusader armies captured, looted, and destroyed parts of Constantinople, The sack of Constantinople is a major turning point in medieval history. The Crusaders' decision to attack the world's largest Christian city was unprecedented and immediately controversial, even among contemporaries. Reports of Crusader looting and bruality scandalised and horrified the Orthodox world; relations between the Catholic and Orthodox churches were catastrophically wounded for many centuries afterwards, 20000 Crusaders looted, terrorized, and vandalized Constantinople for three days in April of 1204. Pope John Paul II twice expressed sorrow for the events of the Fourth Crusade in 2001 and in 2004. 1235 The Siege of Constantinople (1235) was a joint Bulgarian-Nicaean siege. The siege was unsuccessful. 1260 The Siege of Constantinople in 1260 was the failed attempt by the Nicaean Empire, the major remnant of the fractured Byzantine Empire, to retake Constantinople from the Latin Empire . The siege failed, 1411 The Siege of Constantinople of 1411 occurred during the Ottoman Civil War. Two sultans fough each other. 1422 The first full-scale Ottoman Siege of Constantinople took place in 1422 as a result of the Byzanti he Byzanines held off heOtomans.ne Emperor Manuel II's attempts to interfere in the succession of Ottoman Sultans, 1453. The siege of Constantinople, the capital of the Byzantine Empire and one of the most heavily fortified cities in the world, took place in 1453. Sultan Mehmed II, ruler of the Ottoman Turks, led the assault. The city was defended by, at most, 10,000 men. The Turks had between 100,000 and 150,000 men on their side. The siege lasted for fifty days. The Turks employed various important war tactics in taking over the city. They used huge cannon to destroy the walls, warships were used to the cut the city's sea defense. They also used an extensive infantry to engulf the city. The nation of France is probably the answer to the question. France is significant because they got involved in so many wars in the last one thousand years and lost most of them. List of wars involving France - Wikipedia ",
            "date": "Answered October 25, 2017",
            "views": "93",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jussi Jokela",
                    "user_href": "/profile/Jussi-Jokela"
                },
                {
                    "user_id": "Rowan Schoon",
                    "user_href": "/profile/Rowan-Schoon-2"
                },
                {
                    "user_id": "Dark Snake",
                    "user_href": "/profile/Dark-Snake"
                },
                {
                    "user_id": "TheOneAndOnlyZeno .",
                    "user_href": "/profile/TheOneAndOnlyZeno"
                },
                {
                    "user_id": "Fayzan Hussain",
                    "user_href": "/profile/Fayzan-Hussain-3"
                },
                {
                    "user_id": "Ethan Burn",
                    "user_href": "/profile/Ethan-Burn-1"
                },
                {
                    "user_id": "Jake Denny",
                    "user_href": "/profile/Jake-Denny-6"
                },
                {
                    "user_id": "Umut Taştemir",
                    "user_href": "/profile/Umut-Taştemir"
                },
                {
                    "user_id": "Vilmos Kovacs",
                    "user_href": "/profile/Vilmos-Kovacs-3"
                },
                {
                    "user_id": "F U Kwarra",
                    "user_href": "/profile/F-U-Kwarra"
                }
            ]
        }
    ]
}