{
    "title": "Who is the greatest swordsman in TV history? - Quora",
    "tags": [
        "Japanese Tv Shows",
        "Swordsmen",
        "Spartacus (TV series)",
        "Warriors",
        "Game of Thrones (TV series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emmanuel Vitulano",
                "href": "/profile/Emmanuel-Vitulano"
            },
            "answer_text": "Well, you’re unlikely to find the greatest TV show swordsman from Highlander, or Game of Thrones. A couple have been from movies, and my candidate has movies and Tv shows. At age fifteen, he killed a knight renowned for killing thirty men on his own. In his early twenties, he fought an army of a hundred on his own. By the time he was thirty, he was murdering demons. And, in one of those movies, specifically Berserk: The Golden Age Arc I: The Egg of the King, he has (at least in my opinion) one of the most well choreographed sword fights in movie history. Skip to about 4:55 for the fight, but the rest of the scene adds to the drama of the situation, and the five minutes spent watching it won’t be a waste of time.  Add to the already fantastic fight scene the fact that it’s one of the few times we see reasonably competent Longsword combat on cinema (despite the fact that, like many TV shows, it treats armour like it’s made from tissue paper). There are plenty of BS OP swordsmen in fiction, but the fact that most of Guts’ accomplishments are done purely through skill (up until he gets the berserker armour) make him stand out. ",
            "date": "Answered August 27, 2017",
            "views": "779",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asad Arshad",
                "href": "/profile/Asad-Arshad-10"
            },
            "answer_text": "Presenting Ser Arthur Dayne from Game of Thrones…  He was the only one who defeated the Smiling Night in one round only… Even Eddard Stark said, “I’ve never seen a fine swordsman like Ser Arthur Dayne my whole life.” He never lost a fight… He trained Jaime Lannister, another great swordsman(Not after his hand was gone)… He protected Lyanna Stark in the tower and fought Ned Stark and his bannermen alone killing all of them except Ned Stark… He would’ve won if Howland Reed wouldn’t backstab him… In my view, he is the greatest swordsman of all time with honor in TV history… Before the combat with Ned Stark, he said, “I wish you good fortune in the wars to come and now it begins.”  My vote goes to Ser Arthur Dayne… ",
            "date": "Answered August 20, 2017",
            "views": "135",
            "upvotes": " View 92 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waad El-Motawakel",
                    "user_href": "/profile/Waad-El-Motawakel"
                },
                {
                    "user_id": "John Rudd",
                    "user_href": "/profile/John-Rudd-2"
                },
                {
                    "user_id": "VishVam Kotecha",
                    "user_href": "/profile/VishVam-Kotecha"
                },
                {
                    "user_id": "Hanan Baba",
                    "user_href": "/profile/Hanan-Baba"
                },
                {
                    "user_id": "Omkar Chorghe",
                    "user_href": "/profile/Omkar-Chorghe"
                },
                {
                    "user_id": "Thanga Tamil Selvan",
                    "user_href": "/profile/Thanga-Tamil-Selvan"
                },
                {
                    "user_id": "Agus Wijoyono",
                    "user_href": "/profile/Agus-Wijoyono"
                },
                {
                    "user_id": "Johannes Von Kleist",
                    "user_href": "/profile/Johannes-Von-Kleist"
                },
                {
                    "user_id": "Sahjanand Rai",
                    "user_href": "/profile/Sahjanand-Rai"
                },
                {
                    "user_id": "Reece Harvey",
                    "user_href": "/profile/Reece-Harvey-1"
                }
            ]
        }
    ]
}