{
    "title": "Who invented LED bulbs? - Quora",
    "tags": [
        "LED Bulbs",
        "Compact Fluorescent Lightbulbs",
        "History of Inventions",
        "Light Emitting Diodes",
        "Light Bulbs",
        "Inventors",
        "Lighting",
        "Invention and Inventions",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashwini Kumar",
                "href": "/profile/Ashwini-Kumar-927"
            },
            "answer_text": "Inventing the LED Lightbulb  In 1962, when he was 33, the scientist Nick Holonyak, Jr., created the first practical visible light-emitting diode. At GE, they called it \"the magic one.\" Someone actually wrote that on the back—here's Holonyak showing the little diode (we're skipping over some bits of the video, but if you want to see Holonyak's whole story watch the whole thing) Holonyak wasn't trying to create a light that would replace incandescent bulbs. He was trying to make a laser. In that video, just before he shows off the LED, he talks about his job, doing exploratory work—making \"devices that didn't exist until we made them.\" (Sounds like fun, right?) One device that did not exist was a semiconductor laser. Other GE scientists were working on creating an infrared semiconductor laser; so Holonyak decided he would make a visible one. (The thinking being: \"If they can make a laser, I can make a better laser than any of them.\") Holonyak wasn't quite fast enough to make the first semiconductor laser—the infrared one came into being a few weeks before his. In that process, though, he did create that little semiconductor light. It was red, a signature of gallium arsenide phosphide (GaAsP), the alloy Holonyak had layered into the diode. Scientists had known since the beginning of the 20th century that certain semiconductors, when electrical current was applied, would light up. But this was the first time anyone had turned that knowledge into a practical lamp. Within the year, GE was selling LEDs, for $260 a pop. Within ten years, there was a green LED and then a yellow one, developed by one of Holonyak's students, and Monsanto, which made GaAsP, had created its own tiny LED bulb. Holonyak had an instinct, all the way back at the beginning of the LED's history, that these little, efficient sources of light could replace the clunky incandescent bulbs that illuminated the world back then. He did not, he said in 2012, think it would take 50 years. LEDs started small, as the little indicator lights on electrical equipment. IBM used them in circuit boards as early as 1964. They went into the digital watches of the 1970s. By the end of the 1980s, they showed up in traffic lights and in brake lights. Now LEDs are straight-up replacing incandescent light bulbs. There's another great moment at the end of that GE video, when Holonyak's handling GE's 100-watt equivalent bulb. \"I thought it would be clumsier,\" he says, and smiles. But, no, they look pretty snazzy. They're only getting cheaper, too. ",
            "date": "Answered September 21, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Morehead",
                    "user_href": "/profile/James-Morehead-8"
                }
            ]
        }
    ]
}