{
    "title": "Who were the strongest, knights or vikings? - Quora",
    "tags": [
        "Knights",
        "Vikings",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Lyonel Perabo",
                "href": "/profile/Lyonel-Perabo"
            },
            "answer_text": "Well, considering that when Vikings were around, Knights were very, very different from what they would become (forget the plate armor, the gallantry and the tourneys) the question could be asked.    (You won't see this guy fighting a Viking anytime soon...) Back in the Carolingian period, Knights were mostly just cavalry soldiers, often stemming from a somewhat noble or warrior background so they sure were good soldiers and likely had access to better equipment than most Viking raiders.    (Mr. Fuluffypony here is much more likely to encounter a Viking) Now, as I wrote in an other answer (Lyonel Perabo's answer to What kind of people were vikings compares to knights?) most Vikings were not professional warriors they were sheep-herders and Cod-fishers. Most of them probably only had an old wood-axe and a handmade shield. Maybe a second-hand sword if they could pillage it.   (Þorgeirr seems like a honest and merry guy, not a blood-thirsty elite warrior) Of course there were exceptions, and Viking mercenaries and the Scandinavian ruling class were probably tough as nails (and better equipped too) but the average Norse fighter would probably not fare well against a Knight, because the Knight was not an average fighter, he was an elite one.    Hope this helped ! ",
            "date": "Answered December 13, 2015",
            "views": "242",
            "upvotes": " View 123 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike E",
                    "user_href": "/profile/Mike-E-244"
                },
                {
                    "user_id": "Joshua Smith",
                    "user_href": "/profile/Joshua-Smith-1499"
                },
                {
                    "user_id": "Alan Viveros",
                    "user_href": "/profile/Alan-Viveros-1"
                },
                {
                    "user_id": "Regan Thompson",
                    "user_href": "/profile/Regan-Thompson-9"
                },
                {
                    "user_id": "Knights Creed",
                    "user_href": "/profile/Knights-Creed"
                },
                {
                    "user_id": "Mikeame Planetgamer",
                    "user_href": "/profile/Mikeame-Planetgamer"
                },
                {
                    "user_id": "Nicholas",
                    "user_href": "/profile/Nicholas-713"
                },
                {
                    "user_id": "Jeffrey Gao",
                    "user_href": "/profile/Jeffrey-Gao-8"
                },
                {
                    "user_id": "John Bromley",
                    "user_href": "/profile/John-Bromley-12"
                },
                {
                    "user_id": "Brandon Valencia",
                    "user_href": "/profile/Brandon-Valencia-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Baird",
                "href": "/profile/Andrew-Baird-6"
            },
            "answer_text": "The closest thing the Viking era had to what most people would consider a knight (heavily armoured shock cavalry used to smash infantry formations) would have been the Cataphracts of the Roman Empire. They were equipped with chain and scale armour, rode armoured horses, and used a long-lance, mace, axe and sword. But these Cataphracts were also horse archers. They moved in large formations at a fairly slow pace, shot up an enemy, then hit them before they recovered like the very Hammer of Thor. And, at the end of the day, this is ignoring the fact that whether a \"knight\" or a viking had an advantage over the other depended entirely upon the situation in ehich they met. Is the Viking force disorganised, in a flat and open field, or are they charging the rear or flank of a shieldwall? The knights win. Were the knights caught at unawares in a raid, or are The Vikings I a well formed shieldwall with protected flanks? The Vikings win. One thing is not, and indeed can not, be better than another kind of thing in every instance. In the same way that you wouldn't use a keyboard to peel a potato you wouldn't use a knife to surf the internet. That isn't how things work. ",
            "date": "Answered August 7, 2016",
            "views": "42",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Viveros",
                    "user_href": "/profile/Alan-Viveros-1"
                },
                {
                    "user_id": "Sameer Hasan",
                    "user_href": "/profile/Sameer-Hasan-36"
                },
                {
                    "user_id": "Alex Gonciarov",
                    "user_href": "/profile/Alex-Gonciarov"
                }
            ]
        }
    ]
}