{
    "title": "Who would be your top five female Republican VP picks? - Quora",
    "tags": [
        "Top Five (2014 movie)",
        "Trump Running Mate Speculation (February 2016)",
        "Executives",
        "Vice Presidents",
        "Hillary Clinton",
        "2016 US Presidential Campaign and Election",
        "Republican Party (US politics)",
        "Trump-Pence 2016",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Spencer Klopfer",
                "href": "/profile/Spencer-Klopfer"
            },
            "answer_text": "Here are my top 5 picks for Republican VP that are Woman, I will also list why I think they are good. (I will include ethnicity even though that doesn’t impact what I believe, but it could impact voters and rebut the Democrat narrative of our party.) Nikki HaleyShe is Indian American, has been the Governor of South Carolina, gave a successful response to the State of the Union in 2016, and is currently serving as an ambassador to the UN gaining valuable international experience, while standing up for Israel and rebuking the double standards of the UN.Mia LoveShe is Haitian and Black, is a member of the House of Representatives, has been a mayor before, she was a speaker at the Republican National Convention in 2012, and is a strong conservative voice.Kelly AyotteShe is young, has served as a Senator, state prosecutor, state Attorney General, and is from a Northeastern state.Mary FallinGovernor of Oklahoma, a strong conservative voice, has executive experience.Jan BrewerHas served as a governor of a state that is becoming increasingly purple (Arizona), could have an impact there.",
            "date": "Answered June 24, 2017",
            "views": "153",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Lawyer",
                    "user_href": "/profile/William-Lawyer-1"
                },
                {
                    "user_id": "Angela Cutter",
                    "user_href": "/profile/Angela-Cutter"
                },
                {
                    "user_id": "Elizabeth Coxen",
                    "user_href": "/profile/Elizabeth-Coxen"
                }
            ]
        }
    ]
}