{
    "title": "Who are the famous Chinese Hakkas in history and today? - Quora",
    "tags": [
        "Hakka People",
        "Overseas Chinese",
        "Biographies",
        "History of China",
        "Chinese Ethnicity and People",
        "Politicians and Government Leaders",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Vong",
                "href": "/profile/Will-Vong-1"
            },
            "answer_text": "Here are some famous people who are of Hakka descent. For some I am not 100% certain, but I think are likely to have Hakka heritage based on historical migration patterns. Clearly, Hakka have a thing for becoming politicians in random countries! Naomi Campbell. British supermodel and actress. She is of Chinese Jamaican descent on her father’s side. Nearly all Chinese Jamaicans are Hakka so she most likely has Hakka heritage. Source: Chineselanguage.org and Naomi Campbell - Wikipedia.  Lee Kuan Yew. The founder of Singapore. A descendant of Hakka migrants to Singapore from the predominantly Hakka Lanfang Republic in Borneo.  Lee Hsien Loong. Current head of state of Singapore. Son of Lee Kuan Yew.  Sun Yat Sen. Physician and founder of the Republic of China. Of Hakka and Cantonese descent.  Deng Xiaoping. Former paramount leader of the People’s Republic of China. He is likely of Hakka descent, but it is not 100% certain.  Michael Lee-Chin. Jamaican business tycoon and philanthropist who is the wealthiest man in Jamaica. He is currently the chairman of National Commercial Bank of Jamaica. He is at least 1/4 Hakka and 1/2 Chinese. Thanks to Collin Spears for sharing this information.  Eddie Peng. Taiwanese actor and sex symbol.  Hong Xiuquan. Leader of the Taiping Heavenly Kingdom. Most of the leadership and followers of the Taiping Rebellion were Hakka.  Tsai Ing-wen. Current president of Taiwan. She is 3/4 Hakka.  Yap Ah Loy. Founder of Kuala Lumpur. Hakka born in Guangdong who immigrated to Malaysia.  Ahok(Basuki Tjahaja Purnama). Indonesian politician and charismatic former governor of Jakarta. Born in Bangka-Belitung to a Hakka-Indonesian family.  Yingluck Shinawatra. Former prime minister of Thailand. Born into a wealthy Hakka Thai family.  Lee Teng-hui. Hakka Taiwanese politician and former president of the Republic of China.  Ne Win. Former head of state of Myanmar. Hakka Burmese.  Gaston Tong Sang. Former President of French Polynesia. Hakka French Polynesian.  Joseph Tsang Mang Kin. Hakka-Mauritian poet, philosopher and political scientist.  Arthur Chung. First President of Guyana. Hakka Guyanese.  Solomon Hochoy. First governor-general of Trinidad and Tobago. Hakka Trinidadian.  Hendrick Chin A Sen. Former President of Suriname. Hakka Surinamese. I actually met many Hakka Surinamese in Amsterdam.  Jimmy Choo. Hakka-Malaysian, UK-based fashion designer.  Vincent “Randy” Chin. Hakka-Jamaican record producer and founder of VP Records. Not to be confused with Vincent Chin, a Chinese American who was beaten to death in a racially-motivated hate crime in 1982 and became a rallying-point for the Asian-American community.  Patrick Soon-Shiong. American entrepreneur, philanthropist and billionaire. Wealthiest Asian-American in history. Born in South Africa to a Hakka Chinese family who later immigrated to the U.S.  Leslie Cheung. Super famous Hong Kong actor and singer.  Sean Paul. Jamican singer and rapper. His mother is of Chinese Jamaican descent. Nearly all Chinese Jamaicans have Hakka heritage.  ",
            "date": "Answered March 1, 2018",
            "views": "389",
            "upvotes": " View 210 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Foong Foong",
                    "user_href": "/profile/Foong-Foong"
                },
                {
                    "user_id": "Suzan Wong",
                    "user_href": "/profile/Suzan-Wong-1"
                },
                {
                    "user_id": "Grandy Fharose",
                    "user_href": "/profile/Grandy-Fharose"
                },
                {
                    "user_id": "Patrick Wu",
                    "user_href": "/profile/Patrick-Wu-35"
                },
                {
                    "user_id": "Paulina Ruiz",
                    "user_href": "/profile/Paulina-Ruiz-1"
                },
                {
                    "user_id": "Alex Dinh",
                    "user_href": "/profile/Alex-Dinh-2"
                },
                {
                    "user_id": "Chu ZiChung",
                    "user_href": "/profile/Chu-ZiChung"
                },
                {
                    "user_id": "David Cha-Kim",
                    "user_href": "/profile/David-Cha-Kim"
                },
                {
                    "user_id": "Vincent Chan",
                    "user_href": "/profile/Vincent-Chan-354"
                },
                {
                    "user_id": "Nazif G Mujtaim",
                    "user_href": "/profile/Nazif-G-Mujtaim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Sutton",
                "href": "/profile/Matthew-Sutton-3"
            },
            "answer_text": "Many of the leaders of the Taiping were Hakka, as was Sun Yat-sen and Deng Xiaoping.  Here's a Wikipedia link with a more comprehensive list at the end of notable Hakkas.Hakka people ",
            "date": "Answered January 21, 2014",
            "views": "52",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Ooi Wei Min (黄为民)",
                    "user_href": "/profile/Adam-Ooi-Wei-Min-黄为民"
                },
                {
                    "user_id": "Anthony Hansen",
                    "user_href": "/profile/Anthony-Hansen-12"
                },
                {
                    "user_id": "Jason Wu",
                    "user_href": "/profile/Jason-Wu-87"
                },
                {
                    "user_id": "Denis Ko",
                    "user_href": "/profile/Denis-Ko-1"
                },
                {
                    "user_id": "Ty Eng Lim",
                    "user_href": "/profile/Ty-Eng-Lim"
                },
                {
                    "user_id": "Kaiser Kuo",
                    "user_href": "/profile/Kaiser-Kuo"
                },
                {
                    "user_id": "Andy Lee Chaisiri",
                    "user_href": "/profile/Andy-Lee-Chaisiri"
                }
            ]
        }
    ]
}