{
    "title": "Who is the greatest living physicist and why? - Quora",
    "tags": [
        "Physicists",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zaheer Hassan Siddiqui",
                "href": "/profile/Zaheer-Hassan-Siddiqui"
            },
            "answer_text": "Professor Sara Seager, Astrophysicist, MIT! Sara Seager is an astrophysicist and planetary scientist at MIT. Her science research focuses on theory, computation, and data analysis of exoplanets. Her research has introduced many new ideas to the field of exoplanet characterization, including work that led to the first detection of an exoplanet atmosphere. Professor Seager also works in space instrumentation and space missions for exoplanets, including CubeSats, as a co-investigator on the MIT-led TESS, a NASA Explorer Mission to be launched in 2017, and chaired the NASA Science and Technology Definition Team for a “Probe-class” Starshade and telescope system for direct imaging discovery and characterization of Earth analogs. She thinks we might be able to find them within the next 20 years. In a new report in the journal Proceedings of the National Academy of Sciences, she argues that we may soon have the capability to detect life on other planets, a realization she calls \"The Awakening.\" Prof. Seager, 43, thinks there's something out there, \"just by the sheer numbers of planets,\" she says. \"Every astronomer knows that every star out there has at least one planet, and we have over 100 billion stars in the galaxy, and upward of hundreds of billions of galaxies in our universe.\" Prof. Seager is working with NASA to develop a \"Starshade\" to help block the light of stars so telescopes can better see exoplanets (planets outside our own solar system), which have become her specialty. The shade is a spherical disc with sharp points going around it, somewhat resembling a sunflower. She has a miniature, foot-long version of the 100-foot-diameter device, which is being designed to go up into space with a separate telescope at a total projected cost of $1 billion to $2 billion. The Starshade, which will have thrusters to move it into position, will help the telescope better see planets by blocking the light of nearby stars. NASA referred to her as \"an astronomical Indiana Jones\"!  Note - The above data has been taken directly from the following websites because I couldn’t find the best explanation anywhere else : https://eapsweb.mit.edu/news/2014/astrophysicist-search-ethttps://www.saraseager.com/professional-biography/",
            "date": "Answered April 23, 2018",
            "views": "64",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jigil Jigil",
                    "user_href": "/profile/Jigil-Jigil"
                },
                {
                    "user_id": "Bob Smith",
                    "user_href": "/profile/Bob-Smith-4930"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Arunav Sahay",
                    "user_href": "/profile/Arunav-Sahay-2"
                },
                {
                    "user_id": "Sergio Urias",
                    "user_href": "/profile/Sergio-Urias"
                },
                {
                    "user_id": "Holly May",
                    "user_href": "/profile/Holly-May-112"
                },
                {
                    "user_id": "Piyush Renuse",
                    "user_href": "/profile/Piyush-Renuse-2"
                },
                {
                    "user_id": "Pushpita Singh",
                    "user_href": "/profile/Pushpita-Singh-2"
                },
                {
                    "user_id": "Lu Kessler",
                    "user_href": "/profile/Lu-Kessler"
                },
                {
                    "user_id": "Marcus Kreider",
                    "user_href": "/profile/Marcus-Kreider"
                }
            ]
        },
        {
            "author_info": {
                "name": "Has Nurãyin",
                "href": "/profile/Has-Nurãyin"
            },
            "answer_text": "In my opinion, Edward Witten, at the Institute for Advanced Study at Princeton, is the greatest theoretical physicist alive today and I hope he eventually wins a Nobel Prize!  ​​​​He has made many theoretical advances in a number of areas including string theory, general relativity, the standard model of particle physics, super-symmetry and in basic pure mathematics.  In fact, he is the only physicist to ever win the Fields Medal (the mathematics equivalent of the Nobel Prize). In July 2012, he was an inaugural awardee of the Fundamental Physics Prize worth $3 million. An example of one of his bigger accomplishments is the development of M-Theory.  Before M-theory there were five different types of string theory in 10 dimensions and each of these five theories seemed to be completely different.  Witten discovered that the 11-dimensional M-theory (that he invented) reduces to each of the five different 10 dimensional string theories in different limits.  Thus the five string theories were all unified into M-theory. ",
            "date": "Answered July 1, 2016",
            "views": "92",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Graves",
                    "user_href": "/profile/Martin-Graves"
                },
                {
                    "user_id": "Jigil Jigil",
                    "user_href": "/profile/Jigil-Jigil"
                },
                {
                    "user_id": "Ferdaws S'f",
                    "user_href": "/profile/Ferdaws-Sf"
                },
                {
                    "user_id": "Joy Nto",
                    "user_href": "/profile/Joy-Nto"
                },
                {
                    "user_id": "Edward Ganap",
                    "user_href": "/profile/Edward-Ganap"
                },
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Stefano Pinato",
                    "user_href": "/profile/Stefano-Pinato"
                },
                {
                    "user_id": "Rafael Maia",
                    "user_href": "/profile/Rafael-Maia-15"
                },
                {
                    "user_id": "Robin Arora",
                    "user_href": "/profile/Robin-Arora-43"
                },
                {
                    "user_id": "Allen Cavalluzzi",
                    "user_href": "/profile/Allen-Cavalluzzi"
                }
            ]
        }
    ]
}