{
    "title": "Who are the richest families in the world in 2020? - Quora",
    "tags": [
        "Richest Countries",
        "Bill Gates",
        "Billionaires",
        "Demographics",
        "2020 (year)",
        "Wealthy People and Families",
        "Wealth",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saravanan",
                "href": "/profile/சரவணன்-Saravanan-1"
            },
            "answer_text": "1. Walton Family - Walmart Estimated Wealth: $190.5 billion  The Waltons are the richest family in America and by some measures the wealthiest clan in the world. At the top of the value chain, in 2019, Jim and Alice Walton are each worth more than $44 billion and ranked #16 and #17, respectively, on Forbes annual list of billionaires.2﻿ Walmart is a retail behemoth. Founded by Sam Walton in Arkansas in 1962, Walmart is now the world’s largest company, by 2019 revenues, with $514.4 billion, and over 1.5 million U.S. associates, according to its corporate website.3﻿ If those people constituted their own city, it would be the fourth most populous American city, after New York, Los Angeles, and Chicago. The company operates nearly 12,000 retail stores worldwide and 5,362 stores in the U.S., as of Aug. 2019.4﻿5﻿ Best known for big box stores in rural and suburban America celebrated for its low priced products, and excoriated for its labor practices, the company failed to bring its big-box consumer lifestyle to New York City, unlike its competitor Target. 2. Mars Family - Mars Estimated Wealth: $126.5 billion  Mars is the Walmart of candy: a multigenerational family business that is ubiquitous, cheap, and popular. Today the company is better known for making M&Ms than for its eponymous Mars bar. In 2017, the world’s largest candy company diversified with the purchase of VAC, a pet care company, for $9.1 billion.6﻿ Siblings Jacqueline and John Mars, whose grandfather Frank Mars founded the company, each has a net worth of $23.9 billion, tied for #33 in 2019 on the Forbes annual list of billionaires. The company is now being run by some of their children, the fourth generation of Mars family members.2﻿ Sweet! 3. Koch Brothers - Koch Industries Estimated Wealth: $124.5 billion  Charles and David Koch owe their staggering fortune to an oil business founded by their father, but today are perhaps better known to the general public for their politics, digging into their deep pockets to place their stamp on politics: financing candidates and libertarian think tanks, funding university professorships, and lobbying for policy positions, all aimed at furthering a conservative agenda. The brothers are worth an estimated $50.5 billion each, tied for the #11 spot on Forbes billionaire list.2﻿ 4. Al Saud - Saudi Royal Family Estimated Wealth: $100 billion  The House of Saud, the Saudi royal family has a monarchical history extending back nearly a century. The family's massive fortune, estimated at $100 billion, has grown thanks to decades of payments from the Royal Diwan, the king's executive office. Ties with Saudi Aramco, the world's most profitable company and a behemoth of the oil industry, ensure that the Saudi royal family continues to accumulate wealth. It's difficult to accurately assess the wealth of the House of Saud, in part because the family contains as many as 15,000 extended members, many of whom have founded businesses, received government contracts and more.1﻿ 5. Wertheimer Family - Chanel Estimated Net Worth: $57.6 billion  French high fashion house Chanel is legendary for the timeless “little black dress,” the No. 5 perfume, and the deceased, high-profile designer Karl Lagerfeld, who died on February 19, 2019. Brothers Alan and Gerhard Wertheimer now co-own the company that their grandfather staked with founder Gabrielle Coco Chanel. 6. Dumas Family - Hermès Estimated Wealth: $53.1 billion  French fashion house and luxury purveyor Hermès has dazzled the world with its signature scarves, neckties, and perfumes as well as its iconic Kelly and Birkin handbags. Back in the 19th century, Thierry Hermès fashioned riding apparel for the aristocracy. Today, the company adorns basketball royalty, LeBron James. Fusing old school and new technology, a line of Hermès Apple Watches sells for $1,300 to $2,000 and up apiece. Axel Dumas currently serves as the company's CEO and chairman, and Pierre-Alexis Dumas is the artistic director. 7. Van Damme, De Spoelberch and De Mevius Families - Anheuser-Busch InBev Estimated Wealth: $52.9 billion  These three Belgian brewers have a history in the beverage industry extending back more than 500 years. The Van Damme clan joined the efforts of the De Spoelberch and De Mevius families in 1987, when Piedboeuf and Artois merged to form Interbrew. Together, these three families have an estimated fortune of close to $53 billion. 8. Boehringer, Von Baumbach Families - Boehringer Ingelheim Estimated Wealth: $51.9 billion  Boehringer Ingelheim is a German pharmaceuticals company with more than 130 years of history. The Boehringer family, along with the Von Baumbachs, remain in control of the company several generations later. All told, these two families possess fortunes totaling just under $52 billion. 9. Mukesh and Anil Ambani - Reliance Industries Estimated Net Worth: $50.4 billion  Indian industrial conglomerate Reliance Industries, the only Asian company on our list, can be the least well known to average readers. Nevertheless, CEO Mukesh Ambani, whose late father founded the company in 1957, is #13 on Forbes 2019 list, overseeing the company’s refining, petrochemicals, oil, gas, and textiles; his brother Anil manages telecommunications, asset management, entertainment, and power generation.2﻿ Anil’s elder son, Anmol, is the executive director of Reliance Capital. 10. Cargill, MacMillan Families - Cargill Estimated Net Worth: $42.9 billion  Sixth-generation Cargill and MacMillan family members oversee Cargill Inc., among the largest closely held companies in the U.S. Cargill is a commodities giant that began in Iowa more than 150 years ago. With operations spanning industrial, agriculture and food products and services, the company is now based in Minneapolis. ",
            "date": "Answered December 4, 2019",
            "views": "244",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Salted Lamp",
                    "user_href": "/profile/Salted-Lamp"
                },
                {
                    "user_id": "BTSgurl SaranghaeBTS",
                    "user_href": "/profile/BTSgurl-SaranghaeBTS"
                },
                {
                    "user_id": "Jatin Maharao",
                    "user_href": "/profile/Jatin-Maharao"
                },
                {
                    "user_id": "Aditya Ram",
                    "user_href": "/profile/Aditya-Ram-47"
                },
                {
                    "user_id": "Sudhir Datta",
                    "user_href": "/profile/Sudhir-Datta-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Engineer-Ahmed"
                },
                {
                    "user_id": "Muraleedhara Bhat",
                    "user_href": "/profile/Muraleedhara-Bhat"
                },
                {
                    "user_id": "K Agrawal",
                    "user_href": "/profile/K-Agrawal-5"
                },
                {
                    "user_id": "Prabhu M",
                    "user_href": "/profile/Prabhu-M-97"
                },
                {
                    "user_id": "Sun Raman",
                    "user_href": "/profile/Sun-Raman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sisir Kshetrimayum",
                "href": "/profile/Sisir-Kshetrimayum"
            },
            "answer_text": "Sam walton family is the richest family of the world,Walton family after the death of Sam walton still operates the Walmart retail stores , the largest retail stores which employs more then 2 million people's of the world now in e-commerce too now owns 77 p/c shares of Flipkart which is the largest e commerce site created by indians and bill gates, Jeff Bezos ,Warren Buffett , mark Zuckerberg families are also the wealthiest families as now bill gates ,Warren Buffett , Jeff Bezos now divorced with her wife McKinsey who is now the 2nd richest woman of the world as he has 4 percent stake in Amazon all are in pledge a half a philanthropic investment which I appreciate a lot ,Jeff Bezos still is not in the foundation yet and in India the tata 's family ,Birla are one of the richest families with a long history in industrialization of India The Ambani's family are also the richest family in India particularly Mukesh Ambani as he is the richest Asian in the Forbes billionaire with about 40 billions dollars but anil Ambani still a billionaire is in downfall ,resign as a CEO of Rcom too ,and all his companies are in debt ridden and his wealth declines a lot while Mukesh is sky rocketting I don't know much about the Rothschild's families though some of them is in the Forbes billionaire but it is said they once have half the wealth of the world but without disclosing their wealth many politicians of India , former PM and others who hold higher position are also billionaire which have other offshore account as we topped the swish bank with all the black money mostly almost 99 p/c to me are from indian politicians and some indian celebrities too namely amitabh bachan , Aishwarya who all involved in the Panama case too Putin the Russian leader is said to be a billionaire and some thought maybe richer then Jeff Bezos or bill gates but don't know much about his wealth but I like his attitude,leadership as he is smart, tough , intelligent and qualified to be a leader a great leader but to me the greatest leader or a nation builder is Lee Kuan yew the man who transformed Singapore from a third world country with no assets to a first world country in 3 decades and still Singapore is on top in most of aspects of a nation and the health care system when compared with the superpower USA is way better with less spending from their GDP comparing with US and a debt free country Anyway India is now in low phase with the growth ,6th year low in GDP forecast for this quarter but am optimistic and will revive if the govt take necessary steps and will be on top maybe 2 or 3 decades later but let's see Edits are wellcome as am sleepy and writing it from my bed Goodnight quaran from a proud indian ",
            "date": "Answered December 5, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Himanshu Kansal",
                    "user_href": "/profile/Himanshu-Kansal-6"
                }
            ]
        }
    ]
}