{
    "title": "Who founded the British Empire? - Quora",
    "tags": [
        "Founders (general)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles McDevitt",
                "href": "/profile/Charles-McDevitt"
            },
            "answer_text": "You can make a very good case that it was all an accident! Take India as a general case. British traders needed land for warehouses and forts to protect them. So deals were done with local rulers for land on sites that became large trading ports. Those ports needed to be protected and have a hinterland to feed the troops required to garison the forts. All those spare, bored troops! Why not take advantage of local unrest, or have a pop at the French/Dutch/Portugese? Think of the profits/loot? And if you get beaten? Well cry for help from home and start a proper war. And then, after a while, a technique is developed that works very well elsewhere. There were other factors. America, lots of fur and spars and timber for the British navy. And sugar from the Caribbean. And - where do we dump convicts now that America is independent - lets take over Australia, nobody else wants it! ",
            "date": "Answered March 11, 2020",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jiten Budhiraja",
                    "user_href": "/profile/Jiten-Budhiraja"
                },
                {
                    "user_id": "Mike Barglow",
                    "user_href": "/profile/Mike-Barglow"
                },
                {
                    "user_id": "Ben Ali",
                    "user_href": "/profile/Ben-Ali-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Welch",
                "href": "/profile/Rob-Welch-29"
            },
            "answer_text": "I don’t think anyone person can claim to have founded the Empire. I believe it began during the reign of Elizabeth I (1558–1603) as the result of exploration by adventurers, followed by traders.. The earliest actual overseas settlements were not established till later in the 17th century. The rest as they ‘is history,’ ",
            "date": "Answered March 5, 2020",
            "views": "20",
            "upvotes": " Answer requested by Attendu Kihoulou"
        }
    ]
}