{
    "title": "Who has been the most important female detective? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wendy Saslow",
                "href": "/profile/Wendy-Saslow"
            },
            "answer_text": "There’s a few. Isabella Goodwin (b. February 20, 1865-Oct.26,1943.  The first female police officer hired for New York City police department turned detective. She was also Jewish, and was one of several who helped pave the way for women in law enforcement, which was especially not an easy task in a male dominated field in 1896, when age was hired by then police commissioner, Theadore Roosevelt, who hired as a jail matron for female prisoners. She applied after the passing of her husband. It paid only $1,000 per year. While she served in this position for 15 years, she did some undercover work catching psychic mediums, fortune tellers, etc who were trying to scam people out of money. Finally, in 1912, she was promoted to detective sergeant as a reward for solving a robbery. She was the first woman in NYPD to be promoted to this position. Later she would serve as assistant to the special deputy commissioner in charge of the women’s precinct. She eventually remarried and retired after 28 years of service.  Georgia Ann (Hill) Robinson (b. May 12,1879-September 21, 1961)  The first African American woman to be hired by Los Angeles Police Department officially in 1919, after she served as a volunteer since 1916. She worked primarily with juveniles and also homicides, and was an advocate for young women and referred them to various social agencies as needed. She even began the Sojourner Truth Home, a shelter for women and girls. Unfortunately, her career ended as she was injured by an inmate and lost her eyesight. She continued to serve her community.  Kate Warne (b 1833-January 28,1868)  In 1856, she became the first private detective and spy in the United States for the Pinkerton Agency. I worked for this agency myself. Her picture hung on the wall in our office. She helped to pave the way for women like myself! She was notorious for uncovering the 1861 Baltimore plot to assassinate then president-elect Abraham Lincoln. Baltimore Plot -Wikipedia  Alice Webbins Spells (b. June 13, 1873-August 17 1957)  Her first uniform, hand sewn herself, is on display at the Los Angeles Police Museum.  Sworn in on LAPD in 1910, Alice was then promoted to Sergeant in 1934. She was the official LAPD historian, even after she retired. She became the founder and president of the International Policewomen’s Association. She was responsible for other women being sworn in as officers both in the United States and abroad. Prior to that, they were only allowed to work with juveniles or watch female inmates. She wasn’t able to be armed initially, as no females were, but she was one of the first women to have the power to arrest perpetrators. “Contribution to modern female policing Due to Wells's advocacy for women's and children's rights, more women were recruited after the Equal Employment Opportunity Act of 1972 to undertake community policing assignments. This is due in part because policewomen were thought to be better at defusing potentially violent situations than policemen. (Courtesy of Wikipedia)Alice Stebbins Wells - Wikipedia  Lola G. Baldwin (b Aurora G.Baldwin 1860-d June 22, 1957)  First female officer in Portland, Oregon Superintendent of The Women’s Protective Division. Claim to fame is finding secure places for women to stay due to the influx of non resident criminals coming into Portland for the Lewis and Clark exhibition as they were afraid they would fall prey to them.  Penny Harrington (b.1942- )  She began her law enforcement career in Portland, Oregon in 1964, and was one of 12 women on that force. She was the first female to be appointed to Chief of Police in the United States. Portland, Oregon. However, no surprise here, 😡, a panel of three men appointed by then mayor, Bud Clark, resulted in her resigning in 1986, and she followed with a federal sex discrimination lawsuit against certain members of her department who embarrassed her relentlessly, and she felt that they were essentially forcing her to resign. In 1988, she became a special assistant to the California State Bar’s director of investigations. “ In 1995, she founded The National Center for Women & Policing with Katherine Spillar, Executive Vice President of the Feminist Majority Foundation. The NCWP aims to promote increasing the number of women throughout all ranks of law enforcement in an effort to improve police response to violence against women, as well as reduce police brutality and excessive force, and improve community policing reforms.“ Penny Harrington - Wikipedia  Some other sources:First Women Agents: Susan Roley Malone Interview | Federal Bureau of Investigation. Women in law enforcement - Wikipedia ",
            "date": "Answered October 21, 2019",
            "views": "15",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Ofenloch",
                    "user_href": "/profile/Patrick-Ofenloch"
                },
                {
                    "user_id": "Frank Jones",
                    "user_href": "/profile/Frank-Jones-321"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                },
                {
                    "user_id": "Emma-Leigh Haffey",
                    "user_href": "/profile/Emma-Leigh-Haffey-1"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Russell Allen",
                    "user_href": "/profile/Russell-Allen-5"
                },
                {
                    "user_id": "Sakshi Vikas",
                    "user_href": "/profile/Sakshi-Vikas"
                },
                {
                    "user_id": "Linda Strickland",
                    "user_href": "/profile/Linda-Strickland-47"
                },
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                },
                {
                    "user_id": "Shelley Stewart",
                    "user_href": "/profile/Shelley-Stewart-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Strickland",
                "href": "/profile/Linda-Strickland-47"
            },
            "answer_text": "There were several impressive female investigators. And, this may be a little “off track” but the first person that popped into my head was Dr G (Dr Garavaglia) the Pathologist. She has solved SO MANY unsolved deaths. Every victim deserves to have justice if they died in a suspicious manner. I Googled your question and a fairly long list of female investigators came back. You should check it out. I couldn't decide on just one. Good luck. ",
            "date": "Answered October 20, 2019",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alin Tod Atodiresei",
                    "user_href": "/profile/Alin-Tod-Atodiresei"
                },
                {
                    "user_id": "Wendy Saslow",
                    "user_href": "/profile/Wendy-Saslow"
                },
                {
                    "user_id": "Haley Mir",
                    "user_href": "/profile/Haley-Mir"
                }
            ]
        }
    ]
}