{
    "title": "Who had the best aircraft carriers in WW2? - Quora",
    "tags": [
        "Aircraft Carriers",
        "Aircraft",
        "World War II",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Billy Clement",
                "href": "/profile/Billy-Clement-2"
            },
            "answer_text": "The RN and the USN. For all the willie waving gits on this thread, please, just stop, you’re embarrassing yourselves! The British entered the War sooner and their shipyards were within range of their enemy. Their ability to replace losses was severely limited, their ability to repair extensive damage was likewise pretty poor. Luckily, the Brit carriers were astonishingly tough, shrugging off outrageous amounts of damage and continuing to fight. American style carriers wouldn’t have worked for them- they’d have been knocked out early and the fleet would have taken much heavier losses as a result. The Brits didn’t have a great naval fighter during the War, mainly due to needing to prioritise land based fighter production to deal with the lairy Saxon types bombing the shite out of the country. They did build some truly exceptional torpedo dive bombers, though. The Swordfish was carrying a surface search radar with a 60 mile range in 1940- the biplane design allowed her to fly in conditions that were out of limits to almost anything else that flew off a carrier in the 40s. She sank a greater tonnage of shipping than any other carrier borne torpedo bomber and was the most successful carrier borne anti-submarine aircraft of the War. And her successors were even better… The Americans didn’t have to worry as much about building or repairing ships, so went for astonishingly heavy air groups and mass produced carriers. It served them well, sinking the Japanese fleet and bombing the crap out of anywhere they tried to hide. Losses were heavy, but the USN could afford them. What mattered to American planners was hitting their target as hard as possible, often at ranges where a conventional land based raid was impractical. The Americans didn’t have much luck with torpedoes until relatively late in the War. It’s difficult to opine on the effectiveness of American strike aircraft when what should have been their most powerful weapon was horrendously ineffective for much of the actual fighting. There’s no arguing with the result of their mass air strikes, though. Dive bombing did the trick without the need for decent aerial torpedoes. American fighter designs were superb. The Hellcat proved itself capable against the latest, land based German types in RN service, as well as against Japanese aircraft in Allied and USN hands. The Corsair was a poor carrier aircraft, but an even better fighter and fighter bomber. The British, in spite of the impression given by overly jingoistic types on this thread, were and still remain extremely grateful for American help during the War and after it. Why there’s a big bun fight every time someone mentions the design decisions our respective navies take I’ll never know! ",
            "date": "Answered October 18, 2020",
            "views": "125",
            "upvotes": " View 269 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ben Werner",
                    "user_href": "/profile/Ben-Werner-18"
                },
                {
                    "user_id": "Jamie Duff",
                    "user_href": "/profile/Jamie-Duff-17"
                },
                {
                    "user_id": "Randy Atchley",
                    "user_href": "/profile/Randy-Atchley"
                },
                {
                    "user_id": "David Harris",
                    "user_href": "/profile/David-Harris-1104"
                },
                {
                    "user_id": "Arthur Jarrett",
                    "user_href": "/profile/Arthur-Jarrett-2"
                },
                {
                    "user_id": "Howard Sherman",
                    "user_href": "/profile/Howard-Sherman-7"
                },
                {
                    "user_id": "Mike Sparrowgrove",
                    "user_href": "/profile/Mike-Sparrowgrove"
                },
                {
                    "user_id": "Andrew Fortune",
                    "user_href": "/profile/Andrew-Fortune-14"
                },
                {
                    "user_id": "Steve Moore",
                    "user_href": "/profile/Steve-Moore-513"
                },
                {
                    "user_id": "Farmal Emta",
                    "user_href": "/profile/Farmal-Emta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Lund",
                "href": "/profile/Erik-Lund-1"
            },
            "answer_text": "Technology is fascinating. For example, how does anyone, at this late date, get a question like “Who had the best aircraft carriers in WW2” through the Quora “identical questions” filter? I seriously doubt that the OP, with over 10,000 questions to manage, carefully sculpts them to escape the syntax filter. More likely, there’s a bot skimming high-response questions, and then some . . thing modifies the question so that it will pass the filter. With the recent rash of Filipino student study questions, Ithink it’s just a Tagalog-to-English translation routine that produces mangled grammer through the magic of Google. In this case, I don’t know? I’m beginning to suspect that there’s a machine-readable-only hash out there. Ahem. I assume I’m supposed to give you a useful answer. Well, here’s your list of the best of the best: Carl Lewis (United States); Linford Christie (UK); Donovan Bailey (Canada); Maurice Greene (United States); Justin Gaitlin (United States); Usain Bolt (Jamaica.) Looks like the answer is “United States.” Oh, wait, no, that appears to the list of Olympic 100m winners from 1988 to 2008. Funny, how, from Olympics to Olympics, the best runner came from one country or another, although mostly from the world’s richest-by-most-populous country. It’s almost as though you can only answer this question by looking at each individual competitor in each year in which it competed, and that asking a question like, “Which country had the best aircraft carrier” or “which country has the best sprinters” is the kind of question that only people trolling for responses ask. Here are some earlier iterations of the question with answers that this question will unfairly push down the search return result: Which nation had the better aircraft carriers during WWII: Great Britain or the United States? Who built the best aircraft carriers during World War II: USA, UK or Japan? In conclusion, don’t feed the trolls. ",
            "date": "Answered October 22, 2020",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darren Lee",
                    "user_href": "/profile/Darren-Lee-63"
                }
            ]
        }
    ]
}