{
    "title": "Who is Maa Durga? - Quora",
    "tags": [
        "Durgā (Hindu Goddess)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddharth Singh",
                "href": "/profile/Siddharth-Singh-228"
            },
            "answer_text": " Maa Durga or Adi Parashakti or Maha Kali or Bhavani are the different names given to the same Divine Shakti. She is the consort of Shiv. Maa Durga represents Power or Shakti or Energy of the Universe. She is Prakriti or Mother Nature. She is depicted as female because in the natural world the female gives birth to her children and plays the role of a Mother. Maa Durga is Jagdamba or Mother of the whole universe. Shiv is the cosmos while Shakti is His Energy. She is the other half of Shiv, Ardhnareshwar. Maa Durga is depicted to have 8 or 10 arms, each hand carrying a weapon or sacred item. Her vaahan or vehicle is a Tiger or Lion. Tiger represents unlimited power while Lion represents beastly desires. Her riding on a lion depicts She has conquered all beastly desires. She is the force/ energy behind Kundalini, the dormant energy coiled like a serpent at the base of the spine of every human. Maa Durga has 9 forms or avatars, known as NavDurga. She also has 10 other divine forms of Vidya or knowledge, known as Dus Mahavidyas. She in her Katyayani form (the 6th form in NavDurga) slayed the notorious and mighty buffalo demon Mahishasura. This earned her the famous epithet Mahishasura Mardini, meaning slayer of Mahishasura.  Maa Durga Mahishasura MardiniMahishasura had obtained a boon from Lord Brahma after hard penance that no male God or Deva / deity no matter who it is can slay him. He misused this boon and conquered the Devloka or Kingdom of Gods and dethroned Indra from his reign. He created havoc in the three worlds. All the Devas went to the Trinity, Shiv, Vishnu, Brahma for help. The Trinity and other Devas combined their powers and gave them to Parvati, wife of Shiv. She then transformed into a form mightier than any God or Goddess. She transformed into Mother Durga. According to legends it is said that Maa Durga is not only the form that Parvati took after having received the combined powers from all Gods and The Trinity but that She is beyond everything, beyond all space and time. She is the Divine Source of Energy from which everything, including the Trinity Gods took birth. Her smile created the Universe and her Wrath can annihilate the Universe. She is the End and She is the Beginning. Hence the name Adi Parashakti. Maa Durga is one of the original manifested forms of Adi Parashakti, the others being Sati and Lalita Tripura Sundari. Maa Durga slayed the wicked demons Shumbh and Nishumbh and Chand and Mund in her Kali or Maha Kali form. Her skin turned black and tongue turned blood red. She wore a garland of severed heads and skulls of demons that She slayed. Once after slaying a wicked demon named Raktbeej (so named because this demon would replicate himself everywhere his blood fell), Maa Kali became so angry that She was about to destroy the whole Universe. To calm the situation, Lord Shiv laid Himself down on the ground before Her. Accidentally She stepped on Shiv's body and this made Her feel a sense of shame (since Shiv is Her consort and She has nothing but pure love for Him). This made Her stick Her bloody red tongue out.  Maa Kali standing on Shiv with her tongue out.Maa Kali is supposed to represent the Raw power of Nature. She is linked with Dark Matter and Dark Energy, the energy that is currently one of the reasons of the continuous expansion of the Universe. Maa Maha Kali is one of the Ten Mahavidyas. She is beyond time and the consort of Mahakaal (one of the most powerful manifestations of Lord Shiv). Maa Kali emerges when Maa Durga turns wrathful. However beneath all the horror and rage is a Mother, is Mother Durga.  Beyond all the rage is the beautiful Motherly Maha KaliMaa Durga is often connected to Fire and also called Jwala or Jyotawali Maa (Mother of Divine Flame or Fire). As mentioned before, She is Mother Nature Herself.  The eternal flame of Maa Durga in the form of Jwala at Jwalaji Temple, Himachal Pradesh, India. One of the 51 ShaktipeethsThe Shaktipeeths are divine spots dedicated to Maa Durga. Sati immolated Herself when her father Daksha did not accept Her love for her husband Mahadev (Shiv). Shiv turned wrathful and lost all control. He carried Sati's burned body around in the heavens. Nobody was able to console Him. Then Lord Vishnu with His Sudarshan Chakra tore Sati's body into 51 different parts in order to calm Lord Shiv’s sorrow down. The 51 body parts fell at different places in Bharat. Those sites came to be known as Shaktipeeths. One of the most famous powerful manifestations of Maa Durga is Maa Vaishno Devi.  Maa Vaishno Devi……Maha Saraswati, Maha Lakshmi, Maha Kali (left to right)Maa Durga is beyond all explanation. She is Karma. She is Mahamaya (the great illusion). She is Moksha (enlightenment). You need to feel Her power, Her Divine Love by being not only Her devotee but Her Divine child. Have faith in Her like you have faith in your Mother. Mother's love surpasses every hate, everything negative. I tried my best to explain you as much in general as I can. However there is much more. Navdurga and Mahavidyas are basically forms of Maa Durga. However each form has a Divine cause of its own. You can read about it if you want to. May Maa Durga drive out the darkness from our lives and lead us to The Truth. To Moksha. Sab moh maya hai. Jai Mata Di. ॐ शिव शक्ति ",
            "date": "Updated September 28, 2018",
            "views": "436",
            "upvotes": " View 111 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shatabdi Barman",
                    "user_href": "/profile/Shatabdi-Barman-1"
                },
                {
                    "user_id": "Bhoomi Prajapati",
                    "user_href": "/profile/Bhoomi-Prajapati-11"
                },
                {
                    "user_id": "Veer Kumar",
                    "user_href": "/profile/Veer-Kumar-63"
                },
                {
                    "user_id": "Mahesh Kamuni",
                    "user_href": "/profile/Mahesh-Kamuni"
                },
                {
                    "user_id": "Sourabh Kumar",
                    "user_href": "/profile/Sourabh-Kumar-718"
                },
                {
                    "user_id": "Rashmi Rati",
                    "user_href": "/profile/Rashmi-Rati-3"
                },
                {
                    "user_id": "J Gautam",
                    "user_href": "/profile/J-Gautam-3"
                },
                {
                    "user_id": "Preetham Chandra",
                    "user_href": "/profile/Preetham-Chandra"
                },
                {
                    "user_id": "Ghon Complex",
                    "user_href": "/profile/Ghon-Complex"
                },
                {
                    "user_id": "Swapna Pillai",
                    "user_href": "/profile/Swapna-Pillai-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "[Inactive]Shree Keshava",
                "href": "/profile/Inactive-Shree-Keshava"
            },
            "answer_text": "It is stupidity to even think to describe her in words. Because words are finite and she is infinite! She is the ultimate nature,  She is bliss, and what is not bliss, She is the science, and what is not scientific,  She is Brahma’s Brahmani, She is Brahma’s shakti,  She is Brahma Swaroopini, there is no difference between she and Brahma, She is the elemental, and non elemental of the universe,  She is the essence of the Vedas, and which is not vedas, She is the whole universe,  She is Vidya, and also Avidya, She is, who is born and unborn,  She is above,behind, and ahead of everything of universe and universes beyond, She is the destroyer of evil, who was personified as Mahishashura,  He(Mahishashura) grew outwardly, and was at a great threat to her children(us) and the universe, She thus took form of Shakti of all devas and slayed Mahishashura, hence she is called Mahishashura Mardini.  Here is english translation of 'Mahishashura Mardini'. Hope you will understand her better: Victory and victory to you , Who enjoys in being happy, Who looks after the three worlds, Who pleases lord Shiva, Who removes effect of sins, Who rejoices with the holy sound, Who is angry on the progenies of Dhanu, Who is angry with the children of Dithi, Who discourages those with pride, Who is the daughter of the Ocean, Who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh , mother of the entire world, Who loves to live in the forest of Kadambha trees, Who enjoys to smile, Who lives in the top peak of the great Himalayas Who is sweeter than honey, Who keeps the treasures of Madhu and Kaidabha, Who is the slayer of Kaidabha, Who enjoys her dancing, Who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess who breaks the heads of ogres, In to hundreds of pieces, Who cuts the trunks of elephants in battle, Who rides on the valorous lion, Which tears the heads of elephants to pieces, Who severs the heads of the generals of the enemy, With her own arms, Who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess who has the strength which never diminishes, To gain victory over enemies in the battle field, Who made Pramatha, the attendant of Lord Shiva, Known for his tricky strategy, as her assistant, Who took the decision to destroy the asuras, Who are bad people, with evil thoughts and mind, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh, Goddess who blew away hundreds of ogres, Who had smoking eyes, With her mere sound of “Hum” Oh Goddess who is the blood red creeper, Emanating from the seeds of blood, Which fell in the battle field, Oh Goddess who delights in the company of Lord Shiva, And the ogres Shumbha and Nishumbha, Who were sacrificed in the battle field, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess who decks herself with ornaments, On her throbbing limbs in the field of battle, When she gets her bow ready to fight, Oh Goddess , who killed her enemies, In the field of battle with a shining sword, And the shaking of her golden brown spots, Oh Goddess , who made the battle ground of the four fold army In to a stage of drama with screaming little soldiers, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess , whose victory is sung, By the whole universe, Which is interested in singing her victory, Oh Goddess who attracts the attention of Lord Shiva, By the twinkling sound made by her anklets, While she is engaged in dancing, Oh Goddess who gets delighted , By the dance and drama by versatile actors, Even while she is half of Lord Shiva’s body, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess of the people with good mind, Who is greatly gracious to such people, Oh Goddess who appears very pretty to the good minded, Oh Goddess with moon like face, Who is as cool as the moon ,to those in the dark, Oh Goddess whose face shines in the moon light, Oh Goddess whose very pretty flower like eyes attracts the bees , Oh Goddess who attracts devotees, like a flower which attracts bees, Oh Goddess who attracts her lord like a bee, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess who becomes happy, In the sport of battle, assisted by warriors, Oh Goddess who is surrounded by hunters, Whose hut is surrounded by creepers, And the tribes of Mallikas, Jillakas and Bhillakas, Oh Goddess who is as pretty as The famous fully opened flower, Oh Goddess , who is as pretty as the creeper, Full of red tender leaves, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess , who walks like a royal elephant in rut, In Whose face there is a copious flow of ichors, Oh Goddess , who is the daughter of the ocean of milk, From where the pretty moon also took his birth, Oh Goddess who is the ornament of the three worlds, Oh Goddess who is worshipped by the God of love, Who fills the minds of pretty ladies with desire, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess , whose spotless forehead, Which is of delicate prettiness, Is like pure and tender lotus leaf, Oh Goddess who moves like the spotlessly pretty swans, Which Move with delicate steps, And which is the epitome of arts,, Oh Goddess ,Whose tress is surrounded By bees from bakula trees, Which normally crowd the tops of lotus flowers, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess with sweet tender thoughts, Whose sweet enchanting music, Made through the flute in her hands, Put the sweet voiced nightingale to shame, Oh Goddess who stays in pleasant mountain groves, Which resound with the voice of tribal folks, Oh Goddess, whose playful stadium, Is filled with flocks of tribal women, Who have many qualities similar to her, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh goddess, who wears yellow silks on her waist, Which has peculiar brilliance , That puts the moon to shame, Oh goddess, whose toe nails shine like the moon, Because of the reflection of the light, From the crowns of Gods and asuras who bow at her feet, Oh Goddess whose breasts which challenge, The forehead of elephants and the peaks of golden mountains Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess , whose splendour , Defeats the Sun with his thousand rays Oh Goddess , who is saluted by the Sun, Who has thousands of rays, Oh Goddess who was praised, By Tharakasura after his defeat, In the war between him and your son, Oh Goddess who was pleased with King Suratha, And the rich merchant called Samadhi, Who entered in to Samadhi, And who prayed for endless Samadhi, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Oh Goddess, in whom mercy lives, And who is auspiciousness itself, He who worships thine lotus feet, Daily without fail, Would for sure be endowed with wealth, By that Goddess who lives on lotus, And if I consider thine feet as only refuge, Is there anything that I will not get, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, He who sprinkles the water of the ocean, Taken in a golden pot , on your play ground, Oh Goddess will get the same pleasure , Like the Indra in heaven, when he fondles, The pot like breasts of his wife Suchi, So I take refuge in thine feet Oh Goddess, Which is also place where Shiva resides, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, He who keeps thine face adorned by moon, In his thought would never face rejection, By the bevy of pretty beauties with moon like face, In the celestial Indra’s court, And so oh Goddess who is held in esteem by Shiva, I am sure you would not reject my wishes, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  Victory and victory to you, Oh darling daughter of the mountain, Please shower some mercy on me, As you are most merciful on the oppressed. Oh mother of the universe ,be pleased, To give me the independence , To consider you as my mother And do not reject my prayer even if it is improper, But be pleased to drive away all my sorrows, Oh Goddess who has captivating braided hair, Who is the daughter of a mountain. And who is the slayer of Mahishasura.  JAI MAA DURGA🙏 ",
            "date": "Updated October 6, 2020",
            "views": "323",
            "upvotes": " View 183 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Kapoor",
                    "user_href": "/profile/Vishal-Kapoor-32"
                },
                {
                    "user_id": "Milind Kulkarni",
                    "user_href": "/profile/Milind-Kulkarni-71"
                },
                {
                    "user_id": "Abhijata Chanda",
                    "user_href": "/profile/Abhijata-Chanda"
                },
                {
                    "user_id": "Satyanarayana Arvapalli",
                    "user_href": "/profile/Satyanarayana-Arvapalli"
                },
                {
                    "user_id": "Rachit Kumar",
                    "user_href": "/profile/Rachit-Kumar-265"
                },
                {
                    "user_id": "Totaram Persaud",
                    "user_href": "/profile/Totaram-Persaud"
                },
                {
                    "user_id": "Barkha Bairwa",
                    "user_href": "/profile/Barkha-Bairwa-1"
                },
                {
                    "user_id": "Daniel Aung",
                    "user_href": "/profile/Daniel-Aung-1"
                },
                {
                    "user_id": "J Gautam",
                    "user_href": "/profile/J-Gautam-3"
                },
                {
                    "user_id": "Sattwik Biswas",
                    "user_href": "/profile/Sattwik-Biswas-7"
                }
            ]
        }
    ]
}