{
    "title": "Who has been the best German Chancellor since 1945? - Quora",
    "tags": [
        "German Chancellor",
        "Politics of Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Kannemacher",
                "href": "/profile/Jan-Kannemacher"
            },
            "answer_text": "I'm going with Helmut Schmidt. While Willy Brandt doubtlessly did much for better relations especially with the former Warsaw Pact states, he was always too heavy on the pathos for my liking. Schmidt on the other hand was considered a cold fish by many, but in my opinion had the sharpest intellect and best grasp of national/international affairs of all German chancellors. Comparing Schmidt to his direct successor Helmut Kohl still makes me want to scream, what with Kohl being one of the most provincial, narrow-minded politicians to ever reach a high office in Germany. Also, I have always enjoyed Schmidt appearing on TV in the decades after he left office, being sought after as elder statesman with interesting insights. He smoked like a chimney, and would not come to any interview or talkshow if he wasn't provided with an ashtray, that was part of the deal. So much fun to have part of the country go up in flames about \"that rude old fart\" every time. ",
            "date": "Answered November 25, 2017",
            "views": "321",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "David Jonathan Gudlaugson",
                    "user_href": "/profile/David-Jonathan-Gudlaugson"
                },
                {
                    "user_id": "Bernard Doyle",
                    "user_href": "/profile/Bernard-Doyle"
                },
                {
                    "user_id": "Benjamin Knupper",
                    "user_href": "/profile/Benjamin-Knupper-1"
                },
                {
                    "user_id": "Kelly Cavanagh",
                    "user_href": "/profile/Kelly-Cavanagh-1"
                },
                {
                    "user_id": "Jan Krusat",
                    "user_href": "/profile/Jan-Krusat"
                },
                {
                    "user_id": "Iskender Sonmez",
                    "user_href": "/profile/Iskender-Sonmez"
                },
                {
                    "user_id": "Scott Lockwood",
                    "user_href": "/profile/Scott-Lockwood"
                }
            ]
        }
    ]
}