{
    "title": "Who was the first Muslim? - Quora",
    "tags": [
        "Muslims",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Salman Khan",
                "href": "/profile/Salman-Khan-1842"
            },
            "answer_text": "Either Muhammad or his wife Khadijah! If Muhammad actually believed in what he was preaching, then he was by definition the first Muslim. If however, we are talking about the first person to accept Islam when Muhammad started telling others about it, then the answer is his wife Khadijah [1]. I’ve heard Muslims say that Abraham or even Adam was the first Muslim. If we want to use that kind of reasoning, then nothing makes sense anymore. For example, what if I start a new religion where we worship snakes. Let’s call it Bislam. Let’s call the followers of my religion Buslims. What if I say now that Muhammad was a Buslim. Does it make him a Buslim? I’d suspect that virtually every Muslim will point out that me claiming he was a Buslim doesn’t make him a Buslim. In the same sense, Muhammad claiming the Jewish or Christian prophets/religious figures to be Muslims don’t make them Muslims. Why the double standard? References: [1] Guillaume. The Life of Muhammad. Oxford. p. 111. ",
            "date": "Updated April 19, 2017",
            "views": "26",
            "upvotes": " View 96 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David McCormick",
                    "user_href": "/profile/David-McCormick-97"
                },
                {
                    "user_id": "Golam Rabbi",
                    "user_href": "/profile/Golam-Rabbi-60"
                },
                {
                    "user_id": "Shinichi Nero",
                    "user_href": "/profile/Shinichi-Nero"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Pritesh Gaur",
                    "user_href": "/profile/Pritesh-Gaur"
                },
                {
                    "user_id": "Tamara Wilhite",
                    "user_href": "/profile/Tamara-Wilhite"
                },
                {
                    "user_id": "Ambuj Priyadarshi",
                    "user_href": "/profile/Ambuj-Priyadarshi"
                },
                {
                    "user_id": "Rishabh Singh Bhadauria",
                    "user_href": "/profile/Rishabh-Singh-Bhadauria"
                },
                {
                    "user_id": "Aswin Manoj",
                    "user_href": "/profile/Aswin-Manoj-4"
                },
                {
                    "user_id": "Jeff Hoefs",
                    "user_href": "/profile/Jeff-Hoefs-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashmede Asgarali",
                "href": "/profile/Ashmede-Asgarali"
            },
            "answer_text": "What is a Muslim? One who submits to Allaah! So that would probably be the very first creation! The nothingness before the big bang? Allaah has said that every thing including your shadow prostrates to Him. So one would imagine that the first Muslim was the first thing created! Then there were perhaps the first angel and first jinn and first living thing, whether bacteria or virus or whatever! Then the first man and woman both submitted to Allaah, they may have been the first human Muslims. Of course, if the Shahadah is the measurement of the first Muslim, that may mean Muhammad because the Shahadah is that there is no god but Allaah and Muhammad is His messenger. Now it is quite possible that the Shahadah existed from the beginning of time as Allaah knew that Muhammad would be His messenger and thus the first Muslim would be whatever animate or inanimate object that submitted to Allaah with the Shahadah. If, however, the first Muslim was not Adam and not until the Shahadah was there mention of Muhammad, then it is possible that Muhammad was the first Muslim. There is no proof of this if I recall correctly. I would go with the thought that the shahadah may have existed since the beginning of Creation, but the truth is that only Allaah knows of this for sure. Was Adam or Abraham or Noah or Moses the first? Again, Allaah asks in Qur-aan to ask mankind to ponder on whether Abraham was a Christian or a Jew. Apparently he was neither! Allaah refers to hm as a believer and a ‘friend of Allaah.” So perhaps the answer may be Muhammad if the Shahadah came into existence when Muhammad became a messenger. If not, it could have existed since time immemorial and the first Muslim can be found there as something in the nothingness of time and space! ",
            "date": "Updated May 4, 2017",
            "views": "448",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faizaan Noor",
                    "user_href": "/profile/Faizaan-Noor"
                },
                {
                    "user_id": "Ary Himawan",
                    "user_href": "/profile/Ary-Himawan-1"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                }
            ]
        }
    ]
}