{
    "title": "Who was smarter, Joseph Stalin or Adolf Hitler? - Quora",
    "tags": [
        "Joseph Stalin",
        "Success",
        "Adolf Hitler",
        "Smart People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "By raw IQ, Hitler, by far. We do not know the IQ of either, but we do know those of the Nazi leaders (measured at Nürnberg), and it can safely claimed it was higher than what any of the Nazi leaders possessed. Here are the IQs of the Nazi leaders (Wechsler scale): 1 Hjalmar Schacht 143 2 Arthur Seyss-Inquart 141 3 Hermann Goering 138 4 Karl Doenitz 138 5 Franz von Papen 134 6 Eric Raeder 134 7 Dr. Hans Frank 130 8 Hans Fritsche 130 9 Baldur von Schirach 130 10 Joachim von Ribbentrop 129 11 Wilhelm Keitel 129 12 Albert Speer 128 13 Alfred Jodl 127 14 Alfred Rosenberg 127 15 Constantin von Neurath 125 16 Walther Funk 124 17 Wilhelm Frick 124 18 Rudolf Hess 120 19 Fritz Sauckel 118 20 Ernst Kaltenbrunner 113 21 Julius Streicher 106 Note that this pretty much also reflects the pecking order of the Nazi leaders. Note also that higher one’s IQ was, the more likely he was to avoid noose. Everyone considered Streicher a dullard and a dumb brute. In a company like that, he indeed was. So it can be safely claimed Hitler had an IQ of over 140, perhaps 145. The fact Hitler had far better understanding on logistics (albeit not of strategy) than his generals, is a thing to be noted. Everyone around Hitler considered him a genius. Evil one, but still. See Was Adolf Hitler a Genius? Note also that only high IQ people are able to also commit colossal mistakes and blunders lesser endowed cannot even dream of. Note also that tertiary syphilis certainly don’t make things any easier - or better. It is a thing which really puts one beyond good and evil. Stalin’s IQ was likely to have been 125 to 130 - high, but not genius level. Everyone around him considered him to be very pedestrian by intelligence and paranoid as heck, but a master organizer, a master networker, extremely charismatic and indefatigable worker. What he lacked in inspiration he simply put up with perspiration. Stalin simply outmanoeuvred by anyone more intelligent than him by allying against them - and then getting rid of the former allies as well. His immense charisma made him appear a genius at first, but those who really knew him saw but a thug who was completely unpredictable. But by performance, Hitler played poker while Stalin played chess. In chess, you do not win your game by your cards, cojones and skill alone. You win it by cooperation and manipulating your opponents and coordinating your moves. Stalin had lower raw IQ than Hitler, but Stalin was a master manipulator. And that is what really counts. Already Lenin considered him dangerous and put him in in position where he thought he could cause least damage - as the general secretary of the Party. Wrong move - As the general secretary he managed to create a crony network and gain access to any information he wanted. As a hardcore Marxist, Stalin knew the value of story and narrative. He was a master on fabricating stories. He built castles in the air and collected the rent from people who voluntarily inhabitated them. Lying, deception and fraud are an integral part of politics, and Stalin mastered them all. Stalin moved all his opponents around like chess pieces - without them realizing they really were but chess pieces. Stalin committed colossal mistakes, he did enormous stupidities and he almost single-handedly caused USSR to collapse. But he managed to get all those blunders covered up - and even his disasters to appear like great successes. Marxism is a fraud based by lie and fuelled by deception, and Stalin was a master. He was so thorough liar that in the end nobody really had an idea what was the truth. This complete obfuscation of reality and truth is what made Stalin so successful. Stalin created a personality cult while Hitler was more a recluse, an ascetic, a chaste and vegetarian leader. It was this personality cult which was one of the keys of his success. By his personality cult he was able to bluff the Western leaders thinking he was sincere and reliable, and he played Mao and Kim il Sung like a fiddle. He masterfully manipulated China into committing stupidities and harvested the fruits. The only two leaders Stalin could not manipulate were J.K. Paasikivi of Finland and Josip Broz Tito of Yugoslavia. Mainly because USSR were not an ally of either in WWII nor could conquer them (Finland retained her independence while Yugoslavia liberated herself alone.) Paasikivi was a rock-hard Realpolitiker while Tito was a field marshall. My own analysis would be that Hitler was a narcissist but Stalin was a psychopath. Hitler committed just the kind of errors a narcissist would, no matter how intelligent. Stalin’s errors, however, were disastrous but he ruthlessly crushed all criticisms and he ruled with terror; he refused to recognize any errors and instead lied to the world of his disasters as great successes. Hitler, as a narcissist, wanted to rule a nation of supermen; Stalin, as a psychopath, wanted to rule a nation of slaves. In the end Stalin remained as the victor, and to the victor go the spoils. Only the afterworld has revealed what kind of a genocidal tyrant he really was. But politics are an art of deception and fraud. Stalin was master on both. ",
            "date": "Updated July 27, 2019",
            "views": "467",
            "upvotes": " View 669 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mega Mombutu",
                    "user_href": "/profile/Mega-Mombutu"
                },
                {
                    "user_id": "John Houston",
                    "user_href": "/profile/John-Houston-52"
                },
                {
                    "user_id": "Dan Petre",
                    "user_href": "/profile/Dan-Petre-1"
                },
                {
                    "user_id": "Luis Martinez",
                    "user_href": "/profile/Luis-Martinez-1419"
                },
                {
                    "user_id": "Chakrakut Shah",
                    "user_href": "/profile/Chakrakut-Shah"
                },
                {
                    "user_id": "Serhii Tkachenko",
                    "user_href": "/profile/Serhii-Tkachenko-1"
                },
                {
                    "user_id": "Bob Mcardy",
                    "user_href": "/profile/Bob-Mcardy"
                },
                {
                    "user_id": "Liam Abir",
                    "user_href": "/profile/Liam-Abir"
                },
                {
                    "user_id": "Isaac Lung",
                    "user_href": "/profile/Isaac-Lung-6"
                },
                {
                    "user_id": "Austin Duong-Van",
                    "user_href": "/profile/Austin-Duong-Van"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Campbell",
                "href": "/profile/Jonathan-Campbell-49"
            },
            "answer_text": "On paper, at least, Jospeh Stalin was vastly, VASTLY more intelligent than Adolf Hitler, or at least had a much more impressive education, academic record, and list of intellectual achievements. Leon Trotsky painted Stalin as a boring bureaucratic type of above-average intellect at best, but he never really knew the real man all that well. Both Stalin and Hitler as dictators would portray themselves as peerless geniuses, but unlike Hitler, Stalin had the credentials to back that claim up, exaggerated though it may be. Young Stalin was a voracious reader (even stealing books from other students just so he could read them), who wrote poetry in his spare time, even getting some published in a national newspaper and anthologies under the pseudonym “Soselo”. He read pretty much anything he could get his hands on- be it science, politics, poetry, drama, fiction, whatever- and this habit continued throughout his life, with one biographer saying he might well be the best read Russian leader since Catherine the Great (better read than Lenin). He was also a professional editor, writer and critic. He knew his native Georgian and Russian, and possibly/ probably knew German and maybe French. Young Hitler read a lot too and devoured his fathers books on military history in particular, but while he continued to read through his life at some point he started to develop some very bad habits that he was unwisely boastful of- reading what was “useful” to him and discarding the rest, memorising passages from other writers and impressing people with his (admittedly excellent) memory or sometimes passing off the opinions of others as his own (when caught by his secretary, he defended himself by claiming that everyone does it). He literally thought people who read to learn new stuff were fools. As dictator he had a vast library of hundreds of thousands of books, but the majority of them were (understandably) unread; a lot of the stuff that was read was vile, racist quackery or pseudo-scientific / pseudo-spiritualist writings that he half-believed, half-deemed “useful”. Other stuff he read concerned (mostly German) history, philosophy, art, architecture and music, but beyond his love of dollar store Wild West comics he hardly ever read any fiction, nor much science or anything to do with other cultures. He spoke no language other than German and didn’t want to learn any either, possibly out of intellectual insecurity as much as anything else. Joseph Stalin attended a Spiritual Seminary school for training to be a priest, doing so on a scholarship on the strength of prior academic performance. He excelled in nearly every subject and only failed to graduate because he dropped out, which he only did because he had secretly been reading Marx and other banned (and not banned) writings in his spare time and had become an atheist (his grades had started to drop, but this appeared to be due to disinterest rather than inability). While he could be a violent bully and a troublemaker, he was generally considered amongst the smartest and most outstanding pupils of his year. Hitler attended two secondary schools in Austria; he went to the second only because he was effectively expelled from the first for a combination of bad behaviour and bad grades. He would do badly in this new school as well and would drop out before completing his term, allegedly using his final school report as toilet paper. He enjoyed History but the one and only subject he showed any merit in at all was art, and even here his grades were somewhat average. His teachers regarded him as lazy and annoying, though they conceded he might have some hidden talents he wasn’t bothering to reveal to them. In fairness to Hitler, it is likely that he was suffering from depression at this point as his (abusive) father had died, his younger brother earlier, and the new school he was attended was miles from home and he had to walk to and from every day; by his own admission he was basically sabotaging his own education because of how miserable he was. Even so, as far as school grades go, Stalin unquestionably did better and received a higher quality of education overall. After leaving school, Stalin got work as a meteorologist and became more and more involved in revolutionary activities, teaching Marxist theory to workers and co-organising strikes and protests , all the while evading the police and joining the Georgian branch of the revolutionary Russian Social Democratic Labour Party, the one Lenin and Trotsky belonged to, eventually siding with Lenins Bolshevik faction when the party later split. He was arrested for his activities and exiled to Siberia, but he eventually managed to escape. From 1905 onwards he became involved in gangster activity and violent crime- robbery, murder, protection rackets, kidnapping children for ransom etc.- in order to raise funds and resources for the Bolsheviks. He was also editing Bolshevik newspapers and engaging in party politics at this time as well. Hitler meanwhile was failing to get into art school (after expecting and failing to win a local lottery back home), running out of funds from home while living in Vienna and eventually spent a year living on the streets, before a fellow vagrant learnt he had artistic talents and convinced him to team up and sell forgeries of postcards and other paintings (Hitler claimed to have also done a stint as a construction worker at some point during this time, but this is unsubstantiated and might have been a lie to show off his anti-Marxist cred since he claimed everyone eventually turned on him for not being a Marxist). He and his buddy managed to raise enough money to live in a mens hostel with some other associates before he and Hitler had a falling out and Hitler struck out on his own, making a modest living selling paintings to regular clients including Jews. His political activities were limited to listening to speeches and debates by Austro-Hungarian politicians and getting into heated arguments / shouting contests with other, more left-leaning tenants (and prior to that, other vagrants on the street). As at school he was frequently lazy and often didn’t paint unless the “mood” took him, instead spending a lot of time visiting museums, cafes’ and attending he opera, and boring his associates with his long-winded and repetitive reviews and critiques of the productions he saw. He eventually fled Vienna for Munich to avoid conscription, and after being tracked down anyway manage to blab his way out of it by writing to them and convincing them he was medically unfit for duty. He later signed up for WW1 as a German officer, since he loved Germany and hated Austria-Hungrary. During the war, in his spare time he mostly read newspapers and painted in his spare time, and absorbed the prejudices of his Prussian officer superiors. The closest thing Hitler had to an undergraduate education was after the war, when he joined the propaganda department of the German army and was required to attend political classes that cover topics ranging from History to Economics as well as obviously Politics and Propaganda; these were roughly equivalent to first-year at university, and while he did well they were also very definitely biased and one-sided, every teacher being far-right in one shape or another. Prior to this he had gotten some training as a propagandist while working for the short-lived Marxist republic of Bavaria (something he covered up) and taught propaganda classes there. He was, in other words, heavily exposed to and influenced by far-left and far-right propaganda just prior to joining the Nazi party, and it influenced his thinking. After joining he was mentored by co-founder Anton Drexler, a playwright and journalist who encouraged him to read German philosophers like Fichte, Nietzsche (who Hitler wasn’t impressed with), and Schopenhauer (whom Hitler loved, though he may or may not have read him already), as well as writings by racists and anti-Semites like Houston Stewart Chamberlain and their own Alfred Rosenberg. Stalin, by this point, was already in power and although Trotsky downplayed his role, he was actually quite important during the Bolshevik Revolution in an organisational / background role sort of way. He served as editor of Pravda for a time and later at Lenin's direction basically wrote up the Party's official policy towards different ethnic groups in Greater Russia, being seen as something of their highest-ranked expert on the subject due to being Georgian. He proved to be a less-than-competent military commander during the Russian Civil War but once Lenin died he managed to become leader of the Party through, essentially, being a better and more devious politician than Trotsky was (helped by other Bolsheviks not liking Trotsky all that much, fearing him head of the Red Army and disliking that he had executed fellow Bolsheviks during the war, although Lenin and Stalin approved). He successfully pitted different factions against one another and then adopted the policies he liked from both once his power was cemented; his implementation of Trotsky-style Collectivism was haphazard and resulted in millions of deaths, but he more or less achieved his goals and gradually built a cult of personality around himself that left him the unquestioned dictator. On the back of millions of corpses and with varying degrees of efficiency, he transformed Russia into an industrial powerhouse with himself as leader. Hitler on the other hand became the unquestioned leader of the Nazi party by proving himself to be their best orator and then using this fact to blackmail the party into making him leader, this following episode where he failed to match a far-right Professor in a public debate and feared his position was weakening. Then and later he would get his way by throwing temper tantrums (many of them staged) until people gave him what he wanted, helped by the historically authoritarian culture of Germany in general and the German right in particular, who were receptive to the idea of answering to one man above all. His attempted Putsch in 1921 was a shambles but the right-wing Bavarian state sympathised with him enough to be lenient with him, and spending his time in prison reading and writing his book Mein Kampf (which most historians decry as being atrociously written and riddled with errors, half-truths and outright lies), he eventually resumed leadership of the Nazi party and eventually became Chancellor via telling people whatever they wanted to hear. As Fuhrer of the Party and later of Germany he was regarded by his inner circle as a very smart but often lazy man who had bursts of activity followed by long-periods of relaxing doing whatever he wanted (by his own admission he found the affairs of office to be tedious). His mismanagement of the economy practically forced him to invade his neighbours and plunder their resources to maintain the lie that he had cured all of Germanys economic woes (he was planning to invade them anyway, but he backed himself into a corner regardless), he oversaw a swollen and corrupt bureaucracy of Nazi bigwigs carving out their own personal fiefdoms and competing for his approval, and his performance as commander-in-chief was..spotty, with moments of strategic and tactical brilliance and insight balanced out by decisions of monumental stupidity, borne of drug-fuelled overconfidence and hubris from his early successes, eventually resulting in the complete and total defeat of Germany and his own suicide. Hitler inherited the most advanced industrial nation in Europe and left it a bombed-out war zone. Stalin made his own military blunders but eventually- reluctantly - learnt to listen to his generals; Hitlers’ generals were not as correct as they made themselves out to be after the fact (sometimes Hitler was right where they were wrong) but Hitlers overconfidence in his own abilities and “destiny” ultimately is what cost him the war. Stalin essentially got everything he could have wanted by the end of World War 2- albeit at horrific cost- with the USSR dominating Eastern Europe and Communist movements springing up and in some cases taking power around the globe (though it must be said he didn’t like Communist parties he did not fully control), and while that was due to far more than Stalin simply being a visionary master-planner, he could at least claim to the ultimate winner of World War 2 and died as master of the single largest land empire in the history of the planet. So, to reiterate, as far as raw intellectual achievements and overall successes go, Stalin was likely smarter than Hitler. Better educated, better graded, better read, and consistently putting his talents to better use. Hitler was not unintelligent, but he was far more inconsistent and less calculating, being more of a gambler and a frequently lazy one at that. The average IQ of the Nuremberg defendants was 128 and they all agreed that Hitler was smart, so Hitler was probably genuinely intelligent, but he was also much more intellectually insecure and had much more serious intellectual failings- he was bigoted and close-minded and proud of it, to a far greater degree than Stalin was, and he was more fraudulent in his behaviour and credentials than his Georgian nemesis too. Albert Speer noted that compared to most other political parties in Germany, very few prominent party members had university degrees or even received much of a proper education; with the Bolsheviks on the other hand, their leadership consisted of genuine well-educated geniuses who dropped out of education to start a revolution, and while blinded by their own dogma took much more pride in their intellectual substance compared to the Nazis and were better able to back it up, and Stalin was no exception. ",
            "date": "Updated June 10, 2019",
            "views": "71",
            "upvotes": " View 88 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pablo Reis",
                    "user_href": "/profile/Pablo-Reis-6"
                },
                {
                    "user_id": "John Houston",
                    "user_href": "/profile/John-Houston-52"
                },
                {
                    "user_id": "Ia Gi",
                    "user_href": "/profile/Ia-Gi"
                },
                {
                    "user_id": "Bob Mcardy",
                    "user_href": "/profile/Bob-Mcardy"
                },
                {
                    "user_id": "Liam Abir",
                    "user_href": "/profile/Liam-Abir"
                },
                {
                    "user_id": "Hayley Graham",
                    "user_href": "/profile/Hayley-Graham-40"
                },
                {
                    "user_id": "Jonny Campbell",
                    "user_href": "/profile/Jonny-Campbell-1"
                },
                {
                    "user_id": "Arya Tabaie",
                    "user_href": "/profile/Arya-Tabaie"
                },
                {
                    "user_id": "Mike Lampon",
                    "user_href": "/profile/Mike-Lampon"
                },
                {
                    "user_id": "Paul Reeves",
                    "user_href": "/profile/Paul-Reeves-27"
                }
            ]
        }
    ]
}