{
    "title": "Who was the first tyrant in history? - Quora",
    "tags": [
        "First Tyrant",
        "Tyrants",
        "Dictators",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Baba Vickram Aditya Bedi",
                "href": "/profile/Baba-Vickram-Aditya-Bedi"
            },
            "answer_text": " Gilgamesh the King of Uruk. 2900 B.C., Ancient Iraq. The first Tyrant in recorded human history comes from Ancient Iraq. The Story of Gilgamesh.Enkidu and the Netherworld, and the Epic of Gilgamesh. These works which date back to events at around 2900 B.C. describe Ancient Iraq, and much of the epic takes place along the Tigris and Euphrates River. Here Gilgamesh is stated to be 2/3 Divine and 1/3 Human. He is very much the Tyrant of Uruk, who forced his people into slavery, and had no thought at all that doing so was wrong in anyway. He oppressed them, and though he seemed to believe what he was doing was for their benefit. After sometime the God Anu, decides that Gilgamesh must be challenged, and thus Enkidu the wild man is sent, he will become civilized via contact with a fallen woman from the city called, Shamat. This is followed by a wrestling match between Gilgamesh and Enkidu. Though Gilgamesh wins, he is so impressed by Enkidu that he now becomes a friend to him. The epic will than narrate, Gilgamesh’s quest for immortality which will involve Enkidu as well. In the adventures which follow, Gilgamesh will finally understand that immortality is the domain of the Gods but for mankind our fill is burdened with death and suffering. We are given gifts which are then taken away from us. The story of Mikku and Piku is one notable illustration of this, as here the Goddess Ishtar, would give Gilgamesh, the Mikku and Piku which respectively are a drum and the stick needed to play it. Gilgamesh would lose this magical drum se. At the end Gilgamesh would accept this reality and begin to build the city state of Uruk. For all he could leave as his legacy would be one of the greatest states of the Ages of Antiquity. Ancient Iraq, was a civilization in the same league as Ancient India, and Ancient Egypt. In a unique way the Sumerian Civilization of Iraq, would leave behind written records of their quest to rationalize how humanity came to give up absolute freedom, to settle in Cities and surrender themselves to laws and security. The practice of Agriculture and the use of the Tigris and Euphrates to irrigate humanities first settlements are legacies which remain part of Iraq. The first Tyrant in recorded history was also born in this soil and left his legacy there. This unique story and it’s historical connection is profound, as the area would a catalyst in the greater human journey. In the recent history the land of Iraq has been devastated by successive war, and the Epic of Gilgamesh may indeed be of greater consequence, for all mankind can do is to is to rebuild after tragedy.  The Epic of Gilgamesh, Sulaymaniyah Museum, Iraq. (1800 B.C.) ",
            "date": "Answered December 6, 2019",
            "views": "15",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaan Zaidi",
                    "user_href": "/profile/Shaan-Zaidi-2"
                },
                {
                    "user_id": "Tony Wixon",
                    "user_href": "/profile/Tony-Wixon"
                },
                {
                    "user_id": "Sanjit Ghosh",
                    "user_href": "/profile/Sanjit-Ghosh-4"
                },
                {
                    "user_id": "Xargon Qaengyrheon",
                    "user_href": "/profile/Xargon-Qaengyrheon"
                },
                {
                    "user_id": "Namir Oraha",
                    "user_href": "/profile/Namir-Oraha"
                },
                {
                    "user_id": "Guillermo Máynez Gil",
                    "user_href": "/profile/Guillermo-Máynez-Gil"
                },
                {
                    "user_id": "Michel Hedley",
                    "user_href": "/profile/Michel-Hedley"
                },
                {
                    "user_id": "Srikaanth Sridhar",
                    "user_href": "/profile/Srikaanth-Sridhar"
                },
                {
                    "user_id": "Abhinav Prasad",
                    "user_href": "/profile/Abhinav-Prasad-56"
                },
                {
                    "user_id": "Trinadh Teja Cheepurupalli",
                    "user_href": "/profile/Trinadh-Teja-Cheepurupalli"
                }
            ]
        }
    ]
}