{
    "title": "Who was behind the fall of the British Empire? Was it really the role of Gandhi and Nehru? - Quora",
    "tags": [
        "Jawaharlal Nehru",
        "British Empire",
        "Mahatma Gandhi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranav Joshi",
                "href": "/profile/Pranav-Joshi-2"
            },
            "answer_text": "Well, first, the British Empire didn’t exist only in India, though India was one of its biggest conquered lands. It was an “empire” because it had conquered dozens of countries, mostly in Asia and Africa. Now about Gandhi and Nehru. Your question has a hint of skepticism to it. Let me say first that no empire is ever dissolved merely because of a freedom struggle. For a tyranny to end, a struggle against it is vital, but so are economic and geopolitical factors outside the control of the imperial power. The immediate cause of the dissolution of the British Empire, not just in India but everywhere, was World War 2. The war left England devastated, shrank its economy and cost it the premier position among world powers. England had to work hard even to feed her own populace, forget controlling other dominions. This was going to be way too expensive. The second reason was that by the mid 20th century it had become morally reprehensible to keep other peoples under subjugation and exploit them economically. Currents of liberal political thought were aided by the growth of science and technology and the awakening of national consciousness among peoples in Asia and Africa. This naturally led to freedom movements, including in India. In India the struggle was mostly nonviolent, which was unique in world history at the time. The nonviolent nature of the struggle actually helped mobilise liberal world opinion in favour of Indian freedom. It is remarkable that the Jallianwallah Bagh massacre stands out - because neither the British nor the French were averse to massacres as such. It stands out because it was done against a peaceful populace, not against armed rebels. That is also why it garnered such notoriety and shame. Gandhi had two great qualities - one due to its consequences and the other due to its very nature. The first was his belief in nonviolence. It may seem ridiculous to preach nonviolence to a man who is at the wrong end of a gun barrel. But it was exactly this nonviolent movement which mobilised world opinion in our favour. Even if Gandhi’s protest programmes failed, eventually his method succeeded. Gandhi’s second great quality was that he was a mass leader like India has never seen before, or since. Yes there have been mass leaders before and after Gandhi, but none of the scale that he was. He united the people, at least temporarily, and gave them a dream and a set of goals. Whether his campaigns worked or not is immaterial in the end, because in the end the people listened to him and the British could not ignore him. Also, India’s nonviolent mass movement ensured that the country would not break into civil war after independence. This happened to other Asian and African countries after they gained independence, and again India stands out - because of her nonviolent struggle and because she had leaders like Nehru and Patel after independence, who held her together. Lastly, India won freedom because the British were not the Nazis, or Joseph Stalin. As Nehru rightly said in The Discovery of India, as terrible as the British were for our country, we could never wish them defeat in war, because the alternative was Nazi Germany. The British could have destroyed Gandhi and Nehru and Patel and everyone else if they wished to, they could have broken the back of India’s freedom struggle by absolute, fanatical, extreme violence against the population - like the Nazis did in the occupied territories or Stalin to his own population. But they did not. They gave up their Empire when it became too costly and the opposition became too hot. ",
            "date": "Answered December 29, 2018",
            "views": "59",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hrishika Sharma",
                    "user_href": "/profile/Hrishika-Sharma-5"
                },
                {
                    "user_id": "Umar Farook",
                    "user_href": "/profile/Umar-Farook-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utkarsh Sharma",
                "href": "/profile/Utkarsh-Sharma-608"
            },
            "answer_text": "Oh yeah it was just those 2 of them, fighting the British like the dynamic duo, they kicked and punched their way into the impregnable British empire and broke the backbone of once mighty Raj. The rest of World watched in elation while angels sang from the heavens and showered Roses. The other factors like WW2 and it's widespread geopolitical impact has nothing to do with Indian Independence, the depletion of arm forces or global outcry against Imperial overlords or formation of a stronger League of Nations AKA UN or the depleting British interest amongst millions was never in picture. ",
            "date": "Answered June 14, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hrishika Sharma",
                    "user_href": "/profile/Hrishika-Sharma-5"
                }
            ]
        }
    ]
}