{
    "title": "Who started the Reign of Terror during the French Revolution? - Quora",
    "tags": [
        "French Revolution",
        "History of France",
        "Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gérard Briais",
                "href": "/profile/Gérard-Briais"
            },
            "answer_text": "This is a controversial point in the history of the French Revolution. For some, Terror began at the first head cut by the crowd: that of the governor of the Bastille on July 14, 1789. Others made it start from the massacres of September 1792, others from the establishment of the Revolutionary Tribunal in March 1793 I will say that the instruments of terror are set up with the institution of an extraordinary criminal court on August 17, 1792 - the first draft of the Revolutionary Tribunal - to judge, without appeal to the Supreme Court, the authors of the \" Crimes \"of August 10, 1792 (the day that marks the end of the monarchy) and all the participants in the conspiracy of the Court The second period begins with the elimination of the Girondist deputies with the riots of May 31 and June 2, 1793 The third period is that of the Grande Terreur : Officially, the Great Terror begins with the Law of Prairial Year II (June 10, 1794), known as the Law of Prairial, drafted by Georges Couthon and initiated by Robespierre which accentuates the Terror by proceeding to the reorganization of the Revolutionary Tribunal, and opens a short period which lasted until the fall of Robespierre on July 27, 1794. It was instituted by a majority of the members of the Comité de Salut Public (Committee of Public Safety) and deprived the accused of the right of defense and appeal.  Georges Couthon From the vote of the Loi de Prairial (June 10, 1794) to the fall of Robespierre (July 27, 1794) the Revolutionary Tribunal of Paris will pronounce 1376 death sentences. ",
            "date": "Answered August 28, 2017",
            "views": "855",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Toby Beedel",
                    "user_href": "/profile/Toby-Beedel"
                },
                {
                    "user_id": "Anne W Zahra",
                    "user_href": "/profile/Anne-W-Zahra"
                },
                {
                    "user_id": "Anne Mazo",
                    "user_href": "/profile/Anne-Mazo-1"
                },
                {
                    "user_id": "Branko Dodig",
                    "user_href": "/profile/Branko-Dodig"
                },
                {
                    "user_id": "Ioan Luncan",
                    "user_href": "/profile/Ioan-Luncan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas de La Marnierre (トマ・サレ)",
                "href": "/profile/Thomas-de-La-Marnierre-トマ-サレ"
            },
            "answer_text": "Robespierre is a bad answer. It was more broadly le Comité de salut public (it roughly translates as Committee for public salvation), and Robespierre was a member of it. They took their decisions collectively, and no Robespierre wasn’t alone responsible for the Terror at all. The role of the Committee was to safeguard the Revolution from its enemies, that wanted to destroy the new Republic and prevent the reforms. ",
            "date": "Answered August 27, 2017",
            "views": "407",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barbara Tibbetts",
                    "user_href": "/profile/Barbara-Tibbetts-3"
                },
                {
                    "user_id": "Vivian Schul",
                    "user_href": "/profile/Vivian-Schul"
                },
                {
                    "user_id": "Érico Caldeira",
                    "user_href": "/profile/Érico-Caldeira"
                },
                {
                    "user_id": "Robin Gillard",
                    "user_href": "/profile/Robin-Gillard"
                },
                {
                    "user_id": "Jose Pineda",
                    "user_href": "/profile/Jose-Pineda-6"
                },
                {
                    "user_id": "Jérémie Boussand",
                    "user_href": "/profile/Jérémie-Boussand"
                },
                {
                    "user_id": "Rowan Pray",
                    "user_href": "/profile/Rowan-Pray-1"
                },
                {
                    "user_id": "Tai Williams",
                    "user_href": "/profile/Tai-Williams-6"
                }
            ]
        }
    ]
}