{
    "title": "Who are the youngest billionaires in the world? - Quora",
    "tags": [
        "The World",
        "Billionaires",
        "Wealthy People and Families"
    ],
    "response": [
        {
            "author_info": {
                "name": "InDresh KuMar",
                "href": "/profile/InDresh-KuMar-163"
            },
            "answer_text": "Meet The World’s Youngest Billionaire, It’s None Other Than Kylie Jenner! Kylie Jenner takes the position of the world's youngest self-made billionaire, according to Forbes billionaires' list.The youngest Kardashian family member is making her fortune from her best-selling cosmetics business namely Kylie Cosmetics. The 21-year-old founded and is the owner of Kylie Cosmetics, the three-year-old beauty business that generated an estimated $360m in sales last year. No sooner did it launch than girls all around the world went gaga over the collections, since, Kylie’s makeup has always been unsurpassable.  She reached the milestone earlier than Facebook founder Mark Zuckerberg who became a billionaire aged 23.\"I didn't expect anything. I did not foresee the future.”\"But [the recognition] feels really good. That's a nice pat on the back,\" Ms. Jenner told Forbes. Of all the billionaires on the list, only 252 are women, and the richest amongst them is the self-made woman is real estate mogul Wu Yajun of China, worth an estimated $9.4bn.The number of self-made women reached 72 for the first time, up from 56 a year ago. The list has shown that Amazon's founder, Jeff Bezos, remains the world's richest man. His fortune totals $131bn, according to Forbes, up $19bn from 2018. But the billionaires' combined worth has gone down from $9.1 trillion at $8.7tn.  Facebook founder Mark Zuckerberg's wealth is among those which is gradually falling down.it has dropped by $8.7bn (£6.6bn) in the past year to $62.3bn, according to the Forbes list. His shares in Facebook lost a third of their value at the time when the company battled privacy scandals.  Amazon's share price has been good for the bank balance of Mr. Bezos' and the gap between him and the second richest man, Bill Gates, is a little wider, even though Mr. Gates' fortune has swelled to $96.5bn from $90bn last year. For more interesting stories download the Lopscoop application from Google Play Store and earn extra money by sharing it on social media. ",
            "date": "Answered March 7, 2019",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Wright",
                    "user_href": "/profile/Samuel-Wright-112"
                },
                {
                    "user_id": "Shivam Pandey",
                    "user_href": "/profile/Shivam-Pandey-808"
                },
                {
                    "user_id": "Sushant Sagar",
                    "user_href": "/profile/Sushant-Sagar-सुशांत-सागर"
                },
                {
                    "user_id": "Soham Sarpotdar",
                    "user_href": "/profile/Soham-Sarpotdar"
                },
                {
                    "user_id": "Deepak Kudre",
                    "user_href": "/profile/Deepak-Kudre"
                }
            ]
        },
        {
            "author_info": {
                "name": "T. Aswini Patro",
                "href": "/profile/T-Aswini-Patro"
            },
            "answer_text": "TOP 21 YOUNGEST BILLIONAIRES OF WORLD 2020 Kylie Kristen Jenner is an American media personality. She has been showcased in the E! Reality television series Keeping Up along with the Kardashians since 2007 and is the founder and owner of a cosmetic company Kylie Cosmetics headquarter in Oxnard, California, United States. The net worth is estimated to be around $1 Billion at the age of 22. Throughout her career, she has rejuvenated herself in music and fashion. Ritesh Aggarwal is an Indian entrepreneur, billionaire and the founder and CEO of OYO Rooms. He has a net worth of $1.1 billion (Rs 7,800 crore) according to Hurun Global Rich List 2020. Interestingly, his net worth has increased by Rs 300 crore since last year. Born on 16 November 1993 in Bissam Cuttack, Rayagada. Alexandra Gamlemshaug Andresen is a Norwegian heiress who is born to a Norwegian Industrialist Johan H. Andresen, Jr., owner of Ferd AS, who in 2007, transferred ownership stakes of 42.2% to his daughter Alexandra. And, she became the world's youngest billionaire at a tender age of 19 in 2016 and held the position of the youngest billionaire on Forbes list for three consecutive years. The net worth is estimated to be around $1.4 Billion at the age of 23. She has modeled for an Equestrian clothing company (Kingsland) quite a time. Katharina Gamlemshaug Andresen is also a Norwegian heiress, the world's third-youngest billionaire as reported by Forbes. She is the daughter of Johan H. Andresen Jr., owner of Ferd AS, who, in 2007, transferred 42.2% ownership stakes to Katharina. She was born in Oslo, Norway in 1995 and holds a net worth of $1.4 billion at 25 years. Gustav Magnar Witzøe is a Norwegian billionaire and a notable shareholder of salmon fish farming company Salmar ASA. He was born in 1993 and as of now has $ 3 Billion at the age of 27 years. In 2013, Witzøe's father transferred 47% of the company to him to allegedly avoid a large inheritance tax bill. Witzøe is involved with the family business and worked as a milker at SalMar's fish farms in Frøya. Evan Thomas Spiegel is a French-American businessman who is the co-founder and CEO of the American social media company Snap Inc., which he created with Bobby Murphy and Reggie Brown while they were students at Stanford University. Spiegel was named the youngest billionaire in the world in 2015. He is now having a net worth of $3.1 Billion. John Collison is an Irish entrepreneur who is best known for being having co-founded Stripe (a company that lets businesses and individuals accept payments over the internet) with his brother, Patrick. He was born in 1990 and presently has a net worth of $ 2.1 Billion. The Irish-born brothers are a couple of the world’s youngest self-made billionaires. Patrick and John dropped out of MIT (Massachusetts Institute of Technology) and Harvard, respectively, and sold their first-ever business (an online auction management company) for an alleged report of $5 million in 2008. Ludwig Theodor Braun owns around 10% of the medical device company B. Braun Melsungen, which was begun in 1839 as a small pharmacy that sold herbal remedies. The best ever gift from his father, equating to $1.7 billion, makes Ludwig Theodor Braun the 1,394th richest person in the world, according to Forbes. Anna Kasprzak is a Danish dressage rider. She proudly represented Denmark at two Summer Olympics. And her best Olympic result came in 2012 when she was placed 4th with a Danish team in the team competition. Anna Kasprzak is one of the richest millennials in the world with a net worth of $1.1 billion, according to Forbes. In 1963, Anna's grandfather, Karl Toosbuy, started ECCO (Footwear Company of the Year in 1994 in the US). Kasprzak also runs a private dressage barn in Haderslev, Denmark. Some of the horses at the barn are already trained and have been competing with Kasprzak, while others are still being “educated”. Jonathan Kwok, 30, and his brother Geoffrey Kwok run Empire Group Holdings, a property developer in Hong Kong. He is the younger son of the late Walter Kwok, former chairman of Hong Kong's largest developer, Sun Hung Kai Properties. The brothers also inherited their father's stake in Sun Hung Kai Properties. His net worth is $2.3 billion and he happily lives in Hong Kong. Patrick Collison is an Irish entrepreneur from County Tipperary. He is the co-founder and CEO of Stripe, which he started with his younger brother, John, in 2010. He won the 41st Young Scientist and Technology Exhibition in 2005 at the age of sixteen. Collison currently lives in San Francisco, California. He possesses a net worth of US $2.1 Billion while at the age of 31 (born in 1988). Robert Cornelius Murphy (Bobby Murphy) is an American based Internet entrepreneur and software engineer. He is the co-founder and the CTO of the American multinational technology and social media company Snap Inc., which he created with Evan Spiegel and Reggie Brown while they were students at Stanford University. His current net worth is the US $ 3.6 Billion at the age of 31 while born in 1988 in Berkeley, California. Said Gutseriev, 31, has stakes in several coals, oil, retail and financial companies that he received from his father, Mikhail Gutseriev. He is also the CEO of Forte invest, an oil refinery and a company that is part Safmar Group, his father's company. He is worth $1.3 billion and lives in Moscow. He is a Russian entrepreneur, CEO of the oil holding Forte Invest JSC, co-owner of the Industrial and Financial Group SAFMAR, which includes assets in various industrial sectors, construction, real estate, and chain stores Eldorado and M.video. Lukas Walton, 32, received one-third of the estate of John Walton, his father when he died. He is the grandson of Sam Walton; the founder of Wal-Mart. Lukas Walton also owns stakes in Arvest Bank and First Solar. He is worth $17.8 billion and lives in Jackson, Wyoming. He inherited his fortune when his father, John Walton, died in a 2005 plane crash. He received about one-third of his father's estate; his mother, Christy Walton, got about one-sixth. Eva Maria Braun-Luedicke owns 12% of the medical device company B. Braun Melsungen, which began in 1839 as a small pharmacy that sold herbal remedies. Her mother's cousin Ludwig Georg Braun took the reins in 1977 when the company had just $24 million in annual sales (now around $8 billion). As of now, she is having a net worth of $1.3 billion at the age of 30. André Kasprzak, 32, owns shares in ECCO, a Danish shoemaker with his family members, his mother, Hanni, and his sister, Anna. He is worth $1 billion and is a citizen of Denmark. ECCO was founded by Kasprzak's late grandfather, Karl Toosbuy, in 1963. Christopher Kwok, 33, and his brother, Jonathan Kwok, run Empire Group Holdings, a property developer in Hong Kong. The brothers also inherited from their father, Walter, a stake in Sun Hung Kai Properties. He is the executive director of Sun Hung Kai Properties. He is worth $1.8 billion and lives in Hong Kong. He is the younger son of property mogul Raymond Kwok, chairman of Sun Hung Kai Properties, the largest developer in Hong Kong. Jihan Wu, 33, is the co-founder and co-CEO of Bitmain Technologies, a Chinese mining-chip behemoth. He is worth $2.39 billion at the age of 34 and lives in Beijing, born in 1986 in Chongqing, China. He is a Chinese billionaire cryptocurrency entrepreneur. Together with Micree Zhan, he co-founded Bitmain in 2013, which has become the world's largest computer chip company for bitcoin mining, with US$2.5 billion in revenue in 2017. Aiyawatt Srivaddhanaprabha, 34, is CEO of King Power, an airport duty-free empire in Thailand. He inherited the company after his father, Vichai Srivaddhanaprabha, died. The estate of his father is shared with his mother and three other siblings. His net worth is estimated to be $4.9 billion at the age of 34 and lives in Bangkok, Thailand. He was born in 1985 in Bangkok, Thailand. Geoffrey Kwok is the elder son of the late Walter Kwok, former chairman of Hong Kong's largest developer, Sun Hung Kai Properties. Walter died on Oct. 20, 2018, at age 68. He had been ousted as company chairman in 2008 in a feud with his two brothers, Thomas and Raymond. He is having a net worth of US $ 2.9 billion and lives in Hong Kong. Julio Mario Santo Domingo, III, 34, owns a stake in Anheuser-Busch InBev. He inherited his grandfather's stake in SABMiller. The two beer giants merged in 2016. He is having a net worth of US $1.8 billion as of at the age of 35 and lives in New York City. He is an heir to one of the world's largest beer fortunes, is a disc jockey in New York City for the group Sheik 'N' Beik. ",
            "date": "Answered March 23, 2020",
            "views": "292",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Funsho Fatoye",
                    "user_href": "/profile/Funsho-Fatoye-1"
                }
            ]
        }
    ]
}