{
    "title": "Who was the first non-athlete sports billionaire (in todays dollars)? - Quora",
    "tags": [
        "Becoming a Billionaire",
        "Athletes",
        "Sports Business",
        "Billionaires",
        "Professional Athletes",
        "Professional Sports",
        "Wealthy People and Families",
        "Wealth",
        "Sports"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Woloch",
                "href": "/profile/Michael-Woloch"
            },
            "answer_text": "I don’t know what this means. Sports team owners are often billionaires before they owned the team - though sometimes they have become billionaires because of their purchase of a team and seeing it increase in value. Roger Staubach was a star NFL quarterback but his business dealings in retirement have given him a net worth on the order of $600m. It’s hard to say if he would have achieved that without the notoriety that his athletic career brought, but it is possible. Several athletes have made far more money in endorsements than their actual salary as a player. Michael Jordan probably tops that list. But as for people working in sports, head coaches would be the next highest paid candidates, with maybe journalists a close second. They don’t make enough money to become a billionaire. But there is another possibility. Adi Dassler of Adidas fame, and his brother Rudolf of rival Puma, were not athletes, but built up huge companies in sporting goods. While Adi Dassler died in 1978, Adidas was a private company until 1989, and he may very well have been a billionaire. This follows in the tradition of others like A.G. Spalding, who made a fortune selling sporting goods. Even though his career as an athlete was successful, he was far more famous for the company he founded. ",
            "date": "Answered April 2, 2020",
            "views": "158",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyle Logan",
                    "user_href": "/profile/Kyle-Logan-36"
                },
                {
                    "user_id": "Rupam Kumar Saha",
                    "user_href": "/profile/Rupam-Kumar-Saha"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Leavy",
                "href": "/profile/John-Leavy-8"
            },
            "answer_text": "I assume that some OWNERS of sports franchises were billionaires, long before their players made much money. Do they count? ",
            "date": "Answered April 2, 2020",
            "views": "20",
            "upvotes": "0"
        }
    ]
}