{
    "title": "Who invented human beings? - Quora",
    "tags": [
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Hudson",
                "href": "/profile/Charles-Hudson-22"
            },
            "answer_text": "After looking through the numerous answers, it's obvious that the bulk, think humans are just animated turnips. If this is the case, then why all the hubbub about anything? But beyond that, I will be one of few who believes in the Creation of mankind by an all existing God.(to use the general term). I know that this will be poopooed by the bulk of readers, as I would expect. Consider this then, useing math as a simple illustration, the ability of a single cell organism, which by the way came from where?, to continuesly change to a MORE complex organism, goes against all known concepts. Simple tends to simple. Not enough time has elapsed for multi billion cell organisms to evolve into what inhabits the earth today. Just NOT enough time has elapsed. So, that being said, my believing in the God of the Bible takes far less faith then to believe that through natural law, everything we see and more, was all a Galactic accident. By the way, if the first law of thermal dynamics is true, in the NATURAL, then nothing cannot make something. Like I said, if you believe that it's all a gigantic accident, then either someone is not thinking or your faith in the impossible is greater than mine. One thing is for sure, if I'm right, then upon death I know truth. But if wrong, well, no one will care. After all, I'm just a turnip. The return answers should be interesting. I have always found that the other side of thinking(?) Gets VERY animated in their name calling. Go for it. Don't care much for non-conversation. ",
            "date": "Answered January 7, 2018",
            "views": "31",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Humphries",
                    "user_href": "/profile/Bruce-Humphries-5"
                },
                {
                    "user_id": "Sheena Reid",
                    "user_href": "/profile/Sheena-Reid-1"
                },
                {
                    "user_id": "Joe Cool",
                    "user_href": "/profile/Joe-Cool-215"
                },
                {
                    "user_id": "James Furray",
                    "user_href": "/profile/James-Furray"
                },
                {
                    "user_id": "ClekC .",
                    "user_href": "/profile/ClekC"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaey KarthiK",
                "href": "/profile/Kaey-KarthiK"
            },
            "answer_text": " Literally, humans invented Human Beings. The word Human Being was first coined by Samuel Johnson in the 1700’s. Apparently the first use of the word ‘hummus’ is recorded in the late 13th century. Hummus means ‘of the earth’. If you really meant to ask who created Human Beings, then a religionist would say, God created humans and all the species on earth. But science says, all the lives including us, human beings were the evolution of life and the power for the species to evolve to a different species based on the conditions of the environment. So nothing in here is created, it is only the evolution of a certain species to suit the altering conditions. Several things have changed since the big bang. And every atom on the universe is changing every fraction of a second. In future, human beings may evolve to a different species capable of surviving the altered environment on earth. For all, Life seeks only one way to fight against all the odds of the environment, the survival. ",
            "date": "Updated August 29, 2018",
            "views": "19",
            "upvotes": "0"
        }
    ]
}