{
    "title": "Who were worse, the English colonizers or the Spanish colonizers? - Quora",
    "tags": [
        "British Colonization",
        "Spanish Empire",
        "British Empire",
        "Colonization",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "James McCuvy",
                "href": "/profile/James-McCuvy"
            },
            "answer_text": "The best guess is that the order of brutality of colonial regimes in the Americas is Portuguese, Spanish, British, Dutch, French. There are a lot of people who are quite sure that the Anglo yoke was infinitely worse than the Spanish yoke. For their evidence, they a seem to rely on a lot of conventional wisdom informed by movies, supposed humanitarian mandates issued by the Vatican, and the fact that the fact that populations of the US and Canada and Mexico have separate appearances as proof that their assertion is correct. The logic is that the separate phenotypes are proof that the Anglo settlers simply killed the people they encountered, whereas the Spanish did not. An interesting curiosity in this debate is the location of the largest Indian massacre that we know of in what is now the US. It’s in modern Alabama, where about 2,500 were killed. Why did the British do this, or was it the Americans? Well, they didn’t, the Spanish did.  Mabila - Wikipedia What about the second largest massacre? That is the Awa'uq Massacre in modern Alaska. The Russians did that. Awa'uq Massacre - Wikipedia While there were certainly many English massacres, like the Mystic massacre - Wikipedia of 400–700, the Spaniards killed more people in one battle, the Fall of Tenochtitlan - Wikipedia, than the total of all the Indian wars north of the Rio Grande of the last 200 years. So, why exactly did the US and Canada have Anglo appearances, while Latin America had a more indigenous look? Well, this is the kind of settlement you would find in 1500 in the area that became New York City.  This is what you would find in the locale that became Mexico City.  The fact is that there were comparatively few inhabitants in the regions the British(and French and Germans) settled. They had scattered agricultural settlements, but most of it was occupied by hunter\\gatherers, which have extremely small population densities compared to agriculturalists. The largest pre-Columbian settlements were the farming Mississippian mound builders, who vanished at about 1150 AD, and their largest city is estimated to have housed about 20,000–30,000 inhabitants. Without draft animals and heavy plows, you can certainly farm, but it’s difficult to unlock the rich heavy soils that exist in the the American Midwest. Some very generous estimates once said there were as many as 10 million pre-Columbians in Canada and the US, but the more we learn, it looks like quite a smaller number, perhaps even under 1 million, but a reasonable guess is about 4 million in 1491. Now, compare that to the rest of Latin America. Mexico alone had 20–30 million inhabitants in 1491, and probably at least as many in the rest of Latin America.  It’s reasonable to think that the vast majority of both pre-Columbian populations died in virgin soil epidemics like influenza, measles, small pox, cholera, ect, but this goes for both populations. If 90% of the 4 million or so above the Rio Grande died, you are left with 400k. If 90% of Latin America’s population died, you still have 4 million. DNA analysis of modern Mexicans shows that while slightly over half of the DNA is Spanish, the maternal ancestry of the population is about 90% Amerindian. The implication of this is mostly male Spanish settlers with Amerindian wives and concubines. The relatively small settler population of mostly male settlers from Spain and Portugal was spread out over the South American continent, the Caribbean and Mexico with 4 million other inhabitants. The larger settler populations of England, Wales, Scotland, France, and eventually Germany, Sweden, Norway and Denmark, were spread out with perhaps 400,000 remaining inhabitants. Also, unlike the Spanish and Portuguese, these settlers generally came as family units, and Amerindian wives and concubines were less common, particularly among the English. This explains the large phenotypic differences that exist today. Also, places with much lower pre-columbian population densities, even within Latin America, like Chile and Argentina, look much different than places like Peru or Mexico. Another bit of folk wisdom is that the Spanish colonies were much gentler because the Catholic Church, which they argue was very charitable, and outlawed slavery too. I have no way of knowing the relative charitableness of the Anglicans and Catholics centuries ago, but today, all the most charitable countries are Anglo settled countries. List of countries by charitable donation - Wikipedia Did the Catholic Church have slavery outlawed in 1542? Perhaps technically, but until the end of the US Civil war, Mexicans in the US southwest held slaves at similar rates to Anglos living in the eastern states. Of course, their slaves weren’t African, but Amerindian.  This map shows importation of Africans to various locales. You can see that the line to British Jamaica, Spanish Cuba, and French Haitai are around the same size, as is the one to the Persian Gulf. The one to the US is somewhat smaller, and the one to Mexico is smaller still. Brazil’s arrow is is gigantic. So this implies that there should today be 10x as many black people in Brazil as in the US, but there are only about 2x the number. The reason, I have been told, is that the business model of the Portuguese didn’t assume these people would survive for long periods. It was assumed that they would suffer very high rates of death. ",
            "date": "Updated May 31, 2020",
            "views": "16",
            "upvotes": " View 77 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Mehari",
                    "user_href": "/profile/Michael-Mehari"
                },
                {
                    "user_id": "Michael T Brogan",
                    "user_href": "/profile/Michael-T-Brogan-1"
                },
                {
                    "user_id": "Mike R. Books",
                    "user_href": "/profile/Mike-R-Books"
                },
                {
                    "user_id": "David Holland",
                    "user_href": "/profile/David-Holland-42"
                },
                {
                    "user_id": "Edison Stewart",
                    "user_href": "/profile/Edison-Stewart"
                },
                {
                    "user_id": "Jerry Peter",
                    "user_href": "/profile/Jerry-Peter-6"
                },
                {
                    "user_id": "Gavin McGregor",
                    "user_href": "/profile/Gavin-McGregor-1"
                },
                {
                    "user_id": "Fabián OteroRabuñal",
                    "user_href": "/profile/Fabián-OteroRabuñal"
                },
                {
                    "user_id": "Romain Blanchard",
                    "user_href": "/profile/Romain-Blanchard-5"
                },
                {
                    "user_id": "Thomas Rath",
                    "user_href": "/profile/Thomas-Rath-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernesto Gasulla",
                "href": "/profile/Ernesto-Gasulla"
            },
            "answer_text": "It’s hard to answer the question without getting cultural and/or racial bias in the way, but I’ll do my best. For the sake of disclaimers, I am a born Argentinian of Spanish descent, now a naturalized American citizen. The fact is, native populations in Spanish America survived in much higher numbers. To this day, the typical Mexican, Central American, Peruvian and Bolivian has visible native features, so it’s clear the phenotype survived. That is not true of the typical American or Canadian. Yes they might have native ancestry in small percentages, but not enough to show. Here are the very first (to avoid bias) pictures that appeared when I googled “Mexican… (and the next three categories) people”. Note I did not type “native” or “indigenous”.     Now that a factual answer is in, just because I am skeptical of some peoples being naturally nicer than others, I’ll try to delve a little deeper on the reasons why. When Spaniards colonized America (yes it was all of America, South, Central and North) they found riches beyond their wildest dreams in two separate locations: the Aztec and the Incan empires. At first, they simply took what was readily available, but soon after, they needed people to work the mines to keep silver and gold production going on. Mine work is taxing, so workers need to be in a reasonably strong physical condition; thus the need to keep them alive and healthy. While I can’t fully discard that the many hospitals the Spaniards opened in the colonies were somehow related to a desire to save their lives to the extent possible, there was a clear financial drive behind it too. To solidify this hypothesis, the current areas where native looking peoples are more prominent are those where the Aztec and Incan empires were located. While in the central part of my native Argentina, where there was nothing of great interest to the colonizers, few natives survived. (The North, inside the Incan area of influence, is still home to the most native looking Argies, while the South, colder and barren, remained in Indian hands until much later). On the other hand, the British colonies had no comparable sources of wealth, and therefore there must have been less interest in the health of native workers. Yes there were plantations requiring hard work, but they needed some time to grow to the point the founding immigrants and their descendants could not tend to them by themselves, and then, when the need arose, it was covered with slaves, which were cheap merchandise from the African colonies (Spain only had one African colony, Spanish Guinea, and was incorporated quite a bit later) There is a further argument about religion. Catholicism is simply more lenient with the poor and destitute than Protestantism. To avoid accusations of bias, this is the result of a Pew Research poll in the US: Catholics want to physically help the poor, Protestants are content with promoting their beliefs.  But why? Can there be a logical reason beyond the facts? I think there is. Before I get started and someone jumps at my throat, please note I’m talking about the foundations, the building blocks of each religious movement; I know all too well that the practical application nowadays is quite different. Catholicism was born out of a poor and destitute tribe, a colony themselves of all-powerful Rome. To diss the poor would have been dissing themselves, and no cultural group, be it a religion or anything else, wants to commit self-esteem suicide. Therefore, helping the poor is more than a moral position: it’s self preservation. Protestantism is the result of a generalized mistrust of the Catholic Church in 16th century Europe, started by a reasonably well to do German academic, and initially aimed to similarly positioned German burghers, people content with their living except for their dislike of Catholic practices. The mistrust of the poor probably predated the religion, as opposed to being caused by it. Again, I think it’s no coincidence that it was most successful in England, another wealthy European nation, yet had (and still has!) trouble setting roots in poorer European countries and the Third World. TL;DR: Yes I believe the Spaniards treated the natives a little better. I tried to give logical reasons beyond racism to justify it. If you disagree, please do so respectfully and try to address it with logical counterarguments, beyond a loud “you’re wrong!” ",
            "date": "Answered May 25, 2020",
            "views": "94",
            "upvotes": " View 1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Ángel de la Fuente Frechoso",
                    "user_href": "/profile/Miguel-Ángel-de-la-Fuente-Frechoso"
                },
                {
                    "user_id": "Alexander Nissen",
                    "user_href": "/profile/Alexander-Nissen-6"
                },
                {
                    "user_id": "Bill Bockeley",
                    "user_href": "/profile/Bill-Bockeley"
                },
                {
                    "user_id": "Alexandre Dubreuil",
                    "user_href": "/profile/Alexandre-Dubreuil-4"
                },
                {
                    "user_id": "Chris Kominski",
                    "user_href": "/profile/Chris-Kominski"
                },
                {
                    "user_id": "Karl Leonard",
                    "user_href": "/profile/Karl-Leonard-7"
                },
                {
                    "user_id": "Tee Dawgeh",
                    "user_href": "/profile/Tee-Dawgeh"
                },
                {
                    "user_id": "Ramesh Sunkarapalli",
                    "user_href": "/profile/Ramesh-Sunkarapalli"
                },
                {
                    "user_id": "Abi Owoaje",
                    "user_href": "/profile/Abi-Owoaje"
                },
                {
                    "user_id": "Aditya Aries",
                    "user_href": "/profile/Aditya-Aries"
                }
            ]
        }
    ]
}