{
    "title": "Who was the most successful atheist? - Quora",
    "tags": [
        "Religion and Atheism",
        "Atheists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murray Cowell",
                "href": "/profile/Murray-Cowell-1"
            },
            "answer_text": "Answering the question, “Who was the most successful atheist?” This is one of those nonsensical questions, that are usually asked by people who don’t really understand what atheism means. An atheist is someone who doesn’t believe in gods. It’s not a club, it’s an absence of belief. So being an atheist is not something at which one can be more or less successful. You either are one or you’re not. You can test this out easily, with a test that I’m sure you must have come across before. How successfully do you not believe in unicorns, the Tooth Fairy or Santa?How successfully do you not believe in Thor, Ra the Sun God or Zeus?Who can you think of who is more successful than you at not believing in these things? Who is the most successful non-believer?As you can see, these questions don’t make any sense at all. The only way to interpret your question that makes any kind of sense is to rephrase it as, “Who was the most successful person who was also an atheist?” To answer that, list the world’s most successful people, then pick the first one on the list that didn’t believe in gods. That’s pretty impossible, because first you have to decide what success is. In the long term, no humans are successful. They all die, and after a few thousand years they’re all forgotten and nobody knows they ever existed. And in the longer run, the sun supernovas and the Earth is extinguished. So better enjoy yourself while you’re here. Maybe Ray Kurzweil will succeed in achieving eternal life, escape the death of our solar system and live forever in space or on another adopted planet. In which case he’ll be the most successful atheist, because as far as I know he’s not a believer. ",
            "date": "Answered January 28, 2019",
            "views": "12",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dean D'Souza",
                    "user_href": "/profile/Dean-DSouza-18"
                },
                {
                    "user_id": "Gail Fiorini",
                    "user_href": "/profile/Gail-Fiorini"
                },
                {
                    "user_id": "Rui Faria",
                    "user_href": "/profile/Rui-Faria-30"
                },
                {
                    "user_id": "Johnny Joestar",
                    "user_href": "/profile/Johnny-Joestar-32"
                },
                {
                    "user_id": "Johnathan Berntson",
                    "user_href": "/profile/Johnathan-Berntson"
                },
                {
                    "user_id": "Gregor Michels",
                    "user_href": "/profile/Gregor-Michels"
                },
                {
                    "user_id": "Haryo Baskoro",
                    "user_href": "/profile/Haryo-Baskoro-1"
                },
                {
                    "user_id": "Ben Dermoudy",
                    "user_href": "/profile/Ben-Dermoudy-1"
                },
                {
                    "user_id": "Jacque Scott",
                    "user_href": "/profile/Jacque-Scott"
                },
                {
                    "user_id": "Philip Gerstle",
                    "user_href": "/profile/Philip-Gerstle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregor Michels",
                "href": "/profile/Gregor-Michels"
            },
            "answer_text": "How do you measure “success”? Monetary? Conversions? The fastest at tying his shoes? The question is pretty much nonsense. Ask what you REALLY mean. This is like asking who is the most successful heterosexual. And being an atheist isn’t like being a Christian. There are no churches or “clubs” you belong to. No cards to carry. We don’t generally hang out and re-affirm our beliefs with others in order to maintain our “faith”. We don’t need to keep telling ourselves that faith is better than reason in order to maintain a delusion. We don’t need to believe we are more moral than others to be an atheist. And just like heterosexuals, we come in all walks of life. Mechanics, bartenders, CEOs, police officers, and yes, even ministers. ",
            "date": "Answered March 21, 2020",
            "views": "211",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rui Faria",
                    "user_href": "/profile/Rui-Faria-30"
                }
            ]
        }
    ]
}