{
    "title": "Who would win a *conventional* war between France and Italy right now? - Quora",
    "tags": [
        "Hypothetical War Battles",
        "Italy",
        "France",
        "Hypothetical Battles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Perry",
                "href": "/profile/Travis-Perry-2"
            },
            "answer_text": "France has tons of advantages over Italy except one--geography. The area between France and Italy is mountainous and they don't have a very long border (only 515 km) so there isn't much room to maneuver.  Italy could probably therefore make a French invasion of their country practically impossible, due to geography and the fact they have enough forces to protect that border in depth. That's true even though the French military is certainly better, as other commentators have correctly pointed out. Naturally if France could not successfully invade Italy even though it is militarily stronger, Italy certainly could not invade France. So in a conventional war between France and Italy right now, nobody would win. Stalemate. ",
            "date": "Answered April 9, 2016",
            "views": "3",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francesco Danovaro",
                    "user_href": "/profile/Francesco-Danovaro"
                },
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Olgert Lymer",
                    "user_href": "/profile/Olgert-Lymer"
                },
                {
                    "user_id": "Yehezkiel Davi",
                    "user_href": "/profile/Yehezkiel-Davi"
                },
                {
                    "user_id": "Mattia Lussu",
                    "user_href": "/profile/Mattia-Lussu"
                },
                {
                    "user_id": "Jordi Mori",
                    "user_href": "/profile/Jordi-Mori"
                },
                {
                    "user_id": "David Cheng",
                    "user_href": "/profile/David-Cheng-107"
                },
                {
                    "user_id": "Jesús Riera",
                    "user_href": "/profile/Jesús-Riera"
                },
                {
                    "user_id": "Cyril Daoud",
                    "user_href": "/profile/Cyril-Daoud"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Izidore El-Naghoun",
                "href": "/profile/Izidore-El-Naghoun"
            },
            "answer_text": "Well, it would be complicated! In fact, both countries have the same national sport, this is not football which is the second in Italy and in France, it’s protests/strikes. The real one is… Adultery/Multipartenarism! Therefore, we can predict that… Hot Italian women will win over French males and sophisticated French women will win over Italian males. Everybody will soon be drunk on French+Italian wine and Paris’ world record of May 22–23rd 1885 night (night after death of Victor Hugo) will be beaten : it was the biggest orgy ever : In order to give an homage to Victor who was well known as a “great admirer of those ladies”, the prostitutes decided to work for free on this night… Soon 2 millions were in the streets… I think we may end beating this record with a good 50–70 millions… It will be the 1st XXX war ever and it will be hard to manage the number of births 9 months later. ",
            "date": "Answered October 13, 2020",
            "views": "376",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suppressor",
                    "user_href": "/profile/Suppressor-1"
                },
                {
                    "user_id": "Jakov Škaro",
                    "user_href": "/profile/Jakov-Škaro-2"
                }
            ]
        }
    ]
}