{
    "title": "Who are the descendants of the Scythians today? - Quora",
    "tags": [
        "Scythians",
        "Jat Ethnicity and People",
        "Central Asia",
        "Descendants",
        "Punjabi Ethnicity and People",
        "Genealogy",
        "Race and Ethnicity",
        "Indian Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kulveer Singh",
                "href": "/profile/कुलवीर-सिंह-Kulveer-Singh"
            },
            "answer_text": "The Greek historian Herodotus refers to the European Scythians as Scythians and the eastern ones as Sacae. The Sacae tribes that migrated to India (called Saka in India) have descendants in the the Jat tribes of North India and Pakistan.  A major Scythian tribe vanquished and forced out from its homeland by Darius was called Massagetae, which name got shortened to Getae. In a lingual transition (similar to how Sindhu led to the name Hindu), Getae (pronounced Je-te) gives way eventually to the name Jat. First Buddhism and then Hinduism was the faith adopted by the Jats of India. - See more at: Are Jats of India the descendants of Scythians?[1] According to Ethnographers and historians like Cunningham, Todd, Ibbetson, Elliot, Ephilstone, Dahiya, Dhillon, Banerjea, etc., a lot of the agrarian and artisan communities of India (e.g. Jats, Gujars, Ahirs, Rajputs, Lohars, Tarkhans etc.) of the entire west are derived from the war-like Scythians who settled north-western and western South Asia in successive waves between 500 BC to 500 AD. In his Guide to Taxila, Marshall, the former Director-General of Archaeology of India, says the following about the Sakian invaders of India: “Known to the western world under the comprehensive name of Scythians, to the Indians as Sakas, and to the Chinese as Sai or Sai-wang~ these invaders came principally from the three great tribes of Massagetae, Sacaraucae, and Dahae, whose home at the beginning of the second century B.C. was in the country between the Caspian Sea and Jaxartes river.”[2] According to Williams, \"The extent of the Scythian invasion [of India] has been variously estimated. Some scholars believe they virtually supplanted the previous population of [northwest] India, and there seems little doubt that by far the most numerous section of the Punjab population is of Scythian origin\" (Williams 1905, 481). We also know that many, if not most, of the Massagetae went to India (Tarn 1966, 306-307). So it would not be outrageous to suppose that the inhabitants of northwest India may be descended from these ancient invaders.” Trevaskis put the date of Scythian migrations into India approximately from 600 BC to 600 AD. Trevaskis wrote, \"Their (Scythians') successive onslaughts proved the ruin of Assyria, and soon after the fall of Nineveh, B.C. 606, a vast horde of them burst into Punjab[3] . The purpose of the answer is just to convey a starting point to this theory. Greater detail present in the footnoted references. Footnotes[1] Are Jats of India the descendants of Scythians?[2] http://www.sino-platonic.org/complete/spp127_getes.pdf[3] Scythian - Jatland Wiki",
            "date": "Updated December 27, 2018",
            "views": "281",
            "upvotes": " View 78 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohan Chauhan",
                    "user_href": "/profile/Rohan-Chauhan-88"
                },
                {
                    "user_id": "Phillip Brewer",
                    "user_href": "/profile/Phillip-Brewer-17"
                },
                {
                    "user_id": "Aafreen Rajput",
                    "user_href": "/profile/Aafreen-Rajput-1"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/Akshay-Kumar-9444"
                },
                {
                    "user_id": "Ariana Shah",
                    "user_href": "/profile/Ariana-Shah"
                },
                {
                    "user_id": "Anugya Singh",
                    "user_href": "/profile/Anugya-Singh-48"
                },
                {
                    "user_id": "Jaypal Patel",
                    "user_href": "/profile/Jaypal-Patel-7"
                },
                {
                    "user_id": "Nick Wooley",
                    "user_href": "/profile/Nick-Wooley-1"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Intsar Ahmad",
                    "user_href": "/profile/Intsar-Ahmad-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Bustamante",
                "href": "/profile/Jose-Bustamante-21"
            },
            "answer_text": "It would make more sense to list who is not a modern day descendant of the Scythians. Scythia[1] as a state began almost 3000 years ago, and ended almost 2000 years ago. And in those years in between and since its people have been conquered multiple times, resulting in much intermarriage and interbreeding between them and the peoples of three continents, Europe, Africa, and Asia. And they have participated in numerous conquests, resulting in much intermarriage and interbreeding between them and other peoples from the same three continents. Finally, all of that intermarriage and interbreeding happened well over a thousand years before multiple migrations of their descendants in numbers from Europe to Australia and to the Western Hemisphere began, which then involved much more intermarriage and interbreeding with indigenous peoples on three whole new continents, Australia, North America, and South America. So basically the only continent not touched by people of Scythian descent is the one continent that is not permanently inhabited, Antarctica, and even that one doesn’t count because Scythian descendants have no doubt been there as often as anyone. And of course the same can be said with varying degrees of accuracy for all ancient cultures. To find someone who has no hereditary connection to Scythia, you need to look for “pure-blooded” (I hate that term) members of indigenous peoples of North and South America, and the Asia-Pacific Region. Anyone else has a fair chance of having at least one ancestor who was Scythian. Footnotes[1] Scythia - Wikipedia",
            "date": "Answered October 23, 2017",
            "views": "106",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnny Doe",
                    "user_href": "/profile/Johnny-Doe-256"
                },
                {
                    "user_id": "Meister Proper",
                    "user_href": "/profile/Meister-Proper-1"
                },
                {
                    "user_id": "Jamal Themba Mtshali",
                    "user_href": "/profile/Jamal-Themba-Mtshali"
                },
                {
                    "user_id": "Ryan Patrick Barnes",
                    "user_href": "/profile/Ryan-Patrick-Barnes"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Kristiina Paunel",
                    "user_href": "/profile/Kristiina-Paunel"
                },
                {
                    "user_id": "Tich Tran",
                    "user_href": "/profile/Tich-Tran"
                },
                {
                    "user_id": "Another Perspective",
                    "user_href": "/profile/Another-Perspective-4"
                },
                {
                    "user_id": "Jacquelyn Chambers",
                    "user_href": "/profile/Jacquelyn-Chambers-2"
                },
                {
                    "user_id": "Tt Hyy",
                    "user_href": "/profile/Tt-Hyy"
                }
            ]
        }
    ]
}