{
    "title": "Who is Cyntoia Brown, and what are the implications of her case? - Quora",
    "tags": [
        "Cyntoia Brown",
        "Justice",
        "Police and Law Enforcement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Anderson",
                "href": "/profile/Mike-Anderson-779"
            },
            "answer_text": "Cyntoia Brown was a juvenile delinquent whose pattern of violence began around age 12 when she attacked and injured a teacher.She had some 20 other incidents of violence and abuse in and out of the juvenile system before she ran away from home at age 16. Out on her own, she lived place to place, presenting herself to appear older. She claimed to be 19, and provided everyone including police a false birthdate to that effect, and a false name. About three weeks prior to the murder she committed, she hooked up with a 24 year old black man named Garion McGlothen(aka “Kut”). They did drugs together, had sex, and lived in hotels. While initially she was protective of Garion, later she called him an abusive pimp, sometimes forcing her to have sex with him. On the night of the murder, Cyntoia was streetwalking, soliciting sex for money to pay for the hotel and drugs. She solicited Johnny Allen, a 43 year old white real estate agent. She told him she was 19, and offered him sex in exchange for $200, they negotiated to $150. Johnny drover her home, fed her dinner, They talked about how Johnny was a sharpshooter in the army, and he showed her his rifles. They watched TV and chatted. When Johnny tried to initiate sex, Cyntoia pulled away and said she wanted to sleep. Johnny never forced himself on her, never abused her, never held her against her will, and never raped her — instead Johnny went to sleep, but he would never wake up. Cyntoia took her gun our of her bag and shot him at close range in the back of the head as he was sleeping. Then she robbed him taking his wallet, phone, rifles, and his truck. Back at her hotel, her boyfriend Garion was angry that she brought the rifles to their room without cover. She then tried to enlist some other guests she knew at the hotel to go BACK to Johnny and take more things to pawn. She bragged about killing Johnny. They declined, and later turned her in. When she was arrested, she immediately told police the Garion had nothing to do with it — “I did it” she said. She signed a Miranda waiver and confessed, claiming self defense, however, evidence shows that there were no defensive wounds and that he was sleeping on his hands with his hands intertwined. 16-year-olds are normally tried in adult criminal court for serious crimes like murder. Cyntoia is not at all unique in this way. There are currently 2500 people serving life sentences in the USA for crimes they committed as minors (some as young as 13). This is a major failing of the juvenile/criminal justice system in the US. Due to the mandatory minimums in Tennessee that ere enacted in 1995, the judge had no choice in sentencing, despite Cyntoia’s age and recent circumstances. Sometime mid/late-2017, a false narrative of Cyntoia emerged, with false/fake news stories claiming that she was a “sex slave” and that she “killed her pimp” These stories made a point to victim-blame Johnny Allen, and many covered up the true pimp (Garion) and instead claimed that Johnny was her pimp. None of these stories are true, thus altering reality and attempting to paint her a s victim. About November of 2017 pop star Rihanna rallied behind Cyntoia along with some other celebrities call for clemency. This caused the predictable social media outpouring of support with people making comparisons to others with short sentences (those others were not murderers, however). The fake news stories intensified as well, with some believing she was kidnapped and shackled in confinement as a sex trafficking victim. None of this false narrative has any resemblance to reality. But the false narratives likely did not help Cyntoia, as it resulted in a strong backlash from those closer to the truth, and throughout the internet, who became steadfast in advising the governor to deny clemency. Nevertheless there are mitigating circumstances. She was born to Georgina Mitchell, a 16 year old white girl who drank heavily during pregnancy. This possibly caused Fetal Alcohol Syndrome. She was given up for adoption at about 8 months to Ellenette Brown, who Georgina knew from childhood, who became her permanent adoptive mother. Cyntoia’s black father is unknown, but thought to possibly be Ellenette’s son. Later psychiatric diagnosis classed her as “Borderline Personality Disorder” and with her demonstrated behaviors of Antisocial Personality Disorder (ASPD), this combines into a fairly classic sociopath (though no PCL-R test has ben done that I know of), Has or can she out-grow this? A VALID point here is that while a 16 year old accused of murder should not be granted the minimal penalty of juvenile court (release at age 19 regardless of crime) they also should not get the mandatory life in prison she received from criminal court. There needs to be a middle ground. Especially with mitigating circumstances such as her childhood, and mental diagnosis. This also shows the major fallacy with mandatory sentences. At present there is no middle ground. Nevertheless, the false narrative and resultant backlash may have been a factor in Cyntoia being passed over for clemency by the governor while 11 others were granted clemency or commutation in Tennessee. Remember this: If you have to LIE to make a point, then you have no point. REPERCUSSIONS OF SJW ACTIVISM: Instead of focusing on the injustice of the system (as it applies to the over 2500 serving life in the US for crimes committed as a minor) the SJWs tried to create a false case around Cyntoia, claiming victimhood while simultaneously victim-blaming Johnny Allen as an abuser. The reaction by insiders to this fictitious re-telling and attempt to paint Cyntoia as a victim, turned into a staunch “keep her locked up for good” attitude. The SJWs responsible should consider this the next time they want to MinRec history. They may have harmed Cyntoia’s chance at clemency more than they know. ",
            "date": "Updated January 2, 2019",
            "views": "109",
            "upvotes": " View 95 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aidan Dinh",
                    "user_href": "/profile/Aidan-Dinh"
                },
                {
                    "user_id": "Antonio Mendoza",
                    "user_href": "/profile/Antonio-Mendoza-40"
                },
                {
                    "user_id": "Shinron Gero",
                    "user_href": "/profile/Shinron-Gero"
                },
                {
                    "user_id": "Connor Winiata",
                    "user_href": "/profile/Connor-Winiata"
                },
                {
                    "user_id": "Aniela Then",
                    "user_href": "/profile/Aniela-Then-1"
                },
                {
                    "user_id": "Caleb Daniels",
                    "user_href": "/profile/Caleb-Daniels-25"
                },
                {
                    "user_id": "James Ellington",
                    "user_href": "/profile/James-Ellington-9"
                },
                {
                    "user_id": "Ella Mullenex",
                    "user_href": "/profile/Ella-Mullenex"
                },
                {
                    "user_id": "Steve Waskow",
                    "user_href": "/profile/Steve-Waskow-2"
                },
                {
                    "user_id": "Miranda Tello",
                    "user_href": "/profile/Miranda-Tello"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emilie Cithara",
                "href": "/profile/Emilie-Cithara"
            },
            "answer_text": "Cyntoia Brown is the victim of a broken system, thanks to outdated laws and poor judgement. She was charged with first degree premeditated murder, first-degree felony murder and especially aggravated robbery for shooting a 43-year-old man called Johnny Mitchell Allen in the back of the head and stealing his money, two guns and his truck. However, Allen at the time solicited sex from her, and she claimed it was self-defence because she thought he was reaching for a gun (which he had shown a collection of earlier) Some key facts to note is that she’s firstly an underage minor, and she’s been given a life sentence, with elegibility for parole age 69. Some implications of her case include: She had an abusive childhood, due to being raped several times, beaten and held at gunpoint. She also was constantly in children’s custody because her mother was a heavy drinkerShe was pimped out by her boyfriend, against her wishes. Sex trafficking affected her emotionally and physically.She was an underage minor being sold for sex and being constantly drugged yet the verdict included charges for prostitution, even though the laws have changed now and to be a prostitute you must be 18, otherwise you are a victim in the eyes of the lawMany celebrities such as Kim Kardashian, Rihanna and Cara Delevinge are looking into the case with their lawyers to see if they can helpShe had already been imprisoned for 13 yearsThe poor girl does not deserve this. [1] [2] #FreeCyntoiaBrown - M x Footnotes[1] https://www.aol.com/article/news/2017/11/22/cyntoia-brown-is-serving-a-life-sentence-for-killing-a-man-while-trying-to-escape-the-horrors-of-child-sex-slavery/23285696/[2] PEOPLE Explains: The Case of Cyntoia Brown, Who Murdered a Man as Teen After Being Forced Into Prostitution",
            "date": "Answered November 22, 2017",
            "views": "559",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio Mendoza",
                    "user_href": "/profile/Antonio-Mendoza-40"
                },
                {
                    "user_id": "Terry Warrick",
                    "user_href": "/profile/Terry-Warrick-1"
                },
                {
                    "user_id": "David Hoefelman",
                    "user_href": "/profile/David-Hoefelman"
                },
                {
                    "user_id": "Emily M. Perez",
                    "user_href": "/profile/Emily-M-Perez-2"
                },
                {
                    "user_id": "Kenny Smith",
                    "user_href": "/profile/Kenny-Smith-127"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Crystal-Indigo"
                },
                {
                    "user_id": "Stormy Ott",
                    "user_href": "/profile/Stormy-Ott"
                }
            ]
        }
    ]
}