{
    "title": "Who are the 10 most cruel emperors in Indian history? - Quora",
    "tags": [
        "Military History and Wars of India",
        "Emperors",
        "Cruelty",
        "History of India",
        "Historical India",
        "Indian Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katakam Manas Teja",
                "href": "/profile/Katakam-Manas-Teja"
            },
            "answer_text": "Calling Emperors Cruel is a matter of contention and subjective discussion . Further, the opinions may vary from person to person based on their religion, region, language and other factors.. Sikandar ButshikanThis man is not as famous as other Indian Rulers but his acts of cruelty were unambiguously recorded in the History of India. He wins this title of the Cruelest Rulers hands down , for his explicitly exhibited hatred against the Buddhists & Hindus and the policies he adopted to persecute them. He is famous for his achievement of firmly establishing the Islamic faith in Kashmir, but in order to achieve his religious duties, he indulged in some of the heinous crimes against the humanity. Sikandar Butshikan , to entrench Islam, imposed severe restrictions on the Hindu Rituals, razed numerous Historical Temples [ including the famous Martand Sun Temple ] apart from ordering the massacres of Buddhists and Hindus, who dissented his conversion tactics. His name is itself a title awarded him for his Religious Iconoclasm. “….Sikandar won the sobriquet of but-shikan or idol-breaker, due to his actions related to the desecration and destruction of numerous temples, caityas, viharas, shrines, hermitages and other holy places of the Hindus and Buddhists. He banned dance, drama, music and iconography as aesthetic activities of the Hindus and Buddhists and fiated them as heretical and un-Islamic. He forbade the Hindus to apply a tilak mark on their foreheads. He did not permit them to pray and worship, blow a conch shell or toll a bell. Eventually he went on burning temples and all Kashmiri texts to eliminate Shirk. Sikandar stopped Hindus and Buddhists from cremating their dead. Jizya (poll-tax) equal to 4 tolas of silver was imposed on the Hindus…..” from Sikandar Butshikan 2. Aurangzeb - This man finishes a close second in the competition of ‘Cruelest’ Ruler in the Indian History. Though not many Islamic Rulers were tolerant, many of them were not extremely ruthless in persecuting the people of other faith. Aurangzeb stands apart among all those ruthless individuals by virtue of his activities. He was essentially a religious zealot who thought he was a’ Sword of Allah’ and had little tolerance for the majority of the Indian Faith. Apart from executing the Sikh Gurus , Aurangzeb razed many famous Hindu temples in Holy places like Mathura, Varanasi and ordered mosques to be built over them. He singlehandedly caused the downfall of the Mughal Empire by making enemies out of Hindu Rajputs , who used to serve the Mughals from the time of Akbar. Indian History books often overlook the Aurangzeb’s acts for various political reasons. Aurangzeb’s Religious Intolerance 3 . Feroz Shah Tuglaq - The cousin of the infamous Mohammad-Bin-Tuglaq became renowned among his muslim ulema for carrying out the religious wars against the infidels. He reinstated the policy of Jiziya [ the infidel tax] to be paid by the Hindus . He was also known to have ordered killings of his citizens for not converting into Islam . Persecution of Hindus 4. Allauddin Khilji One of the most powerful of the Sultans of Delhi, Alaluddin Khilji was one of the few rulers who resisted the Mongol invasions successfully. He was as famous for his military acumen as much as for his ruthlessness in his dealings with people ,suspected of any treachery. Unlike the others in the list, he did not like the authority of the Religious Scholars and kept them at bay , but his cruelty manifests in his other acts. He ordered the massacre of Mongols as he suspected their loyalty and which resulted in the massacre of about 20,000 people in matter of days. Alauddin Khilji 5. Pushyamithra Sunga The Brahmin King, who usurped the throne from the Mauryan Ruler exhibited the characteristics of a fanatic by following a cruel policy of exterminating the Buddhist Monks and destroying the Structures “….slaughtered monks and the organization's residence; after which he proceeded to Shakala (Sialkot) where he issued an edict awarding a gold piece for every head of a Buddhist monk brought to him. These accounts state the destruction continued until he arrived at the Bodhi tree.According to other accounts, Pushyamitra Shunga proceeded to Shakala and offered 100 Dinaras for the head of every Buddhist monk. …” Though the Archaeological Evidences do not unambiguously attest these facts, there is little doubt that a series of events leading to the destruction of Buddhist Structures occurred during this man’s reign. Pushyamitra Shunga 6. Mihirakula : This Hepthalite Emperor,Mihirakula | Huna king ,was recorded to have ordered killing numerous Buddhist monks. The Indian and Chinese Buddhist sources indicate that Mihirakula, a Saivate king of Hepthalites was hell bent on destroying the Buddhist Structures along with the massacre of tens of hundreds of Buddhist monks. 7 .Akbar Another famous ruler, who is known to be tolerant and benevolent , but some events during his lifetime provide an opposite narrative. After his successful seige of chittorgarh, he kileld the non-combatants of the city and ordered a ‘Mountain of Skulls’ to be prepared “…About 25,000 people were massacred whom had helped the resistance. Akbar then ordered the heads of his enemies to be displayed upon towers erected throughout the region, in order to demonstrate his authority and his victory over the Chittorgarh “ Siege of Chittorgarh 8. Tipu Sultan The famouss Mysore Tiger, known for his chivalrous fight against the British , had his own darker and cruel sides to which many of us are not aware. While he was tolerant in his Myosre domain as he patronised numerous Hindu temples, his atrocities against non-combatant Hindus and Christians was equally cruel. His invasions to Coorg and Malabar areas and the forced conversions in light of his campaigns attest this fact. Captivity of Kodavas at Seringapatam Tipu Sultan 9.Ashoka Ashoka, considered to be the greatest of all the Emperors, is also famous for his cruelty and Coldblooded nature in his initial days. He was certainly very cruel during his earlier days of the ascension to the throne. He is said to have killed his elder brothers for the emperor-ship. “Taranatha also states that Ashoka was initially called \"Kamashoka\" because he spent many years in pleasurable pursuits (kama); he was then called \"Chandashoka\" (\"Ashoka the fierce\"), because he spent some years performing extremely wicked deeds; and finally, he came to be known as Dhammashoka (\"Ashoka the righteous\") after his conversion to Buddhism.” from Ashoka - Wikipedia Many stories related to his cruelty are present in ‘Ashokavadana’ , a buddhist source regarding the life of Ashoka. Even after the Kalinga War, as against the popular perception, he retained the death penalty and made several campaigns into the tribal lands. 10. Raghoji I Bhonsle One of the least famous among the list, Raghoji was the leader of Marathas from 1740s to 1753. This man is quite unique among the list . Marathas under Raghoji, launched continuous campaigns into Eastern India with the sole purpose of plunder and pillage of the towns and villages. In 10 years, apart from causing a huge property loss, thousands of ordinary village and town folks were killed nonchalantly. Raghoji was a typical Opportunist as ruthless and he saw in the troubles of other states an opening for his own ambition, and did not even require a pretext for plunder and invasion. Twice his armies invaded Bengal, and he obtained the cession of Cuttack. Chanda, Chhattisgarh, and Sambalpur were added to his dominions between 1745 and 1755, These continuous expeditions made a vicious impression in the minds of bengalis later in history and were called Bargi Raghoji I Bhonsle The above list is made based on a few parameters to measure the degree of Cruelty to rate them. IT should be made clear that ‘Killing’ in warfare essentially doesn’t point the cruelty of the Individual. In that case, every single monarch in history can be called a maniac or cruel. Hence, only the Emperors who were recorded to commit atrocities like killing non-combatants during the Peace periods or Non-War times shall be considered. Also, the foreign invaders like Mohammed of Ghazni or Ghori , Timur or Alexander or Nadir Shah would not be considered due to their obvious non-Indian origins. It is also quite difficult to find any quality historical sources that attest the character of a Ruler . Most of the historical inscriptions talk about the achievements or other acts but very few delve into the personal characteristics of the Emperor. So, the list was compiled based on the available reliable and candid historical evidences from various sources. ",
            "date": "Updated January 23, 2020",
            "views": "727",
            "upvotes": " View 94 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Vineeth Dubbaka",
                    "user_href": "/profile/Vineeth-Dubbaka"
                },
                {
                    "user_id": "Shiv Malik",
                    "user_href": "/profile/Shiv-Malik-10"
                },
                {
                    "user_id": "Anuradha Roy",
                    "user_href": "/profile/Anuradha-Roy-71"
                },
                {
                    "user_id": "Aditya Soni",
                    "user_href": "/profile/Aditya-Soni-327"
                },
                {
                    "user_id": "April",
                    "user_href": "/profile/April-696"
                },
                {
                    "user_id": "Neel Gupta",
                    "user_href": "/profile/Neel-Gupta-2"
                },
                {
                    "user_id": "Shubham Pratap",
                    "user_href": "/profile/Shubham-Pratap-23"
                },
                {
                    "user_id": "Usha Banga",
                    "user_href": "/profile/Usha-Banga-3"
                },
                {
                    "user_id": "Ekbal Moledina",
                    "user_href": "/profile/Ekbal-Moledina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gajendra Rathore",
                "href": "/profile/Gajendra-Rathore-34"
            },
            "answer_text": "There were many cruel emperors in Indian history who killed innocent people . Many emperors known for thier injustice, misusing of public wealth,wrong policies. But history depends on source and most of literature as source were written in Salter of kings so ………… I try to answer this question according to my knowledge about history but I can not say underwritten 10 kings were most cruel in Indian history because it is not universal fact.every student of history can write answer of this question according to their knowledge. 1 British empire in India (1757 AD-1947 AD)   We all know how British rule was cruel for India. 2 Aurangzeb (Aurangzeb has been subject to controversy and criticism for his policies that abandoned his predecessors' legacy of pluralism and religious tolerance, restart jaziya tax, destruction of temple like kashi mathura, forced conversion and execution of the ninth Sikhs guru tegbahadur. 3 pushiya mitra sung(Pushyamitra was originally a Senapati\"General\" of the Maurya Empire. In 185 BCE he assassinated the last Mauryan Emperor, Brihadratha Maurya, during an army review, and proclaimed himself King. The Buddhist texts state that Pushyamitra cruelly persecuted the Buddhists.  4 Ibrahim Lodi (Ibrahim Lodhi was the last ruler of the Lodhi dynasty. Jalal ( his younger brother )was killed by Ibrahim's men and he claimed the whole empire. Ibrahim did not have good relations with the nobles. He ill-treated and imprisoned them. He was also cruel to his subjects and killed and poisoned many noblemen.) 5 firoj shah tuglak (He was tuglak sultan from 1351 A.D to 1388 A.D. He was famous for his religious policy, destruction of temple, forced conversion . He did bad behaviour with Sufi sent and Shiahs.  6 Dhana nand (Dhana Nanda was the last king of Nanda Empire. the expenses of a vast army he made financial extortion of the people. His love of hoarding wealth by squeezing the people made him hateful to them .) 7 raja raja chola (for making temple of rajrajeshwer he attacked many states and captured monny. People were killed in it.) 8 babur 9 Nizam of Hyderabad (1947 — 48 reference -unification of india) 10 chand ashoke (ashoke before kalinga attack )—-moury king ashoke attacked on kaling . war in Kalinga, which reportedly had resulted in more than 100,000 deaths and 150,000 deportations, ending at around 200,000 deaths. ",
            "date": "Updated March 7, 2018",
            "views": "202",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anuradha Roy",
                    "user_href": "/profile/Anuradha-Roy-71"
                },
                {
                    "user_id": "Shubham Pratap",
                    "user_href": "/profile/Shubham-Pratap-23"
                },
                {
                    "user_id": "Manav Singh",
                    "user_href": "/profile/Manav-Singh-206"
                },
                {
                    "user_id": "Sarbesh Mallick",
                    "user_href": "/profile/Sarbesh-Mallick"
                },
                {
                    "user_id": "Mohan Singh",
                    "user_href": "/profile/Mohan-Singh-79"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MANJARI-BOSE"
                },
                {
                    "user_id": "Sohan Lal Rathore",
                    "user_href": "/profile/Sohan-Lal-Rathore-1"
                },
                {
                    "user_id": "Tanmay Singh",
                    "user_href": "/profile/Tanmay-Singh-258"
                },
                {
                    "user_id": "KAILASH RATHORE",
                    "user_href": "/profile/KAILASH-RATHORE-1"
                },
                {
                    "user_id": "Neelarka Roy",
                    "user_href": "/profile/Neelarka-Roy"
                }
            ]
        }
    ]
}