{
    "title": "Who would win, Indominus rex or Tyrannosaurs rex? - Quora",
    "tags": [
        "Indominus Rex (Jurassic World)",
        "Tyrannosaurus Rex",
        "Dinosaurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adwaith Ram",
                "href": "/profile/Adwaith-Ram-1"
            },
            "answer_text": "Any time of the day, I would have chosen indominus Rex over trex but the fight from Jurassic world changed my mind.Here is why In the movie, a five year old(or less) indominus fought a 25yr old t rex.To be honest going by the books , how can a normal T-Rex kill a genetically enhanced version of itself?But we have the answer… Indominus is bigger,stronger and more intelligent than trex but she was badly shaken up in a fight to such an extended that she had to use her claws to defend her self.So you may say irex wins because of the arms but think about this, a prime irex needed it's arms to beat a 25yr old veteran trex …that too restrained in captivity for the last 10years…we cannot say the Jurassic world fight scene was inaccurately depicted as the scene was shot by the same people who made the indominus in the first place. As I was saying, irex struggled with an old Rex and then got completely dominated when one single raptor got involved means that we need to think about irex vs rexy at her prime. I don't think anybody has a doubt about who is more powerful between rexy from JW and herself from JP(1993)….because it's natural to get weak , growing old because the life span of trex under captivity cannot go beyond 30yrs So the question is, what difference will we see in this new fight with prime rexy, ….logically thinking, if 25yr old rexy could dominate irex in a head on collision( as we saw in the early seconds of the fight) prime Rex can do it in half the time.Now, if irex uses the arms, will prime rexy fall the way her older self did? The answer is NO…because rexy simply smashed irex without a sweat after a hardly 170lb raptor started interfering ….so a 5 year old trex can quickly get up from irex's claw onslaughts… Now I know it's nonsense to say trex can beat irex but think about this…how many of you think a liger could beat a Siberian tiger?Ligers are bigger but everything else goes to the tiger…but here the case is different because irex is more intelligent and aggressive but one thing we forgot….its genetically unstable.It wasn't made to kill trex..it was made to hide from thermal vision, camouflage in the jungles and be more intelligent and hence it can do things which trex cannot do but it can never beat a trex in a straight on fight because even though it is bigger, it is lightly build, with narrower jaw and irregularly arranged teeth , even giving it an under bite…humans are more advanced than chimps , we can irradiate them from entire planet if we want, we can make them our slaves and harass them with weapons but can a UFC fighter beat a chimpanze in a one on one fight…we are roughly the same weight but still we can't do it… apply the same here…irex is weapon for the modern world but its not a trex killer, trex is wild animal while irex is bio machine, more dangerous and ruthless but not a trex beater I just watched the JW fight and analysed it with basic common sense…had the irex completely dominated the old and weak trex without taking any blow in their one on one fight, I would have gone with irex…but that wasn't the case..the scene showed that irex was lucky to have had longer arms…. ",
            "date": "Answered September 27, 2020",
            "views": "365",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sayandip Dutta",
                    "user_href": "/profile/Sayandip-Dutta-5"
                },
                {
                    "user_id": "Arjun Chaudhary",
                    "user_href": "/profile/Arjun-Chaudhary-138"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Haynes",
                "href": "/profile/Matthew-Haynes-1"
            },
            "answer_text": "I am going to look at what anatomy and paleontology tell us about what Indominous rex might have been like had it been a real animal. So let’s pretend that it was for a moment. Jurassic Park suped up all of its animals; so Indominous logically would be, too. Velociraptor is considerably larger than its real-life counterpart; Tyrannosaurus is much faster; Dilophosaurus gained its venom and frill (the double crests are real, that’s what it was named for). Where Indominous is likely to have been “improved on” for the sake of Hollywood is in durability (no animal that has ever lived on land could withstand an ankylosaur’s tail club to the face), in jaw power (crossing a Tyrannosaurus with any other dinosaur would probably make it take a dip in bite force), and in agility (with the giant forearms and giant head, it would become very front-heavy, and lacked a tail long enough to properly counterbalance it). You see, tyrannosaurs did not evolve such tiny forelimbs so that they could be the butt of 20th century jokes, they did so to primarily to allow for a larger and heavier head without sacrificing the agility needed to keep up with ornithischian prey. Those giant arms Indominous has would be more of a hindrance than a help, preventing it from turning fast enough to keep up with the true king of dinosaurs. The small arms also allow for more of the retail on the sides and shoulders of tyrannosaurs for neck and jaw muscles, giving them a much more powerful bite and shake. With claws that are both long and thin, Indominous looks menacing, but claws that are good for killing need to be more hooked and thicker. So the giant arms of Indominous rex damage both its agility and its killing power. Bet on Tyrannosaurus. *PS: You will notice that I did not italicize the name Indominous rex, as this is not an actual scientific name. I would further like to reiterate here that I think Jurassic World was stupid. ",
            "date": "Answered November 18, 2017",
            "views": "47",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arjun Chaudhary",
                    "user_href": "/profile/Arjun-Chaudhary-138"
                },
                {
                    "user_id": "Andy Walsh",
                    "user_href": "/profile/Andy-Walsh-33"
                },
                {
                    "user_id": "Stelar Curtis",
                    "user_href": "/profile/Stelar-Curtis-2"
                },
                {
                    "user_id": "Adam Adam",
                    "user_href": "/profile/Adam-Adam-1210"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Moejj-ORyzen-1"
                },
                {
                    "user_id": "Kayhan K",
                    "user_href": "/profile/Kayhan-K"
                },
                {
                    "user_id": "Adam Wood",
                    "user_href": "/profile/Adam-Wood-282"
                },
                {
                    "user_id": "Kaiming Wang",
                    "user_href": "/profile/Kaiming-Wang-4"
                },
                {
                    "user_id": "Bima Crystal",
                    "user_href": "/profile/Bima-Crystal"
                },
                {
                    "user_id": "Reece Jerome",
                    "user_href": "/profile/Reece-Jerome"
                }
            ]
        }
    ]
}