{
    "title": "Who was the most eccentric first lady? - Quora",
    "tags": [
        "Eccentricity",
        "First Ladies of the USA"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rodney Milner",
                "href": "/profile/Rodney-Milner-1"
            },
            "answer_text": "First of all, I’m going to assume you mean First Ladies of the United States, based on the other answers here. In my opinion, based on how the way she dressed was considered quite striking for her time, I’d say Jackie Kennedy. Nancy Reagan followed in her footsteps too, really. Some other mentions I’d say: I’d have to agree with answers here on Mary Todd Lincoln. She had numerous mental health problems and was probably the most troubled first lady in American history. Of course, it’s quite understandable: of the four sons her and Abraham Lincoln had, only one of them lived to adulthood, and she also had to see her husband get assassinated first-hand, which really, is a distinction that also applies to Jackie Kennedy, and Lincoln and Kennedy are the only first ladies this can apply to in United States history. By the 1870s, roughly a decade after her husband’s assassination, Mary Todd Lincoln had to be sent to a mental institution. Lincoln is the only first lady in American history known to have done so (although, due to her alcoholism, Betty Ford literally founded the Betty Ford Clinic in Rancho Mirage, California, near Los Angeles, which is why I think it’s fair to include her as an example of an eccentric first lady as well). Eleanor Roosevelt really is the first lady who set the standards of what a modern-day first lady is. Before her, there really were no first ladies who did too much to champion causes. Florence Harding was our first divorced first lady. In fact, Betty Ford is the only first lady since her that has been divorced (although, if he gets elected, it’s worth noting that Joe Biden’s wife, Jill Biden, got divorced from her first husband, Bill Stevenson, in 1975). Andrew Jackson’s wife, Rachel Jackson, had been divorced, but she wasn’t first lady because she died before Andrew Jackson became president. (In fact, she died during the transition from John Quincy Adams’s presidency, which the nastiness seen during the 1828 election caused Andrew Jackson to blame those in the Adams campaign during the election for his wife’s death) Abigail Adams was a first lady who was truly ahead of her time. Adams has been an inspiration to the modern-day feminist movement-and in letters with her husband when he was a Founding Father right as the United States was becoming an independent nation from Great Britain, she clearly wanted women to be ahead in ways that were not typical for the eighteenth century. Just as a side note, she and Barbara Bush are the only first ladies to have also been mothers of presidents-Adams of John Quincy Adams, and Bush of George W. Bush. Jane Pierce probably had the most tragic time as a first lady (other than probably Mary Todd Lincoln). Pierce’s three sons all died as children, and her husband became more and more of an alcoholic. Understandably also, Jane Pierce never liked being in Washington D.C., or the public eye, at all. Ida McKinley would be another example of a first lady who had a very tragic life, as just three years before her husband’s assassination, her brother was murdered. Louisa Adams and Melania Trump are the only two first ladies to have been born outside what is now the United States, with Trump being the first naturalized first lady in our history, as she came from Slovenia (while Louisa Adams was born in the United Kingdom, she had an American father, Joshua Johnson). And the craziest part here of all: Edith Wilson. As Woodrow Wilson suffered a stroke in 1919 while in office, his wife worked with her husband’s Cabinet members to basically run the country as it wasn’t clear what to do if the president was incapacitated. (This was long before the 25th Amendment, which was passed in 1967 under Lyndon B. Johnson) The last seventeenth months of the Wilson administration, from October 1919 (when Woodrow Wilson had his stroke) to March 1921 basically had Edith running the country effectively in his place with the help of her husband’s advisors. (Woodrow Wilson is also the only president to have had a stroke while in office other than Franklin D. Roosevelt, who died in office from one, but two had heart attacks while in office, which is why Warren G. Harding died in office in 1923, and then Dwight D. Eisenhower had a non-fatal one in 1955, as did Lyndon B. Johnson that same year, before he became president) ",
            "date": "Answered July 9, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ryan Jacob Dunfee",
                    "user_href": "/profile/Ryan-Jacob-Dunfee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Gray",
                "href": "/profile/Gregg-Gray-1"
            },
            "answer_text": "Original Question: Who was the most eccentric first lady? I'm going to say it was Mary Todd Lincoln. She was wrapped way too tight and about drove Lincoln to financial ruin at times. She was 5′ 2″ and considered plump so she was full 14 inches shorter than the President and I think she had a bad case of short woman syndrome. There is some convincing documentation that the President was routinely battered by Mrs. Lincoln. She is reputed to have believed she wasn't being supported in the manner she most wanted. Luckily for her Lincoln had managed to build up a bank account of I believe $85K, in spite of her lavish spending. She has said that Lincoln intended to not spend a dime of his salary during the second term. Lincoln would have been 60 when he completed his second term, and there wasn't any Presidential Retirement, that didn't come along for right at 90 years. So he had planned to return to practicing law. Neither of them did well with the death of their son in 1850 and then another son in 1862, and she let those feelings and emotions show. The death of her husband greatly compounded her grief, despite what their relationship was. Another son was to die aged 18, but he outlived his parents.  President Lincoln had drawn a draft of $800 to himself the day before he was shot to cover household expenses, which is quite a lot, $800 in 1865 is worth $12,583.51 in 2020. She certainly had an abundance of stressors in her life, and apparently was not well equipped mentally to handle them. Ya know, another First Lady who was pretty eccentric was Nancy Reagan. She was a good actress and that is what the American people saw. But behind that she had a hellacious temper and would have folks fired. She was very protective of the President, but didn't take much interest in the kids or grandkids. She just wanted the President out of office and all to herself again, or so she said. I know it was reported that she was very attentive as he declined into dementia. She had no problem picking up a phone and calling over to our offices and “requesting\" that a certain individual not be allowed to work with her again. ",
            "date": "Updated June 30, 2020",
            "views": "176",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rodney Milner",
                    "user_href": "/profile/Rodney-Milner-1"
                },
                {
                    "user_id": "John Sullivan",
                    "user_href": "/profile/John-Sullivan-469"
                },
                {
                    "user_id": "Peter Bensen",
                    "user_href": "/profile/Peter-Bensen-2"
                },
                {
                    "user_id": "Humza Siddiqi",
                    "user_href": "/profile/Humza-Siddiqi-1"
                },
                {
                    "user_id": "Jenifer DePaolo",
                    "user_href": "/profile/Jenifer-DePaolo"
                },
                {
                    "user_id": "Ibrahim G Zalloum",
                    "user_href": "/profile/Ibrahim-G-Zalloum"
                },
                {
                    "user_id": "Karen Ware",
                    "user_href": "/profile/Karen-Ware-2"
                },
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Hannah Warfel",
                    "user_href": "/profile/Hannah-Warfel"
                },
                {
                    "user_id": "Tuan Bui",
                    "user_href": "/profile/Tuan-Bui-79"
                }
            ]
        }
    ]
}