{
    "title": "Who was the most powerful king in the history of India? - Quora",
    "tags": [
        "Kings (royalty)",
        "History of India",
        "Historical India",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Onkar Pawar",
                "href": "/profile/Onkar-Pawar-50"
            },
            "answer_text": "Here are the great emperors of India. I took the size of the territory won and the influence on the people & culture as the measure of the emperor's greatness. India has been the place of many rulers. Many kingdom flourished over here and they have the remains till now. Of all the kingdoms in India, there are a few kingdom which changed the scenario and history of India. 1# Chandragupta Maurya (340 BC – 298 BC) :  He was the founder of the Maurya Empire and the first emperor to unify most of Greater India into one state. He ruled from 322 BC until his voluntary retirement and abdication in favour of his son Bindusara in 298 BC. Chandragupta Maurya was a pivotal figure in the history of India. Prior to his consolidation of power, most of the Indian Subcontinent was divided into small states, while the Nanda Empire dominated the Indus-Gangetic Plain.[6] Chandragupta succeeded in conquering and subjugating almost all of the Indian subcontinent by the end of his reign, except the Tamil regions (Chera, Chola and Pandya) and modern day state Odisha (Kalinga). His empire extended from Bengal in the east, to Afghanistan and Balochistan in the west, to the Himalayas and Kashmir in the north, and to the Deccan Plateau in the south. It was the largest empire yet seen in Indian history 2# Samrat Ashoka (304–232 BCE) :  He was commonly known as Ashoka and Ashoka the Great, was an Indian emperor of the Maurya Dynasty who ruled almost all of the Indian subcontinent from circa 269 BCE to 232 BCE. One of India's greatest emperors, Ashoka reigned over a realm that stretched from the Hindu Kush mountains in the west to Bengal in the East and covered the entire Indian subcontinent except parts of present-day Tamil Nadu and Kerala. The empire's capital was Pataliputra (in Magadha, present-day Bihar), with provincial capitals at Taxila and Ujjain. In about 260 BCE Ashoka waged a bitterly destructive war against the state of Kalinga (modern Odisha). He conquered Kalinga, which none of his ancestors had done.He embraced Buddhism after witnessing the mass deaths of the Kalinga War, which he himself had waged out of a desire for conquest. \"Ashoka reflected on the war in Kalinga, which reportedly had resulted in more than 100,000 deaths and 150,000 deportations. Ashoka converted gradually to Buddhism beginning about 263 BCE 3# Porus/Puru :  As for the Macedonians, however, their struggle with Porus blunted their courage and stayed their further advance into India. For having had all they could do to repulse an enemy who mustered only twenty thousand infantry and two thousand horse, they violently opposed Alexander when he insisted on crossing the river Ganges also, the width of which, as they learned, was thirty-two furlongs, its depth a hundred fathoms, while its banks on the further side were covered with multitudes of men-at-arms and horsemen and elephants. For they were told that the kings of the Ganderites and Praesii were awaiting them with eighty thousand horsemen, two hundred thousand footmen, eight thousand chariots, and six thousand fighting elephants. And there was no boasting in these reports. For Androcottus, who reigned there not long afterwards, made a present to Seleucus of five hundred elephants, and with an army of six hundred thousand men overran and subdued all India.\" 4# Raja Raja Chola :  He was popularly known as Raja Raja the Great (Raja Raja literally translates to 'the King of Kings'), is one of the greatest Emperors of India, who ruled between 985 and 1014 CE. He went down in history as the harbinger of the heights of Chola glory. It was during his reign that the Chola Dynasty started to emerge as a great by conquering several kingdoms in India, he expanded the Chola Empire as far as Sri Lanka in the south, and Kalinga (Odisha) in the northeast. Raja Raja Chola was one of the greatest sovereigns of South India, a valiant conqueror and empire builder, an able administrator, a patron of arts and letters and a great builder. He was a great patron of Tamil literature as during his reign the texts of the famous Tamil poets Appar, Sambandar and Sundarar were collected and edited into one compilation called Thirumurai. He initiated a massive project of land survey and assessment in 1000 CE which strengthened the Imperial administration and which led to the reorganization of the Empire into units known as valanadus. He built the famous Brihadeeswarar Temple which is one of the largest and tallest temples in India 5# Kanishka I or Kanishka the Great:  He was the emperor of the Kushan dynasty in 127–151 famous for his military, political, and spiritual achievements. Kanishka's empire was certainly vast. It extended from southern Uzbekistan and Tajikistan, north of the Amu Darya (Oxus) in the north west to Pakistan and Northern India, as far as Mathura in the south east (the Rabatak inscription even claims he held Pataliputra and Sri Champa), and his territory also included Kashmir, where there was a town Kanishkapur, named after him not far from the Baramula Pass and which still contains the base of a large stupa. 6# Alha :  He was the famous general of Parmal. Why he is so special? He fought 52 war and never lost any. He defeated The Great Ruler of Delhi Prathviraj Chauhan (many considered him as greatest). He was about to kill Prathviraj Chauhan but his Guru stopped him by saying that you are killing him only to take revenge of your brother (Udal) death, which is against the moral of a great worrier. Originating in the Bundelkhand Region. it (Alha) recounts the intertwined fates of the three principal Rajput Kingdoms of North India on the eve of Turkish conquest (late 12th century C.E.); Delhi (ruled by Prithviraj Chauhan), Kannauj(ruled by Jaichand Rathor), and Mahoba(ruled by Chandel king Parmal). The heroes of the epic are the brothers Alha and Udal retainers of the low social status, but exceptional valour, whose cause is the protection of Mahoba and defense of its honour. Called the \"Mahabarata of the Kaliyuga\", Alha both parallels and inverts the themes and the structures of the classical religious epic. 7# Prithvi Raj Chauhan :  Great Prithviraj is considered to be the greatest warrior of India, and also one of the greatest in the world. He succeeded to the throne of Ajmer at the age of thirteen, in 1179,when his father died in a battle. His grandfather Angam, ruler of Delhi, declared him heir to the throne of Delhi after hearing about his courage and bravery. He once killed a lion on his own without any weapon. He was known as the warrior king. Chauhan was the last independent Hindu king, before Hemu, to sit upon the throne of Delhi. He succeeded to the throne in 1169 CE at the age of 20, and ruled from the twin capitals of Ajmer and Delhi. He defeated the mighty Bheemdev, ruler of Gujarat, at the mere age of thirteen. He was trained in Archery and could aim at target while being blind folded (Shabdabhedi Ban Vidya). His love story with his enemy, Jaichand's daughter, Samyukta/Sanyogita is very famous. He rode off with her on the day of her 'Swayamwara'. 8# Hemu/Hemchandra Vikramaditya :  Hemu (died 5 November 1556) was a Hindu emperor of North India during the 16th century CE, a period when the Mughals and Afghans were vying for power in the region. Hemu acceded to the throne of Delhi on 7 October 1556 after defeating Akbar's Mughal forces in the Battle of Delhi in the Tughlakabad area in Delhi, and became the de facto king assuming the title of Vikramaditya that had been adopted by many Hindu kings since Vedic times. He re-established native rule (albeit for a short duration) in North India, after over 350 years of Turkish and Mughal rule. 9# Maharana Pratap :  He was a Hindu rajput ruler of Mewar Kingdom. Nearly all of Rana Pratap's fellow Rajput chiefs had meanwhile entered into the vassalage of the Mughals. Even Rana Pratap's own brothers, Shakti Singh and Sagar Singh, served Akbar. Indeed, many Rajput chiefs, such as Raja Man Singh of Amber (later known as Maharaja of Jaipur) served as army commanders in Akbar's armies and as members of his council. Akbar sent a total of six diplomatic missions to Rana Pratap, seeking to negotiate the same sort of peaceful alliance that he had concluded with the other Rajput chiefs. Each time, however, Rana Pratap politely refused to accept Akbar's suzerainty, arguing that the Sisodia Rajputs had never accepted any foreign ruler as their overlord, nor will he. It is worth noting that both these rulers' grandfathers, Rana Sanga and Babur, had previously fought against each other. Thus the enmity was not only political, but was also a bit personal. Rana Pratap maintained that he had no intention to fight with Akbar but he could not bow down to Akbar and accept him as the ruler. Some scholars argue that there was some possibility that Maharana could have become friends with Akbar but in the siege of Chittor when Akbar killed 30,000 civilian, unarmed residents of Chittor, because they refused to convert to Islam, left a lasting impression on Maharana's mind and he decided he cannot bow to such an unjust and cruel human being as Akbar was. 10# The Great Chhatrapati Shivaji Maharaj (1674–1680 CE) :  He established a competent and progressive civil rule with the help of a disciplined military and well-structured administrative organisations. He innovated military tactics, pioneering the guerrilla warfare methods (Shiva sutra or ganimi kava), which leveraged strategic factors like geography, speed, and surprise and focused pinpoint attacks to defeat his larger and more powerful enemies. From a small contingent of 2,000 soldiers inherited from his father, Shivaji Maharaj created a force of 100,000 soldiers; he built and restored strategically located forts both inland and coastal to safeguard his territory. He revived ancient Hindu political traditions and court conventions and promoted the usage of Marathi and Sanskrit, rather than Persian, in court and administration. Shivaji Maharaj is the greatest king and most successful general in Indian history; he is the father of Indian navy nobody else recognised the importance of a navy except him. he is the first general in Indian history to have used the geographical terrain to his advantage. he kept the dream of swaraj (self rule) above everything else; his successful military adventures; his escape from Agra; his escape to vishalgad; his military expeditions in karnataka are legends moreover he was a very inspiring general almost none of his cheiftains ever decieved him. also he was inspired by king bali this theological character is said to have established a kingdom of farmers; shivaji was a very kind ruler. he established laws that were responsible for social integrity of state. he even established mosque on raigad for muslim slodiers. cases against women were dealt with death penalty. 11# Maharaja Ranjit Singh :  The founder of the Sikh empire ,A man who had lost one eye, an arm, and yet built one of the greatest empires in India. He drove out the Durranis from Punjab, captured Multan, Peshawar, annexed the whole pf Punjab. His kingdom extended right up to the foothills of the Sulaiman Mountains, and conquered Kasur from the fierce Pathans. His empire consisted of undivided Punjab( extending till Multan now in Pakistan), Jammu and Kashmir till Gilgit now in POK, North West frontier till Khyber Pass and even parts of Western Tibet. And he had some formidable generals like Hari Singh Nalwa, Dewan Mokham Chand, Zorawar Singh along with Europeans like Jean Francois Allard. 12# Tipu Sultan :  Won small battles against British with 1:1 forces, while suffering small losses before he was 30. He was crown prince at the time. became King with a proven track record. The last Indian King to dictate terms to the British after defeating them in battle. Lord Charles Cornwallis, after mixed results in American war of Independence thought that he can improve his military record by coming to India. What a miscalculation a battle against Tipu turned out to be Tipu practically invented usage of rockets in warfare. They were present during his fathers time, but Tipu refined it for use in battle. The rockets were inefficient by modern terms, but they were meant for chaos and commotion to disperse the enemy. Tipu had a good laugh after unleashing his rocket infantry: Tipu was cruel and not a worthy King because of how he treated his prisoners and humiliation of defeated enemies. But as a warrior, he is unparalleled and is the Indian equivalent of \"Last Samurai\" as he was the last king to defeat the British at battle. That makes him a strong contender for this title. Follow me on Quora for more such contents Onkar Pawar Thank You!! Edit- There are many more successful and greatest king in India, but to keep my answer short and attractive I have chosen few of the them. That does not mean others are less worthy. ",
            "date": "Updated September 23, 2019",
            "views": "186",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Piyush Gaming",
                    "user_href": "/profile/Piyush-Gaming-39"
                },
                {
                    "user_id": "Maya Sharma",
                    "user_href": "/profile/Maya-Sharma-377"
                },
                {
                    "user_id": "Abhinav K",
                    "user_href": "/profile/Abhinav-K-109"
                },
                {
                    "user_id": "Gajendar",
                    "user_href": "/profile/Gajendar-1"
                },
                {
                    "user_id": "Arsh Kesarwani",
                    "user_href": "/profile/Arsh-Kesarwani"
                },
                {
                    "user_id": "Adrian Abbi (एडरियन अब्बी)",
                    "user_href": "/profile/Adrian-Abbi-एडरियन-अब्बी"
                },
                {
                    "user_id": "Adarsh N",
                    "user_href": "/profile/Adarsh-N-26"
                },
                {
                    "user_id": "Abhishek Kumar",
                    "user_href": "/profile/Abhishek-Kumar-6515"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teresa-S-67"
                },
                {
                    "user_id": "Sailesh Mng",
                    "user_href": "/profile/Sailesh-Mng"
                }
            ]
        },
        {
            "author_info": {
                "name": "Baba Vickram Aditya Bedi",
                "href": "/profile/Baba-Vickram-Aditya-Bedi"
            },
            "answer_text": "This answer is also is also posted to a similar question. There really are two great Indian Kings. The greatest Ashoka in terms of being the first to unite India and having the largest area under his own control. Emperor Ashoka also wins in terms of being able to change the course of Indian history. As he absorbed Buddhism into the main stream of Indian thought and idealism. And, in terms of economic growth and humanitarian rule Ashoka also will trump to an extent any other Indian ruler. After all he was the world’s first ecologist,humanitarian and conservationist. He is the first recorded leader in the world to accord rights to animals and to provide medical research and health coverage to all. Ashoka, also provided the world’s first standardization of transport, measures and taxation. So how is it possible that even another ruler could be considered. And, the answer to this is simple. Ashoka inherited a successful empire and it’s zenith and he expanded and made it into the realm of myth and legend. He is due his credit. But, Emperor Jalal Ud Din Mohammad Akbar inherited an India in the chaos of fanatical Islamic rule. Where for nearly 700 years the wealth of India had been looted and the majority Hindus were suppressed in the name of religion. He himself was a Muslim, but by extreme effort of his own convictions he lifted himself beyond this. And he became enlightened by the same light that inspired Emperor Pyadaasi Ashoka Maurya. So when effort is counted, Akbar emerges as the most dynamic of all of India’s rulers. No it does not make him greater than Emperor Ashoka, but it makes Emperor Akbar’s accomplishment of rule and fairness harder to achieve. And for this Emperor Akbar must be considered a truly great leader of India. The fact that Emperor Akbar came so close in stature to Emperor Ashoka is testament to his incredible effort and enlightenment.  Emperor Akbar, had to fight from the beginning of his life to gain what was rightfully his. His father died when he was only a child. His empire was in in a precarious situation from his youth. But, Akbar managed to centralize his authority. He also began to surround himself with intelligence and enlightenment. For him, there was no race or religion which could possibly make him prejudiced. This trait was not normal given how he had been raised. But, to Akbar his subjects were all equal. He as recorded by the then by the English Crown’s representative to his court, “He had the rarest if all qualities, to view all with the same fairness of eye”. As Akbar consolidated power over his Empire, he realized that Hindus had to be brought into his inner world. And that the Mughal Empire had no future unless, alliances were made with the Hindu Rajputs and all those who would cooperate as he planned to make the state secular. He had to do this slowly, but he planned methodically how to accomplish this goal.  Flag of Mughal India. By the middle of his rule, Akbar had established his legendary court. They were known as the Nav-Ratan or nine diamonds. In this court of exceptional individuals, who were placed in charge regardless of religious beliefs delivered social and economic results which no country has achieved in the modern age. The Indian economy grew at a rate of an estimated 12–18% per anum during the second half of Akbar’s rule. India became the largest economy in the world by the time Akbar reached his Zenith. Culturally, under Akbar the current linguistic patterns of North India were cemented. As with so much prosperity, poetry and art flourished. Indian Music, also developed into what we call Indian music today. On every area where society was concerned Akbar pushed massive reforms, he forbid the harassing of any Indian by what religion there were, he even stated that any person could convert to a religion that pleased him. He even went further and founded Din-E-Ilahi which was a combination of Hinduism, Islam, Christianity and Zoroastrianism. Thus, creating a commonality between all his subjects. It was clear that Akbar had no desire for division in India. He wanted a United India to emerge one where there was open dialogue and prosperity. Akbar, had recorded religious debates and he granted the land for the building of the Golden Temple in Amritsar. He was a man on the move, and he went to Hindu Temples, to Sikh Shrines, and to Masjids. He rebuilt Ashoka’s roads with out even knowing they were his. And he replanted the trees which once Ashoka had planted along the highways. In Benaras, Akbar rebuilt the water front areas for Hindu pilgrims. Even in the 1950’s local people used to chant songs in the name of Shah Akbar. And somehow Akbar managed to state, “I found the key to the door, which had long been lost”. For Akbar had rediscovered Indian humanitarianism. And, then Akbar even stopped hunting as not to offend his Hindu subjects. He banned even the slaughter of the cow. Akbar accomplished what no ruler had since Ashoka, as he had found golden thread of Indian history and he again bound India to it. When Akbar passed away in October, 1605, he had brought India back to a golden age. But, even beyond this Emperor Akbar had paved the way for modern India. He had incorporated the teachings of Buddha, Guru Nanak and Khabir and placed them again into the consciousness of broad Indian society, And, he had made India the largest economy in the world, for the second time in history. Akbar created a society that knew no hunger and where taxation was based upon productivity and human dignity. As Akbar created a system where taxation was eliminated when human difficulty arose. As his advisers wanted Indian equity to increase before taxation. Akbar also limited what interest could be charged on loans. A system was also created to finance international trade. India became an export driven economy with enormous trade surpluses. It was possible to write a check in Delhi and to cash it Morocco. In droughts and sickness, grain and medicine was brought in not taken out. A system of dispensaries was created and the poor were treated for free. Akbar had truly found the key for door of Indian consciousness. For this achievement, Emperor Akbar the Great is greatest monarch of the 20 centuries which came after Emperor Ashoka. Under no circumstance did he trump Emperor Ashoka, but rather adopted a similar model which in itself was a triumph after 700 years of chaos in India.  Emperor Akbar seated in center, with Prince Salim seated to the right. Circa 1590. ",
            "date": "Answered January 23, 2018",
            "views": "41",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Md Ali",
                    "user_href": "/profile/Md-Ali-551"
                },
                {
                    "user_id": "Shital Raut",
                    "user_href": "/profile/Shital-Raut-53"
                },
                {
                    "user_id": "Sami Chaudhry",
                    "user_href": "/profile/Sami-Chaudhry-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ROHIT-PAL-126"
                },
                {
                    "user_id": "Parikshith J",
                    "user_href": "/profile/Parikshith-J"
                },
                {
                    "user_id": "Shashank Upadhye",
                    "user_href": "/profile/Shashank-Upadhye"
                },
                {
                    "user_id": "Lalat Nayak",
                    "user_href": "/profile/Lalat-Nayak"
                },
                {
                    "user_id": "Sesha Akhil Upadhyayula",
                    "user_href": "/profile/Sesha-Akhil-Upadhyayula"
                }
            ]
        }
    ]
}