{
    "title": "Who were the fiercest Native Americans? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Owen Budd",
                "href": "/profile/Owen-Budd"
            },
            "answer_text": "I suppose the question being posed here, is which tribal groups had the fiercest reputation, either among other tribes (some tribal groups certainly regarded others as more dangerous than groups they were friendly with), or from a white settler perspective. The US government had a term for any tribe they regarded as an enemy, that being \"Hostiles\".  This just applied to any group they were at war with, even those who were not really that hostile.   As far as reputations go, the Comanche have a strong reputation as being the \"Lords of the Plains\".  They possessed exceptionally skilled horsemen, being capable of loosing as many as 12 arrows in the time that it took a man with a muzzleloading rifle to fire one shot.  They are thought to be some of the finest light cavalry in the world.  However, the introduction of the revolver quickly changed this, and the Commanche's days were numbered from that point onward.   The Blackfeet of Montana were also seen to be especially assertive in their control of the large area they controlled, which took up the majority of present day Montana, and some of Canada.  During my time in Montana, I made friends with some members of the Blackfeet nation, and they told me that their tribe had been rather aggressive, historically, against the confederated tribes of the Salish and Kootenai.  In fact, there is a canyon near Missoula, called Hell Gate Canyon, because it was a tribal boundary where the Blackfeet nation deposited the bodies of offending Salish and Kootenai warriors, thus giving it the appearance of \"the Gates of Hell\" to visiting Whites.  While not openly hostile to the US government, they certainly had their own scraps with US soldiers and settlers. Though, I would say few appeared to engage in warfare quite like the Apache groups of the South West.  These groups, while superficially appear to all be one tribe, were many bands and groups, which made it all the more confusing to Whites when Apache scouts enlisted to help the US army locate \"renegade\" groups.  They also had the reputation of torturing captives, and to be captured by an Apache was not seen as a very good situation by White soldiers, or their Apache scouts. All in all, it's a rather subjective question.  It all comes down to who you ask.  I'm sure if you asked a Chiricahua who they deemed to be most \"fierce\", they may tell you plenty of instances where the US Army was the most bloodthirsty in the Indian Wars.  Then again, they might personally revel in the title of \"most fierce\", as it might imply a degree of honour to a warrior.  The Cheyenne Dog Soldier society were known as \"suicide soldiers\" by the US Army, because they would physically pin themselves to the ground with a lance and sash, and fight on that spot until death or victory.  The idea being that they kept the enemy busy, while their families had the chance to get away.  The ultimate act of self-sacrifice I would say, not so much as ferocity.   Hope this helps! ",
            "date": "Updated October 20, 2015",
            "views": "879",
            "upvotes": " View 48 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cristian Jose Dasilva",
                    "user_href": "/profile/Cristian-Jose-Dasilva"
                },
                {
                    "user_id": "Marc Ransom",
                    "user_href": "/profile/Marc-Ransom-1"
                },
                {
                    "user_id": "Olanipekun Ayodele",
                    "user_href": "/profile/Olanipekun-Ayodele"
                },
                {
                    "user_id": "Tigran Minasyan",
                    "user_href": "/profile/Tigran-Minasyan"
                },
                {
                    "user_id": "Terry A Francis",
                    "user_href": "/profile/Terry-A-Francis"
                },
                {
                    "user_id": "Scott Hayden",
                    "user_href": "/profile/Scott-Hayden-9"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-86"
                },
                {
                    "user_id": "Susan Campbell",
                    "user_href": "/profile/Susan-Campbell-173"
                },
                {
                    "user_id": "Dawn Friedman",
                    "user_href": "/profile/Dawn-Friedman-2"
                },
                {
                    "user_id": "Kenneth Newman",
                    "user_href": "/profile/Kenneth-Newman-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cj Villanueva",
                "href": "/profile/Cj-Villanueva-6"
            },
            "answer_text": "The USMC. Native to America, and fighting to keep it free. So says the American Indian in me. Not the answer you were expecting, but Native means born natural in the region. Even if my gran had not been from a tribe that predates our Caucasian Americans, I'm still 100 percent born in America from Americans who were born here, just as they had been and so on, for several generations and predating the formation of the government. It seems we are not easily moved off our land after all. Fierce, huh? The Pawnee were pretty quick to drop the smackdown, I hear. The joke in our house was that my Granny Hawk was a Pawnee. (She was actually Sioux). My papa (French Canadian/native American) came home smelling like perfume one day back in the 1940s. Granny smelled him, went straight to the kitchen and returned with a large cast iron skillet. She laid him out cold with one swing. She was about 4ft 9. He was about 6ft and dropped like a sack of potatoes. The kids thought she killed him and were trying to think what to do next when he started to come around. It was several minutes, as my grandma tells it. Body stashing was being contemplated. No joke. Wisely, he tried reaching in his coat pocket before opening his eyes. My grandma n her sisters flocked around him so granny couldnt finish him off. She would have, quickly. Remember, she thought he was already dead… she meant for him to be. The situation changed rapidly when he pulled out the 1st bottle of perfume his beautiful little squaw wife ever had. He wasn't even mad at her. Needless to say, it's doubtful he ever cheated on her. That's fierce! He died in 1984. She died in 1991, living close to 100. She was an impressive woman for being so tiny. He was the only man she ever loved. She was a goddess in his eyes. But even she told me to learn how to fight like a Pawnee, and never tolerate being disrespected. Also, use cast iron because it's durable and will last a lifetime, never depreciating. Smart woman!  ",
            "date": "Answered December 25, 2017",
            "views": "12",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Nazarian",
                    "user_href": "/profile/Alex-Nazarian-2"
                },
                {
                    "user_id": "Chris Chamberlain",
                    "user_href": "/profile/Chris-Chamberlain-61"
                },
                {
                    "user_id": "Kevin Steen",
                    "user_href": "/profile/Kevin-Steen-1"
                },
                {
                    "user_id": "Leela Persadsingh",
                    "user_href": "/profile/Leela-Persadsingh-1"
                },
                {
                    "user_id": "Denis Parry",
                    "user_href": "/profile/Denis-Parry-1"
                },
                {
                    "user_id": "Andy Lutz",
                    "user_href": "/profile/Andy-Lutz-6"
                },
                {
                    "user_id": "Rodney Fisher",
                    "user_href": "/profile/Rodney-Fisher-21"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-86"
                },
                {
                    "user_id": "Jennifer Foster",
                    "user_href": "/profile/Jennifer-Foster-250"
                },
                {
                    "user_id": "Tiffany Overton",
                    "user_href": "/profile/Tiffany-Overton"
                }
            ]
        }
    ]
}