{
    "title": "Who invented the parachute? - Quora",
    "tags": [
        "Parachutes",
        "Inventors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "Leonardo da Vinci. He represented it as a “device to escape a burning building”, and his sketch resembles a flying tent. It is likely he really built one and some of his apprentices tested it, since all the measurements were correct and that contraption really works as intended. You could claim da Vinci invented BASE jumping as well.  The Leonardo’s contraption has indeed been tested in the real life, and found functional. Instead of hand-held lines, it was equipped with harness and lines.  It was found that the framing was unnecessary, and merely the canvassing would inflate on itself and work just as intended. One of my skydiving friends has Leonardo’s famous quote as tattoo: “Una volta che abbiate conosciuto il volo, camminerete sulla terra guardando il cielo, perché là siete stati e là desidererete tornare.” (And NO, I’m not going to jump with one, especially in Medieval dress - or armour. It is enough to imagine the Semi-Historical Leonardo’s Condotta army in Hordes of the Things wargame to include both the Leonardo Tank as Behemoth, balloons as Airships and balloon-borne paratroopers as Sneakers.) The first person who has made a documented and eye-witnessed parachute jump was Sebastién Lenormand 1783. He too devised the thingy as a means of escaping a burning building, and he devised it could be used as means of escaping a burning balloon as well. His design was similar as Leonardo’s. The first to jump from a balloon was André-Jacques Garnerin who made the first parachute descent from high altitude in a gondola detached from a balloon, with the help of a non-rigid or collapsible parachute on October 22, 1797, and his wife Jeanne Geneviève Labrosse Garnerin made a similar descent two years later, becoming the first female parachutist. ",
            "date": "Answered August 17, 2018",
            "views": "23",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sara Flores",
                    "user_href": "/profile/Sara-Flores-119"
                },
                {
                    "user_id": "Jani Alander",
                    "user_href": "/profile/Jani-Alander"
                },
                {
                    "user_id": "Chris Mcdermott",
                    "user_href": "/profile/Chris-Mcdermott-19"
                },
                {
                    "user_id": "Caleb Holloway",
                    "user_href": "/profile/Caleb-Holloway-3"
                },
                {
                    "user_id": "Thomas West",
                    "user_href": "/profile/Thomas-West-64"
                },
                {
                    "user_id": "Tom Ray",
                    "user_href": "/profile/Tom-Ray-12"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Bob Simcoke",
                    "user_href": "/profile/Bob-Simcoke"
                },
                {
                    "user_id": "Graham Moddle",
                    "user_href": "/profile/Graham-Moddle"
                },
                {
                    "user_id": "Brian Miller",
                    "user_href": "/profile/Brian-Miller-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Thackrey",
                "href": "/profile/William-Thackrey-1"
            },
            "answer_text": "The first recorded reference to a parachute is widely believed to be on a page in a notebook by Leonardo Da Vinci circa 1483. The drawing is accompanied by the description: \"If a man have a tent made of linen of which the apertures (openings) have all been stopped up, and it be twelve braccia (about 23 feet) across and twelve in depth, he will be able to throw himself down from any great height without suffering any injury.\"  The notebook is part of Biblioteca Ambrosiana kept in Milan, Italy. In the year 2000, Bbritish skydiver Adrian Nicholas rode an accurate reproduction of Da Vinci’s parachute for 7000 feet from a balloon over South Africa. The device, though heavy, functioned flawlessly. Nicholas released the Da Vinci parachute at about 3000 feet, where he deployed a modern parachute, which he landed. However, many people believe that a form of a primitive parachute was described in Chinese texts fifteen centuries before Da Vinci. In the 9th century, Andalusians Abbas Ibn Firnas and Ali Ben Isa are also said to have created one of the earliest versions of a parachute. Perhaps the first parachute to actually be implemented was created in 1595 by the Croatian inventor Faust Vrančić, who named it Homo Volans (Flying Man). Twenty years later, in 1617, Vrančić implemented his design and tested it by jumping from a tower in Venice. A French balloonist, Jean Pierre Blanchard, claimed the invention of the parachute in 1785, and the first successful parachute descent from a significant height was made in 1797 by the French balloonist Jacques Garnerin, who dropped 3,000 ft (920 m) from a balloon. These first practical parachutes began as an escape systems for persons to escape disabled balloons or aircraft. ",
            "date": "Answered August 17, 2018",
            "views": "489",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andris Ecsédi",
                    "user_href": "/profile/Andris-Ecsédi"
                },
                {
                    "user_id": "Susanna Viljanen",
                    "user_href": "/profile/Susanna-Viljanen"
                }
            ]
        }
    ]
}