{
    "title": "Who was the better strategist, Napoleon Bonaparte or Alexander the Great? - Quora",
    "tags": [
        "Alexander the Great",
        "Napoleon Bonaparte"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tobias Henriksen",
                "href": "/profile/Tobias-Henriksen-1"
            },
            "answer_text": "A hard question to answer. It is well known that Napoleon's greatest failings was his lack of strategic vision during the Russian campaign, a mistake that cost him the hegemony of Europe. This is a prominent example often used illustrate the failings and megalomania of an exemplary person. However, the invasion of Russia is a singular example of an otherwise great strategic mind, and only when considered in hindsight. Yes we understand that invading Russia was a mistake, but lets remember that Napoleon invaded with the greatest, largest and most battle proven army in Europe. He could never have foreseen the russians burning their capital to the ground. Alexander is a different animal entirely. His strategy of capturing the port cities of Anatolia, Palestine and Egypt essensially made the Persian naval supremacy obsolete, and he and his Macedonian officer staff showcased tactical brilliance when defeating the Persians. But what is the difference between tactics and strategy? The scope and purpose of conquest is in reality what we are discussing, and in this regard Napoleon is by far the greater strategist. The main reason for this is his administrative qualities, basically reorganzing Europe in the image of his vision for France. His legacy is arguably greater and certainly far more pointed (in line with his vision) than Alexander’s. The system that Napoleon set up outlived his own lifetime, and can still be seen today. His law codes still survives. The splitting of HRE lead to the possible creation of Germany. Alexander, on the other hand, burned hot and bright, but left no strategic vision of legacy. His empire was poorly managed and literaly only held together by his own persona. His death made this quite clear. The wars between the successors to his empire lasted at least three times as long as his empire did. On could argue about the legacy of hellenic culture in the east, but it's rather inconclusive if this was ever his own vision or simply the result of his generals clinging to what was up for grabs. Besides his Persian campaign, all other campaigns served to strategic value, but rather a thirst for conquest and the building of a personal legacy (Sogdiana rose in rebellion every single time the macedonians left, and was basically worthless as a region). The better comparison for Napoleon is Alexander’s father Philip II. Both Napoleon and Philip used war as a tool for the advancement of the state, not for their own glory and renown. This illustrates a far greater sense of strategy than Alexander ever showed. Napoleon and Philip also used other tools than war to reach their strategic goals, ex: Diplomacy, deception and economic sanctions. Alexander didn't. There are probably many reasons for this, but the main one could be his lack of a true strategic goal, always accepting every challenge, whatever it was, without a thought for what this meant in the greater sense of things (the burning of Persepolis being a good example). Hope this helped answering your question :) ",
            "date": "Answered June 27, 2019",
            "views": "15",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wessel Smit",
                    "user_href": "/profile/Wessel-Smit-5"
                },
                {
                    "user_id": "Your Name",
                    "user_href": "/profile/Your-Name-157"
                },
                {
                    "user_id": "Kefas Lungu",
                    "user_href": "/profile/Kefas-Lungu"
                },
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Belete Kaleab",
                    "user_href": "/profile/Belete-Kaleab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Narula",
                "href": "/profile/Vaibhav-Narula-9"
            },
            "answer_text": "Alexander The Great was the first grand strategist. What is remarkable about his conquests is the methodical way he went about defeating his enemies. First he secured his home base by defeating the Balkan tribes and obliterating Thebes. In Persia he did not march right into the middle of the Persian Kingdom - towards the Persian Capital. Instead of going after Darius he made Darius come to him. His first aim was to remove the danger on his home base by neutralizing Persian naval strength. He accomplished that when he reached Egypt and it was his wise statesmanship that he did not seek to destroy Persian Naval strength rather he befriended the Mediterranean naval powers and appropriated the Persian navy. He befriended every anti-Persian faction and left a secure rear when moving forward. This meant that Darius could not turn his flanks and get behind him by taking the offensive to Macedonia itself. Alexander neutralized the advantages his enemy relied on and then when he had weakened his enemy then he went on the offensive. His battles also reflect his strategy of combing defense and offense simultaneously. In the Battle of Gaugamela he fought off a double envelopment attempted by Darius; first by going on the defensive; feeding one squadron after another into the battle he reserved his companion cavalry for the decisive blow. Napoleon had the option of keeping reserves but in Alexander’s case who was completely outnumbered economy consisted in preservation of force on the field. His impenetrable infantry was his secure base for offensive action reserved for Companion Cavalry and his left wing formed of Thessalian Cavalry who could perform a defensive - offensive function as the situation demanded. And in the Battle Of Gaugamela by an intelligent defense, he made Darius denude his left wing of cavalry leading to a gap being formed. Then he immediately took the offensive - his companion cavalry penetrated the gap which had a decisive moral effect forcing Darius to flee. This reminds of one of Napoleon’s famous maxims: “The art of war consists in a well reasoned and extremely circumspect defensive followed by a rapid and audacious attack.” Napoleon by considerably weakening Austria created a political vacuum in the middle of Europe which meant that the stakes for Europe would have to be settled between Russia and France. His policy was always to give a great battle and patch up a peace; where territorial aggrandizement would be the guarantee of the peace. This created a political situation where the alliance between the entire Europe against France became inevitable. Another way Alexander was different from Napoleon was in military logistics. While Napoleon used to feed off the enemy’s land; Alexander had an excellent logistical system; that also did not lead him to compromise on speed. In this respect Napoleon’s opponent Arthur Wellington was closer to Alexander than Napoleon himself. In matters of speed there is nothing to choose between Alexander and Napoleon but Alexander surprised his enemy more often and relied more on morally defeating his enemies than on force. In his later campaigns Napoleon in Clausewitz’s words became prepared to break eggs to prepare omelettes; relying less on manoeuvre and more on artillery to decimate the enemy ranks. Finally the tactical flexibility showed by Alexander is remarkable. For every new enemy he used new tactics; adapting to the situation at hand. Scythians and Porus he didn’t even know; in the latter case it was the first time he came across elephants corps. And Scythians were undefeated upto that point not even Cyrus and Darius I were able to defeat them. And considering what such tribes like Parthians and Mongols could do it is remarkable that Alexander came up with a new tactic to defeat their mode of attack. Even Rome could never defeat the Parthians; this makes Alexander’s victory over such tribes all the more remarkable. Also where Napoleon’s forced lost to Spanish Guerrillas Alexander was able to defeat Spitamenes; who waged a guerrilla warfare against him and was his toughest opponent. In Sangala campaign his opponents used tactics similar to Ziskas in Hussite wars and yet he prevailed. He was successful in every type of warfare. The siege of Tyre and Gaza are remarkable but far more difficult was the capture of Aornus; Pirsar was 7,100ft, Bar Sar was 7900ft, Unasar was 8721ft and Banesar was 8360ft above sea level. And Alexander was able to scale these peaks - there is nothing like this in Napoleon’s career - a remarkable instance of mountain warfare. No other general in history showed the tactical flexibility Alexander did. Using Sun Tzu’s metaphor he was like water who could adapt to the situation and wrest victory from his enemies. As JFC Fuller describes, “In his many battles his tactical genius is apparent in the lightning like speed with which he adapted his actions to novel circumstances; he never copied his former success, and this was the main reason success followed success.” There is no doubt that both were great generals and any comparison between them should also take into consideration the difference in warfare in the two ages; but I still feel Alexander The Great has an edge over Napoleon. ",
            "date": "Updated September 1, 2018",
            "views": "25",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Robert Carlos",
                    "user_href": "/profile/Robert-Carlos-22"
                },
                {
                    "user_id": "P Subramanian",
                    "user_href": "/profile/P-Subramanian-5"
                },
                {
                    "user_id": "Victor Magallanes",
                    "user_href": "/profile/Victor-Magallanes-1"
                },
                {
                    "user_id": "Yash Rao",
                    "user_href": "/profile/Yash-Rao-146"
                },
                {
                    "user_id": "Belete Kaleab",
                    "user_href": "/profile/Belete-Kaleab"
                },
                {
                    "user_id": "Michael Buchanan",
                    "user_href": "/profile/Michael-Buchanan-7"
                },
                {
                    "user_id": "Rub Cal",
                    "user_href": "/profile/Rub-Cal"
                },
                {
                    "user_id": "David Oliveira",
                    "user_href": "/profile/David-Oliveira-60"
                }
            ]
        }
    ]
}