{
    "title": "Who decided to create Yugoslavia? Whose idea was it? - Quora",
    "tags": [
        "Yugoslavia",
        "History of Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danijel Zlatkovic",
                "href": "/profile/Danijel-Zlatkovic-8"
            },
            "answer_text": "It was the idea of many different people, but, in 1918 Austria Hungary lost the WWI and Serbia won. Serbian royal dynasty united AH territories under Serbian Crown (Slovenia, Croatia, and Bosnia). So we can safely say that the Serbian king is to blame for Yugoslavia. Serbia was in a position to choose between Greater Serbia, meaning all the territories in the Balkans populated with Serbs united into one state Treaty of London (1915) - Wikipedia (https://en.wikipedia.org/wiki/Treaty_of_London_(1915)#/media/File:Trattato_di_Londra.svg) or the attempt to rule over Croats, Slovenes and others in the name of Panslavism. King choosed Yugoslavia and it backfired at Serbs terribly in WWII and in the breakup of Yugoslavia in 90’s. Royalist Serbs were unable to put down or to satisfy nations that Austria managed to control for so long. ",
            "date": "Answered October 24, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matija Milkovic",
                    "user_href": "/profile/Matija-Milkovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Hassid",
                "href": "/profile/Sam-Hassid"
            },
            "answer_text": "As far as I know the Entente allies who did not want very small countries out of the collapsed empires after WWI. But they were supported at the time by the croats and the slovenes who wanted to be on the winning , not the losing side. And the serbs who just saw it as an extension of Serbia. ",
            "date": "Answered October 24, 2020",
            "views": "333",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Danijel Zlatkovic",
                    "user_href": "/profile/Danijel-Zlatkovic-8"
                }
            ]
        }
    ]
}