{
    "title": "Who started the Crusade in 1147? - Quora",
    "tags": [
        "Crusades"
    ],
    "response": [
        {
            "author_info": {
                "name": "Helena Schrader",
                "href": "/profile/Helena-Schrader-1"
            },
            "answer_text": " In 1144, the County of Edessa, established in the wake of the First Crusade, was captured by the forces of Nur al-Din. By 1146 the Principality of Antioch was also threatened. An appeal went out – not to the Byzantine Emperor, who was deemed untrustworthy, but to the West, which had provided the forces that had taken Jerusalem in 1099 and with which the ruling elite retained cultural, linguistic and family ties. This call for help elicited an enthusiastic response. This time even kings were persuaded to take the cross (i.e., the crusader vow): namely, the Holy Roman Emperor, Conrad III, and the King of France, King Louis VII. (Show in the medieval illustration above). Conrad, the Holy Roman Emperor, raised about 80,000 troops and set out first. The French left later with an estimated 100,000 men. Notably, however, when the King of France knelt before Bernard of Clairvaux to take his crusader vows, he was joined by his queen, Eleanor of Aquitaine, who likewise knelt and took the cross. Eleanor did so as the Duchess of Aquitaine and Countess of Poitou – not as Queen of France. The importance of her gesture was to muster support among the barons and lords who owed her, but not Louis of France, homage. However, Eleanor’s example inspired many other French noblewomen to take the cross as well. So when King Louis’ crusaders set forth on their crusade, his army included an unnamed number of ladies – or “amazons” as some liked to call them – determined to take part in the crusade themselves. Most of these women were the wives of noble crusaders, wealthy enough to afford horses and armor, since according to a Greek chronicler writing some fifty years after the event, they rode astride and wore armor. They were also accompanied by servants and a great deal of baggage.  The first stages of this crusade went remarkably well for the French, with the army making good progress. Although accounts differ on the extent to which Louis was able to prevent pillaging and abuse of the civilian population along the route, it is clear that the French intention was to pay for provisions and leave the Christian populations in peace. Unfortunately, the German crusaders under the Holy Roman Emperor Conrad III had behaved so badly when they passed through ahead of the French that the French often found the cities closed to them, and the price for goods exorbitant. Nevertheless, the French reached Constantinople in comparatively good order, and while the common soldiers encamped outside the walls, the nobles, including Eleanor and her ladies, were introduced to the luxuries and splendors of the fabled Queen of Cities. They were lodged in palaces the like of which they had never seen before, feted and entertained.  The news that the Byzantine Emperor had just concluded a 12 year truce with the Turks, however, cast serious doubts upon his reliability. The mistrust of the Greeks only increased when the Byzantine Emperor tried to make Louis swear to turn over any territories his army conquered to the Emperor. Louis thought he had come to fight the Turks and restore Christian rule – not expand the borders of the Byzantine Empire. Nevertheless, Louis rejected calls by some of his advisors to capture Constantinople and depose the Greek emperor. Instead he set out for Jerusalem determined to fulfill his crusading vow – and consult with the King of Jerusalem about further action. Louis chose to proceed along the southern, coastal route at a leisurely pace until, at the end of October, his army encountered deserters from the German crusade. These reported that the Turks had all but annihilated the Germans and now lay in wait for the French. A few days later, the French caught up with what was left of the Germans, including Emperor Conrad, who was suffering from a head wound. Together Louis and Conrad’s crusaders followed the Mediterranean coast, finally reaching Ephesus in time for Christmas. Here, however, Conrad decided he was too ill to continue, so he and his nobles took ship back for Constantinople, while what was left of the foot soldiers continued with Louis’s army.  No sooner had the German Emperor departed, than adversity struck the French. Torrential rains lasting four days washed away tents, supplies, and many men and horses. After this catastrophe, Louis elected to strike out inland across the mountains, despite the absence of guides, in an attempt to reach Antioch as soon as possible. This route, however, was not only through rugged terrain and along bad roads, but took the French where they were constantly harassed by Turkish raiders. By now, at the latest, the “gayness and the gilt” of Eleanor and her lady-crusaders (or amazons) were “all besmirched with rainy marching in the painful field.” Disaster, however, did not overtake them until mid-January, when two Poitevin nobles in command of the van took fatal independent action. They had been ordered to set up camp for the main army at a specific place, and Eleanor was sent with them. (Throughout the crusade, King Louis maintained separation from Eleanor in order not to be tempted to break his vow of chastity during the duration of the crusade.) When the main army reached the designated camp, however, they found it empty. The vanguard of Poitevins with the Queen had decided to move to a more attractive-looking spot down in the valley. The exhausted troops at the rear, including the King with Eleanor’s baggage train, could not possibly catch up and as darkness fell a large gap had been opened between the Christian forces. The Turks quickly exploited the situation. They attacked the main force, killing Louis’ horse under him and some 7,000 crusaders before darkness fell, putting an end to the slaughter. Many in the army blamed Eleanor, because it was her vassals who had left the main French army in the lurch.  After this disaster, the French returned to the coast, now determined to continue the crusade by ship. They were without supplies, however, and soon reduced to eating their horses before what was left of Louis’ force finally reached Antalia on January 20, 1148. Here they discovered it was impossible to find sufficient ships for the whole force at prices King Louis was willing to pay. Plague broke out in the crusader camp, decimating a force already on the brink of starvation. At this junction, King Louis VII (not to be confused with his namesake and future saint, Louis IX) abandoned his troops and took ship with his wife and nobles for Antioch. Abandoned by their king, some 3000 French crusaders are said to have converted to Islam in exchange for their lives and food.  Louis and Eleanor, meanwhile, arrived in Antioch. Antioch was a magnificent, walled city, which had been one of the richest in the Roman Empire. At this time it was inhabited by a mixed population of Greek and Armenian Christians ruled by a Latin Christian elite, headed by Raymond of Poitiers, the younger brother of Eleanor’s father, William Duke of Aquitaine. The language of the court at Antioch was Eleanor’s own langue d’oc, and the customs were likewise those of the Languedoc. Within a very short time, Eleanor and her uncle developed such rapport that the king became jealous and then suspicious. The clerical chroniclers are united in condemning Eleanor of forgetting her “royal dignity” – and her marriage vows. The situation was aggravated by the fact that Raymond of Antioch thought the crusaders had come to restore Christian control over the county of Edessa – and so secure his eastern flank, but Louis thought he had come on pilgrimage to Jerusalem and insisted on continuing to the Holy City, rather than following the Prince of Antioch’s military advice. At this junction, with Louis already jealous of Eleanor’s close relationship (sexual or not) with Prince Raymond, she announced that she – and all her vassals – would remain in Antioch, whether he went to Jerusalem or not. Since her vassals made up the bulk of what was left of the French forces, this was an effective veto. Louis threatened to use force to make her come with him as was his right as her husband. Eleanor retorted their marriage was invalid because they were related within the prohibited degrees and demanded an annulment. Louis responded by having her arrested in the middle of the night and carried away from Antioch by force.  After the French King's arrival in Jerusalem, the crusaders, local barons and military orders met to decide on the best strategy for action against the enemy. Although the author of the decision is not clear, the fateful decision was made to try to seize Damascus. The logic was that this would relieve the pressure on the narrowest part of the crusader kingdom -- the lands between Tyre and Tripoli. Ironically, the Muslim ruler of Damascus was one of the Saracen leaders, who had been willing to compromise and negotiate with the crusader kingdoms in the East. The siege made an enemy of a former ally and pushed him into the arms of the jihadists -- which wouldn't have been disastrous if the campaign had been successful. However, although a siege was established, squabbles among the leaders and then news that a strong Saracen relief army was on the way spread so much panic among the crusaders that the crusading army disintegrated. They had made a new enemy for nothing and squandered the reinforcements from the West.  Worst of all, however, this humiliating failure profoundly damaged the entire concept of crusades and crusading in the West. It demonstrated that “God” was not inherently on the side of the crusaders and that victory was not assured. It also helped restore both unity and confidence among the Saracen leaders — at least in the short term. As a footnote, Queen Eleanor spent the months in Jerusalem while her husband’s crusade came to its final humiliating disaster outside Damascus. Although nothing is recorded of her activities, clearly her influence on Louis and her role in the crusade was over. Furthermore, despite an attempt to patch up the marriage after their return to France, the birth of a second daughter made a divorce a dynastic priority. Louis abrogation of Eleanor, however, paved the way for her to marry Henry of Anjou, the future King Henry II of England. Eleanor's rich lands were instrumental in giving the Plantagenet king the means challenge the Capets for dominance throughout the next half-century. (Below Eleanor of Aquitaine’s tomb beside her second husband Henry II of England.)  ",
            "date": "Answered March 16, 2020",
            "views": "472",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Timothy OToole",
                    "user_href": "/profile/Timothy-OToole-3"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Aidan Turner",
                    "user_href": "/profile/Aidan-Turner-20"
                },
                {
                    "user_id": "Jesse Verner",
                    "user_href": "/profile/Jesse-Verner"
                },
                {
                    "user_id": "Albert Nielsen",
                    "user_href": "/profile/Albert-Nielsen-1"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "John Lundquist",
                    "user_href": "/profile/John-Lundquist-2"
                },
                {
                    "user_id": "Matthew Vaughan",
                    "user_href": "/profile/Matthew-Vaughan-23"
                },
                {
                    "user_id": "Jeffery Scripps",
                    "user_href": "/profile/Jeffery-Scripps"
                },
                {
                    "user_id": "Chris Abson",
                    "user_href": "/profile/Chris-Abson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francis Marsden",
                "href": "/profile/Francis-Marsden-1"
            },
            "answer_text": "The Second Crusade (1147–1150) was the second major crusade launched from Europe. The Second Crusade was started in response to the fall of the County of Edessa in 1144 to the forces of Zengi. The county had been founded during the First Crusade (1096–1099) by King Baldwin I of Jerusalem in 1098. While it was the first Crusader state to be founded, it was also the first to fall. The Second Crusade was announced by Pope Eugene III, and was the first of the crusades to be led by European kings, namely Louis VII of France and Conrad III of Germany, with help from a number of other European nobles. The armies of the two kings marched separately across Europe. After crossing Byzantine territory into Anatolia, both armies were separately defeated by the Seljuk Turks. The main Western Christian source, Odo of Deuil, and Syriac Christian sources claim that the Byzantine Emperor Manuel I Komnenos secretly hindered the crusaders' progress particularly in Anatolia, where he is alleged to have deliberately ordered Turks to attack them. Louis and Conrad and the remnants of their armies reached Jerusalem and participated in 1148 in an ill-advised attack on Damascus. The crusade in the east was a failure for the crusaders and a great victory for the Muslims. It would ultimately have a key influence on the fall of Jerusalem and give rise to the Third Crusade at the end of the 12th century. The only significant Christian success of the Second Crusade came to a combined force of 13,000 Flemish, Frisian, Norman, English, Scottish, and German crusaders in 1147. Travelling from England, by ship, to the Holy Land, the army stopped and helped the smaller (7,000) Portuguese army in the capture of Lisbon, expelling its Moorish occupants. (Wiki) ",
            "date": "Answered March 16, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luis Doriocourt",
                    "user_href": "/profile/Luis-Doriocourt"
                }
            ]
        }
    ]
}