{
    "title": "Who was the most badass British soldier in WW2? - Quora",
    "tags": [
        "British Armed Forces",
        "Badasses",
        "British Army",
        "Soldiers",
        "British People and Ethnicity",
        "History of Great Britain",
        "Military Personnel",
        "World War II",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Pete Stollery",
                "href": "/profile/Pete-Stollery"
            },
            "answer_text": "Lieutenant Colonel Robert Blair \"Paddy\" Mayne  “The base was shut down for the night. About 30 German and Italian airmen were eating, drinking, playing cards, and socializing in the wooden building that served as the officers’ mess. Preoccupied as they were, the pilots were flabbergasted when the door shattered under the impact of a booted foot. Filling the entrance was the silhouette of a huge man in British uniform with a submachine gun jammed against his right hip. As he opened fire, screams of terror and pain filled the room. By the time the Tommy gun’s drum of 50 rounds was empty, the room was splattered with blood and littered with dead and dying men. As suddenly as he had appeared, the massive enemy soldier was gone. He was Lieutenant Robert Blair “Paddy” Mayne of Britain’s Special Air Service (SAS), and he was far from finished with Tamet.”…..Kelly Bell. From Wikipedia: “Lieutenant Colonel Robert Blair \"Paddy\" Mayne DSO & Three Bars (11 January 1915 – 14 December 1955) was a British Army soldier from Newtownards, capped for Ireland and the British Lions at rugby union, lawyer, amateur boxer and a founding member of the Special Air Service(SAS). During the course of the Second World War he became one of the British Army's most highly decorated soldiers and by destroying 47 aircraft in a single action he may well have destroyed more German aircraft than the RAF's highest scoring ace.” He got pissed at everybody and fought anyone, be they friend or foe, even fellow officers. His main hobby was drinking and fighting (combined). He killed far more men than Rambo, unlike Rambo, Paddy Mayne was real life. His war story is probably the greatest combat film that was never made. Commando Paddy Mayne: Ireland’s Wolf of the Desert Paddy Mayne - Wikipedia ",
            "date": "Answered September 18, 2019",
            "views": "1654",
            "upvotes": " View 1.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darren Talbot",
                    "user_href": "/profile/Darren-Talbot-5"
                },
                {
                    "user_id": "Anthony Ricci",
                    "user_href": "/profile/Anthony-Ricci-1"
                },
                {
                    "user_id": "Tony Winkler",
                    "user_href": "/profile/Tony-Winkler"
                },
                {
                    "user_id": "Jordan Chapman",
                    "user_href": "/profile/Jordan-Chapman-38"
                },
                {
                    "user_id": "Roger Atkins",
                    "user_href": "/profile/Roger-Atkins-13"
                },
                {
                    "user_id": "Steve Soutar",
                    "user_href": "/profile/Steve-Soutar-3"
                },
                {
                    "user_id": "T Dee",
                    "user_href": "/profile/T-Dee-15"
                },
                {
                    "user_id": "Alex Mcdonald",
                    "user_href": "/profile/Alex-Mcdonald-137"
                },
                {
                    "user_id": "Joseph Brown",
                    "user_href": "/profile/Joseph-Brown-824"
                },
                {
                    "user_id": "Liam Joseph Harding",
                    "user_href": "/profile/Liam-Joseph-Harding"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lim Kagen",
                "href": "/profile/Lim-Kagen"
            },
            "answer_text": "Its obviously John Malcolm Thorpe Fleming Churchill, A.K.A Jack Churchill.  Jack Churchill This absolute mad lad is perhaps the most badass person in history, let alone just in WW2. This was the same guy that decided to play the bagpipes, before throwing a grenade and charging into battle[1].  Jack Churchill and his pipes In Molina, he infiltrated a german observation post and with just the help of one corporal, captured the entire observation post[2].  Molina And when he was left alone after an artillery shell killed everyone but him, he stood there gallantly alone, calmly playing ‘Will Ye No Come Back Again’[3]. Plus, he carried a longbow with him to battle and performed a kill with It[4].  Jack Churchill with his bow And he also carried a sword, which he used to engage with the Germans in hand-to-hand combat[5].  Jack Churchill with a sword If this isn’t the pinnacle of being badass, I don’t know what is. Footnotes[1] Jack Churchill - Wikipedia[2] Jack Churchill - Wikipedia[3] Jack Churchill - Wikipedia[4] The amazing story of Mad Jack, the hero who took on the Nazis with a bow and arrow (and later became a professional bagpipe player)[5] Jack Churchill - Wikipedia",
            "date": "Answered September 27, 2019",
            "views": "336",
            "upvotes": " View 99 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lachlan Gow",
                    "user_href": "/profile/Lachlan-Gow-1"
                },
                {
                    "user_id": "Alex Mcdonald",
                    "user_href": "/profile/Alex-Mcdonald-137"
                },
                {
                    "user_id": "Bob Watt",
                    "user_href": "/profile/Bob-Watt-16"
                },
                {
                    "user_id": "Deepankar Patnaik",
                    "user_href": "/profile/Deepankar-Patnaik-1"
                },
                {
                    "user_id": "Sue Sandys",
                    "user_href": "/profile/Sue-Sandys-1"
                },
                {
                    "user_id": "Anthony Graham Dow Woodwark",
                    "user_href": "/profile/Anthony-Graham-Dow-Woodwark"
                },
                {
                    "user_id": "Marcus Round",
                    "user_href": "/profile/Marcus-Round-1"
                },
                {
                    "user_id": "Mackenzie Cumming",
                    "user_href": "/profile/Mackenzie-Cumming"
                },
                {
                    "user_id": "Michael Costigan",
                    "user_href": "/profile/Michael-Costigan-12"
                },
                {
                    "user_id": "Clive Reid",
                    "user_href": "/profile/Clive-Reid-5"
                }
            ]
        }
    ]
}