{
    "title": "Who were the Saxons, and where did they come from? - Quora",
    "tags": [
        "Saxons (Tribe)",
        "Anglo-Saxons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gareth Adamson",
                "href": "/profile/Gareth-Adamson"
            },
            "answer_text": "The known facts are briefly these: In 356, Emperor Julian mentioned that a federation of tribes called the Saxons had allied with his rival Zosimus.The late western Roman Empire (4th & 5th centuries) had a line of fortifications along both sides of the English Channel, and up the east coast of Britain as far as the Wash, called the Saxon Shore (Litus Saxonicum).In 463, Gregory of Tours mentions that a Saxon warlord was driven out of Gaul by the Franks, who were Roman allies at the time. At the same time, other groups of Saxons already lived in Britain as Roman foederati.In the mid 6th century, Gildas describes the Saxons as pagan invaders of Britain, bringing terror to the native Christian Britons. But, writing around the same time, Procopius writes that Britain was inhabited by Angles, Frisians and Britons (no mention of Saxons).In the early 8th century, Bede gives an account of the events of 100–250 years earlier as an invasion of Britain by Angles, Saxons and Jutes.From 772–804, Charlemagne fought the Saxon Wars against the pagan Saxons on the continent. Those he did not massacre he converted at the point of the sword. From then on Saxony was a great and leading nation of Christian Germany. The first dynasty of Holy Roman Emperors, after the imperial revival of 961, was Saxon.As the Holy Roman Empire expanded eastward, part of the new eastern marches (borderlands) was given to the Dukes of Saxony to look after.After the fall of its last great duke, Henry the Lion, in 1180, the stem duchy of Saxony split up into independent states. The only place that continued to bear the name Saxony was the Saxon March in the east, which eventually became the state of Saxony in today’s Germany.It seems clear from this that Saxons, like Franks, or Allemanni, or Marcomanni, was the name of a federation of German tribes. These federations could grow or split up according to how successful they were, so it may not have involved the same set of tribes over long periods. Saxon seems particularly generic, and may have been applied by Roman writers to any broadly Germanic pagans they came across. This would help to explain the confusion of names, where both Frisians and Angles seem sometimes to be called Saxons. It may not have been totally clear who exactly was a Saxon and who was not, and it may have been a descriptive term as much as a formal ethnicity. It is entirely possible that there were some Germanic peoples living in Britain well before the 5th century, and that these too identified generically as Saxons in the unstable period which followed the Roman departure, Who were they? North Germanic pagans, at some point extending to Britain. Those in Britain also used the name ‘English’ (at least from the 7th century) and from around the 10th century preferred it. Those on the continent later became a great Germanic nation, which then split up, and the identity largely faded away. Federal identities are fluid like that. I’m not sure one can be any more specific. Where did they come from? Depends how far back you want to go, but certainly at the time they took the name Saxons, centred around the North Sea coast, perhaps both sides of it. After all, although the Saxon Shore is traditionally regarded as a defensive system against the Saxons, it is possible it could have been an area where some Saxons lived, whatever the Romans meant by ‘Saxon’. ",
            "date": "Answered February 10, 2020",
            "views": "430",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandra Linenberger Barthram",
                    "user_href": "/profile/Sandra-Linenberger-Barthram"
                },
                {
                    "user_id": "Micha Roded",
                    "user_href": "/profile/Micha-Roded"
                },
                {
                    "user_id": "Abhilasha Pathak",
                    "user_href": "/profile/Abhilasha-Pathak-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph S. Herndon",
                "href": "/profile/Joseph-S-Herndon"
            },
            "answer_text": "The Saxons were a tribe of Germanic Barbarians who inhabited the North Sea coast and islands of what is now Germany when they first appeared in history during late Roman imperial times. Their homeland was poor so they increasingly took to piratical raiding of Roman Britain. Eventually the Saxons, joined by the Angles and Jutes, were able to establish permanent settlements, and progressively conquer what then became England, starting in the 5th century A.D. Naturally, some Saxons stayed behind in Germany. The later political entity called Saxony (eventually a kingdom) far to the southeast did not reflect a further migration of the Saxon tribe. Rather it represented a gradual shift in the principal territories held by the ruling Saxon nobles. So the inhabitants of those later territories became Saxons by nationality, rather than ethnicity. ",
            "date": "Answered January 24, 2020",
            "views": "683",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                },
                {
                    "user_id": "Taiyo Weber",
                    "user_href": "/profile/Taiyo-Weber"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        }
    ]
}