{
    "title": "Who is the god of war among the Egyptian gods? - Quora",
    "tags": [
        "Egyptian Gods and Goddesses",
        "Deities (gods)",
        "Ancient Egypt",
        "Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurio Pérez",
                "href": "/profile/Saurio-Pérez"
            },
            "answer_text": "Who is the god of war among the Egyptian gods? Google is your friend and Aunt Wikipedia has the answer: List of Egyptian war deities Anhur, god of warBast, cat-headed goddess associated with war, protection of Lower Egypt and the pharaoh, the sun, perfumes, ointments, and embalmingHorus, god of the king, the sky, war, and protectionMaahes, lion-headed god of warMenhit, goddess of war, \"she who massacres\"Montu, falcon-headed god of war, valor, and the SunNeith, goddess of war, hunting, and wisdomPakhet, goddess of warSatis, deification of the floods of the Nile River and an early war, hunting, and fertility goddessSekhmet, goddess of warfare, pestilence, and the desertSet, god of chaos, associated with warSobek, god of the Nile, the army, military, fertility and of crocodilesSopdu, god of the scorching heat of the summer sun, associated with warWepwawet, wolf-god of war and death who later became associated with Anubis and the afterlife",
            "date": "Answered June 16, 2018",
            "views": "29",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Park",
                    "user_href": "/profile/David-Park-65"
                },
                {
                    "user_id": "Ben D. Bollen",
                    "user_href": "/profile/Ben-D-Bollen"
                },
                {
                    "user_id": "Grayson Lent",
                    "user_href": "/profile/Grayson-Lent"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "There are two regional candidates. One candidate might be Montu, a minor, hawk-headed deity that was thought to embody the warlike nature and martial prowess of the Pharoah. He was worshipped in Thebes, primarily, rather than other areas of Lower Egypt. The second candidate might be An-Hur (aka Anhuret). He was the god specifically of the Egyptian armies, and he was worshiped in the region of Abydos and more specifically in Thinis. His epithet was “Slayer of Enemies,” and part of his worship involved staging mock battles. In mythic genealogy, he was one of the sons of Ra. However, there’s arguably no good, direct analogue to Mars or Ares in the Egyptian pantheon, even though the Greeks equated An-Hur with Ares occasionally. ",
            "date": "Answered June 16, 2018",
            "views": "13",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marcus Heath",
                    "user_href": "/profile/Marcus-Heath-10"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Grayson Lent",
                    "user_href": "/profile/Grayson-Lent"
                }
            ]
        }
    ]
}