{
    "title": "Who are the top 100 historical figures I should learn about? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Godfrey McDonnell",
                "href": "/profile/Godfrey-McDonnell"
            },
            "answer_text": "To do justice answering a list ought to be as fair subjectively and equitable as it can be to everyone. Here’s how; First. Forget about being fair to everyone. Have faith. Here are some reasons and ways to approach this top historic figures question. We set limits and pick an epoch? How many epochs do we need? Do we need to cover for 5 million years more or less is it? Divide 5 million or say one million for human epochs that’s 100 into one million. Which is less than is fair for any meaningful insight into the ascent of man, of our history. Let’s then widen our scope and range and use industry standard procedures for this kind of research. Using tools and resources like literature, search engines, libraries and archives. Personally I love football and Manchester United so much I would pick 100 of the clubs most illustrious, players, benefactors, managers and supporters. And learn everything there is to know about them. Not a football fan? Try this instead. With no recourse to anything except your memory as it is. And no clues or unhelpful prompts from here. Start to build a list of the one hundred most vile, villainous, heanouse, horrible people you have ever heard about. Study them in detail one at a time. As you get to know all about one you’ll find more and more candidates for your historical inquiries. You will be spell bound with what you discover I promise, when the bug hits? One hundred is a drop in a drop in the Ocean of historical time. The known and the unknown. That is until you got the bug. Have fun good luck. Watch out for those demons! Stage two\\;-Alt. Mix and match. Choose your own Goodies and Baddies. Draw up two lists 50–50 Good guys, bad guys or a hundred of each; if you can think of that many. You only need one to start. It’s an unmatched fascinating, moving balancing exercise. Research those that spring into your Mind, mind. The personality Icons of our experience are usually the ones who reveal most about the things we want, need to know, relevant to what? Preference history? It’s all a pack of lies? Using our own Personages getting under the skin of the dead ones, seeing from their perspectives their horizons and then let’s hear your reflections here. Does Mickey Mouse count as an Historical figure? Would you call him a good mouse or a bad mouse?  ",
            "date": "Updated August 21, 2020",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Joncas",
                "href": "/profile/Lucas-Joncas"
            },
            "answer_text": "The Prophet Mohammed, Jesus of Nazareth, Vladimir Lenin, and Winston Churchill are the first four that popped into my head. It really depends on what interests you about history. Do you want the broadest impact? The most misunderstood? The most relevance to your life today? I think the best thing to do is figure out why you want to learn about various characters. Then ask who are the most relevant to that goal. ",
            "date": "Answered August 14, 2017",
            "views": "411",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                },
                {
                    "user_id": "Jameson Matinho",
                    "user_href": "/profile/Jameson-Matinho"
                }
            ]
        }
    ]
}