{
    "title": "Who invented the atomic bomb? - Quora",
    "tags": [
        "Who Came Up With / Invented X?",
        "Atomic Bombs",
        "Explosives",
        "Bombs",
        "Nuclear Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mahesh C. Shastry",
                "href": "/profile/Mahesh-C-Shastry"
            },
            "answer_text": "The scientific developments that directly led to the first atomic bomb (fission bomb) was the discovery that you could split an atom in a process called nuclear fission and harness the energy. The main developments that led to fission and the atomic bomb are as follows: 1. Albert Einstein, in the year 1905, proposed the equivalence of mass and energy with the now famous expression [math]E = mc^2[/math].  2. Ernest Rutherford proposed in 1911 the atom as consisting of a core called nucleus, consisting of heavy protons surrounded by electrons. For the atomic bomb, it is only necessary to consider the nucleus. Around the same time, Neils Bohr and others developed quantum mechanics that deepened our understanding of the atom.  3. Henri Becquerel discovered spontaneous radioactivity in Uranium, and Pierre and Marie Curie explained and worked extensively on the concept. This was in the early 1900s. 4. James Chadwick in 1932 discovered that the nucleus also consisted of neutrons and soon, it was discovered that neutrons and protons are held together by a hitherto unknown kind of force called the 'strong nuclear force'. 5. Enrico Fermi discovered in 1934 that you can bombard Uranium with neutrons and generate new elements and energy, in experiments that demonstrate Einstein's mass-energy equivalence. This phenomenon is called 'induced radioactivity' as opposed to the spontaneous natural radioactivity discovered and studied by Becquerel and the Curies. 6. Lise Meitner, Otto Hahn, and Fritz Strassman in 1938 discovered the process of nuclear fission in Germany. This was the experiment that perhaps most directly led to the physics behind the atomic bomb. Soon after, this experiment was repeated with success in the US. 7. Leo Szilard, a US based Hungarian émigré, discovered in the 1930s that this 'nuclear fission reaction' can be cascaded into a self-sustaining chain reaction. This made atomic bombs theoretically possible. Around the same time, Frederic Joliot-Curie and Enrico Fermi also proposed designs for 'nuclear reactors'- setups to implement nuclear chain reactions. Enrico Fermi later led the effort to build the first chain reactor on a modified squash court in Chicago in 1942. At the policy level, around 1939, following the culmination of the above developments, physicists Leo Szilard, Edward Teller, and Eugene Wigner urged Einstein to write to Franklin D. Roosevelt, the then president of the US about the possibility that the Germans, then in conflict with the US, would be attempting to build an atomic bomb- a bomb based on the nuclear chain reaction and having enormous destructive capabilities. The letter delivered to FDR on October 11, 1939 asked FDR to take all steps to secure Uranium supplies from Belgian controlled Congo, and start a serious government effort to get the scientists together and provide logistical support to hasten the development of the physics, mathematics, and engineering leading to the atomic bomb. The letter can be seen at this link: http://upload.wikimedia.org/wikipedia/commons/b/bf/Einstein-Roosevelt-letter.png This led to the Manhattan Project, a nationwide effort led by the facility at Los Alamos in New Mexico, which culminated in the development of the atomic bomb. Robert Oppenheimer was the scientific director of the Manhattan Project. The work that went on as part of the Manhattan Project was classified for several years, but with the developments and discoveries 1 through 7 above being in the public domain, it essentially meant that any country with sufficient money and expertise could eventually make an atomic bomb. The amazing thing about the Manhattan Project was that they were the pioneers, and made the bomb in just 5 years- an enormously significant achievement for someone doing it for the first time in the world. :) ",
            "date": "Updated September 16, 2011",
            "views": "1767",
            "upvotes": " View 116 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Prajapati",
                    "user_href": "/profile/Shubham-Prajapati-55"
                },
                {
                    "user_id": "Justin Smith",
                    "user_href": "/profile/Justin-Smith-1889"
                },
                {
                    "user_id": "Patrick Murphy",
                    "user_href": "/profile/Patrick-Murphy-266"
                },
                {
                    "user_id": "Anthony Graham Dow Woodwark",
                    "user_href": "/profile/Anthony-Graham-Dow-Woodwark"
                },
                {
                    "user_id": "Mark Scots",
                    "user_href": "/profile/Mark-Scots"
                },
                {
                    "user_id": "Riku Lappi",
                    "user_href": "/profile/Riku-Lappi"
                },
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Darrell Hart",
                    "user_href": "/profile/Darrell-Hart-1"
                },
                {
                    "user_id": "Manoj Singh",
                    "user_href": "/profile/Manoj-Singh-4004"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avinash Bhuma",
                "href": "/profile/Avinash-Bhuma"
            },
            "answer_text": "During world War II the United States used an unprecedented $2 billion to feed an ultra-secret research and development program, the outcome of which would alter the relationship of nations forever. Known as the Manhattan project, it was the search by United States and her closest allies to create a practical atomic bomb, a single device capable of mass destruction, the threat of which alone could be powerful enough to end the war. Scientists escaping the Nazi regime has revealed bthat research in Germany had confirmed the theoritical viability of atomic bombs. In 1939, in support of their fears that the Nazis might now be developing such a weapon, Albert Einstein and others wrote to president Franklin D. Roosevelt warning of the need for atomic research. By 1941 Franklin D. Roosevelt had authorized formal, coordinated scientific research into such a device. Among those whose efforts would ultimately unleash the power of the atom was Robert Oppenheimer, who was appointed the project's scientific director in 1942. Under his direction the famous laboratories at Los Alamos would be constructed and the scientific team assembled. Source : Inventions that changed the world, Google ",
            "date": "Answered July 5, 2019",
            "views": "375",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Satyam",
                    "user_href": "/profile/Satyam-352"
                },
                {
                    "user_id": "Vamshi Vanupali",
                    "user_href": "/profile/Vamshi-Vanupali"
                }
            ]
        }
    ]
}