{
    "title": "Who invented paper money and introduced it as a medium of exchange? - Quora",
    "tags": [
        "Paper",
        "Invention and Inventions",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Hand",
                "href": "/profile/Peter-Hand-4"
            },
            "answer_text": "Paper money was invented in late medieval Europe, literally as “bank notes”. One bank would give you a note that you could take to another bank, frequently in a different country. The other bank would then pay you its value in specie (gold and silver). Initially the second bank would have to recover the value from the first bank in specie, but as the practice became more widespread, multiple bank note transactions would tend to cancel out, and only a small adjustment would need to be made once a year or so. Banks depend on trade as much as trade depends on banks. The first banks to exchange notes were in Italian city states like Genoa and Venice. Later, as Europe stabilized, banking centers grew up in such cities as London, Leipzig, Amsterdam and Zurich to facilitate international trade, and most countries set up national banks and started issuing “bank notes” exchangeable for some amount of gold or silver that could be used as money. Over time, the value of paper money became detached from specie, and today it’s just a matter of faith - a dollar is worth a dollar because most people believe it is. America started issuing bank notes payable by state treasuries immediately after the revolution of 1776, long before the states were united and had a common currency..    ",
            "date": "Answered March 20, 2018",
            "views": "951",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Franz",
                    "user_href": "/profile/Jim-Franz"
                },
                {
                    "user_id": "Tom Battraw",
                    "user_href": "/profile/Tom-Battraw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alec Zander",
                "href": "/profile/Alec-Zander"
            },
            "answer_text": "The Chinese, during the Tang dynasty. They invented paper and block printing, so they were naturally the first to invent paper money. Banknote - Wikipedia China - Paper money Museum of the National Bank of Belgium Top 10 Things You Didn't Know About Money - TIME http://www.silk-road.com/artl/papermoney.shtml ",
            "date": "Answered March 31, 2018",
            "views": "339",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neow Ws",
                    "user_href": "/profile/Neow-Ws"
                },
                {
                    "user_id": "Ray Ku",
                    "user_href": "/profile/Ray-Ku"
                }
            ]
        }
    ]
}