{
    "title": "Who benefits from poverty? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Alejandro Guillú Mendoza",
                "href": "/profile/Alejandro-Guillú-Mendoza"
            },
            "answer_text": "You. You go to Burger King today and you order a Whoper Junior for $1 The real cost of this burger is $10 $1 is for Warren Buffet (He is one of th largest shareholders of Kraft) $1 is for Warren Buffet again (He is one of the largest shareholders of Heinz) $1 is for me (You are not really a Mexican if you don’t hold at least one share in Grupo Bimbo) $1 for the guy growing the tomatoes $1 for the guy growing the pickles $1 for the guy growing the lettuce $1 for the guy growing the onions $1 for the truck driver actually moving all these things to the restaurant $1 for the guy doing the cool TV commercials like this one:  $1 for the Burger King shareholders because they have to eat too. This is the theoretical distribution where everybody gets a fair share of the profits and NOBODY IS LIVING IN POVERTY. I am spreading all the wealth evenly for simplicity purposes. Some may say the guys picking the tomatoes in California should get $2 because it’s a lot of hard work and other may say the guys shooting the ads in Hollywood should get $3 because you need a sound guy and an editor and an actor and director and $1 is not enough to survive if you split the profits between 100 people but let’s keep things simple for now. The truck guy wants more money. When I say the truck guy I mean Federal Express, DHL and UPS. These three billionaires are not happy with $1 per burger. They want $3 per burger for themselves. You cannot simply increase the price of the burger from $10 to $13 because you would sell less burgers and you would end up with less money instead of more money. You can only make more money if you a STEAL $2 from the rest of the guys actually building the burger. Here is the evil plan taken directly from the truck guy’s computer servers: Let’s buy the onion farm from the current onion owner (Probably a farmer) and fire all the current employees working there for $1 and replace them with unmployed workers and pay them only $0.50. We are so clever! We can now make $1.50 instead of $1.00 50% of our job is already done.Let’s buy the tomate farm and the lettuce farm from the current tomato and lettuce owners (Probably two farmers) Let’s reduce the wages from $1 to $0.75 and we are now making $3 each time we sell a burger. Who cares if the farmers are now making less cash? That’s not our problem. We did not put a gun to their heads and force them to sell their farms.Now we are in the country club. “That’s a very nice Rolex. How did you buy that?” Says Warren Buffett to the truck guy. This is back in 1970. “I went to Mexico and acquired a lettuce farm from a stupid Mexican farmer for $1,000,000 He was so happy, he has never seen that much money in his entire life” “A million dollars is a lot of money, how are you going to pay your Wells Fargo MasterCard?” “That’s the clever part. I fired all the workers and I hired new ones and I am only paying them $0.50 for each burger and I use the extra $0.50 to pay Well Fargo. Eventually, I will be debt-free and I will apply for a $2,000,000 loan to buy another two tomate farms from the stupid Canadians and maybe from the stupid farmers in Argentina” “I see.” Warren Buffett leaves the country club and he now has his own plan to steal $1 from the milk guy (You need milk to make cheese) and from the wheat guy (You need wheat to make bread) Fast forward to 2016 and we have the whole world living in poverty and Warren Buffet has 365 Rolex on his bedroom. He can literally wear a new Rolex watch everyday. By the way, I am buying used cars to sell on eBay. Do you have one that you can sell me? I will pay you thousands of dollars for your car By the way, I am buying houses in your area to lease on AirBnb. Do you have one that you can sell me? I will pay you hundreds of thousands of dollars for your house. By the way, I am buying small restaurants in your area to tear them down and build a McDonald’s there. Do you have one that you can sell me? I will pay you millions of dollars for your small restaurant… It’s a slippery slope. ",
            "date": "Answered May 25, 2016",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-D-Nadeem-1"
                },
                {
                    "user_id": "Bernard Sweeney",
                    "user_href": "/profile/Bernard-Sweeney"
                },
                {
                    "user_id": "Ashutosh Singh",
                    "user_href": "/profile/Ashutosh-Singh-220"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Sillers",
                "href": "/profile/Don-Sillers-1"
            },
            "answer_text": "A couple of previous answers have offered good examples of groups who benefit from poverty per se – especially Matt Chanoff ‘s example of those who specialize in lending to poor people with poor credit histories, as well as the bureaucrats mentioned by Ken Adney, along with other members of the “poverty-industrial complex”—high-paid execs of poverty-focused NGOs. But the broader implication of the question and its details—that the persistence of poverty proves that someone must be benefiting from keeping the poor poor – is incorrect. The reality is a bit more subtle. In essentially all developing countries, where the vast majority of poor people live, the economy is burdened by economic distortions whose intended effect is to restrict competition with existing dominant firms, whose owners constitute a powerful set of interest groups lobbying against economic reform. To cite but one example among many, the trucking industry in many countries in Sub-Saharan Africa is monopolized by politically powerful interests, e.g. in South Sudan by the former president’s wife. These monopolies drive up prices, worsen service, and limit pressure for improved productivity. Multiplied manifold in each poor country, the net result are economies growing more slowly and operating less productively than they would otherwise in a more competitive environment. The end result is slow growth in the modern economy, leaving most of the labor force stuck in poverty in traditional agriculture and the urban informal sector. In short, no one deliberately sets out to keep poor people poor; rather, the poor simply suffer the collateral damage created by the efforts of interest groups to restrict competition that would threaten their own vested interests. ",
            "date": "Answered May 29, 2016",
            "views": "49",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Allen (Student)",
                    "user_href": "/profile/Andrew-Allen-Student"
                },
                {
                    "user_id": "Julie Forsyth",
                    "user_href": "/profile/Julie-Forsyth-3"
                },
                {
                    "user_id": "Babatunde Odebiyi",
                    "user_href": "/profile/Babatunde-Odebiyi"
                },
                {
                    "user_id": "Bernard Sweeney",
                    "user_href": "/profile/Bernard-Sweeney"
                },
                {
                    "user_id": "Micah Corbett",
                    "user_href": "/profile/Micah-Corbett"
                },
                {
                    "user_id": "Adane Tefera",
                    "user_href": "/profile/Adane-Tefera"
                },
                {
                    "user_id": "Nancy Dubbs",
                    "user_href": "/profile/Nancy-Dubbs"
                },
                {
                    "user_id": "Viorel Radu",
                    "user_href": "/profile/Viorel-Radu-3"
                },
                {
                    "user_id": "Vitor Santos",
                    "user_href": "/profile/Vitor-Santos-26"
                },
                {
                    "user_id": "AJ Anderson",
                    "user_href": "/profile/AJ-Anderson-8"
                }
            ]
        }
    ]
}