{
    "title": "Who is the most underestimated king of India? - Quora",
    "tags": [
        "Kings (royalty)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deepak Kshatriya",
                "href": "/profile/Deepak-Kshatriya-4"
            },
            "answer_text": "Lalitaditya is most under estimated king or samrat in India. Because not a single word is used about him in the indian text books. Lalitaditya was born in the year of 699 as the third son of Durlabhak-Pratapaditya of kashmir. He belonged to the Nagvanshi Karkota Kayastha Dynasty of kashmir, According to historian R.C. Majumdar karkota kayastha families were in the army of the kings of kashmir from many centuries, kashmiri kings gave them the title of Sakhasena in respect of their valor in the battlefield. In the year of 624 A.D., one of the commander of kashmir army named Durlabh Vardhana who belongs to the karkota dynasty married to the kashmiri king’s daughter and hence he founded the karkota vansha. Durlabhak-Pratapaditya was the grandson of Durlabhvardhana. Lalitaditya was the youngest son of Durlabhak, he named him ‘Muktapida’, his two older brothers were ‘Chandrapida and Tarapida’. After the death of king Pratapaditya in 710 A.D. His eldest son Chandrapida became the king of kashmir, it is said that Chandrapida was brave and noble king, his public loved him, he had all the qualities which are necessary to be a great emperor but after ruling for 7 years he died suddenly, the reason of his death is unknown until now, After Chandrapida, Tarapida became the king, he was not as able and brave as his elder brother, he was quite weak physically and after ruling for almost 1.5 years he died due to a stroke. After the death of the both elder brothers ‘Muktapida’ holded the throne of kashmir, he became king in 719 A.D. At the age of just 20 years, This was the time when india’s western front was invaded by the Arabs, just 7 years before the lalitaditya’s coronation, kingdom of sindh was invaded by an arab general named Mohammad Bin Qasim, province of swat, multan and peshawar were under the control of arabs who were threatening central indian kingdom and of course kashmir. Lalitaditya had to deal with some conventional enemies like daradas, kabhojas and bhuttas of ladakh which was under tibetan empire then. He also had a threat from turks in the north and king Yashoverman of kannauj in the south. Here is a small information about the life events of lalitaditya- Lalitaditya Vs Arabs After some years of his coronation he has to fight with an arab general named ‘Momin’ who was the governor of ‘Bukhara’ and wanted to invade kashmir- Momin marched towards lalitaditya after destroying the swat valley, he entered into the Kaghan Valley(now in pakistan) the marched towards kishanganga Valley(neelum valley) where his forces met with lalitaditya and got defeated by him, it is said that lalitaditya was himself leading his army into the battle. After that lalitaditya when invaded the turk region which was then ruled by kimek-gokturks he again defeated ‘Momin’ in bukhara, although it is said that kalhana has exaggerated lalitaditya’s victories but a muslim historian Albaruni’s text also confirms defeat of momin in bukhara by the kashmiri king ‘Mutthai’ which indicates ‘muktapda’s’ name. Momin fought four wars against lalitaditya and got defeated in all four wars, there is a difference among historians about the momin’s death, some says he was killed by lalitaditya and some say he surrendered to lalitaditya and lalitaditya forgave him. Lalitaditya Vs Turks There is no such text available about lalitaditya’s expedition against turkey other than rajtarangini. According to it lalitaditya invaded turk region after successfully defeating the daradas and kambojas, he ordered captured turk army to shave half of their head as a punishment. Lalitaditya Vs Yashoverman Yashovernan was the most powerful king in the central india, he was the only king other than lalitaditya who defeated tibbetts when they tried to attack central india. He belonged to the rathore clan of kannauj and his empire was spread over the whole central and east india nowadays on U.P., Bihar, M.P., Jharkhand, Chattisgarh, some parts of Bangaal and Odisha. Yashoverman and Lalitaditya’s army met somewhere in west U.P. Where lalitaditya tried to have a friendship treaty with Yashoverman but treaty was failed because of Yashoverman’s ministers and the war became essential, although the war results were disastrous for Yashoverman and after that he was never heard again, it is said lalitaditya punished him and removed him from the throne of kannauj and made his son Ama the king who surrendered to lalitaditya. Lalitaditya’s Digvijay After defeating the Yashoverman most of the central indian part comes under the rule of lalitaditya, he then moves towards Bangaal where the kings surrendered to him without fight, then he moved to kalinga which falls under his rule after a little struggle. Then he moved towards karnataka where powerful rashtrakutas were ruling, he made friendly relations with rashtrakutas and konkan kingdoms then he moves towards north where he made friendly relations with the kings of gujarat and rajasthan from there he moved to Panchanad pradesh and madra region where most of the king surrendered to him and the kingdom of takkha was invaded by him. It is said that somewhere in the takkha region he finally defeated the arabs(4th war against momin was fought here) and after that arabs gave up their plans of invading india, so that’s how he saved india from the arabs. Lalitaditya Vs Tibetan Empire Four empires were considered as the most powerful after the lalitaditya’s digvijay. One was chinese empire, other was tibetan empire, third was Lalitaditya’s empire and the fourth was arab empire and the important point was that kashmir’s north west parts were the place where these all four empires meets which eachother. Chinese and Tibetan empires were the conventional enemies from centuries, lalitaditya had a threat from tibetan empire and his minister Mitra Sharma lead a friendly delegation to china seeking their help against tibbatis and giving them help against arabs. China was ruled by Han Dynasty and they gave positive reply to mitra sharma, they also gave weapons and the promise of help if Bhuttas attacks on kashmir. Here in india after defeat of yashoverman tibbatis again became active into the indian politics and they moved an army towards kashmir against lalitaditya. When lalitaditya got this news he also moves his army against tibattis and in a mean time he defeated them and captured ladakh and Land of Akshay Chinh(aksai chin) from them. That’s how lalitaditya defeated all his enemies, saved the land of india from Arabs and made india unite under one rule. And one message to kashmiri pandits. Government will not help , you should fight for your right .and finally Lalitaditya was your ancestor. ",
            "date": "Answered July 17, 2017",
            "views": "622",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sangers Balakrishna",
                    "user_href": "/profile/Sangers-Balakrishna"
                },
                {
                    "user_id": "Ravi Teja",
                    "user_href": "/profile/Ravi-Teja-3936"
                },
                {
                    "user_id": "Mayank Tripathi",
                    "user_href": "/profile/Mayank-Tripathi-9"
                },
                {
                    "user_id": "Narendra Pratap Singh",
                    "user_href": "/profile/Narendra-Pratap-Singh-33"
                },
                {
                    "user_id": "Suraj Sanjay Bhosale",
                    "user_href": "/profile/Suraj-Sanjay-Bhosale-1"
                },
                {
                    "user_id": "Dharmesh Rathore",
                    "user_href": "/profile/Dharmesh-Rathore-3"
                },
                {
                    "user_id": "Bineeth M",
                    "user_href": "/profile/Bineeth-M-2"
                },
                {
                    "user_id": "Savita Ahuja",
                    "user_href": "/profile/Savita-Ahuja-4"
                },
                {
                    "user_id": "Arun Jayaramakrishnan",
                    "user_href": "/profile/Arun-Jayaramakrishnan"
                },
                {
                    "user_id": "Narendra Badam",
                    "user_href": "/profile/Narendra-Badam"
                }
            ]
        }
    ]
}