{
    "title": "Who is Germany likely to elect as Chancellor after Merkel? - Quora",
    "tags": [
        "Angela Merkel (German politician)",
        "Politics of Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philipp Scholz",
                "href": "/profile/Philipp-Scholz"
            },
            "answer_text": "Sophie Blanc’s answer was fantastic. I want to elaborate a bit more on the fact that Martin Schulz will probably become the next Chancellor after Merkel. It is probably safe to say that Merkel won’t run for a 5th term. And it is also probably safe to say that she will win the next election. But after Merkel leaves office in 2021, there really isn’t anybody in the CDU (her party) who looks promising at the moment. Merkel’s leadership of the CDU consisted of getting rid of her fiercest adversaries. That ultimately means that you lose a lot of talent. This means that the next Chancellor will hopefully and probably come from the SPD. Who will be their candidate? This gentleman right here:  Martin Schulz - President of the European Parliament The SPD (socialist party, second biggest party in Germany) has a problem: charismatic, publicly well-liked figures. Frank-Walter Steinmeier, the current Minister for Foreign Affairs, will become President of Germany. He was their most well-liked politician. Now he is gone. The current leader of the SPD is Sigmar Gabriel is not well-liked in the public eye. I remember reading about him that in the party itself he is considered to be a rude person. Their are others like Hannelore Kraft and Olaf Scholz but I won’t talk about them in this answer. Why isn’t he running right now? This has several reasons: He didn’t want to run against his friend Sigmar Gabriel in a vote of the party. I reckon that Sigmar Gabriel wants to try to beat Merkel. That’s why he stepped down..He knows that Merkel will probably step down after her 4th term. Then he will have the chance to run against a weaker opponent. Merkel is still held in high regard by most of the public. But he is at the moment the strongest candidate against her. 54% of the SPD would vote for Schulz as their candidate. [SPD-Kanzlerkandidatur: Umfrage: Schulz hätte größere Chance als Gabriel]He has a problem: He lacks any experience or legitimacy on a national level. As he has said himself in a talkshow: “I have never held any executive power.” He was for most of his public career a European politician. Here in Germany he was pretty unknown until only recently. I have seen his face for the first time 1 year ago. He will most probably assume the role of Foreign Minister of Germany after Frank-Walter Steinmeier gets elected as President. If he can serve well for four years on this post he will become more known to the public eye.This isn’t set in stone but at the moment this seems to be the most probable scenario to me. Edit1: As of 24.1.2017 he has replaced Siegmar Gabriel as the leader of th SPD. This could give him the needed credentials. Let’s see what happens. Edit2: As of 25.1.2017 he is now their candidate for the election. In a recent poll 57% of all Germans were happy with his work. However, his party, the SPD, only scores around 20%. ",
            "date": "Updated January 25, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo Sammallahti",
                    "user_href": "/profile/Leo-Sammallahti"
                },
                {
                    "user_id": "Christian Goldapp",
                    "user_href": "/profile/Christian-Goldapp"
                },
                {
                    "user_id": "Max Dittrich",
                    "user_href": "/profile/Max-Dittrich"
                },
                {
                    "user_id": "Andy Lee Chaisiri",
                    "user_href": "/profile/Andy-Lee-Chaisiri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sophie Blanc",
                "href": "/profile/Sophie-Blanc"
            },
            "answer_text": "Looking at the current polls and the historical election results, it is highly probable that the Chancellor will either be from CDU or SPD. 2017 elections CDU wins. Angela Merkel is likely to be Chancellor. She announced that she is going to run in this election.SPD wins. Sigmar Gabriel is likely to be Chancellor.2021 elections CDU wins. Angela Merkel is expected to quit politics by then. Her potential successors are Thomas de Maizière, Ursula Von der Leyen, Peter Altmeier and Jens Spahn. I personally believe that Ursula Von der Leyen has the highest chance amongst them.SPD wins. I am assuming Sigmar Gabriel lost the 2017 elections. His potential successors are Martin Schulz, Olaf Scholz, Hannelore Kraft or Ralf Stegner. Martin Schulz has, in my opinion, the most likely candidate amongst them.There may, of course, be some surprises like Frauke Petry or Karl-Theodor zu Guttenberg. Who knows? We have Donald Trump as the President of the United States. ",
            "date": "Answered January 6, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krišjānis Liepiņš",
                    "user_href": "/profile/Krišjānis-Liepiņš"
                },
                {
                    "user_id": "Christian Goldapp",
                    "user_href": "/profile/Christian-Goldapp"
                },
                {
                    "user_id": "Kevin To",
                    "user_href": "/profile/Kevin-To-13"
                },
                {
                    "user_id": "Andy Lee Chaisiri",
                    "user_href": "/profile/Andy-Lee-Chaisiri"
                }
            ]
        }
    ]
}