{
    "title": "Who is the founding father that did the most for the U.S? - Quora",
    "tags": [
        "Founding Fathers of the United States",
        "U.S. Constitution",
        "History of the United States of America",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lickiss",
                "href": "/profile/David-Lickiss"
            },
            "answer_text": "I don’t think you can point to any single member of the group and say ‘this person had the greatest influence.’ They communicated a lot with each other and shared and shaped each other’s ideas to such an extent that it is really hard for even professional historians to say which was more influential. Add in the fact that we generally only hear about a small number of the over 200 leading members who where highly influential - esp. in the realm of generating ideas and any conclusion reached is probably going to be missing a few essential data points. I think the founding of our nation was really a group effort and a lot of sharing, shaping, and molding of ideas between a large number of very bright individuals. With those caveats in mind, if one is talking about ‘modern America’ as an economic power, then I’d give the nod towards Hamilton both b/c of his economic policies and b/c generally the Supreme Court has accepted his interpretations of Constitutional powers over Madison’s since the New Deal (Madison’s were on equal to slightly dominant before that and still form the core of conservative thinking today - the modern SCOTUS may turn back to a more Madisonian interpretation with Gorsuch and maybe Kavanaugh on the bench - too early to say with any confidence). If one is talking about ‘modern America’ in a political sense, I think John Adams may be an unsung hero. After the election of 1800 Adam’s supporters called on him to call out the militia and nullify the election so he could remain POTUS. He refused and ceded the office peacefully to a man he deeply loathed (they made up only 25 years later when they were the last of the generation’s political leaders still alive). Had Adams done as his supporters had wished, our history of sharing political power between hostile parties would never have developed. But again, keep in mind that common education leaves us with a huge hole in our knowledge of the FF’s and there are far more of them that played a major role in shaping ideas than most of us realize. ",
            "date": "Answered November 6, 2018",
            "views": "100",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Melody Miller",
                    "user_href": "/profile/Melody-Miller-74"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael O'Connor",
                "href": "/profile/Michael-OConnor-198"
            },
            "answer_text": "Washington, Hamilton and Jefferson. Washington stabilized the government and created a space and time for the nation to get used to the new Federal government and established the unprecedented notion that power could be transferred peacefully. Hamilton saved the new nation economically and set the precedent, through Washington, that the Federal government should help create an environment where new businesses and industries could grow and flourish. Hamilton liked the idea of cities, industry and financial institutions like banks and stock markets. Jefferson hated those ideas. Jeffersons idea of what America should be was an America based on the economy of the South. He wanted an agrarian nation with small towns and a society where the “Natural Leaders” were not necessarily the smartest men, but where the men who owned the most land. He wanted very little in the way of industry and could not understand the new economics of banking, stocks and interest. What makes Jefferson so important is the ideas he put on paper. He took ideas that political philosopher of the Enlightenment had been writing in books most people had not read and distilled them into the Declaration of Independence. The Declaration is the philosophical foundation of what we want America to be. We live in Washingtons and Hamilton economy but with Jeffersons philosophy. ",
            "date": "Answered December 18, 2018",
            "views": "68",
            "upvotes": "0"
        }
    ]
}