{
    "title": "Who truly founded the Catholic Church? - Quora",
    "tags": [
        "History of Catholicism",
        "Roman (Latin) Catholic Church",
        "Catholic Churches",
        "History of Religion",
        "Catholics",
        "Churches",
        "Catholicism",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Turek",
                "href": "/profile/Joe-Turek-5"
            },
            "answer_text": "OK, “the Catholic Church” refers to an organization with lots of employees called priests and bishops and cardinals and nuns and monks and lay people and owns property all over the world. By definition this is not a church. This is an organization. The church started when people first began to be converted to Christianity by Jesus and the apostles and other disciples. This includes Jews and gentiles. Church is the word in English bibles which comes from the Greek word ekklesia. Ekklesia means a community, an assembly, those called out by God for his purpose. In other words, church is people. So ALL who follow Jesus are part of the church no matter what denomination. So when you ask “Who truly founded “the Catholic Church”, you are actually asking who started the organization headquartered in Rome. This was done by Roman authorities under the direction of Emperor Constantine and subsequent emperors to establish Christianity as the state religion of the Roman Empire. The authority to administer the religion was placed in Rome by Roman authorities since it was the capital of the empire. Prior to this there was no central authority of Christianity. In the early years, if there was a “center” for the new sect of Judaism (Christianity) it was Jerusalem. The churches (communities) around the empire and elsewhere were fairly autonomous but they communicated and cooperated with each other. Using the true definition of the word “church”, Jesus started the church when he recruited the apostles and other disciples. They were the first members of the ekklesia. They were the first to make the decision to follow him. ",
            "date": "Updated September 10, 2020",
            "views": "380",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Living Water",
                    "user_href": "/profile/Living-Water-11"
                },
                {
                    "user_id": "Mike Reddy",
                    "user_href": "/profile/Mike-Reddy"
                },
                {
                    "user_id": "Keith A Campagnone",
                    "user_href": "/profile/Keith-A-Campagnone-1"
                },
                {
                    "user_id": "CaramelBeauty",
                    "user_href": "/profile/CaramelBeauty-1"
                },
                {
                    "user_id": "Dan Olsson",
                    "user_href": "/profile/Dan-Olsson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nic Jones",
                "href": "/profile/Nic-Jones-93"
            },
            "answer_text": "The word catholic means “Universal”. Prior to Jesus, the only people allowed in Gods plan were the Isrealites (Jews). After Jesus came, he invited everyone into his church, thus making it universal or Catholic. I think its pretty clear that Jesus founded the church. Its been around for 2000 years. We still have the pope today (successor of Peter). What other institution has been around for thousands of years and has billions of people in it. There isn’t one. Only God could create a church like this that spans nearly every country and corner of the earth. ",
            "date": "Answered August 6, 2019",
            "views": "112",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mercy Berlin",
                    "user_href": "/profile/Mercy-Berlin"
                },
                {
                    "user_id": "Julie Nickell",
                    "user_href": "/profile/Julie-Nickell-1"
                },
                {
                    "user_id": "John-Paul Ignatius Mary",
                    "user_href": "/profile/John-Paul-Ignatius-Mary"
                },
                {
                    "user_id": "Robert Mccabe",
                    "user_href": "/profile/Robert-Mccabe-22"
                },
                {
                    "user_id": "Carol Luscomb",
                    "user_href": "/profile/Carol-Luscomb"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        }
    ]
}