{
    "title": "Who discovered the Philippines? - Quora",
    "tags": [
        "Ancient Philippines",
        "Precolonial Philippines",
        "History of the Philippines",
        "Who Is/Was X?",
        "Discoveries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natsumi Hirose",
                "href": "/profile/Natsumi-Hirose"
            },
            "answer_text": "A long time before Magellan arrived in the Philippines, visitors, traders and colonizers from other lands had come to the Philippines.It is believed that around 3,000 B.C., the Malayo-Polynesians began migrating out of Taiwan and landed in Northern Luzon and over the next 2,000 year they spread across the Philippines.This is backed up by research carried out by the Archaeology Division of the National Museum of the Philippines in 2002. The team gathered evidence that showed the migration from Taiwan to Batanes and Luzon started about 4,000 years ago and that settlements flourished throughout the area for the next 500 years.Arab traders had virtual monopoly of the Spice Trade until 1511. By the 9th century, Muslim traders from Sumatra Malacca and Borneo started visiting Mindanao and Sulu. Islam was introduced in Sulu in 1210 AD and the first Muslim community in Sulu was formed by an Arab known as Tuan Mashaika. A Jahore-born Arab named Shari’ful Hashem Syed Abu Bakr arrived in Sulu in 1450 AD and married the daughter of a local chieftain which is how the Sultanate of Sulu was established.A Muslim preacher Sharif Muhammad Kabungsuan from Malacca arrived in Malabang (Lanao del Sur) in the early part of the 16th century and introduced Islam. He founded the Sultanate of Maguindanao whose capital was Cotabato in 1515 after he married a local princess.In the 11th century spice traders from China started to go to the Philippines most of there trade was in Luzon but there is evidence they travelled as far as Butuan.The Chinese Emperor Yung Lo claimed the island of Luzon in 1405 (Ming Dynasty) and it became part of his empire. The Chinese called the island Lui Sung probably where the name Luzon originated from, others claim it comes from the Tagalog word lusong, a wooden mortar no one is really sure but I feel the former is more likely.The seat of the colonial Chinese government was Lingayen, Pangasinan.After the death of Yung Lo his son became the new Emperor seemed to have no interest in Lui Sung (Luzon). But many Chinese stayed and later become known as Sangleys by the Spanish. The most famous descendent of them was Dr. Jose P. RizalOn March 16, 1521 Ferdinand Magellan arrived in the Philippines and claimed it for the Spanish. History books make it sound like he came across it by accident as he sailed west from Seville looking for a westward route to the Spice Islands. However, it is very likely he knew where the Philippines were. The reason being in 1515, Tome Pires an apothecary for Portuguese Prince Alfonso came across people from Luzon in Malacca. He referred to them as the Luzones and said there must be 500 of them in Malacca. They were the first recorded OFW’s.Ferdinand Magellan spent a few years in Malacca before his expedition to find a westward route to the Spice Islands so had probably heard tales of Luzon and knew where it was, from the Luzones that worked there.We are unable to name the first person that discover the Philippines as that person is unknown, what we do know is it was not Ferdinand Magellan as he was a few thousand years to late to be the first.We do not believe Ferdinand Magellan should be written out of the history books as there is no doubt that his arrival it the Philippines was a major part of the country, but it should be changed him being the first European to discover the Philippines ",
            "date": "Answered July 19, 2017",
            "views": "155",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Amor Asuncion",
                    "user_href": "/profile/Maria-Amor-Asuncion"
                },
                {
                    "user_id": "Gabriel Barroquillo",
                    "user_href": "/profile/Gabriel-Barroquillo"
                },
                {
                    "user_id": "Leo Elrey Parreño",
                    "user_href": "/profile/Leo-Elrey-Parreño"
                },
                {
                    "user_id": "Robert Drahos",
                    "user_href": "/profile/Robert-Drahos"
                },
                {
                    "user_id": "Erika Bautista",
                    "user_href": "/profile/Erika-Bautista-9"
                },
                {
                    "user_id": "Lucá Rand",
                    "user_href": "/profile/Lucá-Rand"
                },
                {
                    "user_id": "Mike Hulleman",
                    "user_href": "/profile/Mike-Hulleman-1"
                },
                {
                    "user_id": "Rach Maninoff",
                    "user_href": "/profile/Rach-Maninoff-2"
                },
                {
                    "user_id": "Carlo Dimaano",
                    "user_href": "/profile/Carlo-Dimaano-3"
                },
                {
                    "user_id": "Justin Louis",
                    "user_href": "/profile/Justin-Louis-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Owen",
                "href": "/profile/Norman-Owen"
            },
            "answer_text": "We have no idea. We know there were “hominids” (early humans) there hundreds of thousands of years ago, and modern humans many tens of thousands of years ago, who had possibly come from South China by way of Taiwan. Within the last two thousand years or so the islands were populated by the ancestors of current Filipinos, and were known to other Asians (e.g., the Chinese), as the Filipinos also knew nearby Asian countries. Eventually Filipino chiefdoms sent envoys to China and traders as far as Melaka (Malacca) in modern-day Malaysia. So there was no “discovery” needed. As far as Western awareness of the Philippines - which is what “discovery” often implies - the major credit goes to Ferdinand Magellan, a Portuguese navigator in command of a Spanish expedition that ended up going around the world. They arrived in the Philippines - having come across the Pacific - in 1521. Magellan himself was killed in a local Filipino dispute not long after, and the remainder of his expedition, under the command of Juan Sebastian del Cano (or Elcano), completed the voyage back to Spain with news of the Philippines. This is “discovery” in the sense that one might say “I just discovered a wonderful new Thai restaurant!” It’s new to you, but you’re hardly the first customer. ",
            "date": "Answered November 7, 2018",
            "views": "54",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jazz Kien",
                    "user_href": "/profile/Jazz-Kien"
                },
                {
                    "user_id": "Jaza Beatriz S. Rosales",
                    "user_href": "/profile/Jaza-Beatriz-S-Rosales"
                },
                {
                    "user_id": "Perseus Esparza",
                    "user_href": "/profile/Perseus-Esparza"
                },
                {
                    "user_id": "Craig Blurton",
                    "user_href": "/profile/Craig-Blurton"
                },
                {
                    "user_id": "Jeff Painter",
                    "user_href": "/profile/Jeff-Painter"
                }
            ]
        }
    ]
}