{
    "title": "Who was the greatest heavyweight champion in the world? Why? - Quora",
    "tags": [
        "Famous Athletes"
    ],
    "response": [
        {
            "author_info": {
                "name": "John McGlothlin",
                "href": "/profile/John-McGlothlin-1"
            },
            "answer_text": "In terms of domination and success over time, Ali was the best and most dominant heavyweight of all time. He beat the best competition, the most top 100 of all time heavyweights, over the longest period of time. He remains the only heavyweight to come out of retirement and regain the undisputed title. But Ali was more than a boxer - the picture you see below is Ali literally going out on a ledge to bring a homeless man, who was 9 floors up and talking of killing himself, to safety. And it was not the only time Muhammad Ali risked his life for other people, Ali was a success in life as well as in the ring.  CREDIT PICTURE TO LA TIMES AND BORIS YARO Ali was, without doubt, the most successful and dominant heavyweight champion in history He won the title in February of 1964, and last regained the title in September of 1978, 14 years and 8 months later. In between he beat 16 top 100 of all time heavyweights, including 4 in the top 20 of all time, and 10 years apart, beat the two more feared heavyweights of the modern age, Sonny Liston and George Foreman. Ali retired for the first time - we are not counting his forced, 3 1/2 year \"retirement\" from 1967 to 1970 when he was barred from boxing - on September 15, 1978 after he regained the title from Leon Spinks. He was almost 37 when he retired, had been in 59 fights, 56-3, with losses only to Joe Frazier, Ken Norton, and Leon Spinks. Ali had avenged all three losses at least once,and in Frazier and Norton’s case, twice. No question, the all time most successful heavyweight, in boxing, and in life, was Muhammad Ali. The only man to come out of retirement and regain the heavyweight title, Ali was a three time heavyweight champion, who beat 7 Hall of Fame fighters, running the gamut from all time great punchers, like Liston, Foreman, Frazier, and Norton, to all time great boxers, like Patterson and Moore. He beat one of the ten best light heavyweights ever, Bob Foster. He beat big fighters, he beat small fighters, he beat fast fighters, he beat great offensive fighters, he beat great defensive fighters. In his own words, \"whopped them all!\" The only fights he ever lost, he avenged, except the two at the end of his career, when he had been retired two years, was nearly 40, and already suffering from Parkinson's. We have someone completely uninformed about boxing who claims Larry Holmes was a better fighter than Ali - the same Larry Holmes who lost his title to the light heavyweight champion at 35, while Ali, at 35, was defeating the greatly feared, and probably hardest punching, heavyweight of all time, Ernie Shavers. Indeed, Ali is the only fighter in history to be 11-0 in rematches, he defeated every fighter he faced in a rematch! Ali's record of beating 21 boxers for the world heavyweight title - tied with the great Joe Louis stood for 30 years. His record of winning 14 unified title bouts - tied with Hall of Fame welterweight champ Jose Napoles - stands today. Ali is the only boxer to be selected by Ring magazine as Fighter of the Year six times. Ali was also ranked as the greatest athlete of the 20th century by Sports Illustrated. He was also the Sports Personality of the Century by the BBC. He was named the third greatest athlete of the 20th century by ESPN Sports Century. Ali is generally ranked as the best heavyweight ever, by virtually every expert in the field, and is in the top five pound for pound fighters ever. Ali fought the following fighters in the top 150, and they are ranked by Boxrec: There were 22 top 150 fighters active in Ali’s Era, 23 counting him, and he faced them all: And then we have the Greatest, Muhammad Ali; Ali faced 17 top 100 greats, 22 top 150 fighters, and beat all but one, when he was 39 and ill: #2 Archie Moore (ranked as light-heavyweight but fought for heavyweight title twice) #4 Sonny Liston #13 Joe Frazier #14 Larry Holmes #15 Floyd Patterson #19 George Foreman #20 Bob Foster (ranked as light heavyweight but fought for heavyweight title twice) #22 Cleveland Williams #34 Ken Norton #36 Zora Folley #43 Henry Cooper #44 Ernie Terrell #48 Jimmy Ellis #51 Karl Mildenberger #57 Oscar Bonavena #67 Jerry Quarry #68 Ron Lyle Ali faced 17 top 100 all time heavyweights in 26 fights, he beat 17 of the 18 at least once, 5 of them twice! Of the 17 top 100 all time heavyweights he fought and beat, 10 were after 1970! Add in from between 100 and 150 all time: #116 Joe Bugner, #118 Doug Jones, #124 Jimmy Young, #131 Mac Foster, #141 Earnie Shavers, and Ali faced 22 fighters in the top 150 and beat 21 of them at least once in 31 fights! That is by far the best competition faced and beaten in heavyweight history. Ali faced better competition than any other heavyweight in history. Over half of his fights were with top 150 competition - no other heavyweight in history comes remotely close to that. Ali faced 17 of the top 100 all time greats plus five more in the top 150! Ten of Ali’s opponents are in the Hall of Fame! Muhammad faced 22 top 150 fighters in 30 fights, a feat not matched by anyone else in history. BoxRec: Ratings Ali fought 3 in the top 10 heavyweights, 6 higher ranked than the highest ranked fighter today, (Fury at #25) and 22 in the top 150, and 2 of top 10 light heavyweights! Ali beat 16 of the 17 top 100 fighters he faced at least once, five of them twice, and beat all 5 of the additional fighters ranked from 100–150, beating 21 of 22 top 150 fighters he faced, the most in history for any fighter in any weight division. Anthony Mason, boxing writer, said \"I think the only way to fairly rank a boxer's place in history is by comparing their résumés. And that does not mean just wins and losses - it is too easy today to fight only has beens or never will be's, and run up the record.” Over half Ali’s fights were against top 150 of all time opponents, by far the most in history! Most people do not realize 3 of Ali’s 5 losses came when he was over 37, and ill with Parkinson’s. The only two losses that occurred during his prime were to all time greats #10 Joe Frazier, (and Ali had been off going on 4 years, and had taken the Frazier fight only 4 months back over his trainer’s objections), and to #26 Ken Norton, (and Ali had his jaw broken in the early rounds, and still managed to tough out the entire fights to lose on a split decision. He won 2 rematches against both men. Max Kellerman summed up the Ali era: “From 1970, when Ali came back from his forced exile, to 1978, when Ali won back his crown for the final time (against Leon Spinks), Ali shared the very top shelf with Joe Frazier and George Foreman, and the three of them were supported by Ken Norton and Joe Bugner and, in the beginning of the decade, Oscar Bonavena, Jerry Quarry and Jimmy Ellis, and at the end of the decade Ernie Shavers, Ron Lyle and Jimmy Young. Ali fought them all, and many of the others fought each other. The greatest heavyweight era ever.” As heavyweight eras go, this one is very good Ali fought the best competition in history, and in the end, it is who beats who, and when they do it - and he fought them all in their prime except Sonny Liston “When people ask me about who was the greatest of all time, I say look at the records. I fought better competition, over a longer period of time than any other fighter in history.” (Ali himself quoted in “The Greatest”) Angelo Dundee, Ali's and Sugar Ray Leonard's trainer, said; \"look at Ali’s quality of opposition. He shook up the world against Liston, then did it again. He shocked the world against Foreman. He won two out of three against Frazier. Same against Ken Norton. He beat Patterson twice. The also-rans on Ali’s record—Jerry Quarry, Ron Lyle, Zora Folley, Oscar Bonavena, Bob Foster, Ernie Terrell—were as good as all but two or three opponents Joe Louis beat during his 11 years as champ.\" BBC boxing writer and historian Ben Dirs said of Ali compared to Wlad Klitschko and other fighters of this generation, \"Ali reigned in the most talent-rich era of heavyweight boxing, winning the title from the fearsome Sonny Liston in 1964, winning it again from the even more fearsome George Foreman 10 years later and beating greats such as Floyd Patterson, Joe Frazier and Ken Norton in between.\" Ali met great punchers and beat them: Ron Lyle, Earnie Shavers and George Foreman Ali met great boxers and beat them: Jimmy Ellis, Floyd Patterson, Zora Folley, Jimmy Young Ali met great boxer/punchers and beat them: Sonny Liston. Ali met the greatest swarmer of them all, and beat him twice: Joe Frazier To quote Ali, \"I whopped them all!\" In his book \"Going the Distance,\" Ken Norton said, \"out of all the fighters I was in with, Frazier, Foreman, Holmes, Ali was the best.\" Not only that, Ken said, \"he was the best I ever saw, period.\" But Ali's impact was certainly not limited to sports - he was a champion in real life Ali recorded two spoken word albums and a rhythm and blues song, receiving two Grammy nominations for his venture into artistry. Nor was Ali absent from the social justice arena - when he retired from boxing in 1981, at age 39, Ali focused on religion and charity, until his declining health prevented him from public appearances. Ali donated millions to charity organizations and disadvantaged people of all ethnic, racial and religious backgrounds. Ali helped to feed more than 22 million people afflicted by hunger across the world. In 1990, Ali went to Bagdad as the first Gulf War was looming, to try and free 15 American hostages being held by Saddam Hussein. Ali, already badly ill with Parkinson's, ran out of his medications while in Bagdad, yet persevered until Saddam allowed him to take all 15 American hostages home to their families. On Dec. 2, 1990, Ali and the hostages flew out of Baghdad, headed for JFK. The men remained overwhelmed. “You know, I thanked him,” said former hostage Bobby Anderson. “And he said, ‘Go home,’ be with my family . . . what a great guy.” Among his many charitable efforts, Ali worked with the Michael J. Fox Foundation for Parkinson's Disease to raise awareness and encourage donations for research. In 1987, the California Bicentennial Foundation for the U.S. Constitution selected Ali to personify the the U.S. Constitution and Bill of Rights. Ali rode on a float at the following year's Tournament of Roses Parade, launching the U.S. Constitution's 200th birthday celebration. In 2012, Ali was awarded the Philadelphia Liberty Medal in recognition of his lifelong efforts in activism, philanthropy and humanitarianism. And the champ never forgot ordinary people - on January 19, 1981, in Los Angeles, Ali talked a suicidal man down from jumping off a ninth-floor ledge, an event that made national news, though Ali simply said he was glad he could help. On September 10, 1966, a young Ali defended his title in Frankfurt Germany against Karl Mildenberger as part of his \"European tour.\" He was tired and stressed by a return to the USA to continue his fight against the military draft, but he won the fight nonetheless. In the 12th round, with Mildenberger on the ropes, referee Teddy Waltham stopped the fight. At the airport the next day, Waltham’s fee of 1,000 pounds was stolen. Waltham, who was counting on the money to pay his mortgage and bills, was distraught. When Ali heard, he gave Waltham the money from his own pocket. When asked about the incident, Ali shrugged it off, saying \"man, don't make this a story, he needed the money more than I did.\" Can there be any doubt that Ali was the most successful heavyweight champion ever in terms of his impact on national and world consciousness? No, there can be no doubt. Can there be much doubt he was the greatest heavyweight boxer of all time? Not a great deal. Muhammad Ali, champion in the ring, and in life, a hero for the ages.  CREDIT TO: Records and Statistics to Boxrec Details about Ali and his life to: Boris Yaro and the LA Times Muhammad Ali: A Life by Thomas Hauser Muhammad Ali meets a man on a ledge by Greg Howard, New York Times Magazine “The Greatest: My Own Story by Muhammad Ali ",
            "date": "Updated July 2, 2020",
            "views": "68",
            "upvotes": " View 73 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Obai Ahmed",
                    "user_href": "/profile/Obai-Ahmed"
                },
                {
                    "user_id": "Atul Saha",
                    "user_href": "/profile/Atul-Saha-6"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Randy Shiverdecker",
                    "user_href": "/profile/Randy-Shiverdecker"
                },
                {
                    "user_id": "Saso Nano",
                    "user_href": "/profile/Saso-Nano"
                },
                {
                    "user_id": "Tusshar Pandey",
                    "user_href": "/profile/Tusshar-Pandey-3"
                },
                {
                    "user_id": "Marcos André Pereira",
                    "user_href": "/profile/Marcos-André-Pereira"
                },
                {
                    "user_id": "Solaeman Hasan",
                    "user_href": "/profile/Solaeman-Hasan"
                },
                {
                    "user_id": "Dave Lawson",
                    "user_href": "/profile/D-Lawson-18"
                },
                {
                    "user_id": "Scott Laing",
                    "user_href": "/profile/Scott-Laing-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Holliday",
                "href": "/profile/David-Holliday-27"
            },
            "answer_text": "This is a tough one, because the answer is so subjective. I believe that answering this question is like sex in a fishbowl, no matter how well you do there will always be critics of your method. Here is my admittedly unprofessional list with reasons. 10. John L. Sullivan  He probably would be closer to number one if we could see him fighting in his prime and if he had more title defenses. A bare knuckle boxer who transitioned to 3 oz gloves, his punch would be devastating to a modern boxer fighting with old time rules. His endurance was legendary. His 75 round fight with Tommy Kilrain was fought open air, in 100 degree heat and lasted 2 hours 16 minutes. His fight with Patsy Cardiff was a draw, but in the first round he tore a rotator cuff and fought 4 rounds just using his right. The last bare knuckle champion, and the first recognized world champion he was a page of history. Post career he was a bar owner but bravely admitted and beat his own alcoholism a far tougher opponent than any boxer. Too bad there wasn’t video in the Great John L’s heyday. 9. Jersey Joe Walcott  He relied a bit too much on counters and had some slumps but he was only fighter that Ali ever thought would give him trouble. Walcott was a devastating hitter who dropped Marciano though he lost the fight. He became heavyweight champion at 38 a record that held until George Foreman. His post career was admirable, although he did some exhibitions with wrestlers and refereed some boxing with embarrassing results, he was the first black Sherriff of Camden NJ and served as NJ State Athletic Commission Chairman. 8. Sonny Liston  His train-wreck of a life overshadowed his boxing influence, a life that had it been healthier and cleaner would probably have made him one of the top 3 boxers ever. Using his fighting skills for crime, against police, and the mind-boggling loss to Leotis Martin tarnished his greatness forever. Arguably more of a bully and brawler than a boxer his career was amazing and his punches were incredible. 7. Earnie Shavers  The only non champion on this list, Shavers had his flaws-he lost to Ali and Holmes, arguably the only really great fighters he ever fought, and relied too much on power punches instead of boxing skills. Still he remains one of the most feared hitters ever. Holmes said that Shavers hit harder than Tyson, and Ali famously quipped: “Earnie hit me so hard it shook my kinfolk back in Africa.” His punching was also admired by the great Angelo Dundee and others. His post career charitable work is inspiring. 6. Rocky Marciano  These days it is somewhat fashionable to downplay the Brockton Bomber, and with some justification. The boxing field was somewhat anemic in the 50s, the only great fighters he faced, were Charles (who gave him tons of trouble) and Moore, Louis, and Walcott, all a bit long in the tooth but who knocked him down. His small stature would handicap him against some of history’s largest boxers in their prime. Still his fanatical devotion to training, his 49–0 record with 43 KOs is terrific. He kept boxing interest alive until Ali. Arguably one of the smartest boxers ever, he quit on the top and managed his fortune well enough to never have to enter the ring again-note how rare that is! As a WW2 veteran his respect for Ali’s ability over his lack of military service went a long way to gaining the latter’s acceptance by the older generation. The ridiculous computer fight not withstanding Ali’s respect for the older white man and friendship with him also went a long way in 60s activists seeing that the older generation wasn’t all bad. 5. Mike Tyson  An electric fighter, missteps cost him a career that could eclipsed all other heavyweights. His zombie like performance against Douglas, ducking Holyfield in his prime and the ear biting incident a few years later, to say nothing of the drug testing debacle of the Golata fight all ruined his reputation. It didn’t help that a rape conviction and jail sentence took away several of his prime fighting years. Still Tyson was a devastating fighter. The youngest heavyweight champion, Tyson won his first 19 bouts by knockout, 12 in the first round. His hand speed and power put him among the greats. He is to be commended for his hard work in turning his life around post boxing. He worked very hard on that. 4. George Foreman  He is a hard boxer to fault, really his biggest flaw was his decline after losing to Ali both professionally and emotionally. But Foreman had one of the best uppercuts in history, as well as a punishing jab. His comeback later in life culminating in becoming the oldest heavyweight champion at 45 inspired a lot of middle aged people. A fearless man he left the broadcast booth during the Bowe/Golata fight riot and guarded the production staff. He also shielded Billie Jean King after her victory over Bobby Riggs. Outside of boxing he is a charismatic and inspiring preacher who made one of the best decisions of the last 30 years accepting a partnership over pay in endorsing the Foreman grill. A deal rightfully studied by all investment students. 3. Jack Johnson  I thought long and hard before putting him at 3. But the sad losses he experienced in later life when he went back to the ring desperate for money, and the fact that he let his personal exploits affect his career tarnish a great boxer. Some sources also say Johnson himself was behind rumors that he threw the famous fight with Jess Willard. He certainly didn’t stop them, and watching the fight that rumor doesn’t hold water. But in an era where conditioning was limited he had a physique that modern fighters would envy, and a jab, clinch and overall defense that would make him capable of beating any boxer on this list. Much is made of Ali’s courage in battling the race barriers and refusing the draft. Ali had unlimited support however and only suffered a boxing suspension. Johnson fought during Jim Crow and had hundreds of plausible death threats, the threats were declared plausible by the very police who wouldn’t protect him going into dangerously overcrowded arenas. Whether you support Ali on the draft, the fact is he did evade it. Johnson served a year in prison for taking his Caucasian wife over state lines in a gross corruption of human trafficking laws. Johnson received little support even from his own race but he stood tall. 2. Muhammed Ali  Yes he did misstep by coming out of retirement past his prime and he had some embarrassing spectacles to make money including silly encounters with professional wrestlers. While most consider him a man of principle, many Vietnam veterans and their families understandably are bitter about his refusal to fight. Still a young Ali was the greatest pound for pound boxer in history with flawless technique. Jack Dempsey I’ll get flack for this but truly the best of them all. Dempsey wasn’t a perfect boxer, he made defensive mistakes some of which were rookie. He was foolish to train himself-hence the mistakes. But Dempsey’s early knockouts were flawless and he often competed in circumstances modern fighters wouldn’t touch. He once walked through the Nevada desert for a fight. His legendary fight with Jess Willard was in scorching heat in an extremely dangerously overcrowded arena. Willard BTW had 5.5 in height advantage and was 58 pounds heavier. Willard’s injuries were embellished significantly but he was pummeled badly. In WW2 incorporating his own boxing and gathering some of the best wrestlers and jujitsu practitioners in the country he developed a physical training/hand to hand program for the Coast Guard. To everyone who thinks MMA started in the 90s or was invented by Bruce Lee, Dempsey had them beat by many years. Later in the war at age 49 he was in the battle at Okinawa. Dempsey’s book on fighting tough is on the bookshelves of every black belt and fighter that I’ve ever met. Lastly, while the story has been exaggerated greatly, as an old man the Manassa Mauler did level a much younger mugger who never knew what hit him. Maybe Dempsey wasn’t always the greatest boxer but he was a very tough man. ",
            "date": "Updated November 28, 2019",
            "views": "31",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victor Von Vockerman",
                    "user_href": "/profile/Victor-Von-Vockerman"
                },
                {
                    "user_id": "Robert Rampino",
                    "user_href": "/profile/Robert-Rampino-1"
                },
                {
                    "user_id": "Yves Summons",
                    "user_href": "/profile/Yves-Summons"
                },
                {
                    "user_id": "Steve Rychlec",
                    "user_href": "/profile/Steve-Rychlec-1"
                },
                {
                    "user_id": "Axel Henriksen",
                    "user_href": "/profile/Axel-Henriksen-1"
                }
            ]
        }
    ]
}