{
    "title": "Who killed Benazir Bhutto? Who got most benefit out of it? - Quora",
    "tags": [
        "Assassination of Benazir Bhutto (December 2007)",
        "Bilawal Bhutto Zardari (Pakistani politician)",
        "Benazir Bhutto (Pakistani politican)",
        "Politicians and Government Leaders of Pakistan",
        "Assassinations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamshair Ali",
                "href": "/profile/Jamshair-Ali-1"
            },
            "answer_text": "This is actually a very important question, which has required higher level of political intelligence to answer it. We have to go back in early 80s to understand the scenario why this was happen and who could be the beneficiary of Mohtarma’s Murder. Benazir Bhutto Shaheed was the 1st Women Prime Minister of any Muslim Country. After the assassination of her father she become very fame in general Public specially in those who were real followers of her Father Mr. Zulifqar Ali Bhutto. In early 80s Mr. Zulfiqar Ali Bhutto was hanged by Military Dictator Zia ul Haq, punishment of murder done by Mr. Zulifqar Ali Bhutto. Zia ul Haq govern Pakistan for almost 10 year, and since he came into power he was engaged in Russian Afghan war. Talban were the early resistance against Russia backed by Pakistan and indirectly backed America through Zia Ul Haq. Talban are considered the produce of Zia ul Haq both in Pakistan and Afghanistan. Talban were alliance of Zia ul Haq, and while Zia ul Haq was died in Plan crash in Pakistan, the mess of Talban was not rolled up. Benazir Bhutto was against Talbanizaton approach because of their alliance with Zia ul Haq , She was also known She was famous for the her bold statements about Talban where which was highlighted by Talban Leaders. There were several death attack warnings to her given by Intelligence, she was also advised not to come Pakistan. When she arrived in Pakistan, her security was a biggest challenge as she was already on hit list of anti PPP ( Pakistan People Party) elements. she was killed in Rawalpinid. She was attacked and killed, and responsibility was took by Pakistani Talban ( TTP). Now the question here is why only Benzir was killed, why not other Politicians, the answer is almost every politician was under threat in those days. Her security was inefficient, she was easy target. The people who were appointed on her security were not included under proper investigation, as PPP political administration was using its power to change the direction of the case. Her Murder was already planned, Sympathy of the people was won by the party, which was used to increase the vote bank. Very next elections were won by PPP, and party was in power for 5 year. Now interesting question here is if PPP was in power after the death of Benazir, why not PPP work to investigate the case in proper way. , ,? .The most beneficiaries are from inside the party who enjoyed ruling after her death. ",
            "date": "Answered May 1, 2017",
            "views": "27",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vijay Pimputkar",
                    "user_href": "/profile/Vijay-Pimputkar"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Mohamed Inamul Hasan",
                    "user_href": "/profile/Mohamed-Inamul-Hasan"
                },
                {
                    "user_id": "Ghulam Farooq",
                    "user_href": "/profile/Ghulam-Farooq"
                },
                {
                    "user_id": "Lubana Aman",
                    "user_href": "/profile/Lubana-Aman"
                },
                {
                    "user_id": "Ali",
                    "user_href": "/profile/Ali-721"
                },
                {
                    "user_id": "Yaseen Baloch",
                    "user_href": "/profile/Yaseen-Baloch-3"
                },
                {
                    "user_id": "Aslan Khan",
                    "user_href": "/profile/Aslan-Khan-3"
                },
                {
                    "user_id": "Ifran Hossain Mollah",
                    "user_href": "/profile/Ifran-Hossain-Mollah"
                },
                {
                    "user_id": "Ayesha Fatima",
                    "user_href": "/profile/Ayesha-Fatima-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fahd Anwar",
                "href": "/profile/Fahd-Anwar-2"
            },
            "answer_text": "I think it's clear that TTP was involved in it's killing. You have seen number of confessions in this regards. As far as benefit there was no beneficial for her killing. It was a huge loss for everyone. If you talk about conspiracy theories you can tell any story. As far as prime suspect it's quite difficult to identify prime suspect when war was going on. Pakistan was on war on terrorism when this happened. ",
            "date": "Answered May 1, 2017",
            "views": "357",
            "upvotes": "0"
        }
    ]
}