{
    "title": "Who benefited the most from the Industrial Revolution? - Quora",
    "tags": [
        "Industrial Revolution",
        "Economic History",
        "Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Carleton",
                "href": "/profile/Stephen-Carleton"
            },
            "answer_text": "The better question is, who didn't? As an expression of the natural right to own property, the Industrial Revolution was driven by men expanding the free market by pursuing better and more productive means to please their customers. Common goods became more abundant. Prices for these goods became cheaper. The need for more production created more jobs expanding the economy raising everybody's living standard. Prior to the Industrial Revolution the state of mankind had been one of a brutish existence and grinding poverty for thousands of years. Expressed graphically the line expressing our living standards was nearly flat. Beginning with the early 19th Century that line began to turn sharply upward becoming near vertical in 50 short years continuing upward until this moment. Those of us that take account of the improvements in our lives recognize the benefits of free market capitalism. Those that don't recognize the benefits of free market capitalism fail to take into account the improvements in our lives. ",
            "date": "Answered June 5, 2019",
            "views": "603",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Baker",
                    "user_href": "/profile/John-Baker-1414"
                },
                {
                    "user_id": "Jim Strong",
                    "user_href": "/profile/Jim-Strong-24"
                },
                {
                    "user_id": "Joe Lammers",
                    "user_href": "/profile/Joe-Lammers"
                },
                {
                    "user_id": "David Argall",
                    "user_href": "/profile/David-Argall"
                },
                {
                    "user_id": "Michael Edelman",
                    "user_href": "/profile/Michael-Edelman-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Gartside",
                "href": "/profile/Bob-Gartside"
            },
            "answer_text": "In many ways the Industrial Revolution in England was a people’s revolution. As an example take James Brindley, a humble servant of the Duke of Bridgewater. He built canals, some through unbelievably difficult country, Brindley was the pioneer canal builder, he even dug one canal deep into a coal mine. Wedgewood was a simple excellent potter and marketing genius, his ‘Jasper’ ware continues to sell well almost 200 years since the design first appeared. George Stephenson was a self educated engineer who virtually invented railways. Thomas Telford was a simple stone mason who built hundreds of miles of roads and canals through difficult country. Other simple workmen revolutionised the production of textiles, and the entire Cheshire chemical industry was built by small masters with minimal staffs. Wilkinson revolutionised the manufacture and use of cast iron and made Wellington’s cannon which defeated Napoleon at the final, decisive, battle of Waterloo, which cemented Britain’s position as the World’s leading great power. This is a short posting, but the total picture is of British pre-eminence because of the skills, financial genius, and entrepreneurial activity of relatively humble craftsmen. It should be a matter of marvel that so many financially untutored craftsmen should amass and manage the great wealth they acquired. ",
            "date": "Answered November 11, 2019",
            "views": "227",
            "upvotes": "0"
        }
    ]
}