{
    "title": "Who were the Huguenots, and why were they persecuted? - Quora",
    "tags": [
        "Huguenots",
        "Louis XVI (historical figure)",
        "History of France",
        "History of Europe",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Hirschhorn",
                "href": "/profile/James-Hirschhorn"
            },
            "answer_text": "They were Calvinist Protestants who were a minority religion in France. Henry of Navarre, who became Henri IV, was their leader during the religious wars between 1562 and 1598, when he converted to Catholicism in order to become king and end the war. He promulgated the Edict of Nantes, which gave the Hugueonts religious toleration and control of a number of towns in Protestant areas. Under his son Louis XIII, who was raised Catholic, the prime minister Cardinal Richlieu ended the independence of the Huguenot towns, notably in the siege of La Rochelle that forms the central episode of The Three Musketeers. Henri IV’s grandson Louis XIV was a strong Catholic who became increasingly devout in middle age under the influence of his mistress and later morganatic wife Madame de Mantenon. Aside from whatever religious feeling he developed as he grew older and his libido declined, Louis XIV shared the belief of his day that uniformity of religion was essential to unity and discipline in the state. In 1685 he revoked the Edict of Nantes and began a campaign of harassment and forced conversion against the Huguenonts. The harassment included the dragonnades, the quartering of unruly soldiers in Protestant homes. Thousands of Huguenots who could afford it, businessmen and skilled workers, fled to England, the Netherlands and Prussia, which welcomed them as fellow Protestants and valuable immigrants. Many others converted, and Louis was told by his subordinates that heresy no longer existed in France. That wasn’t quite true; some stubborn Protestants remained, and there was an armed Huguenot revolt in the south of France in 1702–05. While the systematic persecution ended with Louis’s death in 1715, Huguenots were subject to trumped up criminal charges and other harassment by local officials until the Revolution. ",
            "date": "Answered March 22, 2020",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Louise Culmer",
                "href": "/profile/Louise-Culmer"
            },
            "answer_text": "They were Protestants who were persecuted for not being Catholic. There were periods in French history when they were tolerated - there were quite large numbers of them so they were not that easy to get rid of. For instance, between 1562 and 1598 there were a succession of religious wars between Catholics and Protestants. Some Huguenots fled abroad to escape persecution, many settled in London, and some in Canterbury in Kent, where I live, in fact ever since then, there has been a Protestant Service in French in the crypt of Canterbury Cathedral once a week. A lot were in the weaving trade, and for instance Spittalfields in London became famous as an era for silk weaving, with most of the weavers being of Huguenot origin. when the Protestant Henry of Navarre became King of France he converted to Catholicism because he knew he could never rule successfully as a Protestant, and as he famously said ‘Paris is worth a Mass.’. He passed the Edict of Nantes, which guaranteed freedom of worship to Huguenots, of who, there were now far fewer in France, so many of them having fled the country. However, in 1685 the edict of Nantes was revoked, Huguenots were persecuted again, and many more fled abroad. This was very bad for the French economy, as many Huguenots were successful business people. After this Protestantism went underground in France until the Revolution. ",
            "date": "Answered March 22, 2020",
            "views": "107",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angelos Marantos",
                    "user_href": "/profile/Angelos-Marantos"
                },
                {
                    "user_id": "Godfrey Kuossange",
                    "user_href": "/profile/Godfrey-Kuossange"
                },
                {
                    "user_id": "Heinrich Gratz",
                    "user_href": "/profile/Heinrich-Gratz"
                },
                {
                    "user_id": "Pierallini Philippe",
                    "user_href": "/profile/Pierallini-Philippe"
                },
                {
                    "user_id": "Matt Dodgers",
                    "user_href": "/profile/Matt-Dodgers"
                },
                {
                    "user_id": "Jenny Taylor",
                    "user_href": "/profile/Jenny-Taylor-176"
                },
                {
                    "user_id": "Steven Zrnich",
                    "user_href": "/profile/Steven-Zrnich"
                }
            ]
        }
    ]
}