{
    "title": "Who gave France land claims in America? - Quora",
    "tags": [
        "History of France",
        "Land",
        "France",
        "Culture of the United States of America",
        "Geography",
        "History of the United States of America",
        "Real Estate",
        "International Relations",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Burkhalter",
                "href": "/profile/Karl-Burkhalter-1"
            },
            "answer_text": "The French claimed Quebec and Louisiana in the 1600s by dealing with the Native Americans. They sold Louisiana to Spain who made it a thriving Colony. Napoleon stole it back when he conquered Spain, before selling it to Jefferson. ",
            "date": "Answered October 23, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andreas Hedkins",
                    "user_href": "/profile/Andreas-Hedkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Gall",
                "href": "/profile/Dan-Gall-1"
            },
            "answer_text": "French land claim in North America were made by French explorers, They explored Canada east of the Rocky Mountains, and all the way down the Mississippi to the Gulf of Mexico. Here is a map showing the extant of French claims  The British conquered Canada in 1763, and the French sold Louisianna to the Americans in the 1800s ",
            "date": "Answered October 24, 2020",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roberto Eduardo",
                "href": "/profile/Roberto-Eduardo-1"
            },
            "answer_text": "I do not know. But such claims are mostly taken by force. I never tried to read something about Louisiana and Quebec. Neither why there were once the Danish Virgin Islands in the Caribbean which were later sold to the US to become the American Virgin Islands. ",
            "date": "Answered October 23, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Dawson",
                "href": "/profile/Robert-Dawson-204"
            },
            "answer_text": "Not the native Americans. European expeditions arrived in the americas and starting claiming vast lands in the name of their kings. Colonization followed ",
            "date": "Answered October 23, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}