{
    "title": "Who were the great white cult of ancient Egypt? - Quora",
    "tags": [
        "Cults",
        "Ancient Egypt",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Einstein",
                "href": "/profile/Kevin-Einstein-2"
            },
            "answer_text": "You again! Egypt was never ancient! They were Greeks pretending to be Egyptians with a very small colony! The whole of Egypt is 20 times the size of all of the Greek Tribe regions! Please don’t believe the hype! Ptolemy lived in a barren land which only the upper regions, known as lower Egypt produce many fertile lands! The rest of the Nile belonged to the Kushites or Khemites or Meromites! The lands of Kush controlled much of the Nile. Below the Nile was the lands of Punt and the Great Kingdom of Askum known as Saba! So who were the great White cult of Egypt… none! as White isn’t even an ancient term! Nor is Black! But at least black was associated with dark or unseen! White comes from the word Bleach… Also Black comes from the word Bleach! Dark is a very ancient word for human or origins of humans! The Dark Madonna is what she was actually called! Until the creation of the word Black… then she was always known as the Black Madonna! Black and Dark are related! White and Pale are also related… however pale people didn’t exist until Romans conquered Egypt in 30 BC… even if than it was more like 30 AD during the reign of Huns when entered and occupied Northern African until the Moors invasion began! Moor took back and entered Europe around 70 AD! Then Europe pushed with their Muslim invasion of North Africa, from Turkey! This was their first version of crusades and dealt with the Christian Arabs known as Muslims invaded the Middle Eastern people known as Islamic! Muslim invaded Islam just as they invaded Northern Africa and Middle East! Also this wasn’t done in ancient times… this all happened around 1300 AD! ",
            "date": "Answered August 20, 2020",
            "views": "72",
            "upvotes": " Answer requested by Ian Strachan"
        },
        {
            "author_info": {
                "name": "Tim Brennan",
                "href": "/profile/Tim-Brennan-7"
            },
            "answer_text": "from your link” Virtually nothing is known about Semerkhet's family. “ He may or may not be a usurper . He may have reigned as little as 8 years or as long as 72(doubtful) He lived 5000 years ago so the only thing we know for sure is he is dead lol. Lack of knowledge can lead to speculation that has little to do with what the facts really were . They are basing what they THINK they know often on fragments of inscriptions …, and those are limited . Who knows we may find more but Semerkhet' is right on the edge of historical oblivion which gives me a chance to post one of my favorite poems . It deals with the once all powerful king of kings ruler of a vast domain who built spectacular monuments to himself but is now forgotten. There are two versions of the poem one by Shelley is far and away the more famous , even used on breaking bad but who remembers Horace smith? He wrote a good version . Smith and Sheley were friends and the poems were written as a competition . So when we are talking about the march of time and eventual oblivion I think the “forgotten” version makes the point better IN Egypt’s sandy silence, all alone,Stands a gigantic Leg, which far off throwsThe only shadow that the Desert knows:—“I am great OZYMANDIAS,” saith the stone,“The King of Kings; this mighty City shows“The wonders of my hand.”— The City’s gone,—Nought but the Leg remaining to discloseThe site of this forgotten Babylon. We wonder,—and some Hunter may expressWonder like ours, when thro’ the wildernessWhere London stood, holding the Wolf in chase,He meets some fragment huge, and stops to guessWhat powerful but unrecorded raceOnce dwelt in that annihilated place.–  ",
            "date": "Answered August 20, 2020",
            "views": "135",
            "upvotes": "0"
        }
    ]
}