{
    "title": "Who can change the name of a state? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Michael Craven",
                "href": "/profile/Michael-Craven-14"
            },
            "answer_text": "Only eligible voters who are registered and actively participate in the electoral process of any given state. The State of Rhode Island and Providence Plantations is the official name for the smallest state in the union. It would be a long, and slow, but decisive process. One would need to understand how the state government gets things done. In Rhode Island, we have a system of government which resembles in many aspects, the federal system. We have a bicameral legislative branch. municipal, and state governments. RI And CT have no form of county government at all, having abolished them many years ago, and 8 of the 14 county governments were abolished in the last years of the twentieth century. Leaving but six counties intact. So in states that have that “extra” layer of government, it would be that much more difficult. Like bills and other such legal documents it would need a sponsor, It would be put on the ballot of what I assume, would be the next electoral year, a question to have a referendum question placed on the ballot of the next election, failing this would be a short-term kill, they may strategize and monetize, or manipulate or some such machination to start a committee for the renaming, etc… etc… RI was founded in 1635 by a troublemaker who thought religious freedom would be a great idea. And politics haven’t changed very much since then. Five or ten years ago someone tried to get us to change our name by dropping the “and Providence Plantations.” That proved ill-fated. Since before the abolitionist movement came to be, there were few, save the wealthiest who owned slaves. RI had our very own, less well-known stop on the underground railroad, it enacted the first law prohibiting slavery in North America on May 18, 1652… a Boston lawyer (nephew to Samuel Adams and John Adams, son John Quincey Adams successfully defended the crew (of slaves on the way to market who rose up and took control of the slave ship the Amistad, and so long as the state kept taxes to an affordable amount, there have been few dust-ups. It seems Roger, who truly was granted land use rights by Canonicus and his son Miantonomi, Roger meant it was a farming community, with hardly any resemblance to the antebellum South's plantations. So short answer, only legal citizens of the state can change the name of the said entity in any way that is deemed legal.. If you don’t register, you can’t vote. If you don’t want to vote, it’s an automatic vote for the least qualified candidate. SO all you out there who didn't vote for Bernie or Hillary.. you elected the “Trumpster” with your silence. And please, no more single issue votes… vote for the one you most agree with. And never ever give a politician you don’t know your vote. ",
            "date": "Answered October 26, 2018",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Phumla Nondala",
                    "user_href": "/profile/Phumla-Nondala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Anthony Pitera",
                "href": "/profile/Robert-Anthony-Pitera"
            },
            "answer_text": "This was answered already in Quora: How can a state in USA legally change its name? ",
            "date": "Answered October 18, 2018",
            "views": "32",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Craven",
                    "user_href": "/profile/Michael-Craven-14"
                }
            ]
        }
    ]
}