{
    "title": "Who would win in a war between United Kingdom and the United States? - Quora",
    "tags": [
        "Hypothetical War Battles",
        "British Army",
        "United States-United Kingdom Relations",
        "Military History of the United States of America",
        "United States Armed Forces",
        "Hypothetical Battles",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Elding",
                "href": "/profile/Craig-Elding-2"
            },
            "answer_text": "This is easy. Whilst the USA have by far the most powerful military, they have a terrible habit of assuming force is everything, and relying far too much on numbers/ firepower rather than tactics, which will lead to the following scenario. America will assume complete dominance, and so nukes won’t be used. They would rather a functioning large island of Europe that they can use as an unsinkable aircraft carrier later on. They will opt for a ‘boots on the ground’ approach. They launch a massive beach landing, one the likes of which have never been seen. There is no resistance, which is confusing for the USA. Never the less, the troops move inland. The nearest town is ony 30miles away according to the SATNAV. This is where American ignorance goes against them. 30miles in America takes 30 mins to cover in a car, tops. In the UK it is a different story. Many roads are only wide enough for a cart, at a push a car, but certainly not large military vehicles. Then, you find that the roads are extremely twisty, and hard to navigate. The landing force gets bogged down. Smaller units, and those on foot get through to the town, some vehicles get lost, and others have to take a longer route round, which is very long. There is serious problem now. The rough North Sea has cut off major supply routes, and confusing and narrow roads have slowed the attacking force. Men are told to secure the town on foot. There will be no armour support, and the surprise rain means no air support. A unit walk into town, and are completely taken by surprise. They did not know that Tuesday was Market Day in this town. There are old women EVERYWHERE. Despite being the toughest solders the USA has to offer, nothing prepares you for getting in the way of an old lady that has survived 2 world wars. These women don’t fight, or pay you any attention, but you will get a nasty clip around the ear if you get in their way, or are not polite. Confused, hungry, and unsure of what to do when faced with such an adversary, the young US marines fall back and seek shelter for the night. They find an old barn on a farm, and decide to settle there for the night. They are out of luck though. Just as they settle in, a little old lady appears - they can move quick despite looking so fragile! She is bringing the cows in for the night. She seems to be all to aware of the marines already being there, but pays them no attention until the cows settle. Wars come and go, but the cows need looking after all the time. After dealing with the cows, she turns to the marines, and promptly tells them off. They haven’t cooked a wholesome meal, and their uniforms are muddy (who knew you could have 4 seasons in 1 day in the UK? The marines only planned for summer!). After a good telling off, she offers them a bed in the farm house. These are big houses, with plenty of space, and they accept. They sleep well. Come the morning their uniforms are gone. They get up to find the old lady pottering around the house - do they ever sleep?? She tells them the uniforms are in the wash, and scolds them for not keeping them tidy on their first invasion. The points to some warm porridge on the farmhouse table, and tells them to eat, but not before getting into some of her late husbands clothes. As soon as they finish eating, she is handing them tools. Hammers, planks of wood, pitch forks and tells them to get to work. The farm needs some serious repairs since her husband passed! They were given no chance to argue, and reasoned that they couldn’t go invade without uniforms, and it would be a nice way to thank the lady for her kindness. They fall in line, and follow her orders, as trained. They work all day - it is hard. They meet her son in the late afternoon who takes them to the pub after their tea. They are exhausted, but enjoy a real pint for the first time in their life. Slowly they are absorbed into the community. The invasion failed. One of us… ",
            "date": "Updated May 31, 2018",
            "views": "865",
            "upvotes": " View 1.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vince Bearpark",
                    "user_href": "/profile/Vince-Bearpark"
                },
                {
                    "user_id": "Johann Von Staubig",
                    "user_href": "/profile/Johann-Von-Staubig"
                },
                {
                    "user_id": "J. R. Wilson",
                    "user_href": "/profile/J-R-Wilson-5"
                },
                {
                    "user_id": "Mark Turner",
                    "user_href": "/profile/Mark-Turner-18"
                },
                {
                    "user_id": "BILAL KASSIM",
                    "user_href": "/profile/BILAL-KASSIM-1"
                },
                {
                    "user_id": "Duane Wirdel",
                    "user_href": "/profile/Duane-Wirdel"
                },
                {
                    "user_id": "Christian Lucas",
                    "user_href": "/profile/Christian-Lucas-29"
                },
                {
                    "user_id": "Jimmy Brooks",
                    "user_href": "/profile/Jimmy-Brooks-40"
                },
                {
                    "user_id": "Sergio Almasy",
                    "user_href": "/profile/Sergio-Almasy"
                },
                {
                    "user_id": "Jonathan Wolff",
                    "user_href": "/profile/Jonathan-Wolff-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "H.L. Chastain",
                "href": "/profile/H-L-Chastain"
            },
            "answer_text": "The US wins. Look, I hate to break it to people but any question that asks “Who would win a war between the US and …” the answer is almost always the US. The US is a global superpower. A superpower is a nation that is beyond just a global power. A superpower is defined as roughly the following A country that has the capacity to project dominating power and influence anywhere in the world, and sometimes, in more than one region of the globe at a time, and so may plausibly attain the status of global hegemony. - Alice Lyman Miller There have only been a handful of superpowers throughout history because superpowers aren’t just among the most powerful, they are indisputably the most powerful. The US would beat the UK in a war. Arguing otherwise is ludicrous unless we are allowed to invent random incredibly unlikely circumstances. Here are the reasons why… Spending. The US spends $598 billion on defense, the UK spends $56.2 billion. I don’t need to debate this point any more.Quantity. The US has 1.4 million active personel while the UK has 150K. The US has a total aircraft number of 13,762 to the UK’s 876. The US military and its branches have the 1st, 2nd, and 3rd largest airforces in the world. The US has a total of 19 aircraft carriers while the UK has 2. The US has such a larger overall military that this comparison is simply unreal.Quality. The US has a world class conventional military, but so does the UK. Both the UK and the US have high quality military training and strategy. However, when we weigh the quality of each country along with the quantity of each country, the US far and way blows the UK out of the water.Softpower. Some Quorans argue that the UK has an advantage here. In reality, no one does. While the UK controls the Commonwealth, many Commonwealth nations are also NATO members, which the US controls. Both sit on the UN Security Council as well. However, this speaks to a larger point. The question is about who wins a fight between the US and the UK, not between the US and the UK+allies. Even if that were the question, there is not clear-cut answer to who has the advantage here. Many nations would likely avoid this conflict due to connections to both nations.Location. The UK has zero chance, I repeat, zero chance, to successfully invade the US. On neutral territory, the US is hands down the victor due to the combination of it’s size, presence, and quality. The only chance the UK has for victory is if the US invades the UK, and that is only a chance. Invading the UK, and island nation, would be absolute hell to accomplish, but if the US was determined enough, it absolutely could invade the UK.There is zero chance of this conflict happening however. The last time these two nations fought was during the War of 1812. Since then, the UK has both attained and lost it’s own superpower status. The US attained an arguable but well-supported superpower status after WWII, and is unarguably the superpower today. The US wins this war, as it does nearly every hypothetical war we throw at it. You may not like it, but we need to accept it. The US is a superpower and would hands down beat the UK in a military conflict. ",
            "date": "Answered April 26, 2017",
            "views": "61",
            "upvotes": " View 61 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Davis",
                    "user_href": "/profile/Christopher-Davis-737"
                },
                {
                    "user_id": "Justin Selfslaghs",
                    "user_href": "/profile/Justin-Selfslaghs"
                },
                {
                    "user_id": "Jay Greene",
                    "user_href": "/profile/Jay-Greene-35"
                },
                {
                    "user_id": "Adrien Dorcin",
                    "user_href": "/profile/Adrien-Dorcin"
                },
                {
                    "user_id": "Kane Williamson",
                    "user_href": "/profile/Kane-Williamson-61"
                },
                {
                    "user_id": "Abhishek Haris",
                    "user_href": "/profile/Abhishek-Haris-1"
                },
                {
                    "user_id": "Christian Lucas",
                    "user_href": "/profile/Christian-Lucas-29"
                },
                {
                    "user_id": "Timileyin Adebunmi",
                    "user_href": "/profile/Timileyin-Adebunmi"
                },
                {
                    "user_id": "Stuart DeQuincy",
                    "user_href": "/profile/Stuart-DeQuincy"
                },
                {
                    "user_id": "Albert Wolford",
                    "user_href": "/profile/Albert-Wolford-1"
                }
            ]
        }
    ]
}