{
    "title": "Who were the kings of France during the French Revolution? - Quora",
    "tags": [
        "Kings of France",
        "French Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sachidanand Das",
                "href": "/profile/Sachidanand-Das"
            },
            "answer_text": "Louis XVI (Period of reign: 10 May 1774 - 21 September 1792) was the only one king of France during the French Revolution (5 May 1789 - 9 November 1799) because monarchy was abolished from 21 September 1792 onwards and the next king of France was the first Emperor Napoleon Bonaparte in 1804. Louis XVI was beheaded by guillotine on the Place de la Revolution on Monday 21 January 1793. Before his execution, Louis delivered a short speech in which he pardoned those who were the cause of his death. His executioner was one Charles Henri Samson. A few words about French Revolution and the former King Louis VI. French Revolution is a landmark in mankind’s socio-political history because it brought in new ideas and principles as enshrined in the words Liberty, Equality and Fraternity which made permanent impact on the social fabric of France and many other countries across the globe. The revolution lasted for 10 years 6 months 4 days. It was a violent period of political turmoil. Some of the important outcomes of the Revolution were: —Replacement of absolute monarchy by a constitutional monarchy in France; —Establishment of a secular democratic republic that increasingly became authoritarian; —Dictatorship under Napoleon Bonaparte who brought many of revolution’s principles to areas he conquered; —Radical changes in society. Louis XVI (Full name: Louis Auguste de France) was born on 23 August 1754 and died on 21 January 1793. He was the last king of France before the fall of the monarchy during the revolution. He was stripped of all his titles and honours after his arrest on 13 August 1792 and imprisonment at the Tour du Temple. From 21 September 1792, he became known as Citioyen Louis Capet. ",
            "date": "Updated August 6, 2020",
            "views": "287",
            "upvotes": " Answer requested by Rishika Verma",
            "upvoters": [
                {
                    "user_id": "Pravin Vaity",
                    "user_href": "/profile/Pravin-Vaity-1"
                },
                {
                    "user_id": "Claudia Fiore",
                    "user_href": "/profile/Claudia-Fiore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nicholson",
                "href": "/profile/Eric-Nicholson-23"
            },
            "answer_text": "During the French revolution, the king of France was Louis XVI (23 August 1754 – 21 January 1793). Thanks to his particular moves, French people started to feel more agitated toward him and monarchy. His policy of not raising taxes and taking out international loans (someone of them were used for funding the American Revolution) caused French international debt. By the mid 1780’s, country was very close to bankruptcy which forced Louis XVI to enforce radical fiscal reforms which were not welcome with ordinary people.  Portrait of Louis XIV, king of France (23 August 1754 – 21 January 1793)[1] His reign was associated with the outbreak of the French Revolution and end of French empire. Footnotes[1] Image on wikimedia.org",
            "date": "Answered June 10, 2018",
            "views": "26",
            "upvotes": " View 2 Upvoters"
        }
    ]
}