{
    "title": "Who were the Bedouins? - Quora",
    "tags": [
        "Bedouins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Jacobson",
                "href": "/profile/Carl-Jacobson-2"
            },
            "answer_text": "The Bedouins are the descendants of the actual original Arab tribes from the Arabian Peninsula. Most of the people outside of Arabia, who are referred to as “Arabs”, are usually the descendants of the native people of their region, who have adopted Arabic identities, religion, language and culture over the centuries. The Bedouin follow the traditional Arab Bedouin lifestyle of nomadic herdsmen. In the past, they would also have been part of the caravan trade, transporting spices and incense from Yemen, through Arabia, up to the Levantine coast. And they would have been part of the Muslim pilgrim trade, ferrying pilgrims to Mecca for the Hajj. Or they would have been raiders and bandits, who would attack and rob the towns and the spice caravans and Muslim pilgrims. They would attack like lightning, seize booty and slaves and then disappear into the desert. It was the Bedouin tribes that made up the earliest fighting forces of the Islamic Caliphates. They were able to beat both the Byzantines and the Persians, and conquered territory from Spain to India. Now, most middle eastern Nations have been trying to get their native Bedouin populations to give up nomadic herding and settle in pre-constructed official townships, or restricted their nomadism to a specific area — and this is happening in Muslim Nations all across the middle east, not just Israel. ",
            "date": "Updated August 6, 2020",
            "views": "853",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yehuda Posnick",
                    "user_href": "/profile/Yehuda-Posnick"
                },
                {
                    "user_id": "Jennifer Louise Porter",
                    "user_href": "/profile/Jennifer-Louise-Porter-2"
                },
                {
                    "user_id": "James Maher",
                    "user_href": "/profile/James-Maher-104"
                },
                {
                    "user_id": "Tiger Jones",
                    "user_href": "/profile/Tiger-Jones-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Speakman",
                "href": "/profile/Ryan-Speakman-1"
            },
            "answer_text": "You ask this question in the past tense, as if the Bedouins no longer exist. They do, and they’re great people… :)  ",
            "date": "Answered March 12, 2018",
            "views": "383",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yehuda Posnick",
                    "user_href": "/profile/Yehuda-Posnick"
                },
                {
                    "user_id": "Jennifer Louise Porter",
                    "user_href": "/profile/Jennifer-Louise-Porter-2"
                },
                {
                    "user_id": "Mike Chopzz",
                    "user_href": "/profile/Mike-Chopzz"
                }
            ]
        }
    ]
}