{
    "title": "Who was the first person to open up the Silk Road? - Quora",
    "tags": [
        "FBI Shuts Down Silk Road (September 2013)",
        "First Person Pronouns ",
        "Silk Road (historical trade route)",
        "Silk Road (online market)",
        "Silk"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reina Stewart",
                "href": "/profile/Reina-Stewart-2"
            },
            "answer_text": "Zhang Qian was one of the first diplomats who brought back reliable information about the Western world to the Chinese imperial court. His missions opened up trade between the East and the West, and he has influenced the establishment of the silk road.  The nomadic horde, Xiongnu (匈奴), and the Han (汉) Chinese (mainland Chinese) continued to wage war for many centuries on the border of China. A capable Chinese emperor Wudi (武帝) ascended the throne in 140 BCE and decided to take the offensive move against Xiongnu. He wanted to find an ally among other nomadic tribes to fight against Xiongnu together. Therefore, he decided to send an envoy westward to meet another migratory tribe Yuezhi (月氏). Knowing that this could be a dangerous journey, no dignitary was willing to undertake the task of going into a region unknown to the Chinese. Only a lower-rank official named Zhang Qian answered the emperor’s call. Unfortunate for him, he was captured and detained by the Xiongnu imperial camp. The detainment lasted for ten years, during which period he moved with the Xiongnu on the steppe and married a Xiongnu woman. Nevertheless, Zhang Qian eventually managed to escape from Xiongnu, when the death of the Xiongnu Chief and the civil war that followed provided a good opportunity to escape. He returned to the court of Han China in the city of Chang’an with his Xiongnu wife and children. Though Zhang Qian’s original political mission was unsuccessful, the Chinese emperor was interested in his long journey to the ‘Western Regions’. Having stayed and traveled with the Xiongnu for more than a decade, Zhang Qian has become familiar with the exotic customs, foods, plants, and landscape of the Xiongnu. His reports of his journey opened the eyes of the emperor. Following Zhang Qian’s embassy and report, commercial relations between Han Chinese and Western Asia flourished. This initiated the development of the Silk Road. Gradually, by military force and by mutual understanding, the interests of both sides shift from warfare to trades. Meanwhile, Chinese rulers also started to realize the international value of silk textiles, which were so common at home that every household knows how to extract silk fiber from silkworm cocoons. Since most societies only knew how to make textiles from fur or plants, the idea of producing silk from worms seemed miraculous to them. Zhang Qian acted as an ambassador and introduced silk to western nomadic groups to maintain alliances.  ",
            "date": "Answered June 26, 2019",
            "views": "69",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgi Stojcev",
                    "user_href": "/profile/Georgi-Stojcev"
                },
                {
                    "user_id": "Sofjan Yang Mustopoh",
                    "user_href": "/profile/Sofjan-Yang-Mustopoh"
                },
                {
                    "user_id": "Ina O' Murchu",
                    "user_href": "/profile/Ina-O-Murchu"
                },
                {
                    "user_id": "Ty Yang",
                    "user_href": "/profile/Ty-Yang-9"
                },
                {
                    "user_id": "Richard Phillips",
                    "user_href": "/profile/Richard-Phillips-275"
                }
            ]
        },
        {
            "author_info": {
                "name": "Xiao Yang",
                "href": "/profile/Xiao-Yang-178"
            },
            "answer_text": " A group of wax figures at the Jiayuguan Great Wall Museum depicts Zhang Qian’s expedition to the Western Regions. Zhang Qian (164–113 BC), an outstanding envoy and explorer living in the Western Han Dynasty (206 BC–AD 24), was honoured a pioneer of the Silk Road. Zhang Qian had a pioneering and adventurous spirit as well as a strong and unyielding character. He was dispatched by the Han court to the Western Regions twice in 139 BC and 119 BC, respectively. For the first time, Zhang began the expedition with 99 members, with the mission to build an alliance with Rouzhi (Yuezhi), an ancient state in Amu Darya, to combat against the Huns, nomadic people in northern border. During the journey, he was captured by the Huns when reaching the Hexi Corridor and was detained there for 10 years. Eventually, he was able to escape. Wiki wrote that, “After his escape, Zhang Qian passed Lop Nor and followed the northern edge of the Tarim Basin, around the Kunlun Mountains and through small fortified areas in the middle of oases in what is now Xinjiang until they made their way to Dayuan and eventually to the land of the Rouzhi.” However, the Rouzhi people were satisfied with their life and refused to form an alliance. Though failed, Zhang obtained a great deal of knowledge about the people, geography, culture and customs of more than 30 states in the Western Regions. Zhang Qian set off on his second journey to the Western Regions, in order to ally with Uisin (in Ili Valley) against the Huns. This time, more than 300 people were along with Zhang. They arrived in Uisin smoothly and visited Dayuan (Ferghana), Rouzhi, Daxia, Anxi (Parthia, in now Iran), Sindhu (in India) and other countries. The King of Uisin was hospitable and friendly who put an interpreter and a guide at Zhang’s disposal. Because of Zhang Qian’s expeditions, the Han Dynasty was able to build good relationships with states of the Western Regions. Zhang spread the civilization of the central plains to the western region, and introduced the Ferghana horse, grape, alfalfa, pomegranate and flax to the central plains. Zhang opened up the ancient Silk Road and bringing reliable information about the Western Regions. Following Zhang’s expeditions, commercial relations between China and Central and Western Asia flourished, as many Chinese missions were sent throughout the end of the 2nd century BC and the 1st century BC, initiating the development of the Silk Road. In 60 BC, the Silk Road began to enter the era of prosperity; In AD 97, Ban Chao, general from the Eastern Han Dynasty (AD 25–220), carries large quantities of silk fabrics to reach the Persian Gulf and the Syrian province of Rome (today’s Antioch in Turkey). In 166 AD, the Roman Empire sent the first batch of special envoys arrived in the Han Dynasty. ",
            "date": "Answered April 11, 2019",
            "views": "564",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgi Stojcev",
                    "user_href": "/profile/Georgi-Stojcev"
                },
                {
                    "user_id": "Di Kai",
                    "user_href": "/profile/Di-Kai-1"
                },
                {
                    "user_id": "Anthony Powers",
                    "user_href": "/profile/Anthony-Powers-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tom-McGregor-6"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Andrew Huang",
                    "user_href": "/profile/Andrew-Huang-73"
                },
                {
                    "user_id": "Z edge Zheng",
                    "user_href": "/profile/Z-edge-Zheng"
                },
                {
                    "user_id": "Kt Close",
                    "user_href": "/profile/Kt-Close"
                },
                {
                    "user_id": "Chen Yankai",
                    "user_href": "/profile/Chen-Yankai"
                }
            ]
        }
    ]
}