{
    "title": "Who are the ancestors of Koreans? Are they a mix of Mongolians and Chinese? - Quora",
    "tags": [
        "Mongolian Ethnicity and People",
        "Ancestors",
        "Mongolia",
        "Korean Ethnicity and People",
        "South Korea",
        "Chinese Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Li Shu Yan",
                "href": "/profile/Li-Shu-Yan"
            },
            "answer_text": "Ancestors of Koreans are from East China before Han Chinese related people occupied the area 8,000 years ago. Are they related to Han Chinese? No. Korean and Japanese are genetically most similar. They share huge portion of Haplogroup O2b and mtDNA similarities. Haplogroup O2b is not found in Han Chinese. But eastern chinese are genetically similar to Korean and Japanese. Are they mixed with Mongolians? No. Genes specifically found in Mongolian like Haplogroup C3 is not found in Korean. But North Korean might have mixed with Manchurians. Are they mixed with Manhurians? No, but it is the other way round. Manchurian are mixture of Korean, Siberian Ugric and Mongolic DNA. Are all Northeast Asians related to Mongolians? Yes. More than half of their mtDNA is North Asian related shared with Mongolian. Another half is East Asian related. It is not just Korean share blood with Mongolians. Are Koreans more related to North Asians than other East Asians? Yes, they are slightly more related to North Asians than Northern Han Chinese. Japanese mixed with Jomon and Ainu who are another Paleo Siberian group. Is Korea language related to Mongolian or Chinese language? Because of close proximity, there might be language influence from Mongolian. Altaic language theory links them together. Chinese belongs to Sino Tibetan language family. It is completely different from Korean. But there is Sino Korean vocabulary borrowed from Chinese as loanwords. Are they mixed with Han Chinese? Yes. Korean and Japanese have Han Chinese related DNA component. Haplogroup O3 is found in Korean, Mongolian and surprisingly Kazakhs perhaps from Dungan people. Whether O3 is from Han Chinese is controversial. Y-DNA of East Asia  ",
            "date": "Answered May 14, 2020",
            "views": "22",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eric Lee",
                    "user_href": "/profile/Eric-Lee-406"
                },
                {
                    "user_id": "Hayley Yu",
                    "user_href": "/profile/Hayley-Yu-7"
                },
                {
                    "user_id": "Robert Dickinson",
                    "user_href": "/profile/Robert-Dickinson"
                },
                {
                    "user_id": "Jose Cruz",
                    "user_href": "/profile/Jose-Cruz-447"
                },
                {
                    "user_id": "Ken S. Park",
                    "user_href": "/profile/Ken-S-Park-1"
                },
                {
                    "user_id": "Vanessa Xie",
                    "user_href": "/profile/Vanessa-Xie-3"
                },
                {
                    "user_id": "Rashid Rahman",
                    "user_href": "/profile/Rashid-Rahman-32"
                },
                {
                    "user_id": "Sudesh Sunuwar",
                    "user_href": "/profile/Sudesh-Sunuwar-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neky Choe (Kim Jinwon)",
                "href": "/profile/Neky-Choe-Kim-Jinwon"
            },
            "answer_text": "Korean ancestors are at least three branches of tribes which are distinct from Chinese (Han Chinese) and Mongolians. Ye tribe (예족) and Maek tribe (맥족) are the top 2 tribes of ancestors of Koreans. They came from northern areas like Manchuria or near Mongolia. They’re thought to be subgroups of Buyeo or Fuyu people who lived in Manchuria in the ancient time. Another one is Han or Jin people (한인 or 진인) on the southern part of the Korean peninsula. They are considered the same or at least very close people of Yayoi who emerged in Japanese archipelago later after migration into there. However, specific features of them are not known unlike northern peoples. Ye and Maek became like one tribe as Yemaek (예맥) later, and they were the main group of people in northern part of the Korean peninsula and Manchuria. They later became main people of Goguryeo. As the got strong, they reached the southern part of the peninsula, and started building their own states so called “Samhan (Three Hans)” of Mahan, Jinhan, and Byeonhan. It is often believed that they ruled the naive Han people, and later, assimilated them. By doing so, they became what we call “Korean” with at least three major branches of tribes. Nowadays, North Korea puts an emphasis on their identity as Joseon from Yemaek, but South Korea emphasizes on their identity as Han people. We can see this in their national names. North Korea is “조선민주주의인민공화국” in the local official name that has “조선 (Joseon/Choson)”, that has its root with Yemaek people. On the other hand, South Korea is “대한민국” in the local official name that has the name “한 (Han)”. For your information, “Han Chinese (漢)” is not related with “Han (韓)” in the Korean peninsula at all. They’re just homonyms. 漢 of China has its identity as the main group of Chinese, but 韓 of Korea was used just to write the sound *xan that was spoken by the southern native on the peninsula. ",
            "date": "Answered May 14, 2020",
            "views": "451",
            "upvotes": " View 135 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Canice Hom",
                    "user_href": "/profile/Canice-Hom"
                },
                {
                    "user_id": "Angus-Michel M. Davis",
                    "user_href": "/profile/Angus-Michel-M-Davis"
                },
                {
                    "user_id": "Luke Chan",
                    "user_href": "/profile/Luke-Chan-29"
                },
                {
                    "user_id": "Kok Lee",
                    "user_href": "/profile/Kok-Lee-8"
                },
                {
                    "user_id": "Jerome Lee Buenviaje",
                    "user_href": "/profile/Jerome-Lee-Buenviaje"
                },
                {
                    "user_id": "Ömer Demircan",
                    "user_href": "/profile/Ömer-Demircan-1"
                },
                {
                    "user_id": "Chamindra Perera",
                    "user_href": "/profile/Chamindra-Perera"
                },
                {
                    "user_id": "DJ Wabe",
                    "user_href": "/profile/DJ-Wabe"
                },
                {
                    "user_id": "Amadeus Low",
                    "user_href": "/profile/Amadeus-Low"
                },
                {
                    "user_id": "Joseph Behringer",
                    "user_href": "/profile/Joseph-Behringer-1"
                }
            ]
        }
    ]
}