{
    "title": "Who really runs the world? - Quora",
    "tags": [
        "Conspiracy Theories",
        "Society",
        "Philosophy",
        "Government",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin E. Sjolund",
                "href": "/profile/Kevin-E-Sjolund"
            },
            "answer_text": "Yeah, it’s just a movie, but the description given by Rade Šerbedžija - Wikipedia, from his wheelchair is a reasonable summation. Edit: within an hour of posting this answer, the links were dropped from YouTube. I’ll see if I can find them elsewhere. We’ll have to use the script for now. It’ll be interesting to see what happens with this answer from here. Here’s the pertinent script for the scenes. You killed all three? There were four. I want Johnson's real name. I want to know who he works for. I want to know why it was worth going through that much effort to kill the Archbishop. Aren't you the one that shot him? And if I don't know any of those things? Then you're of no worth to me and I might as well shoot you now and leave. Johnson's had a lot of names. Don't know one's any more real than the next. Knowing would only be dangerous. He's ex-army. Pretty sure he was a full-bird colonel. Go on. They came for me, like they came for you. Recruitment for a single job. They like the wounded. Easier to use and then throw away when you are done. Timmons, you, me...Once you've been a wolf, it's hard to be staked down like a goat. This is just one dead man talking to another. And the Archbishop? You want to take all suspicions away when you shoot someone, wait till he's standing next to the President. What was he going to say? The truth. That nothing, no matter how horrible, ever really happens without the approval of the government. Over there, and here. The problem isn't the doing. It's the people in power having to admit that they knew. The prisoners are tortured at Abu Ghraib, and only the underlings go to jail. Their bosses knew. We know their bosses knew. But you don't say it. What exactly happened in Africa? Somehow the villagers didn't think that an oil pipeline was a good enough reason to move their village to a place where the spirit gods didn't exist. Drink? So they asked them all nicely to move and when they didn't, they just killed them all? No. They didn't ask. They just killed them. AII. So the next village won't need to be asked. They'll just go. There is a mass grave with 400 bodies, men, women, children, under the oil pumping station 10 kilometres over the Eritrean border. You should know. You covered the retreat of the contractors who did the job. Of course, you weren't supposed to survive that, either. Who runs Johnson? A senator. From Montana, I think. You don't get it. There is no head to cut off. It's a conglomerate. If one of them betrays the principles of the accrual of money and power, the others betray him. What it is is human weakness. You can't kill that with a gun. That is quoted from here. transcript from the screenplay and/or the Mark Wahlberg movie Shooter - Ranch Fight Scene (Part One | 1080p) Shooter - Ranch Fight Scene (Part Two | 1080p) Lots of chatter about “deep state”, Illuminati, unelected powers, and the like are basically talking about the corporate fascists that Rade described in the scene above. The Danny Glover - Wikipedia role was described by an actual soldier many years before the movie was ever conceived Smedley D. Butler Quotes (Author of War is a Racket). Glover was the equivalent gangster as well in the movie. Here’s some real life footage of an example comparable to the mass grave scenario that was central to the plot of the movie. YouTube BANNED - Project for New American Century (\"PNAC\") - 7 of 7 – Videoland Did you enjoy the henchmen as they giggled during their assignments? So, it is highly doubtful that any single individual or small group, relatively speaking, controls the world, but once someone reaches a level of power ( money) This Chart Shows The Bilderberg Group's Connection To Everything In The World, to maintain your status within the uppity fuckhead( I apologize, did I say that out loud?) club of fascists, neoconservatives, Zionists, etc, best you don’t betray the fuckheads code of ethics ( money morals that is), essentially outing their fundamental uselessness. At this stage of the game, I don’t know why they even care if we know the truth about them, but I reckon the fuckheads have trouble breaking from the script. Dedication to the craft I suppose. Money = power = control is the answer to the question asked. The exact dynamics are available only to the insiders. At best, us peons can only imagine what being attacked by a giant sea creature would be like as a frame of reference. The Octopus: Secret Government and the Death of Danny Casolaro As far as “it’s only a movie” regarding the validity of this answer, well, Le Voyage Dans la Lun (A Trip to the Moon) by Georges Méliès (1902), art is a reflection of life, or something like that. It might serve the naysayers best to instead eat Octopus as food - Wikipedia before being eaten. ",
            "date": "Updated January 10, 2018",
            "views": "45",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clayton Rodriguez",
                    "user_href": "/profile/Clayton-Rodriguez"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Axl-Bender-2"
                },
                {
                    "user_id": "Bruno Oliveira",
                    "user_href": "/profile/Bruno-Oliveira-205"
                },
                {
                    "user_id": "Bonnie Hamby",
                    "user_href": "/profile/Bonnie-Hamby-3"
                },
                {
                    "user_id": "Timothy Dyer",
                    "user_href": "/profile/Timothy-Dyer-8"
                },
                {
                    "user_id": "Daz",
                    "user_href": "/profile/Daz-60"
                },
                {
                    "user_id": "Robert Herrschaft",
                    "user_href": "/profile/Robert-Herrschaft"
                },
                {
                    "user_id": "Brighton Jaimeson",
                    "user_href": "/profile/Brighton-Jaimeson"
                },
                {
                    "user_id": "Oday A Odeh",
                    "user_href": "/profile/Oday-A-Odeh"
                },
                {
                    "user_id": "Khalid S Multani",
                    "user_href": "/profile/Khalid-S-Multani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Monaco",
                "href": "/profile/Anthony-Monaco-21"
            },
            "answer_text": "I liked the answer to The Top 10 Richest. Seen York background and professer answer this .Have a question for him that can answer this question and debate and debunk some who have answered this.This particular subject interests me since I was a young lad growing up in Brooklyn, NY. Just a few searches would pull up an agenda and link between 4 Horseman of Banking and Oil as well. We can throw this mass hysteria now to these peoples associations to the 3rd Reich and earlier to now obviously. Vatican, UK Mao Zedong run..I think you catch my drift. From Soros, Turner, Iger, Gates and Pirbright and all their ties here to UK to China even. Do you think The Rothschilds and Rockefellers to Epstein and Murdoch and the The House of Windsor are linked to the Jesuits bloodline and eugenics all thrown in the same pot..Names I mentioned have coincidencently talked about population control. How about the ties to Geneva and the banking and tech industry magnates As well as the neutral stance and my US armed forces looking like a private military doing the dirty work for them and their \"special interests \".The young children joining not seeing all of this and being collateral damage..I salute all you if any happen to see this eventually. So my question to you is do you think those individuals and the rest of \"The Good Club\" are capable the horrible things going on now? Not a tin foil hat wearer but also not blind to it all.. Sources I've looked were the publications of some of those mentioned owned companies. Links included. ",
            "date": "Answered March 28, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Swastik Sengupta",
                    "user_href": "/profile/Swastik-Sengupta"
                }
            ]
        }
    ]
}