{
    "title": "Who was the better Mongol leader, Genghis Khan or Kublai Khan? - Quora",
    "tags": [
        "History of Asia",
        "Genghis Khan",
        "Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Tauro",
                "href": "/profile/Anthony-Tauro"
            },
            "answer_text": "Genghis Khan started with a bunch of tribal confederacies and built an empire that would go on to become the largest contiguous land empire in history. It grew to its peak well after his death, but its success in the decades after his death could be attributed to the policies he put into place himself. For all his greatness, maintaining Mongol unity was not one of Kublai's strengths. In fact he started a civil war to get the position of the Great Khan. Soon after he allowed Berke Khan and Hulagu Khan to go to war with each other. The Berke-Hulagu war permanently halted the growth of the Mongol empire, outside of China. It led to the breakup of the empire into Khanates hostile to each other, and a long process of their dissolution. So in a way, Kublai took one of the greatest empires in history and oversaw it starting to descend into chaos. Ultimately though, Kublai was probably more successful as an emperor of China, than the Mongol Great Khan, a position in which Genghis had no peers. ",
            "date": "Answered November 26, 2013",
            "views": "123",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaryavarta Dhungel",
                    "user_href": "/profile/Aaryavarta-Dhungel"
                },
                {
                    "user_id": "Oran Minsson",
                    "user_href": "/profile/Oran-Minsson"
                },
                {
                    "user_id": "Ruby Tsao",
                    "user_href": "/profile/Ruby-Tsao"
                },
                {
                    "user_id": "Jerome Wei Liang",
                    "user_href": "/profile/Jerome-Wei-Liang"
                },
                {
                    "user_id": "David Frigault",
                    "user_href": "/profile/David-Frigault"
                },
                {
                    "user_id": "Victoria Sieradzki",
                    "user_href": "/profile/Victoria-Sieradzki"
                },
                {
                    "user_id": "Shadab Khan",
                    "user_href": "/profile/Shadab-Khan-131"
                },
                {
                    "user_id": "Terry Andrew Booth",
                    "user_href": "/profile/Terry-Andrew-Booth"
                },
                {
                    "user_id": "Timothy Davis",
                    "user_href": "/profile/Timothy-Davis-282"
                },
                {
                    "user_id": "Muller Dorceus",
                    "user_href": "/profile/Muller-Dorceus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Roese",
                "href": "/profile/Paul-Roese-1"
            },
            "answer_text": "in the long run neither. both set up the typical strongman/war lord type of state which are always unstable. The overwhelming impression one gets of the horse nomad empires is their ephemeral, here today, gone tomorrow quality. Timephased maps of old Eurasia show steady-state situations at the Roman-Byzantine western end and the Chinese eastern end. But they show a churning whirlpool in the steppes between. Kublai tried to bring some stability to the Mongol rule but the Mongols weren’t having it and eventually the Chinese weren’t having them. at the end of the day if the question is:“ were the Mongols better off at the end of their “Empire” as at the beginning of it?” the answer would be NO! between China, Russia and the Ottomans they were nearly destroyed. China not only crushed them but annexed the best lands leaving the Mongols only mountains, steppe and the Gobi desert. the Majority of Mongols live in China as a minority. then there is still the fallout from the various war crimes Genghis Khan and his successors committed. Anti-Mongolian sentiment has been prevalent throughout history, often perceiving the Mongols to be a barbaric and uncivilized people. Descendants of Genghis Khan fight for survival in Afghanistan and Pakistan ",
            "date": "Answered February 24, 2017",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Goss",
                    "user_href": "/profile/Joshua-Goss"
                },
                {
                    "user_id": "Peter Banh",
                    "user_href": "/profile/Peter-Banh"
                }
            ]
        }
    ]
}