{
    "title": "Who is the best living prime minister in the World? - Quora",
    "tags": [
        "Prime Ministers",
        "Prime Minister of India",
        "Politicians and Government Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajesh Sathya",
                "href": "/profile/Rajesh-Sathya-2"
            },
            "answer_text": "Man Mohan Singh. He is living a Best life even now. So Best living Prime minister. He never contested a Election and ruled for Ten years. Modi is now questioned by millions of people and he is accused of answerable to all Questions asked against him . Even for Sridevi death he is pulled! But Man Mohan Singh was answerable to only one person! His boss! And no one asked him any questions. Even his Minister Raja certified that he is not answerable to the PM for any clearance. Raja also had his own boss like the Ex-PM and he is also not answerable to anyone else! You may ask what our question specialists and media people were doing ? They were asking lots and lots of questions, not to the Prime Minister of India, they were asking all the Questions to Gujarat Chief Minister then for Indian affairs! The Gujarat Chief minister at that time was Bombarded like anything with Questions! Entire India was watching Gujarat only with Eagle’s eye and Searched for Mishaps! But other states were Bleeding, but Entire Indian Media’s focus was only on Gujarat! They totally forgot there is a PM sitting silently in Delhi. So life became so easy for the Prime minister and with all the problems he had a Best life like a Relaxed person! Now no one is asking anything to the Present Gujarat Chief Minister. In fact many people don’t even know who is the Gujarat Chief minister now in 2018! But the importance Gujarat enjoyed before 2013 is terrific! I don’t know who made Gujarat so famous in India! One more fun is people in Tamilnadu were asking Questions to the Gujarat Chief Minister in 2010, instead of the asking Prime minister of India, for some of their problems! They accused the Tamilnadu Chief minister respects the Gujarat Chief minister more than the Prime minister! She is not even giving any respect for the Indian PM! Some people in Tamilnadu were really worried about the Indian Prime minister’s respect at that time! Articles on Modi an INJUSTICE to Gujarat, India: Congress  “This is small sample of Headlines during our best Living Prime minister Tenure” The Prime minister at that time banned Jallikattu, bought Methane project with DMK, spoke in Hindi with Total freedom, Maintained absolute pin drop silence on Cauvery issue and even farmers committed suicide, Bhopal gas victims were protesting in Delhi, But Media do not even know that some people are suffering and shouting in Delhi. The total Media was Obsessed with the activities of the Gujarat Chief Minister and one more Minister of Gujarat. They were chanting their names like mantra! Our PM at that time enjoyed the Great Indian Media Tamasha! Indian Media headlines from 2004 to 2013 is a Testimony for Gujarat Development. All the papers carry the Headlines what Gujarat Chief minister said today or done today. No one bothered about their problems and even if a disaster occurred they never questioned the Indian Prime minister.  Rahul Gandhi trashes ordinance, shames government - Times of India ►  He never took anything Seriously to his mind! He never bothered about anything. He lived a Best life as a Prime minister in a Calm way even in a noisy Parliament!  He slept and his entire cabinet Slept with him! (Hey no, Hello ..not in that meaning as you think! ) in parliament i mean! Sweet Dreams in Parliament! Can you Sleep in your office ? Even in Home at day time ? There will be someone to wake you or disturb your Good sleep! But they are lucky! That is why i mean Best life!  So he is the Best living Prime minister. Happy life as Prime minister. Happy Retired life as Former Prime minister. So best living Prime minister in the whole world! ",
            "date": "Answered April 7, 2018",
            "views": "43",
            "upvotes": " View 715 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Yadav",
                    "user_href": "/profile/Aditya-Yadav-1058"
                },
                {
                    "user_id": "Bhupendra Nagarkar",
                    "user_href": "/profile/Bhupendra-Nagarkar"
                },
                {
                    "user_id": "George Crasta",
                    "user_href": "/profile/George-Crasta"
                },
                {
                    "user_id": "Jaspreet Kumar",
                    "user_href": "/profile/Jaspreet-Kumar-6"
                },
                {
                    "user_id": "Aditya Kumar",
                    "user_href": "/profile/Aditya-Kumar-8231"
                },
                {
                    "user_id": "Vipul Singh",
                    "user_href": "/profile/Vipul-Singh-118"
                },
                {
                    "user_id": "Subramani Muthu",
                    "user_href": "/profile/Subramani-Muthu-3"
                },
                {
                    "user_id": "Kailash Nath",
                    "user_href": "/profile/Kailash-Nath-65"
                },
                {
                    "user_id": "Shanto Anto",
                    "user_href": "/profile/Shanto-Anto"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-A-689"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amandeep Karn",
                "href": "/profile/Amandeep-Karn"
            },
            "answer_text": "Many people will not like it that I am not taking Narendra Modi’s name here. But, I think Canadian Prime minister Justin Trudeau is best PM alive.  He is cool charming, handsome , witty moreover he is acceptable to people from all backgrounds regardless of their social , political or economic status. He recognizes everyone's contribution towards the development of the nation. He connects with public very well . He respects all cultural belief and time and again have proved it. He is a progressive leader. In a time when most nations have leadership which support ultra- aggressive nationalism, he is torch bearer of global harmony. He's combating climate change and promoting clean energy practices — 81% of Canada's electricity is already provided by hydroelectric, solar, wind, and nuclear power. He signed the Paris Agreement in 2016. When he was sworn is as the 23rd prime minister, he established a diverse cabinet with an equal number of men and women. When asked to explain why, he said, \"Because it's 2015.\" He has repeatedly called himself a feminist. \"If you’re a progressive, you really should be a feminist because it’s about equality. It’s about respect. It’s about making the best of the world that we have,” he said. He's fighting to reduce childhood poverty. Trudeau is a progressive leader and isn't afraid of immigration. More than 28,000 Syrian refugees have been welcomed to Canada since November 2015. Recently when POTUS Donald Trump changed internal policies regarding immigrants , he welcomed them with open arm. He doesn't just speak; he acts. Trudeau went to the airport to personally greet refugees arriving in December 2015 and gave them winter coats. He is a family man. He and his wife have 3 children together. Given all the above qualities there is no harm in saying Justin is best PM alive. ",
            "date": "Answered March 6, 2017",
            "views": "62",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshay Shekhawat",
                    "user_href": "/profile/Akshay-Shekhawat-9"
                },
                {
                    "user_id": "Vipin Mishra",
                    "user_href": "/profile/Vipin-Mishra-51"
                },
                {
                    "user_id": "Kulsum Shaikh",
                    "user_href": "/profile/Kulsum-Shaikh-13"
                },
                {
                    "user_id": "Khurram Hussain",
                    "user_href": "/profile/Khurram-Hussain-28"
                },
                {
                    "user_id": "Suhail Ayub",
                    "user_href": "/profile/Suhail-Ayub"
                },
                {
                    "user_id": "Sagar Singh",
                    "user_href": "/profile/Sagar-Singh-401"
                },
                {
                    "user_id": "Mary Bently",
                    "user_href": "/profile/Mary-Bently"
                },
                {
                    "user_id": "Ruqayya Khan",
                    "user_href": "/profile/Ruqayya-Khan-5"
                },
                {
                    "user_id": "Gowtham KK",
                    "user_href": "/profile/Gowtham-KK-1"
                },
                {
                    "user_id": "ABHINAV BARUAH",
                    "user_href": "/profile/ABHINAV-BARUAH-5"
                }
            ]
        }
    ]
}