{
    "title": "Who is more charismatic, Joe Biden or Obama? - Quora",
    "tags": [
        "Joe Biden Possible 2016 Presidential Campaign (2015)",
        "Charisma",
        "Joe Biden (politician)",
        "Barack Obama (politician)",
        "Democratic Party (US politics)",
        "Politicians and Government Leaders",
        "Presidents of the United States of America",
        "Character and Personality",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-247"
            },
            "answer_text": "Certainly Obama has much more charisma. Joe Biden might be liked by many, but he is rarely loved, since he clearly does not have much charisma. And that is a disadvantage to him, in this presidential race. Trump has a lot more charisma. He is loved by many Republicans. But Trump is also extremely divisive, so as a result many Americans can’t stand him, and hope very much that he won’t be reelected. Hillary Clinton did not really have any charisma, unlike her husband, who had lots of charisma. So that was surely part of the reason why Hillary lost in the electoral college. More voters did vote for her than for Trump, but she lost in important swing states, and so she lost in the electoral college. And under our constitution, the electoral college decides who wins the presidency. ",
            "date": "Answered October 18, 2020",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Brite",
                "href": "/profile/George-Brite"
            },
            "answer_text": "My Maine Coon is more charismatic and likable than either of them. But, given the limited choices, Obama would be the winner. In fact, Obama could sell ice cubes to Eskimos. He has the inate ability to tell large masses of people to go to hell in such a way that they look forward to the trip there. Used car salesmen everywhere worship Obama. Biden lost his charisma in the '80's after his brain aneurysm. That's when the gaffs started. The 2 recent subsequent strokes pretty much did him in. Poor Joe doesn't even know where he is half the time. Putting Biden up for president is the most despicable thing I've seen the DNC do in a long time. They will remove him from office shortly after the election and instate Harris as president. Poor Joe. I feel so sorry for him. ",
            "date": "Answered October 18, 2020",
            "views": "207",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacque Balzac",
                    "user_href": "/profile/Jacque-Balzac"
                }
            ]
        }
    ]
}