{
    "title": "Who inhabited Canaan first: the Phoenicians or the Jews? - Quora",
    "tags": [
        "Classical Era (history)",
        "Canaan",
        "AP World History",
        "Phoenicia",
        "History (college major)",
        "History of the Middle East",
        "Jewish Ethnicities and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dick Harfield",
                "href": "/profile/Dick-Harfield"
            },
            "answer_text": "The entire Levantine coast was occupied by people now known as North-Western Semites during the Bronze Age. One group of North-Western Semites, the Phoenicians occupied the northern part of the coast and continued to do so: modern Lebanese people are their descendants. Another group of North-Western Semites, the Canaanites occupied the entire coastal region south of the Phoenicians until around 1250 BCE, when a sea people known as the Philistines invaded and occupied the southern part of their territory. Conquered in turn by sea people, Phoenicians, Assyrians, Babylonians and Greeks, the Canaanites continued to occupy the territory north of present-day Tel Aviv down to Roman times. The Canaanite hinterland was sparsely populated except in times of crisis, when cities were built and subsequently abandoned. Archaeologists have identified the Israelites as rural Canaanites who left the region of the rich coastal cities in the thirteenth century BCE and began to occupy the hill country of the hinterland. Evidence shows that they spread gradually southwards along the cisJordan highlands from the region of the Jezreel Valley and eventually reached the region of Judah, which we now know as the land of the Jews. As a separate ethnic group, the Jews were latecomers and really only occupied an inland enclave west of the Dead Sea. ",
            "date": "Answered May 11, 2019",
            "views": "500",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Thorsted",
                    "user_href": "/profile/Jan-Thorsted"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Richard Anthony Scales",
                    "user_href": "/profile/Richard-Anthony-Scales"
                },
                {
                    "user_id": "Michael Hill",
                    "user_href": "/profile/Michael-Hill-555"
                },
                {
                    "user_id": "Cole Cornelius",
                    "user_href": "/profile/Cole-Cornelius"
                },
                {
                    "user_id": "Shaun de Waal",
                    "user_href": "/profile/Shaun-de-Waal"
                },
                {
                    "user_id": "Joe Veon",
                    "user_href": "/profile/Joe-Veon"
                },
                {
                    "user_id": "Jim Moore",
                    "user_href": "/profile/Jim-Moore-211"
                },
                {
                    "user_id": "Peter Bartley",
                    "user_href": "/profile/Peter-Bartley-3"
                },
                {
                    "user_id": "Gerald Rhodes",
                    "user_href": "/profile/Gerald-Rhodes-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saverio Sciacca",
                "href": "/profile/Saverio-Sciacca"
            },
            "answer_text": "The advanced sedentary Canaanites go back to c. 3000BC ruling in Canaanite Peleset territory under the Egyptians. The territory would be renamed Palestine under Macedonian rule in 332BC, also renamed in Syria Palestina in 63BC under Roman rule. The Phoenicians migrate in afterwards from the Aegean Sea. They would drop their tongue for Canaanite, but they would also create the first alphabet of consonants in 1050BC. They adopt the Canaanite version of anthropomorphic theism that they adopted from the Sumerians in 2315BC. Those who would be called the 12 tribes don’t come into existence till the biblical accounts of a Sumerian Abram, who was conscripted by a Canaanite Elohe God Yahweh, YHWH in c. 1800BC to leave Mesopotamia for Canaan, Peleset along with his Sumerian wife Sarai. Their first Son Isaac with an Hebraic name would be born in c. 1712BC, his Son Jacob/Israel born c. 1650BC, his 12 Sons thereafter by 1550BC. Hebrew would come, as a dialect of Canaanite with Isaac. They would remain nomadic till Chief David settles into their first Canaanite village in Hebron in 1018BC.From 1800BC to 1018BC, they played no role or left any carbon in Peleset. The 12 tribes would also worship the Canaanite version of religion till 456BC, whereas the Judaic version appears breaking away from the Canaanite officially nunder Canaanite Priest Ezra in Jerusalem. Shalom, saverio. Edit: Greetings BNBK Committee, I take issue & offense that Palestinian Ms.Rima Najjar has been expelled for expressing her views as Free Speech. I also support Ms Benay Blend fr supporting her. PS The social views of BNBK cannot take precedence over Free Speech. Shalom, saverio. ",
            "date": "Answered May 11, 2019",
            "views": "48",
            "upvotes": " Answer requested by Linus Bao"
        }
    ]
}