{
    "title": "Who's responsible for the most deaths? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Syed Shuaibmohammed",
                "href": "/profile/Syed-Shuaibmohammed"
            },
            "answer_text": "Genghis khan(temujin) and his mongol warriors without doubt, he was responsible for killing lakhs of people who revolted against him and he pillaged cities to the ground if the native king did not accept the khans supremacy, there is a fact that one in 200 people all across the world share their descendance with the great khan It's impossible to know the precise number of deaths. However, their bloody pursuit of world domination killed as many as 40 million people or 10% of the earth's population at that time, making them responsible for the largest massacre to ever take place. Khan revolutionized warfare and rule of law. He rewarded loyalty regardless of social status, distributed the spoils of war throughout his ranks and banned infighting within the empire. They terrorized many powerful empires at the time and brought nothing but destruction, loot, and horror to the people they deemed as enemies. The best example of the brutality is attack of baghdad And conquest of eastern europe (seige of caffa(crimea))by the golden hordes, Lets come down to both the instances one at a time, Seige of baghdad 1258  At one point of time the islamic empire was invincible, this used to be quite a modern soceity in terms of arts literature and science The Siege of Baghdad, which lasted from January 29 until February 10, 1258, entailed the investment, capture, and sack of Baghdad, the capital of the Abbasid Caliphate, by Ilkhanate Mongol forces and allied troops. The Mongols were under the command of Hulagu Khan (or Hulegu Khan), brother of the khagan Möngke Khan, who had intended to further extend his rule into Mesopotamia but not to directly overthrow the Caliphate. Möngke, however, had instructed Hulagu to attack Baghdad if the Caliph Al-Musta'sim refused Mongol demands for his continued submission to the khagan and the payment of tribute in the form of military support for Mongol forces in Iran. Abbasids had failed to prepare for the invasion, the Caliph believed that Baghdad could not fall to invading forces and refused to surrender. Hulagu subsequently besieged the city, which surrendered after 12 days. During the next week, the Mongols sacked Baghdad, committing numerous atrocities and destroying the Abbasids' vast libraries, including the house of wisdom which was considered to be one of the greatest libraries in the islamic world at that period,the books were thrown into the river and the river ran black due to the ink for several days, the population of the entire city was completely depleted,and the caliph al muttasim was wrapped in a carpet and the mongol horses were then left to run over him, this ended the golden age of islamic empire and the arrogance of al mutasim thinking they were invincible. Seige of kaffa  It is believed that the devastating pandemic the Black Death entered Europe for the first time via Kaffa in 1347, through the movements of the Golden Horde.After a protracted siege during which the Mongol army under Janibeg was reportedly withering from the disease, they catapulted the infected corpses over the city walls and waited for the city to be infected due to the decomposing corpses , when the city fell with no inhabitants they used to take it over and start their adminstration, and the best part about such warfare was there were no casualties on the Mongol side, in one of the first cases of biological warfare. Fleeing inhabitants may have carried the disease back to Italy, causing its spread across Europe and causing the epidemic to have nearly wiped out 30–40% population of europe. ",
            "date": "Answered November 5, 2018",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "Jon Bryce",
                    "user_href": "/profile/Jon-Bryce"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Bailey",
                "href": "/profile/Greg-Bailey-28"
            },
            "answer_text": "As with so many things in science, no one is sure of the mortality of ancient humans, at least to a certainty. It was popular in science to advance the proposition that the volcano Toba in Indonesia was responsible for the near-extinction of all humans, but of course, science continues on. Newer research on Toba ash levels in a lake in Africa fails to support the afore-described events and further, that the near extinction in Africa about the same time of 70,000 years ago is that the extinction event and Toba were just a coincidence. Further speculation is that disease, famine, drought were responsible…who knows? Science will continue to work on this issue and try and confirm or deny the DNA study that indicated the near extinction of humans so long ago. ",
            "date": "Answered December 4, 2019",
            "views": "467",
            "upvotes": "0"
        }
    ]
}