{
    "title": "Why did the Huns invade the Angles, Franks, Saxons, and Rulians? - Quora",
    "tags": [
        "Anglo",
        "Franks (people)",
        "Saxons (Tribe)",
        "Huns"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Carr",
                "href": "/profile/Karen-Carr-9"
            },
            "answer_text": "I suppose mainly because they could. New developments in riding and weapons, like stirrups and the recurved bow, made it pretty easy for Central Asian armies to defeat European, West Asian, and East Asian armies, and they took advantage of it to expand southward. The Huns were only the first wave of a larger Mongol-Turkic expansion that eventually brought us the Mongol Empire and then the Ottoman Empire, and encouraged Europeans to look west and south rather than east for new opportunities, leading them to sail to Africa and to the Americas. ",
            "date": "Answered April 27, 2017",
            "views": "365",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luke Lee",
                    "user_href": "/profile/Luke-Lee-34"
                },
                {
                    "user_id": "Geoffrey Richard Driscoll-Tobin",
                    "user_href": "/profile/Geoffrey-Richard-Driscoll-Tobin"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lars Eidevall",
                "href": "/profile/Lars-Eidevall"
            },
            "answer_text": "They did not. The Anglo-Saxon chronicle writes around 449AD that the Romans were busy fighting the Huns and could not help the British against the Picts, so the Angles instead sent their lords Hengist and Horsa to help, followed by Saxons and Jutes. In 451, the Huns were defeated by Franks in alliance with Saxons, when they tried to conquer Gaul and did not make it to Paris and Orleans (Some Franks may have fought along the Huns as well). So they did not invade these lands. After that they focused on Italy, Attila died, and they were defeated also in their stronghold by Danube, where the Rugians were Hunnic allies by Austria. Who are Rulians? Thuringians took Hunnic wives or slaves arund this time, and they lived North of the Rugii and East of the Franks and Alemanni in 467AD:  ",
            "date": "Answered November 26, 2019",
            "views": "94",
            "upvotes": "0"
        }
    ]
}