{
    "title": "Why did the Nazis hate Jews so much? Was it because of Hitler, or was it already in them? - Quora",
    "tags": [
        "People Associated With Nazi Germany",
        "The Holocaust",
        "Nazism",
        "Adolf Hitler",
        "Nazi Germany",
        "Judaism",
        "Jewish Ethnicities and People",
        "Hate",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Candice Smith",
                "href": "/profile/Candice-Smith-304"
            },
            "answer_text": "Based on accounts of many historians I’ve read. I highly suggest this book. Final Solution: The Fate of the Jews 1933-1949 eBook Germans were taught to hate. This is interesting, because prior to Hitler and the Nazis coming to power and establishing their stronghold by taking full control of the media, the halls of the Academia and infiltrating every other aspect of German society, Germany was viewed by comparison to other European nations as the more tolerant, open minded and very liberal.  People from other European nations including the United States, flocked to multicultural meccas like Berlin in the 1920s, to escape the persecution in their respective countries. Polish Jews fled from Poland to Germany at around the same time for this very reason, to escape the wide spread anti-Semitism of their Polish neighbors. Many returned to Germany in 1946, once Germany became it’s democratic self again. Humans are not born to hate, they are taught to hate. Hatred is learned. Germans were not born to hate, they were taught to hate through sheer amount of daily propaganda and through the Nazi govt issued, official policies and decrees which separated the “undesirables” from the general population. “only for Jews”  “only for Aryans”  The Nazi politicians dehumanized those they considered “inferior” this made them easy to depersonalize and easy to kill. After witnessing the nationwide, improvised, state unsanctioned pogrom of Jews aka Kristallnacht (nigh of broken glass), more Germans became sympathetic to the plight of Jews in Germany. The level of brutality unleashed by the drunken and unruly SA thugs, the Hitler Jugend and the SS (in civilian clothes) against the Jew in Germany, rattled the power of Nazi dictatorship.  The general public became very concerned with the unlawful and disorderly conduct. They demanded for those responsible to be punished.  The Nazi officials were not able to find justification for the murder of at least 90 elderly Jews and the rape of young girls, some as young as 9 years old, who were raped and savagely beaten by the drunken SA thugs.  They broke down doors and shot, murdered, tortured, looted and raped at will.  The level of drunken rage, described by some of the eye witnesses and onlookers as exhibition of “superhuman strength”  The SA thugs built like the brick house, fueled by drunken rage against the Jew, lifted up elderly Jews together with their wheel chairs and thrown them off balconies.  Some of the SA thugs and SS men (in civilian clothing dragged several Jewish women into the basement and made them dance naked around the table. The sign on woman reads “I am a pig for sleeping with a Jew”  One woman who refused to join the action, was tied naked to a table, while other women were forced to spit on her. Nazis called the Jew “Uberschweinehund” (pig mixed with dog)   The Hitler Jugend with the support of the SA branch dragged several Jewish rabbis to their Jewish temple and made them dance around the Jewish temple, while it was burned to the ground., while they stood around and laughed at the Jew. This was entertainment.  The Jew is forced to scrub the side walk.  Women were assaulted and molested in their homes.  SA thugs broke inside the home and clubbed an elderly Jewish woman to death after she tried to protect her husband from assault.  Woman shamed for “rassenschande” (race defilement)  Germans took special pleasure in cutting off the Jew beard for some reason.  The SA thugs looted the homes of wealthy Jews, every break in was followed by rape or other form of assault, torture and abuse. The German policeman in the photo seems to have taken special interest in the Jew’s beard.  Humiliation of the “Ost Juden” (east Jew)  There is more, this is just a small taste. (google it)  The barbarity level unleashed during Kristallnacht is described by historians, as something not seen in any European society since the dark medieval ages. This was seen as rather counterproductive by the Nazi govt. The unsanctioned, disorderly pogrom of Jews, infuriated Hitler and the Nazi leadership. Himmler, Heydrich and Eichmann, who were neither aware of, nor did they sanction these pogroms, became very annoyed with the responsible party.  The after effect of the Jew pogrom in 1938, taught Hitler and the Nazi leadership a valuable lesson. Never again would they allow any form of violence against the Jew to take place on German soil.  ",
            "date": "Answered August 5, 2020",
            "views": "16",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anil Kumar Koundal",
                    "user_href": "/profile/Anil-Kumar-Koundal"
                },
                {
                    "user_id": "Carlos Feder",
                    "user_href": "/profile/Carlos-Feder"
                },
                {
                    "user_id": "Oded Ben-Josef",
                    "user_href": "/profile/Oded-Ben-Josef"
                },
                {
                    "user_id": "Tamara Mitrofanova",
                    "user_href": "/profile/Tamara-Mitrofanova"
                },
                {
                    "user_id": "Anamaria Borlan",
                    "user_href": "/profile/Anamaria-Borlan"
                },
                {
                    "user_id": "Ginny Britt",
                    "user_href": "/profile/Ginny-Britt"
                },
                {
                    "user_id": "Tengiz Hathuguay",
                    "user_href": "/profile/Tengiz-Hathuguay"
                },
                {
                    "user_id": "Zachary Abelardo",
                    "user_href": "/profile/Zachary-Abelardo"
                },
                {
                    "user_id": "George Uman",
                    "user_href": "/profile/George-Uman"
                }
            ]
        }
    ]
}