{
    "title": "Why did Martin Luther (Protestant Reformation) hate Jews so much? - Quora",
    "tags": [
        "Reform Judaism",
        "The Protestant Reformation",
        "Protestantism",
        "Anti-Semitism",
        "Judaism",
        "Jewish Ethnicities and People",
        "Hate",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dixie Schafir",
                "href": "/profile/Dixie-Schafir"
            },
            "answer_text": "He originally expected the Jewish people to join his newly launched Protestant movement, as he showed little understanding of the First Commandment and what it meant to the Jewish people. When the Jews did not leave their faith the Jewish people incurred his wrath. Below is a quote from ‘The Rise and Fall of the Third Reich’, Wm Shirer…  Above, is just part of the unfounded hate and polemic spewed by Martin Luther at the Jewish people. His concept of the Jewish people, common among the daughter faith of Judaism, is based on the unhistorical, polemical rantings against the Jews, their faith, which can be found in the New Testament’s wrItings, most particularly the book of Matthew. Some publications of the NT even incorporate commentary like Luther’s . Because of his writings, Martin Luther was destined to become one of the founding thinkers of Hitler’s Third Reich, wherein the German People literally complied with his commands to destroy the Jewish people. ",
            "date": "Answered October 3, 2019",
            "views": "424",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Julie Nickell",
                    "user_href": "/profile/Julie-Nickell-1"
                },
                {
                    "user_id": "Deepak S Fernandes",
                    "user_href": "/profile/Deepak-S-Fernandes"
                },
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                },
                {
                    "user_id": "Shawn Strange",
                    "user_href": "/profile/Shawn-Strange"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calvin Henrick",
                "href": "/profile/Calvin-Henrick"
            },
            "answer_text": "He didn’t. He was upset when they didn’t convert and follow their own Messiah like he expected them to and expressed his irritation with harsh language in a personal letter, but there was no particular anti-(ethnic)Jewish sentiment coming from him ever. ",
            "date": "Answered October 6, 2019",
            "views": "119",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Barrett",
                    "user_href": "/profile/David-Barrett-3"
                },
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                }
            ]
        }
    ]
}