{
    "title": "Why do some medical doctors treat their nurses so disrespectfully? - Quora",
    "tags": [
        "Nurses",
        "Nursing",
        "Doctors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cassie McNaney",
                "href": "/profile/Cassie-McNaney"
            },
            "answer_text": "I just vented with someone about this a couple days ago, and quite frankly, I'd like to vent again. I apologize in advance, as I'm still aggravated by this. Here is why: those who treat nurses horribly have usually never worked in a hospital a day in their privileged lives before going to medical school. I sure as heck can't back that up with peer review, so take it with a grain of salt. I'm angry. And I am not denying that many doctors truly empathize with patients and care about their coworkers (I'm trying to be one of the good ones), and that most interns are completely stressed out of their minds while getting stepped on continuously. Yes, med school and residency are difficult. But based off of who I have castigated for being derogatory towards practically any other job position, it is usually individuals who got accepted into medical school fresh out of undergrad before ever having worked full time or experienced reality, much less in a clinical setting. They're also usually the same students who whine to the faculty about “unfair” questions. Some of them have tried to seriously correct the professors because they \"disagree.” It is beyond cringe-worthy watching a first year medical student try to correct a pathologist. If it wasn't so hard to get a job in general, I would insist that every applicant should work full time in a hospital for at least a year. I know that's extremely biased, but working under nurses for four years taught me not only the value of interpersonal communication in a hospital setting, but how hard they have it. I have been insulted a number of times regardless of trying my hardest, but instead of fighting the nurses over a heart rhythm, I let them decide. Because they have had more school and more experience than me. Between me and a nurse, I am probably the one who is wrong. I can't even see the patient, for crying out loud. If you want to give them a bolus of adenosine while I think it's a very fast 2:1 flutter and you think it's SVT, then give them one. I have already laughed with my coworkers about not knowing anything. You want a medical question answered? Go to a nurse. For the love of god, do not come to me unless you want a nerdy explanation about pyrimidine dimerization. I have very little real world experience, and I have never directly saved a life. I still work on top of school, but all I do is watch ECGs for 12 hours during a night shift. It has its moments, but it's not a very hard job. Regardless, when I don't do my job correctly, it can affect patients. More so when I am a physician. If I treat someone horribly because I feel like they're “beneath” me, it can literally kill a patient. Maybe the nurse then, stressed out of his/her mind with too many patients to begin with, will give his/her tech more to do as well while they continue watching a patient the doctor doesn't think should be moved to ICU regardless of the RN explaining over and over again that the patient is going to crash . Then the CNA, now having to be six places at once, is late putting leads back on a different patient only to find out they are in VTach. I'm vaguely describing (and editing details for the sake of HIPAA) a situation I had to watch behind telemetry. There were multiple codes that night on two different patients because one of the patients needed full time attention on a basic telemetry floor. The majority of admits on that specific wing are usually in for cellulitis or nausea. So one code was unexpected, which happens sometimes, and would have been caught sooner if a nurse wasn't having to watch a patient that should have never been hers to begin with. And this same [insert bad word here] physician spent a majority of the morning screaming at the wing for spilling blood on the sheets while removing an ART line. Maybe the question should have been “why does a basic telemetry patient need to have an ART?” Because they were really really not okay. I actually called up in confusion, thinking it showing up on the tele was a mistake, as no one except speciality floors use it. Good for that nurse, because that caught their crisis immediately. Even before it showed up as a deadly arrhythmia on an ECG. Needless to say, that was the one time I wrote the equivalent of a thesis (I may be exaggerating) for risk management, complete with 24 hours of ECG recordings. That patient should not have been on that floor. Those poor nurses were not ICU nurses. Someone should have died, and they single-handedly saved them. And then the doctor had the audacity to yell at them for some bleeping spilled milk (or blood, in this case). So, long story short, there really are some fantastic doctors out there. I absolutely love a majority of my peers and know they will take their jobs seriously. But my god, the ones who do not respect nurses are doing so out of complete ignorance as to what other jobs deal with and it has a profound effect on their surroundings. A hospital is not a hierarchy, it is a group effort. ",
            "date": "Answered July 1, 2017",
            "views": "48",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Danita Lee Ewing",
                    "user_href": "/profile/Danita-Lee-Ewing"
                },
                {
                    "user_id": "Denise Tiffany",
                    "user_href": "/profile/Denise-Tiffany"
                },
                {
                    "user_id": "Deepti Rekha",
                    "user_href": "/profile/Deepti-Rekha"
                },
                {
                    "user_id": "Areenniz Az",
                    "user_href": "/profile/Areenniz-Az"
                },
                {
                    "user_id": "Tshering Gurung",
                    "user_href": "/profile/Tshering-Gurung-18"
                },
                {
                    "user_id": "Trabedy",
                    "user_href": "/profile/Trabedy"
                },
                {
                    "user_id": "Kory Woodbury",
                    "user_href": "/profile/Kory-Woodbury"
                },
                {
                    "user_id": "Deepsikha Chatterjee",
                    "user_href": "/profile/Deepsikha-Chatterjee-3"
                },
                {
                    "user_id": "Julia Watros Homard",
                    "user_href": "/profile/Julia-Watros-Homard"
                },
                {
                    "user_id": "Monica Anderson Haluska",
                    "user_href": "/profile/Monica-Anderson-Haluska"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff F. Lin",
                "href": "/profile/Jeff-F-Lin"
            },
            "answer_text": "I think it's learned behavior rather than an innate characteristic of people who are/become physicians, especially since many such physicians/surgeons who are so condescending or disrespectful towards nurses and other staff are just lovely to work with, hang out with and you see them act very differently with, say, waitstaff at restaurants or event staff for conferences or flight attendants, or students. When we as doctors go through training, we see and learn so many things, medical and otherwise, from our mentors. I have seen my share of my mentors who do treat nurses disrespectfully and those who don't. Certainly, stressful and sometimes exasperatingly frustrating experiences with patient care, but I've seen different folks deal with such things different ways. I can only speak for myself, and most of the times I am collegial and respect the nursing staff, but I admit that I have at times been curt over the phone and (extremely rarely) in person. When that happens, I almost always have a little thought bubble beforehand of being frustrated and some type of a previous experience - say, with a mentor or even a colleague in training back in the day when we're in call rooms or offices when he/she is also getting similarly frustrating calls - that kind of seems to justify or lead to me being curt or disrespectful. There are times that happens and there are times that don't, but the pertinent thing (to me, with respect to this question) is that when it does happen it's almost proceeded in that sequence. And hence, at least for me, that seems to point to a learned behavior. A question I would like to throw back, though, is why don't people (perhaps they do) ask the same question of some execs and their exec assistants, or some military commanding officers and their subordinates, chefs and line cooks, or others where there is a hierarchy. Indeed, we physicians aren't gods and are human, and, with the medical systems and care teams as they are set up, they are indeed hierarchies, with the social psychological effects they can have on their members/participants. And just like the questions on Quora asking why aren't doctors as selflessly philanthtopic and charitable as one would assume we'd be, please remember that we are humans, too. Possibly with bigger paychecks than average, but also with bigger liabilities than average. ",
            "date": "Answered February 8, 2018",
            "views": "22",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepsikha Chatterjee",
                    "user_href": "/profile/Deepsikha-Chatterjee-3"
                },
                {
                    "user_id": "Karen Verna",
                    "user_href": "/profile/Karen-Verna"
                },
                {
                    "user_id": "Donna Caggiano",
                    "user_href": "/profile/Donna-Caggiano-1"
                },
                {
                    "user_id": "Denise Lee",
                    "user_href": "/profile/Denise-Lee-69"
                },
                {
                    "user_id": "Monika Roberts",
                    "user_href": "/profile/Monika-Roberts-3"
                },
                {
                    "user_id": "Fernando A. Echeverria-Herreria",
                    "user_href": "/profile/Fernando-A-Echeverria-Herreria"
                },
                {
                    "user_id": "Ron Rothenberg",
                    "user_href": "/profile/Ron-Rothenberg-2"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Sarah Harrison",
                    "user_href": "/profile/Sarah-Harrison-80"
                },
                {
                    "user_id": "Charlie Zefron",
                    "user_href": "/profile/Charlie-Zefron"
                }
            ]
        }
    ]
}