{
    "title": "Why aren't the barrels of pistols rifled? - Quora",
    "tags": [
        "Handguns",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Gordon",
                "href": "/profile/Tim-Gordon-8"
            },
            "answer_text": "If the handgun fires fixed cartridge ammunition and was manufactured in 1899 or later, United States law requires that the barrel be rifled in order to qualify as a pistol or revolver rather than a short barreled shotgun subject to registration and a $200 transfer tax. A muzzle loading pistol may be unrifled, and is probably better off as such. Rifling a muzzle loader makes rapid loading much more difficult and really only offers an advantage in a rifle where the increased accuracy over a smoothbore offsets the slower rate of fire. If you have a breech loading pistol or revolver, trying to force a tight fitting bullet backwards though the rifling isn’t an issue and you don’t need to use an undersized bullet or ball with a greased patch to do the job, either. Speed is no longer much of a factor, so the rifling helps gain some accuracy in a weapon that is already quite difficult for most people to shoot well because of the short barrel. ",
            "date": "Updated February 10, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Heath",
                    "user_href": "/profile/Jim-Heath-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Burn Rice",
                "href": "/profile/Burn-Rice"
            },
            "answer_text": "Modern manufactured pistol barrels are rifled they have “lands” and “groves” just like a “rifled” rifle barrel. This assists in bullet stabilization and which in turn assists in accuracy of the round fired. There is also a legal requirement that all handguns have to have a rifled barrel to be legal. This was supposedly to make it harder for a criminal to make a homemade gun. But if they are going to make a homemade gun for illegal activity already one more law on the books does not stop them. Impro Guns ",
            "date": "Answered August 1, 2016",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Walsh",
                    "user_href": "/profile/Tom-Walsh-63"
                }
            ]
        }
    ]
}