{
    "title": "Why does money lose its value? How does inflation affect it? - Quora",
    "tags": [
        "Inflation (economics)",
        "Value (economics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Ross",
                "href": "/profile/Derek-Ross-9"
            },
            "answer_text": "How would one decrease the value of money? One way would be to poison all the water sources in the country and forbid the importation of water. The resulting water shortage would send the price of water through the roof. But people would still want to buy water because water is essential. So the people and the government would pay whatever it takes to obtain enough. And while people cannot create money to pay for anything, the government can. And it will for an essential. Result? Inflation! The reason for inflation is that people and organisations will bid against each other for goods in short supply. And the more essential those goods are, the more determined people will be to win the bid, whatever the monetary cost. Most goods and services are nice-to-have, not must-have, and so shortages of them will cause normal inflation. But whenever an essential is in really short supply, there is a possibility of hyperinflation, particularly when one of the bidders has the ability to create money. ",
            "date": "Updated April 4, 2018",
            "views": "286",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pratima Tiwari",
                    "user_href": "/profile/Pratima-Tiwari-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reynold Pratt",
                "href": "/profile/Reynold-Pratt"
            },
            "answer_text": "Inflation reduces money’s purchasing power, example, if a loaf of bread can be purchased for $2 today, and a month later the same loaf of bread can be purchased for $20, your money is worth ten times less. So, the value of money is its exchange power, the amount of good each unit of money will get you. So, instead, if a month later $2 would get you 20 loaves of bread, your $2 will now be worth $40, twenty times its previous value. ",
            "date": "Answered October 22, 2019",
            "views": "26",
            "upvotes": "0"
        }
    ]
}