{
    "title": "Why were the Huguenots persecuted in France? What was the main reason? Was it religious or political? - Quora",
    "tags": [
        "Religion and Politics",
        "Politics of France",
        "Reason",
        "Middle Ages (era)",
        "France",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Vicini",
                "href": "/profile/Eric-Vicini"
            },
            "answer_text": "Huguenots is the French term for Protestants. Protestantism started in France in the 16th century, during the Reformation. At first, the French kings tried to stop, and persecute the Protestants. This was due to religious reasons, as well as the political aspect of Protestantism as a form of political lack of allegiance to the crown. In the second half of the century, the situation had evolved into a civil war between the Catholics and the Protestants. Eventually, the Protestant leader won the war, converted to Catholicism and became king Henry IV. A treaty was signed which ended the persecution of the Huguenots, until the reign of Louis XIV. In a stunning move, Louis XIV, himself the grandson of Henry IV, revoked the treaty and persecuted the Huguenots. He gave them the choice to either convert or go into exile.  The reason was entirely religious. Louis XIV had become a religious bigot and had married a bigot in a secret second marriage, who had influence on him. ",
            "date": "Answered July 7, 2015",
            "views": "692",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Guerre",
                    "user_href": "/profile/Martin-Guerre-6"
                },
                {
                    "user_id": "GP Chen",
                    "user_href": "/profile/GP-Chen"
                },
                {
                    "user_id": "Sam Boyer",
                    "user_href": "/profile/Sam-Boyer-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                },
                {
                    "user_id": "David Smotritsky",
                    "user_href": "/profile/David-Smotritsky"
                },
                {
                    "user_id": "Jengish Artykbaev",
                    "user_href": "/profile/Jengish-Artykbaev"
                },
                {
                    "user_id": "Dennis L. Davis",
                    "user_href": "/profile/Dennis-L-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Li",
                "href": "/profile/Brandon-Li-11"
            },
            "answer_text": "A disproportionate amount of Huguenots were French nobles who converted to Calvinism more to avoid various taxes and stick a finger in the king's eye than because of any religious devotion to theology.  As a result, we can infer that the main reason, although not the sole one, for the persecution of French Protestants was politics rather than faith.  Ever since the 15th century, the French crown had been attempting to centralize power and reign in the nobles.  Persecution of heretics would certainly be a great reason to strip lands and power from unruly nobles. ",
            "date": "Answered July 7, 2015",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashton Terre'Blanche",
                    "user_href": "/profile/Ashton-TerreBlanche"
                },
                {
                    "user_id": "GP Chen",
                    "user_href": "/profile/GP-Chen"
                },
                {
                    "user_id": "Benjamin Collet",
                    "user_href": "/profile/Benjamin-Collet-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jason-Blau"
                },
                {
                    "user_id": "Khalil Khan",
                    "user_href": "/profile/Khalil-Khan-4"
                }
            ]
        }
    ]
}