{
    "title": "Why didn't gun swords take off as mainstream weapons? - Quora",
    "tags": [
        "Swords",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "Why didn't gun swords take off as mainstream weapons? Because the ergonomics of guns and swords are radically different. The more you optimize for one, the more it sucks for the other. Let’s start with swords. At their most basic, a sword is sharpened metal stick. They have a very linear shape.      From bronze to steel, swords maintained that overall linearness. Even dramatically curved swords are, in the grand scheme of things, straight-ish.  Now, what of guns? Well, most swords were used in one hand, so we’ll look at one handed guns.   Again, we see a broadly consistent shape. So, what happens when we try to merge the two? You run into various problems.     Optimizing the ergonomics for a sword means it won’t shoot well. Optimizing for a gun means it won’t…sword…well. In either case, you’re increasing weight for little direct gain, and increasing complexity which means more shit to break. If you’re determined to have pistols and swords, just have pistols and swords. Use the sword to engage close range targets, and the gun to engage farther targets. One in each hand, switching as needed. No gun-fu nonsense.  This was done historically by cavalry. Saber on your left hip, pistol on the right, butt forward so that it could be drawn with either hand.   Now, if you are determined to combine a gun with a melee weapon, there is a much better combination. Combine a spear,  with a rifle.  They have much the same overall shape, and are held much the same way. In point of fact, bayonets have been used for centuries.    For a long time, both weapons were used in ranks, too.   Yes, bayonets make much better gun/blade hybrids than do gun/swords. ",
            "date": "Answered April 3, 2018",
            "views": "176",
            "upvotes": " View 756 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Williams",
                    "user_href": "/profile/Patrick-Williams-292"
                },
                {
                    "user_id": "Mousam Mallick",
                    "user_href": "/profile/Mousam-Mallick-2"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                },
                {
                    "user_id": "Chris Zaddack",
                    "user_href": "/profile/Chris-Zaddack"
                },
                {
                    "user_id": "Keith Andre Binueza",
                    "user_href": "/profile/Keith-Andre-Binueza"
                },
                {
                    "user_id": "Diesel Merkle",
                    "user_href": "/profile/Diesel-Merkle"
                },
                {
                    "user_id": "Alex Groggett",
                    "user_href": "/profile/Alex-Groggett"
                },
                {
                    "user_id": "Michael McKee",
                    "user_href": "/profile/Michael-McKee-57"
                },
                {
                    "user_id": "Andrew Ruoff",
                    "user_href": "/profile/Andrew-Ruoff-1"
                },
                {
                    "user_id": "Sudip Bose",
                    "user_href": "/profile/Sudip-Bose-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Makarov",
                "href": "/profile/Anthony-Makarov"
            },
            "answer_text": "As we are discussing something that never was, it is a matter of some guesswork. My guess is that a) it is suboptimal functionally. A sword needs exact or at least good balancing and precise weight. Early firearms were very heavy, so having a gun built inside your sword makes your sword subpar to any other sword. Visa versa, aiming with a gun, that has a sword, which is not exactly the lightest thing in the world, is way more difficult. Early guns had trouble hitting wide side of a barn, and now it is even heavier and less accurate. b) reliability. Guess what, traditional swords, if done right, are quite durable. Put a barrel and even a simple mechanism somewhere and sword becomes a disaster waiting to happen. Not to mention the stress a medieval shot will put this contraption through. And again, visa versa, a normal gun is easier to maintain and the construction must not rely on the sword. C) smoke. When swords were a common and useful thing, there was no smokeless powder. Good luck fencing in choking smoke, darkness and all this. D) it is way easier just to have both separately. Early guns were throwaway contraptions, both a pistol and a sword would be wielded with one hand. Why make your life difficult, when you can just have reliably have both? E) when swords were a good reliable weapon, you could not load and forget. Powder could spill, flintlock was flimsy. You can’t swing a loaded gunblade. Not to mention even earlier cases, you had to have a burning piece of rope. Yeah, no, not working right, is it? Tl;Dr there is no real benefit but a whole lot of maluses ",
            "date": "Answered February 13, 2018",
            "views": "11",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Lloyd",
                    "user_href": "/profile/Martin-Lloyd-56"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Dennis Chuong",
                    "user_href": "/profile/Dennis-Chuong-1"
                },
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                },
                {
                    "user_id": "Liam Fish",
                    "user_href": "/profile/Liam-Fish-2"
                },
                {
                    "user_id": "Malcolm Elder",
                    "user_href": "/profile/Malcolm-Elder-1"
                },
                {
                    "user_id": "Hongmei Zhao",
                    "user_href": "/profile/Hongmei-Zhao-1"
                },
                {
                    "user_id": "Valentin Winston Eng",
                    "user_href": "/profile/Valentin-Winston-Eng"
                },
                {
                    "user_id": "Dante Inouye",
                    "user_href": "/profile/Dante-Inouye"
                },
                {
                    "user_id": "Peter Nguyen",
                    "user_href": "/profile/Peter-Nguyen-7"
                }
            ]
        }
    ]
}