{
    "title": "Why were there spice wars during 17th century? - Quora",
    "tags": [
        "Dutch-Portuguese War",
        "17th Century",
        "Spices",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Pieter Buis",
                "href": "/profile/Pieter-Buis-1"
            },
            "answer_text": "Spices were a luxury good or better yet it was a consumable item that couldn’t be produced in Europe. The demand for it meant that finding an alternate route to the east (bypassing the Middle East) was worth it. The Portuguese found it first with the Dutch following a century later and finding a new route that bypassed the strait of Malacca. Now the Portuguese dropped down a bunch of fortified trading posts along the route for various purposes such as; storing goods waiting for transport, ensuring goods can be bought and providing a safe base for ships. On top of this the forts also served as seats of Portuguese authority on the other side of the world. The Dutch, rather than having the state actively involved, had a company set up to profit from the spice trade. The Dutch government gave them a set of privileges but the company was a limited liability joint stock enterprise with everyone from aristocracy to thatchers buying shares. The Dutch–Portuguese War arose not so much over the spices directly as the profits gained by them. The profit made by the spice trade was valuable. To give an idea of how big the spice trade was (The figure of 7.4 trillion gets thrown around a lot though the number is still debated, conversion to modern currency involves some adjusting and guessing).  ^That’s important. Spices be damned it was about the money they got for them. It was not so much that spices were a life necessity, it was really just a valuable trade. If a trade in shoelaces had as much money involved I am sure they would have fought a war over that. I hope this answers your question. ",
            "date": "Answered August 30, 2016",
            "views": "285",
            "upvotes": " View 438 Upvoters",
            "upvoters": [
                {
                    "user_id": "Midi",
                    "user_href": "/profile/Midi-1"
                },
                {
                    "user_id": "F. Ferdinand",
                    "user_href": "/profile/F-Ferdinand"
                },
                {
                    "user_id": "Ismail Rahmat",
                    "user_href": "/profile/Ismail-Rahmat"
                },
                {
                    "user_id": "Ihsan Okt",
                    "user_href": "/profile/Ihsan-Okt"
                },
                {
                    "user_id": "Carlos Perez",
                    "user_href": "/profile/Carlos-Perez-5"
                },
                {
                    "user_id": "Hans Widjaja",
                    "user_href": "/profile/Hans-Widjaja"
                },
                {
                    "user_id": "David Gray",
                    "user_href": "/profile/David-Gray-78"
                },
                {
                    "user_id": "Vipin Kumar",
                    "user_href": "/profile/Vipin-Kumar-34"
                },
                {
                    "user_id": "Michael Foley",
                    "user_href": "/profile/Michael-Foley-67"
                },
                {
                    "user_id": "Jack Norbert",
                    "user_href": "/profile/Jack-Norbert-1"
                }
            ]
        }
    ]
}