{
    "title": "Why do modern day people rarely carry weapons around anymore? - Quora",
    "tags": [
        "Weapons",
        "Guns and Firearms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Élise Petras",
                "href": "/profile/Élise-Petras"
            },
            "answer_text": "The world recognised the benefits of a civilian police force. Before we had cops there was nobody but the town watch and the army to come to your aid, and it usually involved pointy things being pointed at people. A traditional reason I've heard for driving on the left side of the road is that should a highwayman approach you by carriage from the opposite direction, you could unsheathe your sword (which you had for self defense) and defend yourself properly instead of the bandit jumping onto your carriage or what not. Same logic for \"shotgun\" seats in America, from stagecoaches. Once police began patrolling town, forming bonds, keeping the peace (relatively speaking), people began to carry weapons less often. Unless you were going somewhere quite sketchy like Whitechapel in the 1880s, you could count on the police to come to your aid in times of distress. Fast forward to today. From my personal experience, I haven't seen many \"beat cops\" walking around town in the US outside of New York City. If you live in a big city, and unless someone invades your home or store in which case the police won't reach you in time, you can reasonably expect to run into a cop or have a shocked bystander call 911 to report what happened. In fact, if you run into the police while carrying an obvious weapon they will stop you to make sure you're not up to anything, such is their dedication to keeping the city safe from potential muggers and thieves. It makes far more sense to own weapons for self defense in the countryside, where none of this is true and it's really just you and your family against any person or animal that will cause you harm. ",
            "date": "Answered March 4, 2016",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Fredrick Allen",
                "href": "/profile/Christopher-Fredrick-Allen"
            },
            "answer_text": "Problem is that what is a weapon had been redefined to include a lot of things that used to be considered tools. Swiss Army knives, Leatherman tools, (earlier) Boy Scout Knives - none of these used to be considered weapons. Carried a Boy Scout Knife or better (one with more functions) all the way from first grade up through college. Up until 2001, i used to get on an aircraft with the largest (the Swiss Army knife with the most functions) Swiss Army knife made (two knife blades and 79 other tools)  and 3 or 4 leatherman-style tools. I Flew Delta a lot with my usual compliment of stuff, but even 2001 Delta did NOT allow utility knives and box cutters to be carried on airplanes. In fact back then the rule was something which was SOLELY a knife was banned, but knives which were considered tools were not. For those who want to point out that tools can be used as weapons, I would like them to know that whenever I got on an aircraft,  since I knew there was s slim possibility of being hijacked, I would carefully note where all the items which could be used as weapons were located.  I wish they'd quit re-defining tools as weapons - How many people have been stabbed by someone using a Swiss Army knife? It's frustrating to be somewhere where I know how to fix something but can't, because I have been forbidden to possess tools. ",
            "date": "Answered February 1, 2016",
            "views": "244",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Branko Dodig",
                    "user_href": "/profile/Branko-Dodig"
                },
                {
                    "user_id": "Dennis McKinney",
                    "user_href": "/profile/Dennis-McKinney-3"
                },
                {
                    "user_id": "D. R. Lovell",
                    "user_href": "/profile/D-R-Lovell"
                },
                {
                    "user_id": "Austin Kuo",
                    "user_href": "/profile/Austin-Kuo-4"
                },
                {
                    "user_id": "Christopher Hawk",
                    "user_href": "/profile/Christopher-Hawk"
                }
            ]
        }
    ]
}