{
    "title": "Why did Europeans want to find an ocean trade route to East Asia after 1400? - Quora",
    "tags": [
        "Trade Routes",
        "East Asia",
        "Trade",
        "European Ethnicities and People",
        "Southeast Asia",
        "History of Europe",
        "Asia",
        "World History",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Fernandez",
                "href": "/profile/Ryan-Fernandez-15"
            },
            "answer_text": "The Crusades had the side effect of increasing trade between Europe and the Middle East. Cinnamon, pepper, dates, sugar, and cotton entered European markets in greater quantities thanks to trade centers like Constantinople and Alexandria. Other goods like Chinese silk and Indonesian spices came from so far, and were passed around by so many middlemen, that their prices skyrocketed by the time they were sold in Europe. The trade routes for these luxuries became more and more difficult to secure for Westerners. War in Central Asia, the Fall of Constantinople, and the rise of the Ottoman Empire meant access was extremely difficult, dangerous, and expensive. Portugal and Spain were the first European powers to look for ways to bypass the old routes. Poised on the Atlantic, they began to sail farther and farther. After the discovery of the New World by Columbus, an agreement known as the Treaty of Tordesillas divided uncharted lands between Lisbon and Madrid. Portugal would sail down and up Africa and reach East Asia via the Indian Ocean. Spain sailed west, crossing the Straits of Magellan the southern tip of South America, and cross the Pacific. In 1511, the Portugese seized Malacca, the largest trading hub for spices in Southeast Asia. In 1521, Spain finally crossed the Pacific and landed in what's now the Philippines. Their discoveries would spur other Europeans to venture to Southeast Asia as well in order to secure spices, textiles, furniture, jade, and porcelainware among many things. Cash crops like tobacco, sugar, and coffee would soon be grown to further enrich colonial governments. ",
            "date": "Answered November 24, 2019",
            "views": "715",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgi Stojcev",
                    "user_href": "/profile/Georgi-Stojcev"
                },
                {
                    "user_id": "Alex Neuenfeld",
                    "user_href": "/profile/Alex-Neuenfeld"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dela Cueva",
                "href": "/profile/Robert-Dela-Cueva"
            },
            "answer_text": "Short answer, to be able to move spices - or anything, really--in bulk, they needed to gloat them on water. No other transportation comes close, even today. Long story involves the pope mediating in a conflict between Spain and Portugal and giving Spain the right to colonise West while Portugal got the East. Spain found gold in Latin America. Portugal needed to bring lots of goods to be able to match that to some extent… BuBulk trade… SeSee above. ",
            "date": "Answered July 2, 2019",
            "views": "350",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        }
    ]
}