{
    "title": "Why are so many people wanting to erase the history of our country? How can we not realize that when we edit history for the sake of our feelings, we fictionalize that history (like Monopoly money has no worth and bears no consequences)? - Quora",
    "tags": [
        "History of the United States of America",
        "History",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Lund",
                "href": "/profile/Erik-Lund-1"
            },
            "answer_text": "Monopoly money isn’t useless in the game of Monopoly. In the game of America, any story we tell is useful, if it gets us where we need to go. What is the history of America? In the Fifteenth Century, we would have learned America was an island in the Atlantic, close to Asia, visited over the years by a cavalcade of European knights and holy saints, in spite of which its inhabitants were Muslims. Adventurers could point to these stories to extract funding for their adventures. In the Sixteenth Century, we would learn that it was a New World, discovered by a Welsh prince named Madoc, and that its inhabitants were the descendants of those medieval Welsh. (Who might themselves have been Trojans, or possibly the Lost Tribes of Israel, or Egyptians —something like that.) English pirates could point to these stories to justify their attacks on Spanish commerce that might otherwise seem a bit barbaric. By the early seventeenth Century, we would have learned that it was a land of feudal aristocrats, just like Europe, where European adventurers could attach themselves as followers, and perhaps even rise to become kings according to the ancient principle that the hero who slays the dragon gets the king’s daughter and half his kingdom. The leadership of the new colonies growing along the Atlantic seaboard could point to to these stories as excuses to establish proprietary estates and impose rental leases on what sure seemed like virgin land. But by the end of the Seventeenth Century, these “noble races” of native aristocrats were starting to look a little ragged (even if they appear as late as Last of the Mohicans), and instead, history was looking to Europe. It turned out that New Englanders were descended from Cromwell’s Roundheads, whilst Southern gentlemen were all Cavaliers. The established elites of the colonies were increasingly looking to government service and church preferrment to consolidate their landed wealth, and sought to align themselves with the political factions that jockeyed for the ascendancy in London. In the course of the Eighteenth Century, America became a place of a new baptism in which the monarchical subservience of the Old World had been washed away and replaced by a republicanism that looked back to ancient Rome. And yet, somehow, republican democracy meant being ruled by a native aristocracy. Again. Only now, instead of being born to the right blood, they’ve been properly brought up. Jeffersonian democracy meant being ruled by the most sophisticated and well-educated people, who just happened to be the richest. By the Nineteenth Century, at least if you read the annual speeches given at Plymouth Rock, it was all about race. New England had been founded by family groups from England, and was pure, uhm, light. (“99 44/100ths percent pure soap,” the Ivory slogan puts it, because it’s white.) The broad implication, spelled out in terms of the rest of the country being mired in “darkness,” was that all those old Southern migrants must have married maidens of dusky hue back in the Seventeenth Century, and that only New England could run the country, because of White Supremacy. This, as you might imagine, drove Southerners absolutely insane and contributed to a new party system, which ultimately led to the Civil War. Victory for the northern faction, reborn from the old Federalists as a new Republican coalition that included the agrarian wealth of the Midwest a new America. Racial issues were pushed into the background in a double cultural and physical movement to make the Indian and even more awkward Black, “disappear.” In the new America, entrepreneurs and inventors were the font of American prosperity and government and always had been. Wealth was always new made by someone raising themselves up by their own bootstraps, In a new American epic, Benjamin Franklin and Sam Adams emerged from earlier myths to become inventors and businessmen, almost as important as Thomas Edison. In the real world, railroad tycoons and lesser breeds of monopolists stole and operationalised new European products and created vast empires of “rent,” in the economics sense of the word. As this Gilded Age soured on most people in the early Twentieth Century, a new skepticism about capitalism began to emerge, preferring what has been dubbed in the European context, “Herrenvolk democracy,” in which all Whites were democratically equal, and might even benefit from a certain measure of socialism, provided it were restricted to people with the right skin colour. The rise of the KKK symbolised this in its first stage, while FDR’s New Deal attempted to throw the saddle of liberalism over it. World War II, thank God, shook America free of that toxic dream, and a new America emerged, one of egalitarian and colour-blind opportunity. Exactly when America became colour blind is not clear to me, although a teenage reading of National Review would suggest that it happened over night sometime between 1953 and 1963, so that Eisenhower’s school desegregation was a good thing, because it defeated racism, while the Civil Rights Act was a bad thing, because it brought (reverse) racism back. It’s easy to be an egalitarian and colour-blind country when a middle class of unprecedented size and security was being born of thirty year mortgages. And it is probably no coincidence that the Republican Party was able to mobilise resistance to the New Deal just as the postwar full-employment economy consensus began to fray. Conversely, of course, a young generation of unprecedented size embraced a new American history of adult authority and oppression. America ‘s history in the 1960s was a nightmare of fascism and authoritarianism. Cold Harbour’s eugenicists invented Nazism; the Gilded Age invented anti-unionism and the “iron law” that wages must fall to subsistence level; J. Edgar Hoover’s FBI was the original Gestapo; and all of America’s religious past was a killjoy conspiracy to impose drug legislation and the age of consent on the healthy expression of sex— I, uhm, anyway. This new “People’s History of America” was supposed to sweep away the Silent Generation and create opportunity for the Baby Boom, but simply could not last long enough to accommodate the whole of that generation-long demographic bulge. Disappointment began to set in for the younger cohorts of the Baby boom in the Eighties, at which time America’s past briefly became all about alcoholism, sexism, violence and child sexual abuse. To the extent that the Administrations of the 80s and 90s were able to right the American ship of state, it was on the strength of the technology boom. I’m not going to drill down into any possible explanations for that, although my intuition is that the Reagan-era supercharging of the military-industrial complex might have had something to do with it. The American past of the 2000s was boldly neo-liberal. Whereas the Gilded Age had patted itself on the back over the fact that Americans had more patents than any other people in history, a new history discovered that inventiveness was inherent in the American way of life. Was it Judeo-Christian culture? Liberalism? Some forbidden lore of eugenics? Who knew? The fact was that the right educational and tax policies could unlock the secrets of innovation and create a permanently progressive society, bound for Singularity. When the tech tycoons soured for us after 2012, and we belatedly discovered inequality, and revived the old “stagnation” ideas of Keynes and, for the daring, Alvin Hansen, it was just in time for the Obama Administration’s reinvention of Kennedy and Roosevelt’s “best and brightest.” The neo-liberals, repenting of perhaps the greatest extremes of their techno-libertarian enthusiasms of the previous decade, boarded the ship with a new nostrum of permanent, infrastructure-building, budget deficits, a solution that allowed them to preserve the “natural rate of unemployment,” and the idea that it was always time for a pre-emptive, inflation-fighting prime rate increase that would incidentally build the growing fortunes of the 1%. I should point out, as I didn’t in the first edition of this answer, that we now got a new history, in which America’s many depressions and “hard times” came front and centre, and a new openness to government intervention was turned into a history whose worst villain was Andrew Jackson, for breaking up the Bank of the United States. The idea that we were fighting the 1% by building the 1% was given an all-too visceral force by the appearance that 2016 was foisting an election choice between the wife of a neo-liberal president and the brother of a neo-liberal president upon the American voter. That, of course, led to the election of a President who talked like a Herrenvolk permanent-infrastructure-deficit kinda guy. The suspicion that things could do with a shaking up probably put enough voters in his corner to secure his election. As par of his turn towards party orthodoxy and in a desperate attempt to shore up his credibility amongst his core voters, the new President has been selling a history in which America’s values are in danger at the least question. Nationalist history is often fragile in this way, and it actually reminds this historian of technology of the way that the professions (medicine, law, science, engineering) police the ramparts of their particular histories against the dreaded “externalist” who might “relativise” stories of Blackstone, Jenning or Newton. And, well, it’s 2020, and consider things shook! Not so shaken that the same assholes don’t own Broadwalk-with-a-hotel on it, but shook. It’s probably not surprising that the latest version of American history is all about shaking things up. ",
            "date": "Answered October 24, 2020",
            "views": "327",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ozell Smith",
                    "user_href": "/profile/Ozell-Smith-6"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Riggsby",
                "href": "/profile/Matt-Riggsby"
            },
            "answer_text": "It’s not clear who “we” are here, but I’m guessing this question was written by a fellow American. Proceeding from that assumption: There’s a bit of a trap here, as any postmodernist will tell you. Any account of history is edited in some way. Most people learn a brief summary of a summary of a summary of their country’s history in school and through popular media. Somebody or some aggregate of somebodies looked over what they knew about history and wrote a version of it containing what they thought it was important for you to know. It was in no way neutral, objective, and unbiased, no matter how much we’d like it to be. We can attempt to be even-handed and try not to have an agenda, but even then, we’re limited by what we know and what our predispositions lead us to value and conclude by the limited evidence we’ve got. And, of course, there are also any number of people who want particular versions of history taught precisely because they have an agenda. If your history classes focused on politicians, inventors, generals, captains of industry, it’s because there’s a climate of opinion which decided that the rich and powerful were more important than the great mass of humanity. The interests of wealthy white men, for example, were deemed important, while those of poorer white men, most women, people of color, and so on were deemed unimportant. Any historian knows they’re all important because they’re all part of history; many have been fooled into thinking they’re not. There are even in this day and age attempts to erase the history of slavery, with the state of Texas within the past several years considering textbooks which mention in passing “workers from Africa” and not touching on their captivity, their abuse by slavers, and so on. Why? Because the more people know about the history of slavery and racism, the more likely they are to be aware that racism is still an issue which has an impact on people alive today, and the people trying to erase that subscribe to a political ideology which can’t survive critiques of racism. That said, taking down statues—which is what this feels like it’s about—is not erasing history. Statues are not history. Statues are later commemorations and celebrations of historical figures. They’re commentary and propaganda, a tool to express support for certain ideas on the part of the community. Many Confederate monuments, for example, don’t represent any specific Confederate soldier. Rather, they were mostly put up in the early 20th century to express nostalgia for the Confederacy and to endorse white supremacy. We know this because we’ve still got records of how they were sold and people discussing why they put them up. When we take statues down, we don’t pretend that the people they represent don’t exist. We simply stop celebrating them as worthy of public monuments. Ideally, we’d still teach about such people in school, but we’d stop erasing the parts long-hidden because we treated them as moral paragons. Far from erasing Columbus, for example, we’d teach about him more broadly. He was the guy who opened sustained contact between the Old World and the Americas and he was a brutal, petty tyrant when he was governor of Santo Domingo. Indeed, the whole reason for taking down those statues is because that more and more people are becoming aware of the un-erased version of history and have reached some fairly obvious conclusions about figures we’ve previously only had sanitized versions of. ",
            "date": "Answered October 24, 2020",
            "views": "766",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eaipi Etun",
                    "user_href": "/profile/Eaipi-Etun"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Roy Mitchell",
                    "user_href": "/profile/Roy-Mitchell-23"
                },
                {
                    "user_id": "Jeroen van Hasselt",
                    "user_href": "/profile/Jeroen-van-Hasselt-1"
                },
                {
                    "user_id": "Leon E. Kennedy",
                    "user_href": "/profile/Leon-E-Kennedy"
                },
                {
                    "user_id": "Ben Waldock",
                    "user_href": "/profile/Ben-Waldock-2"
                },
                {
                    "user_id": "Micha Roded",
                    "user_href": "/profile/Micha-Roded"
                },
                {
                    "user_id": "Spencer Alexander McDaniel",
                    "user_href": "/profile/Spencer-Alexander-McDaniel"
                },
                {
                    "user_id": "Therese Van Arsdale",
                    "user_href": "/profile/Therese-Van-Arsdale"
                },
                {
                    "user_id": "Fitzpatrick Burnette",
                    "user_href": "/profile/Fitzpatrick-Burnette-1"
                },
                {
                    "user_id": "Daragh Malone",
                    "user_href": "/profile/Daragh-Malone"
                },
                {
                    "user_id": "Michał Dobrzański",
                    "user_href": "/profile/Michał-Dobrzański-1"
                },
                {
                    "user_id": "Lakshya Manda",
                    "user_href": "/profile/Lakshya-Manda"
                },
                {
                    "user_id": "David Johnson",
                    "user_href": "/profile/David-Johnson-57"
                },
                {
                    "user_id": "Andrew Hirst",
                    "user_href": "/profile/Andrew-Hirst-13"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Eric Shrewsberry",
                    "user_href": "/profile/Eric-Shrewsberry-4"
                },
                {
                    "user_id": "Beatrice Bini",
                    "user_href": "/profile/Beatrice-Bini"
                },
                {
                    "user_id": "Justin Alfredson",
                    "user_href": "/profile/Justin-Alfredson"
                },
                {
                    "user_id": "Johann Schnittke",
                    "user_href": "/profile/Johann-Schnittke"
                },
                {
                    "user_id": "Ben Hoff",
                    "user_href": "/profile/Ben-Hoff-1"
                },
                {
                    "user_id": "Ozell Smith",
                    "user_href": "/profile/Ozell-Smith-6"
                },
                {
                    "user_id": "Kally Pan",
                    "user_href": "/profile/Kally-Pan"
                },
                {
                    "user_id": "Ahmed Abdelhaq Zaydan",
                    "user_href": "/profile/Ahmed-Abdelhaq-Zaydan"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "James McCarthy",
                    "user_href": "/profile/James-McCarthy-16"
                },
                {
                    "user_id": "Laura Mitchell",
                    "user_href": "/profile/Laura-Mitchell-5"
                },
                {
                    "user_id": "Ian Wenker",
                    "user_href": "/profile/Ian-Wenker"
                },
                {
                    "user_id": "Courtenay Rule",
                    "user_href": "/profile/Courtenay-Rule"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Hardwick",
                "href": "/profile/Kevin-Hardwick-2"
            },
            "answer_text": "I assume you are talking about public history—-monumental art, museums, architecture, and so on. Academic history is something different, but I suspect that’s not what you are asking about. No one (or at least, no one who is thoughtful and serious) is suggesting that we erase the public history of our country. What many people are suggesting, rather, is that we change what we choose to emphasize about the past, and the lessons we propose to draw from it. Ultimately our public history isn’t really about the past at all—-it is instead about our identity in the present. What kind of country are we? Whom do we aspire to be? There is an intimate connection, in public history, between the past from which we choose to take inspiration and the people whom we hope to become. Rather a lot of things happened in the past. We don’t have time or energy to try to recover all of it. So any time we do history we have to make choices. If anyone cares, there are a number of very fine philosophical works that explore this topic. One good place to start is the first chapter of E.H. Carr, WHAT IS HISTORY (Random House, 1961). Amazon.com: What Is History? (9780394703916): Carr, Edward Hallet: Books I guess I should qualify this. Modernist architecture is all about repudiation of the past. There is something deeply ironic in the choice of the Smithsonian to house the Museum of American History in a modernist building. But I suspect this too is not what concerns you!  ",
            "date": "Answered October 24, 2020",
            "views": "338",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vincent Daly",
                    "user_href": "/profile/Vincent-Daly-2"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ozell Smith",
                "href": "/profile/Ozell-Smith-6"
            },
            "answer_text": "Neither does fiat money, but we still use it. It is the value we give it, in agreeance to use it as face value with no precious metal backing it. History is set of lies agreed upon,-Napoleon B. See from the perspective of the enslaved in America, ask your question. If unable to trace your genealogy past your grandparents, or having to deal with common hurdles in life, only then to deal with someone in a position of power, judging by skin color,…ask your question. If you were told you were African American, but really from Carribean, and from the people Columbus named 'indian’, ask your question. From the fact that America was founded on racism, ask your question. Lot of truth regarding Americas enslaved is deleted. Even to the point of renaming the enslaved as negroe, in effect creating new race of people, changing their ‘history'…ask your question. Honestly to the public, and our endoctrination system, our history has already been changed, because we are ashamed of our past. Respecfully disgusted at your question. ",
            "date": "Answered October 24, 2020",
            "views": "233",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wendy Hewitt",
                    "user_href": "/profile/Wendy-Hewitt-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Reyes",
                "href": "/profile/David-Reyes-31"
            },
            "answer_text": "There have always been people like that.. like the SJWs who “Become outraged because a little while girl wants to dress like Moana for Halloween. “ want to “Ban\" things and remove others because “It insults somebody somewhere.” And there are also those who… Want to ban and have burned copies of “Harry Potter\" because it promotes witchcraft. Want to ban and erase from existence “The Adventures Of Huck Finn\" by Mark Twain because of one word in it. The dimwits that keep stating that the holocaust never happened OR was a JEWISH LIE! The ultimate example of this is North Korea, in which EVERYTHING IN their media make their leader look like “JESUS CHRIST RETURNED TO EARTH.” This is why a free press is so important to keep those-in-charge from becoming dictators. And why censorship and book-banning are such controversial subjects. And why those of the “IT'S ALL A LIE! THEY ARE ALL IN A PLOT! BELIEVE ONLY WHAT I SAY\" types are NOT to be trusted in positions of power. These are the ones who scream in rage the loudest about anything that contradicts their perverted delusional view of history. ",
            "date": "Answered October 24, 2020",
            "views": "318",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teodor Barsan",
                    "user_href": "/profile/Teodor-Barsan"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morley Evans",
                "href": "/profile/Morley-Evans-1"
            },
            "answer_text": "People who erase history want everyone not to know about or to forget about the roots of our current civilization. That is “deracination”. It literally means “to tear up by the roots.” Have you ever torn up a plant by its roots and left it to die in the sun? That’s what will happen to our civilization. People who do this don’t like our civilization. They think they have something better. The most extensive experiment to do this was launched by Lenin. It became Stalin’s Soviet Union. That experiment lasted from 1917 to 1991 when it ended. The people who are tearing down Confederate statues and rioting in the streets want to try that experiment again on the grave of the United States. Civilizations are organically created by millions of people working together. They are not created and cannot be created by a genius. We can see farther because we stand on the shoulders of giants. We owe everything we have to our ancestors. ",
            "date": "Answered October 24, 2020",
            "views": "308",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teodor Barsan",
                    "user_href": "/profile/Teodor-Barsan"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert C. Kahlert",
                "href": "/profile/Robert-C-Kahlert"
            },
            "answer_text": "History wants to be neither edited nor fictionalized. The problem is the other way around. People view history as a morality play, and they want history to come and support _their_ side of the story. Unfortunately history is no ally of anybody. (I am always surprised that Christians are confused by this, because Paul clearly says in Romans “All have fallen short before the glory of God.”) George Washington was at the same time a great president, a great general, the richest man in the Colonies and a slaveholder. He was all of that together. It is only people who wish to instrumentalize him for their story that have a problem with that. They call it erasing of history but it is really more like putting in the correct perspective. ",
            "date": "Answered October 24, 2020",
            "views": "295",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Poulton",
                    "user_href": "/profile/Mike-Poulton-1"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Beadles",
                "href": "/profile/James-Beadles"
            },
            "answer_text": "If by “erase the history” one means removing statues of traitors and racists like Confederate generals, I would argue that removing such statues is not erasing history. Looking at a statue without knowing any context tells you nothing about history. You can learn history by reading, visiting historic places and listening to audios and in person lectures about history. Just because White racists placed, for example, a statue of Robert E. Lee in a prominent location in Richmond, VA in the 1890s does not mean this statue never can be removed. If a VA court finally allows Lee’s statue to be removed, anyone interested in Lee can read any of the hundreds of books available about his life, which sadly ended with him committing treason against his country. As time goes by, new generations will want to honor different people and remove old statues and memorials and replace them with new ones. ",
            "date": "Answered October 24, 2020",
            "views": "219",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Hoy",
                    "user_href": "/profile/Mike-Hoy-30"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                },
                {
                    "user_id": "Spencer Emmons",
                    "user_href": "/profile/Spencer-Emmons-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Hoy",
                "href": "/profile/Mike-Hoy-30"
            },
            "answer_text": "Historical actions and events are sometimes erased from history but, far more commonly, different interpretations are just made about them after time. For example: I don't know anyone who disputes that Christopher Columbus made his voyages of discovery or his interactions with the the native people he encountered. What is controversial is whether those actions were worthy of praise and celebration or shame. Similarly, the celebration of US Confederate leaders by statues and their names being used for military bases and parks. Nobody (like me) who wants them torn down and renamed disputes their actions and place in history. Only that these these traitors, leading the biggest enemy the USA ever had, should be celebrated. No other country in the world raises statues to its enemies. ",
            "date": "Answered October 31, 2020",
            "views": "475",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bruce Patterson",
                    "user_href": "/profile/Bruce-Patterson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaughan Razmikson",
                "href": "/profile/Vaughan-Razmikson"
            },
            "answer_text": "As Ionesco once said “it's not the answer that enlightens but the question” and you asked a good one. Our history is heavily edited to suit the needs of elites based on geopolitical situation of that time and near future. Its so obvious now because of our instant information sharing abilities. Even Napoleon said “History is a set of lies, agreed upon”. Our recent history is bombarded with lies and changed forever with fake history books. The winners write the history. We got to the point that the good is the bad and the other way around. Look at the last world wars, millions of people died and in the end we always believe that the good guy is the one who won and of course the enemies portrayed as bad as possible. The reality is not a movie with happy ending and sometimes it takes the worst possible scenario as the main course. ",
            "date": "Answered October 24, 2020",
            "views": "335",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "Everybody mentioned Napoleon. I will mention Sima Qian - Wikipedia. He was castrated because he refused to throw an innocent man under the bus as ordered by some emperor. In his day, disgraced aristocrats committed suicide. But he chose to live in order to finish his history. He wrote that why is it that a bandit who killed & cannibalized travellers lived to a ripe old age. Yet two virtuous men starved to death during that same famine? The answer is that it is the historians’ job to seek justice for the dead by simply writing down everything that happened and let future readers judge them. ",
            "date": "Answered October 24, 2020",
            "views": "435",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Owen Brown",
                    "user_href": "/profile/Owen-Brown-239"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Walter Libl",
                    "user_href": "/profile/Walter-Libl"
                },
                {
                    "user_id": "Charlie Johnson",
                    "user_href": "/profile/Charlie-Johnson-245"
                },
                {
                    "user_id": "Mark Tarte",
                    "user_href": "/profile/Mark-Tarte"
                },
                {
                    "user_id": "Richard Stanfield",
                    "user_href": "/profile/Richard-Stanfield-1"
                },
                {
                    "user_id": "Shane Wanninger",
                    "user_href": "/profile/Shane-Wanninger"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Jesus Soto Martinez",
                    "user_href": "/profile/Jesus-Soto-Martinez"
                },
                {
                    "user_id": "Rachelle Ballotti",
                    "user_href": "/profile/Rachelle-Ballotti"
                },
                {
                    "user_id": "Keith Allum",
                    "user_href": "/profile/Keith-Allum"
                },
                {
                    "user_id": "Jesse Spangler",
                    "user_href": "/profile/Jesse-Spangler"
                },
                {
                    "user_id": "Kanchana Muralidhar",
                    "user_href": "/profile/Queen-Kanchana-From-India-HEH-Muralidhar"
                },
                {
                    "user_id": "Janie Sheehan",
                    "user_href": "/profile/Janie-Sheehan"
                },
                {
                    "user_id": "Alex Richardson",
                    "user_href": "/profile/Alex-Richardson-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanchana Muralidhar",
                "href": "/profile/Queen-Kanchana-From-India-HEH-Muralidhar"
            },
            "answer_text": "When true history is reflected on global level by me as a global leader with history background, they can't digest the truth but Indian defence forces know better than others. They have taken Tibet now from China. I researched and wrote down but mobile hacking & money greediness is a pain in the neck. I had informed that to Cyberabad Police, etc. ",
            "date": "Answered October 24, 2020",
            "views": "27",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teodor Barsan",
                "href": "/profile/Teodor-Barsan"
            },
            "answer_text": "Because the corporation and media and the elites that rules want to create a fictional identit. It is easier to rule when you create a fictional history, culture Nd identity ",
            "date": "Answered October 24, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Mathews",
                "href": "/profile/Mark-Mathews-75"
            },
            "answer_text": "Only IDIOTS and Fools would try and get rid of our Real History, You never forget so you never repeat the same mistakes over again! Put the real facts in the books being taught. Get the Historical Facts and teach them! So we never repeat them. ",
            "date": "Answered October 24, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hamail Attique",
                    "user_href": "/profile/Hamail-Attique"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Bass",
                "href": "/profile/Brian-Bass-70"
            },
            "answer_text": "Hi, firstly, which country are you referring to? Secondly, you appear to make statements, I think 🤔…and then you lost me. I hope someone else can make head or tail of it? ",
            "date": "Answered October 24, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter"
        }
    ]
}