{
    "title": "Why don't Egyptians wear Ancient Egyptian clothing anymore? - Quora",
    "tags": [
        "History of Egypt",
        "Ancient Egyptians",
        "People of Egypt",
        "Ancient Egypt",
        "Egypt",
        "Fashion and Style"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Balogun",
                "href": "/profile/Alexander-Balogun"
            },
            "answer_text": "Of course they still wear ancient Egyptian clothing. The problem is your attention has always been drawn to the wrong set of people. Majority of the mordern Egyptian population in the Northern region of Egypt are descendants of several foreign occupiers. Their ancestors occupied ancient Egypt from several foreign societies namely: Libyan societies from the Northwestern region, Persians from West Asia, Greeks from Southern Europe, Romans from Southern Europe, Arabs from West Asia, Turks from Asia Minor, Mamluks…. It is important to know that the last indigenous Native Egyptian dominance in Egypt was 1,170 BC when ancient Egypt fell to the Libyans during the reign of Ramses XI. The Libyan migration forced the native Egyptians further South, as they occupied and dominated the Northern region of Egypt.  However in the Southwestern region of Egypt the Bishari people (Beja) are one of the few existing ancient Egyptian ethnic group left. The Beja people are an ancient Cushitic people closely kin to the ancient Egyptians, who have lived in the desert between the Nile river and the Red Sea since at least 25000 BC. Profile of the Beja People of Sudan, Eritrea and Egypt.           ",
            "date": "Answered October 16, 2020",
            "views": "624",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Barts",
                    "user_href": "/profile/Brad-Barts"
                },
                {
                    "user_id": "Olatunji Mwamba",
                    "user_href": "/profile/Olatunji-Mwamba"
                },
                {
                    "user_id": "Michael Davis",
                    "user_href": "/profile/Michael-Davis-592"
                },
                {
                    "user_id": "Martini Henry I",
                    "user_href": "/profile/Martini-Henry-I"
                },
                {
                    "user_id": "Mayowa Gidi",
                    "user_href": "/profile/Mayowa-Gidi-1"
                },
                {
                    "user_id": "Zeina Hany",
                    "user_href": "/profile/Zeina-Hany"
                },
                {
                    "user_id": "Inger",
                    "user_href": "/profile/Inger-7"
                },
                {
                    "user_id": "Bama Radcliff",
                    "user_href": "/profile/Bama-Radcliff"
                },
                {
                    "user_id": "Ghali Lalanne",
                    "user_href": "/profile/Ghali-Lalanne"
                },
                {
                    "user_id": "Marcus DeShown",
                    "user_href": "/profile/Marcus-DeShown"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Ramzy",
                "href": "/profile/Adam-Ramzy-2"
            },
            "answer_text": "It’s an old civilization and it's so hard to maintain customs and traditions from 2050 years ago at least in today’s world. Greece, Mesopotamia, and Rome didn’t for example. Many nations (not just in our region) have changed over time, not just Egypt, and we do still keep some of these traditions btw especially on occasions.      Egyptians celebrate the loyalty of the Nile & Shem E’nsem in the Pharaonic village.   Egyptians celebrate Sham El-Nessim Day, which has roots that extend into the depths of history, as the ancient pharaohs used to celebrate it by going out to parks, fields, and other natural areas to breathe fresh air and enjoy the splendid springtime weather. \"Sham El-Nessim\" is an ancient Egyptian Coptic word that used to pronounce \"Shum Ansim,\" and it is a day that comes on the day following the Coptic New Year and Easter Day. \"Shum Insem\" was one of the feasts of the ancient Egyptians during the reigns of the Pharaohs, and the beginning of its celebration dates back to nearly 5,000 years, or about the year 2700 BC. AD, specifically to the late Third Pharaonic Dynasty. Some historians believe that the celebration of it dates back to the pre-dynastic era. The ancient Egyptians used to engrave on the eggs their prayers and wishes for the new year on this occasion and put the eggs in baskets of palm fronds that they hung in the balconies of houses or in the branches of trees, where it developed with the passage of time and became engraved on the eggs beautiful colors and decorations. ",
            "date": "Answered October 16, 2020",
            "views": "304",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ali Ibrahim",
                    "user_href": "/profile/Ali-Ibrahim-453"
                },
                {
                    "user_id": "Luca Fagioli",
                    "user_href": "/profile/Luca-Fagioli-1"
                },
                {
                    "user_id": "Sabine Schaefer",
                    "user_href": "/profile/Sabine-Schaefer-1"
                },
                {
                    "user_id": "Paul Hayes",
                    "user_href": "/profile/Paul-Hayes-75"
                },
                {
                    "user_id": "Febin Thomas",
                    "user_href": "/profile/Febin-Thomas-7"
                },
                {
                    "user_id": "Ashwin Singh",
                    "user_href": "/profile/Ashwin-Singh-13"
                },
                {
                    "user_id": "Ahmed Mustafa",
                    "user_href": "/profile/Ahmed-Mustafa-31"
                },
                {
                    "user_id": "Hanzo Hashashi",
                    "user_href": "/profile/Hanzo-Hashashi-2"
                },
                {
                    "user_id": "Rami Hosny",
                    "user_href": "/profile/Rami-Hosny"
                }
            ]
        }
    ]
}