{
    "title": "Why do Bengali people call Durga Puja as 'Durga' Pujo, whereas logically it should be 'Durgo' Pujo? - Quora",
    "tags": [
        "Durgā (Hindu Goddess)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ankit Singh",
                "href": "/profile/Ankit-Singh-4734"
            },
            "answer_text": "Meaning of ‘Durga’ : Ok I kind of laughed when I first saw the question. More than the issue with the pronunciation the real problem here is the lack of understanding of the word ‘Durga’. It’s actually an epithet that applies only to the Great Goddess Devi and Devi only. What does ‘Durga’ literally mean? Literally it means ‘inaccessible’ but essentially it describes Devi Maa’s iconic attribute of ‘INVINCIBILITY’. She Who cannot be defeated. It’s true. Unlike other deities, Devi Shakti has never lost a fight. Being the Supreme Brahmand and housing the Para Shakti within Herself, She’s victory personified. Provenance of the name ‘Durga’: Now when was the first time She ever came to be known as ‘Durga’? The answer lies in the 28th Chapter of the 7th Canto of Srimad Devi Bhagavatam. The chapter vividly narrates Devi Maa’s Shatakshi and Shakambhari avatars, in which She destroys the strongest asura ever, Durgamasur after massacaring his huge army of 1000 Aksauhini (An Aksauhini consists of 21,870 elephants, 21,870 chariots, 65,610 horses and 1,09350 foot soldiers). So at the end of this epic fight, Devi Durga’s actual kill figure including Durgamasur stands at a mind boggling 21,87,00001. Makes me proud as Her child. Tasya Tejas-Tu Nirgatya Devii-Ruupe Vivesha Ha |Hate Tasmin-Mahaa-Viirye Shaantamaasiij-Jagat-Trayam ||67||Tato Brahmaadayah Sarve Tussttuvur-Jagad-Ambikaam |Puraskrtya Hari-Ishaanau Bhaktyaa Gadgadayaa Giraa ||68|| Meaning:67.1: Then his Spirit came out in the form of light and merged with the form of Devi,67.2: The Powerful Mighty demon being Killed, Peace prevailed in the Three Worlds,68.1: Then Sri Brahma and all other Devas started Eulogizing the Jagadambika,68.2: Standing in Front of the Devi, Who is the Bearer and Ruler of all, they Praised Her with great Devotion and voice choked with Emotion. The Devas and sages thus saved by Her (like at so many other times) sang a beautiful hymn to Her :- Devaa UucuhJagad-Bhrama-Vivartai[a-E]ka-Kaaranne Parame[a-Ii]shvari |Namah Shaakambhari Shive Namaste Shata-Locane ||69||Sarvo[a-U]panissad-Udghusstte Durgama-Asura-Naashini |Namo Maahe[a-Ii]shvari Shive-Kosha-Antara-Sthite ||70|| Meaning: The Devas said:69.1: O Parameshwari, You are the One Cause behind the Delusions and Transformations in the World,69.2: Salutations to the Auspicious Shakambhari, Salutations to the One with Hundred Eyes (Shatakshi),70.1: Salutations to the One Who is Proclaimed by all the Upanishads and Who is the destroyer of Durgamasura,70.2: Salutations to the Auspicious Maheshwari Who Abides in the Interior of the Five Koshas (i.e. the five sheaths of the body). Cetasaa Nir-Vikalpena Yaam Dhyaayamti Muni-[I]ishvaraah |Prannavaartha-Svaruupaam Taam Bhajaamo Bhuvane[a-Ii]shvariim ||71||Ananta-Kotti-Brahmaanndda-Jananiim Divya-Vigrahaam |Brahma-Vissnnv[u]-Aadi-Jananiim Sarva-Bhaavair-Nataa Vayam ||72|| Meaning:71.1: Salutations to Her, Who is the Consciousness which is free from Change (Nirvikalpa), and Who is Meditated upon by the Great Sages,71.2: Salutations to Her Who is the Embodiment of Pranava (Om); We Worship the Bhuvaneshwari (the Goddess of the Universe),72.1: Salutations to Her, Who is the Mother of innumerable Millions of Brahmandas (Universes), and Who has a Divine Form,72.2: Salutations to Her Who is the Mother of Sri Brahma, Sri Vishnu and Others, and to Whom all Bhavas (Devotional Feelings) Bow down. Kah Kuryaat-Paamaraan-Drssttvaa Rodanam Sakale[a-Ii]shvarah |Sadayaam Parame[a-Ii]shaaniim Shataakssiim Maataram Vinaa ||73|| Vyaasa UvaacaIti Stutaa Surair-Devii Brahma-Vissnnav[u]-Aadibhir-Varaih |Puujitaa Vividhair-Dravyaih Santussttaa-Abhu-Ucca Tat-Kssanne ||74|| Meaning:73.1: Who else will Cry looking at the distress of even the Fallen, O Goddess of All, ...73.2: ... apart from the Merciful Supreme Mother Goddess Shatakshi? Vyasa said:74.1: Thus when the great Brahma, Vishnu and other Devas Praised the Devi, ...74.2: ... and Worshipped Her with various materials, She became highly Pleased, immediately. Devi Maa, pleased with the prayers addressed the Devas:- Prasannaa Saa Tadaa-Devii Vedaan-Aahrtya Saa Dadau |Braahmannebhyo Vishessanna Pro[a-U]vaaca Pika-Bhaassinnii ||75||Mame[a-I]yam Tanur-Utkrssttaa Paalaniiyaa Vishessatah |Yayaa Vinaa-[A]nartha Eva Jaato Drsstto[a-A]dhunai[a-E]va Hi ||76|| Meaning:75.1: Then the Devi, Graciously Pleased, brought back the Vedas and gave it to them,75.2: She then, the Cuckoo-voiced one, specially addressed the Brahmins,76.1: The Vedas are like the Superior parts of My Body, so take Special Care of them,76.2: Without Her (i.e. the Vedas), what Calamity can arise, you have seen just now. Puujya-Aham Sarvadaa Sevyaa Yussmaabhi Sarvada-Eva |Naata Parataram Kimcit-Kalyaannaayo[a-U]padishyate ||77||Patthaniiyam Mamai[a-E]taddhi Maahaatmyam Sarvado[a-U]ttamam |Tena Tussttaa Bhavissyaami Harissyaami Tatha-Apada ||78|| Meaning:77.1: Worship Me always, and Serve Me always, all of You in this manner,77.2: There is nothing greater in bestowing Good Fortune than this Instruction,78.1: Read this, My Mahatmyam, always, which is most Excellent,78.2: By It, I will become Pleased and Manifest and take away your Misfortunes in this manner. Durgam-Aasura-Hantriim-Tvaad-Durge[a-I]ti Mama Naama Yah |Grhnnaati Ca Shata-Akssi-Iti Maayaam Bhittvaa Vrajaty[i]-Asau ||79||Kim-Uktena-Atra Bahunaa Saaram Vakssyaami Tattvatah |Samsevya-Aham Sadaa Devaa Sarvairati Sura-Asuraih ||80|| Meaning:79.1: He Who takes My Name \"Durga\", which is given because I slayed Asura Durgama, ...79.2: ... and My Name \"Shatakshi\", which is given because I manifested Hundred Eyes, will Pierce through My Maya, and Walk Free,80.1: With what utterances can I Speak about the Real Essence (of Me) behind the Multiplicity, ...80.2: ... (Know that) I am the only God (being the essence underlying everything) Who is always Worshipped by the Suras (Devas) and the Asuras (Demons). If you are still reading, then by now it should be clear where and how Devi Maa got Her name ‘Durga’. So I guess it’s as clear as daylight that ‘Durga’ and ‘Durgo’ are completely different words. Why would we call Durga Devi a fort???? Durgo Pujo = Fort worship. ROFL. As much as it’s implied that She stands like an impregnable fortress in the path of evil that doesn’t mean that ‘Durga’ is synonymous with ‘Durgo’ (Fort). How do you say Durgo in Hindi? It’s Durg. Not Durga. How do you say Durg in Bengali? It’s Durgo, not Durga. Durga is Durga, Devi Durga, Maa Durga, not Durgo. Bottomline :- THE QUESTION OF PRONUNCIATION IS NOT EVEN THE ISSUE HERE. If it was supposed to be about pronunciation then the question should have been like this (and a dumb one at that) :- “Why do North Indians call ‘Durga’ as ‘Durge’?” How about we have an answer to that now? Lol. Jai Maa Durga  ",
            "date": "Answered August 26, 2016",
            "views": "35",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Micky DMary",
                    "user_href": "/profile/Micky-DMary"
                },
                {
                    "user_id": "Adrija Karak",
                    "user_href": "/profile/Adrija-Karak-2"
                },
                {
                    "user_id": "Sunâynâ Ghôse",
                    "user_href": "/profile/Sunâynâ-Ghôse"
                },
                {
                    "user_id": "Deepangshu Dasgupta",
                    "user_href": "/profile/Deepangshu-Dasgupta-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ARKA-29"
                },
                {
                    "user_id": "Madhura Mazumdar",
                    "user_href": "/profile/Madhura-Mazumdar-1"
                },
                {
                    "user_id": "Sabari Karmakar",
                    "user_href": "/profile/Sabari-Karmakar"
                },
                {
                    "user_id": "Vik Rams",
                    "user_href": "/profile/Vik-Rams"
                },
                {
                    "user_id": "Ben Meads",
                    "user_href": "/profile/Ben-Meads"
                },
                {
                    "user_id": "Ritika Goyal",
                    "user_href": "/profile/Ritika-Goyal-41"
                }
            ]
        }
    ]
}