{
    "title": "Why do you think Admiral Byrd went to the South Pole? - Quora",
    "tags": [
        "Antarctic Expeditions",
        "South Pole",
        "North Pole",
        "Antarctica",
        "Conspiracy Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Miya",
                "href": "/profile/Eugene-Miya"
            },
            "answer_text": "Which trip? He flew there a number of times, landed later in life, did work in other parts of the Antarctic. This was why he was made an Admiral. First, he was an explorer. That was in the final part of the major period of colonization/exploration of the USA. That’s when the US started establishing permanent bases in part for the Cold War and to show up even our WW2 and pre-WW1 Allies. He could not beat Amundsen or Scott (who stupidly and idealistically (be warned of idealists) died). He could not claim nor was able to landing at North Pole. It’s over water. Now some dispute Byrd flying over the N. Pole for various reasons. That’s not the official US position, but it’s not quite worth defending too much, because it’s water not land. When you think about how stupid some of the other countries have been about the Antarctic, establishing the South Pole Station and naming it after Amundsen and Scott was a brilliant stroke for the time (neither Americans). It was a period of land conquest. It was not a single event but a series of events staged over time for various world threats/competition. Why do you have to ask? Can I sell you a Bridge? ",
            "date": "Answered June 8, 2018",
            "views": "177",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Benjamin Alexander De Mers",
                    "user_href": "/profile/Benjamin-Alexander-De-Mers"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Christian Hansen",
                "href": "/profile/Eric-Christian-Hansen"
            },
            "answer_text": "He did go to the South Pole in 1947 (same year as Roswell, New Mexico UFO incident), but only as a cover story to escape the mass media. He then flew his plane to the North Pole where he met the “Guardians of the Planet”, an advanced civilization of peoples within the center of the hollow earth, who told Byrd to tell the world to stop using Nuclear Atomic bombs or else we will destroy ourselves. I believe Byrd went on to inspire the famous song “We Are The World”  There comes a timeWhen we heed a certain callWhen the world must come together as oneThere are people dyingOh, and it's time to lend a hand to lifeThe greatest gift of all We can't go onPretending day-by-dayThat someone, somewhere soon make a changeWe're all a part of God's great big familyAnd the truth, you know, love is all we need We are the worldWe are the childrenWe are the ones who make a brighter day, so let's start givingThere's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me Oh, send them your heartSo they know that someone caresAnd their lives will be stronger and freeAs God has shown us by turning stones to breadAnd so we all must lend a helping hand We are the worldWe are the childrenWe are the ones who make a brighter day, so let's start givingOh, there's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me When you're down and out, there seems no hope at allBut if you just believe there's no way we can fallWell, well, well, well let us realizeOh, that a change can only comeWhen we stand together as one, yeah, yeah, yeah We are the worldWe are the childrenWe are the ones who make a brighter day, so let's start givingThere's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me We are the worldWe are the childrenWe are the ones who make a brighter day, so let's start givingThere's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and mee We are the world (are the world)We are the children (are the children)We are the ones who'll make a brighter day, so let's start giving (so let's start giving)There is a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me Oh, let me hear you! We are the world (we are the world)We are the children (said we are the children)We are the ones who'll make a brighter day so let start giving (so let's start giving) There's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me, come on now, let me hear you We are the world (we are the world)We are the children (we are the children)We are the ones who'll make a brighter day so let's start giving (so let's start giving)There's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me, yeah We are the world (we are the world)We are the children (we are the children)We are the ones who'll make a brighter day so let's start giving (so let's start giving) There's a choice we're makingAnd we're saving our own livesIt's true we'll make a better day, just you and me We are the world (are the world)We are the children (are the children)We are the ones who'll make a brighter day so let's start giving (so let's start giving) There's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me We are the world, we are the world (are the world)We are the children, yes sir (are the children)We are the ones that make a brighter day so let's start giving (so let's start giving) There's a choice we're makingWe're saving our own livesIt's true we'll make a better day, just you and me, ooh-hoo! We are the world (dear God) (are the world)We are the children (are the children)We are the ones that make a brighter day so let's start giving (all right, can you hear what I'm saying?)There's a choice we're making, we're saving our own lives Songwriters: Michael Jackson / Lionel Richie We Are the World lyrics © Sony/ATV Music Publishing LLC, Warner/Chappell Music, Inc ",
            "date": "Answered March 12, 2019",
            "views": "70",
            "upvotes": "0"
        }
    ]
}