{
    "title": "Why is communism regarded as a horrible thing? - Quora",
    "tags": [
        "Communism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Finnegan",
                "href": "/profile/Alexander-Finnegan"
            },
            "answer_text": "Consider a system where: Homelessness is abundant.People are constantly at each other’s throats for the scraps remaining of wealth available.It spends a massive portion of its GDP on military expenditures, consuming resources while the nation itself has crumbling bridges, schools, roads, and non drinkable water.There is prison slave labor.The police can kill anyone and be exonerated 96% of the time.The government can seize your private property, even for the benefit of a small group of investors, and your only recourse is to accept monetary payment.Where historical genocide and slavery were merely considered “mistakes,” and non intrinsic to the system itself.Where the leader can order the death of anyone outside the borders of the nation, even citizens, without judicial oversight.Engages in torture with no liability to its leaders.Engages in arbitrary and indefinite detention.It charges journalists who expose these abuses with espionage.Invades other nations to procure oil resources, natural resources, and topple governments which try to use the natural resources of the nation for its own citizens, and installs right wing puppet dictators that are easily controlled.Orders sanctions against other nations, deliberately doing so to starve the civilian population into revolt.Had a history of apartheid based on race.Where criminal defendants are convicted over 99.8% of the time.[1] Quality of legal defense is based on wealth. So white collar criminals that embezzle millions of dollars and engage in fraud are not charged with crimes.Doesn’t provide equal pay for women, paid maternity leave, paid vacations, doesn’t have universal healthcare, college is unaffordable, and housing and daycare are so expensive people must work 2 jobs to survive.What communist nation is this? It’s not. It is the capitalist nation of the United States.        Footnotes[1] United States Conviction Stats and Federal Conviction Rate",
            "date": "Answered August 8, 2019",
            "views": "72",
            "upvotes": " View 150 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gurnaj Virk",
                    "user_href": "/profile/Gurnaj-Virk"
                },
                {
                    "user_id": "Nicole Benson",
                    "user_href": "/profile/Nicole-Benson-60"
                },
                {
                    "user_id": "Luke Wong",
                    "user_href": "/profile/Luke-Wong-60"
                },
                {
                    "user_id": "Yaroslav Rybalko",
                    "user_href": "/profile/Yaroslav-Rybalko"
                },
                {
                    "user_id": "Matt Bartley",
                    "user_href": "/profile/Matt-Bartley-9"
                },
                {
                    "user_id": "Jacquelyn Harper",
                    "user_href": "/profile/Jacquelyn-Harper-2"
                },
                {
                    "user_id": "Dan Sunderland",
                    "user_href": "/profile/Dan-Sunderland-10"
                },
                {
                    "user_id": "Jayasurya",
                    "user_href": "/profile/Jayasurya"
                },
                {
                    "user_id": "Man-Ho Tan",
                    "user_href": "/profile/Man-Ho-Tan-1"
                },
                {
                    "user_id": "Vladimir Boris",
                    "user_href": "/profile/Vladimir-Boris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phanes Erichthoneus",
                "href": "/profile/Phanes-Erichthoneus"
            },
            "answer_text": "Well, let’s look at the dictionary definition of a couple of words: communism - 1 any economic theory or system based on the ownership of all property by the community as a whole. communism - 2 [often C-] a) a hypothetical stage of socialism, as formulated by Marx, Engels, Lenin, and others, to be characterized by a classless and stateless society and the equal distribution of economic goods, and to be achieved by revolutionary and dictatorial, rather than gradualistic means. b) the form of government of various, esp. former, socialist states which profess to be working toward this stage by means of state planning and control of the economy, a one-party political structure, and an emphasis on the requirements of the state rather than on individual liberties. socialism - any of various theories or systems of the ownership and operation of the means of production and distribution by society or the community rather than by private individuals, with all members of society or the community sharing in the work and the products. *All definitions are from Webster’s New World College Dictionary, Fourth Edition ©2005.  The first definition of communism actually sound quite delightful. The second definition of communism sounds like a nightmare. As far as I know, the only communism that has ever been tried is the second version: the one with a lunatic running the show. And I figured we might as well cover socialism, too. It actually sound quite delightful, too. The people own the means of production and distribution; we all share in the work and the products. How lovely. I would say that the second version of communism is going to be quite evil. The first definition is not evil. The first definition of communism and the definition of socialism are similar enough for me to feel comfortable calling them basically the same thing because under the first sense of communism, if the community owns all property, they naturally also own the means of production and distribution. So imagine a world that’s under the first sense of communism or socialism. When thinking about these things, people often put the cart before the horse. They want to envision what kind of world they want to live in rather than thinking realistically about the kind of work people actually want to do. For example, people might like going to eat at McDonald’s, but nobody wants to work there. In that case, we just wouldn’t have McDonald’s. If you tried to force McDonald’s to exist when nobody wants to work there, you would have to force people to work there. In that case, you’d start moving into the second version of communism, which is the one ruled by a totalitarian dictator. So if nobody wanted to work at any fast-food joint, we wouldn’t have fast-food joints. If nobody wanted to work in restaurants, we wouldn’t have restaurants. Fortunately, there are people who seem to enjoy working with food in creative ways. Perhaps a pure socialist society would have restaurants, but they would be good restaurants because the people who run it are passionate about food; they aren’t just going there begrudgingly because it was the only job they could find. The comes the inevitable question: who’s going to scrub the toilets and pick up the trash? Nobody wants to do that. Nobody is passionate about trash collection and scrubbing dirty toilets. Well, that’s true. To solve this problem, this hypothetical and idealistic socialist/communist society could have a branch of the service administrated in a way that’s similar to the military. After high school, citizens could voluntarily join this “service” for a contracted period of time, during which they would do the “dirty work”, while at the same time, receiving a state-of-the-art college education in the field of their choice. And they would be paid for this as well. They would be taught by professors who love teaching. Of course, in a socialist/communist society, all education would be free anyway, so those who volunteer for community service would automatically receive extra perks. I’m not sure what those perks would be in a society in which you can have almost anything material that you want, but surely there must be something extra for those who are willing to do dirty work for extra rewards. And with that said, nowadays we’re getting close to a time when we could see robots taking over a lot of the dirty work, so it’s even possible for a future socialist society to not even have to worry about having people collect trash. Instead, people who love playing with robots can simply maintain a fleet of them for trash collection purposes. The community service or robotic concept can apply to other areas as well, like crop harvesting or working in warehouses collecting items to be delivered to people who ordered them. And just because it’s a community service doesn’t mean it has to be long, grueling hours. With enough people, it could just be a few hours a day because time is needed for studies and leisure. The only way for true socialism or communism to work is to pretty much have most people on board with it. The people who probably wouldn’t be on board with it are the filthy rich capitalists of today, specifically the ones who don’t do anything productive with their time or their bodies because they sustain themselves by simply throwing money around and getting a return on it, then spending that money in places where the rest of us work to serve them. I’ve sometimes wondered if the brutal communist leaders of the past were super-secret capitalist impostors trying to demonstrate communism in the most horrible ways possible as proof to the world that it not only doesn’t work, but the person coordinating the whole thing will inevitably be a monster. Such a scheme would certainly benefit capitalists and protect their lavish lifestyles. Probably it wasn’t like that, but the thought crossed my mind. Unadulterated communism is not evil. Administrators of communism who use brutal methods to enforce policies that benefit the state are simply evil people. Communism itself is innocent and the communist system is as much of a victim as the people who were brutalized in its depraved implementation. Communism implemented by evil people as a benefit to the state is the polar opposite of communism in which the community itself shares in the ownership of property. One is evil, the other isn’t. ",
            "date": "Answered June 3, 2019",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kayla",
                    "user_href": "/profile/Kayla-1747"
                },
                {
                    "user_id": "Vanessa Casiano",
                    "user_href": "/profile/Vanessa-Casiano"
                },
                {
                    "user_id": "Man-Ho Tan",
                    "user_href": "/profile/Man-Ho-Tan-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-46075"
                },
                {
                    "user_id": "Morgan Jeffrey",
                    "user_href": "/profile/Morgan-Jeffrey-3"
                },
                {
                    "user_id": "Bisma Joyosumarto",
                    "user_href": "/profile/Bisma-Joyosumarto"
                },
                {
                    "user_id": "Nidaul Haq",
                    "user_href": "/profile/Nidaul-Haq"
                }
            ]
        }
    ]
}