{
    "title": "Why is electricity invented? For what invention was it used first? - Quora",
    "tags": [
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Kumar Subramanian",
                "href": "/profile/Krishna-Kumar-Subramanian"
            },
            "answer_text": "There is no answer to your first question; it perhaps explains why India is so technologically backward. Something good was invented, and instead of celebrating and wondering how, you are wondering “why”! Yeah, sure. Why not remain in the dark ages? It was so comfortable then! There is NO scientific curiosity. As for the second, it was first successfully used as a viable business for home lighting, replacing lamps fueled by various kinds of oils.   Amazingly, a few bold minds were eager and able to imagine electricity—to see the unseen. None was more important than Philadelphia’s Benjamin Franklin, who allowed the world to “see” electricity one day in June 1752 by flying his kite in the midst of a storm (at least, that is what Americans like to believe). Because of the obvious danger, doubts persist to this day whether Franklin actually flew his kite in a storm, but there is no reason to doubt that he conducted his kite experiment, perhaps in less dramatic weather. Benjamin Franklin and his kite represent only the first step in a fascinating journey from an era when life with electricity was barely imagined by a few to a time in which life without electricity was unimaginable for most. That journey was powered by the bold actions of many famous (and some infamous) figures who were sometimes propelled forward, and as often pushed back, by the demands and mores of their times. These innovators built the powerful, pervasive electric infrastructure on which everyone in the developed world now depends. The first cornerstone of that infrastructure was remarkable scientific advances made by Benjamin Franklin, Michael Faraday, James Clerk Maxwell, Nikola Tesla, and Albert Einstein. Indeed, Einstein believed that the discovery of electricity was not just a stop along the path to modern physics, it was the path itself. Man’s understanding of electricity led to many of the major breakthroughs in all of physics. The second cornerstone was the technology based on this great science. Samuel Morse’s telegraph was the first fruit of the hard-won scientific knowledge linking electricity and magnetism. The fact that the purpose of the telegraph was for communication is significant. The electricity business and the telecommunications business were born of the same science, and yet the latter has far outpaced the former in technological advances in modern times. ",
            "date": "Answered January 19, 2019",
            "views": "397",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vaidyaa Panneerselvam",
                    "user_href": "/profile/Vaidyaa-Panneerselvam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hitul Agarwwal",
                "href": "/profile/Hitul-Agarwwal"
            },
            "answer_text": "Electricity is a form of energy and it occurs in nature, so it was not “invented.” As to who discovered it, many misconceptions abound. Some give credit to Benjamin Franklin for discovering electricity, but his experiments only helped establish the connection between lightning and electricity, nothing more Electricity is a form of energy and it occurs in nature, so it was not “invented.” As to who discovered it, many misconceptions abound. Some give credit to Benjamin Franklin for discovering electricity, but his experiments only helped establish the connection between lightning and electricity, nothing more. The truth about the discovery of electricity is a bit more complex than a man flying his kite. It actually goes back more than two thousand years. In about 600 BC, the Ancient Greeks discovered that rubbing fur on amber (fossilized tree resin) caused an attraction between the two – and so what the Greeks discovered was actually static electricity. Additionally, researchers and archeologists in the 1930’s discovered pots with sheets of copper inside that they believe may have been ancient batteries meant to produce light at ancient Roman sites. Similar devices were found in archeological digs near Baghdad meaning ancient Persians may have also used an early form of batteries But by the 17th century, many electricity-related discoveries had been made, such as the invention of an early electrostatic generator, the differentiation between positive and negative currents, and the classification of materials as conductors or insulators ",
            "date": "Answered January 25, 2019",
            "views": "96",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Svend Saustrup",
                    "user_href": "/profile/Svend-Saustrup"
                }
            ]
        }
    ]
}