{
    "title": "Why is there such a huge divide between Bedouins and Haadar in Kuwait? - Quora",
    "tags": [
        "Bedouins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abdulaziz Al Meajel",
                "href": "/profile/Abdulaziz-Al-Meajel"
            },
            "answer_text": "I would not call it a huge divide, however it is a social difference and division. This division between the urban population Hadhar and the nomadic population Bedu or Bedouin goes back to the early days of the Arabs. However in Kuwait, there was always a difference between those who lived within the walls of Kuwait, who had that Kuwaiti identity and whose national identity was stronger than tribal background or ethnic origin, and those who lived outside of it, whose identity belonged to tribe alone. However, there are Bedouins who were urban like the Awazem and there were also certain sections of other tribes who lived in the Kuwaiti desert and who owed their alleigance to the Kuwaiti Emir and would constantly come into the city to trade. Those Bedouins are also seen differently than those who came later, in the sense that those were the original Kuwaiti Bedouins. Bedouins also have different accents to the Hathar, and tend to marry within the tribe. We have different social regulations on marriage and intermarriage, and slightly different customs. We also sometimes make jokes about eachother, but its not really a divide. We’re all Kuwaitis in the end. What Kuwaitis of all social backgrounds have issue with is the forging of citizenship in many cases of people primarily from Saudi Arabia, Iraq, and Syria who tend to be of Bedouin background and give money to a person from Kuwait for instance to sign them up as one of their children. This was able to be done before because of terrible regulation, however now is being cracked down upon by the state. ",
            "date": "Answered August 28, 2017",
            "views": "15",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alok Srivastava",
                    "user_href": "/profile/Alok-Srivastava-55"
                },
                {
                    "user_id": "Ali Juma",
                    "user_href": "/profile/Ali-Juma-3"
                },
                {
                    "user_id": "Ziad Radwan",
                    "user_href": "/profile/Ziad-Radwan-2"
                },
                {
                    "user_id": "Khaled Omar",
                    "user_href": "/profile/Khaled-Omar-31"
                },
                {
                    "user_id": "Murtaza Captain",
                    "user_href": "/profile/Murtaza-Captain"
                },
                {
                    "user_id": "Osama Albayti",
                    "user_href": "/profile/Osama-Albayti"
                },
                {
                    "user_id": "Sandeep Mehta",
                    "user_href": "/profile/Sandeep-Mehta-77"
                },
                {
                    "user_id": "Mohammed Kalam",
                    "user_href": "/profile/Mohammed-Kalam-1"
                },
                {
                    "user_id": "David Pfeiffer",
                    "user_href": "/profile/David-Pfeiffer-4"
                },
                {
                    "user_id": "Asad Pervez",
                    "user_href": "/profile/Asad-Pervez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaikha Nasser AlOthman",
                "href": "/profile/Shaikha-Nasser-AlOthman"
            },
            "answer_text": "There isn't. Subtle cultural differences still exist between Bedouins and non-bedouins. But they are subtle. These cultural differences go back to the ancestry/history of these groups. I am not an expert on ancestry. But in our Kuwait today the bedouins and the hadar co-habitate the country throughout all government/private sectors: schools, universities, workplaces. This is the dominant reality at least. There isn't a huge cultural divide! ",
            "date": "Answered August 28, 2017",
            "views": "277",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdulaziz Al Meajel",
                    "user_href": "/profile/Abdulaziz-Al-Meajel"
                }
            ]
        }
    ]
}