{
    "title": "Why do people have middle names? - Quora",
    "tags": [
        "Names and Naming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elora Flynn",
                "href": "/profile/Elora-Flynn"
            },
            "answer_text": "Why do we need a middle name? Having middle names allows us to differentiate between people who have the same or very similar names and potentially live in the same town or district. This was particularly an issue in times past when single names would comprise more than 5% of the children of that sex born in a particular year, and in some years almost 30% of children were given one of five names. The chance of someone having the exact same given name as you was pretty high. At this point, if someone is looking for “John” in London, how are they to specify which John they are looking for? They could say “red haired John” or “John, son of David” or “John, the cartwright”, which is how we acquired surnames – e.g. John Rufus, John Davidson, or John Cartwright. Surnames eventually stuck however, and were passed down families.  Joseph P. Kennedy, Rose Fitzgerald Kennedy and their children (c. 1931) Now if we look to common family naming patterns, we find that for quite a long time tradition dictated that the first born son was named for the father’s father, the first daughter after the mother’s mother, the second son after the mother’s father and the second daughter after the father’s mother, and thereafter named for siblings, great-grandparents, godparents and other significant people in the lives of the family. This convention means that in a family with 10 children, five sons and five daughters, the sons will grow up to carry their father’s surname, and will likely pass both the surname and their father’s given name on to their sons. That means potentially 5 boys in the same generation being named with the same given name and having the same surname. Repeat that over a few generations and you end up with the same problem we had at the start of this answer, but now they all have the same surname as well. With population movement being relatively limited back then, it was also quite likely that you would live in the same general area as all of these people who shared your name.  Queen Victoria, with her 9 children, 6 children-in-law and 23 of 42 grandchildren Now we needed a different way of differentiate people with the same given names and surname, what could we do? Well we started to give children more unique monikers, of course! John David Smith, named after his father and grandfather. John Daniel Smith named after his father and grandfather. John Gilroy Smith, who took his mother’s maiden name as his middle name. Some families take this to the extreme, either naming the eldest son after the father generation after generation, and having to resort to numbering themselves to tell themselves apart (John David Smith Sr, John David Smith Jr, John David Smith III, IV, V), while others take it to a different extreme, giving their children many given names, sometimes up to 7 or 8 different names and honouring as many people as possible (for example, the widely recognisable lady pictured below). Many of these naming patterns are evident for example in the Kennedy family who name successive generations after the previous ones, or among the children and grandchildren of Queen Victoria and Prince Albert of which a great number included Victoria or Victor as one of their given names. It doesn’t guarantee that the person’s names will be unique to them, but it is a little less likely that two men living in the same suburb would have the exact same name.  Victoria Mary Augusta Louise Olga Pauline Claudine Agnes, known as Mary of Teck, a.k.a. Queen Mary, consort to George V of the United Kingdom Of course, most of us don’t go to quite that amount of extravagance when naming our children, so you still have a few John D. Smiths to search through. That is how we ended up with other forms of identification such as social security numbers, tax file numbers, medicare numbers, licensing numbers and so on. ",
            "date": "Answered November 17, 2019",
            "views": "501",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellie",
                    "user_href": "/profile/Ellie-1130"
                },
                {
                    "user_id": "Claire Dixon",
                    "user_href": "/profile/Claire-Dixon-65"
                },
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Sanderford",
                "href": "/profile/Christina-Sanderford"
            },
            "answer_text": "I don't have an actual answer of how or why they originated, but I have a few guesses of what they are for. Some people like going by their 1st and middle name. Lara Jean, Bobby Ray, Mary Jane, Sara Lynn, etc2. It can be a backup name in case they don’t want to go by their first. Especially starting in middle school teachers ask “is that what you want to go by?” And some choose their middle name. It can be heart breaking to a parent that the kid doesn't like their first name, but think of the middle name as an alternative name you would've named them. You get 2 chances at picking a name they like and they get options. Win win. 3. They might like their first name just fine but what if it's popular? Ex. I had another Christina in my class at one point and she went by her middle name so we didn't get mixed up. Sure my name isn't the most popular like: Sara, Madison, Mackenzie, Olivia, Sofia, etc but if it can happen to my name it can happen to anyone. Again this gives your child the option to keep their first or go by their middle name. 4. Scare factor. I choose not to use my middle name, it's mostly just for paperwork, but I know whenever my mother uses it I'm in trouble. Something about using the whole entire name that just works when disciplining (at least on me it did). Again I don't know the real reason of why they are a thing, but giving them options and using it to discipline seems to be enough reason for me. ",
            "date": "Answered March 23, 2020",
            "views": "149",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ShreyShrey"
                },
                {
                    "user_id": "Claire Dixon",
                    "user_href": "/profile/Claire-Dixon-65"
                }
            ]
        }
    ]
}