{
    "title": "Why haven't any other game companies attempted to make an RPG comparable to Bethesda's Elder Scrolls and Fallout Games? - Quora",
    "tags": [
        "The Elder Scrolls (video game series)",
        "Role-playing Video Games",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Addair",
                "href": "/profile/Travis-Addair"
            },
            "answer_text": "There aren’t a lot of companies that make games like those in The Elder Scrolls series because those games are incredibly big, incredibly complicated, and it’s not clear the added cost of all that is paid back in higher sales. Allow me to explain in more detail. Many gamers, including many of those answering here, make the mistake of saying “The Elder Scrolls is an RPG, there are many great RPGs, therefore The Elder Scrolls series should be judged by those standards”. But having RPG mechanics isn’t what made Skyrim such an endearing game that’s still played and talked about today, 6 years after its release. Unlike The Witcher, Dragon Age, Dark Souls, and every other RPG in recent memory, The Elder Scrolls games are first and foremost Immersive Simulations, not RPGs. The thing about immersive sims is they’re incredibly complex to make, and making one into a big open world experience as Bethesda has is practically unheard of. I would argue that Deus Ex or Dishonored are closer cousins to The Elder Scrolls than The Witcher or Dragon Age. But the thing about Deus Ex and Bioshock is they’re still mostly linear games, not huge open worlds. You’re taking two of the most difficult to engineer genres (immersive sim, open world RPG) and mashing them together into a single product. How could that not be a tremendous feat? So, what makes an immersive sim different from an RPG? It comes down to two things: Open-ended mechanicsEmergent experiencesOpen-Ended Mechanics Think about how you complete quests in an RPG. Let’s stick with our examples above. In The Witcher 3, you use your Witcher senses, you fight monsters with swords and spells, and you talk to NPCs. The time and place for each of these is prescribed, there’s little wriggle room to stray outside the “script”. In Dragon Age, you queue actions for different members of your party to fight, and talk to NPCs. In Dark Souls, you use finely tuned combat mechanics to slay monsters. Contrast this with The Elder Scrolls, where the manner in which you complete quests is usually very open-ended. You can use brute force, sure. But you can also use stealth. Or you can use the environment. Or you can lure your enemies to the nearest town and let the guards kill them. Or you can use necromancy to let them kill each other. Point is: instead of prescribing the solution to the problem, the game is setup to allow you to use all the myriad tools at your disposal to discover your solution to the problem. Emergent Experiences In other words, exciting things happen in the game not because the game designers rigged them to happen, but because complex systems are interacting. This is natural consequence of having open-ended mechanics in a reactive, consistent environment. Think about the craziest thing that happened in a normal RPG. Probably a glitch of some kind, maybe Roach got stuck on a roof, etc. Now think about all the crazy stuff that happens to people in Skyrim every day, by design. That’s what keeps people coming back all these years later. Not the skill trees, or the quests, or the NPCs, or the combat; all of which are pretty vanilla by today’s standards. But what games like Skyrim have that others don’t are those truly unique moments that stick with you long after you’ve put down the controller. Conclusion By now I hope it’s clear that the biggest reason more companies don’t try to make RPGs comparable to Skyrim is that the cost is just prohibitive. Bethesda Game Studios is in a rather unique position where they’ve already invested the time and money into creating the toolchain needed to make these games, but who else is willing to pay such a huge upfront cost? It’s a lot easier to make a conventional RPG and forego the immersive sim elements, and a lot more profitable. Here’s a quote from the Wikipedia page on the subject of low sales and high cost[1]: While the immersive sim genre is well-received critically, their sales have been varying. The original Deus Ex sold more than 500,000 units (at the time, a respectable number), but its immediate sequels, Deus Ex: Invisible War, was considered a commercial failure. More recently, while Deus Ex: Human Revolution sold more than 2.1 million copies within a month of its release, its sequel Deus Ex: Mankind Divided had not yet cleared one million in sales a year after its release. Dishonored 2 also did not see similar sales uptake as the original Dishonored. While Jody Macgregor of PC Gamer noted that there are other factors contributing towards lower sales, including other competing games, and changes in a sequel's marketing and approach, they noted that immersive sims require more commitment from the player to invest and learn the game's complex interacting systems in contrast to other types of games built around simpler mechanics, making immersive sims harder to sell. Jordan Thomas, a developer on Thief and the BioShock games, also said that immersive sims very difficult to be build [sic] by groups other than large teams due to the complexity of such games, making contributions from indie games unlikely. Arkane's Harvey Smith believed that while these recent sales trends for immersive sims are disappointing, there will always be a market for them, but there will be a need to balance the cost of development to lower sales numbers. Smith attributes the lower sales of more recent games to the general trend of players favoring fast-paced action games with strong multiplayer components, with publishers being wary of games without such elements. Immersive sims by nature tend to be single-player experience requiring thought-out approaches, but Smith believes that the genre will adapt to these player preferences in the future, particularly from indie game development. Personally, I love immersive sims more than any other genre of game, so here are a few that aren’t open world like The Elder Scrolls, but still great if you want that kind of experience: Deus ExSystem Shock 2Thief: The Dark ProjectS.T.A.L.K.E.R.: Shadow of ChernobylArx FatalisBioShockDishonoredFootnotes[1] Immersive sim - Wikipedia",
            "date": "Updated January 23, 2018",
            "views": "9",
            "upvotes": " View 87 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Willis",
                    "user_href": "/profile/Josh-Willis-126"
                },
                {
                    "user_id": "Nic",
                    "user_href": "/profile/Nic-174"
                },
                {
                    "user_id": "Amir Rabiee",
                    "user_href": "/profile/Amir-Rabiee-1"
                },
                {
                    "user_id": "Oguz Aksoy",
                    "user_href": "/profile/Oguz-Aksoy"
                },
                {
                    "user_id": "Abdoelrahman Eldawody",
                    "user_href": "/profile/Abdoelrahman-Eldawody"
                },
                {
                    "user_id": "Jay Curious",
                    "user_href": "/profile/Jay-Curious"
                },
                {
                    "user_id": "Casey Fisher",
                    "user_href": "/profile/Casey-Fisher-5"
                },
                {
                    "user_id": "Dario Calcines",
                    "user_href": "/profile/Dario-Calcines"
                },
                {
                    "user_id": "Daniel Veloso Paim",
                    "user_href": "/profile/Daniel-Veloso-Paim"
                },
                {
                    "user_id": "Derek Wilcock",
                    "user_href": "/profile/Derek-Wilcock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Konrad Krupa",
                "href": "/profile/Konrad-Krupa-2"
            },
            "answer_text": "Like… The Witcher 3?Dragon Age 1 and 3?Dark Souls?Starbound?Mass Effect trilogy?STALKER?The Gothic series?Legend of Zelda games from the 3D era?Kingdoms of Amalur?Divinity: Ego Draconis?Dragon’s Dogma?Assassin’s Creed (post-Ezio)?Mount and Blade: Warband?Xenoblade Chronicles?Risen?Bethesda’s Creation Engine games are decent at best, mediocre at worst. That’s why so many mods exist. Bethesda did open world games quite early in the PC gaming timeline, so they have a pioneer’s advantage and the most experience, but I wouldn’t use them as a benchmark for anything more than basic open world do-whatever-you-wants with expanded character creation. ",
            "date": "Answered January 12, 2018",
            "views": "638",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexandr Berözkin",
                    "user_href": "/profile/Alexandr-Berözkin"
                }
            ]
        }
    ]
}