{
    "title": "Why was the guillotine invented during the French Revolution? - Quora",
    "tags": [
        "Guillotine (capital punishment)",
        "French Revolution",
        "History of France",
        "Revolution",
        "Invention and Inventions",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremie Le Guen",
                "href": "/profile/Jeremie-Le-Guen"
            },
            "answer_text": "Such a machine existed before. However the reasons why it became popular were that prior to the Revolution, people were executed according to their social class, and some of the methods were pretty gruesome. As being beheaded was reserved for the Aristocracy, it was determined that beheading should be the way to go for everyone who was to be executed. In fact, the guillotine was proposed as a method of execution by Dr Guillotin, a representative of the government of the time, who believed that it was the swiftest and less accident-prone way to execute people. A few interesting facts: Dr Guillotin was not a fan of capital punishment, but thought that such a machine was the least cruel way of conducting it.Contrary to lore, he died in his bed. He wasn't guillotined.His family was very annoyed at his (their) name being attached to the machine. To no avail. One nickname of it was le rasoir national - the national razor.The guillotine was used for capital punishment in France right until abolition in 1981. The last execution was in 1977.",
            "date": "Answered May 9, 2020",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julia Brown",
                    "user_href": "/profile/Julia-Brown-324"
                },
                {
                    "user_id": "Anthony Tarczynski",
                    "user_href": "/profile/Anthony-Tarczynski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Tarczynski",
                "href": "/profile/Anthony-Tarczynski"
            },
            "answer_text": "In pre-revolutionary France, the method of capital punishment depended on one’s social class, or estate. Hanging was common for commoners, along with other execution methods no longer used like the Catherine Wheel. Beheading with an axe was reserved for the aristocrats because it was assumed to kill instantly and thus painless. The guillotine was invented because a cheap and reliable method of execution was needed, as unless you had a strong and accurate executioner using a sharp axe blade it could take multiple blows to remove the head, instead of a single clean cut. ",
            "date": "Answered May 9, 2020",
            "views": "94",
            "upvotes": "0"
        }
    ]
}