{
    "title": "Why do some Iraqi Arabs hate Assyrians even though they are in fact Arabized Assyrians? - Quora",
    "tags": [
        "Iraqi People",
        "Assyrian Ethnicity and People",
        "Assyria",
        "Iraq"
    ],
    "response": [
        {
            "author_info": {
                "name": "Orem Frien",
                "href": "/profile/Orem-Frien"
            },
            "answer_text": "Quite simply, those Iraqi Arabs who hate Assyrians do so because cultural conversions completely replace the prior understanding of ethnicity and culture. People take on the cultural norms that are in their environment. In fact, it’s quite common that the expansion of a new identity is based on hatred and oppression of the earlier one. The expanding identity is like a pyramid scheme that necessarily relies on people siding against their own ancestral culture and therefore against their cousins who have resisted conversion. This is why people with Armenian ancestry can be Anti-Armenian Turks and Azerbaijanis, people with ancient Jewish ancestry can be Judenhassers in Palestine, people with Coptic ancestry can hate Copts in Egypt, and people with Assyrian heritage can be Anti-Assyrian in the Arab World, and English with Celtic ancestry can oppress Welsh, Irish and Scots, and Iran can oppress Zoroastrians. There was a long-standing inequality between Muslims and a non-Muslims - Christians, Jews, Alevis, Yezidis… - in the Ottoman Empire and some Iraqi Arabs have internalized that political situation as an optimal outcome. That said, I do not believe that the majority of Iraqi Arabs affirmatively hate Assyrians. This is to say that the most common sentiment that Iraqi Arabs have for Assyrians is casual disregard. They don’t believe that the Assyrians are suffering in any way differently than they are and don’t care to help Assyrians preserve their cultural heritage. They don’t see a problem with Arabization and Kurdification, the two biggest dangers to the community in the long-term. ",
            "date": "Updated January 27, 2020",
            "views": "551",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay Alz",
                    "user_href": "/profile/Jay-Alz-2"
                },
                {
                    "user_id": "Jack White",
                    "user_href": "/profile/Jack-White-731"
                },
                {
                    "user_id": "Alper Bilgin",
                    "user_href": "/profile/Alper-Bilgin-5"
                },
                {
                    "user_id": "Shalim",
                    "user_href": "/profile/Shalim-4"
                },
                {
                    "user_id": "Sana Khoury",
                    "user_href": "/profile/Sana-Khoury"
                },
                {
                    "user_id": "Zeke Kornberg",
                    "user_href": "/profile/Zeke-Kornberg"
                },
                {
                    "user_id": "Carl Jacobson",
                    "user_href": "/profile/Carl-Jacobson-2"
                },
                {
                    "user_id": "Lourenço Maciel",
                    "user_href": "/profile/Lourenço-Maciel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Woop-Boop"
                },
                {
                    "user_id": "Zohar Gargir",
                    "user_href": "/profile/Zohar-Gargir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gus Frangie",
                "href": "/profile/Gus-Frangie-1"
            },
            "answer_text": "Islam has brainwashed non Arabs into thinking that they are Arabs, this is part of Iran's dislike of the Arabs. The Persians felt that they were losing their heritage, identity and ethnicity because of them and rebelled against Arabization. There are many stories around the MENA. which are similar to this. The Christians in Lebanon don't want to lose their Phoenician heritage and now many Lebanese Moslems feel the same way. If you look at your average Lebanese or Levantine, for that matter, their physical appearance is Mediterranean/European and not Arab/Bedouin from Arabia and Yemen. The culture is also quite different yet they're all lumped into this large amorphous definition of Arab. Btw, I forgot to mention Turkey, which has more in common with Mediterranean Europe than the Arabian peninsula. ",
            "date": "Answered January 14, 2020",
            "views": "165",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack White",
                    "user_href": "/profile/Jack-White-731"
                },
                {
                    "user_id": "Shalim",
                    "user_href": "/profile/Shalim-4"
                },
                {
                    "user_id": "Kevin McMichael",
                    "user_href": "/profile/Kevin-McMichael-2"
                }
            ]
        }
    ]
}