{
    "title": "Why can't Greeks stop criticising Turkey and just leave us alone? - Quora",
    "tags": [
        "Greek–Turkish Relations",
        "Greek Ethnicity and People",
        "Greek (language)",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hedi Debbebi",
                "href": "/profile/Hedi-Debbebi-1"
            },
            "answer_text": "It’s all a matter of territory and all the consequences of gaining and losing territories after that. Here is the map of Greece BCE:  Then here is Greece within the Roman empire. Now Greece is a Christian territory.  After that Greece is part of the Byzantine empire, still in Christian environment with Christian neighbors. Also the capital Constantinople is around the corner and it has a huge value for the Christian world.  Till this point everything was “fine” for the Greeks, there’s homogeneity around them. But then things took another turn! A new religion is coming to the premises and started taking lands! Seems Muslims are taking one land after the other from the Christian world and from Greece itself! The Greeks who were all religious and just believe in religion (just like any other nation in the world back then) of course won’t like this and they must defend their land and religion, but the new enemy seems to get stronger and stronger! The Ottomans now conquered everybody around Greece and held vast lands, including Greece itself! And here is Greece in the middle of the Ottoman empire!  The Greeks who are Christians are now invaded by a Muslims! Bad news for the Greeks! They have to bear the empire for around 400 years! Many parts of the old Byzantine empire are now completely Muslim, and many parts of Greece itself are now Muslim territories! The Greeks are fighting hard to protect their religion and culture from the new religion and new culture! Now fast-forward after gaining independence from the Ottoman empire, Greece kept gaining old territories especially after WWI when the Ottoman empire solved and Turkey appeared as a new country in the Anatole area, and Greece reached its peak in 1920:  After many international treaties Greece’s territories receded back to the current map:  The Greeks believe that eastern Thrace (current Istanbul region) belong to them, with other coastal parts of Turkey, without forgetting Cyprus. The Greeks also believe that the Turks stole a lot of their culture and even language. This is a rich background to criticize Turkey at any given opportunity. Turkey to the Greeks is like a bad behaving friend, they don’t hate her but they keep criticizing her. So this is the historical and geographical part of the story between Greeks and Turkey. Nowadays a new factor came into play, which is the Turkish president Recep Tayip Erdogan.  With his controversial statements, fierce personality and “threatening” geopolitical ambitions in the region, Erdogan doesn’t fit into the “good guy to be liked” by Greeks, and by many Turks actually. His ongoing attitude in the region and newborn conflicts with Greece does only qualify him to be not palatable by Greeks. They will criticize him, and hence criticize Turkey as he represents Turkey. P.S I’m neither Greek nor Turkish, I just gave my answer based on my understanding and analysis of the historical, political, geographical and cultural aspects of the relationship between Greece and Turkey.As I mentioned before I don’t see that the Greeks hate the Turks or vice versa. The two nations are friends and there’s a lot of similarities between them, it’s just a matter of criticizing a friend, no hard feelings. ",
            "date": "Answered October 20, 2020",
            "views": "16",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Layan Elias (ليان الياس)",
                    "user_href": "/profile/Layan-Elias-ليان-الياس"
                },
                {
                    "user_id": "Azmi Nart",
                    "user_href": "/profile/Azmi-Nart"
                },
                {
                    "user_id": "Theo Marioglou",
                    "user_href": "/profile/Theo-Marioglou"
                },
                {
                    "user_id": "Andrew Sideropoulos",
                    "user_href": "/profile/Andrew-Sideropoulos"
                },
                {
                    "user_id": "Armagan Karatosun",
                    "user_href": "/profile/Armagan-Karatosun"
                },
                {
                    "user_id": "Riley Miller",
                    "user_href": "/profile/Riley-Miller-75"
                },
                {
                    "user_id": "Panos Zeas",
                    "user_href": "/profile/Panos-Zeas"
                },
                {
                    "user_id": "Achilleas",
                    "user_href": "/profile/Achilleas-15"
                },
                {
                    "user_id": "Sarim Faruque",
                    "user_href": "/profile/Sarim-Faruque"
                },
                {
                    "user_id": "Dimitri Lostromos",
                    "user_href": "/profile/Dimitri-Lostromos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haslet Gökalp",
                "href": "/profile/Haslet-Gökalp"
            },
            "answer_text": "They'll never stop. Since gaining their independence through other nations' influence they just kept demanding lands that they never owned. There is a misconception that Greeks are byzantium(Eastern roman empire) whereas they were actually conquered by them and absorbed through orthodox Christianity. Therefore they have no claims on dodecanese, aegean islands and Cyprus. These islands were populated by Christian Romans and some Christian knighthoods before they were conquered by ottomans and then they were populated with Greeks(by the ottoman sultans) and venetian traders in order to improve trade and naval supremacy of ottoman empire in Mediterranean. So Greeks don't really have any fortified claims on these lands other than their good old megalo idea which they tried to achieve in ww1, again! With British and French help and they were given a lesson to last for a millennia. But they keep pressing their unjustified claims because eu needs fossil fuels in order to fuel their economy and keep their hegemony over Turkey and other other Middle East countries so they use Greeks for it. This is the bigger picture but Greeks will never give up their megalo idea just as we will never give Misak i Milli up. ",
            "date": "Answered October 20, 2020",
            "views": "147",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ayda Cesur",
                    "user_href": "/profile/Ayda-Cesur"
                }
            ]
        }
    ]
}