{
    "title": "Why doesn't Quora show the identity of the person who posted a question more prominently? - Quora",
    "tags": [
        "Anonymity (Quora feature)",
        "Using Quora"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ed Caruthers",
                "href": "/profile/Ed-Caruthers"
            },
            "answer_text": "“Why doesn't Quora show information about who is asking a question?” At he right hand side of your display you should see “Related Questions” followed by a list, then “Question Stats” followed by a list. At the bottom of that list is “Edits”. Click on Edits and you’ll see a new list. At the bottom of that list is the origin of the question. I find, “Question added by Ron Spofee.” Clicking on Ron’s name takes me to his profile page. If I want, I can read all 4 questions Ron has asked, all 201 answers he has written, and his 1606 edits. That’s really quite a lot of information about who asked the question. Or, if I see “Question added by Anonymous” that tells me something too. EDIT: I agree with User-12961756507663373620’s comment that the process of finding the OP is non-obvious and cumbersome. Why isn’t Quora more like other, easier social media sites? Quora has a different mission than FB or Twitter. Quora’s mission is collecting and spreading knowledge. Quora’s emphasis is on the question itself, and the answers. In Quora’s abstract model of knowledge, the identity of the OP shouldn’t matter. You should consider just the question and the answers. In pursuit of it’s mission, Quora makes questions public property. Other people can edit the question. The question can even be merged with other, similar questions. The Edits log for some questions shows multiple edits, merges, and revisions. At some point the question may not really be what the OP asked. For example, this question has been edited and merged since I wrote my answer. Is it still Ron’s? There are, of course, lots of questions that are not abstract requests for knowledge. Lots of questions are argumentative. Some are insincere. Some are abusive. Some bot-generated nonsense. So Quora maintains a path back to the OP in case sanctions are warranted.Someday Quora might have a reliable algorithm for separating the good questions from the bad, and promptly deleting the bad ones. Someday Quora might delete the OP’s name from the real requests for knowledge. ",
            "date": "Answered September 25, 2018",
            "views": "21",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Chamberlain",
                    "user_href": "/profile/Bob-Chamberlain-7"
                },
                {
                    "user_id": "Colston Sinatra Lipford, Jr.",
                    "user_href": "/profile/Colston-Lipford"
                },
                {
                    "user_id": "J Dillon",
                    "user_href": "/profile/J-Dillon-8"
                },
                {
                    "user_id": "Glenn E.J. Sandberg",
                    "user_href": "/profile/GLENN-EJ-SANDBERG-Barrister"
                },
                {
                    "user_id": "Tim Monfries",
                    "user_href": "/profile/Tim-Monfries"
                },
                {
                    "user_id": "Jonathan A. Swift",
                    "user_href": "/profile/Jonathan-A-Swift"
                },
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                },
                {
                    "user_id": "Lorraine Sisneros",
                    "user_href": "/profile/Lorraine-Sisneros"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Richard O. Colestock",
                    "user_href": "/profile/Richard-O-Dick-Colestock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas White",
                "href": "/profile/Douglas-White-23"
            },
            "answer_text": "Others have pointed out where the name of original author of a question can be found, on Quora, by scrolling down through activity in reverse chronological order. That confirms that the information is not erased, but merely requires effort to locate. Sometimes very difficult, if a question generates many answers. Back when I played hide and seek, that difficult to find, but able to be found characteristic defined “hiding”. So the observation is correct. In some sense, Quora hides the name of the author. Plausible reasons for this include the “ownership” of questions and the ability of any Quora user to “improve” questions, and merge them with other, similar or identical questions. In Quora, a question generally becomes owned by the community, not the author. Consider the situation where a question has acquired answers. The deletion of the question will take the answers with it. The time and effort toward an answer becomes lost. Not of its own fault, as when reported or down-voted. Rather, based on the whim and fancy of the creator of the question. Carrying forward ownership of a question would thus diminish the ownership the author of an answer has over their product. Quora also permits, and even encourages all users to improve questions. This could mean correcting spelling and grammar mistakes or rephrasing for clarity. This revision is further moderated by Quora, to assure that the meaning has not been altered to no longer align with the answers posted in response to earlier phrasing. If the wording of the question has been altered by a series of members of the Quora community, there is no correct by-line anymore. Questions can also be merged, even after answers have accumulated in both. The edit history will allow one to tease out a narrative of the sequence. The “author” of the question, if prominently displayed, may seem arbitrary and unjust, to one of the other contributors. Last, there is a subset of the human population desperate for any evidence of their own fame or simply some evidence of being. New to Quora, the instant gratification of asking a question and seeing one’s very own name and picture at the top of their feed can trigger the urge to do it again. And again. And maybe to see how long an unbroken sequence of their questions can fill up the Quora feed. Nobody who finds value in this site would want to encourage that behavior. ",
            "date": "Answered April 24, 2017",
            "views": "707",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "William Qin",
                    "user_href": "/profile/William-Qin-1"
                }
            ]
        }
    ]
}