{
    "title": "Why are the Portuguese considered Lusitanians if the north of Portugal (where Portugal was born) was never Lusitanian? - Quora",
    "tags": [
        "Lusitania",
        "Portuguese Ethnicity and People",
        "Portuguese (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hugo Vaz",
                "href": "/profile/Hugo-Vaz"
            },
            "answer_text": "I would say it was for the same reason why the Romans called Lusitania to what one day came to be the most part of Portugal (and bit of Spanish Extremadura): The Lusitani only lived between the Tagus and the Douro river, but they were the ones that resisted the Roman invasion the fiercest and to whom the Romans honored Viritus (the great Lusitani leader who inflicted many defeats to the Romans, until he was betrayed) with the title “Hiberae magnanimus terrae” (magnanimous ruler of the Iberian land). Remember, the Lusitani tribes didn’t had a common ruler (as the other celtic federations didn’t either), they were several tribes spread between those two rivers and only joined forces when there was a threat (Romans were), and whenever that happened they would form a Celtic federation and give rule to a unifying commander (even other tribes would join, like the Vettones - neighbors of the Lusitani -, the Tartessians - in the south - or the Gallaeci - in the north -, under the Lusitani leader or aiding him). Funny thing, Guimarães never was a capital of the kingdom and wasn’t even the last of the county. The capital of the county was transfered to Coimbra, and when our first king claimed independence Coimbra became the capital of the kingdom, and that was completely inside old Lusitania borders. So yes, what came to be Portugal (the Portucalense County) wasn’t born in Lusitani territory (either from it’s namesake birth place and first capital of the county, Portus Cale - modern Porto city -, or the historical capital of the county, Guimarães, neither of them was inside Lusitania borders or old Lusitani territory) but what came to be Portugal was once most of the Roman Lusitania Hispania (and to this day that is more than 2/3 of Portugal… helps that the borders haven’t changed much - virtually nothing - for the past 800 years). ",
            "date": "Answered May 26, 2017",
            "views": "859",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Someone On Quora",
                    "user_href": "/profile/Someone-On-Quora"
                },
                {
                    "user_id": "Renata Vieira",
                    "user_href": "/profile/Renata-Vieira-5"
                },
                {
                    "user_id": "Otis Beck",
                    "user_href": "/profile/Otis-Beck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Goncalo Ferreira",
                "href": "/profile/Goncalo-Ferreira-7"
            },
            "answer_text": "If you check Lusitania, it was mainly on today’s Portugal, and our first king Afonso Henriques was planing to reconquer that entire region, the entire current Portugal and even more, and its former kingdom (Condado Portucalense, before Portugal was reborn as a country) was already fighting the moors before, and a lot of the former south tribes, descendents from Lusitanians, were already at North, as with the islamic invasions, lots of inhabitants of Iberian Peninsula were pushed back to the North, so you had a lot of Lusitanian descendants at North at the time. So in North there were a lot of descendants of the former Lusitanians, not only the Gallaecians. So not only Afonso Henriques wanted to reconquer what we know today as Portugal, and with that, the former Lusitania (mainly), as they had lots of Lusitanian descendants with them, with the traditions, stories from the Past, etc. So it’s only natural that the majority of them, probably Lusitanian descendants, were called still as Lusitanians. Not only that but also Viriathus, the great Lusitanian leader, was told by the Romans to have lived on Mounts Herminius, nowadays known as “Serra da Estrela”, in Portugal, and he was a great leader, the most important we had in Iberia in my point of view, more than Pelayo, and others. So, Lusitanian descendants, wanting to reconquer “Lusitania” to the moors, with all lusitanian traditions, and reconquering the lands in which Viriathus was born, etc, I think those are more than enough reasons. Portuguese may be a mix of cultures, Lusitanians, Gallaecians, Romans, Visigoths, Suevic, and even other norse like Vikings (city of Póvoa do Varzim still has Viking runes there), but the Lusitanians were our mainly culture, and at the time the majority of our population fighting on the North of Iberian Peninsula, was probably made of Lusitanian descendants. So we never stopped calling ourselves Lusitanians, that’s why the name has lasted until nowadays, although nowadays our DNA is all mixed up, we’re lusitanians still, there was no big reason to be called anything else besides Portuguese of course. ",
            "date": "Answered June 12, 2019",
            "views": "457",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisia Star",
                    "user_href": "/profile/Lisia-Star"
                },
                {
                    "user_id": "Fernanda Borges",
                    "user_href": "/profile/Fernanda-Borges-24"
                },
                {
                    "user_id": "Someone On Quora",
                    "user_href": "/profile/Someone-On-Quora"
                },
                {
                    "user_id": "Daniel Costa",
                    "user_href": "/profile/Daniel-Costa-7"
                },
                {
                    "user_id": "Siya Herstelle Xaquelina Shilla",
                    "user_href": "/profile/Siya-Herstelle-Xaquelina-Shilla"
                },
                {
                    "user_id": "Jorge Marta",
                    "user_href": "/profile/Jorge-Marta-2"
                }
            ]
        }
    ]
}