{
    "title": "Why is there such a controversy as to whether the famed bust of Nefertiti is considered by some to be a forgery? - Quora",
    "tags": [
        "Antiquities",
        "Nefertiti",
        "Forgeries",
        "History of Egypt",
        "Ancient Egyptians",
        "Controversies",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Balogun",
                "href": "/profile/Alexander-Balogun"
            },
            "answer_text": "The reason is very simple. Below is the bust of King Akhenaten and the bust of Nefertiti.   Both busts were crafted by Thutmose and were found in the same room during the excavation over a 100 years ago. Meaning both busts were exposed to the same wear and tear conditions. Below is the site where the busts were excavated.  Although the bust of Akhenaten was incomplete, the head was unpainted, but the neck down to the shoulders and chest area were painted. These busts are supposed to be over 3,000 years old. But why is the bust (Painted area) of King Akhenaten looking a thousand years older than the bust the bust of Nefertiti?  Both busts were supposed to face the same detoreation since they were located in the same room in the Sculptors workshop. And yet the bust of Nefertiti appears to be more vibrant, you do the math!!  Every historian expert knows that King Tut has the most well preserved items compared to any ancient Pharaoh. Due to the enclosed tomb, unlike the exposed site where the busts were found. Yet, the bust of King Tut does not look as vibrant Nefertiti's.   There is no way a painted sculpture done 3,300 years ago, excavated from the earth and still maintain such vibrancy. Take a look at the site again.  Experts and historians have come out to debunk the authenticity of Nefertiti's bust. According to a Swiss art historian, the bust is less than 100 years old. Henri Stierlin has said the bust was created by an artist commissioned by Ludwig Borchardt, the German archaeologist credited with digging Nefertiti out of the sands of the ancient settlement of Amarna, 90 miles south of Cairo, in 1912. Is this Nefertiti – or a 100-year-old fake?  ",
            "date": "Updated March 21, 2020",
            "views": "11",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A Haydar",
                    "user_href": "/profile/A-Haydar"
                },
                {
                    "user_id": "Antoine Laccruche",
                    "user_href": "/profile/Antoine-Laccruche"
                },
                {
                    "user_id": "Melanite Zaryus",
                    "user_href": "/profile/Melanite-Zaryus"
                },
                {
                    "user_id": "Richard Jones",
                    "user_href": "/profile/Richard-Jones-138"
                },
                {
                    "user_id": "Atajite Ausa",
                    "user_href": "/profile/Atajite-Ausa"
                },
                {
                    "user_id": "Elliott Brown",
                    "user_href": "/profile/Elliott-Brown-51"
                },
                {
                    "user_id": "Ghali Lalanne",
                    "user_href": "/profile/Ghali-Lalanne"
                },
                {
                    "user_id": "A. Ganaway",
                    "user_href": "/profile/A-Ganaway"
                },
                {
                    "user_id": "Wayne McLennon",
                    "user_href": "/profile/Wayne-McLennon"
                },
                {
                    "user_id": "Sidney Odu",
                    "user_href": "/profile/Sidney-Odu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giota Detsi",
                "href": "/profile/Giota-Detsi"
            },
            "answer_text": "Why is there such a controversy as to whether the famed bust of Nefertiti is considered by some to be a forgery? Oh, there is not an easy answer! What I will try to do, is to present the story of the controversy and the motives of each part; maybe at the end a side will come up stronger. Nefertiti’s bust unearthed The German Oriental Company (leading archaeologist: ( Ludwig Borchardt - Wikipedia) unearthed the workshop of sculptor Thutmose in Amarna in 1912. Thutmose was not any sculptor; he was the favorite of Pharaoh Akhenaton, the “heretic” of the 18th dynasty. In the workshop -among other findings-were found many busts of Queen Nefertiti, the famous one wich is now in display in Neues Museum, Berlin and many unfinished ones wich are displayed in the Cairo Museum.  The famous bust of Nefertiti in Berlin (photo from wikipedia)  One of the unfinished busts of Nefertiti, from the same excavation, now displayed in Cairo (photo from study.com) Borchardt wrote in his diary: ”Suddently we had in our hands the most alive Egyptian artwork. You cannot describe this in words. You must see it.” Is this Nefertiti - or a 100-year-old fake? In a 1924 document of the German Oriental Company (unfortunately couldn’t retrieve it), a meeting between Borchardt and Egyptian officials is described, in which the goal was to divide the finds of the excavation; the secretary Bruno Guterbock that wrote the document (present at the meeting) wrote :” Borchardt wanted to save the bust for us”. A 3,500-Year-Old Queen Causes a Rift Between Germany and Egypt What had followed, was a clever-and successful- operation from the GOC to mislead the Egyptian authorities and especially Egypt’s chief antiques inspector Gustave Lefebvre - Wikipedia by showing him a bad photo of the bust and describing it as ..a mere bust. Nefertiti ended up in Germany and after been kept in the cellar of a bank, a salt mine in Merkers-Kieselbach, the Dahlem Museum, the Egyptian Museum in Charlottenburg and the Altes Museum was finally displayed in the Neues Museum in Berlin. At once, became the star of Ancient Egypt, with Adolf Hitler being one of the millions admirers. Examinations Colour analysis Borchardt took a colour analysis, presented in his book “Portait of Queen Nofretete” (1923). The colours used matched the ones used in 18th dynasty’s painting. A more recent analysis by Swiss Federal Institute of Technology(1982) confirmed his results https://pubs.acs.org/doi/pdf/10.1021/ac00241a790. 1rst CTscan Nondestructive Insights into Composition of the Sculpture of Egyptian Queen Nefertiti with CT The CT scan of 1992 revealed material weakness in the limestone core of the bust. The stucco on the face was very thin but of meaningful modifications, thicker stucco layer found on shoulders and crown. Here is the hidden face of the queen:  Not so delicate nose, some wrinkles but still.. glorious Queen Nefertiti. 2nd CT-scan Researchers use CT to examine hidden face in Nefertiti bust This second scan of 2007, confirmed the finds of the first one and provided more accurate pictures of the carved limestone.  Picture a is taken in the scan of 1992. Picture b in the scan of 2007. In the pictures d and f the stucco layers are shown Now a sum up: The bust was sneached out of Egypt (Egyptians never stopped demanding the bust back Nefertiti Bust - Wikipedia ), the excavator wrote about its astronomical value, the colour analysis and scanning showed nothing suspicious, everyone believes we are admiring a genouine artifact. Controversies When the second CT-scan results were published, a lot of events happened simultaneously; two authors, the German-Turkish historian Erdoğan Ercivan – Wikipedia and the Swiss Henri Stierlin - Wikipedia claimed that the famous bust was a fake. Let’s see what they say: Erdogan Ercivan: In his book “Missing Link in Archaeology” (2009) he claims that Borchardt’s wife Mimi was the model for the bust, back in 1912. Here is Mimi:    Does she have similar features with the Queen?? And what about this photo:  Ludwig Borchardt and the artifact, at the excavation site: the bust is painted.(photo from Cultura Colectiva) Did Borchardt risk his career and his reputation by deceiving Egyptian authorities to smuggle a froad, instead of getting legally one of the unfinished busts and do the fishy job in Germany? Could he be so naif? I think that his theory can’t be accepted. Borchardt had easier ways to take the bust in Germany and none of the studies up to date show signs of froad. Henri Stierlin: Stierlin, a journalist and writer of popular books on art and architectural history, published his book “Le buste de Nefertiti: Un imposture de l’Egyptologie?”Infolio, Gollion, 2009 . In the book, he claimed that the artifact is a froad because: “Borchardt painted the bust to test ancient pigments. The coloured bust was admired by prince Johann Georg of Saxony and he pretended to be genuine so as not offend the prince”. “The missing eye would have been a sign of disrespect in ancient Egypt.” “Records about the bust appeared 11 years after the discovery.” “The inner limestone was never dated”. Both German and Egyptian authorities rejected his theories Nefertiti Bust - Wikipedia ..and we must not forget the cracks of the limestone. Had it be 100 years old, it would be perfectly intact! So, what is the fuss about? I cannot prove what I feel but I think it is related to the other controversy over Nefertiti: The repatriation of her. As the tence between Egypt and Germany becomes higher, Archaeologist Launches Repatriation Campaign for Egyptian Treasures - The Media Line ,maybe it is better to discuss about an imaginary froad! Nevertheless, dr. Hawass won’t give up, this is for certain! Until the repatriation.. We can always debate about Nefertiti’s mummy…nefertiti_reina_amarna EDIT: I thank the fellow quoran Lee Tomas for the comment about Mimi’s photo. Halina, thank you so much for the A2A, I was so excited searching for facts (I am trully surprised that I did!) Miss Giota Marple! ",
            "date": "Updated March 24, 2020",
            "views": "18",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Silviu Mormocea",
                    "user_href": "/profile/Silviu-Mormocea"
                },
                {
                    "user_id": "Mauro Flores",
                    "user_href": "/profile/Mauro-Flores"
                },
                {
                    "user_id": "Cynthia BYrne",
                    "user_href": "/profile/Cynthia-BYrne-4"
                },
                {
                    "user_id": "Arindam Banerjee",
                    "user_href": "/profile/Arindam-Banerjee-121"
                },
                {
                    "user_id": "James Maher",
                    "user_href": "/profile/James-Maher-104"
                },
                {
                    "user_id": "William Phillips",
                    "user_href": "/profile/William-Phillips-251"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Lumi Kløvstad",
                    "user_href": "/profile/Lumi-Kløvstad"
                },
                {
                    "user_id": "Jack Strahan",
                    "user_href": "/profile/Jack-Strahan"
                },
                {
                    "user_id": "Iván Omar Rojas Monteza",
                    "user_href": "/profile/Iván-Omar-Rojas-Monteza"
                }
            ]
        }
    ]
}