{
    "title": "Why were most Indian and Middle Eastern swords curved but European swords straight edged? - Quora",
    "tags": [
        "Swords in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Subhrojyoti Sarkar (शुभ्रोज्योति सरकार)",
                "href": "/profile/Subhrojyoti-Sarkar-शुभ्रोज्योति-सरकार"
            },
            "answer_text": "I would like to answer here more from the historical point of view. Rohan has already pointed out that curved blades were much lighter and could be wielded with much more agility. The history of sword, like anything else, is one of adaptation with respect to the needs of the times, and the subsequent spread of ideas. We start with the ancient times. Almost all the sword designs during this time were more or less straight. Swords evolved from daggers and they retained the basic shape, while lengthening at the same time.  Also we must realize, that the ancient armies were mostly infantry based armies. Though cavalry formed an important part in some of the ancient armies, but it was not generally the norm. I will ponder on this point later to support why curved blades became popular in the Middle East and later in South Asia. Thus we have the Bronze Age swords   ​ or the Roman Gladius   ​ or the Celtic swords  ​ or the Persian Acinaces or Akinaka (though it was Scythian in origin)  ​ or the Indian Khanda (Swords similar to Khanda were in use during the Mahajanapada period, although the final form of Khanda came during the Gupta Period)   ​ The use of these swords depended upon their shape and the traditional needs and practices of the armies. Thus, the Romans who chiefly relied on stabbing and fighting in close formation, found a short sword to be the most suitable for them. The Celts fought as individual warriors and they placed virtues like personal bravery above the advantages of close formation. So they used a heavy and long straight sword, useful for slashing and thrusting, but one which could be wielded only by a powerful warrior. The Indians, on the other hand, according to the Greek historians during and after the time of Alexander (most notable Strabo and Arrian), were more inclined towards archery. Indian bows and arrows were reputedly the most powerful weapons of their time, capable of shooting over large distances and penetrating exceptionally thick armor. They used sword only as a last resort. So they used a weapon meant exclusively for slashing in the most desperate circumstances, a broad, double-edged blade with an abrupt tip, to be rarely used to stabbing. What was going on in the Arabian peninsula and in Central Asia all this time? Armies placing utmost importance on light cavalry were evolving. Arabs fought mainly on camels but had an enormously effective light cavalry based on Arabian horses. The Central Asians too were famed for their cavalry and excellent breed of horses. Any light cavalry trooper would like to wield a sword that would be an excellent cutting weapon, but which would also be really light in weight. So here in the Middle East and in the Central Asia came into being the first scimitar   ​ with the Arabs developing specifically for themselves, the feared Zulfiqar (which, though probably mythical, shows the tendency of the Arabs for going for curved blades)  ​ Now let's come to the spread of these types of swords. Longswords were popularized in the Roman Empire by the Celtic and Germanic soldiers who joined the Roman army. Thus came the Spatha  ​which replaced the Gladius. Later Spatha was elevated to the position of a status symbol and was worn by the nobility. The Spatha was the basic prototype from which the Europeans later developed the Longswords   ​and the more famous Claymore   ​which was wielded by William Wallace of Scotland. The Claymore used to be usually 2.5kg in weight, the heaviest one though was of 10kg. Medieval culture of knights valued individual bravery and these swords perfectly complemented an individual knight by proving a formidable cutting and thrusting weapon.  Also, European kingdoms typically employed heavy cavalry, which used to wield pikes, or spears, so that they could then smash into the enemy in a packed formation, and these longswords could also be used in place of spears, as was used by the Knights Templar. In contrast, the Arabs, as I have already mentioned, used light cavalry and employed speed to harass the enemy. As we come to Asia, we see vast conquests by the Arabs and later, the Turks. What this essentially did was that it popularized the curved sword in the places they went to. The Persians of the medieval ages, more specifically those living in the Khurasan region in eastern Persia, were excellent cavalrymen. They developed their own curved blades, the Shamshir   ​ This was a long, light-weight weapon strong enough to make deep cuts into the enemy. It was not a thrusting weapon, as is evident from its radical curve. The Turks developed their own saber, the Kilic, which was curved, as well as broad, probably to match the broadness and the apparent ferocity of the European broadswords   ​ The Kilic had a false edge at the tip, which was a distinguishing feature for it. Here in India, the Rajputs were almost exclusively cavalry based, priding on their Kathiawari and Marwari breeds of horses. Similarly the Marathas were famed for their cavalry (though they employed the much weaker country mares, but the Marathas always relied on sudden and lightning attacks, more suited to Peninsular India, rather than brute force, so their cavalry was feared for its deadly speed and agility). Thus, the Indian cavalry developed their own blade, a formidable slashing weapon, the Talwar  ​ The Talwar had a moderate curve, unlike the Shamshir or the Kilic, making it useful as a thrusting weapon too. Some of the Talwars had their tips flared, so as to provide more momentum, which could cleave the skull of a person, even if he was wearing an iron helmet, if wielded by a skilled warrior like Maharana Pratap  ​ It should be noted that wherever the Indians employed heavy cavalry, as was the case with the Mughals, they too used, along with spears, a broad sword, known as the Firangi (an Urdu term for a Frank or a western European, in this case, a sword made from blades manufactured in Western Europe)  ​ Edit 1:Providing references as suggested by User: Arab light cavalry: Mobile guardHeavy Cavalry in Europe: Medieval European Cavalry\nKnights: Medieval KnightPersian heavy cavalry during Parthian and Sassanian period: CataphractGupta military and weapons: Military Organization in the Gupta EmpireExcerpts from Anabasis Alexandrii, written by Arrian: Anabasis Alexandrii\n",
            "date": "Updated February 12, 2016",
            "views": "1053",
            "upvotes": " View 776 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arjun Arun",
                    "user_href": "/profile/Arjun-Arun-9"
                },
                {
                    "user_id": "Ricky R.R.",
                    "user_href": "/profile/Ricky-R-R"
                },
                {
                    "user_id": "Gabriel Lazzari",
                    "user_href": "/profile/Gabriel-Lazzari-1"
                },
                {
                    "user_id": "David Franklin Hammack",
                    "user_href": "/profile/David-Franklin-Hammack"
                },
                {
                    "user_id": "Shreyas Kamat",
                    "user_href": "/profile/Shreyas-Kamat-13"
                },
                {
                    "user_id": "Anubhav Apurva",
                    "user_href": "/profile/Anubhav-Apurva"
                },
                {
                    "user_id": "Aaron Dear",
                    "user_href": "/profile/Aaron-Dear"
                },
                {
                    "user_id": "Sri Vrinda",
                    "user_href": "/profile/Sri-Vrinda"
                },
                {
                    "user_id": "Samir Joglekar",
                    "user_href": "/profile/Samir-Joglekar"
                },
                {
                    "user_id": "Saurav Daga",
                    "user_href": "/profile/Saurav-Daga-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Johnson",
                "href": "/profile/Adam-Johnson-608"
            },
            "answer_text": "This isn’t a western vs eastern thing, it’s a heavy infantry vs light cavalry thing. Every sword is designed for a specific purpose. If you are in a light cavalry unit and hacking away at unarmored infantry as you ride past, the last thing you want is your sword getting stuck in one of them and then you don’t have a weapon. That’s why they are curved, that is the only reason. Curving a sword eliminates thrust options and so you’d only do this for swords specialized for cavalry. Now you may see curved swords used for non-cavalry situations but that’s more likely due to having a poor script supervisor or as a throwback to the old elite cavalry units of the past much like how sometimes modern militaries still have swords for dress uniforms today. Misconceptions: They are not lighter when curved (in fact that adds more metal so does the opposite) they are lighter because they are designed to be lighter. You can quite easily produce an even lighter sword with same attributes if it were straight.They don’t slice better as a result of being curved.Let’s take the rapier for example, it was designed in that manner not because poking is necessarily the best use of a sword, but rather because it was more a fashion piece than anything else, vast majority were never swung in anger. It was the equivalent of the Rolex of that era and thus you’d want something incredibly light and comfortable to be on your person at all times. Now where does your misconception come from, that answer is easy. Stories about sword warfare in the west typically revolve around the heavy armored units whereas stories about the east typically revolve around lighter units. Swords were also almost never a primary weapon but over glorified in film. Same for battles in general, it was much less everyone charging forward and fighting until the other side died but more rather various formations of men maneuvering around and skirmishing a little until one side lost its nerve and fled. The likelihood of surviving most battles was well over 90% whereas movies would seem to imply the opposite. There is a famous battle in the 100 years war between a couple dozen knights on either side and after several hours of fighting there had only been a handful of casualties, it wasn’t until one side made a charge that forced the other side to lose their nerve and break formation that it came to a conclusion. People enjoy living, doesn’t matter how much you train them, they will still keep their own interests in top priority and proceed cautiously with the safety of their formation. ",
            "date": "Answered July 13, 2016",
            "views": "121",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ricky R.R.",
                    "user_href": "/profile/Ricky-R-R"
                },
                {
                    "user_id": "Dexter Vinant",
                    "user_href": "/profile/Dexter-Vinant"
                },
                {
                    "user_id": "Rick Randall",
                    "user_href": "/profile/Rick-Randall"
                },
                {
                    "user_id": "Syed Sajjad",
                    "user_href": "/profile/Syed-Sajjad-52"
                },
                {
                    "user_id": "Mykyta Gnilobok",
                    "user_href": "/profile/Mykyta-Gnilobok"
                },
                {
                    "user_id": "Matthew Aleman",
                    "user_href": "/profile/Matthew-Aleman-6"
                },
                {
                    "user_id": "Christian Desaix",
                    "user_href": "/profile/Christian-Desaix"
                },
                {
                    "user_id": "Arvind Sachdeva",
                    "user_href": "/profile/Arvind-Sachdeva"
                },
                {
                    "user_id": "Nilesh Kamath",
                    "user_href": "/profile/Nilesh-Kamath-4"
                },
                {
                    "user_id": "Will Ingram",
                    "user_href": "/profile/Will-Ingram-2"
                }
            ]
        }
    ]
}