{
    "title": "Why do kids like animation? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Anderson Moorer",
                "href": "/profile/Anderson-Moorer"
            },
            "answer_text": "Animation is a form of art and entertainment in which imagination is dominant, and kids live in a world of imagination.  So much so, in fact, that animators not infrequently make real effort to tap into their inner child - an animation studio is often a somewhat childlike environment and many look a bit like an elementary school, being filled with toys, art on the walls, doodles, and animators doing arguably silly things. Animation relies on suspension of disbelief - the brain must buy into the illusion that the stylized drawings are a kind of reality even when in real life nothing even vaguely like a talking underwater sponge wearing weird shorts, or living cars with big eyes, can possibly exist.  Animation can be very adult, and frankly some of the very best animation deals with imagery and themes targeted towards adults (just look at the work of the Brothers Quay), but even then there is the dreamlike aspect of animation which makes it such a wonderful medium.  ...And nobody can dream as well as children. Children have a very special period when they have not quite reached an age where they make much of a distinction between what is happening in their heads versus the world around them. Animation speaks to them, it's fantastic nature and simplified, reduced set of world-rules is easily understood and accepted by kids. It makes sense for Winnie the Pooh, a stuffed teddy bear, to walk and talk, and in turn to have his own even more childlike dreams of heffalumps and woozles. Pioneers of animation like Walt Disney understood this, and realized that their medium had its most enthralled audience in children. Walt also realized something special - animation and the dreams it can offer can help bridge the gap between adult and child, giving them common ground and an activity they can share.  When we can create a world in which faerie tales become real, animals talk, and physics is optional, we can... for a short time... be children too.  Animation doesn't have to be for kids. One of the great mistakes of the animation industry in the west is to typecast animation as exclusively appealing to child markets. But if you do want to entertain children, what better than a medium in which anything we can dream is possible? ",
            "date": "Answered September 25, 2015",
            "views": "39",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabriel S. P. Resende",
                    "user_href": "/profile/Gabriel-S-P-Resende"
                },
                {
                    "user_id": "James Mitchell",
                    "user_href": "/profile/James-Mitchell-36"
                },
                {
                    "user_id": "Zachary Martin",
                    "user_href": "/profile/Zachary-Martin-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishant Halder",
                "href": "/profile/Nishant-Halder"
            },
            "answer_text": " The answer to your question is proven by phycologists that human (not only kids) prefer to laugh then crying or being emotional. The world of cartoon gives us that laugh with its total irrelevance to the real world with the non-sense actions and logic they make us laugh hard. Not only that kids are very creative and have imagination beyond we can imagine they want a world where they get to live their imagination and that world leads to the world of irrelevance AKA the world of cartoons. There is also an category of cartoon which is especially for matures and adults only that said it is called Anime. Anime is basically Japanese cartoons with far more mature content which includes Gore, Violence and adult contents you can get a very far variety of genre from comedy to thrillers, romancce to action and many more. If you try one or two you will understand why kids love cartoon directly from your prospect.  If you want to try Anime then here are some of my suggestions- -Attack on Titans -Tokyo Ghuoul -Demon Slayer: Kimetsu no Yaiba ",
            "date": "Answered October 19, 2019",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashrit Kakarla",
                    "user_href": "/profile/Ashrit-Kakarla"
                },
                {
                    "user_id": "Ling Li",
                    "user_href": "/profile/Ling-Li-210"
                },
                {
                    "user_id": "Eesha Sandeep Chidgupkar",
                    "user_href": "/profile/Eesha-Sandeep-Chidgupkar"
                }
            ]
        }
    ]
}