{
    "title": "Why was Peter considered the primary apostle? - Quora",
    "tags": [
        "Saint Peter (1 A.D.-64 A.D.)",
        "Twelve Apostles (Christian Bible)",
        "History of Christianity",
        "Biblical Figures",
        "Catholicism",
        "Jesus",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Christian Hansen",
                "href": "/profile/Eric-Christian-Hansen"
            },
            "answer_text": "Because Simon “Pita” Bar-Jonah (“Son of an intoxicating dove” - Hebrew: yayin yownah) is the return of the prophet Jonah and together they form a divine KEPHEL pair (Kephel is the Hebrew noun meaning “the DOUBLE” as in JOB 11:6) embodying the holy spirits of: Passover, Unleavened Bread, and First Fruits. “Pita” is hollow pocketed unleavened flatbread. In Hebrew the word is kaph, a word related to keph, “hollow rock”. Pita was the hollow rock upon which Jesus would build his Church. Since Simon Pita is an incarnation(sub-person) of the Holy Spirit, Jesus built his church upon the Holy Spirit. John Bar-Zebedee (“Son of the GIFT/Dowry”) is the return of Elisha. They embody the holy spirit of Pentecost. Joan of Arc is the return of Mary Magdalene. They embody the holy spirits of Trumpets, Yom Kippur, and Tabernacles. Jesus built his Church upon the 3 divine Kephel pairs mentioned above. It was Simon, John, and Mary Magdalene that ran to the tomb together on Resurrection morning. John(Elisha) arrived first, but he yielded to Simon/Jonah, who ran straight into the “open empty hollow rock(Hebrew: keph) tomb”. The impetuous Kephel pair: Simon/Jonah, are the holy spirit of the open empty hollow rock tomb. Just as Jonah was 3 days and 3 nights in the belly of the GREAT DOG so shall the Son of Man be 3 days and 3 nights in the heart of the earth. DOG is the pronunciation of the Hebrew word for FISH (i.e. DAG). DOG is GOD spelled in reverse. Jonah(“an intoxicating dove” i.e. the Holy Spirit - Hebrew: yayin yownah) had been swallowed by a GREAT GOD who then spewed Jonah forth (from the depths of the GREAT DAG’s belly and out of his mouth) onto dry land to preach the message of impending doom to the wicked city of Nineveh. ",
            "date": "Answered November 19, 2018",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Boyd",
                "href": "/profile/Andrew-Boyd-64"
            },
            "answer_text": "Peter seems to have a certain precedence or primacy among the Twelve, yes. Even most of the Reformers admit this much. He is always listed first among the list of names, even though he was not the first called to follow Christ (Andrew was), and he is always part of the inner circle with James and John. He is seemingly singled out by Jesus in a couple of episodes, at least in Matthew’s gospel, and in John’s gospel, he is the first man to witness the empty tomb (after Mary Magdalen, and even though the ‘beloved disciple’ beat him to it). Peter clearly has a leadership role among the Twelve, so much so that Luke’s Acts of the Apostles is basically dedicated half to Peter and half to Paul. He does not preside at the so-called Council of Jerusalem (James does) but does have an influential role. He and Paul are honored by the Church of Rome as their martyred co-patrons. ",
            "date": "Answered November 19, 2018",
            "views": "181",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriele Alfredo Pini",
                    "user_href": "/profile/Gabriele-Alfredo-Pini"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Rick Bruno",
                    "user_href": "/profile/Rick-Bruno-1"
                }
            ]
        }
    ]
}