{
    "title": "Why was Napoleon welcomed by the territories conquered by him? - Quora",
    "tags": [
        "Napoleonic Wars (1803 to 1815)",
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noah Wiener",
                "href": "/profile/Noah-Wiener-1"
            },
            "answer_text": "To quote Mike Prinke, first ask if before you ask why. Acceptance of Napoleon in the territories he conquered was by no means universal. In fact, acceptance of his regime was lukewarm, I’d argue, at best, across Europe, with Poland being the sole exception, and this was because their new status as a puppet of France was superior to their old status partitioned between Russia, Prussia, and Austria. In those territories that were with Napoleon even into the War of the Sixth Coalition(Italy, the Confederation of the Rhine, Saxony) the locals weren't exactly flocking to the recruiting stations to honor their liberator, they were simply obeying the laws that they would be punished for disobeying. They were keeping their heads down; this should not be confused for welcoming their conquerer. Then, of course, there were the countries where the common people put their all into resisting Napoleon. Spain is, of course, the most infamous, where the people of Spain, in response to Napoleon’s kidnapping of their King, quite literally invented the term “guerrilla warfare”. In Russia, peasant resistance against the French invaders was a major problem for Napoleon’s supply. Late in Napoleon’s regime he also faced resistance from the Netherlands and North Germany, directly annexed into France, because Napoleon’s embargo of Great Britain was destroying the economies of those regions.  Pictured: the people of Spain welcoming their liberators Napoleon’s Empire, and indeed the French Republic that preceded it, talked a big game about their wars being ones of liberation. Those peoples who had war brought to their doorstep, though, weren’t fooled. Both the French Empire and the French Republic were fighting for imperialism and expansion, in the latter case for some “natural borders” that France had never had and that involved absorbing hundreds of thousands of Germans, and in the latter case for hegemony over Europe, a Europe that was to serve French interests above all else. No amount of revolutionary idealism should hide that face. ",
            "date": "Answered October 5, 2018",
            "views": "27",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erich Zorn",
                    "user_href": "/profile/Erich-Zorn"
                },
                {
                    "user_id": "Stefan Tzanev",
                    "user_href": "/profile/Stefan-Tzanev-2"
                },
                {
                    "user_id": "Harold Kingsberg",
                    "user_href": "/profile/Harold-Kingsberg"
                },
                {
                    "user_id": "Chris Sugrue",
                    "user_href": "/profile/Chris-Sugrue"
                },
                {
                    "user_id": "Shriranga Wirth",
                    "user_href": "/profile/Shriranga-Wirth"
                },
                {
                    "user_id": "Terence Freedman",
                    "user_href": "/profile/Terence-Freedman"
                },
                {
                    "user_id": "Eric Nicholson",
                    "user_href": "/profile/Eric-Nicholson-23"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Mattia Piercecchi",
                    "user_href": "/profile/Mattia-Piercecchi"
                },
                {
                    "user_id": "Piyush Kaul",
                    "user_href": "/profile/Piyush-Kaul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Preston",
                "href": "/profile/Adam-Preston-25"
            },
            "answer_text": "Although there was republican sentiment in some of the territories conquered by Napoleon, on the whole people do not like being invaded by foreign armies. In addition Napoleon’s army used to devour everything in its path in order to feed itself and Napoleon liked to steal valuable artworks and send them back to Paris in order to endear himself to the Paris mob (forming the heart of the Louvre’s collection). An example of a territory where there was republican support is Naples but this was largely restricted to an intellectual elite - the peasantry of Naples (the Lazzaroni) loved their King (Ferdinand). When Ferdinand was driven out by the invading army of France there was a brief flowering of very idealistic republicanism in Naples which was then brutally stamped out when Cardinal Ruffo’s peasant army counter attacked and retook the city. Many of the republicans were hanged, cheered by the Lazzaroni mob. The idea that Napoleon was beloved by the peoples that he invaded probably stems from the romantic myth of Napoleon as a liberal liberator who freed people from the tyranny of Kings. in fact he crowned himself emperor with far more powers than any other living King, made his brothers into kings of conquered territories and, although he did introduce measures to improve the lot of the Jews it is a little known fact that women lost rights under Napoleon. It is also worth noting that many of the old and powerful aristocratic families of France survived the entire revolution intact, with their land and property, many of them close to Paris. When Napoleon finally fell he was replaced by a Bourbon ,Louis XVIII, as king of France - the republican nature of France today is owed to later revolutions. ",
            "date": "Answered October 5, 2018",
            "views": "577",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vaibhav Jain",
                    "user_href": "/profile/Vaibhav-Jain-423"
                },
                {
                    "user_id": "Keisel Perez",
                    "user_href": "/profile/Keisel-Perez"
                },
                {
                    "user_id": "Massimo Valerio Preite",
                    "user_href": "/profile/Massimo-Valerio-Preite-1"
                },
                {
                    "user_id": "Manthan Shah",
                    "user_href": "/profile/Manthan-Shah-38"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                },
                {
                    "user_id": "Timothy Soo",
                    "user_href": "/profile/Timothy-Soo-2"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Noah Wiener",
                    "user_href": "/profile/Noah-Wiener-1"
                }
            ]
        }
    ]
}