{
    "title": "Why do Hungarians call Romanians 'Oláh'? - Quora",
    "tags": [
        "Romanian Ethnicities and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ionut Sabau",
                "href": "/profile/Ionut-Sabau-1"
            },
            "answer_text": "Why do Hungarians call Romanians \"Oláh\"? This is coming from a Romanian perspective. Firstly, today “Oláh” is perceived by Romanians as an offence (not really a slur, but not far from it), especially if coming from a Hungarian. It is also safe to say that the Hungarians that would use it, are not doing it for the sake of sounding edgy/cool by using and old denomination … Secondly, Oláh most likely derrived from the word “Vlach” (which has been dissected to death here on Quora, so I won’t bother explaining it once again). The term Vlach was generally used by non-Romanians to refer to the Romance-speaking populations in the Balkans (including the territory of what is now Romania). It is also similar to the exonym used by Hungarians to refer to Italians to this day: Olasz. According to most Romanian historians, Romanians are the descendants of the Romanized populations that managed to survived in the hilly and mountainous areas of the former Roman province of Dacia. This is called the Daco-Roman continuity theory. It’s also the main reason we named ourselves Români, aka Romanians. Hungarian historians generally disagree, insisting on the immigrationist theory, which specifies that the Romanians living in the territory of the aforementioned Roman province, are the descendants of Romanized populations originating South of the Danube, that have migrated into what was by then Hungarian territory (commonly now known as Transylvania). Since Balkan Romance-speaking populations were named Vlachs (and many still used that exonym to this day, for various reasons), Hungarians started using their version of that word: Oláh. Prior to the late 1800’s the word wasn’t seen as a slur or at least I don’t think so - I mean, Nicolaus Olahus y’know - but I think things changed by the end of the XIXth century. Initially, it was simply an exonym used by Hungarians to refer to Romanians, mainly those living within the Hungarian kingdom’s borders - I don’t know if it was used for Wallachians or Moldavians as well. By the end of the XIXth century it probably turned into an offensive word, or rather was perceived as such, by Romanians. Why? See the second and third paragraphs: it would negate the origin of the Romanians (according to the Romanian side). In that sense it was/is not much different from the slur currently used by Romanians when referring to Hungarians (the B-word). So if today, some Hungarians use the word Olah, to refer to Romanians, it’s not really in a positive manner. ",
            "date": "Updated January 30, 2020",
            "views": "197",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrei Delcea",
                    "user_href": "/profile/Andrei-Delcea-2"
                },
                {
                    "user_id": "Dorian Cica",
                    "user_href": "/profile/Dorian-Cica"
                },
                {
                    "user_id": "Gary James",
                    "user_href": "/profile/Gary-James-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karmanoczki Gábor",
                "href": "/profile/Karmanoczki-Gábor"
            },
            "answer_text": "Hungarians do not cal Romanians oláh. We call them román, or, if we mean other ethnic people living in Romania, we call them romániai. Oláh is an old term that was widely used until the mid 1800s but as Romanians didn’t like the word, we changed it gradually. I guess the only reason it is still remembered is that Oláh is among the 10 most frequent family names. I was not fully correct though. From time to time it comes up as a term mocking them. Most of us, when we ask the question at the age of 8–10, as to why this name was changed to Romanian, we are told that it’s because Romanians dont like it. So we use it as a curseword. Example: these days the motorways in Hungary are full of caravans carrying 2nd hand German cars - not exacly according to Traffic Code stipulations (Romanians are famous about their inventious approach when it comes to rules). So I hear many people being frustrated from the near accident situations in the following context “fuck the Oláh was riding 95 km bypassing the truck going with 90”. But in a normal conversation, it never comes up. Neither its written form. So let me rephrase your question: why Hungarians used to call Romanians as Oláh? And I would highly emphasise the expression ‘used to’. ",
            "date": "Updated November 26, 2019",
            "views": "790",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pop George",
                    "user_href": "/profile/Pop-George-3"
                },
                {
                    "user_id": "Cristian Vidrascu",
                    "user_href": "/profile/Cristian-Vidrascu"
                },
                {
                    "user_id": "Attila Kiss",
                    "user_href": "/profile/Attila-Kiss-30"
                },
                {
                    "user_id": "George Grigore",
                    "user_href": "/profile/George-Grigore-3"
                },
                {
                    "user_id": "Andra Lang",
                    "user_href": "/profile/Andra-Lang"
                },
                {
                    "user_id": "Ciprian Cladoveanu",
                    "user_href": "/profile/Ciprian-Cladoveanu"
                },
                {
                    "user_id": "Steven Joseph Hunyadi",
                    "user_href": "/profile/Steven-Joseph-Hunyadi"
                },
                {
                    "user_id": "Constantine Vallen",
                    "user_href": "/profile/Constantine-Vallen"
                },
                {
                    "user_id": "Jacob Gibbs",
                    "user_href": "/profile/Jacob-Gibbs-21"
                },
                {
                    "user_id": "Cosmo Gligor",
                    "user_href": "/profile/Cosmo-Gligor"
                }
            ]
        }
    ]
}