{
    "title": "Why is the Soviet regime still seen as 'good' when they were actually worse than the Nazis? - Quora",
    "tags": [
        "Political Philosophy",
        "Nazism",
        "Soviet Union",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rudra Singh",
                "href": "/profile/Rudra-Singh-33"
            },
            "answer_text": "Soviet regime is still seen as “good” not only in comparison to Third Reich but also the French, British and other European colonial powers and America. Why? British, French and other European powers had brutalized the rest of the world through sheer military power and industrial technological advancement. Americans wiped out native Americans, with 100 million natives murdered for land grab and not to talk about how slavery (unpaid labor) helped America create its wealth. British and European colonialist carried silent genocide of the natives in Africa and Asia. It has been asked while Hitler has been denounced by one and all for the holocaust but America, Britain, France and Belgium have been left out for their much more heinous crimes against humanity. This has been mainly due to Euro-centric worldview of historical narration. Hitler mainly fought against European nations and massacred European population, hence he is considered an epitome of “Evil”, while nothing is noted about the genocide, atrocities committed by Europeans on non-European people. In fact, the biggest criminal of the twentieth century, Winston Churchill, is celebrated as a “Hero”, when in fact he should have his name listed in the list of brutal tyrants whose whimsical and racist attitude saw deaths of 4 million people in British Bengal, along with King Leopold II of Belgium, who sat over and presided over the death of 10 million people but hardly anyone and by anyone I mean anti-USSR, anti-socialist people, never talk about it and choose to ignore. Now, I will tell you why Soviet regime was much better than not only Nazis but all of the western allies. Hitler and his Nazi party were supported by British and American capitalists and corporations. Hitler admired Henry Ford and he was awarded “Grand Cross” by the Nazi government. Morgan, Chase, IBM, GE, GM, Coca Cola all American corps continued doing business with Nazi Germany via third party neutral countries like Sweden, as American government had banned trading with the enemy. Soviet Union bore the brunt of Nazi war tactics. More German soldiers died on Eastern front than on the western front.About more than 3/4th of the German war machine was destroyed on the eastern front.It was not only German forces, Soviet Union was fighting against, but also their allies the Italians, Finns, Romanians, Hungarians who had their divisions fighting in the eastern front.25 million Soviet citizens (military personals and citizens) died from all causes as the result of the war. With so many people sacrificed, it proves how much faith Soviet people had in their government under Stalin and they knew that their country was worth protecting by each and every drop of blood Soviet people shed to save their motherland from the Nazi savage hordes. This is unlike the British and French capitalist class that fled their country to US in face of Blitzkrieg.So, yes, the Soviet Regime was definitely better than any other existing regime on Earth in that period of time and not just the Nazis. ",
            "date": "Answered October 5, 2018",
            "views": "929",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vũ Thị Phong Vân",
                    "user_href": "/profile/Vũ-Thị-Phong-Vân"
                },
                {
                    "user_id": "Igor Pazinich",
                    "user_href": "/profile/Igor-Pazinich"
                },
                {
                    "user_id": "Alexis Ramos",
                    "user_href": "/profile/Alexis-Ramos-189"
                },
                {
                    "user_id": "Husham Butnaru",
                    "user_href": "/profile/Husham-Butnaru"
                },
                {
                    "user_id": "Stella Sagatelian",
                    "user_href": "/profile/Stella-Sagatelian"
                },
                {
                    "user_id": "Felix Dzerzhinsky (ЧЕКА)",
                    "user_href": "/profile/Felix-Dzerzhinsky-ЧЕКА"
                },
                {
                    "user_id": "Rudolf Reich",
                    "user_href": "/profile/Rudolf-Reich"
                },
                {
                    "user_id": "Rahil Alam",
                    "user_href": "/profile/Rahil-Alam-3"
                },
                {
                    "user_id": "Chuck Garen",
                    "user_href": "/profile/Chuck-Garen"
                },
                {
                    "user_id": "Shourya Basu",
                    "user_href": "/profile/Shourya-Basu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Thompson",
                "href": "/profile/Ben-Thompson-256"
            },
            "answer_text": "It would likely depend on the country. As an American, we don’t see the Soviet regime as being “good” on any level. The problem comes when you look through the lens of WWII. The allied forces downplayed things the Soviets did, such as the Katyn forest massacre which the allies were aware of, but kept from the public. It was in the best interest of the alliance to keep people positive about our “ally”. In terms of history books, in the US, we aren’t taught a whole lot about Soviet Russia, the revolution, the starvation of the Kulaks in Ukraine, the pagrams, the gulag archipelago, or any of the myriad of purges under Stalin. We’re basically taught that the Nazis were bad, and the allies beat them, mainly focusing on the British, and America contribution to the war, mainly the American. We learn a little about the cold war, which does cast a negative light on the Soviet Union. The problem isn’t that people see the Soviet Union as “good”. It’s that people, not just in the US, but the world as a whole simply don’t know. In my personal opinion there’s a reason for that. The liberal left in most countries either tries to glorify, or espouse socialist, or communist values. I’m not sure, but if the college, and university systems in other countries, are like those in the US, they are predominantly staffed by liberals. So it’s not in their best interest to really go into the horrors of communism under the Soviet Union, or China, so they try to avoid detailing the horrors as much as possible. If everyone knew how brutal, repressive, and outright inhumane socialism and communism were, there wouldn’t be anyone clamoring for it. In the US college kids have this rosy perception of socialism and communism as though it’s a great concept, the reason is because they have no idea what it was. Anyone who knows what not only Stalin did, but what his successors did, they’d be disgusted. ",
            "date": "Answered June 26, 2018",
            "views": "256",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Axel Nyberg",
                    "user_href": "/profile/Axel-Nyberg"
                },
                {
                    "user_id": "Arthur Stepanyan",
                    "user_href": "/profile/Arthur-Stepanyan"
                }
            ]
        }
    ]
}