{
    "title": "Why does the US keep invading other countries? - Quora",
    "tags": [
        "Warfare and Terrorism",
        "Warfare in the United States",
        "Military History of the United States of America",
        "Foreign Relations of the United States of America",
        "Terrorism",
        "History of the United States of America",
        "Warfare",
        "Military History and Wars ",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ariel Solomon",
                "href": "/profile/Ariel-Solomon"
            },
            "answer_text": "Same reason everyone else does. Advancing their own gain. The reason nobody else isn't right now? The US has a defense treaty with a fourth of the countries on the planet or has economic interests that would be disrupted by war. IE start shit, at any level the US will most likely get involved and while only using 3% of its GDP (most countries without a defense treaty with the US spend 2 - 5%) has a military budget greater then the rest of the world combined. We are the world police by default because it is in our interest to quash conflict and use our economic might to build trade relationships. Because that benefits the US more then every shitty little country murdering their neighbors over resources.  Protip, Afghanistan is the grave of empires not because they're good fighters. Its be because there are no natural resources there. It is marginally significant as a crossroads of nations. Nobody stays in Afghanistan, they're just on their way to subjugate someone else. Afghanistan we allowed the Taliban the choice of denying aid to Al Qaeda which is a saudi group. Problem is that by that time the Taliban were foreigners exiled for being too extreme from more “moderate” places like Saudi Arabia and Pakistan. Extremists want Afghanistan because nobody else actually wants it and they can use it as a rallying place against the “evils of western civilization”. We invaded Afghanistan because the stated goal of Al Qaeda was to disrupt America's economy and the Taliban were protecting them. We invaded Iraq because we wanted a stable trading partner in the middle east that wasn't Saudi Arabia. And Saddam was a shitty person whom everyone in the region hated. We didn't count on the population being so tribalistic they instantly started murdering eachother once Saddam was gone.  So with that said why do we invade? Because war is bad for business and we will kill you if you start shit with us, with our allies, or our interests which are global. If we weren't here every else would be doing the same. As of last year, there are only 4 conflicts in the world right now that kill more than 10,000 people annually. >Syria >Iraq >Afghanistan >Mexico At no point in human history have so few people been effected by war. We are in a golden age of peace and prosperity because war is not a bargain for anyone going against US interests. When the US no longer holds its monopoly on force war will rage like we have never seen. We can only hope to survive it. ",
            "date": "Answered March 16, 2020",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thongthong Thongkham",
                    "user_href": "/profile/Thongthong-Thongkham"
                },
                {
                    "user_id": "Tarzan Strong",
                    "user_href": "/profile/Tarzan-Strong"
                },
                {
                    "user_id": "Yosif Moustafa",
                    "user_href": "/profile/Yosif-Moustafa"
                },
                {
                    "user_id": "Mazmurel Jonas",
                    "user_href": "/profile/Mazmurel-Jonas"
                },
                {
                    "user_id": "Mark Smith",
                    "user_href": "/profile/Mark-Smith-1763"
                },
                {
                    "user_id": "J Rod",
                    "user_href": "/profile/J-Rod-96"
                },
                {
                    "user_id": "Aaron Zhou",
                    "user_href": "/profile/Aaron-Zhou-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Lilley",
                "href": "/profile/Patrick-Lilley-7"
            },
            "answer_text": "America has never stopped invading countries. But, if you live another five years, you're going to see America invade itself. Haha. I'm going to laugh my Goddamn ass off. Watching apathetic, fatass, worthless eaters being tricked into shooting at their neighbors because they're communists, or aliens, or whatever the fuck the media decides to tell them. I am absolutely convinced that the average IQ of the Fox News Viewer is 80. Watching those retards accidentally shooting family members while trying to load their weapons will be both tragic and Karma. Has the US ever invaded another country ? We have military bases in 191 countries. Do you think that they want the base there? It would be easier to list the countries that we haven't invaded. Read the book WAR IS A RACKET, by General Smedley Butler. We invaded and killed 200,000 people in Latin America for The United Fruit company in the USA. General Butler was the most decorated Marine in History that decide to tell the absolute truth. When he did, the media said he had lost his mind and they killed him of old age, supposedly. somewhere at some time wil be another Americans with some Intel agency. He will mark me, pat lilley down as some form of communist because I am opposed to murder. Whoever is reading this, take a moment to think which one of us is doing the right thing. As for me, I could sit back and say and do nothing and maybe ever reap some rewards. Hell, I might like whatever your job pays. I'm 60 years old with a trade degree in electronics and I crawl under people's home s in the mud and mold and cold and wet and webs to eek out a living and I wouldn't have it any other way. Well, I might consider a different career but I won't work for someone else again, ever. But you ! You are working for whom? Homeland Security? You job is to see what Americans are awake and which ones are asleep. You spy on us, catalogue us. Maybe ebven mark us for death or incarceration. So which one of us live in the land of the free and the Home of the brave? Why do you think of Eric Snowden? William Binney? What does treason pay these days? fifty grand ? Got any children? Sold your children for fifty grand? Maybe you're just keeping them fed until you can figure out what to do. Go public. Of to RT news, Sl Jazeer or The Guardian. Do something and good luck. ",
            "date": "Answered February 11, 2019",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duong Ha",
                    "user_href": "/profile/Duong-Ha-12"
                },
                {
                    "user_id": "Bob Stone",
                    "user_href": "/profile/Bob-Stone-235"
                },
                {
                    "user_id": "Lee Eldridge",
                    "user_href": "/profile/Lee-Eldridge-8"
                },
                {
                    "user_id": "Edgar Muoni",
                    "user_href": "/profile/Edgar-Muoni-1"
                },
                {
                    "user_id": "Mohammad Saiful Alam",
                    "user_href": "/profile/Mohammad-Saiful-Alam-2"
                },
                {
                    "user_id": "Felix Vanahar",
                    "user_href": "/profile/Felix-Vanahar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Poh-Foong"
                },
                {
                    "user_id": "Martin Jones",
                    "user_href": "/profile/Martin-Jones-422"
                },
                {
                    "user_id": "Arielle Lopes",
                    "user_href": "/profile/Arielle-Lopes"
                },
                {
                    "user_id": "Irvan Maulana",
                    "user_href": "/profile/Irvan-Maulana-11"
                }
            ]
        }
    ]
}