{
    "title": "Why was nationalism a significant force in 19th century Germany? - Quora",
    "tags": [
        "19th Century",
        "Nationalism",
        "Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jihoon Seo",
                "href": "/profile/Jihoon-Seo-3"
            },
            "answer_text": "German nationalism basically started to flame after the Napoleonic Wars. During the Napoleonic Wars, the Germanic ethnic group, from the Prussians to the Bavarians suffered a lot of men and material losses. This would’ve sparked a universal idea for a united Germany to prevent such external intervention and especially to stand with autonomous rights against surrounding great powers, France, Russia, and Austria. Actually nationalism was a significant force all around Europe and a large number of revolutions had nationalism as one of the motivations. These also seem to be highly influenced by the Napoleonic Wars and French conquer among entire Europe. Due to this, the former style of order under monarchies shook and in 1848 revolutions blew up as an opposing force to this. Well, I have strain away a bit. Back to Germany. German nationalism, highly sparked by the Napoleonic Wars and French conquest, was also significant in the unification of Germany. After the Napoleonic Wars, recognizing such German nationalism, the Vienna Congress bind up German states and Austria slightly (which was also a highly German dominant nation, though multi-racial) in to the German Confederation. Here is a map of it.   The picture beneath is now Germany. You can see that it is very similar geographically. German nationalism was not resolved by a weak bound as a Confederation. Later, the two important German nations, Prussia and Austria clashed with two incentives for a united Germany. One is the Prussian ‘Little Germany’ -a unification of German excluding Austria lead by Prussia- and Austria’s ‘Big Germany’ -a unification centered on Austria. The friction of the two ideas for unification got bigger and after the Second Schleswig Holstein War (1864) and Schleswig-Holstein also joining Germany, not Denmark, Austria had territorial disputes between Prussia with the occupied Schleswig-Holstein territory. To simplify some stuffs, they went to war in 1866 and Prussia and the fellow states one against Austria and its fellow states (Bavaria, Saxony,etc.). Therefore, the German unification would be done in the form of Little Germany as Austria lost control of all the German states, and the North German Confederation was proclaimed in 1867, which was an early moderate form of united Germany.  With this stronger bound, the Germans later went to war with France in 1870 and won the war in 1871. During the war, when German victory was pretty much decided and nationalism for a united Germany spread all around the German states, even Bavaria which was a state highly skeptical with a Prussian dominant unification and has never been friends to get along. 18th January 1871, the German Empire was proclaimed and Wilhelm I was proclaimed Kaiser in the Hall of Mirrors of the Palace of Versaille. German nationalism was a driving force for the unification Germany and the formation of the German Empire, therefore it is highly significant and was a powerful force in the 19th century. This directly influenced Germany’s future and the Great War in 1914. ",
            "date": "Answered July 22, 2020",
            "views": "230",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Björn Drescher",
                "href": "/profile/Björn-Drescher"
            },
            "answer_text": "Lots of people here looking at nationalism from today’s perspective and not answering the question. So I’ll do my best. To understand the significance of nationalism in Germany in the 19th century, you need to look at the situation the german states were in at the time. At the beginning of the 19th century, there obviously was no single german state. What existed was a plethora of tiny to medium sized states, most of them monarchies, that were continually pushed around, bullied, invaded and occupied by their bigger neighbors, and generally were no factor in the great game. There were two significant powers though at the time: the kingdom of Prussia, only recently emerging as the most prominent force in northern germany, and the austrian empire as a more established force. However, from a “german” perspective, both of these were problematic: Prussia was, at best, a regional power. It profited for a while cuddling up to Napoleon, but when it became clear that they were in no position of power toward France and switched sides, became quickly crushed by the french army. It won its indepence back in the end, but as the minor partner on the coat tails of Russia and BritainAustria was a multi-ethnic empire that just happened to be ruled by a german dynasty, and was pretty much occupied with matters outside what was perceived as “german lands”What happened then in the first half of the 19th century, pretty much inspired by the french example, was the idea that all germans should be united in a single nation. It was a revolutionary idea that postulated that the loyality of all germans, from the simplest peasant to the most powerful kings, should be to a german nation, and that this nation should be in a position to defend its interests against the empires it was surrounded by. All this was supported by a common language, common educational standards, a common mythology even, that defined the core of “being german”. At its core, this was an “inclusive nationalism”, that was more concerned about the commonality of the germans. In fact, many normative instances defining german culture or language, such as the Duden, were initiated during that time. And while the nationalist revolution of 1848 failed rather quickly, the idea still stuck around. Instead of creating a german nation in a bottom-up approach by the people, particularly the prussian leaders, particularly Otto von Bismarck, exploited this sentiment to create a german nation in a rather top-down fashion, by binding smaller states to Prussia, forcing out Austria, and keeping the neighbors at bay. Only later toward the end of the 19th century, when the german nation already existed, the “exclusive nationalism” that we associate with the term today became more dominant. Instead of defining positively what defines belonging to the nation, it defined the same by promoting the antagonism to the “outside world”. ",
            "date": "Answered July 22, 2020",
            "views": "258",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Lewis",
                    "user_href": "/profile/John-Lewis-316"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}