{
    "title": "Why did the USA and Japan go to war in 1941? - Quora",
    "tags": [
        "Attack on Pearl Harbor (December 1941)",
        "Military History and Wars of Japan",
        "History of Japan",
        "Japan in World War II",
        "Japan",
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Wu",
                "href": "/profile/Adam-Wu-3"
            },
            "answer_text": "The leadership of Japan had locked themselves into a mindset which, rightly or wrongly, considered war with the US guaranteed and inevitable. The die was cast when Japan chose to invade China in the 1930’s and the US slapped an oil embargo on them in retaliation. I can’t say if this resulted from a miscalculation of the likely American response or a miscalculation of the impact of the embargo itself, but suffice to say that Japan’s first misreading of American resolve and likely response to their actions was not Pearl Harbor. By the 1940’s the effects of that embargo and the strain of the war in China had pushed Japan’s economy to the brink of collapse. They knew that if things did not change they would not be able to sustain military operations in China for much longer. They had been winning handily on the battlefield in China, but they were losing the logistics war, and as we all know, logistics is what matters in the end, in war. But the only viable sources of additional natural resources to fuel their war machine available to them at the time were colonial holdings of various European powers allied to the United States, and the United States. Thus getting those resources meant war with at least some American allies initially, and very likely, eventually, the United States. So it boiled down to a choice between a humiliating retreat from China and complete abandonment of Imperial Japan’s pretences towards being a great world power, or war with the United States. The problem was, the Japanese leadership had, in order to maintain support for the war in China, wrapped up so much of Japan’s national identity and pride in that operation (it could also be argued that the dynamic was the other way around) that they feared that failure on that front would result in enough humiliation and discrediting of their leadership that it would certainly lead to social upheaval, revolution, and the fall of their regime. From their perspective, this was no better, and indeed perhaps worse, than losing a war to the United States, since at least in option number 2 they go down fighting in a blaze of glory with their military honor intact. You could say that they feared their own most fanatical middle level followers (whose fanaticism they themselves stoked and rode to power) more than they feared the military might of the United States. The longterm ultimate wellbeing of the common Japanese people in either scenario, of course, was not something they cared about. So, faced with a choice between what they regarded as guaranteed humiliation, ignomity and defeat, and a high risk option that at least had a chance for success, they rolled the dice on door number two. ",
            "date": "Answered February 2, 2018",
            "views": "36",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Ritchason",
                    "user_href": "/profile/Robert-Ritchason"
                },
                {
                    "user_id": "Jose Floren",
                    "user_href": "/profile/Jose-Floren"
                },
                {
                    "user_id": "Melissa Hudson",
                    "user_href": "/profile/Melissa-Hudson-52"
                },
                {
                    "user_id": "Esrarengiz Kanal",
                    "user_href": "/profile/Esrarengiz-Kanal"
                },
                {
                    "user_id": "Rock Smith",
                    "user_href": "/profile/Rock-Smith-48"
                },
                {
                    "user_id": "Joe Dweck",
                    "user_href": "/profile/Joe-Dweck-2"
                },
                {
                    "user_id": "Nima NikKhah",
                    "user_href": "/profile/Nima-NikKhah-1"
                },
                {
                    "user_id": "Brandon Parrott",
                    "user_href": "/profile/Brandon-Parrott-2"
                },
                {
                    "user_id": "Anthony Alvarez",
                    "user_href": "/profile/Anthony-Alvarez-7"
                },
                {
                    "user_id": "David Klockowski",
                    "user_href": "/profile/David-Klockowski-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "This is one of the more popular question asked on Quora lately. I have a prepared answer for it I use every time I am asked. They believed they could win the war, not be defeating the US, a known impossibility, but by delaying our entry into the war long enough to allow them to consolidate their gains in the Pacific. Their plans were ambitious but not completely unrealistic. They were overconfident and underestimated the Americans’ backbone. They viewed the Americans as decadent and soft. Admiral Yamamoto, the architect of the Pearl Harbor attack, knew better and cautioned against taking on the US but his concerns were dismissed. From the Japanese vantage point they had some good reasons for going to war with us. Japan was desperate and in social and economic crisis. In addition devastating natural disasters racked the country. Dozens of earthquakes ravaged the country leaving destruction in their wake. The bottom fell out of the Japanese economy and they became a country ready for political upheaval. By 1926 over three million workers were unemployed and thousands had lost their life savings. For the first time in history, Japan was on the edge of revolt. A communist movement became popular and was gaining momentum. The Diet (Japanese Parliament) took action to exterminate what they called \"Dangerous Ideologies\" and created the \"Tokka\" or special police and smashed all communist sentiments by 1928. In 1930 a string of assassinations began. It was a brainless period of patriotism when zealots tried to purify Japan by murdering its leaders. Extremists felt their leaders were cowering to the West by limiting Japan's navel expansion. Prime Minister Hamaguchi was assassinated in 1930. The political murders continued when a faction called The Blood Brotherhood carried out the executions of Finance Minister Junnosuke Inoue and Baron Takuma Dan. The public sympathized with the assassins and considered them heroes and pled for leniency. Eventually the killers and their accomplices were released. Japan, a nation dependent upon imported resources, suffered when the Great Depression hit America destroying their greatest economic industry, the export of silk to the U.S. Why did officials ignore peace-loving Emperor Hirohito, who once wrote “Sublime is the moment when the world is at peace?” And why did Hirohito never make a forceful enough appeal to prevent hostilities? Hirohito accepted his role as a priestly figurehead who was expected to maintain a god-like dignity and not involve himself in affairs of state except in a purely ceremonial role. The Emperor realized that the war-loving generals and politicians were deliberately venerating him to divine status to purposely render him impotent. Although Hirohito indirectly made his disagreement known he was handcuffed by custom and ancient tradition from voicing out his true desires or making specific demands. Japanese leaders believed that Asian colonies could supply them with raw materials and aid them in their economic problems through conquest. Acting upon his own initiative Lieutenant Colonel Kanji Ishihara began Japan's military aggression by attacking Manchuria under pretext of wrong-doing in order to seize territory. By March 1932, the Japanese Kwantung Army led by the recently promoted Colonel Kanji Ishihara was given the go-ahead to capture all of Manchuria, Jehol, and a part of Mongolia. The United States and other powers refused to recognize the new independent state of Manchukuo that was made up of conquered lands that had been taken from China. In 1933 Japanese, infuriated by The League of Nations condemning their actions in China, disregarded World opinion by quitting their membership. In 1939 the United States punished Japan for its actions and atrocities in China by rescinding its commercial treaty with the Empire and began to restrict essential shipments of oil and metals. These actions created resentment for the West and furthered the already deep seated Anti-Anglo feelings. By 1941 the U.S. joined in a full embargo that was a devastating blow to Japanese need and reliance upon imported oil leaving them a six month supply. Japan, given a choice of withdrawing from China or be denied the resources they needed to continue their campaign, chose war. Prime Minister Hideki Tojo said, “We have nothing to fear in fighting the U.S. and Britain.” He ordered the Pearl Harbor attack in order to remove the last meaningful obstacle to turning the Pacific into a Japanese lake. He was executed for war crimes after the war. In a radio broadcast announcing the war to the public Tojo said \"Across the sea, corpses soaking in the water, Across the mountains corpses heaped up in the grass, We shall die by the side of our lord, We shall never look back\". Unfortunately for the Japanese three aircraft carriers escaped and a last minute decision to not destroy the shore facilities left the American Navy base intact. Thus it was the assault on Pearl Harbor would eventually lead to the downfall of Japan. Admiral Isoroku Yamamoto, who had been educated in the US and knew how big and wealthy we were, feared taking on the US was a mistake. He was to be proved right.  The Emperor World War II in the Pacific Japan's Offensive Aleutian Islands Campaign - Wikipedia Japan's Decision for War in 1941: Some Enduring Lessons Japan stuns world, withdraws from league https://en.wikipedia.org/wiki/Hideki_Tojo ",
            "date": "Answered February 1, 2018",
            "views": "18",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Hudson",
                    "user_href": "/profile/Melissa-Hudson-52"
                },
                {
                    "user_id": "Jon Trew",
                    "user_href": "/profile/Jon-Trew"
                },
                {
                    "user_id": "Joe Dweck",
                    "user_href": "/profile/Joe-Dweck-2"
                },
                {
                    "user_id": "Nima NikKhah",
                    "user_href": "/profile/Nima-NikKhah-1"
                },
                {
                    "user_id": "Daniel Yao",
                    "user_href": "/profile/Daniel-Yao-36"
                },
                {
                    "user_id": "M. G. Haynes",
                    "user_href": "/profile/M-G-Haynes"
                },
                {
                    "user_id": "Shmuel Kilstein",
                    "user_href": "/profile/Shmuel-Kilstein"
                }
            ]
        }
    ]
}