{
    "title": "Why did the Battle of Saraighat start? - Quora",
    "tags": [
        "Battle of Saraighat",
        "Historic Battles",
        "History of India",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suresh Choudhary",
                "href": "/profile/Suresh-Choudhary-159"
            },
            "answer_text": "After Nara Narayana died in 1587, the Koch kingdom (ensconced between the Mughal Empire in the west/south and Ahom kingdomin the east) was divided into the western Koch Bihar and the eastern Koch Hajo, ruled by his son Lakshimi Narayan and nephew Raghudev respectively. These two kingdoms were bitter rivals. In due course the Mughals formed an alliance with Lakshmi Narayan and the Nawab of Dhaka, a governor of the Mughals attacked Parikshit Narayan, the son of Raghudev in 1602 at Dhubri, the western most corner of present-day Assam. Following many battles, Parikshit finally accepted defeat and was sent off to Delhi; but his brother, Bali Narayana took refuge with the Ahoms, who were interested in keeping the Koch as a buffer between themselves and the Mughals. The first Mughal-Ahom battle took place in 1615 when the Mughals attacked the Ahoms, then under Pratap Singha. This resulted in a period of Ahom-Mughal conflicts fluctuating fortunes that ended with the Treaty of Asurar Ali in 1639. The Treaty fixed Barnadi river in the north bank and Asurar Ali in the south bank of the Brahmaputra as the boundary between the Ahoms and the Mughals. This, and the defeat of the Koch king at Pandu in 1641, resulted in a period of Mughal administration in Kamrup (Guwahati and Hajo). Taking advantage of the Mughal war of succession after the fall of the Mughal emperor Shah Jahan in 1658, Pran Narayan of Koch Bihar tried to occupy Koch Hajo, but the Ahoms under Jayadhwaj Singha took Guwahati and pushed him back beyond Dhubri. That the Ahoms reached Dhubri by defeating the Koch king and not the Mughals would form a central tenet in later Ahom diplomacy. Soon after, Aurangzeb occupied the Delhi throne. Mir Jumla II, pursuing Shah Shuja in Bengal, was appointed the Subahdar of Bengal in 1660 and asked to retake Assam. Mir Jumla marched in 1661 and defeated the Ahoms at successive encounters to finally take the Ahom capital Garhgaon. But the daga juddha (guerrilla warfare) of Atan Burhagohainand the rains succeeded in cutting off Mughal communication lines making it impossible for Mir Jumla to consolidate Mughal rule. Unaware of Mir Jumlas difficulties and unnerved by Baduli Phukan's defection, Jayadhwaj Singha sued for peace, an opportunity Mir Jumla seized on. The Treaty of Ghilajharighat (1663) brought an end to Mughal occupation of Garhgaon, but the conditions of this treaty were so severe that the Ahoms were soon resolved to reverse them. ",
            "date": "Answered November 26, 2017",
            "views": "43",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nix Shady",
                    "user_href": "/profile/Nix-Shady"
                },
                {
                    "user_id": "Jonty Rodes",
                    "user_href": "/profile/Jonty-Rodes-9"
                },
                {
                    "user_id": "Dachacal",
                    "user_href": "/profile/Dachacal"
                },
                {
                    "user_id": "Rupinder Rupi",
                    "user_href": "/profile/Rupinder-Rupi-1"
                },
                {
                    "user_id": "Herdeep Singh",
                    "user_href": "/profile/Herdeep-Singh-3"
                },
                {
                    "user_id": "Mukesh Choudhary",
                    "user_href": "/profile/Mukesh-Choudhary-41"
                },
                {
                    "user_id": "Gaurav Kumar Sikarwar",
                    "user_href": "/profile/Gaurav-Kumar-Sikarwar"
                },
                {
                    "user_id": "Aloak Menon",
                    "user_href": "/profile/Aloak-Menon"
                },
                {
                    "user_id": "Surya Sankarasubramanian",
                    "user_href": "/profile/Surya-Sankarasubramanian"
                },
                {
                    "user_id": "Luit Paran Baishya",
                    "user_href": "/profile/Luit-Paran-Baishya"
                }
            ]
        }
    ]
}