{
    "title": "Why was imperialism a problem, in World War 1? - Quora",
    "tags": [
        "World Wars",
        "World War I",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Jihoon Seo",
                "href": "/profile/Jihoon-Seo-3"
            },
            "answer_text": "The Original Question before being collapsed to another question was this. Why was imperialism one of the causes of World War 1? Imperialism would be a main cause of WWI especially between the major imperialist powers France and Britain vs. Germany, a nation who desired to be an imperialist power and imported expansion, but had hardship due to French and British intervention. Before WWI started Britain had more than one fifth of the world’s territory. France was highly influential in North Africa centering from Algeria which they have colonized since the 1840’s. Below is a map of 1914, right before WWI started. The light red means British colonies, and blue means French colonies. Excluding independent nations of Europe, a large portion of the world’s colonies are focused in just these two nations.  In the eyes of Germany, this was a severe discomfort. Germany has become a united nation since the 18th of January 1871, while the Franco Prussian war was nearly to its end. Through three wars of unification, in 1864 taking Schleswig, in 1866 excluding Austrian influence in the German unification, and in 1871 disabling French intervention in unification, unification was resolved. However, major domestic problems still existed and Bismarck was working hard to properly make a systematic German Empire. However, Bismarck made on great mistake while doing this (in my interpretation), which is giving too many power to the emperor and the chancellor, that when an inappropriate being is coronated, the German Empire would be in great danger. The German national assembly did exist, but the Kaiser could easily out-power them by giving emergency orders. Anyways, Wilhelm II came up to the throne after the death of Wilhelm I and Friedrich III. This ambitious, young expansionist wanted to make Germany a powerful colonial empire that can out-power France and Britain. However, this expansionist and nationalist political movement soon lead to the isolation of Germany in Europe. This is because Germany has been a concern after the Franco Prussian war as it changed the balance of power drastically. A big militarist empire in the center of Europe was unacceptable to many nations mainly France, Britain, and Russia. That is one of the reasons why the Triple Entente was formed. To suppress German influence, and gain the lead in expansionism. Such formation would also be highly linked to imperialism. Wilhelm II tried to disintegrate the Anglo-French alliance through many attempts most notably the Morocco Crisis in 1905. This was a failure and only resulted in the enhanced relation in the Anglo-French Entente and the exacerbation between the Franco-German relation which at this state was already at the state of war and extreme resentment.  A satirical illustration of the Morocco Crisis. Imperialism also lead to excessive armsrace. To build a more powerful army, influential colonial empire, gain superiority in resources, and take the lead in Europe. The European changes between 1871–1914 was drastic and preparation for war was imminent. The expansion of colonial empires also further gave confidence towards major European powers to carry out a massive war, but still gain economic and other superiority. This was a rather brief answer about imperialism and it being one of the causes of the First World War. I hope this was helpful. -Jihoon Seo- ",
            "date": "Answered September 19, 2020",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Seigle",
                    "user_href": "/profile/Mike-Seigle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "Why was imperialism a problem, in World War 1? It was a mixed blessing. The Brits, especially, needed the colonies to provide incredible men and resources, at the same time, the Germans knew how dependent the Brits were upon their colonies to they attacked the shipping, ports, and in Africa, the actual colonies. ",
            "date": "Answered July 18, 2017",
            "views": "180",
            "upvotes": "0"
        }
    ]
}