{
    "title": "Why are inventions important? - Quora",
    "tags": [
        "Innovation",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zisis Kontogounis",
                "href": "/profile/Zisis-Kontogounis"
            },
            "answer_text": "An example: A. We have 99,000 Americans Die of Healthcare-Aquired Infections Every Year https://www.healthline.com/.../aging-healthca... “A single gram of human feces—which is about the weight of a paper clip—can contain one trillion germs” . It's Not Just Beards — the Whole World Is Covered in Poop“A single gram of human feces—which is about the weight of a paper clip—can contain one trillion germs “The Journal of Applied Microbiology, co-authored by Gerba, examined the kitchens and bathrooms of 14 homes over 30 week. B. There is the new theory of “FECAL DUST” *FECAL DUST: It comes from fecal residue, left after wiping with t. paper (complete or, worse of course, incomplete) . Through drying and friction it turns out to dust and through air it travels to all surfaces, at first stage the uro-genital organs, causing UTI, and later to all house, causing food contamination. That phenomenon is more intense in hospitals, as the patients are usually debilitated, weak, with mobility restriction etc, particularly if there are hemorrhoids or anus hair and are unable to wipe properly. So the flying fecal dust reaches to all ward surfaces, dispersing its pathogenic microbes and so being the cause of the known HAI. The flying fecal dust emerges mainly from cloths of patients that can MOVE around, not the ones that are on pampers. Have in mind that in a 4-6 beds hospital wards, moisture and temperature conditions harbor microbes and also microbe density in the wards is a one more factor that increases their chance of developing antibiotic resistance.” It is obvious that the known hygiene measures, as is hand washing etc, are not enough, as now a new microbe source, up to now ignored, is added. CDC, responding to my relative question about fecal dust’s role in HAI, said they could not give me any answer positive or negative. That means that nobody had done any relative research work. C. the new $14 VERTICAL jet bidet, the KO BIDET, or a same vertical jet bidet, in order to reduce microbe dispersion, high HA Infection and UTI. It is thought to be very successful, as its use, instead of t. paper, offers more in convenience, dignity, 100% cleaning efficiency, even on hemorrhoid presence (immediate proof: the always clean underwear), time sparing, ecology, water economy and mainly hygiene ( it reduces: fecal dust* and so UTI, HA Infection, antibiotic resistant microbes), and also in reducing hospital functional cost by 10%. Also it is the only bidet could be used with raised toilets, and helps blinds, as its 100% cleaning effect free them from knowing when to stop wiping. Wouldn’t it be imporant to use the KO BIDET? “Who (and why) are they not wanting to know, if there is or not hazardous fecal dust in hospital wards?” ",
            "date": "Answered August 28, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dhiraj Kumar",
                "href": "/profile/Dhiraj-Kumar-869"
            },
            "answer_text": "Inventions are more important to make the human life easy. As the new inventions come , the life style of people are completely changing. With the help of new technologies we save lot of our costly time for other productive works. Through which you read this, it is also the part of the investion. New inventions explore and expand the existing things in new way. For example: also before the invention of oxygen, people inhale oxygen but they dont know , after the invention of oxygen people also take oxygen but its invitation is helpful in the medical treatment. Tere are lot of example which proves that the inventions are important for human life.Either it is in the field of technology, space, medical and any others… ",
            "date": "Answered April 6, 2019",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vicky Praise",
                    "user_href": "/profile/Vicky-Praise"
                },
                {
                    "user_id": "Angelica Joy Ibañez Yasay",
                    "user_href": "/profile/Angelica-Joy-Ibañez-Yasay"
                },
                {
                    "user_id": "Riya More",
                    "user_href": "/profile/Riya-More-25"
                },
                {
                    "user_id": "Asia Quitalig",
                    "user_href": "/profile/Asia-Quitalig"
                }
            ]
        }
    ]
}