{
    "title": "Why are the Apocrypha not part of the Bible? Who decided they shouldn't count? - Quora",
    "tags": [
        "Apocrypha",
        "The New Testament",
        "Bible Verses",
        "Bible Study",
        "Catholicism",
        "Theology",
        "The Bible",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Johnson",
                "href": "/profile/William-Johnson-1648"
            },
            "answer_text": "There are many reasons why the apocrypha were not included in the bible, but main reasons why the Old Testament apocrypha were excluded is because they did not meet the following criteria: 1) Was the book written by a prophet of God?2) Was the writer authenticated by miracles to confirm his message?3) Does the book tell the truth about God, with no falsehood or contradiction?4) Does the book evince a divine capacity to transform lives?5) Was the book accepted as God’s Word by the people to whom it was first delivered? Additionally, the book had to have received apostolic approval. For example, if it was quoted or recognized by one of the apostles in the New Testament, then it was considered to be written by an authentic prophet of God. Also, the 39 books in the Protestant Bible are the exact same books that were in the Hebrew Bible. Jesus quoted from or mentioned these books in the gospels, so these books are given authority based on that. Jesus did not quote or mention anything of the apocrypha books. Finally, some of the apocrypha contain false teachings, such as the teaching that almsgiving can save you from death and purge you of sin. Tobit 12:9 “For almsgiving saves from death and purges away every sin” And making atonement for the dead. 2 Mac 12:45 “Therefore he made atonement for the dead, so that they might be delivered from their sin.” So it was not so much that the early church “chose” which books could be canonized, they simply used criteria to confirm what really had already been established. ",
            "date": "Answered October 22, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Aguilar Jr.",
                    "user_href": "/profile/Miguel-Aguilar-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Travers",
                "href": "/profile/George-Travers-6"
            },
            "answer_text": "I’ve had more than a few conversations about the Apocrypha. From my experience, this group of a dozen Jewish books written between the Old and New Testaments (400 BC to AD 50) perplexes most Christians. A couple of reasons exist for this confusion. First, most have never read these books. That is, nobody knows what they say. And second, Catholics include these books in their Bible. Why would they include them in their Bible while Protestants do not? Because much confusion exists around the Apocrypha, let me give four reasons why I believe the Apocrypha shouldn’t be included in our Bible. 1. THE APOCRYPHA ITSELF INDICATES IT’S NOT SCRIPTURE The authors of the Apocrypha acknowledge that they aren’t prophets and don’t speak with divine authority like the Old Testament authors. The author of 1 Maccabees writes: So there was great distress in Israel, the worst since the time when prophets ceased to appear among them (1 Macc. 9:27). Prophets only existed in their ancient memories. This text, written around 100 BC, refers back to a time when the prophets were in their midst. The logical conclusion is that no prophet existed at this time who could speak from God. First Maccabees 14:41 also says as much: The Jews and their priests have resolved that Simon should be their leader and high priest forever until a trustworthy prophet should arise. Again, none of the Jews knew of a prophet who was speaking from God during the time of these events. Additionally, these books contain theological and historical errors. For example, the Book of Wisdom indicates that God created the world out of preexisting matter (11:17) which contradicts the rest of Scripture’s teaching that God created the world out of nothing. Moreover, the book of Judith incorrectly states Nebuchadnezzar was king of Assyria, when in fact, he was the king of Babylon (1:5). It’s hard to imagine how the Spirit could inspire documents containing both theological and historical error. When you couple the errors with the authors’ acknowledgment that no prophets existed during this time, we have good reasons to reject the Apocrypha as sacred Scripture. 2. JEWS HAVE NEVER ACCEPTED THE APOCRYPHA AS SCRIPTURE The Jews don’t believe the Apocrypha belongs in their Bible, and they never have. Josephus, the greatest Jewish historian of the first century, explained: It is true, our history has been written since Artaxerxes very particularly, but has not been esteemed of the like authority with the former by our forefathers. Josephus’ quote is especially helpful here. He indicates that ever since the reign of Artaxerxes (465-424 BC), the Jewish writings (the Apocrypha) have “not been esteemed of the like authority with the former (the Old Testament) by our forefathers.” In other words, the Jewish consensus was that while these writings might contain some helpful history and content, they don’t belong in the same category as the Old Testament texts. Rabbinic literature during the first couple of centuries also affirms this distinction. The Babylonian Talmud reports: After the latter prophets Haggai, Zechariah, and Malachi had died, the Holy Spirit departed from Israel. Based on this text, the Jews recognized that the Spirit stopped speaking through the prophets after Malachi died. Thus, the Apocryphal documents, which were written after Malachi, are not Spirit-inspired Scripture. In fact, no early or recent Jewish canon includes the Apocrypha. That the Jews reject these Jewish documents as Scripture is a strong indication that they don’t belong in our Bible. 3. THE NEW TESTAMENT DOESN’T REFER TO THE APOCRYPHA AS SCRIPTURE When reading the New Testament, you will find hundreds of quotations from the Old Testament. According to one count, Jesus and his apostles quote various portions of the Old Testament as Scripture 295 times. Not once, however, do they quote a text from the Apocrypha. The absence of references to the Apocrypha speaks volumes. After all, if these books were from God, why wouldn’t Jesus or his apostles quote from them? They don’t, because they believed the Old Testament canon was closed, and it didn’t include the Apocrypha. We see a couple hints of this in the New Testament. Jesus indicates in Luke 24:44 that the Jewish Scripture include, “The Law of Moses, the Prophets, and the Psalms.” In other words, Jesus breaks down the Jewish canon into three sections — the law, the prophets, and the writings (the Psalms represented the writings). Notice he doesn’t mention the Apocrypha. Jesus gives another indication of a closed Jewish canon in Luke 11:51. When talking to the Jewish leaders, Jesus says the Jews will be held accountable for all the martyrs from Abel to Zechariah. At first glance, it might appear that Jesus is making an alphabetical list, but that’s not what he’s doing. Remember, his alphabet was different from ours. Instead, Jesus makes a chronological list. Abel was the first martyr in Genesis (the first book), and Zechariah was the last martyr in Chronicles (the last book in the Jewish Bible). Note, the Jewish Bible contains all the same books as our present Old Testament, but their ordering of the books is different. Again, the New Testament provides strong evidence that the Apocrypha doesn’t belong in our Bible. 4. THE CATHOLIC CHURCH DIDN’T DECLARE THE APOCRYPHA WAS SCRIPTURE UNTIL THE REFORMATION The Roman Catholic Church officially declared that the Apocrypha was canonical at the Council of Trent in 1546. One must ask though if these books were authoritative, why wait over fifteen hundred years to declare their authority? It seems that Rome declared their canonical status as a direct response to the teachings of Martin Luther and the Protestant Reformers who rejected these books and their teachings. Perhaps the biggest reason these books were even up for discussion is because St. Jerome hesitantly included them in the Latin Vulgate Bible in AD 404. Because this was the official Bible of the Western Church for over a thousand years, it’s not hard to imagine how Christians began to think the Apocrypha was also Scripture. While Jerome included these books in his Vulgate, he specifically differentiated them from the rest of the Bible. He indicated that these books were “not for the establishing of the authority of the doctrines of the church.” That is to say, Jerome recognized that these books didn’t carry the same authority as Scripture. Only Scripture establishes Christian doctrine. The Apocrypha doesn’t have authority to do that. Knowing the origins of their inclusion in the Latin Vulgate and the late declaration of their canonical status is yet another reason to reject these books as Scripture. NOT SCRIPTURE Based on these four reasons, we can say with confidence that the Apocrypha doesn’t belong in our Bible. This doesn’t mean, however, that it’s completely useless. The Maccabees, for example, give us some useful history and tell us why Jews celebrate Hanukkah. Some of the books, like Tobit and Susanna, contain entertaining stories. Protestants even sing — albeit unknowingly — Christmas songs based on Apocryphal texts (It Came Upon a Midnight Clear). In other words, the Apocrypha is interesting and contains some historical details. In the end, however, it’s not Scripture and doesn’t belong in the Bible. ",
            "date": "Answered October 21, 2020",
            "views": "45",
            "upvotes": " Answer requested by Rodrigo Ortiz Vinholo"
        }
    ]
}