{
    "title": "Why is Portugal having so much debt, in spite of having a massive empire in history and looting many countries? - Quora",
    "tags": [
        "Economy of Portugal",
        "History of Portugal",
        "Government Debt",
        "Portugal",
        "Debt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Virgílio Dias",
                "href": "/profile/Virgílio-Dias"
            },
            "answer_text": "Debt is something that has followed Portugal closely from at least the 16th century, that is, since the golden age of the Portuguese empire. This has a structural explanation, that allows us to understand why a country with so many resources at its disposal, suffered a continuous regression in its position in the World. And this explanation goes beyond its frontiers, being a systemic explanation based on the socioeconomic changes that were happening in Europe at the time and which Portugal didn’t follow. When Portugal began its expansion, its empire revenues were based either on simple comercial exchanges or brutal plunder, depending on the regions. But in any case, what Portugal exported arould the globe was mainly precious metals (silver) and some low processed goods in low quantity (ie: cloths). What Portugal bought or extorted was gold, slaves, sugar, precious stones, silk, porcelain, spices,… These goods were then sold in Europe and with that money Portugal would buy the so needed cereals (probably its major import), luxury goods, textiles, metal ore, manufactured goods, and so on. With time, the prices of the goods that Portugal gained from its empire started to fall, but not its dependence on cereals or manufatured goods from Central Europe. Trusting in its empire resources, Portugal never developed its own and specially its industries, increasingly relying in imports to satisfy its needs. And maintaining an empire was very, very costly, either in money and manpower. On the other side, the capital that was gained in Central Europe was being used to develop their economy internally. This relation forced Portugal to indebt itself, with its first default happening in 1560. At this time England and Central Europe were starting a socioeconomic revolution that would create the first form of primitive capitalist relations of production. Meanwhile, Portugal was still in a typical feudal system, just like Spain, which also suffered a simillar fate. Until the 20th century Portugal’s position in the world would deteriorate even more, with many more defaults happening also, mainly in the 19th century. Portugal debt never ceased to exist, only flutuating along history. The country had a complete dependence on the resources coming from its colonies, specially until the independence from Brazil in 1822. But it continued until the complete end of the empire in 1974/1975. In its later decades massive investment was made into the colonies in order to use its resources, like copper, diamonds, oil, cotton, etc, while an expensive colonial war was fought. In its metropolis industrial development has always been very low and with a low incorporation of technology, relying in a subsistence agriculture well until the 20th century and on raw materials like tungsten (in WW2). After the end of the Portuguese empire nothing was made to change its produtive structure and today it’s a country completely reliant on the services sector, specially tourism. Debt has soured in the last two decades and this will continue along its associated problems. European Union will never allow this relation to change, maintaining Portugal as a peripheric country inside EU, serving only to provide some services, while absorving the products processed in the developed countries and increasing its debt. In fact, being inside EU only made Portugal’s productive strucure worse, with its forced production quotas and free trade. In conclusion: Portugal’s problem is and has always been a structural one. And that is why it will continue to have an huge debt. The empire only made things worse, with Portugal’s elites forcing the country’s dependence on its colonies, while delaying the development of its socioeconomic structure inside the country, fooling its people with the wealth coming from abroad. Today, without empire, this relation is maintained, with Portugal’s elite fooling its people with the wealth coming from abroad, but this time it’s not from its empire, but from EU, in form of debt and subsidies. ",
            "date": "Answered November 1, 2016",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajesh Prabhu",
                    "user_href": "/profile/Rajesh-Prabhu-23"
                },
                {
                    "user_id": "Michael Lazying",
                    "user_href": "/profile/Michael-Lazying"
                },
                {
                    "user_id": "Ardon Erel",
                    "user_href": "/profile/Ardon-Erel"
                },
                {
                    "user_id": "Hitesh Bhandari",
                    "user_href": "/profile/Hitesh-Bhandari-30"
                },
                {
                    "user_id": "Sandy Beshear",
                    "user_href": "/profile/Sandy-Beshear"
                },
                {
                    "user_id": "Frank Willmore",
                    "user_href": "/profile/Frank-Willmore-1"
                },
                {
                    "user_id": "Karthik Yogesh",
                    "user_href": "/profile/Karthik-Yogesh-1"
                },
                {
                    "user_id": "Oğuz Şerbetci",
                    "user_href": "/profile/Oğuz-Şerbetci"
                },
                {
                    "user_id": "Rui Estrela",
                    "user_href": "/profile/Rui-Estrela-2"
                },
                {
                    "user_id": "Andrew Hafenbrack",
                    "user_href": "/profile/Andrew-Hafenbrack"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy McDonald",
                "href": "/profile/Randy-McDonald"
            },
            "answer_text": "The second Portuguese empire, the one built after the loss of Brazil in the 1820s, was mostly not a source of wealth. Although Portugal did try to make its colonies profitable, and did succeed in some limited areas (Angolan oil, for instance), by and large its colonies were money sinks, being sites for massive expenditures of money and men that would have been better spent at home, in a country that was one of the least developed in non-Communist Europe. The first Portuguese empire, created from the 15th century on, may well have started off as a source of wealth, at least for the Portuguese kingdom, but it also carried significant costs. Defending a vast and far-flung empire was costly, especially for a small country vulnerable to its larger European neighbours. In the end, this first empire failed, its American heartland splitting off and less-distracted rivals (Britain, Netherlands) taking over most of its Indian Ocean holdings. Empire, broadly speaking, is not a source of wealth for countries. It can be a source of wealth for specific classes in countries, but quite frequently this wealth is not distributed to the country at large. That's perhaps the main reason why other countries abandoned their colonial empires in the course of the 20th century, Portugal under its reactionary leadership being last of all: Electorates didn't want to keep paying for things which benefitted only a few. ",
            "date": "Answered October 18, 2015",
            "views": "855",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandy Beshear",
                    "user_href": "/profile/Sandy-Beshear"
                },
                {
                    "user_id": "Orrla Munro",
                    "user_href": "/profile/Orrla-Munro"
                },
                {
                    "user_id": "Andrew Hafenbrack",
                    "user_href": "/profile/Andrew-Hafenbrack"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                },
                {
                    "user_id": "Orlando Barrios",
                    "user_href": "/profile/Orlando-Barrios"
                },
                {
                    "user_id": "Fábio Ribeiro",
                    "user_href": "/profile/Fábio-Ribeiro-2"
                }
            ]
        }
    ]
}