{
    "title": "Why do Irish people mostly have dark hair while Scandinavians have blonde hair? Aren't both Northern European people? - Quora",
    "tags": [
        "Scandinavia",
        "Blond Hair",
        "Irish Ethnicity and People",
        "European Ethnicities and People",
        "Ireland (island)",
        "Hair Color",
        "Genetics and Heredity",
        "Hair Care",
        "Hair"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph S. Herndon",
                "href": "/profile/Joseph-S-Herndon"
            },
            "answer_text": "The original question about Irish people with dark hair demonstrates lack of knowledge about the complexities of the human past. While there may be a typical look for people in certain areas, that does not mean there is no genetic diversity. Except for the most remote and inaccessible regions, you generally find people have very mixed origins. Studies by anthropologists have shown that knowledge of farming was spread through Europe by the movement of people of Mediterranean type during the Neolithic period. Such people were typically lightly built, with dark hair, and generally long, narrow skulls. People of this type reached Ireland in prehistoric times. Later, a different ethnic group with knowledge of bronze working settled in Ireland, and they tended to be taller, with heavier bone structure, and broader skulls—presumably also with light complexions and many redheads and blondes. All this occurred before knowledge of writing reached Ireland, so what is known comes from the study of ancient legends and archaeological discoveries of human remains and cultural artifacts. So, like most parts of Europe, the modern Irish people represent a blending of distinct genetic types. There would have been a small population of hunter-gatherers even before the Neolithic farmers arrived, and additional people after the Bronze Age: iron-age Celts, Vikings, and English in turn arrived as settlers or conquerors, but the basic genetic stock was already established. ",
            "date": "Answered January 9, 2020",
            "views": "227",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mae Tierny",
                "href": "/profile/Mae-Tierny"
            },
            "answer_text": "The Irish don’t have mostly dark hair. Blonde and red are the most common colors. There are of course other colors, and a combination of black hair, blue eyes and pale skin known as the ‘Black Irish’. They’ve been in Ireland a long time and Its hard to say where the coloring comes from. Possibly from some of the pre Celtic hunter/gatherers. My father was red haired early on and it darkened later, which may be what you are thinking of. Blondes also have a tendency to turn browner with age. ",
            "date": "Answered January 5, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                }
            ]
        }
    ]
}