{
    "title": "Why hasn't Britain maintained a similar degree of influence in its former colonies in Africa as France has? - Quora",
    "tags": [
        "Françafrique",
        "British Empire",
        "Great Britain",
        "France",
        "Africa"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Westmoreland",
                "href": "/profile/Ken-Westmoreland"
            },
            "answer_text": "There was always a gulf between the British and their colonial subjects in Africa, especially in parts of Nigeria where there was indirect rule through traditional leaders, and while there were constitutional links like the Queen as head of state after independence, all of them later became republics. Similarly, while commercial links remained, the former British African colonies did not have as much economic usefulness to Britain as they once did, and nor were they seen as cultural satellites, although the English language remained a key link, as did the similar education system, with exam papers marked in Cambridge. By contrast, France’s colonial policy was based on assimilationism, seeking to make its colonies as much like the metropolis as possible, hence those Africans who were assimilated or évolués being seen as no different from any other citizen of the Republic, including the right to vote in French elections. As a result, before becoming President of the Ivory Coast, Félix Houphouët-Boigny, was Minister for Public Health in the French government in Paris, representing the then colony in the National Assembly, and later popularised the term ‘Françafrique’ to describe the close cultural and economic links with France. ",
            "date": "Answered May 23, 2019",
            "views": "436",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Goh Duo Fu (吴多福)",
                    "user_href": "/profile/Goh-Duo-Fu-吴多福"
                },
                {
                    "user_id": "Anthony Middleton",
                    "user_href": "/profile/Anthony-Middleton-12"
                },
                {
                    "user_id": "Chidubem Egwim",
                    "user_href": "/profile/Chidubem-Egwim"
                },
                {
                    "user_id": "Michael Vargas",
                    "user_href": "/profile/Michael-Vargas-15"
                },
                {
                    "user_id": "Emmanuel-Francis Nwaolisa Ogomegbunam",
                    "user_href": "/profile/Emmanuel-Francis-Nwaolisa-Ogomegbunam"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Idy-Udoma"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marko Uremović",
                "href": "/profile/Marko-Uremović"
            },
            "answer_text": "French influence in Africa tends to be a bit misleading. Now this subject is something I still need to dwell into. But from my understanding, the relationship between France and its former colonies is not all it seems. In a nutshell, the French colonies in Africa were given political independence, without a war of independence. This was achieved by working out a deal between the African nations and France. Basically, it was agreed that France would receive favorable trade deals regarding resources and such, in return for the nations to receive political independence. So in a way, the African former colonies have political independence from France but are still a colony of France economically. So even though when you look at a map of Africa you see these independent nations, the reality of the situation is, France in its former colonies is still very deeply involved to ensure that these special deals are carried out. Thus this still explains the need to have the French Foreign Legion and so forth. ",
            "date": "Answered May 23, 2019",
            "views": "253",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Dunlop",
                    "user_href": "/profile/Peter-Dunlop-4"
                }
            ]
        }
    ]
}