{
    "title": "Why did the Early people migrate? - Quora",
    "tags": [
        "Human Migration",
        "Migrations",
        "Immigration",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "To find food, water and better living conditions. This so they could survive and reproduce. The average hunter-gatherer group could only be maintained in any region at between 35–50 individuals. Once this threshold was reached they would break up into two groups and one would seek new hunting and foraging areas. There were also those rare individuals, pairs or groups in urban arenas that went looking for adventure. ",
            "date": "Answered September 24, 2018",
            "views": "591",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanda Korb",
                    "user_href": "/profile/Amanda-Korb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Brooks",
                "href": "/profile/Jack-Brooks-35"
            },
            "answer_text": "Early man moved from location to location to meet a need or needs: 1. Water - - Need for water for tribe or family survival. 2. Need for food - - as herds moved the people that needed the herds for meat and skins moved with the herd. 3. Shelter - - Early people relocated from shelter to shelter based on the needs of the family or the needs of the tribe. 4. Environment - - as the temperature decreased or increased and the rains came or the drought lasted for season after season early people moved to ensure their survival. 5. Plant life - - as the plants needed for the herds to survive diminished the people would need to move in order to feed their herds. I am sure their are other needs but they would all be keyed to the survival needs of early people. ",
            "date": "Answered July 17, 2018",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amanda Korb",
                    "user_href": "/profile/Amanda-Korb"
                },
                {
                    "user_id": "Rex Byars",
                    "user_href": "/profile/Rex-Byars"
                }
            ]
        }
    ]
}