{
    "title": "Why do people always assume that colonialism was such a bad thing? - Quora",
    "tags": [
        "Imperialism",
        "Colonization",
        "Colonialism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emmanuel-Francis Nwaolisa Ogomegbunam",
                "href": "/profile/Emmanuel-Francis-Nwaolisa-Ogomegbunam"
            },
            "answer_text": "Hobson and Lenin had it right: the Great Power project was imperialist. Colonialism functioned as a subset of imperialism. Not all provinces within the European empires were colonised, but the thinking of the time saw all the provinces, inevitably, as colonies in the long-run. The weaker races would give way before the stronger. The United States of America and Australia remain the only imperial provinces where this occurred. In the rest, the weaker races largely held their own. Empires are created by conquest; colonies, in contrast—by necessity—involve an element of genocidal intent. This is because the impetus for imperialism and colonialism derive from different premises. Empires seek control over people, colonies bring their people. Empires settle for tribute, colonies grasp for land. Empires extol their diversity, colonies are inherently Manichean. The Nazis conquered the French, they looked to colonise the East. I believe the concepts are now properly delineated. Colonialism was simply unconscionable, even by the standards of the time. It involved not just the slaughter of millions, but the expropriation of their territory, a process, mind you, that went against the existing international laws of the time. Contra Locke and co, the lands of the Americas were, in fact, not Terra Nullis. Because the European powers had, in many treaties and through their actions, recognised native sovereignty over those territories, that meant that all future decisions on the disposition of their territories could only legally be made with their consent. But to paraphrase Andrew Jackson, the law does not enforce itself. On the other hand, imperialism is one of the oldest forms of inter-ethnic contact known to man. The run-of-the-mill conquests were not very violent, by colonial standards. Morocco and Algeria were both parts of the French Empire, yet the French were bloodier in Algeria because the latter was a colony. Similarly, the Scottish and the Irish have their grievances towards the English Empire, but the distinction between province and colony among both is very clear. That said, the provinces of the European Empire were poorly run. Again, this is incontestable, I cannot think of a former colony whose statistics are not better now than under imperial control. In contrast to the often paranoia driven policies of colonies, the reasons for the failures of imperial rule are refreshingly rational: The most important was the racism of the era. It inspired in most colonial officers an attitude of benign neglect towards their districts. The watchword of imperial rule was not development but stability. Second, is the fact that neglect is always the characteristic of imperial peripheries. At a time of impending, later actual, global conflagrations, as well as fears of domestic unrest, matters of colonial development were always on the edge of the imperial mind; exceptions to the rule duly granted. Hence a simple formula for predicting the success of an imperial province was how well integrated its people were in its running. However, due to the racial lenses of the era, more often than not, the most well-integrated provinces were those racially nearest to the imperial ruling classes. The distant races would have to settle for despotisms that ran the gamut from destructive to paternalist. Finally was the fact that the 19th-century empires were unicorns: democratic empires. That meant following the easy route of appeasing co-nationals at the expense of natives, the imposition of one-way migration routes and most importantly, the denial of tax transfers necessary for colonial development. The voters would not have it any other way. Colonies were expected to pay their way. For the poorest that meant the substitution of social amenities for security. Ironically, the structure of the imperial State often meant that colonial savings were invested in the imperial capital rather than in the provinces. Both systems were, of course, predicated on violence, such is the characteristic of the State but unlike imperialism, colonial violence was intrinsic to the system and applied directly. Imperial structures, in contrast, were often exercised through preserved local institutions, and as such, were less damaging to the social fabric. In sum, colonialism was always bad, some imperial provinces, in contrast, were treated fairly benignly. The Nazis conquered Denmark and Poland with different levels of violence. Personally, it costs me nothing to always make that distinction as individual cases arise. ",
            "date": "Answered September 17, 2019",
            "views": "41",
            "upvotes": " View 156 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amaka Nzenaguorae Dawn",
                    "user_href": "/profile/Amaka-Nzenaguorae-Dawn"
                },
                {
                    "user_id": "Eklavya Vijaya",
                    "user_href": "/profile/Eklavya-Vijaya"
                },
                {
                    "user_id": "Jessie Chapman",
                    "user_href": "/profile/Jessie-Chapman-24"
                },
                {
                    "user_id": "Vinesh Pendurthi",
                    "user_href": "/profile/Vinesh-Pendurthi"
                },
                {
                    "user_id": "Tinsai Worke",
                    "user_href": "/profile/Tinsai-Worke"
                },
                {
                    "user_id": "Kerstin Ericsdotter",
                    "user_href": "/profile/Kerstin-Ericsdotter"
                },
                {
                    "user_id": "Noel Kodhe",
                    "user_href": "/profile/Noel-Kodhe"
                },
                {
                    "user_id": "Jb Brown",
                    "user_href": "/profile/Jb-Brown-39"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Andrew Lim",
                    "user_href": "/profile/Andrew-Lim-185"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Keres Carter",
                "href": "/profile/Linda-Keres-Carter"
            },
            "answer_text": "Those of us who have lived through it nearly always consider it a ruinous, torturous affair that forever changes you. Most people think of Africa or the Americas as THE places where colonization was a problem. We lived through 530 years occupied by the Ottomans, up until the 20th century, and we remember it as an ordeal. Imperialists are all assholes. I don’t care where they come from, what they look like, what religion they’re butchering, cherry-picking the parts that will allow them to do their evil deeds. They have ‘othered’ their neighbors and feel free to do whatever immoral things suit their agenda. They stole so many of our children that their ruling class presently looks like us. If you were cursed to have a beautiful daughter, you would likely lose her, kidnapped and sold into a harem. They were literally taxing us our first-born sons. The blood levy. Devshirme. If your son was bright and strong, he’d be stolen to be turned into a ‘janissary’ — a goon that would come back to persecute you. Our family members weren’t being sold downriver. No, they were being stolen and brainwashed into the equivalent of Klanners to come back and burn US on our front lawns. Lynching was too humane. Impalement was the order of the day. I’ve heard people defending the Islamic empires as more humane than the others. They allowed religious freedom when others were conducting their Inquisitions. I’ll let you in on something. They had cherry-picked Shariah law that called for us to be considered “kaffirs”, yep, that word they used in South Africa as an “N” word equivalent. It’s an Arabic word that means “Infidel.” The testimony of an Infidel against a Believer was inadmissible in court. Essentially, you have no rights they are bound to respect. There are passages in the Quran that dictated us colonized Christians were ‘People of the Book” and were to be given more rights than that, but hey, when you’re in a position to enrich yourself off the backs of people you’ve designated peonage slaves, what are you going to choose? Sure, they wanted us to remain Christians. That way they could very profitably exploit us. Life for the average Serb during the colonization was very confined. You had some rights while on the land you were to be working. The intent was to leave you to your work. But the minute you took to the open road, it was open season. On you. If you passed a Turk or a Moslem convert you were to get out of the road, hat in hand, and let him pass. And you prayed he wouldn’t brutalize you, because if he did you would have no recourse. Your testimony against him was inadmissible. It’s very clever lawmaking, since it turns any Believer into a potential vigilante who can do whatever he pleases to keep the colonized in their place. Jim Crow in a bottle. After 500 years of this, we’d had enough. We successfully rebelled and kicked the MF’s out of our country. You can still hear them ruing what heathens we were to massacre them after so many years. They were living in homes they’d had for centuries. Well, if you’re treating your neighbors like proper neighbors that would certainly be a reasonable expectation. But you can find documentation of debates in the late 1800’s about whether or not they should finally allow their Serbian peons to testify against them in court. Too little, too late. We kicked them out. It took a hundred years to complete, but we did it. I’ve heard some of them claiming more casualties than there were people in the country. You know how that goes. BTW, we were founding members of the Non-Aligned Movement. That’s basically the countries of formerly colonized peoples. The first meeting was in Belgrade. We’re no longer members, since the NATO colonization. We call the American ambassador “governor” behind his back. We are no longer a FORMER colony. We occupy some of the most militarily strategic real estate on earth — the thoroughfare between Europe and the Middle East. This shit will never end. Not for us. I’ll spare you very many details on the kind of treatment we’ve gotten from our “Christian” neighbors since then. We made it back into Europe just into time to go to the top of the Aryan Supremacist “To Do” list as racially inferior Orientalized mongrels. The most sadistic exterminations of WWII you never heard about. That has to do with that militarily strategic thoroughfare business I mentioned above. Somebody will always want a piece of us, one way or another. Oh yeah, people are always complaining we have a “Victim Mentality.” Usually, the ones victimizing us. ",
            "date": "Answered February 14, 2020",
            "views": "297",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amaka Nzenaguorae Dawn",
                    "user_href": "/profile/Amaka-Nzenaguorae-Dawn"
                },
                {
                    "user_id": "Musa Johnson",
                    "user_href": "/profile/Musa-Johnson-2"
                },
                {
                    "user_id": "Andrea Uboldi",
                    "user_href": "/profile/Andrea-Uboldi-1"
                },
                {
                    "user_id": "Bootsy Claire",
                    "user_href": "/profile/Bootsy-Claire"
                },
                {
                    "user_id": "Mike Tisdale",
                    "user_href": "/profile/Mike-Tisdale"
                }
            ]
        }
    ]
}