{
    "title": "Why did the Mughals kill millions of Hindus? - Quora",
    "tags": [
        "Mughal Empire (1526–1857)",
        "Hindus",
        "Killing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Antony",
                "href": "/profile/Thomas-Antony-30"
            },
            "answer_text": "Today, the difference between religions has gone to the level of terrorism and the peace is not only cracked into pieces but also ground to fine powder. The ignorant fanatics of a religion are killing the innocent people of other religion. Such killing is not Jihad of Islam and also not Dharma Yuddha of Hinduism. You may argue that Mohammad brought the unity of religions through sword and therefore conversion of other religion into your religion must be through violence. In the time of Mohammad, the religions were many and were quarrelling with each other by swords and that was affecting the peace to a great extent. Mohammad preached the unity of religions and finally had to use the sword only to stop several swords fighting with each other. That is not the situation in the present time. In every country all the religions are co-existing peacefully like the different members of the same family. The reason is that the humanity is well advanced in education and improved a lot in the faculty of logic through advancements of science and technology. Of course, you are free to teach your religion or even prove the defects of other religion through arguments and debates. If people are convinced, they will follow your religion. If not, you have to leave them peacefully. Q’ran says that one should preach about Allah and leave the person with safety. Mohammad never said to use the sword when the religions are co-existing with peace and love to each other. Gita came out from a war. But the war was not based on the deference in the religions. It was based on eradicating the injustice used to grab the property of some brothers by their brothers. Lord Krishna tried a lot for compromise. It was a war based on the division of property and not on the division of religions. Even in that war, innocent people living in villages and cities were not killed through terrorism. Only selected soldiers fought with each other in a selected place called Kurukshetra. You should not say that Aswatthama killed the people in sleep in the midnight and this is a part of Dharma Yuddha [Jihad]. But Aswatthama killed the soldiers of other side only and never entered the city of Pandavas and killed innocent people as done by terrorists today. Seeing these cruel activities of terrorism based on the difference in the religions, all the three human incarnations [Krishna, Jesus and Mohammad] from heaven are deeply pained because the same absolute God exists in all the three forms, who is the single creator of the entire humanity. The father is terribly pained if one of his sons kills the other son. This entire earth is the property of the absolute God since it is created by Him. No human being created any region of this earth and therefore the absolute right of this entire earth belongs to the absolute God only. It is the climax of foolishness of human beings to fight and kill each other for the sake of the borders of divisions of countries and for the ownership of any region on this earth. The representatives of all the countries on this earth should unite and form a Central Government to control the terrorism in any country. It should be responsible for the peace of the entire world. If the peace is achieved in entire world in this way, it is a real achievement of the success of this holy Christmas. ",
            "date": "Answered November 7, 2016",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayesh Nair",
                    "user_href": "/profile/Jayesh-Nair-25"
                },
                {
                    "user_id": "Ajai Vaidyanathan",
                    "user_href": "/profile/Ajai-Vaidyanathan"
                },
                {
                    "user_id": "Nalin Savara",
                    "user_href": "/profile/Nalin-Savara"
                },
                {
                    "user_id": "Jayanth Rajaram",
                    "user_href": "/profile/Jayanth-Rajaram"
                },
                {
                    "user_id": "Snegalatha",
                    "user_href": "/profile/Snegalatha"
                },
                {
                    "user_id": "Rahul Singh Patel",
                    "user_href": "/profile/Rahul-Singh-Patel-5"
                }
            ]
        }
    ]
}