{
    "title": "Why is the act of shouldering a pistol illegal? - Quora",
    "tags": [
        "Handguns",
        "Gun Control Laws",
        "Weapons",
        "Guns and Firearms",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Williams, Jr.",
                "href": "/profile/Frank-Williams-Jr-4"
            },
            "answer_text": "Well you see, it all started in 1934… Prohibition had just ended, but criminals and gangs were still running rampant. Stories abounded in the news and cinema about said criminals running around with sawed off shotguns and cut down Thompsons. Something had to be DONE! Enter the National Firearms Act. It aimed to heavily tax many things, including all hand guns and any rifle or shotgun with a barrel below a certain length. The hand gun part was eventually dropped, but the short barreled rifle/shotgun part stuck. Fast forward roughly 70 years and firearms the likes of which the NFA never dreamed are available. There are AR and AK style pistols that have barrels less than 16\" long and don't need tax stamps. The AR pistols are particularly appetizing because they have a buffer tube sticking out the back. Somebody decides to put a simple rubber strap on the back and market it as an “arm brace\" for people who wanted to shoot these kinds of firearms but lacked the ability to hold such a heavy firearm with one hand. It was quickly “noticed\" that one could shoulder the brace much like a normal stock. This breifly caused the ATF to panic and issue a warning that anyone who shouldered a braced firearm would be arrested for violating the NFA. This went of for a few months until someone pointed out that having a brace on your pistol did not fundamentally change the function of the weapon. Personally I think the introduction of pistol braces has killed the NFA. The NFA is dead, long live freedom. ",
            "date": "Updated August 13, 2020",
            "views": "1064",
            "upvotes": " View 788 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill Collins",
                    "user_href": "/profile/Bill-Collins-57"
                },
                {
                    "user_id": "Vitaly Vinogradov",
                    "user_href": "/profile/Vitaly-Vinogradov-1"
                },
                {
                    "user_id": "Jon Crowley",
                    "user_href": "/profile/Jon-Crowley-3"
                },
                {
                    "user_id": "James Smart",
                    "user_href": "/profile/James-Smart-63"
                },
                {
                    "user_id": "Ken Brown",
                    "user_href": "/profile/Ken-Brown-172"
                },
                {
                    "user_id": "John Guidry",
                    "user_href": "/profile/John-Guidry-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nicholas-Barber-2"
                },
                {
                    "user_id": "Lucas Lu",
                    "user_href": "/profile/Lucas-Lu-17"
                },
                {
                    "user_id": "Michael Miller",
                    "user_href": "/profile/Michael-Miller-1157"
                },
                {
                    "user_id": "Michael L Boles",
                    "user_href": "/profile/Michael-L-Boles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Wallace",
                "href": "/profile/Peter-Wallace-50"
            },
            "answer_text": "The ATF would view the act of shouldering a pistol as that it probably has a stock. Because it has a stock, it is now a rifle. Of course, there are arm braces. The ATFs view is that there really is no correct or wrong way to shoot a pistol as long as it doesn’t have a buttstock. These “arm braces” were never designed to go on the shoulder. Since these technically aren’t buttstocks for the shoulder and there’s no “wrong” way to fire a pistol, you could shoulder them. The ATF did put a hold on the arm braces for a while because they were getting so many letters from with that expressed people’s desire to circumnavigate the NFA laws that they made a rather confusing decision. They have said that you’re allowed to shoulder them, but building one with the express purpose of using it as a go-around of the NFA is illegal….but the reality is that everyone who buys/uses them does so to get around the NFA but proving they wanted to use it to get around the NFA laws is impossible to prove. ",
            "date": "Answered September 24, 2017",
            "views": "6",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lane Johnson",
                    "user_href": "/profile/Lane-Johnson-44"
                },
                {
                    "user_id": "Phillip Minigh",
                    "user_href": "/profile/Phillip-Minigh"
                },
                {
                    "user_id": "Zed Feral Child",
                    "user_href": "/profile/Zed-Feral-Child"
                },
                {
                    "user_id": "Nicolas Perez",
                    "user_href": "/profile/Nicolas-Perez-88"
                },
                {
                    "user_id": "Jake Denny",
                    "user_href": "/profile/Jake-Denny-6"
                },
                {
                    "user_id": "Mohammad Noor",
                    "user_href": "/profile/Mohammad-Noor-92"
                },
                {
                    "user_id": "András Jónás",
                    "user_href": "/profile/András-Jónás"
                },
                {
                    "user_id": "Anthony Surowitz",
                    "user_href": "/profile/Anthony-Surowitz"
                },
                {
                    "user_id": "Aaron Weinberg",
                    "user_href": "/profile/Aaron-Weinberg-1"
                }
            ]
        }
    ]
}