{
    "title": "Why are most top table tennis players Asian? - Quora",
    "tags": [
        "Table Tennis Players",
        "Table Tennis",
        "Professional Athletes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shailendra Singh Nama",
                "href": "/profile/Shailendra-Singh-Nama"
            },
            "answer_text": "The Chinese are known for their \"hard-work\" and \"punctuality\" all over the world.My paradigm regarding them classifies them as one of the best professionals to work with for a thriving business. The connection gets along pretty well in Sports.Chinese players have won the men's World Championship 60% of the time since 1959; in the women's competition, Chinese players have won all but two of the World Championships since 1971. At the 2008 Beijing Olympics and 2012 London Olympics, China won all possible gold medals.The Chinese team has more depth than any other team in the world. The primary training center is in Beijing. The team is made up of 96 players – 24 men, 24 women, 24 boys and 24 girls.Players are given “tryouts” early on, usually with trips to major tournaments in Europe or elsewhere, to see how they do internationally.  From this, the Chinese judge if this player has the potential to become a star.A huge advantage China has,comes from their depth. If a player on the national team isn't working hard, doesn't do well internationally, or has technical flaws hurting their progress, there is always another “hungry” player with potential on the outside waiting to get in.In many countries (including USA), the national team is selected in a Team Trials. This may be the fairest way of choosing a team, but it may not the best way to develop a dominating team. In most countries – including USA – 90% of the training and team funding goes to “flawed players” who have no chance of ever winning medals.Chinese coaches probably wouldn’t have selected anyone over age 22. One option is to have either a separate “youth” team made up of under 22 players who train as part of the national team. Many countries already have these, but these players, along with older players who can challenge the best players in the world, need to be the focus.The Chinese train long and hard. Typically they do seven hours of training each day – both table play and physical training away from the table.  In the mornings, they normally do physical training away from the table, and serve practice. There is a morning and an afternoon training session, usually six days a week. (Training includes both regular practice with a partner, and multiball training with a coach. This is the same for most countries.) Some players play extra practice matches at night or on off days. Players generally get 12 days off per year, although they also get rest days after major tournaments (which often are travel days).One huge advantage China has over the rest of the world is their practice partners. Typically, in most countries, members of the national team train together. However, in China, much of the training is with “professional” practice partners. Instead of players always taking turns on drills, all the training focuses on the one player. (This is especially helpful for the women, who practice with male practice partners who are usually stronger then the women players.)Their technique of 2 ON 1 involves having two practice partners for one player. This is a luxury that other countries can’t afford, but that China, with their playing depth, can. Two practice partners are selected, one with a very strong forehand, one with a very strong backhand (but also a good forehand), and they learn to play together as a team. Together, they do drills with the best Chinese players. With one player only playing forehand from the forehand side, and the other only playing from the backhand side (favoring backhand, but also playing forehand from backhand as top players do)The Chinese team meets at least weekly with sports psychologists. (This is common practice in other countries as well.)Chinese children are tested at a very early age for sports skills. Those that test well are often put into special sports schools(as small as 5) . ",
            "date": "Updated November 23, 2012",
            "views": "62",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vasanth",
                    "user_href": "/profile/Vasanth-28"
                },
                {
                    "user_id": "Kriti Chowdhary",
                    "user_href": "/profile/Kriti-Chowdhary-6"
                },
                {
                    "user_id": "Chwee Teo",
                    "user_href": "/profile/Chwee-Teo"
                },
                {
                    "user_id": "Rutvik Dhodi",
                    "user_href": "/profile/Rutvik-Dhodi"
                },
                {
                    "user_id": "Kuldeep Kalia",
                    "user_href": "/profile/Kuldeep-Kalia-3"
                },
                {
                    "user_id": "Toke Nygaard",
                    "user_href": "/profile/Toke-Nygaard"
                },
                {
                    "user_id": "Sohail Shaikh",
                    "user_href": "/profile/Sohail-Shaikh-168"
                },
                {
                    "user_id": "Zura Fridge",
                    "user_href": "/profile/Zura-Fridge"
                },
                {
                    "user_id": "Shuai AMO",
                    "user_href": "/profile/Shuai-AMO"
                },
                {
                    "user_id": "Henry Yap",
                    "user_href": "/profile/Henry-Yap-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Cowart",
                "href": "/profile/Steven-Cowart"
            },
            "answer_text": "TT is a regular feature of Asian culture.  In many locales you'll find cement tables outdoors used by everyone, regardless of the materials.  As a sport, TT is often unparalleled.  Children are recruited at a very early age to join camps for intensive training.  These kids eat, sleep, talk and play TT 24/7/365.  They drill endlessly.  I saw one video of a Chinese camp where a little boy was nailing forehand after forehand as balls were tossed on the table by his mentor.  This goes on for hours, every day.  But it's not just TT on the agenda.  There's all kinds of strengthening and endurance drills as well.  There is nothing like these camps in the Western world.  Even in those countries where TT rules supreme, the typical child is recruited relatively early to attend seasonal training courses, mixed with tournaments and exhibitions.  As rigorous as these other lands train their young, none can hold a candle to the Chinese programs.  Of late we are seeing hot competition from Korea and Japan, who are taking steps to bring their youth into competition at earlier ages than ever before.  TT means much more to the Asians (and many others) than we could hope to understand in the USA.  Please understand, I'm not writing about China or any other nation taking kids from their parents without consent.  It's nothing like that.  They treat TT with a reverence unmatched elsewhere. ",
            "date": "Answered July 29, 2012",
            "views": "109",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vasanth",
                    "user_href": "/profile/Vasanth-28"
                },
                {
                    "user_id": "Chwee Teo",
                    "user_href": "/profile/Chwee-Teo"
                },
                {
                    "user_id": "Morhaf Sa",
                    "user_href": "/profile/Morhaf-Sa"
                },
                {
                    "user_id": "Zura Fridge",
                    "user_href": "/profile/Zura-Fridge"
                },
                {
                    "user_id": "Sarvesh Chitodkar",
                    "user_href": "/profile/सर्वेश-चितोडकर-Sarvesh-Chitodkar"
                },
                {
                    "user_id": "Tony Franchina",
                    "user_href": "/profile/Tony-Franchina"
                },
                {
                    "user_id": "K.C. Cheng",
                    "user_href": "/profile/K-C-Cheng-1"
                },
                {
                    "user_id": "Bishwajit Paul",
                    "user_href": "/profile/Bishwajit-Paul-4"
                },
                {
                    "user_id": "Eiliv Ulvestad",
                    "user_href": "/profile/Eiliv-Ulvestad"
                },
                {
                    "user_id": "Monica Smith",
                    "user_href": "/profile/Monica-Smith-144"
                }
            ]
        }
    ]
}