{
    "title": "Why did the Indian Rebellion of 1857 fail? - Quora",
    "tags": [
        "Indian Defeats",
        "Indian Rebellion of 1857 (Sepoy mutiny)",
        "Indian Subcontinent Independence War of 1857",
        "Indian Independence Movement",
        "History of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diksha Mishra",
                "href": "/profile/Diksha-Mishra-7"
            },
            "answer_text": "1857 India was a seething cauldron of discontent, unrest, deeper misery and frustration. Indians were gritting their teeth and becoming restless under British Raj; having suffered degrees of Social, Economic, Religious and Political oppression. 100 years of exploitation, 1000s of assualting bills and rules, loss of wealth, status, dignity, respect and freedom; the revolt was now brewing in the minds of civilians. The stage was almost set, it could start any day now. It took one particular development to trigger the Revolt into manifestation. The gunpowder like revolt was ignited by the induction of superior “Enfield Rifle” that made use of greased paper for lining the catridge. The greased paper used as a cover was made of animal fat of cows and pigs and had to be bitten off with teeth for rifle loading purposes. Sepoys of East India Company were forced to obey and Hindus and Muslims alike viewed it as a blasphemy of highest degree. This time the blatant disregard of their(Indians) religious sentiments was perhaps a one too many to meekly accept and abide. This time they took it to heart and acted on their animalistic instincts. It immediately trigerred a mass un-planned uprising of sepoys(Indian Soldiers) and civilians. The revolt started off like an unprecedented Forest Fire; swift and uncontained. It spread to most parts of North India, Gujarat, Maharashtra and Deccan. The South to a better extent remained oblivious and uninvolved. Blood, sweat, tears, money, lives and all they ever had was poured into the revolt and yet it culminated into a failure. Reasons: The Revolt from it’s inception and till it’s climax was unplanned and haphazard in character. Lack of strategy, discipline, vision and ability to act and decide was traunt from the abilities of Indain Mutineers and led to heavy losses.The unrehearsed impromptu Revolt could still have been successful but for the lack of resources and funds. The Indians did not owned the advantage of modern weapons and majority fought using crude arms like pick axes and alike. They were facing one of the most powerful armies of their time and their ammunition was highly outdated. Also the grains, food, livestock and replinshment were limited.Although the soldiers displayed spontaneity in battles but once a district or province had been conquered, the British pruned off and an Indian ruler elected in it’s place, the people didn’t knew what to do next. The rulers appointed were inactive and indecisive and this created a vaccum in the political scenario. In their efforts and protests they remanined passive participants. The British took advantage of this stagnant vaccum and therfore reclaimed lost territories within months.The revolt was primarily led by sepoys and peasants, the very common and low stratured men. The middle class and upper class refrained from getting involved and held different views of freedom and British Rule. The middle class felt that the British would liberate Indians from ignominy of un-education and hence abstained from the revolt. The upper and ruling class saw their interests being uprooted and didn't participate. The working and lower class was left to fumble and grope with a Revolt that was beyond their facility and means. To bear the expenses and brunt they did exhibit undying courage but valour wasn’t enough to succeed.Consequently many upper class Zamindars and rulers supported the British to suppress the revolt. They supplied Men, Capital, Grains etc in assistance. They wanted to downtrod the renegades and thought their estates and finances to be best protected under the British servitude. They even played the part of double agents and betrayed the plans of rebels to the British, aiding them further to quash the rebellion.This treachery caused Indians to suffer heavy and irreplaceable losses. The popular leaders of revolt; Jhansi ki Rani, Tantia Tope, Kunwar Singh and Begum of Awadh were either tracked down and killed or were exiled off in a pitable deliverance. In the absence of the leaders the rebels lost their rallying point and anchor, becoming clueless as how to heed next.Lastly Britain- the most advanced nation of the time poured in all the efforts, resources, men, money, arms into the suppression of Revolt. India was a colony too precious to be lost and heavy costs were borne to repress the aggression. Ironically enough, after subduing and defeating the forces, the cost of crushing the revolt was recovered from the Indians through heavy taxation and passing of abominable laws.The 1857 Revolt was a revolutionary tempest that could have caused the British to lose one of their richest and most valuable colonies had it been a success. Historians speculate and it was even later admitted by the British that had all sections of Indian society stood together in the Uprising, than the year 1857 would have marked the end of Imperial Rule in India. ",
            "date": "Updated October 21, 2018",
            "views": "71",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swathipriya Selvaraju",
                    "user_href": "/profile/Swathipriya-Selvaraju"
                },
                {
                    "user_id": "Peter Fuller",
                    "user_href": "/profile/Peter-Fuller-13"
                },
                {
                    "user_id": "Indu Shekhar Mishra",
                    "user_href": "/profile/Indu-Shekhar-Mishra-1"
                },
                {
                    "user_id": "Kelly Dorbyn",
                    "user_href": "/profile/Kelly-Dorbyn"
                },
                {
                    "user_id": "Vikrant Singh Tomar",
                    "user_href": "/profile/Vikrant-Singh-Tomar-4"
                },
                {
                    "user_id": "Deepak Garg",
                    "user_href": "/profile/Deepak-Garg-424"
                },
                {
                    "user_id": "Babul Kutum",
                    "user_href": "/profile/Babul-Kutum"
                },
                {
                    "user_id": "Yogesh Dubey",
                    "user_href": "/profile/Yogesh-Dubey-2"
                },
                {
                    "user_id": "Young Lee",
                    "user_href": "/profile/Young-Lee-349"
                },
                {
                    "user_id": "Pallabi Sen",
                    "user_href": "/profile/Pallabi-Sen-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Baba Vickram Aditya Bedi",
                "href": "/profile/Baba-Vickram-Aditya-Bedi"
            },
            "answer_text": " Lal Qila (Red Fort), 1857, Delhi India. (Binet Agrarwal)  India 1857, with a backdrop of the Jhansi Fort. The failure of the First War of Independence was due largely to one factor, and this was that not all Indians wanted a restoration of the Mughal Empire. Looking back at the events leading up to the revolution, it was clear that there was hardly any true support for the British East India Company left in India. The Indians of that era were well aware that India had gone from the wealthiest and largest economy in the world to becoming a land of famine and socioeconomic exploitation which simply was unprecedented in Indian History. In fact the War of Independence would actually go well for the Indian side well into the war, and there was a great chance that the last Indian state to fall to the British, which was the Sikh Empire would more than be ready to rebel also. However, rebel leaders would go the court of the Emperor of Hindustan, Bhadur Shah Zafar, and have him bless the rebellion. The Emperor was only a ruler in name, as all he really had control over were some streets in Delhi, some remaining residences, and governmental buildings. But, he represented to many the memory of Hindustan and it’s magnificence. At a different level, he was giving legitimacy to the rebellion for many Indians, however this legitimacy came at a very heavy cost.  Indian Soldiers rebel in Kolapur, 1857. The rebellion would largely end because of the attack of Delhi which was to follow. Here a contingent of cooperating Indian troops would take part in putting down the rebellion. In another quadrant, the lack of over all planning and cooperation was lacking in the nationalist side. Instead of using superior Indian numbers to simply storm any disrupt and destroy supply routes and any support the British could rely on, the rebels stopped short very short to the complete uprooting of the control of India by just a few hundred thousand British officers. Instead, they fought as if the rebellion was a regional war. However with all this being said, the war if planned and executed properly, would have become a long term effort. The British would have tried to come back, and they could bring troops from outside of India. A well planned Indian effort would have made having a foothold in India harder, and they would not have been able to rule over India again in a full sense. In fact the British were contemplating being defeated in this scenario. Indians did not understand modern warfare at that time, telegraph cables had to be severed in many places but were not done so uniformly. The telegraph system kept functioning. And the ports were not made unusable. It seems the revolution which started because of the backdrop of the atrocious way in which India was being looted,starved, and subject to racism and terror, had become an action based only a catalyst not a plan. The rebellion of 1857 made possible Mahatma Gandhi’s freedom movement, as Indians could be convinced that a military solution to independence would not work. In reality, the rebellion of 1857 actually had almost achieved the aspiration of most Indians for restoration of national sovereignty, it only fallen short because of the memories of Mughal Oppression, as the involvement of more North Indian soldiers would have turned the tide of the movement even without strategic genius.  Countless retaliatory executions, of Indians after the First War of Independence.  Khooni Dharwaza, Delhi, India. Haphazard Executions of Indians after the war. Many of the punished had sham trials. This would include the Emperor of Hindustan, Bhadur Shah Zafar, who would be sentenced to exile in Burma. His living conditions were horrific, and he received no medical care. His possessions were stolen, and no accounting has ever been given of just how much National Indian Wealth was looted. Executions continued on the streets of Delhi, and the memory of these is still found in the names of places. The most famous the Khooni Darawaza, where the Emperor of Hindustan’s two sons were murdered by a British officer even after being disarmed and surrendering. It is today a site many Indians go to visit. It is a place where no matter how one feels about the Mughal Empire, that the last vestiges of India’s third golden age were laid to a violent end, without the will of Indians. For it should have been our collective will, to decide the status of the Mughal Dynasty. It was Indians who had been it’s subjects and many it’s victims, not some outside power.  Experiences with Baba Dr. Dina Nath BediIndia a History, John KeaysTravel in India, and discussions with academic experts.Visiting actual sites of the War of Independence.",
            "date": "Answered February 9, 2020",
            "views": "274",
            "upvotes": " View 289 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akash Kapadia",
                    "user_href": "/profile/Akash-Kapadia"
                },
                {
                    "user_id": "Syamsundar Srinivasan",
                    "user_href": "/profile/Syamsundar-Srinivasan"
                },
                {
                    "user_id": "Aquib Mohammed Ali Hingwala",
                    "user_href": "/profile/Aquib-Mohammed-Ali-Hingwala"
                },
                {
                    "user_id": "Avyukth Sujesh",
                    "user_href": "/profile/Avyukth-Sujesh"
                },
                {
                    "user_id": "Mousam Mallick",
                    "user_href": "/profile/Mousam-Mallick-2"
                },
                {
                    "user_id": "Vikkram Gotluru",
                    "user_href": "/profile/Vikkram-Gotluru-1"
                },
                {
                    "user_id": "Pavan Ballur",
                    "user_href": "/profile/Pavan-Ballur"
                },
                {
                    "user_id": "Geetesh Chaudhari",
                    "user_href": "/profile/Geetesh-Chaudhari"
                },
                {
                    "user_id": "Keval M",
                    "user_href": "/profile/Keval-M"
                },
                {
                    "user_id": "Basheer Abdul",
                    "user_href": "/profile/Basheer-Abdul-3"
                }
            ]
        }
    ]
}