{
    "title": "Why is France so protective of French? - Quora",
    "tags": [
        "Culture of France",
        "French Ethnicity and People",
        "French (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Géal-Killy",
                "href": "/profile/George-Géal-Killy"
            },
            "answer_text": "Because you believe in that old urban legend out there, made by people who seriously lack imagination. That trope became so boring now. French is an hybrid language. Just as English. Always took loan words and still is. So please define protective? The Canadians, whom you can say are protective of French because their situation makes that they have to, are constantly scolding the French for not protecting the language. And they are native French speakers. So they know what they are talking about. There is that almost brainwashing abroad stipulating that the French try to protect their language from foreign evil forces, and the argument number one is the Académie Française. Big laugh! You believe that you show that you know your stuff by throwing the Académie thing? You simply show that you don't know what you are talking about and simply sheepishly repeat whatever they tell you out there. Here how the Académie Française matters in France What is the French public's opinion of the Académie Française? Just to be clear, nobody cares about the Académie, it's still respected but mostly for literature stuff, and more importantly the Académie Française doesn't have any sort of power over French!! I repeat. The Académie Française doesn't rule the French language. It simply doesn't have that authority. But even if it did, nobody follows whatever the Académie says!! There have been I don't know how many attempts or even real reforms out there, you won't find a single French to tell you what is the new rule for anything. Even with the last reform a couple of years ago (I guess, already forgot about it). People simply use what they learned during their education. And no, the Académie doesn't rule the education either. And in France being educated is not so much associated with school stuff. Nobody will tell you I am educated because I went to college. The Académie, if anything, is in charge every year of entering the new words in the official French dictionary, many of them being foreign words and slang. See the irony? So what is your definition of protective of French again? The society itself is not favouring monolingualism like some countries I won't name, and never has. All details here George Géal-Killy's answer to What are the historical and cultural reasons the French heavily identify with their language compared to the other countries with Romance languages? So again, what is it you mean by protective of French? Like for the Académie some people heard about the Toubon law and don't even bother checking what it's all about. Well the first information with that law but that is of course totally dismissed, is that French became the only official language of France only in 1994!!! If it's not clear, French became the only official language of France only 23 years ago!!! Why? Simply for the sake of practicality. When an official will go abroad, let's make sure he indeed speaks French and not Occitan. So now it's time to get real and make a comparison with the other countries and come again talking about being protective about a language? Then that law was reformed and weakened so much that it is totally ineffective. Dismissed of course. You just need to turn on your TV or radio to see how unprotected French is. If there is anything left of the law, nobody follows it. Oh! And please, if you want to watch movies in the original language, simply take your remote and set the TV! And if it's not enough, cable TV costs nothing and will give you access to thousands of channels from all around the world. Yes, you will find a channel from your country so relax. However what can be said is that indeed the French try to maintain a high level of French, in France. That is where the Académie can play its part. But it has nothing to do with foreign influences. Of course, at some point the French won't pick a foreign word just for the sake of it. As for any hybrid language, foreign words are adopted when they are useful or naturally became commonly used. So no, the French won't suddenly start using whatever language, because they have one already. That's not mad science here. If it's not clear, the only language people need to know to live in France is, French! Crazy right? Yes, speaking properly is important in France. For the sake of education and creating citizens who have the tools to bring something valuable to the society, not for protection. Everyone must be equipped to be part of the social debate. Leveling things down instead of aiming at what is best is a social thing in general anyway. That's why people are correcting you, foreign speaker. Not because you butcher the French language. For the life of me why would you like that the French care about the fact that you don't speak well a language? Any of them? You, a total stranger, that they will probably never see again? Do you seriously believe that you are that important? You make mistakes in French? Disclaimer here: That's your problem. Correction is for the sake of helping someone getting better at something. That in your country it's seen as an offence is irrelevant in France!! The French don't target non native speakers so they can correct them. They do that with everyone, for everything, and even practice self correction. Self-correction. That goes alongside with facts checking! You might think that the French are crazy, that’s your right. But it's time to use common sense now. Would someone be rude toward himself on purpose? Less self centeredness please. Not everything has to be about you personally. Aiming up remember? And after don't forget to say thank you, to the person who used his time and energy to try to point you to the right direction instead of leaving you wallowing in your ignorance to then stagnate and/or repeat the same mistakes. I know some countries are in favour of that. But it's not the case in France! So what should we do? Become another country too? Simply leave your social codes and what makes sense in your country, home. Don't try to comfort your bias using the clichés you didn't even bother checking. Someone talks to you about an institution? Go check yourself what it's all about. Life will be so much easier for you. EDIT: Oh! And I forgot that huge argument explaining why the French are so protective of their language. You know, French used to be the lingua franca, a long long long time ago. But it's not the case now. So of course when a French doesn't speak English, that's because he remembered an era he has never known but it doesn't matter, of course he cares about it, because when people are talking they do think of such things, that makes sense. And he then refuses to speak a foreign language because Once upon a time French was a lingua franca. Et voilà! They all nod, proud of themselves that they cracked the French code as if whatever they were saying made any sense. Seriously? That reasoning is in my top 3 of the stupidest alongside with, the French don't speak English with tourists in the streets who need help because they are proud of their language and want a tourist they don't know, don't care about, will never see again, to speak French. “Pleaase! speak French to me, you will make my day! I can't hear enough of French in France, I need a random tourist to speak it for me too. Because you know French was the lingua franca once. The imagination of some people, that's crazy. And of course what would we do without our British friends? The French don't want to speak English because France and Britain have been big rivals from centuries and were fighting each others….Yeah! Dude! If the French speak English that's because America. Nobody cares about wars 1000 years ago and certainly don't think of that when talking to someone. Seriously?What's wrong with you? EDIT 2: It appears in the comment section that people were intimidated by the length of my answer which prevented them from understanding or reading the content. So here the underlying point you were supposed to twig by yourself. What the French think of the Académie was an example of how powerless it is, not an argument. And I said why. The usual argument given abroad is that France is trying to protect French against foreign influences because there is the Académie. Which is a nonsense, that being my actual argument about the Académie. It doesn't have such authority! The number of foreign words and slang they have to enter every year was another example. The only institution that can rule the type of French the French will learn, thus use, is the Education Nationale, like in any country. And the Education Nationale has other priorities than filtering foreign words. In fact the Education Nationale is busy providing decent education in 2 to 3 foreign languages. To make that happen the number of hours for French lessons significantly decreased over the years. That's what you call being protective of French? About all countries on this planet have an official language. That's not the prerogative of the French. And yet while they selected their official language centuries ago and wiped out the other languages, France selected French only 2 decades ago and a significant amount of regional languages managed to survive. Understand, the French were less active at destroying them compared to other countries. In a word, on what ground can you say that France is protective of the French language because a law was made to make French an official language? Recently there was a debate in France to teach Arabic from 1st grade. Very protective attitude indeed. The 1st, 2nd foreign languages will be taught earlier and apparently the 3rd one, which is optional, will also be made available before high school. So much to stipulate that France tries to protect French from foreign influences. ",
            "date": "Answered October 19, 2017",
            "views": "37",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cartago Wine",
                    "user_href": "/profile/Cartago-Wine"
                },
                {
                    "user_id": "Rod White",
                    "user_href": "/profile/Rod-White-14"
                },
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "ELer",
                    "user_href": "/profile/ELer"
                },
                {
                    "user_id": "Mailen Martin",
                    "user_href": "/profile/Mailen-Martin-1"
                },
                {
                    "user_id": "François Martini",
                    "user_href": "/profile/François-Martini"
                },
                {
                    "user_id": "Roald Leeuwerik",
                    "user_href": "/profile/Roald-Leeuwerik"
                },
                {
                    "user_id": "Laurie L.A",
                    "user_href": "/profile/Laurie-L-A"
                },
                {
                    "user_id": "Cyril Nadarien",
                    "user_href": "/profile/Cyril-Nadarien"
                },
                {
                    "user_id": "Antoine Durandy",
                    "user_href": "/profile/Antoine-Durandy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurent Jeannin",
                "href": "/profile/Laurent-Jeannin"
            },
            "answer_text": "I really think differently, France is protective because of it’s written, oral, regional, AND international culture. French is spoken in 40+ countries and has always been mixed with other languages, France being in the center of western Europe. But that’s ALSO why France is protective about French. Because otherwise it would have disappeared, dissoluted in all the giant European mix. Since the medieval kings French has been a way of establishing power and reinforcing the unity of the realm. But don’t be cheated, French was used for diplomacy, business, fincance all over the world and people are used to ear expressions from other languages inside the French language, especially since WW2. You can find as many French expressions in the English language btw : ménage à trois, déjà vu and many more ! mixing is what gives the best outcome, children who learn multiple languages since childhood use mixed language all the time because it’s rich. I teach bilingual students (French + Spanish) and they affirm speaking “franol”, a mix of French (fra) and Spanish (espanol) :-) best regards ",
            "date": "Answered February 25, 2018",
            "views": "872",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Kaveh Hevak",
                    "user_href": "/profile/Kaveh-Hevak"
                },
                {
                    "user_id": "Mailen Martin",
                    "user_href": "/profile/Mailen-Martin-1"
                },
                {
                    "user_id": "Peter Kerrigan",
                    "user_href": "/profile/Peter-Kerrigan"
                }
            ]
        }
    ]
}