{
    "title": "Why did the early Christians face persecution from the Romans? - Quora",
    "tags": [
        "Persecution",
        "Roman Empire",
        "Ancient Rome",
        "Christianity",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Speener",
                "href": "/profile/Frank-Speener"
            },
            "answer_text": "The early Christians were those who were called by GOD to Jesus… “No man can come to me, except the Father which hath sent me draw him: and I will raise him up at the last day.” (John 6: 44.)These early Christians went out into the world preaching the very same “Gospel of the Kingdom” that Jesus himself preached and commanded His followers to preach as well. That gospel is not the same gospel that is generally preached today. The original Gospel of the Kingdom focused on the reuniting of GOD's Kingdom in heaven with His divided Kingdom on the earth. The Kingdom became divided when Lucifer, whom GOD had given rule on this earth, rebelled causing GOD's Kingdom here on the earth to be torn apart, dividing it from the Kingdom in Heaven. The message of the Gospel of the Kingdom plainly states that the kingdoms and empires on the earth would be destroyed when that reunion of the divided Kingdoms takes place, a message that Rome could not and WOULD NOT TOLERATE! It was rhis gospel message that caused Rome to crucify Jesus brutally and publically as an ENEMY of the state, with a strong warning for anyone who followed him by placing a sign on His cross for the world to see in the three most widely used languages in that day, LATIN, GREEK, and HEBREW, “KING IF THE JEWS”. After the news of His resurrection His followers in the early church set out preaching that same Gospel of the Kingdom, and Rome, once again would not put up with it. To make matters worse, the church was growing and spreading throughout the Roman Empire with the same message that Rome was going to be destroyed. After several centuries of brutal persecution, the church that Jesus founded, along with his Gospel of the Kingdom continued to grow. It was for this reason that Rome finally leagalized the practice of Christianity and soon made it the official religion of the Roman empire. By then the early “church fathers” began the task of destroying the message and the focus of GOD’s church into Roman Christianity, and later the Roman church, and eventually, the entire Protestant church movement. Rome would not have any problem at all with the “gospel” taught around the world today. ",
            "date": "Answered January 16, 2019",
            "views": "273",
            "upvotes": " Answer requested by Jordan Clarke-Bonhomme"
        },
        {
            "author_info": {
                "name": "Wyatt Roetcisoender",
                "href": "/profile/Wyatt-Roetcisoender"
            },
            "answer_text": "There’s two possible answers to this but neither is definite. Nero was an evil man, and like all evil men when they face things that are pure and good among them, they want to destroy it. Whether it’s guilt when they look at themselves or simply not wanting to change who they are (or others to change), then they will want to get rid of the thing that’s causing discomfort and change. Christianity was also feared due to the false lies spread about them to get others to persecute them (like the lie of cannibals). The Jews were usually left alone and until the persecution began, Christianity was looked at as a division of Judaism so they were left alone too.The other possibility is the confirmation of a rumor that’s about 2000 years old: Nero set the Great fire in Rome so he could build a bigger palace for himself and blamed the Christians as a scapegoat. No one knows who set the fire, and Nero did expand his palace afterwards, but he also gave funds to rebuild the parts in Rome that were burned too to rebuild homes.",
            "date": "Answered January 13, 2019",
            "views": "148",
            "upvotes": " Answer requested by Jordan Clarke-Bonhomme"
        }
    ]
}