{
    "title": "Why did Christopher Columbus want to find new trade routes? - Quora",
    "tags": [
        "Trade Routes",
        "Explorers",
        "Columbus Discovers the Americas (1490s & 1500s)",
        "Christopher Columbus (historical figure)",
        "Trade",
        "Ancient History",
        "World History",
        "History of the United States of America",
        "Trading (finance)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pravin Singh Raghuvanshi",
                "href": "/profile/Pravin-Singh-Raghuvanshi"
            },
            "answer_text": "In the 15th and 16th centuries, Europeans wanted to find sea routes to the Far East. Columbus wanted to find a new route to India, China, Japan and the Spice Islands. If he could reach these lands, he would be able to bring back rich cargoes of silks and spices. Columbus knew that the world was round and realised that by sailing west - instead of east around the coast of Africa, as other explorers at the time were doing - he would still reach his destination.  ",
            "date": "Answered October 25, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Billings",
                "href": "/profile/Tom-Billings-8"
            },
            "answer_text": "The millennia-long trade routes of Eurasia passed through lands and seas dominated by the enemies of Spain. Columbus pointed out that the spice trade drained Gold from Spanish coffers and into the treasuries of the Ottoman Empire and other Muslim countries that Spain felt were basically hostile, even in times of peace. This made it more difficult to expand the economies running under the Kings of Spain. So, a new route to “The Indies” was needed that avoided these drawbacks. ",
            "date": "Answered October 24, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Gall",
                "href": "/profile/Dan-Gall-1"
            },
            "answer_text": "To get rich. With a new (hopefully shorter) trade route he could get spices and get them to Europe before the competition. ",
            "date": "Answered October 24, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}