{
    "title": "Why is there no such thing as an Earth eclipse? - Quora",
    "tags": [
        "Total Eclipses",
        "Lunar Eclipses",
        "Solar Eclipses",
        "Eclipse (software)",
        "Eclipses (astronomy)",
        "The Moon (astronomy)",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bingamon",
                "href": "/profile/John-Bingamon-1"
            },
            "answer_text": "The closest equivalent of a solar eclipse, but with the earth being blocked from view, requires FOUR bodies all in a line (from left to right: the sun for light, the earth to be blocked, a 3rd object to block our view of earth, and then a fourth — you — at just the right distance so they all line up perfectly). And the sun, earth, and blocking body all have to have the right relative sizes and distances so that the diameter/(distance-to-you) ratio is the same for each. But there is NO such “blocker body” in space. In the picture below**, you would have to be at the (unseen, farther to the right) tip of the cone showing the earth’s shadow, and the moon would have to be further to the right to where it exactly fits the cone: nearly three times farther from the Earth than it is now, with you being about nearly as far behind the moon as the moon is now from the earth. Alternatively, the equivalent of a lunar eclipse would require some object to pass between the earth and sun, and leave the earth in it’s shadow. But that means the object would have to be larger than the earth — and there is no such object in the inner solar system, let alone close enough to earth to make this work. ** Note that this picture is NOT realistic, in the sense that it is not even close to being to scale: the diameters are not to scale, nor the distances, nor the ratios between diameter and distance. But the conceptual idea is correct.  ",
            "date": "Answered October 20, 2020",
            "views": "746",
            "upvotes": " Answer requested by Lois Moore",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Madu Upadhya",
                    "user_href": "/profile/Madu-Upadhya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Seymour",
                "href": "/profile/Richard-Seymour-24"
            },
            "answer_text": "I vote that there certainly are “Earth eclipses” Let’s look at the other types of eclipses we see: A “solar” eclipse is a shadow falling on the earth due to the moon blocking the sun from earthly observers. A “lunar” eclipse is a shadow falling on the moon due to the earth blocking the sun. There are no “observers” on the moon at the moment to tell us what they call it. Many orbiting satellites have eclipses with every orbit … the sun disappears behind the mass of the earth. Finally… there’s the earthly observers’ experience every night … the sun disappears behind the mass of the earth. For the next number of hours, those observers are in the shadow of the earth! So every night you’re experiencing an earth eclipse. Hold up your hand. See that it’s in the earth’s shadow! My second suggestion is that a “lunar eclipse” is really mis-named. The moon is experiencing an “Earth Eclipse” … with the added feature of a thin ring of red light surrounding the planet as the sun refracts through our atmosphere. ",
            "date": "Answered October 20, 2020",
            "views": "622",
            "upvotes": " View 2 Upvoters "
        }
    ]
}