{
    "title": "Why did David write Psalm 37? - Quora",
    "tags": [
        "Psalms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Gutbrod",
                "href": "/profile/Rick-Gutbrod"
            },
            "answer_text": "David had dealt with many issues during his life. He had to face hatred by King Saul, and then later treachery by his friends and family. The Psalm focuses on what the faithful needed to do, and not let those who made life hard for them. For example, verse 1. (Psalm 37:1, 2) 37 Do not be upset because of evil men Or envious of wrongdoers.  2 They will quickly wither like grass And shrivel like green new grass.He directed us to look to Jehovah God to act as Judge, and not to take actions that would destroy our relationship with God. Verse 8 reminds us of this. (Psalm 37:8, 9) 8 Let go of anger and abandon rage; Do not become upset and turn to doing evil.  9 For evil men will be done away with, But those hoping in Jehovah will possess the earth.The future of honesthearted worshippers are secure, because God will act, and change the whole world, to one where no wickedness will exist, nor any who seek to profit from their wicked acts. (Psalm 37:29) 29 The righteous will possess the earth, And they will live forever on it.When we see that these promises are tied to the ministry of Jesus Christ, who will act as God’s Judge of the earth, and through his sacrifice, provide the path to everlasting life to all who love righteousness. Even those who have died will enjoy these blessings. Paul wrote the following about how important Christ is in the fulfilling of God’s promises. (2 Corinthians 1:20) 20 For no matter how many the promises of God are, they have become “yes” by means of him.The promises stated in Psalm 37 are guaranteed by Christ’s faithful course. The righteous will enjoy everlasting life on the earth forever. [1] Footnotes[1] https://www.jw.org/finder?wtlocale=E&docid=1102015144&srcid=share",
            "date": "Answered October 23, 2019",
            "views": "705",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Junior Faalemiga",
                    "user_href": "/profile/Junior-Faalemiga"
                },
                {
                    "user_id": "Anthony Quann",
                    "user_href": "/profile/Anthony-Quann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santos Mahlalela",
                "href": "/profile/Santos-Mahlalela"
            },
            "answer_text": "Sometimes the ‘Why?’ is tricky to deal with as the writer was experiencing things that are known to him and in more ways than one we have a lot to learn from their writings. At times we are bound to see the opposite of what the writer was actually going through or visa versa. One of the lessons here is that King David makes it clear that evil doesn’t conquer righteousness, therefore, he encourages us to always know that even if we going through difficulties, those difficulties are temporary as stated in verse 2. Another concept he brought forth is that we need to commit our plans to God so that we can delight in him, a simple interpretation to this is when a person does something irrespective of how much conviction one give for their actions but later they regret it. This is another way of knowing that finally righteousness has overcome evil in a person’s heart but if things are done to please God, it is likely that the end result will give no reasons for regrets because God is love and anything done in the name of the Lord will have love and respect in mind. ",
            "date": "Answered October 4, 2019",
            "views": "491",
            "upvotes": "0"
        }
    ]
}