{
    "title": "Why is Boston so damn boring? - Quora",
    "tags": [
        "Boston, MA"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Birch",
                "href": "/profile/Alex-Birch-7"
            },
            "answer_text": "While you asked your question in very negative and condescending tone, I’m going to answer it with an upbeat, positive tone. First, I would be led to believe that you’re complaining about Boston’s distinct lack of nightlife. Having been in the Boston nightlife scene for over seven years now I can absolutely tell you that the scene is what you make of it!! Want to party longer? Plan a pregame or even an after-hours rendezvous with your friends! (Just be sure to keep the noise reasonable during afters) This can easily extend your time out by leaps and bounds if you make the best of it. Whether your thing is bars, clubs, pub crawls or even roof decks there are countless ways to make the most of Boston’s nightlife! There are also plenty of technically illegal, true underground after hours events but you really have to know someone who knows someone to find that sort of stuff these days. Second, have you seen (and/or heard, literally) Boston’s arts scene?? The Museum of Fine Arts allows most area college students in for free and last I checked the Museum of Science has at a minimum special student pricing for admission. Also be sure to check out MFA Late Nites, I went once and wish I had a chance to go back! Next, have you ever been to Symphony Hall for the Holiday Pops Spectacular? I would highly recommend it if you haven’t been to it! They also feature lots of great performances throughout the year from guest performers and conductors. Recently they had a Star Wars-themed night featuring all your classic tunes from the movies! To wrap up the major museum attractions around town I would also recommend the Institute of Contemporary Art in the Seaport District. They host various evening events which I’ve heard very good things about! Next, have you even heard of sports?? I know of very few cities that go as crazy for their local NFL team as Boston does. Go to Southie (South Boston, not the South End) during a game and the bars will be absolutely packed!! Red Sox games are a right of passage during the summer and Bruins games are really awesome to go to in person if you can get reasonably priced tickets (you have to know where to look!). If basketball is your thing I’m sure a Celtics game would be fun and of course that’s to mention nothing of the many colleges in the area and their sports teams (Beanpot, anyone??). Are you interested in more cultural programs and community events? You must not be trying at all then! Hang around Boston Common and you can often find at least one interesting event going on, maybe even a march or demonstration of some sort! There are countless community outreach for minority groups, veterans and other populations with special considerations. Many groups host fairs and displays, in fact just a couple months ago we just had the Cambridge River Arts Festival which took over almost the entirety of Central Square in Cambridge. You can also find community concert series in quite a few locations around town if music is more your thing. Finally, you must live under a rock out on the Brewster Islands if you haven’t heard of all the special events in Boston. Just off the top of my head you have the Marathon in April, 4th of July Spectacular all along the Charles River Basin, First Night First Day, Pride Boston in June, Hubweek at City Hall Plaza, The Feast of St. Anthony the last weekend of August (celebrating its 100th anniversary this year!), Head of the Charles and Boston Calling just to name a few. So yeah, really I’m not sure where you exactly got “boring” from but hey, to each their own! ",
            "date": "Answered August 8, 2019",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adri Leemput",
                    "user_href": "/profile/Adri-Leemput"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/T-Z-e-R-o-Michael"
                },
                {
                    "user_id": "May May",
                    "user_href": "/profile/May-May-348"
                },
                {
                    "user_id": "Mike Worhach",
                    "user_href": "/profile/Mike-Worhach"
                },
                {
                    "user_id": "Michael Laskaris",
                    "user_href": "/profile/Michael-Laskaris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Griffin",
                "href": "/profile/Thomas-Griffin-128"
            },
            "answer_text": "The only way I can see that someone would consider Boston to be boring is if they’re a party-all-night club rat. It is true that Boston is not that kind of city; sure, it has clubs, but they’re not really consolidated and it’s not a strong scene compared to New York, definitely not L.A. By law, these establishments are only allowed to be open until 2 a.m, and seeing how most clubs pick up the energy after midnight, there isn’t much point in going for such a short time. Boston officials have also done their damnedest to kill the late night parties, cancelling late-night T service (you now can’t catch a train from anywhere after about 12:30), and taxis, Ubers, Lyfts, etc. are expensive, as is the city in general. With that said, there are plenty of other things to do in Boston; there are museums, countless restaurants and pubs, and there are lots of house parties in the student areas, but you can’t exactly just waltz into one, usually you need to know someone. I personally think the best gig in town is a basement show in Allston- the music might not be good, but you can still hang and drink and meet people. However, it’s unlikely that newcomers from out of state or region will know about that. Plus, Allston is a fair distance from downtown Boston. So, if you’re not into those things, you would find Boston boring. It’s also a problem of affordability; there’s plenty to do, but it all costs so much. Better make some good friends so you guys can create your own fun. ",
            "date": "Answered August 5, 2019",
            "views": "787",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "May May",
                    "user_href": "/profile/May-May-348"
                }
            ]
        }
    ]
}