{
    "title": "Why did the Spanish mix with the Native Americans if they did the native America wrong? - Quora",
    "tags": [
        "Spanish Ethnicity and People",
        "Native American History",
        "Native Americans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alicia Nieto",
                "href": "/profile/Alicia-Nieto-5"
            },
            "answer_text": "Native Americans weren't a blob, the Spanish allied with some groups and fought others, so they mostly mixed with allies. Also, the Spanish had a very Roman, or medieval if you will, view of what a conquest is and behaved mostly like the Romans did. They assimilated willing population and fought and got rid of the unwilling. The Romans also both wronged the Celts, Gauls and Iberians and mixed with them during the conquest and mixed with them. It isn't mutually exclusive and the key is in not seeing them as a blob or single nation but as the varied etnicity and political groups they were. After the conquest was over, on the first 50 years or so, and the territory was secured the official orders from the king of Spain, also in Roman style, was for the Spanish men and women overseas to intermarry with the locals to try and create a mixed and homogeneous society. It was a way to unify society, close wounds and grant control if the territory pretty much every successful Empire used, and specially mediterraneans who had a very loose ( or almost nonexistent) concept of race. Wealth got in the way if the orders for the rich criolle class, as you can see in the ruling class of Latin America, but it was mostly followed. ",
            "date": "Answered October 7, 2018",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jose Rey",
                "href": "/profile/Jose-Rey-7"
            },
            "answer_text": "You are making abig mistake here You are packing ‘Native Americans’ together Many Native Americans were allied to the Spanish. In fact, during the conquistas the Conquistadores didn’t just simply attack all natives on sigh, which seems to be the predominant (And incorrect) view in English speaking countries. Native Americans had their own wars, many found powerful allies in the Conquistadores, many intermarried, some Conquistadores even switched bands because of this, and joined American Native cultures. In fact, during the war of independence of Virreinato de Nueva España (Mexico, Guatemala…) Native Americans supported royalist forces, such as the Quechua, de Mapuche and the Guajira. This said, after the conquest, civil societies were formed and the people living there interacted, thus, the Mestizo race was prolonged. The first Mestizo, was the son of a Conquistador who quitted the Spanish army, joined the Natives and organized them against the conquest. Another famous Mestizo would be the son of a Native American Interpreter who worked for the Spanish and became the lover of Cortés; Doña Marina La Malinche and Hernán Cortés. ",
            "date": "Answered October 5, 2017",
            "views": "569",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Javier Oliver Garcia",
                    "user_href": "/profile/Javier-Oliver-Garcia"
                },
                {
                    "user_id": "Sharon Nivon",
                    "user_href": "/profile/Sharon-Nivon-1"
                },
                {
                    "user_id": "Daniel Olivares",
                    "user_href": "/profile/Daniel-Olivares-13"
                },
                {
                    "user_id": "Javier L. Doce",
                    "user_href": "/profile/Javier-L-Doce"
                },
                {
                    "user_id": "Roberto Rosello",
                    "user_href": "/profile/Roberto-Rosello-1"
                },
                {
                    "user_id": "Maria Abad",
                    "user_href": "/profile/Maria-Abad-9"
                },
                {
                    "user_id": "Katia Llorente de la Morena",
                    "user_href": "/profile/Katia-Llorente-de-la-Morena-1"
                },
                {
                    "user_id": "Javier Blanco",
                    "user_href": "/profile/Javier-Blanco-4"
                },
                {
                    "user_id": "Kirsten Gould",
                    "user_href": "/profile/Kirsten-Gould"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        }
    ]
}