{
    "title": "Why did the founding fathers of the United States embrace Christianity? - Quora",
    "tags": [
        "Culture of the United States of America",
        "History of the United States of America",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Keenley",
                "href": "/profile/James-Keenley"
            },
            "answer_text": "Why did the founding fathers of the United States embrace Christianity? If you want to know why the founders embraced Christianity, you’d first have to familiarize yourselves with the lives and thoughts of each individual founding father. John Adams, was certainly Christian, and a fairly religious guy. George Washington was more of a deist, who believed that God existed, at least in a theoretical way, yet believed that God did not intervene in the human world. Many believe Benjamin Franklin was an atheist or an agnostic, but he wasn’t. He believed in God, but, as with everything Franklin did and believed, in a very sui generis way. And then there’s Jefferson. It’s unclear whether Jefferson believed in God or not. He made typical Deist allusions to a “deity,” but he certainly wasn’t a Christian, at least not in the typical understanding of the word. Oh wait! Did you mean to ask: Why did the founding fathers establish the United States as a Christian nation? That’s a lot easier to answer: They didn’t. ",
            "date": "Answered August 2, 2018",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Israel Abodunrin",
                    "user_href": "/profile/Israel-Abodunrin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Hill",
                "href": "/profile/Jon-Hill-70"
            },
            "answer_text": "“The founding fathers” did not embrace Christianity. There were too many who were godless products of the Enlightenment for such a sweeping generalization, though it could be argued—and has been—that the Enlightenment could not have happened (perhaps would not?) if it were not for the Protestant Reformation. The best that could be said is that the majority of Americans, not just the founders, at the time of the Revolution had a nominally Christian world view. The deist, agnostic, or atheist founders merely had a “Jesus was a great moral teacher” kind of pseudo-Christian belief system. Their personal morality was, in a word, suspect. ",
            "date": "Answered August 2, 2018",
            "views": "72",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linda Robinett",
                    "user_href": "/profile/Linda-Robinett"
                },
                {
                    "user_id": "Israel Abodunrin",
                    "user_href": "/profile/Israel-Abodunrin"
                },
                {
                    "user_id": "Philip Rabe",
                    "user_href": "/profile/Philip-Rabe"
                }
            ]
        }
    ]
}