{
    "title": "Why did the US invite several other countries to sign Japan's surrender in World War 2 on the US Navy Missouri battleship even though the US beat Japan into submission essentially single-handedly? - Quora",
    "tags": [
        "Japan–United States Relations",
        "Military History and Wars of Japan",
        "U.S. in World War II",
        "Japan in World War II",
        "Military History of the United States of America",
        "Japan",
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Edward Sisson",
                "href": "/profile/Edward-Sisson"
            },
            "answer_text": "The other 11 answers have shown that one premise inserted into this question was erroneous, that the U.S. did not beat Japan “essentially single-handedly.” However, had the United Kingdom (including Canada, Australia, and New Zealand), France, the Soviet Union, and the Netherlands (all present at the September 2, 1945, surrender ceremony) been able to defeat Germany on their own, without U.S. participation, the U.S. would have been able to devote massively more resources to the defeat of Japan, than the resources those countries provided to the effort to defeat Japan. On a net basis - which is the legitimate basis for assessing the contribution to the effort to defeat Japan - all of these countries were burdens to, not aids to, the U.S. effort to defeat Japan. Even Australia limited its armed effort: Australians conscripted to fight (the “Civilian Military Force” as contrasted with Australian volunteers, the “Second Australian Imperial Force”) could not, by Australian law, be sent outside of Australian territory, which was defined to include Papua New Guinea, until reform legislation in January 1943, and even this reform limited the region to which Australia could send conscripted troops to the Southwestern Pacific region. Thus, during the vital battle for Guadalcanal that began on August 7, 1942, until the decision of Emperor Hirohito on December 31, 1942, to withdraw from Guadalcanal, no Australian conscripted ground-troops could be sent to fight for Guadalcanal, even though American conscripts were fighting there - while other American conscripts were fighting in North Africa: Operation Torch, the North Africa invasion, began on November 8, 1942, while the battle for Guadalcanal was still going on. France claiming any share of credit for defeating Japan is particularly problematic, considering that the November 1942 North Africa invasion was necessary solely because France had surrendered to Germany in June 1940, rather than maintaining resistance by removing the government to the African colonies and continuing the fight. I addressed the effects of the French surrender in a different Quora answer, arising from the decision by the French government (under Petain) not to remove to the colonies to continue the fight. As a result, North Africa was under French rule but not cooperating with the United States in the fight against Germany. Operation Torch was an attack on the French, who fought back. Had France remained in the war against Germany after June 1940, all the U.S. military forces (Army and Navy) marshaled against North Africa in November 1942 could instead have been used against Guadalcanal, at precisely the same time. Whatever France contributed to the defeat of Japan ought to be offset by what France detracted from the defeat of Japan. As regards Canada, I have already discussed in other Quora answers, and in replies to comments thereto, how minimal was Canada’s contribution to the defeat of Japan - due largely to the fact, as I discuss in those answers and replies, that Alaska being U.S., not Canadian, and with Alaska including so much coastline south towards Vancouver, there was hardly any Canadian interest in the Pacific. As we see below, Australia objected to MacArthur’s desire that Canada, France, and the Netherlands be included in the surrender ceremony. Australia had good reasons to object to Canada’s, and France’s, participation (I have not researched why Australia objected to the Netherlands). Canada, like Australia, limited the region in which its conscripted troops could serve, to only domestic lands. This was a reaction against World War I perceived misuse by London of Dominion troops, to serve London imperial interests - and was, I judge, quite reasonable. But it had the effect in the Pacific War of limiting aid that could be provided to the United States efforts against Japan. Neither Australia nor Canada could open the region in which conscripts could be sent to include the entire area of the Pacific War, without throwing themselves open to the misuse by London of their conscript troops to fight to preserve the Empire wherever London wanted them to fight. (I presume the same was true of New Zealand, but I have not researched the New Zealand context of this issue). I add that the ceremony was not just a symbolic show of power, it was a “legal” moment, namely, ending the state of war between Japan and each of the countries that were in a state of war with Japan. Here is the list from wikipedia:  The list of countries in a declared state of war with Japan included more countries than these; I have not researched why some - most notably, the Philippines, which had signed in its own name the UN Charter earlier, on June 26, 1945 - was not represented. If Australia could sign on its own, despite being a Dominion under the United Kingdom (which it then was), why could not the Philippines sign on its own, despite being a “commonwealth” under the U.S. (which it then was)? And why should Canada, also as it then was a Dominion under the United Kingdom, be able to sign despite having contributed practically nothing to the defeat of Japan (as I establish in other Quora answers), while the Philippines, a “commonwealth” under the U.S., and which contributed so much effort to the defeat of Japan, not be invited to sign? The inclusion of Canada and the exclusion of the Philippines strikes me as a deep insult to the people of the Philippines. I suspect that detailed negotiations went on behind the scenes to determine who would be represented and who NOT represented at the ceremony. It is interesting to consider what would have happened if the Missouri ceremony had been a “U.S. only” surrender by Japan. There would have had to be at least five additional separate surrender-signing ceremonies: with China, the United Kingdom and its Dominions (Australia, Canada, New Zealand), the Soviet Union, the Netherlands, and France. Having one surrender ceremony was actually a favor to the Japanese, because it avoided repeated moments of humiliation. It was the way to avoid inciting resentment in the Japanese people, which would have been the effect if their highest-level officials had had to undergo this ceremony six times instead of one time. Having Japan’s officials surrender in front of the “combined weight of the world” as this ceremony made it appear also made surrender as honorable as it could be for the Japanese to submit to. A series of separate surrender ceremonies would have been extremely upsetting to the Japanese, as they had to send their officials to bow before people whom they had conquered, and who never would have been in a position to defeat Japan without the war effort of the United States. Rather than ask why the U.S. “invited” all these countries to attend, the more interesting question is to ask why these five powers “consented” to be merely subordinate parts of a U.S.-dominated single ceremony, rather than insist that their “national dignity” required separate surrender-signing ceremonies. It is particularly striking that the United Kingdom and its Dominions - the world’s greatest empire - agreed to appear as merely subordinate participants in a U.S.-dominated ceremony. Their appearance on the deck of a U.S. battleship to accept the surrender of Japan, in a ceremony led by a U.S. general, is a distinct act of recognition of U.S. superiority that deserves greater notice for its significance than it has received. The fact that the Soviet Union also was content to have its representative appear here, and to sign after the U.S. (by Admiral Nimitz), after China, and after the United Kingdom, is also a distinct act of recognition of U.S. superiority that deserves greater notice for its significance than it has received. The same considerations apply regarding China, and regarding France. The explanation for this unified single ceremony lies, I suggest, in the developing effort to form the “United Nations.” The conference in San Francisco to adopt the UN Charter occurred before this ceremony - indeed, before the atomic bombings, and before the surrender of Japan - April 25 to June 26, 1945. Although signed on June 26, the UN Charter had to be sent to each government for its own “ratification” processes, and thus it did not go into effect until October 25, 1945. This ceremony on September 2, 1945, was, in substance, the first real action by the “United Nations,” though the UN was not yet constituted into a formal legal body (as noted, this would not occur until October 25). ",
            "date": "Answered May 3, 2019",
            "views": "27",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emma Broadleaf",
                    "user_href": "/profile/Emma-Broadleaf"
                },
                {
                    "user_id": "Brian Yoder",
                    "user_href": "/profile/Brian-Yoder-5"
                },
                {
                    "user_id": "Jonson Chin",
                    "user_href": "/profile/Jonson-Chin"
                },
                {
                    "user_id": "Anthony Neal",
                    "user_href": "/profile/Anthony-Neal-28"
                },
                {
                    "user_id": "Gillian Boden",
                    "user_href": "/profile/Gillian-Boden"
                },
                {
                    "user_id": "Ralph McNeillie",
                    "user_href": "/profile/Ralph-McNeillie"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Boykin",
                "href": "/profile/Keith-Boykin"
            },
            "answer_text": "Why did the US invite several other countries to sign Japan's surrender in World War 2 on the US Navy Missouri battleship? Because the several other countries participated in the defeat of Japan. There are two factors on why most people believe the U.S. beat Japan into submission “single-handedly”; Most of the World’s attention was focused on Germany and the European Theater. No one could believe how advanced and powerful the German weapons and war machines were after the Treaty of Versailles. Japan was overlooked as a major power who was conquering territory in the Far East at a pace faster than Germany in Europe.After the attack on Pearl Harbor, Douglas MacArthur’s defeat in the Philippines, the famous Battle of Midway, and the famous (or infamous) dropping of two atomic bombs, most people falsely believes that the war was between only Japan and the U.S. The truth was that ALL of the countries aboard the Missouri had to retake their territory that Japan conquered while all eyes were on Europe.",
            "date": "Answered May 16, 2019",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mark Ernst",
                    "user_href": "/profile/Mark-Ernst-1"
                }
            ]
        }
    ]
}