{
    "title": "Why was Archduke Franz Ferdinand in Sarajevo in the first place? - Quora",
    "tags": [
        "Gavrilo Princip",
        "Archduke Franz Ferdinand",
        "Sarajevo, Bosnia and Herzegovina",
        "Assassinations",
        "World War I"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harun Šiljak",
                "href": "/profile/Harun-Šiljak"
            },
            "answer_text": "According to Vladimir Dedijer’s The Road to Sarajevo, reasons for Archduke’s decision to visit Sarajevo and Bosnia were military, political and personal in nature. The great military exercises in Bosnia in the summer of 1914 were planned in advance. Although it was customary for Kaiser Franz Joseph to attend these, his age prevented him to do so already in 1913 during the exercises in Czechia: Franz Ferdinand took over these duties. Dedijer mentions how the Archduke mentioned his desire to go to Bosnia in 1914 during the Czech exercises to general Konrad and general Potiorek (Governor of Bosnia), and how Konrad thought it was a good idea for the Crown Prince to visit Bosnia, as the Crown Prince Rudolf has done the same before. It should be noted that this comment arose during a conversation about Serbia and the possible action against it. In terms of foreign policy, visit of Franz Ferdinand to Bosnia would send a signal of protest to the neighbouring Kingdom of Serbia, but in terms of the local political situation, it was desired to make an effect on both the Serbs and the Croats in Bosnia, as both Potiorek and Franz Ferdinand were worried with the long-lasting unrest among the Serbs and the new sparks of rebellion among the Croatian politicians. Finally, the personal reasons mentioned by Dedijer are twofold: on one hand, it was a perfect opportunity for the Duchess Sofia to shine as the wife of the Crown Prince in public, in a welcoming ceremony worthy of the Kaiser himself (some dissenting opinions suggest that the Duchess went with Franz Ferdinand to Sarajevo only because she was worried about his safety). On the other hand, Franz Ferdinand was already once in Herzegovina, in 1906: he was met with disrespect (and, in case of Dubrovnik, insults!) and it was payback time, to return in the provinces as the Crown Prince. ",
            "date": "Answered May 31, 2017",
            "views": "4",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harun Šmrković",
                    "user_href": "/profile/Harun-Šmrković"
                },
                {
                    "user_id": "Logan Games",
                    "user_href": "/profile/Logan-Games-2"
                },
                {
                    "user_id": "Amina Mizdrak",
                    "user_href": "/profile/Amina-Mizdrak-3"
                },
                {
                    "user_id": "Craig E. Ransom",
                    "user_href": "/profile/Craig-E-Ransom"
                },
                {
                    "user_id": "Alfredo Perozo",
                    "user_href": "/profile/Alfredo-Perozo"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                },
                {
                    "user_id": "Jakub Handlíř",
                    "user_href": "/profile/Jakub-Handlíř"
                },
                {
                    "user_id": "Velimir Zivkovic",
                    "user_href": "/profile/Velimir-Zivkovic"
                },
                {
                    "user_id": "Kritika Gupta",
                    "user_href": "/profile/Kritika-Gupta-19"
                }
            ]
        }
    ]
}