{
    "title": "Why did England become an engineering center in 19th century? - Quora",
    "tags": [
        "Victorian Era (1837-1901 AD)",
        "History of Technology",
        "19th Century",
        "England",
        "Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason De Donno",
                "href": "/profile/Jason-De-Donno"
            },
            "answer_text": "The industrialisation process of the United Kingdom began in the 18th century, and underwent refinement and expansion in the 19th century. In particular, the infrastructure for steel production, forging and heavy engineering was well established by the middle of the 19th Century. The reasons commonly given as to why the United Kingdom became the world’s first industrial nation are the Agricultural Revolution, large supplies of coal, the geography of the country, its stable politics and its vast colonial empire.  [Edit]I don’t think one should separate out England from UK as it was the UK as a whole that was the ‘engineering centre’. If we talk about England then we must also talk about Scotland which had a high proportion of engineers, like James Watt. Scotland was also the shipbuilding centre of the world in the 19th Century, without any doubt! However, since the question was specifically about England, and since another answer here goes onto glorify Scotland and make England seem inconsequential, I feel I should point out some of the key English contributions. To do that, we’ll need to go back to some English pioneers of the Industrial revolution from a century earlier, as it was their legacy that made England an important engineering centre in the 19th Century. Perhaps we should start with Thomas Newcomen[1], father of the steam engine. Or if you want to go back earlier, Thomas Savery[2], who made the first steam engines with none moving parts that could do useful work. Both were…English.  One of the key engineering figures in England back then was Englishman John Wilkinson[3]. He is not well known like some other pioneers of his day, probably because his contributions were not glamorous. However, he invented some industrial level machine tools, like the precision boring machine used by James Watt to bore out the cylinders of his steam engines. He left us with series of tools that were to become foundation of the engineering infrastructure the next century. Next on the list is perhaps James Brindley[4], the canal engineer. Having all that coal for steam engines and for steel production was pretty useless if you could not transport it efficiently. It was too heavy to transport by road, but in a barge on a canal with aqueducts and locks, a single horse could cheaply and easily transport twenty tons of coal 20 miles in a day without any difficulty. Mathew Boulton[5], an English engineer who worked with James Watt on the Steam engine and with whom Watt partnered when he set up his business…in England. That ought to be enough to show why England was an important engineering centre in the 19th Century, but I did not mention George Stephenson, who made the first successful steam locomotive that became the model of all future ones: the Rocket.  Nor did I mention Isambard Kingdom Brunel[6], the prolific and visionary English engineer who made made the first suspension bridge, the first tunnel under a river (the Thames Tunnel) and the Great Western Railway. Not to mention his invaluable contributions to transatlantic steamship innovation. There are many other names I could and perhaps should have mentioned here, like Richard Trevithick[7], John Blenkinsop[8] and Joseph Whitworth[9], but I think the point has been made. (Please note that this edit is a mainly written as a response to Paul Harrison’s answer, which unfairly belittles of England’s role in the UK being an engineering centre in the 19th Century). Footnotes[1] Thomas Newcomen - Wikipedia[2] http://***Thomas Savery***[3] John Wilkinson (industrialist) - Wikipedia[4] James Brindley - Wikipedia[5] Matthew Boulton - Wikipedia[6] Isambard Kingdom Brunel - Wikipedia[7] Richard Trevithick - Wikipedia[8] John Blenkinsop - Wikipedia[9] Joseph Whitworth - Wikipedia",
            "date": "Updated January 19, 2020",
            "views": "155",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                },
                {
                    "user_id": "Tony Benn",
                    "user_href": "/profile/Tony-Benn-6"
                },
                {
                    "user_id": "Jeremy Greaves",
                    "user_href": "/profile/Jeremy-Greaves-3"
                },
                {
                    "user_id": "Peter Fletcher",
                    "user_href": "/profile/Peter-Fletcher-25"
                },
                {
                    "user_id": "John Allan",
                    "user_href": "/profile/John-Allan-21"
                },
                {
                    "user_id": "Bill Hanson",
                    "user_href": "/profile/Bill-Hanson-21"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Harrison",
                "href": "/profile/Paul-Harrison-69"
            },
            "answer_text": "You mean UK was an engineer centre you cannot have England without UK then , many of the engineers who made the revolution are Scottish using Welsh materials Wales produces 2 of the 3 good iron ore sources that could be steel and the best quality coal (only ref Henry in Thomas Tank Engine could only manage Welsh coal) England does have Ironbridge and the improved smelting of iron, Abraham Darby etc but it relies on the others to totally implement Robert Stephenson Edinburgh University railways Welsh coal James Watt Greenock Glasgow University steam engine Irish labour displaced to do the work Scottish Engineering Hall of Fame - Wikipedia The Scottish Engineering Hall of Fame honours \"those engineers from, or closely associated with, Scotland who have achieved, or deserve to achieve, greatness\", as selected by an independent panel representing Scottish engineering institutions, academies, museums and archiving organisations. The Scottish Engineering Hall of Fame was established by the Institution of Engineers and Shipbuilders in Scotland in 2011. Inductees Douglas AndersonWilliam ArrolJohn Logie BairdAlexander Graham BellThomas Graham BrownSir George BruceWilliam Kinninmond BurtonCraig ClarkVictoria DrummondHenry DyerDavid ElderJohn ElderSir William FairbairnMary (Molly) FergussonHugh GillJames GoodfellowNaeem HussainJames Clerk MaxwellGordon McConnellElijah McCoyAndrew MeikleSir Duncan MichaelSir Donald MillerWilliam MurdochRobert NapierPercy PilcherDorothée PullingerWilliam RankineJohn RennieJohn Scott RussellAnne Gillespie ShawRobert Stevenson (civil engineer)Robert StirlingThomas TelfordWilliam Thomson, Lord KelvinRobert Watson-WattJames WattWilliam Douglas WeirJames YoungMontgomery Scott to come later",
            "date": "Updated January 8, 2020",
            "views": "155",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Florence",
                    "user_href": "/profile/Frank-Florence-2"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Peter Fletcher",
                    "user_href": "/profile/Peter-Fletcher-25"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        }
    ]
}