{
    "title": "Why are women's underwear so soft? - Quora",
    "tags": [
        "Women's Underwear",
        "Fashion and Style"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Sutter",
                "href": "/profile/Mark-Sutter-10"
            },
            "answer_text": "Women's underwear are soft because they are considered to fragile beings who love to be pampered by everything..including their intimate wear. Coming to your question, the answer is a YES. Men too deserve to have something so delicate and pampering as well as have the options available at the men's underwear online store.With a low rise fit on the waistline, the fabric caresses the manhood and makes things so much better down there. Just this pair in the image.  It comforts the manhood and feels smooth against the skin with the fabric composition that lets you breathe better even on a hot day.There are numerous other options like this on the internet from where you can pick up your favorite pair. ",
            "date": "Answered August 29, 2017",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kush Shah",
                    "user_href": "/profile/Kush-Shah-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dharini Singhal",
                "href": "/profile/Dharini-Singhal"
            },
            "answer_text": "The main reasons are that women's panties don't need to provide the same level of support as men's briefs, as there is no package to support. Women's panties need to be super absorbent. So the clothing can be as soft as possible. And women's private parts are sensitive, and women are prone to infections in that region. So a soft material is Required. That's why women will not wear lace as a daily wear, in general. ",
            "date": "Answered July 29, 2017",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raksh Tong",
                    "user_href": "/profile/Raksh-Tong"
                }
            ]
        }
    ]
}