{
    "title": "Why is Northern Brazil more dangerous compared to Southern Brazil? - Quora",
    "tags": [
        "Living in Brazil",
        "Culture of Brazil",
        "Visiting and Travel in Brazil",
        "Brazil"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thiago Ribeiro",
                "href": "/profile/Thiago-Ribeiro-2"
            },
            "answer_text": "You are right. Although the media reports a lot of violence in cities in the south, such as Rio de Janeiro, the cities of the North and Northeast are more violent. Indicators of homicides and violent deaths are relevant in cities such as Recife, Fortaleza and Manaus. Something, however, to consider when visiting Brazil is that there are violent zones and zones without violence in the same city. Perhaps the reason for so much violence in the north (I am not a specialist) is the low level of human development (HDI), the lack of public policies, high illiteracy, little ostensible policing and drug trafficking. ",
            "date": "Answered May 18, 2019",
            "views": "205",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ada Yavuz",
                    "user_href": "/profile/Ada-Yavuz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiago Dornellas",
                "href": "/profile/Tiago-Dornellas"
            },
            "answer_text": "The northern parts of the country are both poorer and have greater inequality, so i guess that would explain the fact that statistically the north and northeast are more violent. There are historical reasons for this, but as I am not a specialist, I will not elaborate much on it. In a nutshell, the Brazilian northern regions used to function a lot like the southern USA, a slavery dependent plantation economy. Southern parts were not so suitable for this kind of agriculture and suffered a late process of colonization which created a much less unequal social situation. Finally, you shouldn't consider that every place in the south is safer than any other place up north. There are very dangerous places in the southern areas of Brazil, specially in the larger cities, and there are safer places to visit in the north and northeast that you should definitely consider when traveling to Brazil. ",
            "date": "Updated May 12, 2019",
            "views": "298",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Holden",
                    "user_href": "/profile/Robert-Holden-22"
                },
                {
                    "user_id": "Bárbara Diniz",
                    "user_href": "/profile/Bárbara-Diniz"
                },
                {
                    "user_id": "Ada Yavuz",
                    "user_href": "/profile/Ada-Yavuz"
                },
                {
                    "user_id": "Vitor Silva",
                    "user_href": "/profile/Vitor-Silva-3-1"
                }
            ]
        }
    ]
}