{
    "title": "Why didn’t the Industrial Revolution start 500 years earlier? - Quora",
    "tags": [
        "Industrial Revolution",
        "Economic History",
        "Revolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "Because of Required Secondary Powers. The required secondary powers were a) cheap and efficient energy source b) understanding of calculus and higher mathematics c) evolution of true Capitalism and d) understanding the connection of philosophy, mathematics, science and engineering. The a) was coke. That is, dry distilled coal which is almost pure elemental carbon. The only energy sources before coke were human and animal muscle power, wood and garbage, wind and water current. As long as the only available energy sources were human and animal muscle power, slavery would prevail, and with only the rest mentioned available, steam engine would be impossible as deforestation and climate change had depleted the sources of firewood. Abraham Darby invented the coking furnace in 1701. The byproduct was coal tar, which would also open the doors for the rise of chemical industry. 500 years earlier was 1201 and reign of Philippe II Augustus in France, John I in England and Otto IV of the Holy Roman Empire. Paper had just been introduced in Europe, and literacy was on the rise. The Scholastics were doing their first evaluations on infinitesimally small and immensely large, laying basis for calculus, but Newton and Leibniz (b) were yet to come. Proto-Capitalism would emerge in Italy within twenty or so years, and Tartaglia would introduce the Arabic numbers in Europe and discover the third degree polynomial equation solution. But true Capitalism would evolve only in the 16th century (c). But philosophy had not yet managed to find the connection between philosphy, mathematics, science and technology. (d )That would happen only fifty years later, with Roger Bacon. But once all those required secondary powers were there, the industrial revolution was ready to happen. Coke meant immense increase on efficiency of blast furnaces, meaning cheap iron in abundance. It also meant cheap fuel for steam engines - first Savery’s, then Papin’s, then Newcomen’s, then Watt’s steam engine. It meant efficient engines and motors for transportation and industry, and with Capitalism, improved commerce and mass production. Jacquard loom, Pascal’s calculator - Whitney’s cotton gin - all those now realized their true potential, and the industrial revolution was on its way. ",
            "date": "Answered March 15, 2020",
            "views": "64",
            "upvotes": " View 254 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellie Murphy",
                    "user_href": "/profile/Ellie-Murphy-67"
                },
                {
                    "user_id": "Bill Bockeley",
                    "user_href": "/profile/Bill-Bockeley"
                },
                {
                    "user_id": "Raja Singh",
                    "user_href": "/profile/Raja-Singh-1354"
                },
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Dave Kaiser",
                    "user_href": "/profile/Dave-Kaiser-3"
                },
                {
                    "user_id": "Oluwatomisin Mbas",
                    "user_href": "/profile/Oluwatomisin-Mbas"
                },
                {
                    "user_id": "Colin Yao",
                    "user_href": "/profile/Colin-Yao-7"
                },
                {
                    "user_id": "Kingshuk Bandyopadhyay",
                    "user_href": "/profile/Kingshuk-Bandyopadhyay"
                },
                {
                    "user_id": "Martin Lacika",
                    "user_href": "/profile/Martin-Lacika"
                },
                {
                    "user_id": "Oleg Dvornikov",
                    "user_href": "/profile/Oleg-Dvornikov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Patterson",
                "href": "/profile/Adrian-Patterson-1"
            },
            "answer_text": "An electric battery was created in Ancient Persia and a curiosity which could have been turned into a steam engine was invented in Ancient Greece. In both cases there was no infrastructure to integrate the inventions or perceived utility for them. This all suggests to me that a while series of technological events raised Europe to the point that an industrial revolution could only have taken place at a particular juncture in time. Basically an entire technological landscape that included metallurgy, the printed word, freedom to experiment and necessity. The inventions that drove the steam age and later the electrical age- not that the latter is acknowledged as a staging post — were discovered in antiquity but no one knew what to do with them— and they were forgotten about. The steam engine originally designed to pump water from mines, was adapted to power a locomotive and to power machines in factories. The engine was placed in boats to create steam boats and the idea of nuts and bolts machines was transferred to Babbages Analytical Engine — a machine that made calculations. Analytical Engine - Wikipedia Once the power loom was created and the idea of cards to programme the sequential operations was thought of by Jacquard Jacquard loom - Wikipedia this would later form the basis for computer programming. Basically one invention probably could not have occurred without exploiting existing predating technologies in other areas. I think it is also likely that a certain population size is required, to provide enough people working in different fields to allow cross pollination to occur. That would have suggested China or India could have been the source of the industrial revolution. But China went into years of isolation, and it's ruling classes, like the Catholic church in Europe set down rules that forbade inventions which might have upset the status quo. I don't know why India wasn't in a position to create the Industrial revolution but I imagine the lack of printed books and an artisan/scientific class may have been at fault. You need people to have enough time on their hands and the artisinal skills to experiment. In other words enough people involved in a technical milieu who don't have to spend their whole time in providing the means of subsistence. Upper class toffs afraid to dirty their hands weren't going to discover machine technology. Whilst steam engines were invented by non scientists, I suspect the widespread knowledge of their existence and the subsequent adaption that took place could not have taken place without the dissemination of the printed word. Europe experienced the Renaissance and had enough non subsistence artisans who among them had one or two maverick inventors to raise the bar. That is why counter intuitively population growth I think is a good thing. The more people you have the more likely you are to produce that one genius who invents cold fusion or time travel. One invention can transform the world and make it possible to feed and clothe the entire planet, regardless of how big the population is. ",
            "date": "Answered December 7, 2018",
            "views": "517",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Riley Obrien",
                    "user_href": "/profile/Riley-Obrien-44"
                },
                {
                    "user_id": "David Blumenthal",
                    "user_href": "/profile/David-Blumenthal-21"
                },
                {
                    "user_id": "Richard Hay",
                    "user_href": "/profile/Richard-Hay-5"
                },
                {
                    "user_id": "George Branagh",
                    "user_href": "/profile/George-Branagh-1"
                },
                {
                    "user_id": "Will Busby",
                    "user_href": "/profile/Will-Busby-1"
                },
                {
                    "user_id": "Chuck Curtis",
                    "user_href": "/profile/Chuck-Curtis-4"
                }
            ]
        }
    ]
}