{
    "title": "Why did the Soviet Union go to war with Afghanistan? - Quora",
    "tags": [
        "Soviet Invasion of Afghanistan (1979-1989)",
        "The Cold War",
        "Afghanistan",
        "Soviet Union",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Cameron Greene",
                "href": "/profile/Cameron-Greene-5"
            },
            "answer_text": "It was an intervention at the behest of the government of Afghanistan at that time that morphed into a full blown counterinsurgency operation lasting more than nine years.  Soviet soldiers observe the highlands, while fighting Islamic guerrillas at an undisclosed location in Afghanistan, April, 1988. To understand how this all started, we have to trace the history of the government of Afghanistan all the way back to the independence of Afghanistan in 1919. In 1919, the British and the Afghans signed the Treaty of Rawalpindi which granted Afghanistan independence under the rule of King Amanullah Khan. Khan then embarked on a series of diplomatic visits aimed at breaking Afghanistan’s isolationism and opening her to the world. Over the course of 14 years, Afghanistan would see a continuous revolving door of leaders with many being assassinated or overthrown by their predecessors with King Zahir Shah being proclaimed the final king of Afghanistan in 1933. Afghanistan would remain neutral in World War 2 and throughout much of the early Cold War, playing both the East and West for investment projects to help modernize and strengthen the country.  Last King of Afghanistan Zahir Shah (1933–l973) In the 1960s, Shah accelerated his modernization plans, promising free elections and equal rights for both men and women. These were not popular with parts of the government, specifically Shah’s cousin and former Prime Minister, Mohammed Daoud Khan, who overthrew Shah in 1973 while he was abroad in Italy on a diplomatic visit. Daoud then became the first President of Afghanistan. Under Daoud, the country really saw no departure from the policies of Shah, save for the curbing of civil liberties to some degree and Afghanistan prospered under his presidency. Tensions mounted however as the policies of Daoud became more oppressive and he moved himself and Afghanistan further from the Soviets and closer to the U.S. and Iran who was still a U.S. ally at this time.  First President of Afghanistan Mohammed Daoud Khan (1973–1978) Eventually, the factional strife overtaking the PDPA (People’s Democratic Party of Afghanistan) became too much and on April 27th, 1978, the PDPA overthrew Daoud in the Saur Revolution, killing him and most of his family. The new government under Nur Muhammad Taraki and the far more liberal wing of the PDPA began an even more intensive series of modernization programs aimed at bringing Communism to Afghanistan. They made a particular effort of bringing women closer and closer into equality with men, going so far as to allow them to participate in politics. This set off the more Islamic factions of the government who saw these reforms as a direct attack on Islam itself.  Second President of Afghanistan Nur Muhammad Taraki (1978–1979) Things turned sour when the PDPA started a series of land reform campaigns modelling themselves after similar programs within the Soviet Union. This backfired horribly as the rural population saw their plots of land shrink dramatically and their crop yields with it. This made Taraki more repressive in handling the population when growing unrest as a result of the land campaign spilled over into an uprising. The uprising was crushed brutally but the damage was done. Events quickly spiralled as the population of Afghanistan turned against Taraki and the government with numerous units of the Afghan Army mutinying across the country. Taraki felt his positioned threatened and wanting to avoid the fate of his predecessors, invoked the ‘Friendship Treaty’ the Afghans had signed with the Soviet Union in December of 1978 which promised military assistance if requested. The Soviet Union reluctantly armed the Afghan Army and sent advisers to train the force into a more effective form. While this was all taking place, another power struggle developed in the PDPA between Taraki and a former friend, Hafizullah Amin. Amin won the struggle, orchestrating a coup against Taraki and having him arrested and executed once he was effectively removed from power. Amin proved too radical for the Soviets who witnessed the unrelenting chaos his presidency was bringing to Afghanistan, Amin’s regime being even more repressive than Taraki’s. The Soviets then decided to support the more moderate elements of the PDPA and organized a KGB strike led by Alpha Group in what was known as Operation Storm-333.  Soviet armored infantry entering Afghanistan, December, 1979. On December 25th, 1979, the Soviets invaded Afghanistan with over 80,000 troops storming in from the northern border while Alpha Group began its raid against Amin. Amin had thought the Soviets were still on his side when they invaded only to have this proved wrong when Alpha Group stormed the Tajbeg Palace where he was hiding. He was arrested, tried, and executed. From this point on, the Afghan government was propped up by Soviet forces who attempted to pacify the countryside against the rising Islamic elements that were holding out in the countryside. Effectively, this became the Soviet Union’s ‘Vietnam,’ taking their attention for well over nine years. The rest, they say, is history. ",
            "date": "Updated January 6, 2019",
            "views": "243",
            "upvotes": " View 414 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vladislav Lazarevic",
                    "user_href": "/profile/Vladislav-Lazarevic"
                },
                {
                    "user_id": "Cole Taylor",
                    "user_href": "/profile/Cole-Taylor-7"
                },
                {
                    "user_id": "Nailah Gull Khan",
                    "user_href": "/profile/Nailah-Gull-Khan"
                },
                {
                    "user_id": "Chris Hui",
                    "user_href": "/profile/Chris-Hui-11"
                },
                {
                    "user_id": "Michael Smith",
                    "user_href": "/profile/Michael-Smith-1593"
                },
                {
                    "user_id": "Warwick Pearmund",
                    "user_href": "/profile/Warwick-Pearmund"
                },
                {
                    "user_id": "Justin Lee",
                    "user_href": "/profile/Justin-Lee-1026"
                },
                {
                    "user_id": "Mustafa Kemal Atatürk",
                    "user_href": "/profile/Mustafa-Kemal-Atatürk-5"
                },
                {
                    "user_id": "John Stevens",
                    "user_href": "/profile/John-Stevens-133"
                },
                {
                    "user_id": "Mandalia Hardy",
                    "user_href": "/profile/Mandalia-Hardy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tommy Back",
                "href": "/profile/Tommy-Back-3"
            },
            "answer_text": "They didn't. They were invited by the communist government to fight Islamists. No state has been as supportive of Islamist terrorism as the United States and its governments, from President Jimmy Carter onwards.  It is as ironic as inevitable. Even if one or another right-wing party suffers rage at the simple point.  It started with Jimmy Carter's administration hatching a plan to fool the Soviet Union into its own Vietnam War. The idea is attributed to Presidential Security Advisor Zbigniev Brzezinski. One would make a trap in Afghanistan, a country more or less allied with the Soviet Union. There, a religion-based rebellion against the country, like ISIS in Syria, according to the insurgent mujaheddin (\"the warrior of God\"), the country was undergoing a worldly regime where music was allowed, girls were allowed to go to school and similar offenses, all wrong for Muslim fundamentalists.  Security adviser Brzezinski's plan was simple and concrete. If they armed the insurgents and trained them militarily, they would soon achieve so great military success against a weak Afghan army that the Kabul regime would call for help from Moscow. It could develop into a religious freedom war against wicked socialism where women had the same rights as men to education and work. Volunteer warriors would be pouring in from all directions and the CIA should soon be busy in training and arming them all.  Soviet swallowed the bait. Around Christmas 1979, the first Soviet armored divisions rolled into Afghanistan invited by the ruthless Amin.. The plan worked. The Soviet Union had been hit by a Vietnam war, an eight-year military and political disaster.  It was yet another time when the world did not see Islamist terrorism as a problem. And when Ronald Reagan's administration took over the wheel, it was driven with ever greater efficiency and, one might assume, growing delight, the war continued. In 1985, Ronald Reagan initiated the CIA's most comprehensive overseas commitment ever, Operation Cyclone, which poured modern-day weapons and military training for billions of dollars over mujaheddin and all trapped jihadist enthusiasts. The most widely known of all these US trained and armed warriors to the teeth was Usama bin Laden. Thw warfare Univeristy in Peshawar could tkae 6000 sudents. USA teaching warfare, Saudi religion.  In the psychological warfare, the US aid agency USaid drew its very special straw to the stack by producing four million school books that taught Afghan children how to stick the eyes out and cut the legs of Russians. This educational material was later used in the Quran schools of the victorious Taliban, and later on Americans.  Soviet lost as planned its Vietnam War, the Taliban took power in Kabul and introduced religious dictatorship of a known kind. As a result, Afghanistan became a sanctuary for tens of thousands of US-trained holy warriors. But they now left the US friendship and instead focused their interest on Iraq.  Thus, when Usama bin Laden and his al-Qaeda organization attacked the United States on September 11, 2001, it should not have come as a complete surprise (and it wasnt for some). But this time it was the United States that fell into the trap that Usama bin Laden had laid. The September 11, 2001 attack provoked President George W Bush to launch two of America's longest wars, first against Afghanistan, then against Iraq. This time it was Usama bin Laden's turn to rub his hands in delight.  When the military-defeated state of Iraq collapsed and the occupying power of the United States dismissed all Iraqi army commanders and officers, who like the Taliban and terrorists in al-Qaeda, belonged to the Sunni branch of Islam, it created a perfect recruitment base for the next terrorist IS, Islamic State of Syria and Iraq ”.  In the spring of 2011, Nobel Peace Prize winner Barack Obama made the same mistake as former Nobel Peace Prize winner Jimmy Carter. Obama's administration allowed the CIA to arm and train Libyan holy warriors who wanted to overthrow dictator Muammar Gadaffi. Of course with disastrous consequences. Libya was transformed into a giant terrorist nest run today by different fractions of Al Qaeda.  Obviously, the Peace Laureate Obama learned nothing. Because when the civil war in Syria was a fact, as an extension of \"the Arab Spring,\" the United States established special weapons/ distribution and recruitment stations in southern Turkey and Jordan. There all \"opponents\" could provide themselves, which they did. And thus, the \"Islamic Caliphate\" soon became a nightmare of reality, the Middle East's cruelest terrorist organization in modern times.  As you know, it took many years of blood, sweat and tears for the Kurdish freedom movement, Iran, Hezbollah and Syrian Arab army to defeat IS and put surviving terrorists in prison camps. Certainly with US support, especially from air combat forces after Putin had bombed all ISIS infrastructure.  But when the victory over IS finally came, President Donald Trump relentlessly surrendered the former Allied Kurds in the Turkish dictator Erdogan's violence. From Erdogan's point of view, all Kurds are terrorists and should be treated accordingly. Maybe Trump reads history after all and have noticed that all infidels not converting to sunni gets wiped out like 300.000 Yazidis 1915-1923, and as many Armenians.  And the sense of morality in this? God knows. Donald Trump is the only US president since the Jimmy Carter Peace Prize who did not participate in the project to train and arm Islamist terrorists. He undoubtedly chose another path. With the motivation that the Kurds never helped the United States, nor did they participate in Normandy in 1944. But Trump probably gets the Nobel Peace Prize, too.  By the way, I think ... There is some imbalance in the Norwegian Storting's choice of Nobel Peace Prize laureates. Seventeen awards have gone to the United States, including four war presidents, a vice president and an architect behind special Christmas bombings during the Vietnam War. ",
            "date": "Answered April 4, 2020",
            "views": "696",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Snezana Fajt",
                    "user_href": "/profile/Snezana-Fajt"
                },
                {
                    "user_id": "Varun Parkar",
                    "user_href": "/profile/Varun-Parkar-1"
                },
                {
                    "user_id": "Max Legend",
                    "user_href": "/profile/Max-Legend"
                },
                {
                    "user_id": "Mike Skiyer",
                    "user_href": "/profile/Mike-Skiyer"
                },
                {
                    "user_id": "Vladimir Abramov",
                    "user_href": "/profile/Vladimir-Abramov-3"
                }
            ]
        }
    ]
}