{
    "title": "Why and when did Chinese people stop writing with brushes? - Quora",
    "tags": [
        "Chinese Brushes",
        "Writing (Language skill)",
        "Chinese Calligraphy",
        "Chinese Writing",
        "Calligraphy",
        "Culture of China",
        "Chinese Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "The Chairman's Bao",
                "href": "/profile/The-Chairmans-Bao"
            },
            "answer_text": "Chinese people haven’t all together stopped using brushes. Especially when we consider the prevalence of calligraphy and brush pens for every day writing. It would be more accurate to say that from the 19th-20th century onwards China incorporated other writing utensils (ball-point, felt-tip, pencils, etc). The incorporation of this tools was via multiple routes whether it be through trade or affluent Chinese returning from studies abroad. Traditionally and historically, Chinese people did not only use the brush to write. They also used “hard tools” such as reed pens, bamboo pens, bone pens and knife pens. These utensils had the same shape and similar dynamic to modern pens. Furthermore, brushes were also created with different sized tips so they had the same consistency as modern pens. The reason for the overall transition into modern pens is mainly convenience and accessibility. With brushes and other hard tools, you typically had to dip the tool in ink. However, with modern pens the ink is inside. Pencils were even better , because it decreased reliance on ink and writing could be erased which was a bonus. ",
            "date": "Answered March 2, 2020",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed Tsoi",
                "href": "/profile/Ed-Tsoi"
            },
            "answer_text": "As primary students in the 1960s, we had classes for Chinese calligraphy, first wrote on copy books and then on blank papers. Just like we had to use ink and pen for English homeworks. Ball point pen was not popular. In the latter part of 1960s, almost everyone turned to ball points. Convenience and costs cheaper, cleaner were the main reasons. I am impressed that for the Japanese schools, they still teach pupils writing with ink and brushs. ",
            "date": "Answered February 24, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maikay Poh",
                    "user_href": "/profile/Maikay-Poh"
                }
            ]
        }
    ]
}