{
    "title": "Why are some cultures more individualistic than others? - Quora",
    "tags": [
        "Individualism",
        "Ethnic and Cultural Differences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sven Williams",
                "href": "/profile/Sven-Williams"
            },
            "answer_text": "I think it mostly depends on historical circumstances than anything else. Humans, by dint of evolutionary history, are very cooperative and collectivistic, but certain environmental and economic factors tend to push human societies more towards the individualistic end of the scale: colonization, for one, and industrialization, for another. In cultural anthropology, it’s taken to be an axiom that culture is the primary adaptive mechanism of Homo sapiens, and so it’s fair to say that where a society lies on the individualism-collectivism continuum is a function of selective pressures. Maybe I’m biased in only thinking of my own culture, but we North Americans are the archetypical individualists, and have been from our very beginnings. That sort of individualism had its roots among the elite and intelligentsia of European high society, but really was allowed to flourish in the frontiers and trading towns of North America. A man could leave behind his family name and become incredibly wealthy through a combination of luck and cunning. He didn’t have to stay on the family farm; he had opportunities that his land-bound forebears simply didn’t have. This really took off after industrialization transformed what was mostly an agrarian economy (which required close cooperation and shared labor) into the beginnings of capitalism, which allowed the rewards of production to become concentrated into fewer hands. Rapid and intensive social change tends to upset cultural norms and allow for a greater degree of individual expression and agency. But industrialization alone cannot account for individualism; there has to have been some sort of long history of individual reward over collective safety, and frankly, that confluence of traits and circumstances is rather rare in human history. Wealthy societies tend to be more individualistic than poorer societies, because individuals can afford to dispense with the group if there’s incentive to. Also, societies whose economic base doesn’t require massive amounts of shared labor tend to be more individualistic (say, trading or piracy) than those based in labor-intensive economic models (such as resource extraction or agriculture). ",
            "date": "Answered March 14, 2017",
            "views": "490",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikki Patino",
                    "user_href": "/profile/Nikki-Patino"
                },
                {
                    "user_id": "Nell Zhang",
                    "user_href": "/profile/Nell-Zhang"
                },
                {
                    "user_id": "Adey Gurshan",
                    "user_href": "/profile/Adey-Gurshan"
                },
                {
                    "user_id": "Clarissa Lohr",
                    "user_href": "/profile/Clarissa-Lohr"
                },
                {
                    "user_id": "Thomas L. Johnson",
                    "user_href": "/profile/Thomas-L-Johnson-1"
                }
            ]
        }
    ]
}