{
    "title": "Why did the average Union soldier fight during the Civil War? - Quora",
    "tags": [
        "Soldiers",
        "Historical Civil Wars",
        "Military History of the United States of America",
        "U.S. Civil War",
        "Military Personnel",
        "History of the United States of America",
        "Warfare",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Winter",
                "href": "/profile/Andrew-Winter-54"
            },
            "answer_text": "I took a class in my bachelor’s studies called “Modern Warfare”. It was a unique class focusing on the effects of modern warfare on the human mind. The book we used made the case that the motivations for war come in three broad levels. Govtenlistment of individualsthe reaction under combat of those individuals. The American Civil War. The Government’s decision, Abe Lincolns decision, to send Federal Forces, unconstitutionally, into the Southern States whose governors had not given permission to, was about keeping the Southern States in the Union and keeping The United States of America in one piece.The crisis was caused by the Southern States insistence that it was a “state’s right” to determine if a human being could be property or not. i.e. slaves. Now while Lincoln made no mention of using war to end slavery, it was a different story for the young men who were enlisting in the first part of the war up to the few months before the Battle of Antietam. Bruce Catton in his book “The Army of the Potomac” points out that by then, since the Union had made no headway in ending slavery, voluntary enlistment was dropping off rapidly. But, in those first years ending slavery was a prime motivator for enlisting young men The last and lowest level has to do with, “Why does a soldier stay in a battle when his, nowadays her, buddies start getting killed in the battle. In all the wars of human history this level of motivation has remained constant. The good soldier is held in the battle by their deep rooted desire to avoid letting the soldiers next to them down. The average Union Soldier’s motivation depended on when in the war we are talking about and whom. The film Gettysburg does have that wonderful scene between Col Chamberlain and his First Sergeant. The First Sergeant is an Irishman. Irish immigrants were given blanket citizenship right off the boat if they enlisted in the Union Army, displayed neatly in the film “Gangs of New York”. That was a marked difference from those young men in the early part of the war who enlisted to end slavery. ",
            "date": "Answered November 21, 2019",
            "views": "604",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harold Sherman",
                    "user_href": "/profile/Harold-Sherman-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "James M. Volo",
                "href": "/profile/James-Martin-2066"
            },
            "answer_text": "Why Did They Fight? The motivation of most volunteers seems to have been rooted in the compelling and deeply personal forces of duty and honor. In 1861 both of these were closely linked with concepts of masculinity, morality, conscience, and romance. Almost all those who fought during the first two years of the war WERE VOLUNTEERS. It is strange that federal volunteers most often associated their service with duty, while honor seems to have motivated Confederate volunteers. Although the two are not mutually exclusive, there is some truth in viewing the South as a society with a profound sense of honor, whereas the North was driven by a communal conscience analogous to a compact made with God. Americans of the early nineteenth century were strongly influenced by such sentiments. The consciousness of duty resonated particularly well with the parallel development of social reform in the North. To shirk duty was to violate the collective conscience and to offend morality by omission. Duty was viewed as a personal responsibility rather than a collective obligation. It served as part of the identity of manhood and established the place of the individual in society. \"We all of us have a duty to perform in this life,\" wrote one volunteer. It was not enough to support the war from a distance when duty required that a man place his life on the line. Many Confederates also cited obligations to duty, but they were much more likely to speak of honor. The men who opposed one another on the battlefields of the Civil War were more alike than different. Generally, the soldiers on both sides came from similar backgrounds, spoke the same language (although sometimes with widely divergent regional accents), had the same political history, cherished the same Constitution, and suffered the same hardships and dangers offered by soldiering. But the differences between Billy Yank and Johnny Reb were nonetheless meaningful enough to sustain four years of bloody conflict and may help to explain the relationship between these enemies. The origins of the terms \"Billy Yank\" and \"Johnny Reb\" in reference to Civil War soldiers are not quite apparent. It is evident, however, that the soldiers referred to themselves and their enemies using these terms. Notwithstanding their civilian occupations, each man came with a set of values that mirrored the home and community he left behind. The majority of the recruits in the first year of the war were volunteers, and they pledged themselves to serve for three months, expecting that the first major battle would decide the issue of secession. Nonetheless, their commitment to serve, their personal and economic sacrifice, and the distress experienced by their families and loved ones should not be minimized because of this limited initial commitment. Honor was primarily a masculine concept that dealt with one's public image and reputation. There is ample evidence of a link among the romantic themes of adventure, glory, and honor that appeared in the popular literature of the period and the letters and diaries of the Southern volunteers. Nonetheless, Southerners also viewed honor in a contemporary light, and the continued popularity of dueling attests to the vitality of the sentiment in the Southern psyche. Confederate soldiers often wrote of being dishonored in the eyes of their \"revolutionary ancestors\" should they fail to defend the cause. Nonetheless, the appeals to duty and honor were most often found among the letters and journals of the more literate upper classes. Among less popular motivations such as adventure, excitement, patriotism, and ideology, Civil War soldiers were also affected by a need to prove their masculinity. Southerners tended to be more boastful in this regard than the Yankees. \"They were amiable, gentle, and unselfish in disposition, yet were fearless and daring in spirit, and devoted . . . to those bodily exercises that make the strong and vigorous man,\" noted one observer. Northerners tended to be more circumspect, worrying whether they would pass the test of manhood posed by battle. The psychological importance of passing this test should not be minimized. Particularly among the young volunteers, the experience of battle, \"seeing the elephant\" in nineteenth-century terms, was seen as a rite of passage. See: Daily Life in Civil War America, 2nd Edition: Dorothy Denneen Volo, James M. Volo: 9780313366031: Amazon.com: Books  ",
            "date": "Answered November 23, 2019",
            "views": "613",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Baz Barović",
                    "user_href": "/profile/Baz-Barović"
                },
                {
                    "user_id": "Camilo Fonseca",
                    "user_href": "/profile/Camilo-Fonseca-3"
                },
                {
                    "user_id": "Tristan Flowers",
                    "user_href": "/profile/Tristan-Flowers"
                },
                {
                    "user_id": "Niclas Olovsson",
                    "user_href": "/profile/Niclas-Olovsson"
                }
            ]
        }
    ]
}