{
    "title": "Why didn’t the ancient Egyptians mentioned or recorded anything about Prophet Moses even though he was born in ancient Egypt? - Quora",
    "tags": [
        "Moses (biblical figure)",
        "Ancient Egyptians",
        "Ancient Egypt"
    ],
    "response": [
        {
            "author_info": {
                "name": "Niko Christian Wallenberg",
                "href": "/profile/Niko-Christian-Wallenberg"
            },
            "answer_text": "Because he didn’t exist - I’ve said this before and I’ll say it again. There isn’t evidence of ancient Hebrews having been enslaved in Egypt to begin with, or for the existence of Moses. The story of Moses actually reuses elements from much older story of Akkadians (another Semitic people), which is obvious to anyone who’s compared it with that of the ancient king Sargon of Akkad: and while we have actual archeological evidence concerning Sargon of Akkad and his kingdom (who on the side would become subject of mythologized story), we have no such evidence of Moses. The story of Moses was created during the period of the Babylonian Exile as part of a series of stories (the first five books of the Old Testament or the Torah) designed to convey a sense of common origin, purpose, and destiny to the people held in exile; when many of these people had become disheartened and dispirited. The story of Moses and the Exodus is probably the most researched in the whole history of biblical archaeology, yet not one single bit of credible evidence has come to light. In reality, the origins of the people who formed the nation of Israelites were much more prosaic, and involved a slow migration of people out of the city-states of Canaan and into the unoccupied highland region of what’s now the West Bank region, where they formed their own independent state. This took place over a period of a couple of hundred years and is well evidenced by way of the archaeological record they left. ",
            "date": "Answered June 23, 2019",
            "views": "346",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johan Roschier",
                    "user_href": "/profile/Johan-Roschier"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                },
                {
                    "user_id": "Halina Minadeo",
                    "user_href": "/profile/Halina-Minadeo"
                },
                {
                    "user_id": "Andrew Holliday",
                    "user_href": "/profile/Andrew-Holliday-1"
                },
                {
                    "user_id": "Ben Waldock",
                    "user_href": "/profile/Ben-Waldock-2"
                },
                {
                    "user_id": "Peter Aleff",
                    "user_href": "/profile/Peter-Aleff-1"
                },
                {
                    "user_id": "Steven D. Gurlen",
                    "user_href": "/profile/Steven-D-Gurlen"
                },
                {
                    "user_id": "Emerson Gois",
                    "user_href": "/profile/Emerson-Gois"
                },
                {
                    "user_id": "Olivier Garamfalvi",
                    "user_href": "/profile/Olivier-Garamfalvi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Arefin",
                "href": "/profile/Rebecca-Arefin"
            },
            "answer_text": "Actually they did..in fact there was a Pharaoh names Ahmose whose name means “brother of Moses”. The problem is not that Moses and the events are not mentioned, they are mention.. of course from an” Egyptian point of view” so slightly different than the Biblical point of view… The problem is that they do not want to give any credence to Scripture, or to the Israelites, so they deny the evidence, and change the time periods when things occurred so they can say “It does not match”. I would highly suggest you watch the The History Channel’s documentary “ The Exodus Decoded” While i dont take it as absolute, He brings up many archaeological finds that support Moses and other events as real historical figures and facts.. Very interesting whether you agree with his conclusions or not. ",
            "date": "Answered June 23, 2019",
            "views": "140",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Timmer",
                    "user_href": "/profile/Timothy-Timmer"
                },
                {
                    "user_id": "Emerson Gois",
                    "user_href": "/profile/Emerson-Gois"
                },
                {
                    "user_id": "Clarence Uhrich",
                    "user_href": "/profile/Clarence-Uhrich"
                },
                {
                    "user_id": "Cortlyn Taylor",
                    "user_href": "/profile/Cortlyn-Taylor-1"
                },
                {
                    "user_id": "Ruven Ikari",
                    "user_href": "/profile/Ruven-Ikari"
                }
            ]
        }
    ]
}