{
    "title": "Why do ancient Egyptians look more like African Americans than modern-day Egyptians? - Quora",
    "tags": [
        "Ancient Egyptians",
        "People of Egypt",
        "Ancient Egypt",
        "Africans",
        "Egypt",
        "African Americans",
        "Physical Appearances of People",
        "Ancient History",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Moataz El Shafie",
                "href": "/profile/Moataz-El-Shafie"
            },
            "answer_text": ". That is it not true, if not the opposite is more accurate. The last and most advanced DNA study on Egyptians mummies covering a span of 2000 years from New Kingdom for Romans times, showed a remarkable consistency of Egyptians ethnicity. Modern Egyptians have gained 8% more subsaharn DNA then their direct ancestors, which was negligible to start with. Also, a dental morphology of the Fayyoum mummies conducted by Joel. D Irish came to similar conclusion to the DNA studies covering mummies from Dynastic, Ptolemaic and post Ptolemic. As far as ancinet Egyptian looking like African America, that is only possible with the aid of drug induced psychosis. African Americans have the distinct appearance of West to South Africans. I would not ever confuse them with Eithopians, Somalias and or even Nubians, let alone to Egyptians at any point of history.  As far ancient Egyptians appearing darker then modern Egyptians, that could be attributed to the ancients exposure to.the sun. Modern Egyptians especially the ones by the Nile valley and native Christian Egyptians are no different in appearance then the ancients and you can't fault them with anyone else. The skin tone ranges from light tan to dark copper. Women may appear lighter then men because that tend to stay indoors more. Below, prince Rahotep and wife Nofret from the 4th dynasty, old kingdom  Note: Arab is not a race and the people of the Arabian peninsula are not the same as native Egyptians , even if they were related. There are minority groups in Egypt that originated from the Arabian peninsula and are more cognizant of the Arabian roots, such as the Bedouins of Sinai, Banu Hilal and Abu Abu Ghazala of upper Egypt. The Bedouins always inhabited the Sinai peninsula, Jordan, and Palestine and the Banu Banu Hilal and Ghazala clan were migrants from the Hejaz in today's Saudi Arabia that settled in upper Egypt in the 11th century.  ",
            "date": "Answered July 22, 2020",
            "views": "157",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Marcus Sidoti-McNary",
                    "user_href": "/profile/Marcus-Sidoti-McNary-1"
                },
                {
                    "user_id": "Glen Ross",
                    "user_href": "/profile/Glen-Ross-30"
                },
                {
                    "user_id": "S. Patrick Maiorca",
                    "user_href": "/profile/S-Patrick-Maiorca"
                }
            ]
        },
        {
            "author_info": {
                "name": "Françoise Marie",
                "href": "/profile/Françoise-Marie-1"
            },
            "answer_text": "This is a very strange question for two reasons. Reason # 1 : Modern day Egypt is inhabited by two main categories of Egyptians : ethnic Egyptians and Egyptian citizens. Ethnic Egyptians are the descendants of ancient Egyptians. It is an open secret that the ancient Egyptian race lives on among the rural Fellahin and the Saidi of Upper Egypt. They are the darkest and blackest Egyptians. Egyptian citizens are the descendants of all those people who are not ethnic Egyptians but are found in the modern Egypt as descendants of ancient settlers from in and out of Africa, slaves from in and out of Africa and as inhabitants of modern day Egypt within its modern borders. Egyptian citizens are, among others, Beja Egyptians, Nubian Egyptians, Albano-Egyptians, Franco-Egyptians, Arabo-Egyptians, etc. Imperial Egypt until 1884 was much larger than the Egypt of today. Some said it as follows: By 1879, as a result of his campaigns and those of his successors, Egypt controlled the whole of today’s Sudan, South Sudan along with portions of Eritrea, northern Uganda, and northeastern Congo. Egyptian conquest and control of the Nile region brought increased trade to the south and southwest. Here is a picture of a Saidi of Upper Egypt. The Saidi are the custodians of the oldest Egyptian cultural heritage. Upper Egypt (Pathros) is the original home of ancient Egyptians. It is even recorded in the Bible in Ezekiel. PeopleGroups.org - Saidi Arabs of Egypt  Photo courtesy of Joshua Project. By Elijah ZarwanCreative Commons Reason # 2 : Ancient Egypt was created by people of the Nile, a very specific and yet diverse group of Africans. People of the Nile are categorized into three groups : 1) Kushite Horners (Beja, Afar, Somali); 2) Nilotes (Alur, Dinka, Luo) et 3) Nilo-Saharans (Fulani, Tebu and Bidiat). Some people add another group, the Nubians who are closer to Horners than Nilotes. How many African-Americans are the descendants of people of the Nile? Not many. If they are, they are the descendants of Nilo-Saharans like the Fulani who migrated as far as West Africa and settled there en masse. The vast majority of African-Americans came from West and West-Central Africa. Both regions are located far from Egypt, a northeastern African country. Yet, again Afrocentrists who see history in black and white, will come back and say, Horners, Nilotes, Nilo-Saharans and Nubians are black people like us African-Americans, regardless. As black people we can take racial pride in ancient Egypt on the basis of racial commonality. ",
            "date": "Answered July 22, 2020",
            "views": "623",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahmud Mahmud",
                    "user_href": "/profile/Mahmud-Mahmud-42"
                },
                {
                    "user_id": "Sir Rah",
                    "user_href": "/profile/Sir-Rah"
                },
                {
                    "user_id": "Gary Garrett",
                    "user_href": "/profile/Gary-Garrett-1"
                },
                {
                    "user_id": "Robert Williams",
                    "user_href": "/profile/Robert-Williams-2412"
                },
                {
                    "user_id": "Mike Carter",
                    "user_href": "/profile/Mike-Carter-261"
                },
                {
                    "user_id": "Rigel Wastor",
                    "user_href": "/profile/Rigel-Wastor"
                },
                {
                    "user_id": "Albert Mahlaba",
                    "user_href": "/profile/Albert-Mahlaba-1"
                },
                {
                    "user_id": "Melanite Zaryus",
                    "user_href": "/profile/Melanite-Zaryus"
                },
                {
                    "user_id": "Kristen King",
                    "user_href": "/profile/Kristen-King-176"
                },
                {
                    "user_id": "Olisah Jideofor",
                    "user_href": "/profile/Olisah-Jideofor"
                }
            ]
        }
    ]
}