{
    "title": "Why would the creators' of HBO and Sky's Chernobyl miniseries take so many creative liberties? Doesn't it undermine the show since it's supposed to show how lies, arrogance, and suppression of criticism contributed to the disaster? - Quora",
    "tags": [
        "Sky Atlantic (TV Channel)",
        "Chernobyl (miniseries)",
        "Sky UK (TV network)",
        "Chernobyl, Ukraine (city)",
        "British Television Series",
        "HBO Television Series",
        "Chernobyl Nuclear Disaster (April 1986)",
        "HBO"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barbara LeMaster",
                "href": "/profile/Barbara-LeMaster"
            },
            "answer_text": "The author is worried that the dramatic license taken to present the material in the context of a dramatic televisions show (telling the audience what radiation is, the danger it presents, and the magnitude of what is happening) will demonize the technology of Nuclear power (which may be humanities best long term solution to global warming). This is an understandable position to take. But it is done (in my opinion) poorly. Nit picking a historical drama is not interesting or valid criticism. Especially when you are criticizing hyperbolic language being used by characters in a terrifying situation. (His complaining about radiation being termed a \"bullet\" being the part that really irked me.) I do however like the idea that this show will lead to a barrage of documentaries about Nuclear technology and people will hopefully have their fears dispelled (remember that HBO viewers are on average more highly educated, wealthier, and more likely to make informed votes). Tho, I can register the article writer's concern that a show that demonizes the technology might be a problem. Again, reasonable objection to the show, poor expression of that objection. In fact, this article is offensively incorrect, and so very clearly slanted to be pro-nuclear it's absurd. I'm halfway tempted to write Forbes and demand they relist it as an advertisement it's so bad. ",
            "date": "Answered June 7, 2019",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Tobin",
                    "user_href": "/profile/Tom-Tobin-8"
                }
            ]
        }
    ]
}