{
    "title": "Why did Soviet send missiles to Cuba in 1962? - Quora",
    "tags": [
        "Cuban Missile Crisis",
        "The Cold War",
        "World War I",
        "Soviet Union",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luiz Matos",
                "href": "/profile/Luiz-Matos-1"
            },
            "answer_text": "Basically to protect the island of Cuba. The soviets had the intention to turn Cuba into a fortress bigger than East Germany by bring in major groups of forces. That was called operation Anadyr. That was ignited by the Bay of pigs incident in 1961 and the failed attempet to assassinate Fidel Castro by CIA. It became clearly for the comunists that US would try to overthrown the Cuba regime by force so they decide for Anadyr. Not to mention the reckless atitude of US government to conduct a massive military exercise in 1962 in Vieques island. An island very close to Cuba (even te codiname of this exercise was ORTSAC - Castro in reverse). That was perceived as a confirmation of the incoming invasion. And this time with real military forces not a bunch of mercenaries and anti-castro rebels as before. In fact the US had NO intention to invade Cuba. That was one in a long line of combined small mistakes by both sides that almost lead to a full war….. Robert Mc Namara called it ‘the fog of war” in reference to how things can get blurred and lead to wrong and dangerous conclusions. By the time US discovery the missiles sites The USSR already had 40.000 troops in Cuba (not 10.000 as the Pentagon believed by theat time) and most of them were front line combat units (not support personnel and technicians as the americans also belived). The soviets also had several tatical nuclear devices ready to use and Il-28 bombers already in Cuba. In fact the air defenses were so strong that they were able to shot down an U2. They also had Lunar rockets in place and capable to carry tatical nuclear warheads. All of them pretty much capable to reach Florida. Washington had absolute no idea of this massive concentration of force until 1992 conference in Havana were secret russian documents of Andyr operation were made public. Robert McNamara and others high hank officials of that period (including Castro himself) were present at the conference and he was awe and said they never looked for those weapons because they had no ideia of them. Any invasion would be a disaster once the Pentagon was considering a much smaller force in Cuba and had no idea about the tatical nukes (they only knew about the medium range missiles sites in construction). …. there is a book by Svetlana Savranskaya a research fellow at The George Washington University’s National Security Archive with the russian side of this episode. It is very interesting and You may like it. By the way..a consequence of this crisis was both sides realized the real size of the nuclear threat and stopped provocative actions. Kennedy made an effort to open a direct line of comunications with the soviets and the URSS decided not to give nuclear weapons to East Germany wich was part of their plan before this crisis. ",
            "date": "Updated March 7, 2018",
            "views": "532",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kaustav Dey",
                    "user_href": "/profile/Kaustav-Dey-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suraj Budhani",
                "href": "/profile/सूरज-बुधानी-Suraj-Budhani"
            },
            "answer_text": "J.F. Kennedy did not think twice before deploying Jupiter MRBM’s in Italy and Turkey[1] . The U.S. already had an upper hand in missile technology and the forward deployment of the Jupiter MRBM’s was a symbol of the American willingness to use nuclear weapons against the Soviet Union. Soviet strategists soon realized that the U.S.S.R was waaaaay on the wrong end of the notorious missile gap. To stabilize strategic riposte to the US missiles in Italy and Turkey, Nikita Khrushchev with his officials proposed Fidel Castro to let Soviet deploy the medium and intermediate range missiles in Cuba. Cuban dictator Fidel Castro happily agreed as he was appalled by the U.S. intervention in Cuba and their “regime change” style invasion.[2]  Soviet strategists took advantage of 5 week long \"Photo Gap\"[3] and started the deployment of all offensive missiles and Ilyushin Il-28 light bombers in Cuba. Soviet deploying missiles in Cuba was completely justified as they had no other option to alter the strategic nuclear balance. In the tense 13‑day crisis, the Americans and Soviets went eyeball-to-eyeball and finally came up with a mediated settlement. The Cuban Missile Crisis proved nothing but a stalemate between the U.S. and the U.S.S.R. Nikita Khrushchev consciously explained his reasoning when he was asked the same question. He said, \"Americans would learn just what it feels like to have enemy missiles pointing at you; we’d be doing nothing more than giving them a little of their own medicine[4] .” He was right. Footnotes[1] What Was at Stake in 1962?[2] Bay of Pigs Invasion - Wikipedia[3] The “Photo Gap” that Delayed Discovery of Missiles[4] The Cold War at America’s Back Door",
            "date": "Updated July 20, 2017",
            "views": "46",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hạnh Thần Chết",
                    "user_href": "/profile/Hạnh-Thần-Chết"
                },
                {
                    "user_id": "Luiz Giaconi",
                    "user_href": "/profile/Luiz-Giaconi"
                },
                {
                    "user_id": "Sumit Budhani",
                    "user_href": "/profile/Sumit-Budhani"
                },
                {
                    "user_id": "Knut Ritter",
                    "user_href": "/profile/Knut-Ritter"
                },
                {
                    "user_id": "Nilesh Pawar",
                    "user_href": "/profile/Nilesh-Pawar-31"
                },
                {
                    "user_id": "Vishal Arora",
                    "user_href": "/profile/Vishal-Arora-136"
                },
                {
                    "user_id": "Freeman Wang",
                    "user_href": "/profile/Freeman-Wang-8"
                },
                {
                    "user_id": "Hajan Farhan",
                    "user_href": "/profile/Hajan-Farhan"
                },
                {
                    "user_id": "Joseph Punnoose",
                    "user_href": "/profile/Joseph-Punnoose"
                },
                {
                    "user_id": "Jaydeep Desai",
                    "user_href": "/profile/Jaydeep-Desai-10"
                }
            ]
        }
    ]
}