{
    "title": "Why is the Ottoman Empire demonized much more than any other empire in history? - Quora",
    "tags": [
        "Tibetan Empire",
        "History of the Ottoman Empire",
        "Songhai Empire",
        "Ottoman History",
        "History of Turkey",
        "Ottoman Empire",
        "Empires",
        "Turkey (country)",
        "World History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Towner",
                "href": "/profile/Chris-Towner-6"
            },
            "answer_text": "You could explain that by Europe’s awareness of the Ottoman Empire’s confrontation for around 1,000 years, together with an understandable but mistaken association with Moorish people, not in the Ottoman Empire but abutting it to the west. The Islamic occupation of southern Spain and the formation of El-Andalus in the 8th century was by Moors. They advanced through Spain and into France until they were beaten back in 732 at the Battle of Tours by Charles Martel. The enemy there was the Moors, not the Ottoman Empire, but i doubt the distinction was made. The period of the Crusades was a time of bitter enmity between Europeans and the Ottoman Empire. The Ottoman invasion of southern Europe in the mid-14th century saw the later occupation of southern states of Europe, and wars with Russia. In 1626, St Keverne, the village where I live, was raided repeatedly by Moors to take slaves, and also in other places in Cornwall and Devon. Wars or rebellions went on until late 19th century. It is not surprising that the Ottoman Empire was seen as the great enemy of Europe. It was a long and often violent struggle, with a deep resentment associated with it. My highly abbreviated summary might suggest further study, but I can see other empires being even more demonised, one maybe in particular, even though it just seeks to extend its power without taking responsibility for the welfare of the peoples it seeks to have control over. It must be added that the early Ottoman Empire brought huge benefits to the world in general — its development of the science and other intellectual achievements of the Ancient Greeks, neglected by the rather dull and unimaginative Romans, was crucial to the advance of Europe. ",
            "date": "Answered September 5, 2019",
            "views": "660",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Brown",
                    "user_href": "/profile/Michael-Brown-2031"
                },
                {
                    "user_id": "Bryden Walsh",
                    "user_href": "/profile/Bryden-Walsh"
                },
                {
                    "user_id": "Uğur Güleryüz",
                    "user_href": "/profile/Uğur-Güleryüz-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Karenian",
                "href": "/profile/Anna-Karenian"
            },
            "answer_text": "Ottoman Empire is not demonized, it was really an extremely racist and blatantly oppressive regime. The Ottoman regime turned the area, which was one of the most developed regions of world during two and a half millennia preceding the Turkish invasion, into one of the most backward regions of the world afterwards. With except for the Kurds living in the eastern part of modern Turkey (i.e. in Western Armenia), no other area or nation underwent degradation as a result of the collapse of Ottoman empire. Therefore none of the nations broke free off the Ottoman empire (Arabs, Greeks, and Southern Slavics) felt sorrow for that collapse - as in contrast to what had happened in the nations who were part of the Soviet, British, French or Austro-Hungarian empires having a lot of nostalgying fans long after the break-off. The only reason why some Kurds felt nostalgie for the Ottoman times and tried to revive the Ottoman idea is given by the evident degradation of Western Armenia occurred after the collapse of Ottoman regime. However, this degradation was given by the extermination of indigenous Armenian people and overall decay of region as a result of the Armenian Genocide there, not because of the collapse of Ottoman regime. ",
            "date": "Updated August 11, 2020",
            "views": "797",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krystian Chaim",
                    "user_href": "/profile/Krystian-Chaim"
                },
                {
                    "user_id": "Izidore El-Naghoun",
                    "user_href": "/profile/Izidore-El-Naghoun"
                },
                {
                    "user_id": "Maitena Tigranyan",
                    "user_href": "/profile/Maitena-Tigranyan"
                },
                {
                    "user_id": "Andras Boros-Kazai",
                    "user_href": "/profile/Andras-Boros-Kazai"
                },
                {
                    "user_id": "Giorgos Dragatsis",
                    "user_href": "/profile/Giorgos-Dragatsis"
                },
                {
                    "user_id": "Julien Philippe",
                    "user_href": "/profile/Julien-Philippe-3"
                },
                {
                    "user_id": "Gregory Davidian",
                    "user_href": "/profile/Gregory-Davidian-1"
                },
                {
                    "user_id": "Peter Zisoulis",
                    "user_href": "/profile/Peter-Zisoulis"
                },
                {
                    "user_id": "Levon Gevorgyan",
                    "user_href": "/profile/Levon-Gevorgyan-2"
                },
                {
                    "user_id": "Rony Biswas",
                    "user_href": "/profile/Rony-Biswas-25"
                }
            ]
        }
    ]
}