{
    "title": "Why were 300,000 Christians killed in Japan? - Quora",
    "tags": [
        "History of Japan",
        "Culture of Japan",
        "Christians",
        "Japan",
        "Warfare",
        "Christianity",
        "Death and Dying",
        "Military History and Wars ",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gualdim De Payns",
                "href": "/profile/Gualdim-De-Payns"
            },
            "answer_text": "Christianity in Japan is a religious minority, which constitutes about 1 million to 3 million persons. Nearly all known traditional denominations of Christianity, including Roman Catholicism, Protestantism, Orthodox Christianity are represented in the country today.  Christianity was introduced to Japan by Portuguese Roman Catholic Jesuit missionaries who arrived in Kagoshima in 1549, led by Francis Xavier. By 1579, six regional war lords and approximately 100,000 of their subjects had converted to Christianity. Towards the end of the sixteenth century, Franciscan missionaries arrived in Kyoto. The number of Christians had reached about 300,000 when the Tokugawa shogunate influenced by the Dutch prohibited Christianity and expelled all foreigners in 1638. Many renounced their faith and others went underground. After Japan opened its doors to the West in 1853, many Christian clergymen were sent to Japan from Catholic, Protestant, and Orthodox churches. When religious freedom was restored after the Meiji Restoration in 1871, approximately 30,000 underground Christians came forward. Christian missionaries in Japan did not win large numbers of converts, but did influence education and the trade union movement as Japan modernized its economy.  Though Christians make up only a small percentage of the population of Japan, Christian thought has been a powerful influence on the development of modern Japan. From the late 1800s, many Japanese men and women studied in Christian schools and universities in Japan, and went abroad to study in Europe and the United States. Many Christian-based concepts, such as the unique value of the individual, salvation, and human rights became important themes in Japanese philosophy and literature of the twentieth century. In 1638-1639, Shogun Tokugawa Iemitsu implemented Japan's policies of exclusion, intended to protect it from possible European occupation, and ruthlessly ordered the persecution of all Japanese missionaries, priests, and hundreds of thousands of Christians. As a result, Portuguese trade with Japan ended abruptly, severely affecting Macao, which rapidly declined economically. The Dutch contributed to the end of the Portuguese trade, making the Japanese authorities increasingly suspicious of the commercial activity of the Portuguese and especially the religious activity of Catholic missionaries, accused of being the vanguard of a powerful invading European and Catholic force. With the Portuguese expelled, a small number of Dutch, who gained the trust of the Japanese authorities, were able to attend the port of Dejima, albeit with many restrictions, becoming the only Europeans who were allowed to trade with Japan. In order to conquer the trade monopoly, the Dutch helped that 300.000 Japanese Catholics were killed, burnt and tortured provoking a much superior atrocity than all of the Inquisition deaths together!  History The history of Christianity in Japan is commonly believed to have begun with the arrival of the Jesuit missionary Francis Xavier in 1549, but some scholars contend that there is evidence that Nestorian missionaries reach Japan by way of India, China and Korea in 199 C.E., and that Nestorian churches existed there in 400 C.E. Roman Catholicism Francis Xavier Roman Catholic missionary activities in Japan began in 1549, carried out by Portuguese-sponsored Jesuits and later by Spanish-sponsored mendicant orders, such as the Franciscans and Dominicans. On August 15, 1549, the Jesuits [Francis Xavier|Francisco Xavier], Father Cosme de Torres, and Brother John Fernandez arrived in Kagoshima, along with a recent Japanese convert, Anjiro (Christian name, Pablo de Santa Fe). The warlords of Kyushu were interested in the weapons brought by Portuguese traders and open to the teachings of the Jesuits. Xavier left in 1551, but other Jesuits continued the mission. Oda Nobunaga became their patron and supported the establishment of the first Christian church in Kyoto in 1576, although he never converted to Christianity. By 1579, six regional war lords and approximately 100,000 of their subjects had converted to Christianity. When Nobunaga died in 1582, the Catholics reported 200,000 faithful and 250 churches in Japan. The three Christian princes of Bunga, Arima, and Omura sent an embassy to Europe, which arrived in Rome on March 23, 1585. The ambassadors witnessed the coronation of Sixtus V and were created knights and patricians.  In 1597, as Christian influence was spreading in western Japan, Toyotomi Hideyoshi issued an edict banning Christianity and crucified 26 Franciscans in Nagasaki. After Hideyoshi’s death in 1600, Tokugasa Ieyasu became the ruler of Japan and allowed the missionaries to remain. In 1614, his government began to prohibit Christianity, concerned that Spain and Portugal were gaining too much influence within Japan. The Dutch, who were Calvinist, had set up a trading outpost in Japan and encouraged the suspicions of the Tokugawa shogunate against the Catholics. From 1613–1620, Date Masamune, the daimyo of Sendai, sent a diplomatic mission headed by Tsunenaga Hasekura to the Vatican in Rome. The mission was successful, but by the time Tsunenaga returned, the Tokugawa shogunate had begun to persecute Christians. In 1626, missionaries were ordered to leave the country, and Christians were ordered to renounce their faith or suffer terrible punishment. In 1637–1638, approximately 37,000 peasants and dispossessed samurai rose up in the Shimabara Rebellion (島原の乱, Shimabara no ran). Many of them were Christians and the rebellion took on a religious character. Eventually the rebellion was crushed, with heavy casualties to government troops, and all the rebels were decapitated. Following the rebellion, Christianity was completely suppressed in Japan, and the Tokugawa shogunate enacted a policy of “sakoku,” complete isolation of Japan from foreign influences. Christians were heavily persecuted, and an estimated 3,000 were killed. Many of the 300,000 Christians in Japan renounced their faith, while others continued to practice their religion underground. In 1640, four Portuguese ambassadors who had gone from Macao to Nagasaki were called upon to renounce their faith, and when they refused they were executed without further trial. Thirteen of their followers were sent back to Macao with this message: \"While the sun warms the earth let no Christian be so bold as to enter into Japan. Let this be known to all men. Though it were the King of Spain in person or the God of the Christians or Shaka himself [Buddha], whosoever will disobey this prohibition will pay for it with his head.\"  Several groups of Jesuits and Dominicans who attempted to enter Japan between 1640 and 1647 were tortured and put to death. Drawn from the oral histories of Japanese Catholic communities, Shusaku Endo's acclaimed historical novel \"Silence\" provides detailed fictionalized accounts of the persecution of Christian communities and the suppression of the Church. After Japan was reopened to foreign interaction in 1853, many Christian clergymen were sent from Catholic, Protestant and Orthodox Churches, though evangelism was still banned. Under a treaty signed between France and Japan, in October, 1858, Catholic missionaries were allowed to reside in open ports and conduct church services for foreigners. In 1865, a group of 15 underground Japanese Catholics (Kirishitan) made themselves known to the French Catholic missionaries, informing them that there were approximately 30,000 (some reports say 50,000) of them in Japan. In 1867, 40,000 Japanese Christians near Nagasaki were forced into exile. They were allowed to return after the Meiji restoration. In 1871, freedom of religion was introduced, giving all Christian communities the legal right to exist and spread their faith. On August 11, 1884, an official decree proclaimed that there was no longer a state religion in Japan. In 1885, the emperor established friendly relations with Pope Leo XIII and with Spain. Catholic orders established numerous orphanages and hospitals in Japan, and thousands of Japanese men and women received an education at Catholic schools, universities, and commercial schools. In 1896, Trappists came to Hokkaido and formed a Christian agricultural colony and developed industries such as milk production and cheese making. In 1905, the Island of Shikoku was given to the Spanish Dominicans.  In February 1981, Pope John Paul II paid a visit to Japan, during which he met with Japanese people, the clergy and Catholic lay people, held Holy Mass in the Korakuen Stadium (Tokyo), visited the Peace Memorial Park in Hiroshima, the Hill of martyrs in Nagasaki, town of the Immaculate founded by St. Maximilian Kolbe in Nagasaki and other places. ",
            "date": "Answered January 6, 2020",
            "views": "613",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Julian Fernandes",
                    "user_href": "/profile/Julian-Fernandes-14"
                },
                {
                    "user_id": "David Gray",
                    "user_href": "/profile/David-Gray-78"
                },
                {
                    "user_id": "Adolfo Macedo",
                    "user_href": "/profile/Adolfo-Macedo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adolfo Macedo",
                "href": "/profile/Adolfo-Macedo-1"
            },
            "answer_text": "The Anti Catholic Propaganda used as a massive weapon by the Dutch and the British in Japan was a success, they were so good that they were capable of influencing the Japonese Samurai and the Japonese authorities to use the worst possible cruelties and inhuman atrocities against Japonese Catholics and Portuguese, Spanish and Italian Jesuits! As until nowadays, we just hear how proud the Dutch are about their golden age in Asia and the Proud Brexit Empire, we just can conclude that the British and the Dutch are very proud of the 300.000 Catholics murdered in Japan! The confirmation of their happyness in killing Catholics will be confirmed if someone asked to censor this answer, instead of apologizing! However, even centuries of silence, cheat and deceive, will never silence the anger for justice, in fact it just grows stronger with TIME!     ",
            "date": "Answered January 11, 2020",
            "views": "139",
            "upvotes": "0"
        }
    ]
}