{
    "title": "Why do so many Bengalis worship Kali? - Quora",
    "tags": [
        "Worship and Worshipping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhijeet K Debsharma (অভিজিৎ দেবশর্মা)",
                "href": "/profile/Abhijeet-K-Debsharma-অভিজিৎ-দেবশর্মা"
            },
            "answer_text": "Because Maa Kali has an old connection with the region of Bengal.Some people believe that the name of Kolkata is derived from Kalikapuram which means the city of goddess Kali in Sanskrit.Out of 51 Shakti peeths 13 is situated in Bengal.Shaktism is also a sect of Hinduism like Vaishnavism and Shaivism.Main goddess of Shaktism is Maa Durga.And Maa Kali is one of forms of Maa Durga.So you can say mostly Hindu Bengalis are Shaktas which means the devotees of Maa Durga and her other forms.In Shakta sect, consuming non-veg foods are not prohibited or sin. That's why 90% Bengalis are non-vegetarians. Even Bengali Brahmins (Priests) are also do eat meats.But it means not that all Bengalis are belong to Shakta sect. There are some Shaivas and Vaishnavas also.Mostly Vaishnav Bengalis are vegetarian while Shaivas are not very different than Shaktas.On the other hand, Bengali means not just Hindu Bengali. Bengali is an ethnic group which is exist in other religions also. A Bengali can be a Muslim, Christian, Buddhist and Jewish also.Muslim Bengalis do worship Allah. Christian Bengalis do worship Jesus. Buddhist Bengalis do worship Buddha. Jewish Bengalis do worship David, Moses etc.While some consider themselves an Atheist and Agnostic who don't believe in any God or do doubt in the presence of God (my uncle/jethu, means father's elder brother is a hardcore atheist and a communist as well).Yes Bengalis worship Maa Kali or Goddess Kali but not all Bengalis do the same. Only Bengali Hindus do worship Maa Kali in daily basis who belong to Shakta sect or Shaktism.  A Bengali Since 1991. -AkD- THANKS. ",
            "date": "Answered November 3, 2018",
            "views": "16",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Debalina Das",
                    "user_href": "/profile/Debalina-Das-1"
                },
                {
                    "user_id": "Koel Das",
                    "user_href": "/profile/Koel-Das-9"
                },
                {
                    "user_id": "Aniket Roy",
                    "user_href": "/profile/Aniket-Roy-143"
                },
                {
                    "user_id": "Punya Tuli",
                    "user_href": "/profile/Punya-Tuli"
                },
                {
                    "user_id": "Debjeet Mishra",
                    "user_href": "/profile/Debjeet-Mishra-2"
                },
                {
                    "user_id": "Mallikarjuna Reddy",
                    "user_href": "/profile/Mallikarjuna-Reddy-119"
                },
                {
                    "user_id": "Kruti Wankhade",
                    "user_href": "/profile/Kruti-Wankhade-1"
                },
                {
                    "user_id": "Anusure Mallikarjun",
                    "user_href": "/profile/Anusure-Mallikarjun"
                },
                {
                    "user_id": "Omesh Lares",
                    "user_href": "/profile/Omesh-Lares"
                },
                {
                    "user_id": "Vaibhav Saraf",
                    "user_href": "/profile/Vaibhav-Saraf-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Carnicom",
                "href": "/profile/Jim-Carnicom-1"
            },
            "answer_text": "Perhaps Bengalis do this because they are taught thus, and have not been told about the Living God who loves them, and sent His Living Son to prove it. “For God so loved the world that He gave His only begotten Son that whoever believes in Him shall not perish but have everlasting life.” John 3.16 So, if one permits, let me do so now. Will you believe on Him now, if you want? “This is the work of God, that you believe on Him who He has sent.” John 6.29. Do you believe? “As many as received Him, to them He gave the right to become children of God, even to those who believe on His Name.” John 1.12. ",
            "date": "Answered November 4, 2018",
            "views": "645",
            "upvotes": "0"
        }
    ]
}