{
    "title": "Why were so many US presidents assassinated? - Quora",
    "tags": [
        "Assassinations",
        "Presidents of the United States of America",
        "History of the United States of America",
        "History",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Rockefeller",
                "href": "/profile/Keith-Rockefeller"
            },
            "answer_text": "Four is not an especially high number, overall, and three of the four assassinations were from 1865 to 1901, at the close of the Civil War and during the period of rapid industrialization in the US. Security then for presidents was poor by today's standards. There was no reason for Lincoln to not have had more protection for him on the day of his murder. The same is true of Garfield and McKinley. No one should have been able to get to point blank range to shoot a president like John Wilkes Booth, Leon Czolgoz, or the other assassin did. John F. Kennedy could have avoided his own murder, but he wanted to be accessible to the people in Dallas while he drove through. Kennedy's Limousine had an optional top with bullet resistant glass that could have stopped a 6.5mm bullet from penetrating, but president did not want to have it put on the vehicle. Had JFK been in a limo with bullet resistant glass, the shots that were taken at him would have not gotten through to kill him.In the case of Garfield and McKinley, light weight bullet resistant garments had not been perfected. A modern soft armor, such as worn by law enforcement, would have stopped the bullets that killed Garfield and McKinley. They were also hindered by the lack of good medical treatment, such as saved Ronald Reagan in 1981 from an assassin's bullet. We have even better medical care now than Reagan had in 1981. The US has had four presidents assassinated, but is that a high number? Perhaps? They definitely could have been avoided. ",
            "date": "Answered December 6, 2017",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Edwards",
                    "user_href": "/profile/Bill-Edwards-39"
                },
                {
                    "user_id": "Cole Meyers",
                    "user_href": "/profile/Cole-Meyers-4"
                },
                {
                    "user_id": "Janice Grable",
                    "user_href": "/profile/Janice-Grable-1"
                },
                {
                    "user_id": "Dylan Bob",
                    "user_href": "/profile/Dylan-Bob-3"
                },
                {
                    "user_id": "Reno Rosas",
                    "user_href": "/profile/Reno-Rosas"
                },
                {
                    "user_id": "Miftahul Fatih Sihombing",
                    "user_href": "/profile/Miftahul-Fatih-Sihombing"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Lipton",
                "href": "/profile/W-Lawrence-Lipton-1"
            },
            "answer_text": "To kill those you disagree with is a function of nature — assassination is a political act, a military one, or the act of deranged and uncivilized individuals responding to emotionality. Presidents are assassinated for the same reason we saw Bernie-or-Bust after Hillary was nominated, and why we see the attacks on Trump now which involve spinning his words, or inferring they mean one thing when they say another. Some weak-minded People hate to lose and will lash out. Look at the successes and attempts List of United States presidential assassination attempts and plots - Wikipedia Looking at this QUORA revealed Curse of Tippecanoe - Wikipedia a cycle of 20 years [roughly once a generation] which flags attempts. But there are always generational cycles. In “Jonathon's POTUS Cousins\" {Amazon, January 2017} [ Jonathon' POTUS Cousins: The Interrelated Kinship of American Presidents -- an interrelated history of our times: W Lawrence Lipton: 9781542328777: Amazon.com: Books ] I looked at two more ancient cycles which have a much broader application. Abraham Lincoln won a war that was actually begun when the Constitution was being written; John F. Kennedy was the product of the Cold War, the dishonest which broke the wartime promise to Vietnam of freedom to chose their own government free of Western influence. The successful assassination of traditional leadership occurs at the culmination of a period which then begins a new era. And the QUORA should read “Why were there so many attempts to assassinate US presidents? Unless it is time for real change, the assassination attempt will fail (as happened with Hitler, and so many figures in history). ",
            "date": "Answered February 25, 2017",
            "views": "22",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marc Alessandro IV",
                    "user_href": "/profile/Marc-Alessandro-IV"
                },
                {
                    "user_id": "Sam Smalls Heisenberg",
                    "user_href": "/profile/Sam-Smalls-Heisenberg"
                }
            ]
        }
    ]
}