{
    "title": "Why did the Portuguese trading empire fall apart by 1500? - Quora",
    "tags": [
        "Fall of Empires",
        "Portuguese Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pedro Feio",
                "href": "/profile/Pedro-Feio"
            },
            "answer_text": "It didn't. The Portuguese empire grew mostly until the moment where the Spanish king became the Portuguese king in 1580, and grew again in after the Portuguese restoration in 1640. At the time (1580-1640) Portugal started facing competition and attacks by the Spanish enemies as part of the eighty years war (Dutch and English) Eighty Years' War - Wikipedia This period of time lead to the effective reduction of the hegemony that the Portuguese had in Asia (and India in particular) . Even as a consequence of the Iberian Union, when Portugal was trying to ensure its permanent independence, it ended up by giving territories to do so, such as Bombay (https://en.m.wikipedia.org/wiki/Portuguese Empire) which was given to the English as part of a dowry in 1661. The Portuguese Empire then refocused on Africa and Brazil, while still maintaining several Asian footholds. It was actually successful and kept growing until 1822. However, after several crisis, the Lisbon Earthquake (in 1755), the economic crisis associated, the Napoleonic invasions in the early 19th and the Brazilian independence in 1822 it was never the same. After the Brazilian independence, and subsequent civil wars (the Portuguese Liberal wars) it changed focus almost exclusively in Africa and a few Asian colonies, but it never regained its previous might. ",
            "date": "Answered January 30, 2018",
            "views": "15",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sergio Lopes",
                    "user_href": "/profile/Sergio-Lopes-15"
                },
                {
                    "user_id": "João Gama",
                    "user_href": "/profile/João-Gama-6"
                },
                {
                    "user_id": "Terry Holland",
                    "user_href": "/profile/Terry-Holland-1"
                },
                {
                    "user_id": "Arthur Rebello",
                    "user_href": "/profile/Arthur-Rebello"
                },
                {
                    "user_id": "Benedikt Þorri Sigurjónsson",
                    "user_href": "/profile/Benedikt-Þorri-Sigurjónsson"
                },
                {
                    "user_id": "Edward Ball",
                    "user_href": "/profile/Edward-Ball-15"
                },
                {
                    "user_id": "Braden J. Pritchard",
                    "user_href": "/profile/Braden-J-Pritchard"
                },
                {
                    "user_id": "Sara Silva",
                    "user_href": "/profile/Sara-Silva-24"
                },
                {
                    "user_id": "Stuart Campbell",
                    "user_href": "/profile/Stuart-Campbell-46"
                },
                {
                    "user_id": "Fernando Baptista",
                    "user_href": "/profile/Fernando-Baptista-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodrigo Coelho",
                "href": "/profile/Rodrigo-Coelho-5"
            },
            "answer_text": "I am not at all an expert on history, but I think I can make a concise awnser to you.In 1500, the Portuguese Empire was “starting”. Merely two years before that year, Vasco da Gama had reached India. In 1500, Portugal “discovered” Brazil. So I wouldn’t say it was falling down. In fact, there is still a long path for decline. Portugal after 1500 started colonization of Brazil, Labrador( Newfoundland and Labrador, which Portugal reached even before they had reached Brazil) . Made war against the Ottoman Empire, Indian States, China, founded cities and factories, even in Japan. Reached Papua (New Guinea). And controled much of the Eastern trade. The problem was that Portugal had a backwards nobility, interest more in personal fame and fortune. Coupled with the growing interests of the Northern countries, which had a much larger population (Portugal was/is really small) and were able to be much more competitive. Portugal in fact sold to the Hanseatic League, which in turn sold the Portuguese products to the rest of Europe. Portugal’s downfall was obvious: Low Productivity, low population, larger and more powerful neighbours.With that, I would say that the real and slow decline started in the 1550s. ",
            "date": "Answered January 30, 2018",
            "views": "15",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                },
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                },
                {
                    "user_id": "Terry Holland",
                    "user_href": "/profile/Terry-Holland-1"
                },
                {
                    "user_id": "Siddharth Misra",
                    "user_href": "/profile/Siddharth-Misra-11"
                },
                {
                    "user_id": "Muhammad Adel Ayoub",
                    "user_href": "/profile/Muhammad-Adel-Ayoub"
                },
                {
                    "user_id": "Nuno Pereira",
                    "user_href": "/profile/Nuno-Pereira-29"
                },
                {
                    "user_id": "Miles Hunt",
                    "user_href": "/profile/Miles-Hunt-2"
                },
                {
                    "user_id": "Nuno Esteves",
                    "user_href": "/profile/Nuno-Esteves-1"
                },
                {
                    "user_id": "Nuno Carvalho",
                    "user_href": "/profile/Nuno-Carvalho-1"
                },
                {
                    "user_id": "Mike Brown",
                    "user_href": "/profile/Mike-Brown-438"
                }
            ]
        }
    ]
}