{
    "title": "Why did it take so long for black and white TVs to die out? - Quora",
    "tags": [
        "History of Television",
        "Consumer Electronics",
        "Television Sets",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Fisher",
                "href": "/profile/Tony-Fisher-94"
            },
            "answer_text": "Two possible reasons: Cost. When colour TVs originally arrived, they were massively expensive, and very prone to electronic break-downs (due to a much greater circuit complexity). So colour TVs were very much of a luxury item.Fashion. Not everybody will immediately cast off a thing just because it is no longer “the latest and greatest” (in spite of all the advertising hype). Where the TV was “just another thing around the house”, something not the latest fashion could easily be tolerated.Later developments in receiver technology reduced the cost differential and so the demand for B&W sets declined, and it became less profitable to manufacture two parallel products. As a result, the B&W sets died out. The same sort of thing happened with computer displays, and for much the same reasons. ",
            "date": "Answered March 28, 2020",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janis Baumanis",
                    "user_href": "/profile/Janis-Baumanis"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Weihe",
                "href": "/profile/David-Weihe"
            },
            "answer_text": "Q: Why did it take so long for black and white TVs to die out? Many of them were built more robustly than the color TVs of their time, so they lasted longer. Also, since they were cheaper than color sets, the people who bought them tended to be poorer than those who had only color sets, and there is a tendency not to demand that the poor pay too much to repurchase their assets (balanced by the tendency to say screw the poor if they cannot afford to keep up with the latest and greatest). Also, despite what the HD people said, people view TV for the quality of the stories presented, not the higher resolutions or color fidelity, and cheap B&W sets could display the story of, say, Oklahoma or My Fair Lady, well enough, not to mention sporting events. ",
            "date": "Answered March 28, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Francis Jacquerye",
                    "user_href": "/profile/Francis-Jacquerye"
                }
            ]
        }
    ]
}