{
    "title": "Why did the US enter World War Two? - Quora",
    "tags": [
        "History of Politics",
        "Military History of the United States of America",
        "World War II",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "K. Yuen",
                "href": "/profile/K-Yuen"
            },
            "answer_text": "Formally the US entered the war after Pearl Harbor which happened in December 1941. Informally, the US had been selling tanks and aircraft to the Allies since before the fall of France. Most of these supplies went to Britain in North Africa, but some made their way to Australia and other commonwealth nations. The main purpose was to gain useful combat feedback on the US designs and share it both with the Allies and domestic manufacturers. By the fall of France, the US had started supplying the British with all sorts of American military inventions (that the Axis didn't have) such as gyroscopic bombsights and VT fuzes since the fall of France. Roosevelt and his cabinet feared that the Fall of France would mean that the British Isles would also soon fall and so set at work to bring the US to war against Germany and prop up Britain. By the first few months of 1941, the US had started actively attacking German submarines in the Atlantic. By early 1941, the US had started lend-lease programs to supply the countries such as Britain, Russia, and China with tanks, trucks, airplanes, and even rationed material like rubber. By mid 1941, the US had (finally) issued an oil embargo against Japan in response to continued aggression in China as well as seizure of French Indochina from the Vichy France government. The German commands had endured the undeclared war from the US and the assault on their submarines with the intention of going as far as possible to avoid dragging the US into the war. The Japanese, strangled by the oil embargo, decided they could defeat the US navy in an decisive battle like they had against Imperial Russia in the Russo-Japanese War of 1904 and attacked Pearl Harbor.  The commanders at Pearl Harbor had been rather concerned about the probability of a Japanese revolt in the islands (they were a major ethnic there) and so had the planes and guns arranged to be difficult to operate in a hurry. While they were aware the Japanese would attack a US position that day, everyone in command thought it would be in the US-occupied Philippines. The Japanese attacked on the rest day for the Battleship crews - they were out 6 days out of 7 on quite grueling fleet exercises. Most of the battleships sunk not because of the \"overwhelming superiority of air power\" but simply because they were unable to man the AA guns and the watertight hatches below water had been left open - due to their rest day. As such, any breach underwater flooded the entire ship and made them sink under very little fire. The commanders were shocked because an attack on Pearl Harbor seemed to make little sense. The Japanese had no way of actually landing troops onto Pearl Harbor and holding it - the Japanese had completely neglected logistics (they were later forced to load their destroyers and cruisers with oil drums to transport supplies and lost most of these ships to submarines). Attacking the Philippines - which would not be as tough on the Japanese logistics and secure a much stronger defensive strategic position - made much more sense. Unfortunately, the Japanese military of WW2 was as prime an example as you could ever find of a organization that was completely off their rockers. When the US declared war on Japan, Germany decided to declare war on the US as well. Germany was under no obligation to do so - the Tripartite Pact was entirely defensive in nature - and so made Roosevelt's job significantly easier. The US government had planned an Europe first policy in the first place. The fateful date that the US declare war on Germany & Japan was the day the Axis powers lost. The US intelligence community was sometimes wrong on the tactical and operational level, but their diagnosis of the incoming war in strategic terms had never changed and proved true - the shear disparity between the US economic power and Germany + Japan would never allow them to win. The US could win simply by virtue of being able to absorb more damage and produce many times more the Axis powers combined. ",
            "date": "Answered April 16, 2016",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sullivan Ouellette",
                    "user_href": "/profile/Sullivan-Ouellette"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Denton",
                "href": "/profile/Terry-Denton-2"
            },
            "answer_text": "The US didn't just join WWII. First Japan attacked Pearl Harbor. Second just after the Japanese attack Hitler declared war on the US. It was more that the US was invited to join the war rather than it deciding to get involved. Prior to that attack the US had stayed out of the war other than sending arms to the British. There is little doubt though that at some point the US was going to have to get involved simply to protect its interests around the world. Many claim we were involved to defeat fascism and to end the Nazi atrocities. That isn't likely because if saving Jews had been a priority the US would have opened it doors to refugees in the 30s rather than turning them away by the ship load. Wars are rarely fought unless a nation thinks it's in their national interest. Playing the role of the humanitarian, is for public consumption, because no nation risks it's sovereignty and it's Treasury just because they are nice guys. Hitler began his territorial expansion claiming to be rescuing German speaking people that were being exploited after WWI. ",
            "date": "Answered March 12, 2018",
            "views": "458",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anne Hunter",
                    "user_href": "/profile/Anne-Hunter-23"
                }
            ]
        }
    ]
}