{
    "title": "Why did the stock market crash in 1929? - Quora",
    "tags": [
        "History of Finance",
        "History of the United States of America",
        "Stock Markets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Ohara",
                "href": "/profile/Mike-Ohara-13"
            },
            "answer_text": "There probably isn’t any single explanation for the crash but there are at least four contributing factors. First, there was no meaningful regulation of the stock market. Literally anything was possible. Things like insider trading and market manipulation were legal and occurred with frequency. Second, it was common for wealthy people to form syndicates for the express purpose of manipulating stock prices driving prices up and down to realize what we now consider illegal profits. Third, there was no distinction between commercial banking (banks) and investment banking (brokerages). You could open a brokerage account and borrow money from the bank to pay for your purchases. Fourth, credit for major purchases is a relatively new innovation. Previously, your grandfather or great grandfather didn’t get a mortgage to buy a house, they saved until they could pay cash. With the introduction of credit at the turn of the century not only could people obtain a mortgage for a house, they could buy stocks on margin. It was not unusual for people to buy stock on 90% margin. That works okay as long as the market is going up. However, when the market goes down the lender gets nervous and calls the loan. If you can’t pay your margin balance the lender will sell your securities to protect itself. It won’t be picky about the price. Naturally, if buyers think the price is going down they won’t buy and sellers keep dropping the price to get a buyer. This leads to a downward spiral in the market. A series of laws and regulations were enacted in the 1930s which addressed these issues. Glass Steagel (which prohibited the combination of commercial and investment banking) was repealed during the Clinton administration. That was (in my opinion) a mistake that we will pay for. A good book on the subject of the ’29 Crash is The Day the Bubble Burst. The book is probably thirty years old but still in print (check Amazon). ",
            "date": "Answered January 15, 2017",
            "views": "515",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Al-Tyrego"
                },
                {
                    "user_id": "Kaylee Niss",
                    "user_href": "/profile/Kaylee-Niss"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Sutton",
                "href": "/profile/Paul-Sutton-43"
            },
            "answer_text": "The answer to that question would take a book, or more likely many of them. Anyone who says they know “the reason” the market crashed is only grasping on one single aspect of the overall economy and market situation that had been building up for over a decade, and fixating on a single event, mistaking it for “the cause.” There was no single cause. WWI resulted in farm overproduction across the world driving commodity and farm prices to punishingly low levels. “Family farmers” in the US sold to factory farms and large landowners and flocked to the cities with few skills, no money, and they found jobs in the new factories making cars. Congress was intent on passing the Smoot-Hawley Tariff Act in an effort to prevent “cheap foreign-made goods from flooding US markets,” and on both Black Friday and Black Monday, articles appeared in the NY Times reporting that Hoover was going to sign the bill when it reached his desk, as it did in 1939, but just the newspaper articles noting that fact may - emphasis on ‘may’ - have been enough to act as the catalyst that tripped the already precarious market - it had peaked in August, 1929 and was already declining by October - into a crash. Then it took nearly three years, until mid-summer 1932, before the market bottomed, down 90% or so. Hoover signed Smoot-Hawley, which crushed global trade, and drove Germany into the arms of Hitler. Hoover also raised taxes in the teeth of the storm, so to speak, well after the markets had crashed, something most would agree was the exact opposite of ‘the right thing to do.’ And oh, so much more. Please read a few of the many books written about 1929. There is no “single” answer, and there are many opinions, but no one can or has definitively pointed to any single reason for the crash. ",
            "date": "Answered March 10, 2020",
            "views": "115",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Moseley",
                "href": "/profile/Edward-Moseley-2"
            },
            "answer_text": "Beginning with Lyman J. Gage, The U.S. Secretary of the Treasury began to deposit the United States' reserves directly into favored commercial banks to maintain liquidity and attempt to keep interest rates low (please note that this was actually illegal at the time).  Secretary Leslie M. Shaw continued this to an even greater degree leading up until 1907, when the rate of these deposits began to decrease, resulting in a decrease of bank reserves and money in circulation, precipitating the Panic of 1907. By 1910, the ratio of commercial bank reserves to liabilities stood at 14.2%. Further elasticity was desired, so soon came The Creature from Jekyll Island, better known as Federal Reserve Act of 1913. In 1920, The Governor of The New York Federal Reserve, Benjamin Strong, began aggressive asset purchases. When he passed away in 1928, his successor, a more hawkish George L. Harrison slowed asset purchases and precipitated America's Great Depression.  As you can see in the above graph, interest rates for 10 Year U.S. Treasuries were raising until The Federal Reserve entered open market operations to expand the money supply and purchase the bonds. In-so-doing, it generated excessive inflation which resulted in malinvestment and the worst stock market bubble of the 20th century. After the Federal Reserve intervened in the 1920's, they never stopped their policy of inflation. By 1933, it was clear that The Federal Reserve had expanded the money supply beyond to the point that The United States didn't have as much gold as they had in currency which was redeemable in gold. To solve this problem, Franklin Delano Roosevelt signed Gold Reserve Act into law. This law made \"gold hoarding\" illegal, and changed the value of the U.S. Dollar from $20 per ounce of gold to $35 per ounce of gold, and The U.S. Dollar was no longer redeemable by citizens for gold-- it was only redeemable by foreign governments. Overnight the federal government had devalued the currency nearly 50%, and made it illegal for U.S. citizens to own gold. Even today, when people buy gold coins and gold bullion, they are buying \"collectors' items,\" as The Gold Reserve Act of 1933 was never repealed. After World War II, The United States had solidified its spot as a world superpower. During this period, The U.S. Dollar was \"as good as gold.\" The Federal Reserve printed money to maintain steady inflation.  This continued until about 1970, when, again, The United States government realized that all of the gold in Ft. Knox could not satisfy the demands of individuals abroad holding U.S. Dollars. In a move that shocked the world, The U.S. defaulted on its debt, and abandoned the gold standard (note: the U.S. government kept the gold, though). Stagflation followed, and Paul Volcker used Inflation targeting, to fight it. Unfortunately, though, this created significant volatility in the rate of interest on loans.  Today, the interest rate has been nearly flat with a slope of zero for almost a decade. ",
            "date": "Answered April 13, 2016",
            "views": "4",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lukasz Wasik",
                    "user_href": "/profile/Lukasz-Wasik-1"
                },
                {
                    "user_id": "T W",
                    "user_href": "/profile/T-W-699"
                },
                {
                    "user_id": "Nicolas De Bruycker",
                    "user_href": "/profile/Nicolas-De-Bruycker-1"
                },
                {
                    "user_id": "Yu-Hsing Chen",
                    "user_href": "/profile/Yu-Hsing-Chen-1"
                },
                {
                    "user_id": "Fritz Basset",
                    "user_href": "/profile/Fritz-Basset"
                },
                {
                    "user_id": "Ed Robinson",
                    "user_href": "/profile/Ed-Robinson-25"
                },
                {
                    "user_id": "Jason Dortman",
                    "user_href": "/profile/Jason-Dortman"
                },
                {
                    "user_id": "Ali Bashar",
                    "user_href": "/profile/Ali-Bashar-1"
                },
                {
                    "user_id": "Dileep Chowdary",
                    "user_href": "/profile/Dileep-Chowdary-9"
                },
                {
                    "user_id": "Singpu Golmei",
                    "user_href": "/profile/Singpu-Golmei"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Patel",
                "href": "/profile/Nikhil-Patel-100"
            },
            "answer_text": "No market would crash based on one factor. Multiple factors like credit boom, agricultural failure, people borrowed money to invest to get rich etc. I am going to explain one of them in simplest terms.   A single person, let’s call him Mr. A, can’t get rich without fooling/cheating/making other poor. So, Mr. A decided to call his rich friends of New York and together they formed a small ‘firm’ called Syndicate. Syndicate had lots of money, and with that money they decided to corrupt the news reporters of Business Media. Media said that, ‘Hey American people! If you want to invest money and get rich, do it on Tuesday on company X. X have right now value of $90, but on Tuesday it’s going to be over $100.’ But, people won’t believe him. Of course, media lies all the time. So, Mr. A bought 5000 shared of company X in a day. A small rise in stock price of X made a million dollar for Mr. A. Looking at the success of Mr. A, everybody (not only from New York, but California, Washington, Florida etc.) thought of getting rich like Mr. A. Everybody started buying. Money was flowing. Everybody, even smallest business owners, 9 to 5 workers wanted to get rich. But, how? They didn’t have money to invest. So, they opened their banks and gave all their liquidity as an investment. Those, who didn’t even have money in the bank started borrowing from other people call them ‘Loan Guys’. Loan Guys said, ‘You know what? You will just pay 10% of your money, and I will pay 90% of mine. When we make profit, you get a lot, and some of it will be mine. How about that?’ So, people thought, what’s there to lose? Let’s borrow it. Loan Guys borrowed it from the banks. Banks saw this trend and increased rate of 10% to 20%. And that’s when it all started. Bank would ask ‘Loan Guys’ for 20%, and Loan Guys would ask People to pay 20%. People didn’t have money. So, they started selling their shared. On October 29th, 1929, the radio company, which was supposed to be at $100–120, displayed disappointing results and people sold everything they had in shares.  Those who hit the hardest, killed themselves. Shot themselves in head in the hotels of New York City with less than $10 in pockets. Hundreds jumped from the roofs of towers. People sold their cars for $100 just to get food.  People stood in line to get free coffee and food.  Those who took loans on houses, lost their homes. They started living in tents, and called them ‘Hooverville’ as they blamed President Herbert Hoover for the failure.  People would empty their pockets and keep inside out to call it ‘Hooverflag’. People sleeping on roads would cover themselves with newspapers, cardboards to save themselves from New York’s freezing cold. They called it ‘Hoover Blanket.’  The Great Depression, as they called it, not only affected America, but as far as Australia.   What did we learn in the end? Nothing.  Sources: 1. What Happened During the Great Depression of 1929? 2. Great Depression - Wikipedia 3. 1929 Stock Market Crash Video - The Great Depression - HISTORY.com ",
            "date": "Answered January 13, 2017",
            "views": "123",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Premsai Nayak",
                    "user_href": "/profile/Premsai-Nayak-2"
                },
                {
                    "user_id": "Venkatesh Agnihotri",
                    "user_href": "/profile/Venkatesh-Agnihotri"
                },
                {
                    "user_id": "Sourov Roy",
                    "user_href": "/profile/Sourov-Roy-13"
                },
                {
                    "user_id": "Avishek Chourasia",
                    "user_href": "/profile/Avishek-Chourasia-1"
                },
                {
                    "user_id": "Devraj Singh",
                    "user_href": "/profile/Devraj-Singh"
                },
                {
                    "user_id": "Pramod Peter Rachapudi",
                    "user_href": "/profile/Pramod-Peter-Rachapudi"
                },
                {
                    "user_id": "Zenne",
                    "user_href": "/profile/Zenne-2"
                },
                {
                    "user_id": "Anisa Alvarado",
                    "user_href": "/profile/Anisa-Alvarado"
                },
                {
                    "user_id": "Parag Kanodia",
                    "user_href": "/profile/Parag-Kanodia"
                },
                {
                    "user_id": "Shaik Noor Mahammad",
                    "user_href": "/profile/Shaik-Noor-Mahammad-4"
                },
                {
                    "user_id": "Nikhil Mukhija",
                    "user_href": "/profile/Nikhil-Mukhija-2"
                },
                {
                    "user_id": "Neetu Choubey",
                    "user_href": "/profile/Neetu-Choubey"
                },
                {
                    "user_id": "Ronit Panda",
                    "user_href": "/profile/Ronit-Panda"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Poojan Sarvaiya",
                    "user_href": "/profile/Poojan-Sarvaiya"
                },
                {
                    "user_id": "Shresth Mehta",
                    "user_href": "/profile/Shresth-Mehta"
                },
                {
                    "user_id": "Yash Patel",
                    "user_href": "/profile/Yash-Patel-143"
                },
                {
                    "user_id": "Parvathy Nair Muraleekrishnan",
                    "user_href": "/profile/Parvathy-Nair-Muraleekrishnan-1"
                },
                {
                    "user_id": "Ankit Shai",
                    "user_href": "/profile/Ankit-Shai-2"
                },
                {
                    "user_id": "Jaydeep Vekariya",
                    "user_href": "/profile/Jaydeep-Vekariya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Seidman",
                "href": "/profile/Jim-Seidman"
            },
            "answer_text": "Most stock market crashes have similar causes, and the crash of 1929 followed the usual pattern. A bull market had led many people to invest heavily, often with borrowed money. The use of leverage in a market is inherently destabilizing - since people can potentially lose more than their total investment, people investing on margin tend to jump ship at the first sign of trouble. In the days leading up to \"Black Thursday\" (October 24, 1929), there were several days of heavy trading volume and substantial up and down price swings. Decades later, an economist named Jude Wanniski found that these swings correlated with the debates in the Senate of the Smoot–Hawley Tariff Act, which had already passed the House of Representatives. Fears that the Act would pass and cause a trade war caused a substantial drop the morning of Black Thursday. Several leading bankers intervened to buy shares to support the market, a tactic which had successfully stopped the panic of 1907. But the newspaper coverage over the weekend spooked investors, and come Monday panicked highly-leveraged investors were clamoring to get out of the market. October 28 and 29, \"Black Monday\" and \"Black Tuesday\" both saw double-digit drops. Given the level of speculation and leverage, a drop in the market was inevitable. But, with the benefit of hindsight, fear around the impact of the Smoot-Hawley bill was the trigger that drove the timing of the crash. ",
            "date": "Updated February 6, 2020",
            "views": "78",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Springer",
                    "user_href": "/profile/Peter-Springer-1"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Anisa Alvarado",
                    "user_href": "/profile/Anisa-Alvarado"
                },
                {
                    "user_id": "Nived",
                    "user_href": "/profile/Nived-9"
                },
                {
                    "user_id": "Siddharth Pathak",
                    "user_href": "/profile/Siddharth-Pathak-10"
                },
                {
                    "user_id": "Zander Kahuhu",
                    "user_href": "/profile/Zander-Kahuhu"
                },
                {
                    "user_id": "J Alexander",
                    "user_href": "/profile/J-Alexander-5"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Kah",
                    "user_href": "/profile/Kah-26"
                },
                {
                    "user_id": "Bruno Santos",
                    "user_href": "/profile/Bruno-Santos-2"
                },
                {
                    "user_id": "Alex Morgan",
                    "user_href": "/profile/Alex-Morgan-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Simon",
                "href": "/profile/Jim-Simon-1"
            },
            "answer_text": "Market prices for equities reflect hopes and beliefs in addition to measurable financial returns.  Market crashes reflect sudden revisions. Look at the real economy in 1929.  Railroad track miles in the US peaked in 1926, so 1929 was not a great time to be in steelmaking or railroad construction.  Moving into the 1930s, the spread of automobiles meant the elimination of huge numbers of jobs making railcars and other heavy equipment, and the revaluation of huge amounts of real estate that used to be price by proximity to rail facilities.  Cars also resulted in the elimination of some 50,000,000 horses between 1915 and 1945, which added to the dislocations.  Some time around 1929 people must have begun to see this. When large numbers of people are thrown out of work in the same place at the same time, their networks for finding new jobs are destroyed.   No large organization has any incentive to help these people, they are simply left to fend for themselves.   Ted Levitt at the Harvard Business School used to pose the question \"Why did the railroads not survive the depression by reinventing themselves as transportation companies and going into automaking?\"  The powerful Durant family who owned the Union Pacific was one of the major investors in General Motors, and probably a significant number of other businesses that did less well.  Some of the employees found other successful jobs, and probably a significant number did less well.  Major economic dislocations are ...well... depressing. ",
            "date": "Answered April 13, 2016",
            "views": "833",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anisa Alvarado",
                    "user_href": "/profile/Anisa-Alvarado"
                },
                {
                    "user_id": "Fritz Basset",
                    "user_href": "/profile/Fritz-Basset"
                },
                {
                    "user_id": "Harrison Prather",
                    "user_href": "/profile/Harrison-Prather"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sofien Kaabar",
                "href": "/profile/Sofien-Kaabar"
            },
            "answer_text": "The autumn of 1929 witnessed the biggest stock market crash in history with people losing billions and opening the path to the longest economic depression in the industrialized world. When it comes to duration and aftermath, it is even bigger than the 2008 financial crisis (I’ve written about it here: The 2008 global financial crisis explained in simple terms.). The years after the first world war were characterized by wealth and a rise in industrial production and growth which were naturally accompanied by a rising stock market fuelled with speculation that didn’t truly justify the current fundamentals. A bubble is defined as an unjustified rise in market value. But before discussing the crash and the aftermath, we have to discuss the main causes that led to this crisis. Overheating economy.Overheating, overconfidence, and overproduction were three words to describe most of what was happening. First of all, the unjustified rise in stock prices meant that the buying of the shares was purely for speculative reasons. The buyer didn’t really care about the prospects of the company in a few years, he was only looking to join the party with everyone else. Of course many industries beforehand showed increases in profits (namely, steel production and railway), but people went overboard with the buying activity. Second of all, overconfidence of market participants led to the fact that they didn’t have a plan B in case there was a crash, everyone was sure that markets will continue to go up forever. And third, industries were overproducing products which led to a glut. This means that the excess supply will force prices lower and thus companies suffered. Easy credit.This is self-explanatory and everytime we see the word easy credit, we know that there is trouble ahead. During the years leading up to the crisis, there was a huge growth in bank credit and loans. Buying on margin also fuelled this bubble as it is the act of borrowing money from stockbrokers while providing very little collateral. Interest rates.Weeks before the crash, the Federal Reserve raised interest rates from 5% to 6%. Rising rates means costlier borrowing costs for companies, thus, lowering profitability and economic growth. Jobs can also be lost due to the impacted earnings. A fuel from the London Stock Exchange.Days before the the US stock market crash, a top British investor named Clarence Hatry and some of his associates were jailed for fraud, prompting the London Stock Exchange to crash and infecting its American peer with pessimism. By this time, it was very unstable and so any bad news could have a magnified negative effect. Panic.As is the case in every crisis, panic amplifies the negative effects and worsens the impact. Amidst the panic and the crash, people started to withdraw their funds from banks (or tried to). This effect led banks to fail even quicker than one would expect  Source: https://tradingeconomics.com/united-states/stock-market  Needless to say, stocks started to gradually decline until October, 1929, where the fall grew more serious. During that time, panic started to further amplify the effects and even though big investment companies and banks tried to stabilize the market by buying shares, the market didn’t stop there and kept heading south. ",
            "date": "Answered August 18, 2020",
            "views": "903",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asheesh Kumar",
                    "user_href": "/profile/Asheesh-Kumar-357"
                },
                {
                    "user_id": "Gunjan Yadav",
                    "user_href": "/profile/Gunjan-Yadav-166"
                },
                {
                    "user_id": "Long Vuduc",
                    "user_href": "/profile/Long-Vuduc"
                },
                {
                    "user_id": "Rajesh Dhimal",
                    "user_href": "/profile/Rajesh-Dhimal-3"
                },
                {
                    "user_id": "Gary Bajwa",
                    "user_href": "/profile/Gary-Bajwa-1"
                },
                {
                    "user_id": "Nina Williams",
                    "user_href": "/profile/Nina-Williams-202"
                },
                {
                    "user_id": "Nicolas Fley",
                    "user_href": "/profile/Nicolas-Fley-1"
                },
                {
                    "user_id": "Maria Elena",
                    "user_href": "/profile/Maria-Elena-185"
                },
                {
                    "user_id": "Nate Clover",
                    "user_href": "/profile/Nate-Clover"
                },
                {
                    "user_id": "Andre Johansson",
                    "user_href": "/profile/Andre-Johansson-2"
                },
                {
                    "user_id": "David Wayne",
                    "user_href": "/profile/David-Wayne-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Badger",
                "href": "/profile/Ray-Badger"
            },
            "answer_text": "It was started by the events of the 1920’s. I am sure you have heard of them called “The Roaring 20’s”. Industrial production increased at an amazing rate but there were more workers than jobs so jobs paid low wages and much of the population was living in poverty just getting by. The money supply was increased by 60% over the decade.The increase in production caused the stock market to soar. In those days you could by stocks on margin. You could invest $ 100.00 and buy $ 1,000.00 worth of stocks. It was possible with the stock market soaring to turn little cash into a paper fortune in a short time. However when the stock market crashed margin calls could not be met which sent the stock market into free fall.People wanted their money in cash which caused a run on the banks forcing them into insolvency.That was the starting point of the great depression. People lost their money so they cut back on spending which caused layoffs and closures which started a viscous cycle.There were other factors affecting the economy such as the 3 year long dust bowl of he early 30’s which decimated our ag industry.The government made many mistakes prolonging the depression and the stock markets problems. The government instituted heavy tariffs to protect our industries which cut imports by 75% but made many goods more expensive and less affordable reducing sales. They encouraged unions which forced some businesses to close.",
            "date": "Answered October 24, 2020",
            "views": "101",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pitana Sudjana",
                    "user_href": "/profile/Pitana-Sudjana"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Vallieres",
                "href": "/profile/David-Vallieres-3"
            },
            "answer_text": "There were so many reasons but you’re asking for the “main” reason. Well if you’re an Elliott wave follower, the reason would be we reached the top of a multi-decade wave 3. There’s truth in that but there’s also truth in this: You could buy stock with just 10% cash in 1929. In other words, the exchange would let you borrow 90% of your stock purchase. In other words, the primary cause was OVER LEVERAGING - too much debt and liquidation when they couldn’t pay. Here are the mechanics: (1) As soon as you had a decline, you owed money to the exchange because your ‘equity’ was below 10% in your position.. (2) They requested payment to bring your equity up to 10% (a “margin call”) (3) You don’t have the money to bring your account up to 10% equity (4) The exchange liquidates (sells) your position so they don’t lose any more money. (5) The selling of your positions means more the market goes down and there are more ‘margin calls’ to other over-leveraged people who bought with just 10% down (6) They don’t have the cash to bring their equity up to 10% (7) More “liquidation” (selling) occurs … And on and on it goes until... CRASH! In February, 2018 “margin” debt was at the highest level ever - even more than 2008 when the market declined 50%:  Will the result of over-leveraging be ‘different’ this time? I doubt it. ",
            "date": "Updated July 13, 2018",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Yadav",
                    "user_href": "/profile/Ravi-Yadav-191"
                },
                {
                    "user_id": "Javier De Paula",
                    "user_href": "/profile/Javier-De-Paula"
                },
                {
                    "user_id": "Anton Topole",
                    "user_href": "/profile/Anton-Topole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Little",
                "href": "/profile/Jeff-Little-4"
            },
            "answer_text": "We had a Republican Congress, Republican Senate, and Republican President in control from 1920–1932 (one branch was tied for the last two years). This administration placed a singular emphasis on getting out of the way of business and letting business do what it did best. What business does best is to consolidate wealth and power into the hands of the few which in turn puts downward pressure on the “Returns” in ROI while putting upward pressure on the Investment side of things. Interest rates went to zero while ability of workers to demand the lion’s share of profits also plummeted. The result was that workers stopped spending mainly out of wages and instead spent out of rising stock and real estate markets that floated all boats. When the crash happened, since so many people were spending out of rising asset prices, that part of spending instantly went away. The above triggered wage deflation, which is extremely destructive. See the below link for a discussion of V-Shaped supply curves and why they can destabilize an economy: Jeff Little's answer to Why is an economic recession such a huge problem? Obviously these problems were made worse by the Gold Standard, which prevented us from offering even the type of mild stimulus we had in 2008. These effects were so pronounced that from the time England went off the gold standard in 1931 to the time we went off a couple years later the average worker in england had made up the large wage gap we had against them by the 1920s after they decided to get Smith-Ricardo religion in the middle of the 1800s. ",
            "date": "Answered January 12, 2017",
            "views": "554",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adithya Reddy Nallabolu",
                    "user_href": "/profile/Adithya-Reddy-Nallabolu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Calven",
                "href": "/profile/Roger-Calven"
            },
            "answer_text": "Existing British controlled financial system is bankrupt to the tune of a couple dimes away from 1.5 quadrillion dollars of unplayable debt. This crash will be many times deeper then that of ’08 as “they” did no new changes to the system to eliminate that old debt but simply canceled a portion, but a lot was left on the books and over the past 10 years much added to it. Only solution to revive the nation will be to change into an Alexander Hamilton economic system that promotes all the necessities to allow people to express their creativity and build build build. The critters running the ancient financial system and will try to revise it know nothing of a true value - that of human creativity, but believe that $ and gold, and important papers hold the ultimate form of value. Dead stuff rather then lively human creativity. China has adopted the Hamilton system to pull its poor poor people from poverty and have them add their creativity problem solving for the massive development and scientific advancements that include going past their current landing on the moon by building facilities up there for mining Helium 3 and bring it back to earth for fueling Fusion power. We should be doing the same as a nation- a small but important group is leading the fight for Americans to in-gauge in doing this and with a little search on the ‘net U can find them by following the key words I have posted. Bring Ur creativity to the drive for a beautiful, exciting, lively future. Write if U need direction. ",
            "date": "Answered October 25, 2019",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Edwards",
                "href": "/profile/Bill-Edwards-92"
            },
            "answer_text": "1929 - people were borrowing money to invest. Today its called buying on margin. It was all numbers on paper until the borrowed money came due in mass. Folks could not pay. Thus the lenders who were also borrowing to invest could not pay their debt. Result was everyone in mass wanted to sell to cover their borrowed money. No one was buying. Result was the stocks owned decreased in value so fast that most became worthless. Thus market crash. With market crash, viable companies could not sell products. Thus no revenue. Companies to stay solvent, laid off workers. Workers with no income, could not could not buy normal stuff. The cycle continued at rapid pace. The democrat party came to power and made it worse by adding larger tariffs to imported goods into the US. These tariffs were to cause imported goods from other countries to cost more, thus US people would buy from US companies. This resulted in Europe not being able to sell their goods to the US. Result was Europe also became a depressed economy. Every economy just about crashed. DEBT is the evil entity. Tariffs are evil. today in the US, individual debt is again rampant. Tariffs are imposed on US goods in almost all countries thus impeding the US companies to full market potential. China is a bad guy as they impose large tariffs, mess with their currency and steal US inventions. Bad bad country to deal with. More than you asked… check today. People are living pay check to pay check — about 80% have debt they can not cover within a reasonable time line. This applies to those whose income is from 25k to 500K. Makes no difference. More over, people going to college using borrowed money. Whether graduation or not, they exit with above 45K in school loans. In the northeast colleges much closer to 100K in loans. Then they work (in general) for less than 45K per yr and attempt to pay the school loan off. Further the college degree isnt the ticket to an excellent income. But students are lead to believe it is. Remember there is no degree from college in common sense. To add insult to injury, most professors are clueless. They in turn teach the students this nonsense economics. Crazy right? How about you… now that you know, what next ? ",
            "date": "Answered October 25, 2019",
            "views": "453",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Al-Tyrego"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Goldstein",
                "href": "/profile/Arthur-Goldstein-2"
            },
            "answer_text": "I’m surprised that there aren’t already hundreds of answers. But the only true answer is that there were a great many causes. One problem is that a great many people assume that it was the market crash caused the Great Depression. They will look for correlations that don’t answer your question. Another problem is that for all the smoke, there was very little fire. Few people in the country owned stocks in the market and loosing their gambling money in the crash should have been inconsequential. However, having said that, a great many banks and savings associations decided that the stock market was not gambling but rather a perpetual motion source of wealth. This is how most victims of Ponzi schemes get taken for all their money. Of course, they were gambling with other people’s money and not their own, And an added incentive to gamble was that they could buy stock on a very low 10% margin. This is the leverage that greatly increases profits and losses. (Same as with the Great Financial Crisis, with its home-ownership liar loans, mergers and acquisitions, and default credit swaps a century later. ) It certainly didn’t help that there was a considerable amount of self-dealing and fraud in the market as well. The pump-and-dump was a favored insiders scheme. Of course, there was no deposit insurance to cover any losses back then. When the market collapsed people who owned no stocks investments lost all of their “safely and prudently saved” savings. With their money “simply gone” the country now had a liquidity crisis. This is where the Federal Reserve dropped the ball. But they weren’t even playing in the game. The “idee fixe” at the time was that “the government that governs the least, governs the best.” Interfering with markets was just so wrong on so many levels. (Sound familiar?) It wasn’t until the election year of 1932 that the Fed, Congress, and the White House began to move and by then it was too late to save Herbert Hoover. Part of this problem was the Gold Standard, which was supposed to be a neutral mechanism that could control inflation and depression by controlling foreign exchange rates. As one country became too rich with gold it would print more paper money. This “easy” money caused inflation of its native prices to rise and encouraged buying cheaper foreign goods. When the foreign sales were settled in gold, the gold reserves dropped, causing the central bank to stop printing money. They also raised interest rates so as encourage foreign investment that would reverse the flow of gold. Problem now was that the US had most of the world’s gold as a result of WW1. It could afford to lose a lot of it and still print money. But rules is rules, and so they had to stop printing money, which caused a liquidity crisis to become worse, and raised interest rates, which crippled any efforts to rebuild the economy as there was no money to repay the loans. So, with a lot of blame to go around as to the cause of the Depression and all of it beginning with the stock market collapse, what caused the market collapse? Some of them are: low interest rates, low margin rules for buying, insider corruption, an unrealistic reliance on market discipline, and “irrational exuberance.” (Sound familiar?) Remember, the stock market is not the economy. It’s a gambling casino that is supported by its addicts. ",
            "date": "Answered October 27, 2020",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chet Falkenhainer",
                "href": "/profile/Chet-Falkenhainer"
            },
            "answer_text": "Irrational exuberance and easy credit. Stocks started rising in the early to mid 1920’s and just kept going up and up. Everyone wanted to get into the market and not miss out on the profits. Most of this buying was on credit. You could get margin loans for as little as 10% down so buyers were speculating with borrowed money. No one considered the risk since stocks always seemed to go up. When the crash hit in October, 1929 and stock prices were in free fall, brokerage houses went to the buyers for more money to cover their positions. If they couldn’t pay they were sold out, losing everything. Brokers were in the same position since most of them bought the stock they sold to the public on margin. The old ticker tape process for stock market activity was running hours late so no one had any idea of what their stock was worth in real time causing a panic among investors. ",
            "date": "Answered October 25, 2019",
            "views": "240",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jin Kim",
                    "user_href": "/profile/Jin-Kim-130"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Kiceleff",
                "href": "/profile/Walter-Kiceleff"
            },
            "answer_text": "In The Great Crash, 1929 John Kenneth Galbraith argues that the 1929 crash was precipitated by “… rampant speculation in the stock market, that the common denominator of all speculative episodes is the belief of participants that they can become rich without work”. (The Great Crash, 1929 - Wikipedia) For a different interpretation, you can refer to Milton Friedman (economist). In his classic work with Anna Schwartz, A Monetary History of the United States, he postulated that “… the Federal Reserve’s monetary policies were largely to blame for the severity of the Great Depression”. (The Great Depression According to Milton Friedman | Ivan Pongracic Jr. includes an interesting description of both interpretations). As in any complex phenomenon, there are multiple factors that collaborate in triggering the observed outcome. Relevant to our current-day debates, Protectionism is also cited as a cause of the Crash (although some analysts see it as a reaction to it). Causes of the Great Depression - Wikipedia offers a wide-ranging review of the different theories. ",
            "date": "Answered February 18, 2017",
            "views": "898",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lakhan Gawade",
                    "user_href": "/profile/Lakhan-Gawade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry k Baker",
                "href": "/profile/Larry-k-Baker"
            },
            "answer_text": "It is a long and convoluted road to the collapse but basically it is the result of the punishing Treaty of Versailles that ended WW1. Despite American objections the Great Powers sought to punish Germany for the war by imposing painful reparation payments. These payments were designed to keep Germany broke forever. It also allowed the Great Powers to spend money like a drunk sailor. By 1928 the German people had enough and gave the world the finger. They stopped making payments. When that occurred the Great Powers were forced to reduce their spending. Without the big wads of cash chasing around the investment devices (stocks and bonds) they stopped growing in value. Without that growth the over extended investors could no longer buy stocks to cover their short sells of a fewdays before and the market came apart at the seams. ",
            "date": "Answered July 28, 2015",
            "views": "789",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laura Cloke",
                    "user_href": "/profile/Laura-Cloke-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicolaas Manoppo",
                "href": "/profile/Nicolaas-Manoppo"
            },
            "answer_text": "The Wall Street Crash of 1929 has been widely analyzed. In general the stock prices fluctuate in line with the anticipated future earnings. If the economic outlook is bleak, the stock market will react to lower the stock prices, maintaining the reasonable stock-price to earning ratio. In 1929 the classical economics theories dominated the market players. Government intervention was not desirable in the believe that the market would cure and stabilize itself. When it would not, certainly there was a hole in the economic theories. Then came the British economist John Maynard Keynes with his Keynesian economics, which basically advised the government to proactively control the economic trends. ",
            "date": "Answered October 24, 2016",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Lingren",
                    "user_href": "/profile/James-Lingren-1"
                },
                {
                    "user_id": "Laura Cloke",
                    "user_href": "/profile/Laura-Cloke-1"
                },
                {
                    "user_id": "Nicole Pallerna",
                    "user_href": "/profile/Nicole-Pallerna"
                },
                {
                    "user_id": "Ron Conroy",
                    "user_href": "/profile/Ron-Conroy"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Dailey",
                "href": "/profile/Doug-Dailey-1"
            },
            "answer_text": "The crash of 1929 was fueled by peoples emotions and irrational thinking like all bubbles and subsequent crashes. All financial bubbles are financial cycles. They have a beginning, a middle, and an end. What made the crash of 1929 so devastating was the amount of debt that was accumulated. As debt is accumulated in huge amounts eventually the debt overwhelms the financial system. At the time of the crash the stock market had risen due to the unchecked speculation of those who had borrowed money to buy stocks. The prices of the stock kept rising until there was no one left to support the market by buying. Once the buying of stocks on speculation ceased the selling started and without anyone or anything to step in the market fell and caused a panic. Some people with the proper knowledge and capital made huge fortunes during this time. The unsuspecting speculator lost it all because they had no concept of value, market cycles, or what the game of speculation really entails. ",
            "date": "Answered February 18, 2017",
            "views": "518",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bobsie Jackson",
                "href": "/profile/Bobsie-Jackson"
            },
            "answer_text": "the first world war was over…and times began to boom. people could buy shares on margin, meaning they only had to put down a percentage of the cost, and hence could buy more shares… everyone thought the market was the best thing since sliced bread demand pushed the prices of stock through the roof… industry was thriving and producing lots of produce rapidly. the supply of products outstripped demand. soon certain stocks started to falter…probably automotive stocks. the rest of the market realised it was all a big bubble panic ensued and the market crashed ..the bubble burst. ",
            "date": "Answered October 28, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Nathan",
                "href": "/profile/Richard-Nathan-1"
            },
            "answer_text": "There were many reasons. One of the reasons was that there were too many purchases of stocks on credit. Buyers put down a small down payment, and trusted that gains in stock value would cover the rest. Some of these buyers were banks. When stock value did not go up, the buyers could not cover what they owed. It was similar to what happened to the housing market under G. W. Bush. ",
            "date": "Answered October 22, 2017",
            "views": "595",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Cloke",
                    "user_href": "/profile/Laura-Cloke-1"
                },
                {
                    "user_id": "Matt Elsen",
                    "user_href": "/profile/Matt-Elsen-1"
                },
                {
                    "user_id": "Selena Palmer",
                    "user_href": "/profile/Selena-Palmer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Morgan",
                "href": "/profile/Kevin-Morgan-39"
            },
            "answer_text": "There was broad speculation driven by excessive credit. Eventually, credit started tightening, land values started falling, and everyone headed for the exits at once. -86% over several years in the stock market. Ouch! Expect another similar starting up sometime in the 2020’s. ",
            "date": "Answered October 25, 2019",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gee Beeman",
                "href": "/profile/Gee-Beeman"
            },
            "answer_text": "The thing that distinguished the 29 crash was the magnitude of the stock market decline. The causes of the economic slowdown were not that unusual, but once it began to cause some stocks to go down, it fed on itself because many people had been buying stock on credit (from the broker). When their equity dropped below 10% the broker would ask the buyer to put up more cash. As people began selling some stocks to raise money to keep others, the downward pressure gathered momentum. Answering the question: “What was the real reason for the crash in 1929?” ",
            "date": "Answered March 28, 2019",
            "views": "264",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Zaper",
                "href": "/profile/Peter-Zaper-1"
            },
            "answer_text": "According to John Kenneth Galbraith in his account “The Great Crash of 1929” the stock market crashed because the firm Goldman Sachs created straw companies and then leveraged the stock by buying its own stock and inflating the price. This sucked in gullible investors who bought on margin (10%). Goldman continued to buy its own stock in these phony companies and attracting more and more investors until the market exploded. The bottom line - it was all about greed. ",
            "date": "Answered March 23, 2020",
            "views": "140",
            "upvotes": " Answer requested by Joel Joy",
            "upvoters": [
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Pitana Sudjana",
                    "user_href": "/profile/Pitana-Sudjana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephane Ifrah",
                "href": "/profile/Stephane-Ifrah"
            },
            "answer_text": "Too much debt and over optimism. All major crisis have always been credit driven. After a long period of open tap credit wise, there is always a moment of reckoning. Hope is a very powerful sentiment which explains why tops are processes and not moments contrary to fear which are very short extreme events. ",
            "date": "Answered March 22, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johan Lindén",
                "href": "/profile/Johan-Lindén"
            },
            "answer_text": "What is the explanation of the rain tomorrow? Things that happen by millions of factors such as the stock market and weather can never be answered without being speculative. These are to complex systems and that is why we can't reliable forecast tomorrow's weather and even less next week's weather or stock market.  It's related to chaos theory.  Note that there will be thousands of people having their exact explanation of why it happened but they could all be as right or wrong. ",
            "date": "Answered September 6, 2015",
            "views": "291",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": "The price-to-earnings ratios must have been too high. Irrational exuberance lifted stocks too high. Trade barriers were erected. Corporate profits were threatened. Too much stock purchased on margin. [These are off the top of my head, and I’d be interested in the thoughts of those who have studied it more.] ",
            "date": "Answered October 24, 2020",
            "views": "74",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Lee",
                    "user_href": "/profile/Jeff-Lee-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Pease",
                "href": "/profile/Jim-Pease-4"
            },
            "answer_text": "every boom ends in bust every time since the tulips in Holland 1637..the volume of speculation grows because prices rise and prices rise because of expectations bidding up prices all rational proportion to actual value is lost. then comes the largely unsuccessful attempts to get out.. because the number of intellectually vulnerable buyers is gone. the same methods have worked over and over again.. and so it shall be far into the future.  read JK Galbraith, the crash of 1929 also A brief history of financial euphoria ",
            "date": "Answered October 24, 2020",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pitana Sudjana",
                    "user_href": "/profile/Pitana-Sudjana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Nolan",
                "href": "/profile/Mike-Nolan-39"
            },
            "answer_text": "There were few controls on the stock market or banking. Such investments became more and more profitable, but there was no new manufacturing to back them up. Castles were built of cards, until suddenly they collapsed of their own weight. ",
            "date": "Answered January 8, 2017",
            "views": "256",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Parker",
                    "user_href": "/profile/Tom-Parker-214"
                },
                {
                    "user_id": "Anisa Alvarado",
                    "user_href": "/profile/Anisa-Alvarado"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanner Dunn",
                "href": "/profile/Tanner-Dunn-4"
            },
            "answer_text": "Trade Barriers. Also overspending from the population. Also, the US was still supplying and partially rebuilding Europe after WW1. The US had trade barriers in place with a lot of wealthy countries so that money could not get where it needed to go, and the banks lost their payouts and ran out of money and henceforth, the crash of the stock market. ",
            "date": "Answered March 28, 2019",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tak Nomura",
                "href": "/profile/Tak-Nomura-2"
            },
            "answer_text": "Sure. Found on the internet. QUOTE: By then, production had already declined and unemployment had risen, leaving stocks in great excess of their real value. Among the other causes of the eventual market collapse were low wages, the proliferation of debt, a struggling agricultural sector and an excess of large bank loans that could not be liquidated.May 10, 2010 Stock Market Crash of 1929 - HISTORY ",
            "date": "Answered October 24, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Roberto Punsalan",
                    "user_href": "/profile/Roberto-Punsalan"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Thompson",
                "href": "/profile/John-Thompson-533"
            },
            "answer_text": "Many reasons… watch five or ten movies on U Tube… about the Crash… The Recession didn’t start untill about 1931 or 1932…… ",
            "date": "Answered March 25, 2018",
            "views": "231",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Schneider",
                "href": "/profile/Lawrence-Schneider-6"
            },
            "answer_text": "A massive expansion of equity investments on 10% margin. A deep and swift stock market correction margin calls lack of credit a massive reduction of available credit ",
            "date": "Answered October 25, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pitana Sudjana",
                    "user_href": "/profile/Pitana-Sudjana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murali Krishna Venkata Puppala",
                "href": "/profile/Murali-Krishna-Venkata-Puppala"
            },
            "answer_text": "much of the population involved in speculation. than in the productive acttivity, money generates with productivity. as fresh money is not comming into the market to chase the stocks. market falls. but we attribute many reasons for fall it is crude demand and supply krishnapvm financial analyst ",
            "date": "Answered January 16, 2017",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Spencer",
                "href": "/profile/John-Spencer-197"
            },
            "answer_text": "Ridiculously over priced stocks and a belief that they would plateau or keep going up. Pretty similar to the present or pre February markets. ",
            "date": "Answered May 23, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Cohen",
                "href": "/profile/Scott-Cohen-72"
            },
            "answer_text": "Over production. When there are no legitimate places to place your money you speculate. The speculation produces bubbles that destroy value. ",
            "date": "Answered May 23, 2020",
            "views": "37",
            "upvotes": "0"
        }
    ]
}