{
    "title": "Why do the former colonies of Britain tend to be wealthier overall than the former colonies of France, the Netherlands, Spain, or Portugal? - Quora",
    "tags": [
        "The Best Colonial Power",
        "Colonization",
        "Portugal",
        "The Netherlands",
        "Spain",
        "Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Celaje",
                "href": "/profile/Joshua-Celaje"
            },
            "answer_text": "Ha, yes this is an age-old question. If anyone who is interested in an empirical answer to this question has time, I recommend you look up a paper by La Porta titled “the Economic Consequences of Legal Origins.” It’s a long paper, but highly informative. In essence, a key reason why former British colonial states were mostly better off than their French, Dutch and Spanish counterparts was mainly due to the differing legal systems that each colonizer imposed upon their colonies. The British developed common law systems in their colonies, while the French (as well as the Spanish and Dutch) imposed a form of Napoleonic civil law in their colonies. A significant difference between the two systems are common law’s emphasis on equality, the rule of law and the curtailment of sovereign abuse, while civil law emphasized the all powerful state capable of solving everything.  Now of course, these widely contrasting systems resulted in widely different paths. For instance, common law systems and democracies go hand in hand due to common law’s propensity to prohibit the centralization of power, while civil law systems propagated authoritarianism and plutocracy, due to civil law’s propensity to centralize power. Consequently, these differences resulted in different styles of administration, as the British practiced a form of indirect rule, where they ruled through the local elites, while the French practiced a form of direct rule, in which their colonies were ran by French bureaucrats as well as co-opted local elites trained in the values of the French. Again, the former created an environment that was more conducive to the development of democracy, while the latter did not, not least because the needs of the local were not particularly accommodated.  Another key difference (as concluded by the La Porta article) is the fact that each utilized market regulatory rules and regulations according to their respective legal ideologies. Common law systems were more embracing of a free market economy and capitalistic mechanisms, while civil law systems were more attuned to heavy state involvement in the economy in the form of rigid regulations that were unfavorable to growth. For example, common law systems naturally put heavy emphasis on individual property and investor rights (an essential component for economic growth), while civil law systems were keener on state ownership and management. This resulted in divergent incentives, as the former system incentivized increased productivity and investment, while the latter not only discouraged it, but created an environment that was more susceptible to corruption. As we know now, democracies that embrace free market capitalism are in a better position for economic growth than centralized states engaged in substantial economic involvement, in the form of regulations and protectionist policies. (Note: this is not to say that heavy state involvement in the economy itself is sufficient to ensure unfavorable growth, as exemplified by the developmental states of Japan and the Tiger Cub economies. More so the fact that the form practiced by the French, Dutch and Spanish resulted in inefficient regulations and rules that were not conducive to growth.) On one hand, common law’s embrace of the free market enabled it to benefit more from the burgeoning capitalistic world while its embrace of democratic values created an environment more suitable for increased individual business, investment and productivity, factors beneficial to growth. On the other hand, civil law’s heavy state involvement and regulation prohibited it from benefiting from a world that was increasingly becoming capitalistic while its centralization of power in the hands of the state created an environment that was not conducive to the development of social capital. There are other factors to be considered of course. One was that, when the worldwide independence movements occurred after the WW2 ended; the British were not as keen to hold on their colonial possessions as the French, Spanish and Dutch were. This resulted in relatively peaceful transfers between Britain and its colonies, thus negating the need for any sort of protracted bloody conflicts that might have hindered development post-independence. In contrast, both the French and Dutch were desperate to hold on to their colonial possessions, thus resulting in protracted conflicts that hindered the development of countries after independence was gained, as evidenced by the revolutionary wars in Vietnam, Indonesia and Algeria. ",
            "date": "Answered October 27, 2015",
            "views": "106",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ilyas Yag'ya",
                    "user_href": "/profile/Ilyas-Yagya"
                },
                {
                    "user_id": "Kay Sussex",
                    "user_href": "/profile/Kay-Sussex-2"
                },
                {
                    "user_id": "Matthew Keith",
                    "user_href": "/profile/Matthew-Keith-5"
                },
                {
                    "user_id": "Jake Zywek",
                    "user_href": "/profile/Jake-Zywek"
                },
                {
                    "user_id": "Saiid",
                    "user_href": "/profile/Saiid-1"
                },
                {
                    "user_id": "Estevão Bulhões",
                    "user_href": "/profile/Estevão-Bulhões"
                },
                {
                    "user_id": "Laurence Hughes",
                    "user_href": "/profile/Laurence-Hughes-9"
                },
                {
                    "user_id": "Craig Urquhart",
                    "user_href": "/profile/Craig-Urquhart"
                },
                {
                    "user_id": "Ed Wilcox",
                    "user_href": "/profile/Ed-Wilcox-7"
                },
                {
                    "user_id": "Gabriel Jesús Herrera",
                    "user_href": "/profile/Gabriel-Jesús-Herrera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balaji Viswanathan",
                "href": "/profile/பாலாஜி-விஸ்வநாதன்-Balaji-Viswanathan"
            },
            "answer_text": "In case of the first wave of English colonies (16th-18th centuries), the people from England settled in those colonies. Not just some men toting guns, but whole families - men, women and kids who made their voyage on Mayflower and countless other ships. Due to a variety of religious revolutions and civil war, many common English folk took these ships as a way out.  In contrast, in other European countries there was not as much pain in that period to move whole families out. French, Dutch, Germans and Italians just stayed put at home. Only a few young men were sent and they would return after their mission. No major families or settlements abroad. Spanish and Portuguese settled more than the French and Dutch, but still were not moving as much as the English. [South Africa was one exception for the Dutch. There they Dutch stayed in large numbers & had a prosperous nation that was at the same time the worst for the natives.] In that wave of English colonies - US, Canada, Australia and New Zealand - the locals were mostly driven out to remote settlements and the English immigrants totally took over the land. They brought their ideas and technology and built their homes. Since they were settling permanently they were more vested in ensuring rights, liberty etc.  Other colonial settlers were not settling for good and out there to make a fast buck out of the resources and markets. Thus, they never setup as good infrastructure - social and physical. They also didn't bring the best of their technology. At the same time, other colonial powers didn't always wipe the native cultures as much as the English did at that time.  From the late 18th century onwards the situation flipped. It was now the English who were done with the civil wars & revolutions and the rest of Europe picking up the chaos. Englishmen stopped settling outside in droves and in the second wave of colonization - India, Malaysia, Kenya, Egypt - they did like what other colonial powers did. They sent their young men to war, to trade and to rule, but they didn't send their families to settle. This meant that the native cultures were not exterminated, but at the same time the colonial masters had little incentive to think in the colony's main interests - as they were not settling there anyway.  It was at this time that a lot of Germans, Italians, Irish and other Europeans took the boats to escape the chaos. They settled in large numbers in the US and elsewhere. However, by then England and other powers had already setup their culture. Thus, even when Germans rivalled the English in numbers in North America, US & Canada never turned German, but remained British.  Britain's colonies ended in two extremities. On one end you have prosperous ones like US & Australia and on other end you have Myanmar, Zimbabwe, Sudan, etc. The difference is how many English tried to make the colony as their home vs see it merely as a land for exploitation. South Africa fall somewhere inbetween.  At the end of the day, colonization provided two choices - lose all native civilization & culture or lose all of economic power & prosperity. All colonies lost at least one of the two. If the Native Americans & Aborigines lost their civilization & homelands, Indians & Egyptians lost their economic prosperity. ",
            "date": "Answered October 26, 2015",
            "views": "656",
            "upvotes": " View 847 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ilyas Yag'ya",
                    "user_href": "/profile/Ilyas-Yagya"
                },
                {
                    "user_id": "Anh Tuan Phan",
                    "user_href": "/profile/Anh-Tuan-Phan"
                },
                {
                    "user_id": "Nathan Spencer",
                    "user_href": "/profile/Nathan-Spencer-31"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RDP-14"
                },
                {
                    "user_id": "Davide Bincoletto",
                    "user_href": "/profile/Davide-Bincoletto"
                },
                {
                    "user_id": "Kamrul Hasan Chowdhury",
                    "user_href": "/profile/Kamrul-Hasan-Chowdhury-5"
                },
                {
                    "user_id": "Ravi Snow",
                    "user_href": "/profile/Ravi-Snow"
                },
                {
                    "user_id": "Thomas Sharma",
                    "user_href": "/profile/Thomas-Sharma-2"
                },
                {
                    "user_id": "Yehezkiel Davi",
                    "user_href": "/profile/Yehezkiel-Davi"
                },
                {
                    "user_id": "Aryan Gupta",
                    "user_href": "/profile/Aryan-Gupta-658"
                }
            ]
        }
    ]
}