{
    "title": "Why did France leave NATO? - Quora",
    "tags": [
        "NATO",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brad Bigelow",
                "href": "/profile/Brad-Bigelow-1"
            },
            "answer_text": "First, just to clarify: France never left NATO. It was one of the original signatories of the North Atlantic Treaty and it never revoked its agreement to the Treaty. What France left was the NATO Military Structure. In other words, it withdrew its contribution of French military officers and enlisted personnel to the manning of the NATO Command Structure (e.g., the Supreme Headquarters Allied Powers Europe (SHAPE)) and it withdrew its forces from the NATO Force Structure--the contribution of national military forces (units) to NATO military operations and missions. France actually pulled its Navy out of the Force Structure in 1963, then followed in June 1966 with a complete withdrawal from all NATO military activities. And stayed out until 2009, when President Sarkozy announced it would rejoin the NATO Military Structure at the Strasboug/Kehl summit. And even its withdrawal from the military structure was not a complete rejection of the need to coordination military activities with NATO. Under an agreement worked out by General Lemnitzer, then SACEUR, and General Ailleret, then Chief of Staff of the French Army, France continued to be included in plans about response to nuclear attack or Soviet invasion. France continued to contribute funds and receive air defence data from the NATO Air Defence Ground Environment (NADGE). France continued to support the NATO pipeline system. But, to really address the question, there are two reasons that were well-recognized then and now. First, de Gaulle always saw France as a global power, even as it was withdrawing control over its colonies and seeing its economic stature in the world decline. And in the 1960s, the price of global power was maintaining nuclear arms. He felt strongly that the U.S., having overwhelming superiority in nuclear forces and weapons among Western nations, was bullying other NATO nations into acting as its proxies and taking their agreement to U.S. nuclear strategy as a given. By withdrawing France from NATO's military elements and maintaining independent control of its nuclear arms, de Gaulle believed France would have a greater say in the global political card game. One could argue that he was right, in retrospect.  The second reason is what is for most politicians the first reason for foreign policy choices: its domestic impact. De Gaulle was aging, the opposition parties in the Fifth Republic were growing in strength and influence, he was no longer being seen as the two-time \"saviour\" of France, and this decision sent a powerful message within France that he was still a force to be reckoned with and that he held France's interests first. This rationale, however, clearly did not prove right in retrospect: less than three years after making this decision, he was forced to retire, even though his party had won a majority in the June 1968 election. ",
            "date": "Answered August 1, 2015",
            "views": "171",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishikesh Khoptikar",
                    "user_href": "/profile/Rishikesh-Khoptikar-1"
                },
                {
                    "user_id": "Adam Houžvička",
                    "user_href": "/profile/Adam-Houžvička"
                },
                {
                    "user_id": "Jacques Verhaeghe",
                    "user_href": "/profile/Jacques-Verhaeghe"
                },
                {
                    "user_id": "Scott Priddy",
                    "user_href": "/profile/Scott-Priddy"
                },
                {
                    "user_id": "A. E. Kabir",
                    "user_href": "/profile/A-E-Kabir"
                },
                {
                    "user_id": "Aynur Abbassoy",
                    "user_href": "/profile/Aynur-Abbassoy"
                },
                {
                    "user_id": "Colin Strieder",
                    "user_href": "/profile/Colin-Strieder"
                },
                {
                    "user_id": "Bob Pizza",
                    "user_href": "/profile/Bob-Pizza-2"
                },
                {
                    "user_id": "Lionel Leow",
                    "user_href": "/profile/Lionel-Leow"
                },
                {
                    "user_id": "Srijan Malhotra",
                    "user_href": "/profile/Srijan-Malhotra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bilal Rehman",
                "href": "/profile/Bilal-Rehman-3"
            },
            "answer_text": "Two extremely important thought processes intermingled in this decision to remain out of the military command structure of NATO. Firstly, in both the world wars, France initially suffered terrible losses. The French President, General De Gaulle was of the view that US intervenes in Europe once the Europeans have sufficiently weakened the eastern enemy so that the Americans can have an easy run to the end. US abstention from the Suez crisis, although for different reasons, was also a disappointment which in some ways reinforced this belief. Secondly, it was a period of decolonisation. US had itself been a colony and had little sympathy for the emaciated, anachronistic post WW2 European colonial powers with regards to their colonial possessions and bloated pride. The Algerian war of independence was also a big blow for France. However, France had developed nuclear weapons by then and an effective deterrence regime was in place in Europe. Therefore, in practical terms France did not see great value in participating in a forum viz NATO, with overarching American influence. It saw little value of this alliance for the French at the nuclear level of war, conventional as well as sub conventional level of the conflict spectrum. Also, sub consciously, France did not open heartedly accept the Anglo Saxon preeminence which was viewed as an ascendant challenge against a declining Francophone bloc. With the rise of a bipolar world, colonial powers were history. France failed to accept its diminished role on the world stage and acted somewhat impulsively to downgrade its relations with NATO. It also had something to do with bloated pride in French culture, gradual decline of French language on the international stage and bruised French egos. The iconic personality of De Gaulle could not adjust to the changing world. Despite losses of colonies, the French still held numerous areas around the globe, had access to raw materials and markets and propped up the European Community which later matured into the EU. Due to overlap between NATO and EU, the French were never really out of the loop. However, French realists did not close the door by paying their monetary share to NATO. Finally, the French upgraded their presence in the NATO military planning side to normal in 2009. ",
            "date": "Answered June 22, 2016",
            "views": "9",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fabien Gossard",
                    "user_href": "/profile/Fabien-Gossard"
                },
                {
                    "user_id": "Donal Mcdonald",
                    "user_href": "/profile/Donal-Mcdonald-2"
                },
                {
                    "user_id": "Adhir Bose",
                    "user_href": "/profile/Adhir-Bose"
                },
                {
                    "user_id": "Hany Shenouda",
                    "user_href": "/profile/Hany-Shenouda-3"
                },
                {
                    "user_id": "Ong Kah Loong",
                    "user_href": "/profile/Ong-Kah-Loong"
                },
                {
                    "user_id": "Anshuman Mukherjee",
                    "user_href": "/profile/Anshuman-Mukherjee-11"
                },
                {
                    "user_id": "Lionel Leow",
                    "user_href": "/profile/Lionel-Leow"
                },
                {
                    "user_id": "Archie Scotland",
                    "user_href": "/profile/Archie-Scotland"
                },
                {
                    "user_id": "Christoffer Anthony",
                    "user_href": "/profile/Christoffer-Anthony"
                },
                {
                    "user_id": "James White",
                    "user_href": "/profile/James-White-2090"
                }
            ]
        }
    ]
}