{
    "title": "Why did King Leonidas of Sparta lose the battle of Thermopylae? - Quora",
    "tags": [
        "Battle of Thermopylae",
        "Ancient Sparta",
        "Historic Battles",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Green",
                "href": "/profile/Luke-Green-23"
            },
            "answer_text": "Because they were vastly outnumbered. The Greeks had somewhere between 5000 and 7000 at the pass against the Persians with somewhere between 100000 and 150000. They knew going in that they were going to lose, they were only trying to buy time. They lasted a lot longer than people expected, around three days or so. Also, when it was realized that the Persians had found a way to get around the Greeks and encircle them, the Spartans (300) and Thespians (700) remained in position, forcing the Persians to engage them while the remaining Greek forces retreated. It is a popular idea that the Battle of Thermopylae was a Pyrrhic victory for the Persians, but the real history does not show this at all. The Battle of Thermopylae barely slowed them down for three days despite that taking longer than expected. They were still in Greece a year later. It is another idea that the Battle of Thermopylae bought time enough for the allied navies to prepare for the Battle of Salamis but this also doesn’t make much sense because there was barely a month between the two and the allied Navy, the major cause of victory in Salamis, was at the Battle of Thermopylae off the course blocking the Persian navy while the Spartans and others blocked the Persian army. So the navy was actively engaged and losing ships at Thermopylae. Not building up strength for a major victory later. In terms of the larger conflict, Thermopylae was a non-event. However, similar to the Alamo, it became a point of major inspiration because the defenders did better than expected. ",
            "date": "Answered June 3, 2019",
            "views": "230",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Siddharth Das",
                    "user_href": "/profile/Siddharth-Das-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "David M. Prus",
                "href": "/profile/David-M-Prus"
            },
            "answer_text": "The size and strength of the Persian army. They numbered more than 100,00 strong, and they weren’t pushovers either.A local shepherd, Ephialtes, told the Persians of a goat path over the heights.The path was guarded by the Phocians, but they buckled and retreated against the elite Immortal bodyguard of the king. The Persians could then attack the Greeks from behind.The battle was lost on the morning of the third day. The rest of the Greeks fled, with only the Spartans, Thebans, and Thespians staying as a suicidal rearguard to cover the retreat. ",
            "date": "Answered June 4, 2019",
            "views": "119",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Siddharth Das",
                    "user_href": "/profile/Siddharth-Das-77"
                }
            ]
        }
    ]
}