{
    "title": "Why do Cuban immigrants in Florida still support Republicans even after 50+ years of US embargo which has not had much effect on Cuban government, but had devastating effect on it's citizens economic progress? I don't understand the logic. - Quora",
    "tags": [
        "Embargos",
        "Cuban Ethnicity and People",
        "Cuba",
        "Immigrants",
        "Florida (state)",
        "Republican Party (US politics)",
        "Immigration to the United States of America",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Fuller",
                "href": "/profile/Gary-Fuller-39"
            },
            "answer_text": "There are many issues at odds here. Many Cubans who immigrated from Cuba or are descendants of Cuban immigrants recall the origins of their presence in the US. Many of those immigrants escaped Castro’s Leftist regime. Prior to the Castro take over of Cuba, many residents had built familial wealth. Castro and his supporters took over Cuba and seize business, land and homes of people who had worked for generations to accumulate their wealth. That property and wealth was distributed to Castro’s supporters. Many Cubans were thrown into Castro’s jail or violently expelled or started escaping the Leftist country for the nearby US and seldom left Miami. Fast forward to today, many Cubans see the Democratic Party as the “left wing” party or in their eyes “Leftists”. They see the social programs like food stamps, public housing, and welfare programs to the poor (including poor and needy Cubans) as Socialist or Leftist, unfair taxation to benefit people who don’t deserve it. They see the Democratic party as the Leftist party and fail to see that (or are duped by Conservatives) to see taxation as a bad thing. They fail to see that tax payments for vital programs are what makes the United States so appealing to immigrants. They fail to see that taxation is a constant in this country, whether they pay for social programs for poor citizens or resident immigrant (including many of them) or tax breaks for wealthy people and business, taxation in this country is a constant. They go up or down for everyone, but are a fact of citizenship or residence in the US. Conservative politicians key on Cuban fears of leftist looking policies like welfare to the poor and call Democrats “Socialists” (Leftists) and equate Democrats to Castro’s socialist/communist party. Furthermore, Cubans like African Americans who traditionally vote Democrat, or rural White Americans who traditionally vote Republican, traditionally vote with the Republican party. But many of the young Cubans who speak fluent English and watch mainstream news and are well educated are beginning to judge for themselves which political party benefits them best. Many are seeing that Republican programs typically benefit the rich and business, but do little to support normal citizens or the poor. While many of the older Cubans don’t watch television, but listen to Spanish speaking AM radio, where the messages are limited and often echo Conservative only themes. So, abuela (grandma in Spanish) will almost always vote Republican and preach or argue those views with their ninas/ninos (children and grandchildren). Contrast to immigrants from other countries (particularly in Miami-Dade County Florida) most don’t see politics from the Cuban perspective. They assimilate more, they learn the language (English), they expand outside of Miami. They watch mainstream TV and they slew more frequently Democrat because they can see through the rhetoric and make educated decisions that benefit themselves and their families, who often need and use the social (not socialist) programs when they come to the United States. Cubans are a beautiful people, but like all of us, they (and their views) are a product of where they come from and how they are educated, not only by their environment, but by their parents. ",
            "date": "Answered October 17, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Erin Bullock",
                    "user_href": "/profile/Erin-Bullock-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guillermo Ramon",
                "href": "/profile/Guillermo-Ramon"
            },
            "answer_text": "The best reason for it is that Cubans that came to the US in the sixties had never been in a democracy. They were pro-Batista. Batista was a right wing dictator supported by the United States. They came and got a lot of support here. The young Cubans that came in the sixties, called the Peter Pans, or something like that, were placed in custody of a Catholic group. Then, families were United what possible. When the Marielitos came, they were also helped by right wing organizations. None of them had known any form of democracy before coming here. To them, freedom and freedom to be like them are the same. Republican values are very easy to absorb for a person who has lived under very strict authority all his or her life. Understanding and accepting differences is not easy for people who grow up under dogmatism. For instance, the Fidel regime killed homosexuals from its inception. They considered being gay as an aberration. Growing under such regime, how can Cubans embrace gay marriage. Further, Cuba was a very racist country. Most white Cubans dislike blacks. They think of blacks as lazy and as prone to be on welfare. Therefore, it is easy for them to dislike welfare. Cubans tend to have a strong preference to hire cubans. This means that they believe in favoritism. However, there are many liberal cubans who are not dogmatic, do not believe in favoritism, support gay rights, etc. It is incorrect to think that all or most cubans are conservative and support Republicans. More than half do. However, many don't. ",
            "date": "Answered October 17, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carl Holmberg",
                    "user_href": "/profile/Carl-Holmberg-2"
                }
            ]
        }
    ]
}