{
    "title": "Why can the UK never be invaded? - Quora",
    "tags": [
        "Hypothetical UK Wars",
        "Foreign Policy of the United Kingdom",
        "Invasions",
        "History of Great Britain",
        "Great Britain",
        "Warfare",
        "The United Kingdom",
        "Military History and Wars ",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomas McIntee",
                "href": "/profile/Tomas-McIntee"
            },
            "answer_text": "Britain has been invaded repeatedly. Successively, the territory that today is the UK has been invaded by the Romans, the Germans, the Vikings, and the French. In all four cases, we can say that Britain was invaded repeatedly. Roman invasions In 55 BCE, Julius Caesar invaded the island, crossing the channel. About 100 years later, the Romans returned in force. They conquered what would today be called England and Wales, although they never really conquered Scotland.  Roman dominion over what they called Britannia continued for a while and then faded as the Roman Empire collapsed. The Anglo-Saxon invasions After the Roman Empire folded up, Britannia - like many other Roman possessions - was overrun by Germanic tribes, notably both the Angles and the Saxons. This is the backdrop for the legend of King Arthur; the Saxon threat is what King Arthur was uniting the Britons to fight. The legendary version of the account is that while King Arthur may have defeated the Saxons in many battles, once King Arthur kicked the bucket, there was no high king who could stop the Saxons.  So. That’s invasion #2. Now England is roughly divided among seven (or so) Anglo-Saxon kingdoms. Celtic people are still hanging onto control in Scotland (which had successfully resisted both rounds of southern invasion) and Wales (Gwynedd).  As with the Roman invasions, this wasn’t a singular event, something underlined by the fact that it involved multiple tribes of both Saxons and Angles, founding seven separate kingdoms or so. The Viking invasions Next up, we have the Vikings. The Vikings start raiding the British isles around 793. They hit England, Scotland, and Ireland. Within a few decades, Vikings start to conquer parts of both Ireland and Great Britain, notably including large chunks of Scotland.  Here’s a map of the holdings of King Cnut. Notice something? Yeah, this includes pretty much all of England. In 1066, the English handed the Vikings a major defeat, and that marked the decline in Viking power in England. Vikings still held parts of Scotland and Ireland for a while afterwards. The Norman invasion Something else happened in 1066, and that’s that the Normans came invading from due south, headed by William the Conqueror.  The English, freshly battered from rebelling against Viking rule, get thoroughly thrashed by the French. Well, particularly, Norman French, who are in part descended from … Vikings who settled in France. So double whammy there. Subsequent French invasions The Normans who left France to conquer England soon got themselves in succession disputes involving their old French holdings. As part of this lengthy series of conflicts - known as the Hundred Years’ War - the French did successfully send an invading army to England through Scotland in 1385. They didn’t conquer England, but they did invade. However, that particular invasion didn’t lead to conquest, and most of the fighting of the Hundred Years’ War happened in France. Why no more recent invasions? There have been a few subsequent close calls, such as the defeat of the Spanish Armada in 1588. Britain has managed to maintain enough naval power to successfully prevent invasions. It’s naturally difficult to invade an island if the island has a good navy, and the British concentrated pretty hard on maintaining naval superiority over potential invaders. EDIT: User-12818735829793151025 (in comments below) has correctly pointed out that there have been another more recent invasion. Notably, in 1688, during the Glorious Revolution, a Dutch army landed and invaded as part of the process of deposing King James and installing King William. The Dutch were invited by a British faction, so it could be discounted on some grounds. ",
            "date": "Answered July 3, 2020",
            "views": "3",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kit Whitfield",
                    "user_href": "/profile/Kit-Whitfield"
                },
                {
                    "user_id": "Crimson Rose Alexander",
                    "user_href": "/profile/Crimson-Rose-Alexander"
                },
                {
                    "user_id": "Martin J. Pattison",
                    "user_href": "/profile/Martin-J-Pattison"
                },
                {
                    "user_id": "Alex Brewer",
                    "user_href": "/profile/Alex-Brewer-23"
                }
            ]
        }
    ]
}