{
    "title": "Why are Norwegians so attractive? - Quora",
    "tags": [
        "Norwegian Ethnicity and People",
        "Norway"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Hirstwood",
                "href": "/profile/Mark-Hirstwood-1"
            },
            "answer_text": "genes. the germanic tribes went into scandinavia and they blended with native scandis and some baltic groups. it’s just a a good mix. selection. i read somewhere that northern people lack attachment genes because they lost babies in the cold climate (not sure how exactly), so they had to evolve to care less or feel it less i guess. i think that sick or weak babies were somehow put down, discarded. pretty, healthy, happier, stronger, gentler women seemed to be selected for more in norway as they are overrepresented there today. myth. no, vikings didn’t kidnap lots of pretty british isles babes. mostly, norse exported genes, not imported. maybe the odd russian princess but barely at all is this a factor. sea air is good for health. the coastal scandis love to walk outside, etc, and breath this air, even sleeping, it triggered lucid dreaming for me. some sources say more oxygen and minerals. hill walking, nearly as good as skipping rope and running, but easier and widespread. fish and fish oil, supposedly a factor in good skin. there’s lots of good hair and good voices and great eyes and many good legs in norway. it’s quite fascinating. there’s a saying in aikido, the art of peace, from japan, attributed to morihei, ueshiba “warriorship gives birth to natural beauty”. i coined ‘norsamurai’, the norse-samurai (and then some). the people, for me anyway, particularly in rogaland, southwest norway, really are living proof of that legacy. neighbourhoods and houses almost japanese in taste, tidiness/cleanliness, form/function, and though it’s not like everybody are models, but they are on average, taller, pretty healthy and happy as a bunch and less attractive people often have this noble vibe and facial features, through the whole strata, well nearly. this region (and into hordaland) are where norwegian history supposedly starts, and it’s also where (later), the heaviest U106 and its major branch, R-L48 are, at least in norway. so if this is true, that by farming, and more defending than attacking (despite viking perceptions and some real stories not representing the whole thing), if winning like that would not be called warriorship, i don’t know what would be. if we grow more pleasant physically, or at least generation to generation, due to being somehow more morally squared or in the flow with the life force, do we reincarnate to be more attractive? it’s not just skin deep, by this theory, it’s inside out. Anglo-Scandinavian Scandilicious Proto-Germanic Friesland Frisians ",
            "date": "Answered October 1, 2018",
            "views": "47",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sylvia Jesuthasan",
                    "user_href": "/profile/Sylvia-Jesuthasan"
                },
                {
                    "user_id": "Paula Berge",
                    "user_href": "/profile/Paula-Berge-3"
                },
                {
                    "user_id": "Jean Batista",
                    "user_href": "/profile/Jean-Batista-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magnus Itland",
                "href": "/profile/Magnus-Itland"
            },
            "answer_text": "First the usual disclaimer: Nobody is attractive to everyone, and not everyone in a country looks or acts the same. There is however an objective, historical reason why many Nordic people fit the widespread western standard of beauty: It is because this standard of beauty was based on their relatives. Around the time of the fall of the Roman empire, tribes related to present-day Scandinavians migrated southward and conquered parts of the former Roman territories. The Langobards conquered Lombardy, the Vandals took Andalusia and later the Norsemen conquered Normandy (and eventually England). These northern tribes were too few to replace the existing population, but they replaced the royalty and nobility. For centuries afterward they intermarried mostly with one another, so that during the dawn of contemporary European art and culture, the upper classes still quite often resembled their Nordic relatives: Light-skinned, fair-haired, pale-eyed, tall of stature, with a runner’s build (athletic but not very bulky). Being wealthy, healthy and wise due to their position in society rather than any genetic advantage, they were still looked up to as an ideal and portrayed in art and literature as superior to their shorter, darker compatriots. In parts of the world that are not much touched by European culture, the attraction to Scandinavian features is less common, although they are often seen as exotic and memorable due to the rare colors of hair and eyes. ",
            "date": "Answered July 3, 2017",
            "views": "94",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elvarias Ibrahim",
                    "user_href": "/profile/Elvarias-Ibrahim"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Pippi M. R. Groving",
                    "user_href": "/profile/Pippi-M-R-Groving"
                },
                {
                    "user_id": "La Morena Sin Pena",
                    "user_href": "/profile/La-Morena-Sin-Pena"
                },
                {
                    "user_id": "Lira Nepo",
                    "user_href": "/profile/Lira-Nepo"
                },
                {
                    "user_id": "Nana Boafo Yeboah",
                    "user_href": "/profile/Nana-Boafo-Yeboah"
                },
                {
                    "user_id": "Vegard Stornes Farstad",
                    "user_href": "/profile/Vegard-Stornes-Farstad"
                },
                {
                    "user_id": "Odin Lindeberg",
                    "user_href": "/profile/Odin-Lindeberg"
                },
                {
                    "user_id": "Margie Mccormick",
                    "user_href": "/profile/Margie-Mccormick-4"
                },
                {
                    "user_id": "Shivs Gupt",
                    "user_href": "/profile/Shivs-Gupt"
                }
            ]
        }
    ]
}