{
    "title": "Why was North America so sparsely populated before colonization? - Quora",
    "tags": [
        "North America",
        "Colonization",
        "Populations",
        "Demographics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas de La Marnierre (トマ・サレ)",
                "href": "/profile/Thomas-de-La-Marnierre-トマ-サレ"
            },
            "answer_text": "There is one major problem to consider : when several indigenous nations came to be known to Europeans, they were often already affected by the pandemia that afflicted the continent, and therefore it distords our perception of how many people lived on the continent. Many nations said in their own words that they used to be much more populated. This idea of an empty or in the process of being emptied continent is tributary to the pandemia, so it’s hard to imagine what it was before. However what is true is that excepted the archeological case of Cahokia in the Mississippi valley, there is no other known indigenous city north of Rio Grande, so North America but Mexico does not seem to have produced the same massive concentrations of population like you see in the South. Even the sedentary nations would not be that sedentary as they would move their villages once in a while, when the land would be exhausted. Why would you need roads, when you can use rivers just fine ? Medieval Europe was much like that : it didn’t care so much for read and trade would rely much more on navigation.Why would you need stone walls, when four fences would be enough to counter enemy weaponry ?Why would you need wheels for when roads themselves would not be much useful ?Why would you need to be afraid of a lack of resources when fishes and animal seem to be in such prolific quantities nothing would appear to be able to menace that ?",
            "date": "Answered October 22, 2018",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Holt",
                    "user_href": "/profile/Jonathan-Holt"
                },
                {
                    "user_id": "Paulo César",
                    "user_href": "/profile/Paulo-César-51"
                },
                {
                    "user_id": "Jose Pineda",
                    "user_href": "/profile/Jose-Pineda-6"
                },
                {
                    "user_id": "Joosua Raave",
                    "user_href": "/profile/Joosua-Raave"
                },
                {
                    "user_id": "James E. Miller",
                    "user_href": "/profile/James-E-Miller-1"
                },
                {
                    "user_id": "Simon Labrunie",
                    "user_href": "/profile/Simon-Labrunie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Faulkner",
                "href": "/profile/Jay-Faulkner-7"
            },
            "answer_text": "Actually, North America was much more heavily populated that what was realized for a very long time. Archaeologists and other scholars have found that Europeans arriving in North America released a lot of epidemic diseases that didn’t previously exist and to which the natives had no immunity. These illnesses developed in the Euroasian landmass because of the close proximity of domesticated animals and humans, these conditions didn’t exist in N.A. It’s estimated that as much as 90% of the native peoples died from these epidemic diseases. Typically the epidemics moved far ahead of the European colonialists, so they didn’t realize the connection between their presence and the great die off. For example, when French explorers first sailed down the Mississippi River they encountered densely populated areas, but later explorers sailing through the same area more than a hundred years later found it sparsely populated. ",
            "date": "Answered January 3, 2017",
            "views": "801",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Holt",
                    "user_href": "/profile/Jonathan-Holt"
                },
                {
                    "user_id": "William Palmer",
                    "user_href": "/profile/William-Palmer-43"
                },
                {
                    "user_id": "Weyodi O'Clerc Stern",
                    "user_href": "/profile/Weyodi-OClerc-Stern"
                },
                {
                    "user_id": "Steven Zoraster",
                    "user_href": "/profile/Steven-Zoraster"
                },
                {
                    "user_id": "Avery Dean",
                    "user_href": "/profile/Avery-Dean"
                }
            ]
        }
    ]
}