{
    "title": "Why was Mohammed (PBUH), the most beloved prophet of Allah (SWT)? - Quora",
    "tags": [
        "Muhammad (Islamic prophet)",
        "Muslims",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ahsan Hashmi",
                "href": "/profile/Ahsan-Hashmi"
            },
            "answer_text": "Prophet Muhammad(PBUH) was the greatest of all mankind; his mercy covered all, Muslims, non-Muslims, trees, animals, humans, non-humans.When he(PBUH) sent an army to fight the oppressors and aggressors, he ordered his companions, the leaders of the army not to kill an old man or a child or a woman and not to cut a tree or destroy a building, not to slaughter animals except for food.He(PBUH) also ordered them not to disturb the monks worshiping in their churches or Rabbis in their synagogues and to leave them alone in their hermitages as long as they don't fight them.Some Ayats of Quran that shows love of ALLAH for Prophet Muhammad (PBUH):1. If you want to gain the love of Allah, follow him (3:31)2. Allah addresses him with love and affection (20:1) (36:1) (73:1) (74:1)3. Allah says: Realize that My Prophetic Messenger himself is with you (49:7)4. Allah describes him with His Own Attributes of Rauf (Most Kind) and Rahim (Merciful) (9:128)5. Allah Himself praises him (33:45-47)6. Possessor of Allah’s Grace (4:113)7. He is a special favour of Allah (Sub’hanahu wa Ta’ala) (3:164)8. Allah does not punish people if he is in their midst (8:33)9. Allegiance to him is allegiance to Allah (48:10) Our Prophet(PBUH), was the blessed one, He could have lived his life at his will, without any struggle, effort, or work yet he chose not to, yet chose to go through all the trouble for us! For his(PBUH) people, he (PBUH) used to stay awake all night, crying, praying. just for us, just for the sake that on day of judgment his ummat shall be forgiven, Whenever he asked something from ALLAH, he(PBUH) used to ask of mercy for his people, for those who were there at that time and for those like us.Surely, this was one of countless things that HE(PBUH) was the most beloved of ALLAH. ",
            "date": "Answered May 30, 2015",
            "views": "63",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hammad Hasan",
                    "user_href": "/profile/Hammad-Hasan-23"
                },
                {
                    "user_id": "Marwan Ali",
                    "user_href": "/profile/Marwan-Ali-1"
                },
                {
                    "user_id": "Shryne Vermillion",
                    "user_href": "/profile/Shryne-Vermillion"
                },
                {
                    "user_id": "Muhammad Raza",
                    "user_href": "/profile/Muhammad-Raza-697"
                },
                {
                    "user_id": "Saba Ahmed",
                    "user_href": "/profile/Saba-Ahmed-109"
                },
                {
                    "user_id": "Hazem Refat",
                    "user_href": "/profile/Hazem-Refat"
                },
                {
                    "user_id": "Siraj Pathan",
                    "user_href": "/profile/Siraj-Pathan-1"
                },
                {
                    "user_id": "Aafreen Khan",
                    "user_href": "/profile/Aafreen-Khan-19"
                },
                {
                    "user_id": "Majid Khan Afridi",
                    "user_href": "/profile/Majid-Khan-Afridi"
                },
                {
                    "user_id": "Sameer Rain",
                    "user_href": "/profile/Sameer-Rain-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monti Khaja",
                "href": "/profile/Monti-Khaja"
            },
            "answer_text": "Who said that? Certainly not God. If you want to know about Islam … don't ever ask a Muslim ! … Just read the Quran and you will be surprised . The Muslims you see today are more of a MOHAMMADEN rather than a MUSLIM. And they have made Prophet Muhammad into a SUPER PROPHET through corrupt Hadiths… which is nothing to do with God or Prophet Muhammad! …. QURAN simply says ….. …. … [[ Quran Sura 3 :19 .. ..Religion with God is Islam. Those to whom the Scripture was given differed only after knowledge came to them, out of envy among themselves. Whoever rejects the signs of God—God is quick to take account. Quran Sura 4 : 125 .. .. .. And who is better in religion than he who submits himself wholly to God, and is a doer of good, and follows the faith of Abraham the Monotheist? God has chosen Abraham for a Friend. Quran Sura 42 . 13. .. .. He prescribed for you the same religion He enjoined upon Noah, and what We inspired to you, and what We enjoined upon Abraham, and Moses, and Jesus: “You shall uphold the religion, and be not divided therein.” As for the idolaters, what you call them to is outrageous to them. God chooses to Himself whom He wills, and He guides to Himself whoever repents. ]] …. … And as for Prophet Muhammad… the Quran says …. … [[ Quran Sura 3 : 144 .. .. . Muhammad is no more than a messenger. Messengers have passed on before him. If he dies or gets killed, will you turn on your heels? He who turns on his heels will not harm God in any way. And God will reward the appreciative.Quran Sura 33 : 40 . .. .. . Muhammad is not the father of any of your men; but he is the Messenger of God, and the seal of the prophets. God is Cognizant of everything. Quaran sura 46 verse 9 .. .. . Say, “I am not different from the other messengers; and I do not know what will be done with me, or with you. I only follow what is inspired in me, and I am only a clear warner.” So you see ….! ? Where on earth did you get the idea that Prophet Muhammad is the most beloved Prophet of God? In fact God says that He has made Prophet Abraham His FRIEND !! Infact God clearly says ………… … . Quran sura 3 : 84. .. .. . Say, “We believe in God, and in what was revealed to us; and in what was revealed to Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs; and in what was given to Moses, and Jesus, and the prophets from their Lord. We make no distinction between any of them, and to Him we submit.” ",
            "date": "Answered August 13, 2020",
            "views": "405",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhammad Raza",
                    "user_href": "/profile/Muhammad-Raza-697"
                },
                {
                    "user_id": "Kera Thomas",
                    "user_href": "/profile/Kera-Thomas-9"
                },
                {
                    "user_id": "Wazir Khan",
                    "user_href": "/profile/Wazir-Khan-38"
                },
                {
                    "user_id": "Jerifa Sabnam",
                    "user_href": "/profile/Jerifa-Sabnam"
                },
                {
                    "user_id": "Areej Ahmad",
                    "user_href": "/profile/Areej-Ahmad-1"
                }
            ]
        }
    ]
}