{
    "title": "Why did America help rebuild Japan after the war? - Quora",
    "tags": [
        "Japan–United States Relations",
        "Military History and Wars of Japan",
        "History of Japan",
        "Japan in World War II",
        "Military History of the United States of America",
        "Japan",
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Quinn",
                "href": "/profile/Patrick-Quinn-79"
            },
            "answer_text": "My old man was a signalman on one of the Navy ship that arrived in Japan in shortly after the surrender in 1945. (I think he was on an oiler, and that he berthed in Osaka.) For the rest of his life he remained awestruck by the degree to which the Japanese civil population demonstrated utter commitment to their government’s war effort, depriving themselves of fuel, food and clothing to support their men in the field. By the end they were living with irregular access to potable water and had to limit bathing and washing. Pop once described to me how the population of the city in which he was docked was suffering from a vermin infestation because of the ghastly hygiene situation, and shortly after the Americans arrived Pop and his shipmates found themselves rigging fire hoses from tanks full of industrial disinfectants to spray down large numbers of the civilian population, who arrived for the process in large, self-organized groups. The US occupation fixed the water supply issue and started concerted efforts to get everyone fed properly, and by the time Pop made it back to Chicago he’d acquired a nontrivial admiration for the Japanese people and their country and their culture. The contrast between the titanic sacrifices of the people of japan and the superficial “Ain’t we got FUN!” tenor of civilian wartime America made a deep impression on him, and on a couple of occasions he I heard him refer to the Japanese people as “heroic,” on the basis of his experience with them immediately after the war. I think he that saw the US reconstruction efforts in the country, beginning mere weeks after we dropped a pair atom bombs on them, as one of the absolute peaks of America-as-America, the Shining City on the Hill, and I think had he lived another 10 years he would likely have bought himself a Toyota. So yeah, the US, having conquered a largely dysfunctional state, indeed helped it put itself back together again. ",
            "date": "Answered April 9, 2020",
            "views": "212",
            "upvotes": " View 138 Upvoters ",
            "upvoters": [
                {
                    "user_id": "D Zuskin",
                    "user_href": "/profile/D-Zuskin"
                },
                {
                    "user_id": "Doug Clements",
                    "user_href": "/profile/Doug-Clements-6"
                },
                {
                    "user_id": "Allert Brown-Gort",
                    "user_href": "/profile/Allert-Brown-Gort"
                },
                {
                    "user_id": "Peter David Crawford",
                    "user_href": "/profile/Peter-David-Crawford"
                },
                {
                    "user_id": "Chuck Curtis",
                    "user_href": "/profile/Chuck-Curtis-4"
                },
                {
                    "user_id": "James Terlemezian",
                    "user_href": "/profile/James-Terlemezian"
                },
                {
                    "user_id": "Donald Mccabe",
                    "user_href": "/profile/Donald-Mccabe"
                },
                {
                    "user_id": "Ralph Garcia",
                    "user_href": "/profile/Ralph-Garcia-80"
                },
                {
                    "user_id": "Brian Cody",
                    "user_href": "/profile/Brian-Cody-14"
                },
                {
                    "user_id": "Mark Jaeger",
                    "user_href": "/profile/Mark-Jaeger-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Schubert",
                "href": "/profile/Timothy-Schubert-2"
            },
            "answer_text": "The reason was very logical. The U.S. had just won a devastating victory over a fanatical foe. In most of history, when a country utterly defeats their foe, they kill all of them, or kill the men and enslave the women and children. When the Romans beat their foes, they were known to not only destroy their cities, but to sow the ground with salt so that nothing could ever grow there again. The U.S. was not and is NEVER a hegemonic power. We decided that since we never wanted to fight a war like that again, we would rebuild our recent enemies and not just make them friends, but weave them and their economies into the world economy and defense systems in such a way that it would never be in their best interests to start another war with us, or our allies. It was both magnanimity and self interest. The U.S. also spent billions to rebuild our allies after WWII. The Marshall Plan was, again, not just magnanimous. We wanted our friends to be strong enough to help carry the burden of keeping the peace. After we, and our allies fought Germany twice in 30 years, we have had 75 years of peace with them. Japan has not been involved in any wars either. I think that the idea worked out great. While we are still rivals, it is all economic and cultural rivalry. ",
            "date": "Answered October 2, 2020",
            "views": "93",
            "upvotes": " View 102 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Cavazos",
                    "user_href": "/profile/Jeff-Cavazos-1"
                },
                {
                    "user_id": "Peggy Olivares",
                    "user_href": "/profile/Peggy-Olivares"
                },
                {
                    "user_id": "Jeongdoo Kim",
                    "user_href": "/profile/Jeongdoo-Kim"
                },
                {
                    "user_id": "Ross Firestone",
                    "user_href": "/profile/Ross-Firestone"
                },
                {
                    "user_id": "David Kaplan",
                    "user_href": "/profile/David-Kaplan-142"
                },
                {
                    "user_id": "Robert Taylor",
                    "user_href": "/profile/Robert-Taylor-661"
                },
                {
                    "user_id": "Gerry Robinson",
                    "user_href": "/profile/Gerry-Robinson-2"
                },
                {
                    "user_id": "Hercules Wasserman",
                    "user_href": "/profile/Hercules-Wasserman"
                },
                {
                    "user_id": "Daniel Baker",
                    "user_href": "/profile/Daniel-Baker-32"
                },
                {
                    "user_id": "Nate Kaufman",
                    "user_href": "/profile/Nate-Kaufman-6"
                }
            ]
        }
    ]
}