{
    "title": "Why do some people believe that the Ancient Greek and Romans were black when they were certainly white? - Quora",
    "tags": [
        "Ancient Greece",
        "Ancient Rome"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trey San",
                "href": "/profile/Trey-San"
            },
            "answer_text": "Wait….what? Really? People actually believe that? Wow. Interesting. Well I think I can provide some perspective on this coming from a black man. First off we need to establish something. During ancient times and even up until early modern times, the concept of race did not exist nor did it play a major role. To the greeks, romans, egyptians, ethiopians, indians, and so on; you were either part of their society within the state/kingdom/empire boarders, or you were a barbarian which is equivalent to being called a foreigner. This applied to everyone regardless of race. Now with the romans and greeks; would we consider them white today? That and many other things but again, if you were a citizen of Rome or Greece, you were a Roman or Greek. It is possible some Romans and some Greeks were what we would consider black in todays world. But all Romans and Greeks were black? No. I think those who believe in such information and who are black do so because they do not understand history let alone the history of any of the kingdoms of Africa. Thus, these people look for something to claim as part of their history and ancestral history. Now I would not blame them too much since in the US unless you are majoring in African/African American history, you will not know much about the history of Africa aside from Egypt. Just off the top I know about the kingdoms Ghana, Mali, Songhai, Axum, Zanzibar, the Swahili coastal kingdoms, Zulu Kingdoms, the Ashanti tribe and so on. So much history there that a black person would have no need to say or think the Romans and Greeks were black. How do I know about this? Did some self research. And that is key; the information is there and all people have to do is research the history of African kingdoms and with the ease of access of information today, there is no excuse. ",
            "date": "Answered July 16, 2018",
            "views": "29",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duncan de Leeuw",
                    "user_href": "/profile/Duncan-de-Leeuw"
                },
                {
                    "user_id": "Jami Sundvall",
                    "user_href": "/profile/Jami-Sundvall"
                },
                {
                    "user_id": "Jean Amoun",
                    "user_href": "/profile/Jean-Amoun"
                },
                {
                    "user_id": "Tina Ftika",
                    "user_href": "/profile/Tina-Ftika"
                },
                {
                    "user_id": "Michael Craig-Grubbs",
                    "user_href": "/profile/Michael-Craig-Grubbs"
                },
                {
                    "user_id": "Justin Hoskins",
                    "user_href": "/profile/Justin-Hoskins-8"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Drad-D-Vinotn"
                },
                {
                    "user_id": "Corey Crawford",
                    "user_href": "/profile/Corey-Crawford-48"
                },
                {
                    "user_id": "Josef Levi",
                    "user_href": "/profile/Josef-Levi"
                },
                {
                    "user_id": "Tiffany Tiffany",
                    "user_href": "/profile/Tiffany-Tiffany-131"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rudi Mina",
                "href": "/profile/Rudi-Mina"
            },
            "answer_text": "That is not what is being said. What is being said is that there was African presence amongst Greeks and Romans.  THE BLACK ROMANS WE ARE TALKING ABOUT WERE THE SAHARA-SAHEL LIKE AFRICANS, GARAMANTES! The Kanuri people of Bornu originated from the Tibu or Teda Negroids of Kanem, and of the Eastern Sahara. These Tibu were perhaps the Garamantes of Roman geographers. Their range in ancient times extended from Fezzan to Lake Chad.' --Johnston, Harry Hamilton, Sir, 1858-1927. 'A survey of the ethnography of Africa, and the former racial and tribal migrations in that continent' One of the richest inhabitants of fourth century Roman York, buried in a stone sarcophagus with luxury imports including jewellery made of elephant ivory, a mirror and a blue glass perfume jar, was a woman of black African ancestry, a re-examination of her skeleton has shown. African origin of Roman York's rich lady with the ivory bangle A common misconception is that the Romans in Britain were all born in Italy, had white skin, and spoke Latin. Not so: ever since the Emperor Claudius' multiethnic Roman army landed at Richborough in Kent in ad 43, there has been a black African presence in Britain (Britannia). Two types of Africans came to Britain: those who were Roman citizens, from African families of the ruling classes who had embraced Romanization (the acceptance of Latin and Roman culture), and those who did not necessarily have a choice, such as slaves and soldiers mustered in one of the Roman provinces in Africa. 1. Evidence [...] 2. Highranking officials [...] 3. Soldiers [...] --The Oxford Companion to Black British History Edited by David Dabydeen, John Gilmore, and Cecily Jones Roman Britain - Oxford Reference \"The findings challenge a view dating back to Roman accounts that the Garamantes consisted of barbaric nomads and troublemakers on the edge of the Roman Empire.' Castles of 'Lost Cities' Revealed in Libyan Desert \"In the Sahara, population agglomeration is also evident in certain areas such as the Libyan Fezzan, which (albeit much later) also saw the emergence of an indigenous Saharan “civilization” in the form of the Garamantian Tribal Confederaion, the development of which has been described explicitly in terms of adaptation to increased aridity (Brooks, 2006; di Lernia et al., 2002; Mattingly et al., 2003).\" --Nick Brooks (2013): Beyond collapse: climate change and causality during the Middle Holocene Climatic Transition, 6400–5000 years before present, Geografisk Tidsskrift-Danish Journal of Geography, 112:2, 93-104 “Our work developed from a programme of research focused on an early Saharan civilisation known as the Garamantes, located in southwestern Libya (Mattingly 2006, 2011). We have previously identified two Garamantian sites as having urban characteristics, Old Jarma and Qasṛ ash-Sharrāba, and have speculated on the existence of further Saharan towns (Mattingly and Sterry 2013). In the case of Jarma, we have presented a detailed urban biography of the site (Mattingly et al. 2013: 505–544). The specific aims of this paper are to provide a fuller evaluation of what is known historically about Zuwīla and to present in detail the available archaeological data and a more precise chronology for the site. In its final section we advance a plausible sequence of development of this important Saharan oasis centre based on all the currently available evidence. A gazetteer of archaeological monuments is provided as Appendix 1 and a summary of the material dating evidence as Appendix 2. The early medieval period has generally been considered pivotal in the extension and intensification of trans-Saharan trade and this has also been linked with the spread of Islam from the Maghrib across the Sahara (Austen 2010: 19–22). On the southern fringes of the Sahara there is firm evidence of trans-Saharan contacts in the earlier first millennium AD at sites such as Kissi in Burkina Faso and Culabel and Siouré in Senegal (MacDonald 2011; Magnavita 2013). [...] The Roman sources refer to kings of the Garamantes and to their metropolis at Garama (Old Jarma in the Wādī al-Ajāl, 250 km to the west of Zuwīla), strongly suggesting that Garamantian power was exercised over an extensive area (Figure 2). We have argued that there was in this period a Garamantian state that controlled the various oasis zones of Fazzān (Mattingly 2003: 76–90, 346–351, 2013: 530–534). As we shall see, there is evidence to show that Zuwīla originated as an oasis settlement in this period (contra Lewicki 1988: 287 and Levtzion and Hopkins 2000: 460) and that it had arguably grown to be a centre of above average size by the Late Garamantian period.” --David J. Mattingly, Martin J. Sterry & David N. Edwards (2015) The origins and development of Zuwīla, Libyan Sahara: an archaeological and historical overview of an ancient oasis town and caravan centre, Azania: Archaeological Research in Africa, 50:1, 27-75, DOI: 10.1080/0067270X.2014.980126 ",
            "date": "Updated September 11, 2018",
            "views": "25",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isaiah Jackson",
                    "user_href": "/profile/Isaiah-Jackson-28"
                },
                {
                    "user_id": "Asabi E Goodman",
                    "user_href": "/profile/Asabi-E-Goodman"
                },
                {
                    "user_id": "Kari Bradley",
                    "user_href": "/profile/Kari-Bradley-16"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Drad-D-Vinotn"
                },
                {
                    "user_id": "Khadi King",
                    "user_href": "/profile/Khadi-King"
                },
                {
                    "user_id": "Daniel Aldridge",
                    "user_href": "/profile/Daniel-Aldridge-8"
                },
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                }
            ]
        }
    ]
}