{
    "title": "Why were there so many Slavic tribes in Ancient Greece? Is it because they were living so near to each other? - Quora",
    "tags": [
        "Slavs (Ethnolinguistic group)",
        "Tribalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Łukasz Rzepiński",
                "href": "/profile/Łukasz-Rzepiński"
            },
            "answer_text": "Not in ancient but medieval Greece. Slavs appeared in the area during rule of Byzantyne empire. I am in process of writing book about Slavic invasions of Byzantyne empire. I took a look into my notes at here is the timeline: First Slavic raid against Byzantyne territory but not Greece itself is noted in year 518. Then Slavs are unnoticed but they slowly progress towards Danube. In 536 Byzantyne empire hires Slavic cavalry mercenaries. In 540 Byzantyne empire settles one tribe of Slavs at Danube fortress in order to protect from other Slavic tribes. It didn’t help much, in 540 Slavic raid reaches walls of Constantinople. In 548 Slavic raids already reach Greece itself - Slavs by suprise attack destroy coastal city of Topirus at Aegean Sea and 550 Slavic army marches towards Thesalloniki although meeting Byzantyne regular army turns West and plunders Illirycum . 551 Byzantyne empire is in trouble - epidemy in big cities and besides Slavs Goths raided and destroyed imperial army at Adrianopolis just next to capital. In 558 additionally nomadic tribe of Kutigurs raid Byzantyne territory … so many barbarians. In 567 another nomadic tribe which possesed outstanding warfare skills - Avars appeared in scene and at first conqured Slavs in Pannonia and propably Valakhia near Danube. But it did not put Slavic raid to end. It made it even worse because now Avars will regularly send Slavs against Byzantyne empire. Now comes chapter Great Slavic Invasion (574–626). In 574 Avars open gate to Byzantium by seizing Sirmum stronghold in Danube. In next years enormous numbers of Slavs penetrated into Balkans. In 578 “100,000” Slavs plunder Thrace. There were some conflicts between Slavs and Avars - apparently some Slavs were Avar subject but some not. They had some clashes in Byzantyne territory. In 580 Slavs plunder region of Thesalloniki. In addition Byzantium finds itself in war against Persia. Already in 587 Slavs entered Peloponessus and settled there as chronicle of Monamesia described. Greeks fortified in Eastern Peloponesus or were evacuated to Italy. In 591 Byzantynes organize counteroffensive and destroy Slavs there and push far into nowadays Serbia. 610–617 however new Slavic invasion - they destroy city of Serdika and capture by a trick (changing clothes into Roman uniforms) big city of Salona - capital of Illirycum in nowadays Croatia. That was big blow for Byzantynes because it was 2nd or 3rd city in the empire. In 618 Slavs organize first siege of Thesalloniki (there were later many of them but none succeeded) In 626 together with Avars and Persians attack Constantinople. It fails and causes conflict between Slavs and Avars - some Slavs overthrow their rule. In this time first Slavic kings appear: Samo in Moravia and Valuk in Carintia. Slavs now raid western territories like Turingia in 633 or Italy in 642. Anyway in 650 situation is that Greeks keep some fortified coastal cities, hide in mountains and keep Eastern Peloponesus. In the whole Greece Slavs are rampaging and settling. Greeks were evacuated to Sicily, Calabria, Creta (they will return 2 generations later). Since 658 there is big stalemate. Both sides take some offensive actions - Slavs siege Thesalloniki many times while Byzantynes organized some raids to reconquer some territories. There were many evens later but since 670 - 800 Byzantynes are in offensive. Slavs get resettled, conscripted or naturalized. For example in 799 there is Slavic “archont” in Greece. In this time there is also Byzantyne Slavic general who to empire’s doom caused massive civil war: Thomas the Slav - Wikipedia In 805 Slavinia in Peloponesus is destroyed and Slavs become subjects of the empire. In 837 there is metioned Slavic uprising near Thesalloniki. In 842 in Peloponesus. Some 880+ christianization of Slavs in Peloponesus. In year 900 Greece is Greek again - but Slavs are still there just subjects of empire. In 940 again Slavs revolt in Peloponesus. Last Slavs in Greece are metioned in 1293 when last Slavic tribe gets conquered by Crusaders. ",
            "date": "Answered October 9, 2020",
            "views": "404",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andreas labros",
                    "user_href": "/profile/Andreas-labros"
                },
                {
                    "user_id": "Dimitris Dervenis",
                    "user_href": "/profile/Dimitris-Dervenis"
                },
                {
                    "user_id": "Sofia Nipenthes",
                    "user_href": "/profile/Sofia-Nipenthes"
                },
                {
                    "user_id": "Vagelis Vandoros",
                    "user_href": "/profile/Vagelis-Vandoros"
                },
                {
                    "user_id": "Demetrios Kosmas",
                    "user_href": "/profile/Demetrios-Kosmas"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Tomislav Popovych",
                    "user_href": "/profile/Tomislav-Popovych"
                },
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Almendra",
                "href": "/profile/Jason-Almendra"
            },
            "answer_text": "Ancient Greece was the period before the Edict of Thessalonika in 380AD. Before that year there were Olympic Games, the Oracle at Delphi made prophecies, orgies were held during Bacchanalia, etc. After that year it was only Jesus 24/7. The Avars split off from the Rouran Khaganate and invaded the west. They conquered the Slavs before 600AD. And they goaded them into invading Europe. The Avars settled in Pannonia.  ",
            "date": "Answered October 5, 2020",
            "views": "38",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandros Megas",
                    "user_href": "/profile/Alexandros-Megas-1"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                },
                {
                    "user_id": "Peter Skordilis",
                    "user_href": "/profile/Peter-Skordilis"
                },
                {
                    "user_id": "Daryl Holcomb",
                    "user_href": "/profile/Daryl-Holcomb"
                },
                {
                    "user_id": "Radosław Chwiszczuk",
                    "user_href": "/profile/Radosław-Chwiszczuk-1"
                },
                {
                    "user_id": "Edward Kayukov",
                    "user_href": "/profile/Edward-Kayukov"
                },
                {
                    "user_id": "Alan Sanchez",
                    "user_href": "/profile/Alan-Sanchez-28"
                },
                {
                    "user_id": "Andrea Curti",
                    "user_href": "/profile/Andrea-Curti-2"
                },
                {
                    "user_id": "Paulo Goncalves",
                    "user_href": "/profile/Paulo-Goncalves-8"
                },
                {
                    "user_id": "Gia Dinh Hang",
                    "user_href": "/profile/Gia-Dinh-Hang"
                }
            ]
        }
    ]
}