{
    "title": "Why are politicians allowed to rewrite history every time they open their mouths? - Quora",
    "tags": [
        "Mouths",
        "Talking",
        "Manners and Etiquette",
        "Politicians and Government Leaders",
        "Philosophy",
        "Government",
        "Politics",
        "History",
        "Politics of the United States of America",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Mitchell",
                "href": "/profile/Michael-Mitchell-116"
            },
            "answer_text": "Because people are generally stupid and lazy. It’s easier to believe whatever you hear, or are told by authority, than to question or verify it. There’s also a phenomenon called confirmation bias where people tend to believe statements that support or confirm what they already believe to be true, whether that belief is supported by facts or not. Much of what we are taught is American history is, in fact, a rewrite of the events to glorify what the authors believe is important and completely disregard or ignore actual, but less complimentary facts. A great example of this is the Confederate “Noble Cause” of states rights as the leading cause of the Civil War. While it’s narrowly true that states rights was a significant contributor to the secession of the confederate states from the Union, generally unstated or unspecified, was that the only state right under dispute was the right of the dominant race to own people of a different race. ",
            "date": "Answered June 2, 2020",
            "views": "48",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Chaplan",
                    "user_href": "/profile/Michael-Chaplan-1"
                },
                {
                    "user_id": "Michael Douglas",
                    "user_href": "/profile/Michael-Douglas-337"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Douglas",
                "href": "/profile/Michael-Douglas-337"
            },
            "answer_text": "Because the media refuses to hold them accountable, anf most voters can't remember what they had for breakfast. More people need to call them what they are-- lies. We should not be surprised. We let Walter Cronkite lies about Tet and Vietnam in general, Dan Rather lie about Vietnam and Bush, 60 Minutes lie about GM trucks catching fire, Ronald Reagan let Sam Donaldson promote rudeness and not being held accountable. Why would politicians not think they could get away with it, too. ",
            "date": "Updated June 30, 2020",
            "views": "27",
            "upvotes": " Answer requested by Lawson Shepherd"
        }
    ]
}