{
    "title": "Why do people care so much about looks? - Quora",
    "tags": [
        "Physical Appearances of People",
        "Social Psychology",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Rimmer",
                "href": "/profile/Matt-Rimmer-6"
            },
            "answer_text": "I have insight into this question. I was never one of the beautiful people as a child. In fact my appearance was the standard butt of most jokes. I was likened to the Elephant Man. Good times. Add glasses and buck teeth and I'm sure you're starting to get the idea. Time has proved to me that I am far from the only person to have experienced this. [Time has also been kind in that I look a LOT better now than I did back then. Maybe I was just designed to be older?] Fairly early on, I learned to own my uniqueness. I almost derived pleasure from other people's unsolicited vocal disgust and I got quite good at eliciting negative comments from people when they didn't realise I was surrounded by my friends. I had a pretty quick wit. It made the insulter just look like a total dick. When I went to college I noticed not many people had long hair and big beards so I cultivated me far too much hair. I don't like to fit in 100%. That would be boring. I went about the game which is called life for something like 10 years with 3-4 feet of horrible frizzy hair and a great big bushy beard. I was having fun (but hair is heavier than you might think and there were times when I got a sore neck). I found myself in a situation where a friend needed to raise money for charity and I was persuaded to undergo a sponsored hair and beard chop. Beard off, number 2 clippers to shear the hair off. Wow, my head felt like it weighed nothing (and I kept trying to push my hair out of my face even though it wasn't there any more). I thought nothing more of it until a few days later when I went to do some shopping at the local supermarket. Everything was normal until I got to the checkout. Things unfolded quite differently. I wasn't sure what was \"off\" at first, but something was wrong. While waiting for the customers in front of me to be served I had lazily cast my eye over the other checkouts to see if a different one might have a shorter queue. That's when I realised what was odd: people were looking at me with a different expression on their faces than I had become accustomed to. One of the checkout assistants actually made eye contact and didn't immediately look away as if scared of me. She even smiled and then went back to her job as if everything was okay! People will judge you for your appearance. If you look \"normal\" people tend to assume you're \"normal\". Life is easier or harder depending whether your face fits. We care about our opinion because it directly affects how people* interact with us. There is a payoff for spending time on your appearance. I've tried a similar \"experiment\" since with facial hair and, while some people still react negatively, the effect is nowhere near as pronounced as the difference between a messy mop and a tidy \"do\". I've also caught myself being guilty of similar visual judgement. I'm confident it's a \"thing\". *meaning people who don't already know you, and have nothing more to go on than your appearance. ",
            "date": "Answered August 1, 2019",
            "views": "54",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marco Rossi",
                    "user_href": "/profile/Marco-Rossi-407"
                },
                {
                    "user_id": "MudKiss",
                    "user_href": "/profile/MudKiss"
                },
                {
                    "user_id": "The Red Paladin",
                    "user_href": "/profile/The-Red-Paladin-2"
                },
                {
                    "user_id": "Maryan Ahmed",
                    "user_href": "/profile/Maryan-Ahmed-14"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-876"
                },
                {
                    "user_id": "Jan Follner",
                    "user_href": "/profile/Jan-Follner"
                },
                {
                    "user_id": "Emily Kamberov",
                    "user_href": "/profile/Emily-Kamberov"
                },
                {
                    "user_id": "Liliana Pearl",
                    "user_href": "/profile/Liliana-Pearl"
                },
                {
                    "user_id": "Denise Hiknee",
                    "user_href": "/profile/Denise-Hiknee"
                },
                {
                    "user_id": "Julie Mills",
                    "user_href": "/profile/Julie-Mills-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Lunsford",
                "href": "/profile/Richard-Lunsford-5"
            },
            "answer_text": "It’s the most readily observable at a distance, quickly scannable source of preliminary info. about a person. At a glance (American perspective): 1.) Male or female, young/old/middle-aged, ethnicity, obese vs. normal weight vs. obviously fit & toned looking. Very symmetric facial features suggest good immune system function and are regarded as attractive by opposite sex. Similar, a particular hips/waist ratio in females tends to be instinctively more attractive to males. 2.) Trudging along vs. bold, confident walk; good vs. poor posture. Facial expression also suggestive. 3.) Clothing neat, stylish and clean, vs. very casual, in disrepair and dirty (and shades of gray in between). 4.) Does the person deliberately make a ‘statement’ via attire of accessories - a Cross, a MAGA hat, a pink ‘breast cancer awareness’ item, something about the environment or abortion, I even saw some luggage on a cruise with something labeled ‘Obama victory cruise’ years ago. Some people want you to know what ‘tribe’ they belong to (e.g.: Christian, conservative, liberal, environmentalist, etc…). Some clothing tells you what that person does for a living (broadly speaking - scrubs, Police uniform, et…) or notifies you this person is a Veteran. 5.) And then there are all those bumper stickers. Hey, your kid is an honor student! Yep, we all needed to know that ;) ! And you feel for the plight of POW/MIA’s. And the ever upbeat ‘If you can’t feed’em, don’t breed’em.’ So whether you’re shopping for a mate, watching for danger (e.g.: avoid eye contact with the obvious gang members), looking for someone who looks approachable to ask directions, after a type of person for a task or what-have-you, appearances matter. ",
            "date": "Answered July 21, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}