{
    "title": "Why are video games so addictive? - Quora",
    "tags": [
        "Game Addiction",
        "Addictions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Laitman",
                "href": "/profile/Michael-Laitman-4"
            },
            "answer_text": "It’s not only the act of playing the games themselves that makes video games so addictive. Behind the scenes is a massive industry inventing, producing, marketing and investing in the games and their accessories, i.e. many people seeking to maximize their profits. And when profit motives become entangled in the phenomenon, then a lot of effort goes into, on one hand, contacting governments and finding ways to encourage the enjoyment of video games, and on the other hand, optimizing the games themselves and the world of accessories and imagery surrounding the games to keep people playing. Gaming addiction has been classified as a mental health condition by the World Health Organization (WHO). According to the WHO, gaming disorder is characterized by a lack of control over gaming, and gaming taking higher priority over other interests and daily activities, impairing the gamer’s personal, family, social, educational or occupational functioning. I saw this problem firsthand about 30 years ago when one of my friends, a man in his 40s, became addicted to computer games. The game he was playing back then took over his life. Each day, from morning to night, he was completely focused on improving his performance, thinking about how to get more soldiers and weapons for the game he had become addicted to. The climax came when he went bankrupt. Since then, multiple similar examples of gaming addiction have made the problem apparent to many more people. The major setback is that these people are mostly children and youth. They can easily slip away from reality into video games. This becomes especially disappointing considering that video game addiction can wane certain aspects of their mental and emotional development, as well as cause mental illness and damage to their personality. The raised awareness of gaming disorder and the potential of video games to deteriorate people’s development is one thing, but what could be done to improve such a state of affairs? The following are four steps I propose to cure gaming addiction: 1. Restrict access to video games. The authorities who permit addictive video games to flood the market can be requested to restrict access to them, or at least, to sites that make them available. Although this seems unrealistic, especially since these same authorities also make a significant profit from the industry, it’s still doable. The clear example is with countries that restrict free access to the Internet for various reasons. 2. Detach a person from video games. This is the most effective detoxification. We humans are egoistic, pleasure-seeking creatures by nature, and we will always seek new ways to enjoy in different areas of interest. 3. Create parallel educational games or integrate educational aspects into existing games. Instead of leading the protagonist into struggles and victories over other players—fueling players with pride, which attracts them to keep playing—channel the players’ success in the direction of constructive social values. The question is, who will raise such an initiative? 4. Education. Learning tools and programs that focus on strengthening and improving what’s most important in life: meaningful human connections. Such tools should help people navigate through all kinds of interferences to achieve connection, including the wild deluge of virtual products incessantly popping up on our screens. If such education is done successfully, the next generation will know how to manage stable relationships and create positive connections in wider social circles. The fourth step is definitely the most significant and overriding one. That is, only when our social environment is filled with more meaningful connections, when we will feel that we are genuinely important to each other, like in a family, will we have the means to raise happy and confident human beings. Then, we will no longer seek an escape from reality. Instead, we will seek a deeper entrance into this reality, and will invest our inventive, productive, playful, and promotional powers into constructing this supportive environment that will prevent any mental illness and impaired development. ",
            "date": "Answered July 3, 2019",
            "views": "28",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arie Priyambadha",
                    "user_href": "/profile/Arie-Priyambadha"
                },
                {
                    "user_id": "Prashant Dwivedi",
                    "user_href": "/profile/Prashant-Dwivedi-139"
                },
                {
                    "user_id": "Olga Holon",
                    "user_href": "/profile/Olga-Holon"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/R-I-Shantho"
                },
                {
                    "user_id": "Abhi Irina",
                    "user_href": "/profile/Abhi-Irina"
                },
                {
                    "user_id": "Vishnubharathi",
                    "user_href": "/profile/Vishnubharathi"
                },
                {
                    "user_id": "Freedom X",
                    "user_href": "/profile/Freedom-X-1"
                },
                {
                    "user_id": "Andrew Mello",
                    "user_href": "/profile/Andrew-Mello-3"
                },
                {
                    "user_id": "DDPlayer",
                    "user_href": "/profile/DDPlayer"
                },
                {
                    "user_id": "Elle Lynn",
                    "user_href": "/profile/Elle-Lynn-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiara Owens",
                "href": "/profile/Kiara-Owens-15"
            },
            "answer_text": "The addiction in video games is often related to completing a mission or beating a high score or preset standard. The other type of video game addiction is associated with online multiplayer games. These games are played online with other people & are especially addictive because they generally have no ending. Video games are addictive in nature. A video game becomes more addictive when it doesn't have any pre-defined ends. This is one of the central features of a MMORPG, but it is also becoming true for many other genres as well. The most addictive video games have no ultimate goal or point at which a player can say \"I'm finished. I have completed every quest, there is nothing new to discover\". As such, there is never the experience of \"Game Over\". Addictive video games feed a need of making social connections. While video games used to be solitary activities, today's games encourage, and in many ways, require that players interact socially with each other - which feeds the universal human need for interpersonal connections. Interestingly, these connections can come at the expense of real-world relationships. Video games are more addictive when it offer rewards on a multi leveling system. When starting a new video game a player's character begins with very basic attributes with regard to experience, strength, intelligence, courage, powers, etc. Initially, it takes very little play (perhaps minutes) to reach the next level and gain new skills - this is immediately rewarding and reinforces continued play. However, each successive level begins to take more play time to reach eventually taking weeks or months to level-up. By this time, however, the gamer has gradually adapted and accepted the greater effort required to reach the next level. Imagine if the very first levels (such as, from Level 1 to Level 2) took 1 month rather than several minutes - how many players would find this rewarding enough to continue! There are some video games that often encourage play and collaboration with gamers worldwide. This is true of online multiplayer video games in general. The fact that two users on opposite sides of the world can interact and join together in a common quest adds to the excitement and exploratory nature of modern games. Addictive video games often have some form of game currency. The same goals and emotions which drive people to pursue wealth in the real world are also present in video games. As one achieves more virtual wealth (by spending more time playing and completing tasks), the virtual wealth translates into greater power, control, respect, influence, status, and purchasing power - which are obviously very seductive pursuits. It is easier to view video games as harmless online activities. Whereas there is far greater awareness of the dangers of alcohol abuse or gambling addiction, online gaming is generally seen as a harmless hobby. Is it less harmful than alcohol addiction? Absolutely. Can most people play without becoming addicted? Sure. However, because of this, it is also more difficult for players to recognize when they have a problem. One important factor that makes video games addictive is that rewards often are set on variable schedules. It has been consistently demonstrated in psychological research that variable ratio or variable interval schedules (reinforced after an average time period has elapsed) produces a steady rate of responding and which is far more difficult to extinguish (such as, slot machines use variable ratio schedules to encourage maximum play time). In an addictive video game, a player may be rewarded on average for every five (for example) tasks completed. Sometimes it will take only one try while other times it may take 15, the player never really knows how long it will take before the big reward comes, but he knows that if he plays long enough it will come eventually. This type of reward schedule encourages longer periods of play even in the absence of rewards. For a more detailed analysis of the ways people respond to different patterns of in-game rewards, see the article Behavioral Game Design. ",
            "date": "Answered January 8, 2018",
            "views": "115",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joshua Toluwani",
                    "user_href": "/profile/Joshua-Toluwani-1"
                },
                {
                    "user_id": "Thiện Nguyễn",
                    "user_href": "/profile/Thiện-Nguyễn-23"
                },
                {
                    "user_id": "Tjay Olagz",
                    "user_href": "/profile/Tjay-Olagz"
                },
                {
                    "user_id": "Gintaras Juozapavičius",
                    "user_href": "/profile/Gintaras-Juozapavičius"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/D-Varma"
                },
                {
                    "user_id": "Valentin Eni",
                    "user_href": "/profile/Valentin-Eni"
                },
                {
                    "user_id": "James Hickenson",
                    "user_href": "/profile/James-Hickenson"
                },
                {
                    "user_id": "Abdalrhman Rafik",
                    "user_href": "/profile/Abdalrhman-Rafik"
                },
                {
                    "user_id": "Yusif Alizade",
                    "user_href": "/profile/Yusif-Alizade"
                },
                {
                    "user_id": "Nguyễn Thanh Phong",
                    "user_href": "/profile/Nguyễn-Thanh-Phong-6"
                }
            ]
        }
    ]
}