{
    "title": "Why does Joseph Stalin’s war crimes get ignored and Adolf Hitler's don’t? Stalin ethnically cleansed groups of people and starved his own people. - Quora",
    "tags": [
        "Joseph Stalin",
        "Adolf Hitler",
        "Nazi Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nuno Ferreira",
                "href": "/profile/Nuno-Ferreira-69"
            },
            "answer_text": "I don’t think Stalin’s crimes are ignored at all. Actually there’s extensive academic literature about his “reign”, some exclusively dedicated to the atrocities he ordered, such as, for example, the Holodomor or the great purges. One of the first reliable reports is Solzhenitsyn’s The Gulag Archipelago. The subject remained a taboo in the West and in soviet circles almost until the downfall of the regime. The way I see it, it was similar to the case of North Korea nowadays. Everyone knows what’s going on in there, but we will only get to know accurately when the regime crumbles. Although Stalin was indeed an anti-semite (this can be confirmed in several of his declarations) the state repression policies never really established prosecution based on ethnicity, not during Stalin’s era, nor before, or after. For example, one could be arrested for disapproval of the nature of the regime, or pretty much for disagreeing with anything, but this would not be based on a racial or ethnical criteria. One’s offspring would not be denied the right of existing for being part of a ethnic group. Quite the contrary, it was common for the regime to “reeducate” children of convicted “traitors” of the regime. Children were taken in and molded to become “children of the regime”. The idea was to promote denunciation of “illicit practices”, like children denouncing their parents and so on (Pavlik Morozov’s case, probably fabricated by the regime, and other similar ones). Basically, the soviet regime stated “if you think this way and disagree with us, you do not have the right to live because you’re a traitor. You must die because of your beliefs and actions”. Comparing with Hitler’s nazi regime, one would be condemned for belonging to a certain race of ethnic group (adding also the dimention of politically disagreeing with the regime). Something one couldn’t really control or choose for is part of one’s self by nature. Children of those deemed to die would have the same fate as their parents because that specific race or ethnicity does not have the right of existing (unless the race in question was “the master race”, in that case one could have that privilege). Basically, the nazi regime stated “if you belong to this race or ethnicity you don’t have the right to live. In fact, you shouldn’t even been born, because you don’t belong to the human species. You’re a demi-human, you’re inferior, you’re a nature mislapse” (look up the Nuremberg Laws 1935). It goes beyond one’s beliefs. Both brutal totalitarian regimes, although ultimately different in nature. When it comes to being “ignored” I believe that is entirely wrong. To study one phenomenon doesn’t mean ignoring all the others. That is like saying “if you study the romans that means you’re ignoring the greeks”. That is a bogus attempt to politicize the subject. This is not about politics is about history. ",
            "date": "Answered November 19, 2017",
            "views": "13",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aline Wolffenberg",
                    "user_href": "/profile/Aline-Wolffenberg-1"
                },
                {
                    "user_id": "Darrius Frazier",
                    "user_href": "/profile/Darrius-Frazier-3"
                },
                {
                    "user_id": "Anand Masti",
                    "user_href": "/profile/Anand-Masti"
                },
                {
                    "user_id": "Mark Brazas",
                    "user_href": "/profile/Mark-Brazas"
                },
                {
                    "user_id": "Art Fried",
                    "user_href": "/profile/Art-Fried"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Steven Setzer",
                    "user_href": "/profile/Steven-Setzer"
                },
                {
                    "user_id": "Gary Ka-Yinn Chan",
                    "user_href": "/profile/Gary-Ka-Yinn-Chan"
                },
                {
                    "user_id": "Susan Meier",
                    "user_href": "/profile/Susan-Meier-2"
                },
                {
                    "user_id": "Rebecca Rusco Oglesby",
                    "user_href": "/profile/Rebecca-Rusco-Oglesby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Huynhston",
                "href": "/profile/Tony-Huynhston"
            },
            "answer_text": "“One death is a tragedy, a million is statistic” Keep that sentiment in mind. During WWII, the atrocities of the Nazis were well documented and spread across the world. When it came to the USSR, such stories are few and far inbetween, and the Nazis certainly out did them in terms of how methodical their genocidal campaign was. The Soviet’s purge was ad hoc, dirty, and messy. People were dragged into the streets, shot and burried in mass graves. The Nazis on the other hand, had documented inhumane experiments, and did everything so methodical that it a lot of people find it unnerving. So that’s one reason why the Nazis receive more infamy than the Soviets. The next reason is how each portrayed themselves. The Nazis displayed themselves as the Ubermensche, destined to take over the world and usher in a natural order and eugenics. These things were blatantly pro-glory and anti-freedom, so obviously it’s not going to go down well with modern audiences. The Soviets on the other hand portrayed themselves as overthrowing the corrupt wealthy elite, and giving power “back” to the poor. The Soviet’s message was equality, no rich, no poor. It sounds like a utopia where everyone gets just what they need, and everyone works hard. Of course as we all know, a utopia is impossible. But humans in general are not logical creatures. Humans like emotions and stories, and the stories of the Soviets toppling the rich is far more palatable than the Nazi’s story of purging the Jews and creating a race of supermen. PragerU did a good video on this topic as well  ",
            "date": "Answered November 19, 2017",
            "views": "682",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anand Masti",
                    "user_href": "/profile/Anand-Masti"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dwana-Reese"
                },
                {
                    "user_id": "Amanda Brock",
                    "user_href": "/profile/Amanda-Brock-73"
                }
            ]
        }
    ]
}