{
    "title": "Why do Mongolian people look so much alike Koreans? - Quora",
    "tags": [
        "Mongolian Ethnicity and People",
        "Mongolia",
        "Korean Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Wong",
                "href": "/profile/Peter-Wong-180"
            },
            "answer_text": "It’s like saying why do Koreans look so much like Chinese and I can also say Kazakh look like Chinese. The Mongolians look like Tibetan, Chinese, Manchus and around 1% of Mongolian also look mix. It’s mostly Koreans who ask these questions due to the fact many Koreans want to associate themselves as genetically the same people as who once conquered half of the world (from East Asia, to Middle east and Europe) and these people we all know are Mongols/Mongolian. By having relation with them will not only prove they are strong people but also improve their ethnic heritage to the international world. They believe it would make more people find interesting in Korean culture, K-pop, K-drama. Many Korean people despite hating Japanese also wanted to claim Japanese since the Japanese are like the 2nd most successful people in the world in scientific innovation and have many world champion achievement and is a G7 nation. So Koreans want to look like the people who they think are the top dog of Asian ethnic group to give themselves more pride. WHAT THEY WANT FROM MONGOLIANS IS THIS….. had it not been for this Koreans will never care about wanting to be related with Mongolian.  However many Koreans really don’t care now since found their own pride I can read Korean hangul. I remember back than in 2010 I used to read the most inferiority complex comments from Korean chat forums where 99% of Koreans are super eager to claim relationships with Mongolians, or with this Altaic, Central Asia but surprisingly it gotten less every year. I think it’s mostly with the rise of K-pop, K-drama and being popular all over of the world that had made them less interest with being connected with central Asians. It’s true K-pop boyband like BTS is the world biggest boyband and you see like billions of female fan account from every country, race, ethnicity on the world who a crazy for K-pop boybands, and sexualizing K-pop boys everywhere from Twitter, Instagram, Tumblr. K-pop boyband are taking over all boyband in the world, nearly every fan. They now have more youtube views than even western boybands. Also Korean technology industry science is top 10 in the world, and their Korean innovation is among the best in the world too, also Samsung, Hyundai ect and Korean beating Germany in last years 2018 world cup gave them more boost in Korean pride. They wanted to be related with Mongolian and Central Asian because they know they are also Asians who conquered many continents but now knowing Central Asians and Mongols themselves are not popular in other countries many Koreans feel there’s no need to be related to them. The Koreans simply just wanted racial superiority and they wanted to be more interesting and appealing by claiming blood relations but now they realize they don’t need it from them since they realized that Mongolian/Central Asian celebs,media are not desired internationally so many Koreans feel they don’t need to related to them. They used to believe being related with central Asian empires would make them better.  ( KEEP IN MIND THE COMMENTS BELOW does not represent the vast majority of the Koreans comment. Most of them did not reply in such manner it’s just few or several crazy Korean nationalist ) Nowadays you will find comments like these (especially from Korean females ) “ Why do we claim relationship with Mongols ? They don’t even like us “ “ Like seriously who cares… is not like they have any famous actors, singers “ “ Well apart from history of empires nobody even cares about Central Asian or Mongols. Their celebrity don’t worth a dime and they also don’t have any pop cultural influences “ “ Who cares, we rarely hear anything from those people “ “ I rather Korean be related with Japanese “ “ They have many empires but so what ? all that empire but they still couldn’t capture the hearts of girls like K-pop idols. Their people are not popular anywhere. You see Kazakhs who eager for Russian girls attention but they all prefer K-pop, Korean actors “ “ K-pop get billions of views every year and K-drama is aired all over the world. We are clearly more popular than they will ever be “ “ We are better than them in sports, technology, ranking, in everything…. what they contributed to the world“ “ We are not related at all. Stop this propaganda. We already proven ourselves that we don’t need to be related with them at all “ BEFORE THE COMMENTS WOULD BE LIKE THESE ( Many discussion on genetics and eager relationships with people of Central Asia ) “ We have superior bloodlines. I’m proud to be part of the Altaic race ““ “ Is is true Koreans are not pure Mongols ? “ “ Aren’t we more like related with Manchus ? “ “ According to DNA studies our father DNA is mostly similar to Manchus and Chinese mainly haplogroup O but mother DNA are mostly similar to Mongolian and Siberian. We also have substantial Mongolian father DNA haplogroup C. All of it was formed since ancient times we are mixture of nomadic and agriculturist people. “ Haplogroups don’t mean anything. Koreans may have different Y-DNA haplogroups but we look similar because we are in North Asia so we adapted to northern environment. Look at Finns and Norwegian they have different Y-DNA but look almost the same. Kazakhs and Kyrgyz have different haplogroup yet both still look East Asian.“ “ We Koreans are pure Mongolians “ MONGOLIANS…. What do they look like ? They do look different but it’s very slight. They are only different to Koreans, Chinese, Japanese if you consider Russians different to Germans.    ",
            "date": "Updated January 19, 2019",
            "views": "26",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doritos",
                    "user_href": "/profile/Doritos-11"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Imogen-Lee-13"
                },
                {
                    "user_id": "Helga Hufflepuff",
                    "user_href": "/profile/Helga-Hufflepuff-9"
                },
                {
                    "user_id": "Pat Song",
                    "user_href": "/profile/Pat-Song-3"
                },
                {
                    "user_id": "Luminita Virlan",
                    "user_href": "/profile/Luminita-Virlan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bilguun Bayarsaikhan",
                "href": "/profile/Bilguun-Bayarsaikhan-4"
            },
            "answer_text": "First of all, I used to live in South Korea for years and i can easily distinguish who is Mongolian and who is Korean. Well, Even through Mongolians and Koreans both are classified as Northern Asian race, Western Mongolians and countryside people look totally different from east Asians. I’m trying to tell that Mongolians are so diverse looking. You can find scandinavian looking girl as well as Indochina looking boy from Mongolia. But its hard to find classical Korean-looking(means average korean) people in here as far i know i mistook a freshman at my university that he might be a Korean, so i asked him 혹시 한국분이신가요?(By any chance are you korean?) His response was “oh Can you speak English” danggggg i’m busted These days most of youth into Korean pop culture and follow their styling. No offence but they look cringy. Average Korean styling and Celebrity styling are much different yet kids are copying these so called Korean idols while unaware of it makes them look walmart version of Korean idols. (no offence to walmart) There is a question asked by me, Can you guess my ethnicity by a picture and explain why? Apparently most people guessed me a Korean. Conclusion Most of Mongolians aren’t Korean looking enough but some novaday youths may pass as Korean due to urbanization, eating habit etc,. or even caused by their heritage! Well i don’t know if my ancestries were Manchus (closest ethnic to Korean) and settled in outer Mongolia during Qing rule (XVII~XIX) ",
            "date": "Answered February 10, 2018",
            "views": "38",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Just No",
                    "user_href": "/profile/Just-No-57"
                },
                {
                    "user_id": "Magnus Roh",
                    "user_href": "/profile/Magnus-Roh"
                },
                {
                    "user_id": "M Levent Kaya",
                    "user_href": "/profile/M-Levent-Kaya"
                },
                {
                    "user_id": "Witt Phoonsiri",
                    "user_href": "/profile/Witt-Phoonsiri"
                },
                {
                    "user_id": "Aviyas Altankhuu",
                    "user_href": "/profile/Aviyas-Altankhuu-1"
                },
                {
                    "user_id": "Alvaro Salgado",
                    "user_href": "/profile/Alvaro-Salgado"
                },
                {
                    "user_id": "Aya Ilan",
                    "user_href": "/profile/Aya-Ilan"
                },
                {
                    "user_id": "David Kim",
                    "user_href": "/profile/David-Kim-716"
                }
            ]
        }
    ]
}