{
    "title": "Why do so many intellectuals declare all fascism to be socialism, i.e. left wing? When clearly right wing socialism also has existed? - Quora",
    "tags": [
        "Right-Wing Politics",
        "Left-Wing Politics",
        "Socialism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosa Lichtenstein",
                "href": "/profile/Rosa-Lichtenstein"
            },
            "answer_text": "As others have pointed out, no ‘intellectuals’ have argued in the way you have alleged (even though several conservative ideologues have). Nevertheless, there is good reason to distinguish sharply socialism from fascism and Nazism. Here is what I have written about that elsewhere: ========================== Were The Nazis and the Fascists Left-Wingers and Socialists? First, not everyone who calls him/herself a ‘socialist’ is a socialist, just as the East River in New York isn't a river, or the State of Rhode Island isn’t an island; indeed, just as not everyone who calls him/herself a Republican is a Republican. Ever heard of the phrase “Republican in name only” [RINO]? The “Nationalist” part of “Nazism” [Nazi = National Socialist] negates the “Socialist” part — rather like “Atheism, big government, open borders, greatly reduced military expenditure, and high taxation” would negate Republicanism. The Nazis incorporated the word ‘socialist’ in their title because, if a party wants to win power in a country with a large voting population, a significant proportion of whom are socialists (the German SPD was the largest socialist party on earth at the time) or communists (the KPD in Germany was also one of the largest communist parties in Europe), it will have to offer the electorate a left-sounding manifesto, and use that word (i.e., ‘socialist’) in its title somewhere — they wouldn’t choose ‘communist’ because of the involvement of the KPD in the failed German Revolution of 1918–23, and because the Nazis were an anti-Bolshevik party. The SPD had been in the front-line of the fight against that revolution, so the word ‘socialist’ wasn’t ‘tainted’ in the eyes of ordinary Germans. Far more important than what a party says, however, is what it does when in power. The Nazis in office fully supported the capitalist system, as did the fascists in Italy, Spain, Chile and Portugal. They were pretend anti-capitalists. So the Nazis were ‘socialist’ in name only, and had nothing whatsoever to do with socialism as such — as we are about to see. Second, you have to look at who the Nazis, the alt-right and the fascists associate themselves with. For example, in Charlottesville, back in August 2017, they attended a ‘Unite the Right’ march. So they, at least, know where they belong. Have you ever seen the Nazis or the fascists march with the genuine socialists? The column of demonstrators that was attacked back in August 2017, with that car killing Heather Heyer driven by a convicted fascist, was largely comprised of members of the Democratic Socialists of America and the International Socialists. Furthermore, when the fascists are in power the first to be arrested or killed are the socialists. The Nazis rounded up and threw the latter and the communists into Dachau long before they began to pogrom the Jews. Third, socialism is first and foremost an internationalist movement/ideology, whose rallying call is the following (from The Communist Manifesto): \"[Workers] of all countries unite! You have nothing to lose but your chains\". Ever seen the Nazis or the fascists come out with that one? In fact, the Nazis preach the exact opposite of this; they regard internationalism -- which they call \"cosmopolitanism”, or these days “globalism”, their code words for a mythical ‘Jewish world conspiracy’ aimed at destroying the ‘white race’ -- as the enemy. It underpins their fairy tales about 'white genocide' and the alleged plot devised by 'international Jewry' to replace the 'white race' (the latter phrase invented in the early 18th century to 'justify' slavery and ‘white supremacy’ in the USA). That is why the fascists were chanting \"Jews will not replace us\" as they marched in Charlottesville, August 2017, those whom Trump called \"very fine people\". Fourth, the narrative that Nazis or the fascists are left wing, or are socialists, is then conflated with fanciful ruminations about the nature of Russian communism, which is then used to smear socialism and leftism in general with all the hideous crimes of Stalin, Mao, Pol Pot, and Castro. This fable is then elaborated upon with the specious argument that communism is just another form of Nazism -- they are both collectivist and totalitarian, and hence they are really the same. That argument is no more sophisticated than this: Cats have legs, heads and eyes. So do alligators. Therefore cats and alligators are really the same. Those advancing the above argument forget that conservatives back in the 1930s (both sides of the Atlantic) viewed the Nazis and the fascists in a positive light — as good anti-communists, allies in the fight against Marxism, socialism and leftism in general. Indeed, many of them helped bankroll Hitler or did business with the Nazis. Here is a picture of Henry Ford, for example, receiving the Grand Cross of the German Eagle from Nazi officials, 1938:  Henry Ford also wrote The International Jew, an anti-Semitic tract much admired by the Nazis. The_International_Jew Henry Ford Henry Ford wasn’t known as a supporter of Marxism, socialism or, indeed, workers’ power. You do the math… American supporters of the European Fascists Notorious Nazi collaborators or sympathisers Nazis & America: The USA’s Fascist Past German American Bund When Nazis Filled Madison Square Garden American-Nazis-in-the-1930s In fact, support for the Nazis even included George W Bush’s grandfather, Prescott Bush: How Bush's grandfather helped Hitler's rise to power And here is Churchill -- no friend of Marxism or socialism -- in a letter to Mussolini: \"What a man! I have lost my heart!... Fascism has rendered a service to the entire world.... If I were Italian, I am sure I would have been with you entirely from the beginning of your victorious struggle against the bestial appetites and passion of Leninism.\" http://www.ronterpening.com/extras/league_ex-1.htm So, it is a bit rich of conservatives now pointing their grubby fingers at socialists and ‘the left’ when they looked to the Nazis and the fascists back then to oppose socialism. Their attempt to muddy the water now is clearly aimed at deflecting attention from their own shameful history in this regard. And, who was it that persuaded Hindenburg to make Hitler Chancellor of Germany in 1933? The Marxists? No. The communists? Nope. The socialists? Wrong again! It was the German Conservatives: Adolf-Hitler-becomes-German-Chancellor That's why they deflect attention away from their own unforgivable record. It also helps deflect attention away from the truly lethal nature of capitalism itself: Attempting the Impossible – Calculating Capitalism’s Death Toll As noted above, despite what Mussolini and Hitler said, when in power they fully supported capitalism, and in no way even attempted to set up a workers’ state — the primary goal of socialism. Indeed, they not only physically destroyed all the institutions of socialism and the working class, but even those of centrist parties. They were all ‘enemies of the state’, ‘enemies of the people’. Fifth, the US formed an alliance with the communists in WW2, even calling Stalin, \"Uncle Joe\". 3/4s of WW2 was fought by the Russians, who lost 20+ million dead and countless wounded as a result. If the communists were no different from the Nazis, that means the US formed an alliance with the Nazis! How many times have you heard a conservative (or even a 'liberal') draw that conclusion? Finally, communism and socialism parted company in Russia in the mid-1920s, after Lenin died and the Stalinists took over. Reversing the Bolshevik commitment to international revolution, the Stalinists attempted to build \"socialism in one country\", in the former Soviet Union [fSU]. Engels, Lenin, Trotsky, and the Bolshevik Party had earlier argued that socialism couldn’t be built in one country. Hence, their commitment to internationalism. When Stalin and his henchmen seized power in the mid-1920s, they knew full well that the capitalist states would either strangle them to death or they would invade and crush them. This they would do in order to quarantine the Bolshevik revolution, guarantee it failed, or physically destroy it. But, the fSU in the mid-1920s was economically backward, its industry all but destroyed by WW1 and the Civil War that followed; as Stalin argued, they would have to make up the yawning gap between their economy and the rest of the capitalist world in a generation or they would be crushed. [That is indeed what was attempted by the Nazis in 1941.] This meant that the Stalinist regime would have to impose an anti-democratic, autocratic and violently oppressive regime on the mass of the working population of the fSU. That is because, in order to catch up, the state would have to subject the working population to super-exploitation -- whereby, the proportion of wealth going to that section of society would be reduced almost to subsistence level, and often even below that (hence the massive famines — for example in the Ukraine) -- so that investment in heavy industry could be maximised. This in turn meant that the state had to become totalitarian, executing and terrorising hundreds of thousands — including nearly every one of the leading Bolshevik revolutionaries of 1917, sentenced to death on trumped up charges — since working people would resist, as they have always done, extreme economic deprivation anti-democratically imposed on them. Only absolute terror would intimidate them enough. Post-1925 Communism destroyed itself by such moves — moves forced on it by trying to create socialism in one country. Attempting to catch up with ‘the west’ forced the Stalinist regime to trample on every socialist principle it had once embraced. It thus became its own opposite. To a greater or lesser extent the same considerations applied right across the former communist block, including Cuba. Hence, those regimes were never popular; quite the reverse, in fact — and when most of them fell nearly 30 years ago, as they were always doomed to do, not one single proletarian hand was raised in their defence. Indeed, workers were glad to see the back of them, many joining in with their demolition. What Stalin and his henchmen had created in the fSU wasn’t socialism, but State Capitalism. Having to fight capitalism meant they had to emulate it, but they could only do so by exploiting and oppressing their workforce even more than was the case in the ‘free market’ economies. So, even if, per impossible, it could be shown that Nazism is the same as Russian or Chinese Communism, that would simply mean they are two different forms of State Capitalism — whereby the Russian and Chinese versions completely owned and controlled the means of production, distribution and exchange, while the German version only owned or controlled a sizable proportion of them. State Capitalism State Capitalism in Russia Tyrannies ruling in the name of socialism ============================== Check these out, too: Why-do-some-conservatives-try-to-claim-that-Nazis-are-left-wing/answer/Christopher-Saunders-8 Who Are The Real Nazis? =============================== Whenever I make the above points about the left and the Nazis, irate right-wingers pile into me with clichéd objections, almost invariably ignoring my replies, and then post Republican talking points (or those they have copied off Breitbart, The Daily Caller, The Daily Wire, Fox News, Talk Radio — or even worse, Ben Shapiro and Dinesh D'Sousa!). I am tired of hearing from such individuals and time wasters, with having to ask them to address what I have actually argued and desist from posting material that assumes I am a supporter of the Democratic Party (or even that the Democrats are socialists!). So, I will simply block such individuals and delete their posts. Some complain that this is censorship; it isn't. It is to remind such individuals that if they are abusive, they just want to ‘score points’, or they can't be bothered to read and then reply to my actual arguments, they can't expect me to listen to them in return. Those who want to be civil and argue like grown-ups, and who address what I have argued, will, of course, be listened to. I don't issue second warnings. ============================= From here: Were the Nazis Socialists? ",
            "date": "Updated February 7, 2019",
            "views": "333",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kurt Hershey",
                    "user_href": "/profile/Kurt-Hershey"
                },
                {
                    "user_id": "Eric Lorentzen",
                    "user_href": "/profile/Eric-Lorentzen"
                },
                {
                    "user_id": "Lexi R",
                    "user_href": "/profile/Lexi-R-54"
                },
                {
                    "user_id": "Len Gould",
                    "user_href": "/profile/Len-Gould"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-King-1080"
                },
                {
                    "user_id": "Jeff Wilson",
                    "user_href": "/profile/Jeff-Wilson-32"
                },
                {
                    "user_id": "Nathan Green",
                    "user_href": "/profile/Nathan-Green-13"
                },
                {
                    "user_id": "Light Gazaret",
                    "user_href": "/profile/Light-Gazaret"
                },
                {
                    "user_id": "Jerry Mason",
                    "user_href": "/profile/Jerry-Mason-16"
                },
                {
                    "user_id": "Stephanie Baker",
                    "user_href": "/profile/Stephanie-Baker-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruben Avalos",
                "href": "/profile/Ruben-Avalos-1"
            },
            "answer_text": "They are conservative or right wing sophists woh day whatever they’re paid to say. Or whatever will gather attraction. Fascists claimed they were “Third Position” our side of standard left-right positions. Even then they still acknowledged their right wing roots. Technically speaking Fascists are far right. The left-right political spectrum has to do with how libertarian or authoritarian a political government or model is. It began in the French Revolution where the radical liberals were left wing, and clergy and nobility or royalists being right wing. The further left the greater advocacy of liberty and egalitarian social structures. The further right the greater advocacy of authority and hierarchical social structures. The furthest left has been libertarianism/anarchism which is a Socialist branch. The furthest right has been totalitarianism/fascism which is an extreme Nationalist and Corporative State ideology. Socialism is more a socioeconomic ideology than political. Therefore Socialism as an economic ideal can exist within a number of political models, though only a libertarian model can bring about true classless socialism. Marxist-Leninism is describes by those on the left as a right wing deviation of Socialism. Because the Bolsheviks took to Socialism with an authoritarian approach. Since then leftists like Rosa Luxembourg have been critical of Lenin and the Bolsheviks attempting a leftist revolution trying to bring about leftist ideals through a right wing political model of single party rule, top down bureaucracy, dictatorial mandates, and Statist control. Which angered Lenin and the Bolsheviks who persecuted leftist tendencies like anarchists and democratic socialists. Lenin disregarded them and their ideas as “Infantilism of the Left” Take capitalism for example. It has existed under liberal principles, but has also been implemented by dictatorships such as Pinochet’s neoliberal dictatorship in Chile. Corporate Fascism as well maintains the capitalist mode of production, however the capitalist is encouraged to concern themselves more about the collective national interests rather than individual interests. The word “privatization” was created to describe what the Nazis were doing economically. Their Socialism came from an ongoing philosophical movement calling for a German socialism that has more to do with the nation working together for the national interests. Nothing to do with the leftist class struggle and anti-capitalism. Orwell made note of the use of Socialism by non-socialists as a tool to get support from the working masses and labor organization. As seen in the evil “IngSoc” Party of his 1984 dystopian novel. The English Socialists that are anything but Socialist. Might I add that Orwell was a Democratic Socialist. Intellectuals that try to place Fascism as a left wing ideology are ignoring history, biased, or have an agenda. Everyone knows Fascists saw Socialists as political enemies to be eradicated. Fascists protected wealth, privilege, and hierarchies. Socialists sought equity, classless society, and an end to private control of production. Fascism is Nationalist, Socialism is international and if anarchist than anti-statist. The similarities lie in that both Socialism like Fascism or Corporatism were born out of the same social issues. The capitalist status quo of wealth inequality and plutocratic class domination lead to revolutionary ideals of both the left and the right. One attacks capitalism from the left the other from the right. But both are ideologically antithetical. ",
            "date": "Answered February 8, 2020",
            "views": "27",
            "upvotes": "0"
        }
    ]
}