{
    "title": "Why do we say Columbus discovered America? - Quora",
    "tags": [
        "Discovery of the Americas",
        "Columbus Discovers the Americas (1490s & 1500s)",
        "Christopher Columbus (historical figure)",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Weir",
                "href": "/profile/Barry-Weir-3"
            },
            "answer_text": "Original question: Why do we say Columbus discovered America? Because October 12, 1492 was a significant day in the history of the Americas. After that date, there was a deluge of colonization, resulting in the creation of every nation in the Western Hemisphere (half the world’s surface). In other words, the land that existed in the Americas were unknown to most Europeans - finding and disclosing something virtually unknown is generally called “discovery”. ",
            "date": "Answered February 12, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melody French Vasquez",
                    "user_href": "/profile/Melody-French-Vasquez"
                },
                {
                    "user_id": "Rb Bolin",
                    "user_href": "/profile/Rb-Bolin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chad Courtney",
                "href": "/profile/Chad-Courtney-1"
            },
            "answer_text": "Well for the Europeans of the age, it was a discovery to them. Yes, Native American’s lived here, just like Aboriginals lived in Australia. But to those Europeans that had no knowledge that the lands existed it was a discovery. As for Leaf Erikson’s discovery 1000 years earlier. Outside of Sagas handed down in Nordic tradition of a land further West of Greenland it wasn’t really known to be much more than a myth. Until Archaeological evidence was found in 1960. So, yeah Vikings landed there, even lived there for some time, before either abandoning it or dying off. Meanwhile Columbus discovery of the lands lead to many more travels the the America’s and the colonization of Native American lands by European Settlers. To the Europeans of the time it was a discovery, to the Native Americans living there at the time it wasn’t. Maybe history text books should clarify it, but I doubt they will, and such questions will continue to persist. ",
            "date": "Answered February 12, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Gray",
                    "user_href": "/profile/David-Gray-78"
                }
            ]
        }
    ]
}