{
    "title": "Why did the British establish colonies? - Quora",
    "tags": [
        "Why Did the British",
        "Imperialism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joydeep Bhattacharya",
                "href": "/profile/Joydeep-Bhattacharya-25"
            },
            "answer_text": "British established colonies just because of LOOTING WEALTH from other countries. Simply to steal money in forceful manner..what a normal thief does! Please don't give any other excuse as on that time there was no country, so they simply went to collect gold dripping from the pipeline etc etc.. It's not only British, but French and Spanish too..little bit Dutch Portuguese also. Half of the world(mainly Asia) was captured by British..Africa was by French, South America by Spanish. Before colonial era started, CHINA and INDIA was two world power in terms of business, they were having 27% and 25% of global GDP(business share), England was having merely less than 1%..when British came to India it was Mughal era going on from Delhi although country’a most wealthy area was Bengal(today’s West Bengal, Bihar, Jharkhand, Orissa + Bangladesh primarily) and British came as a form of businessmen seeing permit(license) to do business in the area. Then govt(king/Nabab) gave that permission in promise to have tax..slowly British started building arsenal and army over there and started invading the capitals and got win by putting many war tricks(bribery). Slowly whole India was under them because they had better weapon(Gun). The Robert Clive looted wealth(gold, silver, jewelry, stone, cotton, silk) from Bengal and took entire wealth to London with 21 ships..he was so famous in London after that that he was known as Clive of Bengal!! Such an amount of looting from the colonial states. It went for 200 years…British continuously looted all the commonwealth countries wealth and accumulated in their own England. So you will see London so prolific and so called once rich nations became so poor that still they are ‘developing nation’. I know this bitter truth may not be liked by many folks(specially the white brits of today, because they were being taught a different flavor of history surely in their school curriculum)…but nothing stands strong in front of a TRUTH. I am only thankful to British rule not because of petty logics which are normally being mentioned by few shallow brained boot lickers-railway,democracy,cricket, tea, modern education, blah blah But for the reason that unless British came and captured India by 1757, the dark era(from cultural point of view) of Muslim rulers would not have ended shortly..and India could not have emerged as a ONE entity. Thanks to our freedom strugglers for that. ",
            "date": "Answered June 26, 2017",
            "views": "679",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Sutton",
                    "user_href": "/profile/Richard-Sutton-22"
                },
                {
                    "user_id": "Hari Kashyap",
                    "user_href": "/profile/Hari-Kashyap-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Avinante",
                "href": "/profile/Josh-Avinante-1"
            },
            "answer_text": "There were two waves of colonisation. Commercial Revolution Era sparked by access to spice and silk of the east powered by gold and silverIndustrial Revolution sparked by access to larger markets and source of raw materials powered by currenciesThe United States of America was acquired during the commercial revolution. In 1776, the Americans declared independence. King George was afraid that losing the colonies would weaken the empire. But instead, the US-British trade relations flourished even further and the empire became more powerful with an independent USA. After all, they could continue access to American markets and raw materials without costing the British a standing army in North America. By the 1900s, the empire had given complete autonomy to Canada and Australia under the queen but only as symbol of state. By the end of World War II, England realised it was cheaper to let the colonies (now loyal subjects of the crown) govern and defend themselves and let the United States do all the policing of the world. The British realised tjey did not need to directly administer the colonies which cost money. All they needed was a symbol of state to lead them to the “correct” way, that is creating their own policies that serves both the interest of their home countries AND THE CROWN. Brexit was possible because the British kept its empire now known as the Commonwealth of Nations. They will continue to have access to Australian produce, Canadian soldiers, Singaporean and Malaysian ports, Indian spices, a multinational manpower and US soldiers. They can’t dictate these former slaves of course but the queen can easily rally them to her cause. England and Japan are the only monarchies in the world that can never be threatened by republicanism. Their relinquish of absolute monarchy to constitutional monarchy saved them. ",
            "date": "Answered December 14, 2019",
            "views": "129",
            "upvotes": "0"
        }
    ]
}