{
    "title": "Why didn't early modern firearms take after chinese hand cannons? - Quora",
    "tags": [
        "Weapons",
        "Guns and Firearms"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Potratz",
                "href": "/profile/James-Potratz"
            },
            "answer_text": "Actually all early modern firearms which were smooth-bore, muzzle-loading guns followed the form of Chinese guns and cannons through to the 19th century. When Yongle, the third Ming Emperor, brought gunsmiths and foundry administrators from Vietnam (then called Dai Viet) back to China in 1407 this resulted in the immediate switch to the Dai Viet style guns for use against the Mongols. The basic “Vietnamese” innovations were the priming pan with lid (eliminating the fuse) and the wooded wad (called wooden horse) between the powder and the projectiles and the wooden gift which locked the projectiles in place. This fully occluded the barrel dramatically increasing range and velocity. Since the targets for these guns were hordes of enemy soldiers (and not fortifications or single soldiers), the initial guns fired mostly multiple projectiles. These guns were developed and forged in the Military Weapons Bureau under the Ministry of Works under the direction of a Vietnamese named Li Cheng (in China) aka Ho Nguyen Trung who ultimately rose to the rank of Minister of Works. As the MWB used serial numbers for each model gun (as seen on the internet), some idea of Li Cheng’s value can be ascertained. To support a 1410 expedition against the Mongols, in 1409, the MWB produced over 23,000 15mm hand guns (2 kg), over 5,700 52mm mid-size guns (8 kg), and 8,400 70mm mid-size guns (20 kg). By 1415, the MSB produced an additional 25,000 15mm hand-guns, an additional 21,800 52mm mid-size guns and an additional 14, 400 70mm mid-size guns. There was a slight variation in the bore size as after casting each gun then the barrel was bored to a specific caliber; however, the wooden wads could be individually tailored to overcome this. Another innovation was the MWB upgrades in powder, etc.. allowed a reduction in the size of the powder chamber. This allowed the MWB to first bore the barrel to the size of the powder chamber and then re-bored the barrel to fit the caliber desired. This made it easier for the wad to fit over the chamber. The MWB also made a brass measuring spoon for each gun (with the serial number of the gun and the weight amount of the spoon — 2.5 catties of powder for a 15mm gun) and the tip of the spoon was shaped as an open funnel to slide into the barrel. This was nearly 500 years before Fanny Farmer was credited for creating the measuring spoon in 1898. Another Vietnamese innovation brought to China was the Divine Arrow, the shaft of an arrow with an explosive package (plus shrapnel) above the barrel and a wooden horse attached to the bottom of the shaft. This package was fired from the 15mm gun after the fuse on the explosive package was lit. The British copied this for World War One with the Mills Bomb N°23 fired from an Enfield rifle with a blank round (complete with a shaft down the barrel). So a Chinese hand-gun was the first grenade launcher and grenade launchers are still in use TODAY! FYI: Ho Nguyen Trung was not only extremely bright, he was also a Royal Prince in the Ho Dynasty — his father was the first Emperor and his brother was the second and last Emperor. Trung obviously agreed to work for Yongle, not only for the safety of his immediate family but also for the safety of extended family members. Only three were jailed and his brother was ultimately released from jail. ",
            "date": "Answered September 18, 2017",
            "views": "419",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bevin Chu",
                    "user_href": "/profile/Bevin-Chu"
                },
                {
                    "user_id": "Chris Smith",
                    "user_href": "/profile/Chris-Smith-660"
                },
                {
                    "user_id": "Charles Lewis",
                    "user_href": "/profile/Charles-Lewis-13"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1350"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Rowell",
                "href": "/profile/Gary-Rowell"
            },
            "answer_text": "A very astute question. The developmental history of firearms is replete with simultaneous development in multiple countries, along with a woeful lack of communication concerning design and development. Compared to modern times and the ubiquitous internet, China might as well have been on Mars. I concur with Tim and Dennis that Chinese hand cannons (circa 13th Century), particularly those with multiple barrels, were unwieldy. A single barreled hand cannon weighed around 5 pounds, was 14” long, and had a 1” bore. It had no sights, no rifling, a fairly loose projectile to barrel fit, and was meant to be fired from the hip. Unsurprisingly, it was incredibly inaccurate. Hitting a man-sized target beyond 20 meters was virtually impossible. A good Chinese archer or crossbow user could consistently hit a man-sized target at more than 5 times that distance. It was best used as a terror weapon against inexperienced enemy troops A three barreled hand cannon weighed around 20 pounds. It was also susceptible to cooking off, i.e., to all the barrels firing at once, thereby injuring the shooter because of the recoil. (Pepperbox pistols also suffered from cooking off, as did blackpowder revolvers when not carefully loaded.)  All in all, the hand cannon was not very practical. Multi barreled muskets were developed in Europe three centuries later, had a stock, sights, and long barrels (providing a long sight radius), and were effective to 50 meters. However, because of the lack of rifling they were also not very accurate.  ",
            "date": "Answered January 8, 2016",
            "views": "481",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samuel Scott",
                    "user_href": "/profile/Samuel-Scott-12"
                },
                {
                    "user_id": "Michael Chan",
                    "user_href": "/profile/Michael-Chan-78"
                },
                {
                    "user_id": "Emlyn Shen",
                    "user_href": "/profile/Emlyn-Shen"
                },
                {
                    "user_id": "Tim Hofstetter",
                    "user_href": "/profile/Tim-Hofstetter"
                }
            ]
        }
    ]
}