{
    "title": "Why did Japan surrender in World War II? - Quora",
    "tags": [
        "Japan's Surrender in World War II",
        "Military History and Wars of Japan",
        "History of Japan",
        "Japan in World War II",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Warinner",
                "href": "/profile/Andrew-Warinner"
            },
            "answer_text": "The Japanese government surrendered for two reasons: their plans to end the war had collapsed and the Emperor intervened to accept proposed Allied terms offered after the Potsdam conference.  That's a tidy explanation of a decision taken by a handful of men in the space of a day or two, punctuated by terrible events - two atomic bombings and the launching of a Soviet invasion of Manchuria - so a fuller explanation is needed. Early in 1945 it was clear to the Emperor and some members of the Council that Japan had little chance of pulling out a military victory. Emperor Hirohito began exploring possible terms of Japanese surrender with members of the Supreme Council and elder statesmen through the offices of Lord Kido.  The consensus surrender terms were absurdly optimistic: no occupation of Japan, no prosecution of war criminals, no disarmament of the Japanese military, retention of some of the territories seized during the war, no reform of the Japanese government among others.  The Japanese government had been a hybrid institution since the early 1930s. It was dominated by the military but still retained some figurehead civilian ministers. The Supreme Council was the highest policy making body in the government and was composed of the Prime Minister, Minister of Foreign Affairs, Minister of the Army, Minister of the Navy and the Chiefs of Staff of the Army and Navy.  The military held the balance of power in the Supreme Council. The Prime Minister had been a general or admiral since 1940 and any of the Ministers of War and the Chiefs of Staff could dissolve the government simply by resigning.  The Supreme Council deadlocked over how to achieve their desired terms. There was a \"peace\" faction composed of Foreign Minister Togo supported more or less by Prime Minister Suzuki who favored pursuing these terms through the Soviet Union. The \"war\" faction included Army Minister Anami, Navy Minister Yonai, Army Chief of Staff Umezu and Navy Chief of Staff Toyada and spanned a range of opinion from those who believed that a final decisive battle could still win the war and those that believed that a final decisive battle would so bloody the US that the Japanese peace terms could be won at the negotiating table.  To paper over this split the Supreme Council agreed to pursue both policies: Foreign Minister Togo was permitted to approach the Soviet Union while preparations for the final decisive battle - dubbed Operation Ketsu-Go - went forward.  The Japanese government had guessed that the US's next move would be to invade Kyushu and set about reinforcing Kyushu from one division to 14 divisions and supporting formations, a total of about 900,000 men (the planned US invasion force was about 450,000 troops).  Ketsu-Go was much more than the defense of Kyushu. About 10,000 kamikaze planes along with aviation fuel were hoarded (compare this to the defense of Okinawa when 2,000 kamikaze aircraft were expended). Hundreds of kamikaze motor boats and midget submarines were assembled. Civilians, both men and women, were trained as makeshift militia fighting with whatever weapons were available, even bamboo spears. Preparations were made for a follow on invasion of Honshu; troops were assembled to defend Tokyo and fortifications were started but Kyushu received the lion's share of Japan's remaining military resources. Togo's approaches to the Soviet Union were firmly rebuffed, first by the Soviet refusal to renew the Soviet-Japanese neutrality pact in April 1945 and later in meetings in July 1945 in Moscow. The end of the Potsdam conference in July 1945 brought further bad news for Japanese diplomatic initiatives. The Allies announced their surrender terms for Japan. The Potsdam terms were not draconian but were utterly unacceptable to the military members of the Supreme Council. The \"peace\" faction, really just Foreign Minister Togo now, saw a dim hope of fabricating a diplomatic end to the war if the Imperial Throne were retained (the Allies crafted the language of the Potsdam terms to suggest it). However, the unconditional surrender of the Japanese military was unacceptable to the military members of the Supreme Council and so the Potsdam terms were firmly and publicly rejected. So by July 28 one set of assumptions underpinning Japanese hopes had collapsed: that the USSR could be used as an intermediary for a negotiated peace and the solidarity of the Allies could be split by a Japanese diplomatic proposal.  The first atomic bomb was dropped on Hiroshima on August 6 shifted but did not break the deadlock in the Supreme Council. Surprisingly the Council did not meet until August 9. Between the 6th and the 9th there was plenty of back room politicking with the \"peace\" faction with the discreet backing of the Emperor pushing for a discussion of acceptance of the Potsdam terms with modifications while the military sought to avoid any meeting where surrender was on the agenda.  Truman's statement announcing the atomic bombing of Hiroshima made it clear that the US would continue atomic bombing until Japan surrendered. What Truman did not reveal was the US nuclear arsenal was paltry: a third atomic bomb would be ready in late August and thereafter one atomic bomb a month would be ready for use into 1946. August 9 started badly for Japan. At 4:00am the USSR declared war and invaded Manchuria. The government spent its time in alternating meetings of the Cabinet and the Supreme Council all of which deadlocked on what modifications to the Potsdam terms were necessary; the peace faction insisted on one sole modification, a guarantee of the Imperial Throne, while the war faction insisted on no occupation, disarmament by Japan itself and that Japan try its war criminals.  The news of the atomic bombing of Nagasaki did not break the deadlock but it did bring over Prime Minister Suzuki and Navy Minister Yonai to Foreign Minister Togo's side accepting the Potsdam terms with only a guarantee of the Imperial Throne but the split in the Supreme Council remained, now 3 to 3.  At this point the Emperor stepped in. Suzuki and Togo proposed an Imperial Conference which started at midnight. After rehashing the opposing positions of the deadlock, the Emperor expressed his wish for surrender and left the meeting. After further discussion, Anami, Uzemu and Toyoda reluctantly accepted surrender. The two atomic bombs and the Soviet onslaught showed that the decisive battle might not be fought. The US had the option of continuing its bombing campaign with atomic bombs thrown in and the naval blockade would continue to squeeze Japan (Japanese officials expected a serious famine by fall) and the Red Army could destroy Japanese armies in China and Manchuria, all without the US engaging in the decisive battle in Kyushu.  The war was not over; the tentative Japanese acceptance of surrender had to survive an abortive Army coup and win Allied approval of their provision for retaining the Imperial Throne[1] but the decision made in the early hours of August 10 was the turning point. [1] The US rejected the Japanese proposal to accept the Potsdam terms with the stipulation for retaining the Emperor. The US rejected the proposal and proposed instead the formula:  From the moment of surrender the authority of the Emperor and the Japanese Government to rule the state shall be subject to the Supreme Commander of the Allied powers who will take such steps as he deems proper to effectuate the surrender terms. The formula didn't explicitly allow or disallow the Emperor or the Imperial throne, it kicked the can of the status of the Emperor down the road and left the decision to Douglas MacArthur who had been appointed SCAP. MacArthur was wooed by a charm offensive for Hirohito and opted for a continuation of the Imperial throne, leaving Hirohito in place and not to put him on trial for war crimes.  ",
            "date": "Updated March 29, 2016",
            "views": "213",
            "upvotes": " View 114 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Andrews",
                    "user_href": "/profile/Mike-Andrews-58"
                },
                {
                    "user_id": "Mack Shelton",
                    "user_href": "/profile/Mack-Shelton"
                },
                {
                    "user_id": "Anthony Anderson",
                    "user_href": "/profile/Anthony-Anderson-528"
                },
                {
                    "user_id": "Thomas Bell",
                    "user_href": "/profile/Thomas-Bell-46"
                },
                {
                    "user_id": "Alfredo Yong",
                    "user_href": "/profile/Alfredo-Yong"
                },
                {
                    "user_id": "Gerard Delaney",
                    "user_href": "/profile/Gerard-Delaney"
                },
                {
                    "user_id": "Thomas Schaade",
                    "user_href": "/profile/Thomas-Schaade"
                },
                {
                    "user_id": "Thomas Zhang",
                    "user_href": "/profile/Thomas-Zhang-60"
                },
                {
                    "user_id": "Garry G Kraft",
                    "user_href": "/profile/Garry-G-Kraft"
                },
                {
                    "user_id": "Pavel Gorchev",
                    "user_href": "/profile/Pavel-Gorchev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Loubier",
                "href": "/profile/Will-Loubier"
            },
            "answer_text": "Japan had little chance of turning the war around for numerous reasons. First, they lost Okinawa, and the US was planning to stage a massive invasion. Okinawa was considered a part of the \"homeland\" since the Tokugawa government integrated the Ryukyu Islands into Japan. Secondly, in addition to the atomic bombings of Hiroshima and Nagaski, Tokyo and other cities were completely ruined due to daily bombing runs. If I remember correctly, the Tokyo Fire Bombings killed more people than Hiroshima. Third, Japan was now fighting in a war with basically no allies as Germany and Italy had fallen (And the US was concentrating on the Pacific front). Fourth, Japan was running low on materials. One of the reasons Japan actually attacked Pearl Harbor is because the US stopped trading oil with them. The Japanese military wanted to continue it's expansion into Asia in order to gain access to resources that it needed to maintain their empire. They had hoped that the bombing of Pearl Harbor would devastate the US ability to fight in the Pacific, and that the public would be against war (Due to WWI being in recent memory, the public was against intervention before Pearl Harbor). Lastly, the Soviet Union declared war on Japan (One or two days before Japan actually surrendered, I think). This would mean that Japan would be in a two-front war for it's survival (Japan still has disputed islands due to the Soviet Union's invasion of Japan). Before this, Japan and the Soviet Union had a non-aggression pact. The various ministries in Japan had met after the bombings of Hiroshima to discuss the idea of surrendering. If I remember correctly from my history class, the various war ministries voted against surrendering as they felt that the Japanese people would continue to fight until the very end. Eventually, the emperor at the time (Hirohito/Showa Emperor) broke the vote in favor of surrendering. This was pretty remarkable as the emperor didn't actively make decisions (Usually, he followed the advise of his advisers and the various ministries).  He also decided to give a radio address in order to prevent mass-Japanese suicide/continued Japanese fighting. Some army personnel almost prevented it from happening (the radio address). The Japanese would later sign a peace-treaty with the US, and almost all the other allies (Except for the Soviet Union/Russia, who they are still technically at war with, due to the disputed islands). One of the reasons that Japan took so long to surrender was because of the question of what the US was going to do to the Japanese emperor. The US demanded an unconditional surrender in order to have free reign to reform Japan/use Japan as a base for their operations in Asia. ",
            "date": "Answered August 8, 2011",
            "views": "75",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Ameen",
                    "user_href": "/profile/Mohammed-Ameen-229"
                },
                {
                    "user_id": "Sylph Syd",
                    "user_href": "/profile/Sylph-Syd"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-427"
                },
                {
                    "user_id": "Sourav Pal",
                    "user_href": "/profile/Sourav-Pal-119"
                },
                {
                    "user_id": "Talia Valente",
                    "user_href": "/profile/Talia-Valente"
                },
                {
                    "user_id": "Nyle Hawking",
                    "user_href": "/profile/Nyle-Hawking"
                },
                {
                    "user_id": "Tom Nelson",
                    "user_href": "/profile/Tom-Nelson-39"
                },
                {
                    "user_id": "Nabeel Nisar",
                    "user_href": "/profile/Nabeel-Nisar"
                },
                {
                    "user_id": "Trevor Robertson",
                    "user_href": "/profile/Trevor-Robertson-48"
                },
                {
                    "user_id": "Sina Taghva",
                    "user_href": "/profile/Sina-Taghva"
                }
            ]
        }
    ]
}