{
    "title": "Why is Will Durant (and his work) so underrated and not-known? - Quora",
    "tags": [
        "Will & Ariel Durant",
        "Overrated Things or People",
        "Underrated Things or People",
        "Civilization",
        "Philosophy",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel McGirr",
                "href": "/profile/Daniel-McGirr"
            },
            "answer_text": "My late grandfather bought The Story of Civilization by Will and Ariel Durant probably 40 years ago. My family still has it and I keep meaning to borrow it and read it. I have yet to come up with a plan for actually getting through it. There are definitely folks who read more than me, but I typically go through about 30,000 pages in a year and The Story of Civilization would occupy 1/3 of that. If I read each volume cover to cover with no interruption, that’s 4 months of reading. For a lot of people, they’d have to dedicate a year to it. That’s incredibly daunting. And while Will and Ariel Durant certainly have opinions about history, it’s not anything particularly catchy in the modern context and it’s not particularly useful to any partisan ideology. It’s just a lot of reading. So much reading that most people don’t even think it’s worth pretending they’ve read it (unlike a fair number of classics). If you want to be well-known, you are better off writing a breezy 400 page nonfiction book (you can add another 70 pages of endnotes that nobody is going to read) that looks serious due to its length and advocating for some position that’s going to rile people up. Rather than survey the data, choose the data that supports the argument you want to make and ignore the rest. Get the chattering class talking about the book (rather than the serious intellectuals). If you want to do something with more than one volume, consider two or at most three volumes of around 350 pages that are published a couple of years apart. Congratulations. You’ve now written a multi-volume intellectual tour-de-force. Meanwhile, Will and Ariel Durant are sitting there with 10x your page count and probably cut more than twice what you’ve written out of their series. ",
            "date": "Answered December 16, 2018",
            "views": "135",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Florence Law",
                    "user_href": "/profile/Florence-Law"
                },
                {
                    "user_id": "Adel Chaouch Orozco",
                    "user_href": "/profile/Adel-Chaouch-Orozco"
                }
            ]
        }
    ]
}