{
    "title": "Why is France worried about Islam? - Quora",
    "tags": [
        "Culture of France",
        "Secularism",
        "French Ethnicity and People",
        "France",
        "Terrorism",
        "Muslims",
        "Islam",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wordstar Sandesh",
                "href": "/profile/Wordstar-Sandesh"
            },
            "answer_text": "France is known for it's secularism and pro-democracy. It has accepted refugees from West African Nations, Middle Eastern nations mostly in last few years. Due to which, Muslim population in France has grown to 8.8% of total population (67 million).  Source - The Guardian But it's not the cause of worry for French Government. France has slightly different version of secularism. And it's applicable to everyone. A public servant can't wear clothes that expresses one's religious beliefs. Like women (who works for government) can't wear Hijabs (a scarf covering on head) because it explicitly shows their religious beliefs. Same goes for Christians. Government servants can't wear big crosses with Jesus Christ on it (or anything that shows their religious beliefs).Women (in general) can't wear Burkha that covers their entire face. It's punishable by Law. People can't wear clothes/things that shows their religious beliefs at public places like Museums, Schools etc because there has to be secularism at public places (according to French government).They have also (attempted to) banned Burkini (combination of Burkha and bikini) because of same reason cited above. Far right Islamists weren't allowing their women to wear bikinis at public beaches and swimming pools. And it's against constitution which gives freedom to wear whatever they want (except religious clothes).But are these the only concerns of French Government? Most certainly not. France is the biggest source of ISIS militants in Europe. Most number of People who joins Terrorist organizations comes from France (in Europe)There have been multiple terrorist attacks in France due to it's secularism policies that most terrorist organizations considers discriminatory. Haha.For example, there was a mass shooting at Charlie Hebdo (A satirical magazine) in 2015 which killed 20 employees. It was because they had published a cartoon of Prophet Muhammad in funny way. The same year, another terrorist attack left 130 civilians dead. In 2016, a terrorist drove a truck into the crowd on Bastille Day (National Day of France) that killed 30 people. On 17th October 2020, a history teacher was beheaded for showing cartoon picture of Prophet Muhammad that was published in Charlie Hebdo. Apparenlty, he was having a discussion about freedom of speech among students. Due to all these attacks and many more, French Government decided to take strict action against Islamic separatist groups operating in France. French government will introduce a bill to fight against Islamic Seperatism (Anti-separatism Bill). It will include keeping sharp eye at foreign fundings to religious sites and NGOs. It will enable government to shut down religious schools and organizations suporting radical Islam etc. Macron government thinks some extremist organizations are trying create a parallel society alongside republic. That they want to set their own laws above republic, which is unjust. France is highly respected country for it's democratic and secular values. What do you think about it? ",
            "date": "Updated October 24, 2020",
            "views": "905",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hans De Vries",
                    "user_href": "/profile/Hans-De-Vries-13"
                },
                {
                    "user_id": "Mary Milligan",
                    "user_href": "/profile/Mary-Milligan-30"
                },
                {
                    "user_id": "Kari Carney",
                    "user_href": "/profile/Kari-Carney-2"
                },
                {
                    "user_id": "Barani Kannan",
                    "user_href": "/profile/Barani-Kannan-6"
                },
                {
                    "user_id": "Niesy Times",
                    "user_href": "/profile/Niesy-Times"
                },
                {
                    "user_id": "Vivek Pandey",
                    "user_href": "/profile/Vivek-Pandey-1547"
                },
                {
                    "user_id": "Samiksha Shambharkar",
                    "user_href": "/profile/Samiksha-Shambharkar"
                },
                {
                    "user_id": "Robert L Hill",
                    "user_href": "/profile/Robert-L-Hill"
                },
                {
                    "user_id": "Mayur Taywade",
                    "user_href": "/profile/Mayur-Taywade-5"
                },
                {
                    "user_id": "Dev Gupta",
                    "user_href": "/profile/Dev-Gupta-326"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheldon Drake",
                "href": "/profile/Sheldon-Drake"
            },
            "answer_text": "Did you see yesterday’s story about the decapitation? Some teacher wanted to discuss the issues around censorship, and free thinking, and showed some of the material from Charlie Hebdo, the left-wing paper that despises militant Islam. One of the student’s relatives found the teacher in the street and chopped his head off. Read that again: he chopped his head off in the street. ",
            "date": "Answered October 17, 2020",
            "views": "170",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                },
                {
                    "user_id": "Mary Milligan",
                    "user_href": "/profile/Mary-Milligan-30"
                },
                {
                    "user_id": "Neha Kamath",
                    "user_href": "/profile/Neha-Kamath-37"
                },
                {
                    "user_id": "Dev Gupta",
                    "user_href": "/profile/Dev-Gupta-326"
                },
                {
                    "user_id": "Pradhyumna Muralidharan",
                    "user_href": "/profile/Pradhyumna-Muralidharan"
                },
                {
                    "user_id": "Suhas Shilker",
                    "user_href": "/profile/Suhas-Shilker"
                },
                {
                    "user_id": "Vignesh Vijay",
                    "user_href": "/profile/Vignesh-Vijay-112"
                },
                {
                    "user_id": "Ashwin Singh",
                    "user_href": "/profile/Ashwin-Singh-13"
                },
                {
                    "user_id": "Wordstar Sandesh",
                    "user_href": "/profile/Wordstar-Sandesh"
                },
                {
                    "user_id": "Saurav Singh",
                    "user_href": "/profile/Saurav-Singh-2276"
                }
            ]
        }
    ]
}