{
    "title": "Why do most people think that Henry VII killed Richard and Edward? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wendy Carolan",
                "href": "/profile/Wendy-Carolan"
            },
            "answer_text": "Do you mean Edward V and Richard of Shrewsbury, the sons of Edward lV? These two young princes disappeared in the Tower of London, and the reasons for their supposed murder is complex. Henry VII however, is not actually one of the suspects. The events took place against the backdrop of The Wars of the Roses: a series of English civil wars for control of the throne of England fought between supporters of two rival branches of the royal House of Plantagenet: the House of Lancaster, associated with a red rose, and the House of York, whose symbol was a white rose. It is a very very convulated and confusing period of English history. Wars of the Roses - Wikipedia After the Yorkist Richard III seized the throne in 1483, Edward and his younger brother Richard were taken into the \"inner apartments of the Tower\" and then were seen less and less until they disappeared altogether. It is generally assumed that they were murdered on Richard’s orders in an attempt to secure his hold on the throne. The Lancastrian Henry Vll, though, had nothing to do with the princes’ disappearance. Henry's Lancastrian forces decisively defeated Richard's Yorkist army at the Battle of Bosworth Field, a couple of years later on 22 August 1485, and Henry Tudor became king of England. However, while he was still in Leicester after the battle of Bosworth Field, Henry was already taking precautions to prevent any rebellions against his reign. Before leaving Leicester to go to London, Henry had the ten-year-old Edward Tudor, 17th Earl of Warwick, arrested and taken to the Tower of London. (Richard lll also had a son called Edward, although this child died before his father; I warned you the history of the period is confusing!) Edward Plantagenet, Earl of Warwick, was the son of George Plantagenet, 1st Duke of Clarence, and therefore a potential claimant to the English throne during the reigns of both Richard lll (1483–1485) and his successor, Henry Vll (1485–1509). Edward Earl of Warwick remained Henry’s prisoner until 1499, when he became involved (willingly or unwillingly) in a plot to escape with the Pretender, Perkin Warbeck. Warbeck claimed he was the younger brother of Edward V (one of the disappeared Princes in the Tower). Warbeck was imprisoned and later executed and Warwick was also beheaded for treason. After Warwick’s death the House of Plantagenet became extinct in the legitimate male line; however, the surviving sons of his Warwick’s aunt, Elizabeth Duchess of Suffolk, continued to claim the throne for the Yorkist line. After the Lancastrian Henry Tudor (Henry VII) defeated the last Yorkist king (Richard III), he married Elizabeth of York, daughter of Edward IV who was the first Yorkist king of England, thus uniting the two houses and creating the House of Tudor. Today, the red and white Tudor rose is still the traditional floral heraldic emblem of England and takes its name from the House of Tudor, which united the House of York (white rose) and House of Lancaster (red).  ",
            "date": "Answered November 7, 2018",
            "views": "299",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Carol Milner",
                    "user_href": "/profile/Carol-Milner-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Berwick",
                "href": "/profile/Tom-Berwick-3"
            },
            "answer_text": "If you mean Edward V, and his brother Richard, Duke of York, the so-called Princes in the Tower, most people don't. A loud minority or Richard III fans refuse to believe that their idol possibly could have done such a thing and put forward all sorts of speculation and wishful thinking to come up with other explanations, including that they survived his reign to be murdered by Heney VII. This is highly unlikely - the chance of them remaining completely hidden for two years is very small, expecially given that Richard would have had good reason to prove that they were still alive. Shakespeare's play was in part intended to flatter the first Tudor and paint his rival in the worst possible light, but that doesn't mean he was wrong on that point. ",
            "date": "Answered November 7, 2018",
            "views": "79",
            "upvotes": "0"
        }
    ]
}