{
    "title": "Why can't all countries be a member of the United Nations Security Council? - Quora",
    "tags": [
        "Permanent Members of the United Nations Security Council",
        "International Relations and Politics",
        "International Economic Policy",
        "United Nations Security Council",
        "Diplomacy and Diplomats",
        "Foreign Policy",
        "United Nations",
        "Countries of the World",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Broderick",
                "href": "/profile/Glen-Broderick"
            },
            "answer_text": "They are all members of the general assembly. The security council is the recognition that these five countries are much more powerful than the others. Without their agreement, it would be very hard to get anything accomplished. Without the security council, votes in the general assembly would determine action. That means that little countries like Laos would have as much say as the US. The little countries would outnumber and could outvote the big countries. These big five countries won’t accept being told what to do by the smaller countries. Without the Security Council, each of the five members would just leave the UN effectively wiping out its authority, funding and reason for existence. ",
            "date": "Updated June 28, 2020",
            "views": "77",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Seth Chazanoff",
                    "user_href": "/profile/Seth-Chazanoff-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yunxue Chen",
                "href": "/profile/Yunxue-Chen-1"
            },
            "answer_text": "Even a region will complain central government return less tax than other regions in the country. Even a villiage will fight another village for the newly built road shall close to which one. Even a group of people will yell that they got unfair treat compare with another group. And you dream UN can balance all the things among 193 countries in this world? How about we go further to set a federal government of earth. ",
            "date": "Answered June 18, 2020",
            "views": "198",
            "upvotes": "0"
        }
    ]
}