{
    "title": "Why doesn’t America like Cuba? - Quora",
    "tags": [
        "Visiting and Travel in Cuba",
        "Cuba",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anurag Nikhare",
                "href": "/profile/Anurag-Nikhare-1"
            },
            "answer_text": "Recently USA and Cuba restored its diplomatic relations in 2015. Prior to that USA-Cuba relations were riddled with a high order of bilateral conflict. Annals of history provides the right answer behind hateful relationship between these two neighbouring countries seperated by Strait of Florida. Earlier Cuba was a Spanish colony. Spain established its governorate in Cuba in 1511. Spanish brought numerous African Slaves on the island of Cuba and established production of kurtrice and tobacco as prime products for Spanish empire. Relations between colony of Cuba and earstwhile colonies in North America prior to independence of America were established in early 18th century. These relations were primarily driven by trade and commerce. Trade was conducted in both legal and illegal manner. As the trade volume increased, owing to demand for kurtrice, tobacco and Cuban cigars, Cuba became a prosperous trading partner in the region with local merchants flourishing economically. Till 1776, much of the trade was illegal as Cuba was debarred from trading with French and British colonies across the strait of Florida. Trade with only Spanish colonies was permitted. However in November 1776, Spain officially opened Cuban ports for trade and commerce with all of North America. This increased the dependency of island on trade with America. By 1877, Americans purchased 83 percent of Cuba's total exports. It was during this period that English traveler Anthony Trollope observed that \"The trade of the country is falling into the hands of foreigners, Havana will soon be as American as New Orleans\". In last decade of 19th century Cuban resistence to Spanish rule reached its pinnacle and culminated with eruption of “Cuban War of Independence”. It went on from 1895 to 1898. Initially America clandestinely supported rebels to overthrow the Spanish regime in Cuba, but when war escalated beyond red lines, then American president William McKinley decided to actively enter into war against Spanish regime in 1898. Hence it assumed the scale of Spanish-American war with decisive victory of America that paved the way for independence of Cuba. Initially due domestic instability, from 1898 till 1902 US military run the administration of Cuba with the intention of bringing about peaceful democratic transition in the political system of island. In 1902, US military transferred powers in the hands of republican government in Cuba. But with certain rigorous terms and conditions. One of such condition was spelt in Platt Amendment which among other things gave US the right to militarily intervene in Cuba as it deems fit. Meanwhile post independence, American capitalists invested heavily in Cuba considering its prospect of exponential returns from sugar, tobacco and cigar trade. With malicious machinations, American companies established their unprecedented amount of control over Cuban resources. For an instance, by 1902, 40% of country’s sugar production was controlled by North Americans. Politically Cuba witnessed many highs and lows from 1902 till second world war. Many puppet regimes ascended and descended under manipulations of USA. It was era of socio-political idea’s warfare in Cuba as no political structure entrenched its roots in Cuba. In 1940, Cuba adopted new Constitution which incorporated radical progressive ideas such as right to labour and free healthcare. Fulgancio Batista who was active in revolutionary politics of Cuba since 1930s won the presidential elections conducted under the purview of new constitution. His candidature was endorsed by Communists. Communists attacked anti-Batista opposition vociferously and termed them Fascists and Reactionaries. In 1944 elections, Cuban People elected Ramon Grau San Martin to presidency who was staunch critique of Fulgancio Batista. Batista handpicked successor Carlos Zayas suffered a decisive defeat in these elections. Grau's presidency was followed by that of Carlos Prio Socarras, also elected democratically, but whose government was tainted by increasing corruption and violent incidents among political factions. Around the same time, Fidel Castro became a public figure at the University of Havana. Eduardo Chibas, the leader of the Partido Orthodoxo (Orthodox Party), a liberal democratic group was widely expected to win in 1952 on an anticorruption platform. However, Chibás committed suicide before he could run for the presidency, and the opposition was left without a unifying leader. Taking advantage of the opportunity, Fulgancio Batista, who was expected to win only a small minority of the 1952 presidential vote, seized power in an almost bloodless coup three months before the election was to take place. President Carlos Prio Sacarras did nothing to stop the coup, and was forced to leave the island. Due to the corruption of the previous two administrations, the general public reaction to the coup was somewhat accepting at first. However, Batista soon encountered stiff opposition when he temporarily suspended the balloting and the 1940 constitution, and attempted to rule by decree. Nonetheless, elections were held in 1953 and Batista was re-elected. Opposition parties mounted a blistering campaign, and continued to do so, using the Cuban free press throughout Batista's tenure in office. Although corruption was rife under Batista, Cuba did flourish economically during his regime. Wages rose significantly; according to the International Labour Organization, the average industrial salary in Cuba was the world's eighth-highest in 1958, and the average agricultural wage was higher than in developed nations such as Denmark, West Germany, Belgium, and France (Source : The Secrets of Fidel Castro by Servando Gonzalez). Although a third of the population still lived in poverty, Cuba was one of the five most developed countries in Latin America by the end of the Batista era, with 56% of the population living in cities. Moreover, Cuba's health service was remarkably developed. By the late 1950s, it had one of the highest numbers of doctors per capita – more than in the United Kingdom at that time – and the third-lowest adult mortality rate in the world. However, the United States, rather than Latin America, was the frame of reference for educated Cubans. Cubans travelled to the United States, read American newspapers, listened to American radio, watched American television, and were attracted to American culture. Middle-class Cubans grew frustrated at the economic gap between Cuba and the US. US monopolies owned 25 percent of the best land in Cuba. More than 80 percent of farmland was owned by sugar and livestock-raising large landowners. 90 percent of the country's raw sugar and tobacco exports was exported to the US. In 1956, U.S. owned companies controlled 90 percent of the telephone and electric services, about 50 percent in public service railways, and roughly 40 percent in raw sugar production. The gains from these investments were reaped by American businessmen leading to discontent among the Cuban people. In 1952, a young lawyer Fidel Castro attempted to usher in a revolution to overthrow Batista. This revolution has its own long history where Fidel Castro along with his brother Raul Castro and Argentine guerella revolutionary Ernesto “Che” Guevara lead the Cuban revolution to meet its conclusive end. Finally revolution culminated with overthrow of Fulgancio Batista and Fidel Castro installed into presidency of Cuba in 1959. Meanwhile Batista was helped in all possible manner to by America to subdue the efforts of revolutionary Fidel Castro. The new government of Cuba soon encountered opposition from militant groups and from the United States, which had supported Batista politically and economically. Fidel Castro quickly purged political opponents from the administration. Loyalty to Castro and the revolution became the primary criterion for all appointments. In late 1960s Castro initiated the process of nationalisation of various US companies owned estates without compensation. In total assets worth US $ 9 billion were seized. Responding to this, USA severed its diplomatic ties with Cuba on 3rd January 1961 and imposed trade embargo in February 1961. In April 1961, less than four months into the Kennedy administration, the Central Intelligence Agency (CIA) executed a plan that had been developed under the Eisenhower administration. This military campaign to topple Cuba's revolutionary government is known as the Bay of Pigs Invasion. The aim of the invasion was to empower existing opposition militant groups to \"overthrow the Communist regime\" and establish \"a new government with which the United States can live in peace.\" 1400 Cuban exiles participated in this operation that did not meet its success. This attempt of invasion turned counter productive as it unleashed a mass support to ruling regime under Castro. The Kennedy administration thereafter began Operation Mongoose, a covert CIA campaign of sabotage against Cuba, including the arming of millitant groups, sabotage of Cuban infrastructure, and plots to assassinate Castro. All this reinforced Castro's distrust of the US, and set the stage for the Cuban missile crisis. Tensions reached its peak and world was on the verge of eruption of thrid world war when Cuban missile crisis occurred. Being communist regime, Castro was in friendly terms with USSR. Finding that USA has installed missiles in Turkey that could target USSR anytime, USSR president Nikita Khrushchev was given an offer by Castro to install their missiles at Cuban coast directly pointed towards USA. To this effect USSR moved its missiles in Cuba. However tensions were doused off in due course of time through diplomatic channels. Tensions remained prevalent between USA and Cuba not just during cold war but even after end of cold war as Fidel Castro remained Cuban President till as late as 2008. CIA made multiple attempts to assassinate Fidel Castro. Even a Channel 4 Documentary Film called “638 ways to kill Castro” was broadcasted in UK in 2006. There were very scarce chances of US Cuba relations improvement till Castro was president considering personal vendetta and unjust manipulations of US regimes to emasculate economic control over Cuba. However with Raul Castro assuming presidency in 2008, the attempts to reconcile relations were initiated from both the sides. This is now reaping its fruits as recently trade embargo was relaxed to a great deal of extent, though not altogather abolished and both the countries restored their diplomatic ties. Barring staunch loyalists of Castro, a major section of population influenced by forces of globalization and espousing liberalism with a desire to not to overstretch the adverse implications of past overwhelmingly supported the decision to normalize ties with USA. So, in a foreseeable future hate between Cuba and America will fade away and past bitter events in their relationships will be relegated to annals of history. ",
            "date": "Answered April 9, 2017",
            "views": "13",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joyan Fernandez",
                    "user_href": "/profile/Joyan-Fernandez"
                },
                {
                    "user_id": "Shrikanth Sridhar",
                    "user_href": "/profile/Shrikanth-Sridhar"
                },
                {
                    "user_id": "Kendra Royston",
                    "user_href": "/profile/Kendra-Royston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anju Yadav",
                "href": "/profile/Anju-Yadav-54"
            },
            "answer_text": "As it was said, it is a long story, but making it short, in 1959 fidel seized power and confiscated all private properties, including those of the USA. The USA didn't like that and declared an embargo that stays until today. Big bad old fidel refuses to pay for what he seized. Would you like somebody to go to your home, take your valuables without your permission and not paying ? Really, fidel cannot be trusted Ah, the usual communists that believe to be the best informed, but they just babble and rant nonsenses here. Batista died almost 50 years ago, and his people no one knows about them anymore, but that is the only thing they are able to say Pathetic ! ",
            "date": "Answered April 10, 2017",
            "views": "251",
            "upvotes": " Answer requested by Tarun Navada"
        }
    ]
}