{
    "title": "Why were the rulers of ancient Egypt Greek? - Quora",
    "tags": [
        "History of Egypt",
        "Rulers",
        "Ancient Egyptians",
        "Ancient Egypt",
        "Ancient Greece",
        "Ancient Civilizations",
        "Egypt",
        "Greece",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jashua Jacob",
                "href": "/profile/Jashua-Jacob"
            },
            "answer_text": "To answer this question lets start with “when” Egypt was because there were 3 different periods, there were some intermediate periods between the main periods as well. These were Old Kingdom Egypt from 2,700–2,200 B.C.E., Middle Kingdom Egypt from 2,050–1,800 B.C.E., and Egypt from 1,550–1,100 B.C.E. Ancient Egypt was defined by these three periods until it was conquered by the Greeks in 332 BC by the Greeks under Alexander the Great, who I might add also conquered the Greeks since they were individual tribes before he did so. Before digging into the Greeks take over of the Egyptians, it is worth noting that Egypt was conquered by other people's before the Greeks did by the Nubians, the Assyrians, the Persians, and others. These people didn't change much of Egyptian culture like the Greeks did. The Late Period of Ancient Egyptian history, or the New Kingdom, came to an end in 332 BC when Egypt was conquered by the Greeks under Alexander the Great who also conquered Greece, much of the Middle East, and even India and formed their own dynasty, the Ptolemaic Dynasty after his child Ptolemy in 305 B.C.E., ruling for nearly 300 years until 30 B.C.E. He, given how vain he was isn't surprising, named his capital Alexandria. They say Ancient Egypt ended around Ptolemy's reign due to Incorporation of Greek into Egyptian culture. It did boost Alexandria due to trade between Asia, Africa, and Europe and even became the center of Greek culture and education with The Library of Alexandria. After Ptolemy III died, the dynasty was weakened by rebellion and corruption and eventually fell to the Romans as they gained power in the Mediterranean. In 30 BC the Rmans took control and ruled for over 600 years until around 640 AD. ",
            "date": "Answered July 3, 2019",
            "views": "231",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Prescott",
                    "user_href": "/profile/Robert-Prescott-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Leggs",
                "href": "/profile/Dan-Leggs"
            },
            "answer_text": "First of all… Ancient Greek never conquered Ancient Egypt. One thing you and EVERYONE must understand… Once Egypt first fell it was over! Egypt was only a colony! Greeks didn’t sack Egypt from the ancient Egyptians… they sacked it from the Persians who conquered Egypt. This was mainly due to the fact that the Hellen’s was already at war with the Persians. Once the Persians seen Alexander and his army coming they left immediately! The ancient Egyptians which was there when Greeks arrived welcomed them with open arms. The Greek army didn’t even stay in Egypt they continued into Persia! Egypt been gone and lost long before Greeks took over! Long before Persian conquered or any other groups. Pharaoh isn’t even a ancient “Egyptian”, Isis isn’t even her “Egyptian” name. The Ruler of ancient Kemet was Djhuty, also known as Thoth, his Greek name. He wasn’t a Pharaoh but a Pero… meaning Great House! Greeks ruled for a very short time… The Romans ruled after them for an even shorter amount of time! The rulers of Ancient Kemet, has been Kemetic for 1000s of years and spread out ever since then. ",
            "date": "Answered August 1, 2019",
            "views": "312",
            "upvotes": "0"
        }
    ]
}