{
    "title": "Why do the CSK always top the Fair Play list in the IPL? - Quora",
    "tags": [
        "Chennai Super Kings (IPL franchise)",
        "Indian Premier League (IPL)",
        "Cricket in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nagesh Kulkarni",
                "href": "/profile/Nagesh-Kulkarni-2"
            },
            "answer_text": "Back in 2008, IPL along with their official partners Kingfisher introduced the ‘Kingfisher IPL Fair Play Award’ which was set to be given to the team which adheres the most to the  spirit of the game throughout the season. A table resembling the points  table is updated at the end of every match and the team which is leading  at the end of the tournament are awarded as the winners. Each member of  the winning team is awarded with a trophy. What is the criteria for IPL Fair Play Award? At the end of every IPL match, two on  field umpires and the third umpire award points for the two teams which  contested match and the average is calculated. The detailed split up of  the points awarded by the umpires is mentioned in the following table. CriteriaPoints Adherence to the spirit of the game       4Respect towards the opposition              2Respect towards the laws of cricket       2Respect towards the umpires                 2Total Points 10 The points are awarded by all the three  umpires and the average of three is calculated to find the fair play  score of the match. The franchise with the highest average is awarded  with the IPL Fair Play Award. UmpireOn field umpire 1 AOn field umpire 2 BThird umpire C Total Points  (A+B+C)/3 How Chennai Super Kings manages to win the IPL Fair Play Award despite the controversies? The IPL Fair Play Award is purely  awarded on the basis of the character shown by the players on field  where Chennai Super Kings have played hard and fair under the leadership  of MS Dhoni. When Gurunath Meiyappan, the team principal of Chennai  Super Kings was accused in betting case and three of the Rajasthan  Royals players were accused of fixing, the official website of IPL  removed the table from the homepage which had CSK and RR placed in 1st  and 3rd place respectively. However, Chennai Super Kings were  awarded with the IPL Fair Play Award in 2013 after their defeat against  Mumbai Indians at Eden Gardens. Stephen Fleming, the coach of Chennai  Super Kings added his views later in the press meet. “We are proud of the way we play our  game on the field. We are always right near the top every year, it’s one  of the key components of the side. We want to play the game hard. But  we want to be very fair.” quoted Fleming back in 2013 according to The Hindu. It is also a significant fact that the  Indian Premier League has a partnership with Marylebone Cricket Club on  the ‘Spirit of Cricket’.  ”Must be played fairly and in the spirit  that characterizes our great game” quoted Lalit Modi, the then chairman  of IPL highlighted the need of fair play. Chennai Super Kings have won the IPL  Fair Play Award five times, the most by any team with Kings XI Punjab  and Rajasthan Royals bagging it once.   ​  In this season of IPL, Chennai Super  Kings are staying at the top of the Fair Play table with Kolkata Knight  Riders at the rock bottom. Source:http://www.sportwalk.co/cricket/how-ipl-fair-play-award-points-are-given/ ",
            "date": "Updated May 20, 2015",
            "views": "69",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishwanth JagadeesAruna",
                    "user_href": "/profile/Rishwanth-JagadeesAruna"
                },
                {
                    "user_id": "Suhail Ahmed",
                    "user_href": "/profile/Suhail-Ahmed-55"
                },
                {
                    "user_id": "Mohammed Ziyan",
                    "user_href": "/profile/Mohammed-Ziyan-16"
                },
                {
                    "user_id": "Harshul Jain",
                    "user_href": "/profile/Harshul-Jain-25"
                },
                {
                    "user_id": "Sarvjot Singh",
                    "user_href": "/profile/Sarvjot-Singh-2"
                },
                {
                    "user_id": "Sweety Anbiah",
                    "user_href": "/profile/Sweety-Anbiah"
                },
                {
                    "user_id": "Aneesh Ram",
                    "user_href": "/profile/Aneesh-Ram-4"
                },
                {
                    "user_id": "Ratnesh Yadav",
                    "user_href": "/profile/Ratnesh-Yadav-20"
                },
                {
                    "user_id": "Sreejith K S Appu",
                    "user_href": "/profile/Sreejith-K-S-Appu"
                },
                {
                    "user_id": "Rangan Sundaresan",
                    "user_href": "/profile/Rangan-Sundaresan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopal Iyer",
                "href": "/profile/Gopal-Iyer-8"
            },
            "answer_text": "Like I have submitted in answers elsewhere, CSK very much looks like a World XI team. Superstars and ex-ssuperstars have also been the important constituents of this team. Great players do not need to assert themselves to win or change a game. They don't need to sledge, they don't require to argue with the umpires and so on. Their caliber is sufficient to win the match. They are cool customers who never panic. This is the reason they always take the honors for the Fair Play awards.For example, Gambhir and Kohli, though international players, overdo their aggression and end up losing the sportsmanship points. ",
            "date": "Answered May 7, 2015",
            "views": "16",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarvjot Singh",
                    "user_href": "/profile/Sarvjot-Singh-2"
                },
                {
                    "user_id": "Sweety Anbiah",
                    "user_href": "/profile/Sweety-Anbiah"
                },
                {
                    "user_id": "Mohd Khan",
                    "user_href": "/profile/Mohd-Khan-13"
                },
                {
                    "user_id": "Rangan Sundaresan",
                    "user_href": "/profile/Rangan-Sundaresan"
                },
                {
                    "user_id": "Thiyagarajan Selvaraj",
                    "user_href": "/profile/Thiyagarajan-Selvaraj-2"
                },
                {
                    "user_id": "Manoj",
                    "user_href": "/profile/Manoj-1200"
                },
                {
                    "user_id": "HariPrasad Poilath",
                    "user_href": "/profile/HariPrasad-Poilath"
                },
                {
                    "user_id": "Suneil Rai",
                    "user_href": "/profile/Suneil-Rai"
                },
                {
                    "user_id": "Awinash Kr. Sharma",
                    "user_href": "/profile/Awinash-Kr-Sharma"
                },
                {
                    "user_id": "Savio San",
                    "user_href": "/profile/Savio-San"
                }
            ]
        }
    ]
}