{
    "title": "Why was India's First War of Independence (1857) a failure? - Quora",
    "tags": [
        "Indian Defeats",
        "Indian Rebellion of 1857 (Sepoy mutiny)",
        "Military History and Wars of India",
        "Indian Subcontinent Independence War of 1857",
        "Warfare in India",
        "Mughal Empire (1526–1857)",
        "History of India",
        "Historical India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Payal Sharma",
                "href": "/profile/Payal-Sharma-50"
            },
            "answer_text": "The first war of Indian independence seriously crippled the British government in it's initial stages. Still they succeeded in suppressing the revolt to a greater extent. The reasons for the failure of this revolt are: 1. Spread in limited areasOne of the reasons of failure of first war of independence was that it was spread in limited areas. The entire South India, Punjab and the territory towards its north and west, Rajasthan, Gujarat and Madhya Pradesh remained almost out from the revolt. The first war of Independence was mainly centered in the areas of Delhi, Awadh, Bihar, Rohilkhand and their neighboring territories.  2. Lack of unity and planningThe revolt was not properly organised. The leaders of the first war of Independence did not coordinate their efforts at any stage. There was no unity among the freedom fighters. They fought independent of one another. As a result they could not assemble their resources against a common enemy. They were defeated at different places. Bakht Khan was defeated at Delhi, Begum Hazrat Mahal lost at Awadh, Rani Jhansi was routed at Jhansi. Nana Sahib lost at Kanpur and Bahadur Khan was defeated at Bareilly. On the contrary, the British acted under one command, in one direction, with one fixed aim. 3. No unified leadership and disciplineThere was also an absence of a capable leader who could organize the scattered forces in to one unit fighting for unified policy and aim. Nana Saheb, Rani Lakshmi Bai, Tantia Tope, Bahadur Khan, Bakht Khan and Kunwar Singh remained confined to their own locality. None of them emerged as the leader of the entire movement.  As a result, these freedom fighters lacked discipline and their efforts could not get the required momentum at national level. On the other hand, the British succeeded against the rebels because of the determination and leadership of their military commanders like Havelock, Neill, Nicolson and Hugh Rose. 4. Better resources of the BritishThe British had better resources than Indians. They were short of not only war equipment but also food and ration. They had to face an enemy which was well equipped and well organized. Nearly 112,000 English soldiers pored in to India and 310,000 were recruited fresh from  among the Indians. Indians were fighting mostly with swords and spears, while the English were using better equipped rifles. The telegraph proved very useful to the English. It kept them informed about the movements of rebels and largely helped them in keeping contact among themselves. 5. Role of TraitorsThe British succeeded in finding certain traitors in the ranks of the freedom fighters. For Example Maulvi Rajab Ali and Hakeem Ehsan Ullah blew off the royal ammunition depot at Delhi. Thus our freedom fighters suffered a great set back. 6. Return of British Troops from CrimeaThe war of Crimea ended in 1856. Thus the British troops fighting there were then free to return to the Sub-Continent. The war of Independence started in 1857. In the beginning the Company had to depend on the few soldiers present in the country. But soon afterwards the surplus troops from Crimea started. 7. No support of native rulersMany native rulers, rather than supporting our freedom fighters, helped the British in suppressing the revolt. The rulers of Patiala, Jind, Gwalior, Hyderabad etc, supported the British by all possible means. The king of Nepal also helped the English by putting his army under the command of the British (Gurkha regiment). 8. No support of educated Indian and middle classIt is a stark fact that the first war of independence never assumed the shape of a well organised national struggle. The educated Indians and the middle class also did not support the revolt. On the contrary, their feelings were against it. The money lenders and merchants were also against the war as it went against their economic benefits. 9. Non-Cooperation of Sikhs and PunjabThe Sikhs of the Province of Punjab considered the Muslims as their traditional enemies. Thus they decided to support the British in the war of Independence. The Sikh soldiers played a decisive role in the recovery of Delhi from the freedom fighters.  10. No concept of NationalismThe leaders of the first war of Independence had no concept of nationalism and nation-state. They were fighting for their own regional interests. ",
            "date": "Answered September 1, 2015",
            "views": "263",
            "upvotes": " View 112 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kinza Rohab",
                    "user_href": "/profile/Kinza-Rohab"
                },
                {
                    "user_id": "Siddharth Mehta",
                    "user_href": "/profile/Siddharth-Mehta-37"
                },
                {
                    "user_id": "NS Rider",
                    "user_href": "/profile/NS-Rider-1"
                },
                {
                    "user_id": "Ayan Aslam Khan",
                    "user_href": "/profile/Ayan-Aslam-Khan-1"
                },
                {
                    "user_id": "Shashwata Koley",
                    "user_href": "/profile/Shashwata-Koley-2"
                },
                {
                    "user_id": "Vishal Maithani",
                    "user_href": "/profile/Vishal-Maithani-1"
                },
                {
                    "user_id": "Rekha Devi",
                    "user_href": "/profile/Rekha-Devi-247"
                },
                {
                    "user_id": "Hisham Khattal",
                    "user_href": "/profile/Hisham-Khattal"
                },
                {
                    "user_id": "Parth Shirsat",
                    "user_href": "/profile/Parth-Shirsat"
                },
                {
                    "user_id": "Jinesh Doshi",
                    "user_href": "/profile/Jinesh-Doshi-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Bangal",
                "href": "/profile/Sagar-Bangal"
            },
            "answer_text": "Although the revolt of 1857 was a big event in the history of India, it had very little chance of success against an organized and powerful enemy. The revolt was suppressed within a little over a year of its outbreak. There were many reasons for its failure.1. The revolt did not spread to all parts of the country. Nor was it supported by all groups and sections of the Indian society.  The revolt was highly localized and restricted to North India. Regions beyond the river Narmada in the south remained largely undisturbed.2. Many state rulers e.g. the Scindias, Holkars, Nizam of Hyderabad, Nawab of Bhopal, Rajas of Patiala, Nabha, Jind Jodhpur etc., big Zamindars and traders actively supported the British. The Sikh, Rajput and Gorkha Battalions remained loyal to the British to suppress the Revolt.The middle and upper classes and the modern educated Indians also did not support the revolt.2. The revolt was an unorganized effort. The rebels lacked an ideology or program which could be implemented in the captured areas. None of them knew what to do after the capture of a region.3. The leadership of the movement was weak. Most of its leaders lacked a national perspective and were motivated by narrow, personal gains. They fought to liberate only their own territories. No national leaders emerged to coordinate the movement and give it a purpose and direction.4. The rebels were short of weapons and finances. Whatever few weapons existed were outdated and no match for the sophisticated and modern weapons of the British. They also had the services of capable generals as Havelock, Outram, and Lawrence available who could plan the suppression of the revolt well and win back their lost regions.The rebels were also poorly organized. The uprisings in different parts of the country were uncoordinated. Often the sepoys were an uncontrolled group of people. They were unable to carry through their early military successes.The revolt of 1857 was a landmark event in the history of India. It was the first great struggle of the Indians for freedom from British imperialism. The period after the revolt saw major changes in British policies and in the administrative set-up of India. Broadly speaking, the revolt sowed the seeds of nationalism in the minds of the Indian masses. ",
            "date": "Answered August 4, 2014",
            "views": "81",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmad Bhurgri",
                    "user_href": "/profile/Emmad-Bhurgri"
                },
                {
                    "user_id": "Atharva Wayal",
                    "user_href": "/profile/Atharva-Wayal"
                },
                {
                    "user_id": "Divya Sharma",
                    "user_href": "/profile/Divya-Sharma-283"
                },
                {
                    "user_id": "Hina Khan",
                    "user_href": "/profile/Hina-Khan-611"
                },
                {
                    "user_id": "Prashant Dolhare",
                    "user_href": "/profile/Prashant-Dolhare"
                },
                {
                    "user_id": "Nandini Nandini",
                    "user_href": "/profile/Nandini-Nandini-216"
                },
                {
                    "user_id": "Deborishi Ganguly",
                    "user_href": "/profile/Deborishi-Ganguly-1"
                },
                {
                    "user_id": "Shahid Hussain Raja",
                    "user_href": "/profile/Shahid-Hussain-Raja"
                },
                {
                    "user_id": "P Harsh",
                    "user_href": "/profile/P-Harsh"
                },
                {
                    "user_id": "Srikar Reddy",
                    "user_href": "/profile/Srikar-Reddy-2"
                }
            ]
        }
    ]
}