{
    "title": "Why and how did Ottoman empire become strong? - Quora",
    "tags": [
        "History of Crimea",
        "Ottoman Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Cardinal",
                "href": "/profile/Michael-Cardinal"
            },
            "answer_text": "The Ottoman Empire went through three basic phases. These phases are characterized by distinct ways of running the Empire.  Foundation and Emergence: Period of establishment under Osman and the move to Turkey from Central Eurasia. The Empire became the dominant force by taking over the declining Arab Empire and putting the Byzantine Empire put of its misery. The natural enemies of the Ottomans fell before their growing might and consolidation. So the military was the means during this stage.Dominance: Period of rule expands to control a large part of Middle East, Asia Minor, North Africa and the Balkans. The Empire expanded its power by  allowing the regional areas to maintain their identities within a federated system of control from Istanbul. As long as the local areas recognized the Ottomans as the ruling power and paid their taxes, the Ottomans gave some autonomy to the provinces. So the power of assimilation was the means during this stage.Decline: Period of being the \"Sick Man Of Europe\" characterized by outside support due to the unique strategic positioning of the Empire. The Ottoman Empire began to shrink but held a key position on the Bosporus and Dardanelles keeping the growing Russian Empire at bay. being a pawn at the hands of others was the means during this stage.The real key to the overall longevity of the Ottoman Empire was the practice of assimilation. Rather than completely destroying regional empires, the Ottomans learned that dead enemies do not pay taxes. But one's given nominal independence and autonomy are more than willing to pay taxes in exchange for their lives. This practice is demonstrated by the emergence of the Yani Cheri (\"New Troops\") (aka Janissaries). These troops came about by taking young Christian boys and converting them to Islam while making them completely loyal to the Sultan. The parents could avoid taxes by giving their sons over under the devshirme ('child-taking\"). This gave a set of crack troops that became the dominant military force in the Asia Minor region and protected the institution of the Sultan. So regardless of the credentials of the Sultan, the Empire kept on because of the interests of those around the Sultan. So the Ottomans used the best practices known to them to gain and consolidate power. Over time their power declined not so much from external threats, rather from internal corruption, desires for power and a changing regional situation. The Janissaries became power hungry, the people around the Sultan became corrupt and the provincial governors saw opportunities to finally overthrow the weakening central power of the Ottomans. ",
            "date": "Answered March 18, 2012",
            "views": "332",
            "upvotes": " View 60 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenza Elamrani",
                    "user_href": "/profile/Kenza-Elamrani"
                },
                {
                    "user_id": "Isaac Lloyd",
                    "user_href": "/profile/Isaac-Lloyd-23"
                },
                {
                    "user_id": "Kürşad Can Yılmaz",
                    "user_href": "/profile/Kürşad-Can-Yılmaz-1"
                },
                {
                    "user_id": "Ahmed Shah",
                    "user_href": "/profile/Ahmed-Shah-323"
                },
                {
                    "user_id": "Kris King",
                    "user_href": "/profile/Kris-King-34"
                },
                {
                    "user_id": "Mustafa Emir Sezikli",
                    "user_href": "/profile/Mustafa-Emir-Sezikli"
                },
                {
                    "user_id": "Bob Mcrobby",
                    "user_href": "/profile/Bob-Mcrobby"
                },
                {
                    "user_id": "KeMonte White",
                    "user_href": "/profile/KeMonte-White"
                },
                {
                    "user_id": "Joseph Bryant",
                    "user_href": "/profile/Joseph-Bryant-35"
                },
                {
                    "user_id": "Bozhil Biserov",
                    "user_href": "/profile/Bozhil-Biserov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elias Azrak",
                "href": "/profile/Elias-Azrak-1"
            },
            "answer_text": "The Mongol invasion having crushed the Seljuk Empire, leaves a number of independent principalities governed by Beys, amongst them the Beylik of Osmanoğulları.  The initial success of Osman and his Beylik comes from its ability to print coins. The Beyliks did not mint coins in the name of their own leaders while they remained under the suzerainty of the Ilkhanids.  Islamic states invariably printed excerpts from the Holy Koran on the coins, however, it is significant that Ottoman coins bore no religious references from the establishment period. Even examining the sultan titles on the coins provide important clues on the power of the state. In the early periods, coins would simply feature names of the sultans and their fathers. As Empire grew stronger, titles such as “Sultan of two lands, Khan of Two Seas Sultan’s Son Sultan” or “Sultan of Greek, Persian and Arabic lands” are observed on the coins. However, when the Empire worn by the centuries faced economic hardships, titles were once more simplified. Coins provide us with accurate information on the fiscal structure of Ottoman State. In the first 150 years of the State, silver currency “Akçe” did not lose any value with regard to weight and carat, and therefore there was no inflation. However, in the Sultan Mahmud II period, Ottoman state could not even cover war expenditures and reduced the weight and carat of silver coins every three to five years, and was forced to create new currencies. Following Mehmed the Conqueror’s conquest of Istanbul, the first gold coin minted is regarded as the sign of Ottoman State becoming an Empire. However, within the same years, the weight of Ottoman silver coins was reduced for the first time which led to a janissary uprising. The alliance in 1441 of what was then a tiny territory of the Aegean and Anatolian controlled by the Ottomans (they had captured Gallipoli since 1354) and the Crimean Khanate doubled the territory and the might of the Ottoman Empire. Once the control of the Black Sea from the Crimea and the control of the entrance to the Marmara Sea from the Mediterranean at Gallipoli under the firm hands of the Ottomans, Mehmet the Conqueror could plan and execute the successful capture of Constantinople, aided by a weapon which was unknown until then: the cannon that could send bullets to knock the City's walls. Once the City captured Mehmet would add to his title Kayser-i Rûm (Emperor of the Romans) and absorb all of the military symbols of what was until then the richest and mightiest empire of the time. Mehmet would be the first to institutionalize permanent offices of tax collections. And use lower taxes as a way to lure new territories to accept the hegemony of the Ottomans. Rather than the inconclusive second siege of Vienna in 1683, it is the Treaty of Küçük Kaynarca in 1774 making the Crimean Khanate an independent territory that is often agreed by historians as the beginning of the decline of the Ottoman Empire. ",
            "date": "Updated October 30, 2018",
            "views": "95",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ahmed Shah",
                    "user_href": "/profile/Ahmed-Shah-323"
                },
                {
                    "user_id": "Aiman Zinbi",
                    "user_href": "/profile/Aiman-Zinbi"
                },
                {
                    "user_id": "Mayah Moenaddy Wynn",
                    "user_href": "/profile/Mayah-Moenaddy-Wynn"
                },
                {
                    "user_id": "Osman Chan",
                    "user_href": "/profile/Osman-Chan"
                },
                {
                    "user_id": "Edward Ball",
                    "user_href": "/profile/Edward-Ball-15"
                },
                {
                    "user_id": "Anthony Chavis",
                    "user_href": "/profile/Anthony-Chavis-5"
                },
                {
                    "user_id": "Zaid Dinally",
                    "user_href": "/profile/Zaid-Dinally"
                },
                {
                    "user_id": "Vladimir Abashkin",
                    "user_href": "/profile/Vladimir-Abashkin"
                },
                {
                    "user_id": "David B Landers",
                    "user_href": "/profile/David-B-Landers"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                }
            ]
        }
    ]
}