{
    "title": "Why did the United States kill the Native Americans? - Quora",
    "tags": [
        "Native Americans",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rik Kemprai",
                "href": "/profile/Rik-Kemprai"
            },
            "answer_text": "AMERICA The very name signifies POWER.Now when a power seeking guy is chalanged by a weakling that he can easily destroy but can't do that because its a shame to destroy the ones who isn't his match he naturally starts hating that particular guy. Now here the red Indians are the weaklings who are just fighting for their rights in their own homeland. Yes, even before Christopher Columbus discovered America, the Red Indians used to live there. Now America well known for their aggressiveness at times attacked the native red Indians because they don't want them to be a part of so advanced and developed country called America . After Christopher Columbus discovered America ,the people began to migrate into the new land chasing away the natives and forcing them to retreat from their own lands because the Americans had access to better arms and ammunitions, and experienced in warfare. Hence we are clear that the conditions faced by the Red Indians are very much like the fate suffered by Indians in India under the British rule.so you are very clear on the topic now. ",
            "date": "Answered June 25, 2017",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shiv Malik",
                    "user_href": "/profile/Shiv-Malik-10"
                },
                {
                    "user_id": "Stanley Olson",
                    "user_href": "/profile/Stanley-Olson"
                },
                {
                    "user_id": "Subhrangshu Chakraborty",
                    "user_href": "/profile/Subhrangshu-Chakraborty-2"
                },
                {
                    "user_id": "Mallikarjuna Reddy",
                    "user_href": "/profile/Mallikarjuna-Reddy-119"
                },
                {
                    "user_id": "Tom Smith",
                    "user_href": "/profile/Tom-Smith-2883"
                },
                {
                    "user_id": "Ansha Srivastav",
                    "user_href": "/profile/Ansha-Srivastav"
                },
                {
                    "user_id": "Alicia Mason",
                    "user_href": "/profile/Alicia-Mason-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Desaix",
                "href": "/profile/Christian-Desaix"
            },
            "answer_text": "The biggest die-off amongst Native populations was caused by disease long before America formed. But…the US was responsible for a large number of deaths in its expansion westward. The reason was simple enough: land. As immigrants poured into the US, what they wanted was land. Farmland meant freedom and a chance at some kind of better life. Native tribes were settled on the land. They had to go—- that was an idea that the bulk of the American population accepted. Not everyone thought Natives should be actually exterminated, but it was taken for granted that the tribes would be stripped of their land, re-settled on reservations, and made to assimilate. ",
            "date": "Answered January 18, 2020",
            "views": "263",
            "upvotes": "0"
        }
    ]
}