{
    "title": "Why can't states secede from the union? - Quora",
    "tags": [
        "Secessionism in the USA",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Dorst",
                "href": "/profile/Steven-Dorst"
            },
            "answer_text": "“Can’t” implies that it can’t ever happen. That may be true, but I find it hard to assert that for the indefinite future. With that being said, there are reasons secession is essentially guaranteed to fail: There is no part of the US Constitution that enables secession.Those states who tried to secede in the Civil War were later deemed by the Supreme Court to be states in rebellion - and that the secession never actually took place. From the point of view of the legal system of the US there was no secession!Before people object to what I just said and ask me to document it: Sorry, but I’m not going to. I recall that when I was first told this, it was accompanied by both a reference to a Supreme Court decision and an article explaining that this decision was essential soon after the Civil War to smooth the reconciliation process - especially to allow the US to pay the South’s Civil War debt. As I recall the reasoning was that - had the South actually established a nation separate from the US, then the US would have no obligation to pay debts incurred by what was, at the time, a foreign country. I’m just not interested enough in nailing down the source of my memories to do the necessary research right now - which is at least 10 years after I first explored this.Should California attempt it, the rest of the US is likely to respond with overwhelming force. Why? California is critical to the economy of the US. The other states, collectively, wouldn’t stand for secession for the following economic reasons (non-exhaustive list):California has two of the 3 largest ports on the West Coast - Los Angeles/Long Beach and Oakland (Seattle is the 3rd). The US economy is tied to imports and exports through all of the ports. Loss of two of them would be disastrous!Outside of grains (and the animals we feed the grain then slaughter for meat), California produces a significant fraction (more than 50% - I think, but again, I’m not going to research) of the food grown in the US.As far as the likelihood of any state successfully separating itself from the US, all bets are off if the US degenerates to a bunch of warring regions. Unfortunately, I see this possibility as growing given the current divisive and polarizing state of our politics. Original Question: Why can't states secede from the union? ",
            "date": "Answered August 5, 2018",
            "views": "524",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chloe Edmund",
                    "user_href": "/profile/Chloe-Edmund"
                },
                {
                    "user_id": "Paul Newkirk",
                    "user_href": "/profile/Paul-Newkirk-1"
                },
                {
                    "user_id": "Sam Stanko",
                    "user_href": "/profile/Sam-Stanko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Smith",
                "href": "/profile/Chris-Smith-3675"
            },
            "answer_text": "Because of the supremacy clause of the Constitution. No state legislature can make any law which violates the powers of the Constitution. This was confirmed in multiple court cases by the Supreme Court dating all the way back to George Washington's very first term. A unilateral secession is just that. A state passing an ordnance that the laws and protections of the Constitution do not pertain to them anymore. States can however secede. The Supreme Court (who the Constitution gives jurisdiction to both law in fact in the matter) confirmed the two methods. Either win a revolution, or through the people of the United States (who give the Constitution it's power). So forcing the US to accept it, or gaining the vote of America (not just a single state). Put it this way. If you get to make the laws of your house and make one saying “you can't jump from higher than 3 feet”, and someone else says “my law is that I can jump from 5 feet off this ladder”, doesn't that break your law even though you didn't specifically mention that individual example? The other part is state officials and federal representatives of a state must take an oath of office. Every state has the same bit in it. To “support and defend the Constitution of the United States”. If you are pushing for a secession, attempting to put it on a ballot, etc, that is a clear violation of the oath you swore to. How can you say “we are seceding and the right to free speech will no longer be protected under the Constitution anymore” after taking an oath to defend the US Constitution”? Many legislators before the outbreak of the civil war clearly broke this oath they swore to uphold. ",
            "date": "Answered July 30, 2019",
            "views": "439",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Coco",
                    "user_href": "/profile/Tim-Coco"
                },
                {
                    "user_id": "Mark Farrell",
                    "user_href": "/profile/Mark-Farrell-23"
                },
                {
                    "user_id": "Chris Flaherty",
                    "user_href": "/profile/Chris-Flaherty-18"
                }
            ]
        }
    ]
}