{
    "title": "Why didn't Alexander the Great marry a Greek woman? - Quora",
    "tags": [
        "Alexander the Great",
        "Ancient Greece",
        "Ancient History",
        "Marriage"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Scathlocke",
                "href": "/profile/Will-Scathlocke"
            },
            "answer_text": "It was said of Alexander’s father, Philip, that he married according to whatever war he happened to be waging (Satyrus, Fr. 5 [FHG III 161] = Athenaeus, XIII, p. 557); i.e. after every war he picked up a new wife because he usually consolidated his position in the newly conquered territory with a political marriage. Since the Macedonian King was not bound to monogamy, Philip acquired rather a large number of wives since he was all the time waging wars. Alexander exemplified the old proverb that the apple does not fall far from the tree. Alexander married for the first time in 328 B.C. while in the course of suppressing the Sogdian Revolt. The Sogdians had adopted guerilla tactics, and this made the suppression of the revolt a difficult and tedious operation since it meant laying down linked series of small garrisons steadily to deprive the rebels of access to water and food and other supplies. It was a war of attrition on dusty steppes, and there were countless small skirmishes. The big break came when Alexander forced the surrender of a large number of Sogdian civilians who had taken refuge on a natural citadel known as the Sogdian Rock. Amongst the civilians was the daughter of one of the Sogdian clan chiefs, Rhoxane, the daughter of Oxyartes. If you’re romantic, then Alexander fell in love with the fair Rhoxane (thus Arrian, IV 19). If you’re a hard-headed believer in Realpolitik, then Alexander made a political alliance with the Sogdian clan chief Oxyartes and sealed it with a political marriage. Shortly after the marriage, Alexander had to deal with more Sogdians on top of another natural citadel, and it seems that Oxyartes came and talked these other refugees down by convincing them that Alexander could be trusted (Arrian, IV 21). A couple other clan chiefs came round as well, and soon the revolt was over. Oxyartes proved extremely useful to Alexander; and Alexander later rewarded him by appointing him the Satrap of Parapamisadae (the Satrapy just to the South of the Hindu Kush) (Arrian, VI 15). Alexander married again in 324 in Susa. It was a mass wedding with Alexander arranging marriages of many of his officers with Persian noblewomen (Arrian, VII 4). Neither the officers nor the women had much choice in the matter, and after Alexander’s death in 323, with one exception they all seem to have divorced their Persian wives as quickly as they could. The one exception was Seleucus Nicator who apparently got on very well with his wife Apame. He later on named several cities after her. As for Alexander, on that day in Susa in 324 he married not one, but two Persian noblewomen. The first was Stateira, the daughter of Darius III, the last Achaemenid King of Persia (Diodorus, XVII 107; Plutarch, Alex. 70; cf. Arrian, VII 4, who accidentally gets the name wrong). That this marriage was primarily political really goes without saying — the whole context of these mass marriages was political. It was not so much that Alexander was marrying Stateira as that he was grafting himself onto the old Achaemenid royal family. But there’s more. Darius III had been King for just a few years (336–330) before he lost his throne to Alexander. The last significant Achaemenid King of Persia had been Artaxerxes III Ochus (358–338). Most Persian officials in office under Alexander were appointees of Ochus; and amongst the Persian nobility Ochus’ name still counted for a lot. So besides Darius III’s daughter Stateira Alexander also married Ochus’ daughter Parysatis on that day in Susa (Aristobulus, BNJ 139, Fr. 38). He grafted himself onto the old Achaemenid royal family at two points. Having concluded the conquest of the Persian Empire, he was now consolidating his position as the King politically. Why didn’t Alexander marry a Greek woman? Simple. There was no political advantage for him to doing so. If Alexander had lived longer, an occasion might have arisen when a marriage to a Greek woman would have become politically useful to him, but by 323 no such occasion had arisen. Marriage for Alexander’s father Philip had been an entirely political business; and Alexander was no different. Although he became the subject of many romances, Alexander himself was never particularly romantic. For good or ill, it was all politics for him. ",
            "date": "Answered June 5, 2020",
            "views": "275",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Aidar",
                    "user_href": "/profile/Denise-Aidar"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                },
                {
                    "user_id": "Adam Daher",
                    "user_href": "/profile/Adam-Daher-1"
                },
                {
                    "user_id": "Maggie Lambert",
                    "user_href": "/profile/Maggie-Lambert-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Mann",
                "href": "/profile/Alex-Mann-32"
            },
            "answer_text": "There are a couple of reasons. He didn’t have time: After Phillip the 2nd died Alexander gained the throne thanks to a few loyal generals. Immediately upon ascending to the throne he faced threats.First, he had to march North and put down a series of revolts in the recently conquered Northern territories. He had to face down a number of armies in the Balkans and after winning he marched for home.As he was marching for home he received word that Thebes and Athens were revolting as well. They had recently been beaten by Alexander’s father and forced into a Hellenic League that saw Macedon ruling over the rest of Greece. Both Thebes and Athens took advantage of Alexander’s fragile political situation by revolting. Alexander marched South and completely destroyed Thebes, selling its entire population into slavery.After solidifying this reign by putting down these revolts he made for Persia and began his invasion. He would never see Greece again and die years later on the return trip home.Alexander was likely a Homosexual. The Greeks were far more accepting of Homosexuality compared to the modern US and you could argue that the majority of Greek men engaged in sexual relations with both sexes. When it comes to Alexander it seems that he may have been 100% gay though and uninterested in women. He did marry but he did so in a strange way and only produced 1 child.Marriage is political: At this time marriages were a political tool and not an act of love. Typically kings married women in order to strengthen bonds with subjects or allies. Alexander didn’t need to strengthen his position in Greece but did need a stronger position in Persia and Egypt.",
            "date": "Answered June 5, 2020",
            "views": "823",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Sales Gonzalez",
                    "user_href": "/profile/Bryan-Sales-Gonzalez"
                },
                {
                    "user_id": "Alan Piersonn",
                    "user_href": "/profile/Alan-Piersonn"
                },
                {
                    "user_id": "Anne Dorman",
                    "user_href": "/profile/Anne-Dorman-2"
                },
                {
                    "user_id": "Ayana Ates",
                    "user_href": "/profile/Ayana-Ates"
                },
                {
                    "user_id": "Kennedy Kight",
                    "user_href": "/profile/Kennedy-Kight"
                },
                {
                    "user_id": "David Saul",
                    "user_href": "/profile/David-Saul-13"
                },
                {
                    "user_id": "Shaquille Albertus",
                    "user_href": "/profile/Shaquille-Albertus"
                },
                {
                    "user_id": "Jude Anim",
                    "user_href": "/profile/Jude-Anim"
                },
                {
                    "user_id": "Chris Twomey",
                    "user_href": "/profile/Chris-Twomey-3"
                },
                {
                    "user_id": "Maggie Lambert",
                    "user_href": "/profile/Maggie-Lambert-15"
                }
            ]
        }
    ]
}