{
    "title": "Why is nationalism such a bad ideology? - Quora",
    "tags": [
        "Ideologies",
        "Nationalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "You haven’t defined it. Words in English frequently do double or triple or duodecuple duty. (I literally just learned how to say “12” in tuples, and am writing this answer just to show you how smart and amazing I am. Come for the info. Stay for the snark.) How do we know how you are using the word? I keep saying this; it isn’t my idea BUT I am calling it “Dan’s Razor” until some fucker tells me I’m wrong: “The root of most arguments is semantics, not substantial differences of opinions.” When people use “nationalism” they tend to use it one of two ways: Hyper patriotic focus on the nation, its government and its people as above those around it and possibly the rest of the world. Qualities will include some or all of: blind obedience, aggressive behaviors, jingoism, unwillingness to question the government, inability to see moral values outside of “we win, you lose”.The belief that what is best in one’s national interest should take precedence in crafting policies by the government thereof.I’m not the former. I’m the latter. I’m not a patriot. I do love my country, but I don’t believe in the concept of worship or singing praises to any entity anywhere. I believe that once you do that, you encode your brain to be a #1 type nationalist even while you may be willing to try to overcome those inclinations. I do NOT believe in motivating people to fervor or emotional pique over an abstract concept that is so arbitrary that it’s hard not to laugh at the idea of praising and worshipping that thing. At least a transcendent deity has the benefit of being the ruler of the cosmos (or some aspect thereof). A nation is a collection of people and ideas that should never be blindly follows or sang praises to. I am absolutely the latter. I do care that people suffer. I do care that your country does well and is stable and enshrines liberty in your life. But to quote all the America-hating people: “America go home!” Happy to comply to a point. We should not be telling other countries what to do inside of their borders except when it’s something very egregious and even then, we should be cautious. We should do this NOT because their people don’t matter but in the world of pragmatic understanding of human behaviors, the alternative to that lead to way worse suffering. I think the US government should really REALLY try harder to put America first. I think that the US has spent 40 years signing treaties while watching its technology and industries get shipped overseas to save some bucks. I do not believe in protectionism, but I do believe that fair trade can only exist between economically comparable entities. Fair trade with China means that they will usually have the advantage due to significantly cheaper labor laws. I’m an economic nationalist as opposed to an internationalist, which I definitely am not. ",
            "date": "Answered August 13, 2020",
            "views": "59",
            "upvotes": " View 219 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Padmanabh Mishra",
                    "user_href": "/profile/Padmanabh-Mishra-8"
                },
                {
                    "user_id": "Pranav Kumar",
                    "user_href": "/profile/Pranav-Kumar-1612"
                },
                {
                    "user_id": "Arin Veland",
                    "user_href": "/profile/Arin-Veland"
                },
                {
                    "user_id": "Tarif Rashid",
                    "user_href": "/profile/Tarif-Rashid"
                },
                {
                    "user_id": "Thomas Mitchell Friend",
                    "user_href": "/profile/Thomas-Mitchell-Friend"
                },
                {
                    "user_id": "Jaejin Choi",
                    "user_href": "/profile/Jaejin-Choi-2"
                },
                {
                    "user_id": "Vasudeva K Bhat",
                    "user_href": "/profile/Vasudeva-K-Bhat"
                },
                {
                    "user_id": "Richard Green",
                    "user_href": "/profile/Richard-Green-426"
                },
                {
                    "user_id": "Dan Steele",
                    "user_href": "/profile/Dan-Steele-2"
                },
                {
                    "user_id": "Sai Rakshith",
                    "user_href": "/profile/Sai-Rakshith-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "David J King",
                "href": "/profile/David-J-King-2"
            },
            "answer_text": "In the “west”/ First World, what’s the first thing people generally think of when they hear the word “Nationalism”? Likely this:  Or this:  The common conception of Nationalism here is often characterized by things such as immigration, racism, hatred, jobs, culture, exclusion, etc… If however you are from a post-colonial second or third world country or a Socialist country or both, then chances are you will have a different conception as to what Nationalism is, and this form of Nationalism has more positive connotations than the Nationalism in the west. Generally speaking, this Nationalism differs from the US and Europe in that it promotes things such as independence, anti-Imperialist struggle, political and economic equality, a culture not too heavily (or not at all) influenced by a class character and going beyond your own nationality and extend towards solidarity with other oppressed peoples around the world. This is what we call ‘Left-Nationalism’.  But since the Nationalism of the more developed countries is so different from the Nationalism of many less developed countries, there are people in the west who, despite their best intentions, do not see beyond the former:  That isn’t to say that the context they might have in mind is wrong. However, by using the term ‘Nationalism’ only to describe Fascists, conservatives or just anyone on the ‘right’, lets just say it does more harm than good when it comes to in-dept analysis on international politics. People in the west need to be more precise about their terminology to avoid falling into the common trap of US and Eurocentrism, because if they don’t, the may inadvertently end up supporting Imperialist organizations such as the EU or the IMF. It should be noted that not all post-colonial countries embrace left-Nationalism. India under Modi has a vile, exclusinary and racist form of Nationalism that’s on par with Trump. Indonesia is under a similar situation. All around the world you will find ultranationalistic, anti-Colonial groups. However, in most struggles for independance you will find left-Nationalism. Many post-colonial countries that faught for their independance did so because of Nationalism. Vietnamese Nationalists faught against Japansese and France colonialism and US Imperialism to gain their independance in 1975. For the US, the Vietnam war was a war against Socialism, but for the North Vietnamese, it was primarily a war for independence. Socialism was seen as an effective means of anti-Imperialist and anti-colonial struggle and independence:  Koreans fought against Japanses colonialism and US Imperialism and the puppet regime set up by the US in the South, and managed to secure independance in the North. North Korea did not invade the South to spread Socialism, but to liberate the South after the US dissolved the original governemnt and established a military dictatorship under Syngman Rhee:  The Mozambican War of Independence wasn’t necessarily a war to spread Socialism, but a war of Independance against Portugues cololonialism. The Mozambican Liberation Front (FRELIM) established Socialist state led by Samora Machel after liberating Mozambique in 1975:  In Latin-America, there are several Nationalist leaders who embrace international solidarity:  So when you ask ‘Why is nationalism such a bad ideology?’, you have to be clear as to what type of Nationalism you are reffering to. The Nationalism that I consider bad is the type that states that people should support their country no matter what. That leads to whole mess of things, such as World Wars. The Nationalism that I consider good is left-Nationalism, the Nationalism of the oppressed people fighting back against oppression, and is mostly seen in struggles against colonialism and Imperialism. The Nationalism of the people of Vietnam or Cuba, for example, is good and a natural response to Imperialist domination and not a chauvinist justification for Imperialism and hating on other people because of their nationality.  ",
            "date": "Answered August 13, 2020",
            "views": "928",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Hubert",
                    "user_href": "/profile/John-Hubert-30"
                },
                {
                    "user_id": "Kristina Karas",
                    "user_href": "/profile/Kristina-Karas-2"
                },
                {
                    "user_id": "Joshua Barrientos",
                    "user_href": "/profile/Joshua-Barrientos-19"
                },
                {
                    "user_id": "Zane Wolf",
                    "user_href": "/profile/Zane-Wolf-1"
                },
                {
                    "user_id": "Cedrik Durand",
                    "user_href": "/profile/Cedrik-Durand"
                },
                {
                    "user_id": "Britney Smith",
                    "user_href": "/profile/Britney-Smith-197"
                },
                {
                    "user_id": "Amogh Bajpai",
                    "user_href": "/profile/Amogh-Bajpai"
                },
                {
                    "user_id": "Christian Lukas",
                    "user_href": "/profile/Christian-Lukas"
                },
                {
                    "user_id": "Sofia Riccio",
                    "user_href": "/profile/Sofia-Riccio-3"
                },
                {
                    "user_id": "Yusuf Soliman",
                    "user_href": "/profile/Yusuf-Soliman-6"
                }
            ]
        }
    ]
}