{
    "title": "Why is the 'British and French war' known by the name of the 'French and Indian war'? - Quora",
    "tags": [
        "The French and Indian War (Known commonly as the 7 Year's War)",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Biswa Jyoti",
                "href": "/profile/Biswa-Jyoti-2"
            },
            "answer_text": "The French and British War is not how that war is known in history. It is known as the Seven Years' War.   ​​In the above image the green parts are the countries on the French side and the bule parts are the countries on British side The main part of the war was fought during 1756-1783. But that actual fighting was already preceded by two years in North America. So from an American perspective the war was their first much before it was Europe's as they were already fighting French and their allied native Indians since 1754. Hence the name French and Indian war stuck on to this day in American history. On the otherhand, in India that war is called Third Carnatic War. Similarly in Sweden it is known as the Pomeranian War, in Germany and Austria the Third Silesian War. ",
            "date": "Answered July 9, 2015",
            "views": "342",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caleb Samuels",
                    "user_href": "/profile/Caleb-Samuels"
                },
                {
                    "user_id": "Kus Jestha",
                    "user_href": "/profile/Kus-Jestha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Saihgal",
                "href": "/profile/Ashish-Saihgal"
            },
            "answer_text": "The name French and Indian War is used mainly in the United States and refers to the two main enemies of the British colonists: the royal French forces and the various indigenous forces allied with them. Read Wikipedia for more details French and Indian War ",
            "date": "Answered July 8, 2015",
            "views": "121",
            "upvotes": "0"
        }
    ]
}