{
    "title": "Why did Joe Biden say a black man invented the light bulb? - Quora",
    "tags": [
        "Light Bulbs",
        "Joe Biden (politician)",
        "Black People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharon Holt",
                "href": "/profile/Sharon-Holt-39"
            },
            "answer_text": "MY Credential: . . . . . . BONA FIDE stable genius . . . NOT FAKE Q :: Why did Joe Biden say a black man invented the light bulb? Lewis Howard Latimer, a black man, patented a light bulb that had a more efficient and longer lasting filament than Edison’s lightbulb had. Also, Latimer was the draftsman of the necessary drawing that Alexander G. Bell used to receive his patent for the telephone. Also, Latimer co-patented an improved toilet system for railroad cars. Also, Latimer is an inductee of the National Inventors Hall of Fame for his work on electric filament manufacturing techniques. NOTE:: No one answering this question in a flippant and insincere manner can boast of being an inductee to the National Inventors Hall of Fame. PolitiFact - Making point on overlooked Black history, Biden misses mark on the inventor of the light bulb The origin of the incandescent lightbulb The road to the modern incandescent bulb was a meandering one, with many inventors contributing over a period of decades. Electric power was developed in the early 19th Century, and inventors immediately set about applying this development to lighting. Many early attempts focused on arc lighting, in which a bright light is created by electricity sparking between two points, according to Encyclopedia Britannica. When arc lighting was too bright and required too much power, prompting a pivot to an incandescent solution. Among the key early developments, according to Britannica and other sources: 1801 — English chemist Sir Humphry Davy demonstrated strips heated by electricity would glow, but his filaments didn’t last long.1841 — Frederick de Moleyns of England received the first patent for an incandescent lamp, using powdered charcoal between two platinum wires.1865 — The mercury pump is developed, allowing the glowing filament to be placed in a vacuum, which made it glow longer.1878 — English physicist Sir Joseph Wilson Swan developed a carbon-filament bulb.1879 — Thomas Edison developed his carbon-filament bulb, enclosed in a superior vacuum to extend the life of the filament.Swan and Edison both applied for patents in 1880, prompting litigation that dragged on until the two formed a joint company in 1883. \"Edison has always received the major credit for inventing the lightbulb, because of his development of the power lines and other equipment needed to establish the incandescent lamp in a practical lighting system,\" the Britannica entry said. A profile of Edison in Time Magazine in 1979 summarized Edison’s role this way: \"Above all, Edison invented the first practical electric light, and a power-distribution system that put it cheaply into every home.\" We should note, all of the inventors referenced here were white. So who is Biden referring to? The role of Lewis Latimer A spokesman said Biden was referencing Lewis Latimer, a prolific inventor who worked with both Edison and Alexander Graham Bell (credited with inventing the telephone). Latimer did indeed play a key role in the spread of electric lighting. He was a member of the elite \"Edison’s Pioneers\" research team and wrote the first book in the United States on electric lighting in 1890, according to a biography on the MIT website. Latimer also oversaw electric lighting installation in the streets and buildings of New York, Philadelphia, London and other cities, according to a 1988 New York Times story. Most notably for the question at hand, Latimer developed a filament that lasted longer than those developed by Edison and others, making the widespread use of electric lighting more feasible. He received a patent in September 1881 for \"new and useful improvements in incandescent electric lamps.\" That was a year and a half after Edison received an electric lamp patent in January 1880. Biden’s general point in referencing Latimer and Black Wall Street — a Tulsa, OK. neighborhood where up to 300 people are believed to have died in race riots in 1921 — is a lack of education on Black history in America. But his specific claim in making that point overreaches. Our ruling Speaking in Kenosha, Biden said, \"A Black man invented the light bulb, not a white guy named Edison.\" The Black man referenced here, Latimer, did indeed play an important role in the development and adaptation of the incandescent light bulb. So did many other inventors in the decades preceding Edison’s patent. Edison certainly wasn’t the sole inventor. He built on the work of others. While Biden may have a point about the need to better teach Black history, he greatly exaggerates in his example by minimizing Edison to credit only Latimer. All the evidence we’ve reviewed shows Latimer played a lesser role than Edison, and later in the process. We define Mostly False as a statement that contains an element of truth but ignores critical facts that would give a different impression. That fits here. ~~~  Lewis Howard Latimer - Wikipedia Technical work and inventions In 1874, Latimer co-patented (with Charles M. Brown) an improved toilet system for railroad cars called the Water Closet for Railroad Cars (U.S. Patent 147,363). [6] In 1876, Alexander Graham Bell employed Latimer, then a draftsman at Bell's patent law firm, to draft the necessary drawings required to receive a patent for Bell's telephone.[7] In 1879, he moved to Bridgeport, Connecticut, with his brother William, his mother Rebecca, and his wife Mary. Other family members, his brother George A. Latimer and his wife Jane, and his sister Margaret and her husband Augustus T. Hawley and their children, were already living there. Lewis was hired as assistant manager and draftsman for the U.S. Electric Lighting Company, a company owned by Hiram Maxim, a rival of Thomas A. Edison. The light bulb Latimer received a patent on January 17, 1882 for the \"Process of Manufacturing Carbons\", an improved method for the production of lightbulb carbon filaments.[8][9] The Edison Electric Light Company in New York City hired Latimer in 1884, as a draftsman and an expert witness in patent litigation on electric lights. While at Edison, Latimer wrote the first book on electric lighting, Incandescent Electric Lighting (1890)[10] and supervised the installation of public electric lights throughout New York, Philadelphia, Montreal, and London.[11] When that company was combined in 1892 with the Thomson-Houston Electric Company to form General Electric, he continued to work in the legal department. In 1911, he became a patent consultant to law firms.[12] Legacy Latimer is an inductee of the National Inventors Hall of Fame for his work on electric filament manufacturing techniques.[13]>>> ",
            "date": "Answered September 5, 2020",
            "views": "13",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Richard Holder",
                    "user_href": "/profile/Richard-Holder-46"
                },
                {
                    "user_id": "Sharon Robyn",
                    "user_href": "/profile/Sharon-Robyn-2"
                },
                {
                    "user_id": "Dannie Morris",
                    "user_href": "/profile/Dannie-Morris-1"
                },
                {
                    "user_id": "Paula O'Keefe",
                    "user_href": "/profile/Paula-OKeefe-2"
                },
                {
                    "user_id": "Kaiden Spero",
                    "user_href": "/profile/Kaiden-Spero"
                },
                {
                    "user_id": "Tup Tap",
                    "user_href": "/profile/Tup-Tap"
                },
                {
                    "user_id": "Jay Wil",
                    "user_href": "/profile/Jay-Wil-18"
                },
                {
                    "user_id": "Linda Lawson",
                    "user_href": "/profile/Linda-Lawson-40"
                },
                {
                    "user_id": "Andrew Studerus",
                    "user_href": "/profile/Andrew-Studerus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Kurtzman",
                "href": "/profile/Jonathan-Kurtzman"
            },
            "answer_text": "Joe Biden has run for President many times. He has often demonstrated 2 weaknesses: he gets confused about facts, which leads to mis-statements, and he panders in moments to his audience as though no one else is watching. He appears to have a need to say what the audience wants to hear. So he puts a little extra spin on to show that he is with them, that he cares about them, that he understands their positions. In this case, he took a basic fact, and gave it two twists: he downgraded Edison and elevated a black inventor. As anyone who went to grade school in the US knows, Edison didn’t invent the light bulb. At Greenfield Village in Dearborn, they have the original laboratory (and boarding house), which Edison’s friend, Henry Ford, bought and moved. They make it quite clear that this was a factory for invention, meaning they took ideas which existed and worked on them to make them commercial. That is how the history is taught. So rather than describe the role of a black inventor in this larger process by which we ended up with electric light, he shifted all the credit for the bulb itself to one guy because that, in his mind, was showing he was on that audience’s side. Maybe it’s me, but I’m disappointed that we spend time arguing about whether Tesla or Westinghouse or Edison, etc. deserves ‘credit’ when they were all parts of a process. The arguing over credit for what happened in the past is absurd. And what is lost is stuff like the fact that Edison ran a factory devoted to identifying ideas and analyzing what could be done with the existing knowledge to generate something improved and useful. That is a model we use today, though probably not by demanding small breakthroughs every few days. This model is also at the core of America’s commercial success, and I think the lack of understanding of that model has contributed to American decline. ",
            "date": "Answered September 8, 2020",
            "views": "214",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derrick Ferguson",
                    "user_href": "/profile/Derrick-Ferguson-22"
                },
                {
                    "user_id": "PJ Fitz",
                    "user_href": "/profile/PJ-Fitz-2"
                },
                {
                    "user_id": "Kenneth Lundgren",
                    "user_href": "/profile/Kenneth-Lundgren"
                },
                {
                    "user_id": "Cassandra Ridenhour",
                    "user_href": "/profile/Cassandra-Ridenhour"
                }
            ]
        }
    ]
}