{
    "title": "Why is the Edwardian Era in English history its own era? Since it is so short, why not include it in the latter or former era? - Quora",
    "tags": [
        "Edwardian Era",
        "Historical Eras"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Hungerford",
                "href": "/profile/Daniel-Hungerford"
            },
            "answer_text": "The Edwardian era is indeed quite short as eras go. However, I think what makes it stand out is that it fits neatly in between two truly momentous eras, while being distinct from both. It followed the turn of the 20th Century and the death of Victoria, and preceded World War I (some definitions have it go up to 1914) and all the social upheavals that happened along with it. To nostalgic writers and artists of the 1920s and 1930s, it represented a lost youth as yet unmarred by the horrors of the Great War, full of walks in the park, afternoon tea and visits to the music hall. To the privileged classes, it was an age where people got to enjoy all the technological and economic developments of the Victorian era, but everyone knew their place, and the British Empire was at the height of its power. From this point of view, you could say it provided a glimpse into a 20th Century that could have been but never was. Of course, this romantic vision did not necessarily reflect the realities of the era. As well as the already well-present spectre of war, albeit one whose fruition would be far more horrific than what anyone at the time anticipated, it was a period of great political and social change. Women increasingly refused to accept their status as second-class citizens and demanded the right to vote. The Liberal government passed the People’s Budget, which taxed the rich landowning class to fund social welfare programmes, and irrevocably weakened the conservative House of Lords in the process. The newly-founded Labour Party rose to become a formidable force in British politics, and would go on to replace the Liberals as the main party of the left by the 1920s, helped at least in part by the expansion of the franchise to women over 30 and unpropertied men in 1918. So in summary, the Edwardian era served as a cultural icon for later generations, as an age of romantic innocence, but also represented a historical era distinct in its own right. To Britain, it was a time which had not experienced the full brunt of modern war, but whose social developments had put the country on a path that would one way or another lead it away from the old Victorian order.  ",
            "date": "Answered August 7, 2017",
            "views": "14",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mac Simpson",
                    "user_href": "/profile/Mac-Simpson-1"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Einar Jóhannesson",
                    "user_href": "/profile/Einar-Jóhannesson-1"
                },
                {
                    "user_id": "Joseph Admire",
                    "user_href": "/profile/Joseph-Admire"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-1"
                },
                {
                    "user_id": "Nabeel Ismail",
                    "user_href": "/profile/Nabeel-Ismail-1"
                },
                {
                    "user_id": "Matthew Conklin",
                    "user_href": "/profile/Matthew-Conklin-7"
                },
                {
                    "user_id": "Yvette Thomas",
                    "user_href": "/profile/Yvette-Thomas"
                },
                {
                    "user_id": "Steven Zoraster",
                    "user_href": "/profile/Steven-Zoraster-1"
                },
                {
                    "user_id": "Nirmalya Raut",
                    "user_href": "/profile/Nirmalya-Raut-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick McCormack",
                "href": "/profile/Nick-McCormack-9"
            },
            "answer_text": "It is the convention in the UK to name historical periods after the reigning Monarch, how ever short (the exception to this is the very short reign of Edward VIII (1936) as he never actually had a Coronation. ",
            "date": "Answered March 26, 2020",
            "views": "142",
            "upvotes": "0"
        }
    ]
}