{
    "title": "Why is Nietzsche considered a great philosopher? - Quora",
    "tags": [
        "Friedrich Nietzsche (philosopher, author)",
        "Political Philosophy",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreyas Sanjay Kaptan",
                "href": "/profile/Shreyas-Sanjay-Kaptan"
            },
            "answer_text": "I have something to say that might sound eclectic given answers already presented here. But I have slight reservations with all of them, so I felt I might add something of value.  Contrary to popular belief Nietzsche was not an atheist. Literal interpretation of his words can lead one to these conclusions but I doubt he even thought the debate of any real value. What he had to say about religion was quite deep and revealing. It shed light on the fundamental differences in the ethics embedded in different kinds of religious and irreligious beliefs and more pointedly on different kinds of ethical systems themselves. He was probably the first person to clearly see that ethical systems were *subjective* in their foundations and were carried by the will of those who best represented these values.  He was the first serious philosophical critic and the first real skeptic of the school of platonic thought. Before Nietzsche philosophy was heavily dominated by metaphysical analysis of the world, with the exceptions of empiricists. These analyses always presumed moral precepts and then justified them with deductive discourses. Nietzsche attacked the very foundations of such a construction by pointing out that his predecessors were necessarily only expounding their prejudices. To that point, his entire cosmogony is restricted to eternal recurrence, which posits that world simply repeats itself every so often. This is only a minuscule part of this work. You could take that away from him and nothing of his value would be affected.  Finally, he contributed heavily to the modern notion of Humanism, although I am quite sure this is not what he would have wanted his legacy to be. His particular brand is called perspectivism, where the *value* of an ethical precept is determined inside the individual and not assigned by the world around him. Someone pointed out that he is related to Post-modernism. I am not sure of the claim, but I would say that he is related to any modern theory in aestheitics or ethics as much as ground is related to trees.  Nietzsche was not a subjectivist. Quite the opposite. He was enamored by art that elevated the \"soul\". He would have found little meaning in modernist or post-modernist interpretations, I think.  There is something to be said of his delivery though. I have not read any philosophical work other than that of Russell, which is *so* certain in its tone and claims. All his work is a work of a genius and a master; a rare combination. At the same time it is the the vision of a child that sees the world with its eyes for the first time but the child has a soul of a man. He dissects through the complexity with the agility and grace of innocence and yet his strokes betray experience and temperance of age. ",
            "date": "Answered October 7, 2015",
            "views": "81",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Nguyen",
                    "user_href": "/profile/Diana-Nguyen-68"
                },
                {
                    "user_id": "Vasu Bhatia",
                    "user_href": "/profile/Vasu-Bhatia-5"
                },
                {
                    "user_id": "Mary Davis",
                    "user_href": "/profile/Mary-Davis-894"
                },
                {
                    "user_id": "Anton Maren",
                    "user_href": "/profile/Anton-Maren"
                },
                {
                    "user_id": "Leonardo Flórez",
                    "user_href": "/profile/Leonardo-Flórez-1"
                },
                {
                    "user_id": "Arkady Dolgoruky",
                    "user_href": "/profile/Arkady-Dolgoruky"
                },
                {
                    "user_id": "Joseph Lemire",
                    "user_href": "/profile/Joseph-Lemire"
                },
                {
                    "user_id": "Celina Bo",
                    "user_href": "/profile/Celina-Bo"
                },
                {
                    "user_id": "Matthieu Heuwekemeijer",
                    "user_href": "/profile/Matthieu-Heuwekemeijer"
                },
                {
                    "user_id": "Sayan Ghosh",
                    "user_href": "/profile/Sayan-Ghosh-254"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shrey R",
                "href": "/profile/Shrey-R"
            },
            "answer_text": "Well, I have my reservations with the allusion presented in your question. For starters, his reasoning is very reductionistic. He doesn’t hesitate to arrive at conclusions, which may have been motivated by his own personal experiences and biases, without walking his readers through his train of thought. This is especially important in disciplines like philosophy where people can refute you only to the extent you provide the basis for your judgement. Imagine if I came out one day and boldly proclaimed, “life is suffering.” Without adequate backing, people are free to interpret according to their own struggles and experiences with life. The daily wage labourer will think, yes, this man surely knows what he’s talking about. The wealthy businessman will disagree, believing that I was suffering some kind of psychotic episode. For example, He never backs his claim about the will to power that was he believes was intrinsic to all humans. He refers us back to his own beliefs, building entire castles upon these questionable ideas.He attacks everything from German idealism (Kant), the slave morality of Christianity and the will to nothingness of Buddhist teachings. His attacks come from a place of personal belief and opinion rather than in a more systematic fashion.His reasoning lacks impartiality, often going behind the specific organisation, institution or individual instead of addressing the allegorical problems behind their ideas.The importance of logical reasoning cannot be understated in philosophy, which Nietzsche displays very little of. I also ironically find that his reductionist way of thinking is also what contributes to this Godly allure he has on his followers. His bold acclamations are not typical of good philosophical thought. This is something you’d expect to find more among theologians or the statesmen, or prophets who claim to know everything while providing little reason for their beliefs, often going on a circular track, appealing to their own intellectual or moral superiority as the sole basis for their claims. This is what causes people to raise you to a prophetic status when they experience and see the world in precisely the way you do. Because they’re lead to believe that there’s something universal about their shared beliefs. Despite his shoddy philosophising, he did make some timeless observations on the prevailing culture of his time. So in this regard, I think most philosophically-minded folks would regard him as a great cultural critic and commentator who was bold, provocative and didn’t shy away from stating what he felt about society at large. Think about Christopher Hitchens for a more contemporary parallel. Many rationally-minded atheists have come out and accused Hitchens of sophistry (check out the video embedded below). He goes off on many presuppositions all the while failing to substantiate those implicit assumptions that he so endlessly relies on, often going off in this self-aggrandizing way expecting people to think the way he did to drive his point home. He was a smooth talker who had a way with words that could convince most people of his moral superiority.  We can see a pattern emerge if you go searching throughout history. Most people are drawn to powerful speakers, who make them feel things. You’ll find that some of the biggest and most successful cult followings formed behind these self-proclaimed prophets who were able to cleverly manipulate large followings into believing like they knew a thing about the human condition. Because let’s be honest, there’s no such thing as a true prophet or a mystic. Anyone who claims to be the sole bearer of truth without providing a glimpse into his mind is surely BSing - or even deluded. Now obviously, this all isn’t to discount his few genuine attempts at philosophizing. We see this when he draws on historical knowledge and the metaphysics of Eastern spirituality to give way to his interpretation of the circle of life (karmic destiny, call it what you want) he calls the law of eternal recurrence. In this regard, one could even pass him for a metaphysician. But he clearly wasn’t the first to develop these ideas, often stitching together bits and pieces from mythology, poetry and even religion into a purposeful whole. ",
            "date": "Answered May 7, 2020",
            "views": "834",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Theodor Berza",
                    "user_href": "/profile/Theodor-Berza-1"
                },
                {
                    "user_id": "Josip Pivarić",
                    "user_href": "/profile/Josip-Pivarić-1"
                },
                {
                    "user_id": "Shaima Ferchichi",
                    "user_href": "/profile/Shaima-Ferchichi"
                }
            ]
        }
    ]
}