{
    "title": "Why did Ethiopia pull back during the Ethio-Eritrean War? - Quora",
    "tags": [
        "Ethiopian History",
        "Eritrea",
        "Ethiopia",
        "Africa"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Bravo",
                "href": "/profile/Mike-Bravo-21"
            },
            "answer_text": "Well, I am surprised the sudden rise in interest on Eritrea-Ethiopia matters on quora. If people show interest to understand the history of the region I think is good. If the case is that to open a platform for people to trade insults and blindly shout out yeah we are the victors, we killed them all etc I think there are probably less respectable places for them to vent their emotions. Now to the question, you will get two different passionately argued truths depending on which side of the border you stand when you ask the question. In fact the question is not specific to which war you are referring to. Because there were two. The first one was the war for Eritrean independence which lasted 30 years from the early 1960s to early 90s. This war didn’t end in Ethiopian Army pulling back, it just ended because the Ethiopian Army was soundly defeated by Eritrean Liberation fighters. According to several historians the watershed moment came about during the Battle of Afabet. If the question is referring to the recent border war that lasted about two years, then again you will get two different answers depending on whom you ask. And because it was so recent and still the emotions are still running high, I would rather not comment on it. However, one thing is clear. The war caused massive damages and huge loss of lives in both countries. I personally have lost high school friends who never came back. On previously bright spot on the African continent where after a long period of conflict peace and cooperation was taking place, the border war has cast a long shadow of pain and despair and has plunged the region into constant state of tension. I will leave you with these two quotes : War does not determine who is right - only who is left. The war... was an unnecessary condition of affairs, and might have been avoided if forbearance and wisdom had been practiced on both sides. ",
            "date": "Answered May 23, 2016",
            "views": "959",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Romeo Julius",
                    "user_href": "/profile/Romeo-Julius-3"
                },
                {
                    "user_id": "Menelik Gebremariam",
                    "user_href": "/profile/Menelik-Gebremariam"
                },
                {
                    "user_id": "Philip Grande",
                    "user_href": "/profile/Philip-Grande-1"
                },
                {
                    "user_id": "Natnael Welday",
                    "user_href": "/profile/Natnael-Welday"
                },
                {
                    "user_id": "Musie Michael",
                    "user_href": "/profile/Musie-Michael"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adugna Worku",
                "href": "/profile/Adugna-Worku"
            },
            "answer_text": "From the date of the first invasion Ethiopia was trying to deescalate the conflict by accepting various peace accords which Eritrea rejected staunchly. This didn't bear anything in the interest of Ethiopia. For this reason Ethiopian army made a massive counter offensive and broke the notorious trenches of the Eritrean army which literally opened a gate for Ethiopian army to capture a vast amount of land in Eritrea. Mainly because of this loss, b/c of the arms embargo on both countries and and among other things, Eritrea accepted the OAU(?) peace accord which brought a ceasefire. This is a win for Ethiopia...then... The Commander-in-chief makes a check List (Hypothetical)-Has the Ethiopian regained all her territory.....Check-Has Eritrea accepted the OAU peace framework agreement ...Check-Is staying longer in Eritrea logistically expensive ... Check-Does staying more have diplomatic backfire .... Check-Can the military knock out another potential attack .. Check-Is Eritrea weak enough not to wage another surprise attack .. Check-Does the service men has a wife and a family to spare a quality time with ...  Check-War is hell ....... Check.____Then come an order ... 'Abandon and move a hell out!!!' ",
            "date": "Answered February 19, 2015",
            "views": "876",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tesfaye Desalegn",
                    "user_href": "/profile/Tesfaye-Desalegn-3"
                },
                {
                    "user_id": "Maleesha Lakshan",
                    "user_href": "/profile/Maleesha-Lakshan-1"
                },
                {
                    "user_id": "Laurent Cayre",
                    "user_href": "/profile/Laurent-Cayre"
                },
                {
                    "user_id": "Merry Wub",
                    "user_href": "/profile/Merry-Wub"
                },
                {
                    "user_id": "Eyob Fitwi Abraham",
                    "user_href": "/profile/Eyob-Fitwi-Abraham"
                },
                {
                    "user_id": "Aparna Prasad",
                    "user_href": "/profile/Aparna-Prasad-5"
                },
                {
                    "user_id": "Tilman Ahr",
                    "user_href": "/profile/Tilman-Ahr"
                }
            ]
        }
    ]
}