{
    "title": "Why did the Middle Ages last so long in Europe? - Quora",
    "tags": [
        "Medival History",
        "Medieval Europe",
        "Middle Ages (era)",
        "History of Europe",
        "Europe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill McHale",
                "href": "/profile/Bill-McHale-1"
            },
            "answer_text": "How exactly do you define the Middle Ages in a coherent fashion that fully embraces everything that happened and how culture changed? At best, it describes the period from roughly 500–1500 when the Catholic Church was the single most powerful and influential player in western politics. But beyond that? Europe looked very different in 1500 than it did in 1000, and even more different in 500. You can easily divide 500–1500 into several different periods. Period 1. 500–800 AD, Late Antiquity. During this period, many of the connections, especially with respect to trade, from the Roman Empire remained somewhat intact. Constantinople even made a credible attempt at reconquering the West though that ended up making them vulnerable to Islamic expansion. Few of the states from this period really gain much traction to last through the rest of the Middle Ages. Period 2. 800–1066 AD, The Viking Age. The Vikings were everywhere… though .at the very start were in Russia, and Great Britain as the Carolingians went about forming an empire that was the precursor of Modern France, Italy and Germany. England is formed as a survivor of the Viking raids and then is conquered by a Viking Descendant just a few weeks after defeating the last major Viking Raid. Period 3. 1066–1300 AD, The High Middle Ages. This is what most people seem to imagine the entirety of the Middle Ages was like. Feudalism is at its height, University Towns rise up, as do Gothic Cathedrals. England and France start there on again, off again fighting that will define them until the middle of the 19th century. Period 4. 1300–1500 AD, The Late Middle Ages. A Renaissance gets started and its members decide to forget about all the earlier ones and declare everything between 500-and then, the Dark Ages. England and France get serious about their wars and duke it out. At the end, England gets bored and decides to fight itself over some flowers :). Meanwhile the Church decides to split up for a while in a trial separation… it ultimately decides to get back together, but shortly afterwards, some of her followers decided they liked it better split up and make a permanent split. ",
            "date": "Answered April 8, 2019",
            "views": "977",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donald Trump",
                    "user_href": "/profile/Donald-Trump-1067"
                },
                {
                    "user_id": "Joseph Molin",
                    "user_href": "/profile/Joseph-Molin-1"
                },
                {
                    "user_id": "Benjamin Fry",
                    "user_href": "/profile/Benjamin-Fry-11"
                },
                {
                    "user_id": "David Stevens",
                    "user_href": "/profile/David-Stevens-42"
                },
                {
                    "user_id": "Richard Jones",
                    "user_href": "/profile/Richard-Jones-138"
                },
                {
                    "user_id": "Tony Meeks",
                    "user_href": "/profile/Tony-Meeks-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Bankuti",
                "href": "/profile/Alex-Bankuti"
            },
            "answer_text": "Basically, because that's how historians have traditionally divided history. However, if you compare the Middle Ages to say, the Bronze Age or classical antiquity, they weren't really that long. Lets say the Middle Ages begin in 476, with the fall of the Western Roman Empire. Now, personally I'd set the start date later, but let's make the Middle Ages as long as possible for the sake of argument. Let's book-end the Middle Ages with the discovery of the Americas in 1492-again you could place the end earlier or later, but 1492 is convenient. That makes the Middle Ages about 1000 years long. Now let's look at Classical Antiquity. The traditional start of this era is 776 BC: with the establishment of the first Olympic Games. We'll set the end date at 476. This means that Classical Antiquity lasted exactly 1200 years: a little longer than the Middle Ages. Now for the Bronze Age: this period is generally considered to have lasted from some time in the 3300s BC to about 1200 BC during the Bronze Age collapse. So about 2100 years. So, long story short, the Middle Ages weren't really that long. ",
            "date": "Answered April 12, 2019",
            "views": "318",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Stevens",
                    "user_href": "/profile/David-Stevens-42"
                }
            ]
        }
    ]
}