{
    "title": "Why did Spain colonize the Philippines? - Quora",
    "tags": [
        "Colonization",
        "Spain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Norman Owen",
                "href": "/profile/Norman-Owen"
            },
            "answer_text": "Because under the early Hapsburgs they saw a chance, and felt an obligation, to conquer, Christianize, and colonize as much of the world as they could, subject to their mutual-avoidance arrangement with Portugal, under which the latter “owned” rights of half of the world (essentially, but not exactly, the Eastern hemisphere) while Spain “owned” the other half (Western hemisphere). Spain thus took most of the Americas from Mexico (and parts of what is now the USA, including Florida, Texas, California) down to Argentina and Chile, except for Brazil, which bulged out into the Portuguese sphere of influence. The same argument in reverse applied on the opposite side of the Pacific, where Spain claimed the Philippines fell on their side of the line - it didn’t - while the Portuguese had to be content with Malacca (Melaka), Goa, Timor, the Spice Islands, and the like. An earlier commentator has mentioned the triumvirate of Gold, God, and Glory as motives for this general expansion, and that’s pretty much correct, though the balance among these factors was variable. Hardly any European in those days thought there was anything wrong with conquering and converting the “non-Christian” world, though there were those, such as Fr. Bartolome de las Casas, who thought they could be nicer about it. By the 17th century these “earlier adopters” of overseas colonialism had been joined by the Dutch, English, French, etc., who had similar ambitions, though less missionary zeal. The actual acquisition of the Philippines was almost an accident, in that what Spain really hoped for in Asia was (1) spices, and (2) access to the fabled wealth of “Cathay” (China) and Japan. The islands provided neither of these - spices (primarily nutmeg and cloves) grew just south of the Philippines, and it turned out that both China and Japan were too powerful for the Spanish to come in and conquer, as they had done in Mexico (against the Aztecs) and Peru (the Incas). So economically they were pretty much a losing proposition, though trade with China via the Manila Galleon almost balanced the books. In the meanwhile, however, Spanish friars had made considerable headway in converting many Filipinos to Catholicism, which was important to the devoutly Christian (and imperialist) Spanish kings as justification for their rule. Reportedly one of these kings, advised by his ministers that Spain was losing money in the Philippines and should therefore consider abandoning the infant colony, said “A king has some countries because he needs them, and others because they need him.” What a charming (?) sentiment! ",
            "date": "Answered April 5, 2017",
            "views": "121",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renato Viovicente",
                    "user_href": "/profile/Renato-Viovicente"
                },
                {
                    "user_id": "John Rose Dela Cruz",
                    "user_href": "/profile/John-Rose-Dela-Cruz"
                },
                {
                    "user_id": "Ruby Tsao",
                    "user_href": "/profile/Ruby-Tsao"
                },
                {
                    "user_id": "Karol Stefanowicz",
                    "user_href": "/profile/Karol-Stefanowicz"
                },
                {
                    "user_id": "Esrarengiz Kanal",
                    "user_href": "/profile/Esrarengiz-Kanal"
                },
                {
                    "user_id": "Kenneth Causo",
                    "user_href": "/profile/Kenneth-Causo"
                },
                {
                    "user_id": "Xander Cunanan",
                    "user_href": "/profile/Xander-Cunanan"
                },
                {
                    "user_id": "Christian Joseph Parreño",
                    "user_href": "/profile/Christian-Joseph-Parreño"
                },
                {
                    "user_id": "Migs Marbella",
                    "user_href": "/profile/Migs-Marbella-2"
                },
                {
                    "user_id": "Diego Rodríguez Martín",
                    "user_href": "/profile/Diego-Rodríguez-Martín"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Fernandez",
                "href": "/profile/Ryan-Fernandez-15"
            },
            "answer_text": "The goal of Spanish efforts to explore and settle Asia during the 1500s onwards was to find ways to access and secure trade with the East. At that time, there was a great demand for silk, spices, porcelain, and other ‘exotic’ goods in the markets of Europe. Eventually this was expanded to growing cash crops like sugar, and tobacco in plantations across the Philippines.  Spain was also competing with other European states who secured or seized trading ports in East Asia and maritime Southeast Asia such as: The Portugese in Malacca and Macau, and exclusive rights to trade in NagasakiThe Dutch growing nutmeg, cloves, cinnamon, and pepper in IndonesiaThe British administering the Straits Settlements, Malaya, Singapore, and Borneo first through the East India Company then by direct royal authorityThe Spanish East Indies — Las Islas Filipinas but also Islas Marianas, Islas Carolinas, Islas Palau, and for a while Taiwan and parts of the Moluccas — formed a supply chain stretching across the Pacific and linking Asia to Mexico. It was the grand enterprise to funnel the wealth of Asia that led to claiming the Philippines region by region.  Poised directly south of China, the archipelago was the ideal stepping stone to tapping Chinese goods. Manila was the midway point where Chinese merchants sold their goods paid for with silver from the New World. Those goods would make their way to Mexico then the Atlantic then finally Spain. Ryan Fernandez's answer to What were the Manila Galleons? The secondary imperative of Spain was religion. The Pope granted Spain and Portugal rights to claim the New World and Asia, but also tasked them with Christianizing indigineous peoples. Fresh from the Reconquista, and using divide-and-conquer tactics to topple the Aztecs, the Spanish were very capable of conquering and Christianizing the Philippines. This of course made colonial administration easier. Ryan Fernandez's answer to Why was Christianisation of the Philippines (or rather the pre-Philippine kingdoms) so much more successful than similar attempts elsewhere in Southeast Asia, e.g. Indonesia/Malaysia? ",
            "date": "Answered July 20, 2018",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Esrarengiz Kanal",
                    "user_href": "/profile/Esrarengiz-Kanal"
                }
            ]
        }
    ]
}