{
    "title": "Why did Germany invade Czechoslovakia in 1939? - Quora",
    "tags": [
        "Czechoslovakia (former country)",
        "Invasions",
        "World War II",
        "Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laine Frajberg",
                "href": "/profile/Laine-Frajberg"
            },
            "answer_text": "Hitler’s intent,all along,was to destroy Czechoslovakia,The claim that the Bohemian Germans were being oppressed was simply a pre-text.However,when Chamberlain forced the Czechs to cede him the so-called Sudetenland,he was trapped. Because now he was being granted what he ostensibly wanted-the incorporation of the German speaking areas into the Reich.But he felt cheated since he really wanted ALL of Czechia. And that was why he forced Czecho-Slovak President Emil Hacha to sign the surrender of his country by threatening to obliterate Prague (March 15,1939)The German troops soon entered the country.Bohemia became a German “Protectorate” and Slovakia became a nominally independent state-also under German “protection”.(William Shirer,in his book,The Rise And Fall of The Third Reich,claims,correctly in my view, that this act was the beginning of the end of Hitler’s own hideous regime.) And what motivated such fanatical hatred?Simple.The future fuehrer had developed an intense hatred of the Czechs while living in pre-WW1 Vienna.The Austro-Germans were the ruling group of pre-WW1 Bohemia.And the Czechs kept making demands to change this (from their point of view) unacceptable situation.They wanted Bohemia to be an equal kingdom within the Austro-Hungarian state.Hitler,though despising Austria-Hungary, resented these demands and was outraged when (post-war) the Czechs eventually got even more than they had demanded from the Hapsburg dynasty.After WW1,the Czechs not only had equality in Bohemia.They had supremacy;ie,they actually became the ruling group!And for a German supremacist that was TOTALLY unacceptable-contrary to the natural order.The Czechs had to be smashed and put back in their place in his view.And that place was one of permanent inferiority.And,yes,they had to pay for their effrontry in thinking that they-inferior Slavs-had the right to rule Germans.(In the end,the Bohemian Germans had to pay too but that’s another topic.) ",
            "date": "Answered June 9, 2020",
            "views": "149",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Metcalfe",
                    "user_href": "/profile/Bob-Metcalfe"
                },
                {
                    "user_id": "Anton Leyrer",
                    "user_href": "/profile/Anton-Leyrer"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kai Hackemesser",
                "href": "/profile/Kai-Hackemesser"
            },
            "answer_text": "I am responding to this with a couple of essays auto-translated from a German book. I have added a few maps and charts from the web: The Munich Agreement 1938 Germanic tribes settled in Bohemia and Moravia since time immemorial and before the Czechs. The Cheb region only came to Bohemia from Bavaria at the end of the Middle Ages (after 1315). The first German university was founded in Prague in 1348. Until 1918/19, Bohemia and Moravia - the territory in what later became Czechoslovakia - belonged to the German Empire for about a whole millennium without interruption or, after 1806, to German Austria (Habsburg monarchy).  To understand the Munich Agreement (M.A.), some historical facts must be mentioned: Through the dictate of Saint-Germain in 1919, the Sudeten German territories were withdrawn from the Republic of German Austria and assigned to the newly formed Czechoslovakia. 3.5 million Germans were incorporated into the new state structure against their expressed will and by force. For these reasons, a treaty for the protection of minorities was created, but only on paper. Not only the Germans, but also Hungarians and Poles were oppressed by the Czechs, who numerically did not even have an absolute majority in the state. Thus the treaty between the Czechs and the Slovaks - signed on 30 May 1918 in Pittsburgh/USA by MASARYK and exiled Slovaks, which granted the Slovaks their own parliament and the Slovak official language - was never observed by Prague. After the foundation of the Czech state, various parties appeared on the Sudeten German side. For the parliament in Prague won mandates: the Social Democrats, the German Christian Party, the Federation of Farmers, the German National Party and the German National Socialist Workers' Party (DNSAP). The gymnastics teacher Konrad HENLEIN (1898-1945) went a different way with his national gymnastics movement. In autumn 1933 he changed into politics and founded the >Sudeten German Home Front<, in Eger on October 1, 1933, which had to change its name to >Sudeten German Party< for the parliamentary elections and became the strongest party of the state in May 1935. HENLEIN telegraphed President MASARYK about his willingness to cooperate in the state, but no reply was received. After the annexation of Austria to the Reich in 1938 the situation changed for the Sudeten Germans as well. HENLEINS party continued to grow very fast, also due to economic hardship in Czechoslovakia (out of 800,000 unemployed, about 500,000 were Sudeten Germans). In addition, HENLEIN had established connections with English and later also with French politicians. In the course of 1938 tensions arose between Czechoslovakia and the German Reich. Especially the provocative and unjustified Czech mobilization of May 20, 1938 against the Reich aggravated the crisis. The special thing about 1938 was that the English leadership was strongly committed. HITLER demanded an end to the terror against the Sudeten Germans. Not only the Germans, but also the Slovaks, Poles, Hungarians and Ruthenians demanded their rights! The nation-state of Czechoslovakia trembled in its foundations. Already at the end of February 1938 the Slovaks' demand for separation from Prague appeared. On 28 May 1938 a delegation of Slovaks from the USA brought the original of the Pittsburgh Treaty with them. In August 1938 the Slovakian People's Party declared that it intended to sue the Czechs at the International Court of Justice in The Hague. The Poles, too, demanded the return of the Olsa territory in sharp terms. After Lord RUNCIMAN, as an official representative of England, had made a fact-finding visit to Czechoslovakia for several weeks in August and September 1938, he advocated the cession of the Sudetenland to the German Reich. On September 15, CHAMBERLAIN met with HITLER in Obersalzberg and officially advocated the cession of the Sudetenland. Today, the long-secret >NECAS documents< are known, named after the then Minister of Social Affairs of the BENESCH government, Jaromir NECAS. He was in Paris in mid-September 1938 and had instructions from BENESCH to make a secret offer from Prague to the Western Powers (with the aim of a partial cession with simultaneous mass expulsion). The instructions were essentially as follows: never to admit that it could be said that the plan came from the Czechoslovaks.must be kept extremely secret, nothing may be published.the extent of the territory we could cede must be agreed between the French and the English in secret, according to our exact specifications. Otherwise, if they know our agreement in principle, there is a danger that in the end they will give in to HITLER and give him everything.then the whole plan must already be finished and imposed on Hitler as the last concession with the other concessions.this means that Germany may, in this matter, use so many thousands of km2 (I don't know myself, but it would be about 4-6000 km2 - in this matter one must not commit oneself) under the condition to take over at least 1500000 to 2000000 of the German population. This would therefore mean a relocation of the population, leaving democrats, socialists and Jews with us.On September 17, 1938, NECAS transmitted this secret offer to London and Paris, and on September 21, 1938, after appropriate Anglo-French pressure before the public, BENESCH's approval was granted by the Western Powers. In his meritorious compilation of Documents on the Sudeten question Fritz Peter HABEL compared the secret letter of Edward BENESCH delivered by NECAS with the French translation. According to HABEL, such a comparison makes it possible \"to gain a deeper understanding of its effects through the knowledge of developmental phases of the document\". Obviously BENESCH wanted to prevent Paris and London from voting in favour of a referendum with this secret letter. In Munich, on 29 September 1938, the four great powers only regulated the modalities of the transfer of territory. The preamble of the Munich Agreement expressly refers to this: \"Germany, the United Kingdom, France and Italy, taking into account the agreement already reached in principle on the assignment of Sudeten German territory, shall agree on the following conditions and modalities of this assignment ...of this cession.\" BENESCH had also rejected the British proposal to hold a referendum in the areas to be ceded. He (justifiably) feared a great embarrassment. Thus Czechoslovakia had voluntarily agreed to this cession of territory. It then also agreed to the Munich Agreement. The fact that it came into being under diplomatic pressure is common to most international agreements. In 1945/46, even the Nuremberg Tribunal recognized the Munich Agreement, considered it a legally binding treaty and accused it of violating it. Czechoslovakia also joined the Nuremberg tribunal, a fact not unimportant for the whole complex. No Czechs were expelled in 1938 The justification of the expulsion of the Sudeten Germans from their homeland after 1945 is based on the historical legend that after the Munich Agreement of September 29, 1938, Czechs had been >expelled< from the Sudetenland, which was then annexed to the German Reich. Such an expulsion never happened, especially not in 1938-1945. It is a fact that in the areas of the former Czechoslovakia affected by the Munich Agreement there lived, in addition to the German majority, about 160,000 Czech nationals at the end of 1918, but in May 1939, according to official statistics, there were about 320,000 Czechs, i.e. about twice as many. After 1918, for example, they had come to the purely German towns as civil servants or teachers in order to Czechize these areas. After the annexation of the Sudetenland many of these immigrants returned to their Czech homeland, to the later Protectorate. But nobody was expelled. Also a number of political dissidents, German SPD and KPD officials and members, left the now again German territories, because they did not want to live under National Socialism. Many of them then emigrated to the West via Czechoslovakia. These too were not expelled, but left voluntarily. As a direct participant Stanislaw AUST took in a reader's letter on 17th March 1992 in the Prague daily newspaper Lidove Noviny, commenting on an editorial article by the paper, which spoke of \"expulsions\" in 1938: \"As a witness, I refuse to accept the lies contained in the article entitled >Munich and the legal system<. Our family was very active against HENLEIN, and we were not expelled by force, we fled for fear of persecution. Inland we were registered as refugees and not as displaced persons. Those who did not want to leave did not have to. Many in Trautenau survived the occupation. Our family house remained in our possession, and the German tenant regularly sent us the rent. It was not until June 1945 that a member of the Revolutionary Guard took the house from us, and my parents had to go to great lengths to get it back... Very ridiculous is the claim that the property of Germans who remained loyal to the Republic (1945) was not confiscated..« Moscow wanted to support Prague militarily in 1938 Even more than half a century after the events of that time, essential Allied documents and files - both in the West and in the East - on the prehistory of the Second World War and the war target discussion are still closed to the public and research. As early as 1986, Cologne professor Andreas HILLGRUBER accused the \"fatal finding\" that contemporary history research \"concentrates almost exclusively on the war aims, on the policy and strategy of the National Socialist leadership during the first years of the war... without much investigation of the independent aims of the Eastern and Western counterparts. The opposing concept was not only a reaction to the National Socialist challenge: it corresponded rather to long-standing ideas that only had a breakthrough during the war. A certain, albeit very inadequate, substitute for the Soviet war and pre-war acts is provided by memories of high-ranking Red Army soldiers, from which not insignificant details can be gleaned. One such memoir is given by the later Soviet Chief of General Staff (1942-1945) and Deputy of the People's Commissar for Defense, Marshal of the Soviet Union A. M. VASSILEVSKY, about the September 1938, the Sudeten crisis. The then Head of the Operational Training Sub-Division of the Soviet General Staff writes: \"In September 1938, when Czechoslovakia was threatened with danger and we did not yet know of the Munich betrayal, we prepared ourselves together with France, as contractually agreed, to assist that country. In this connection the staff of the Kiev Special Military District received a directive from the People's Commissar to put the Vinnitsa Army Group in combat readiness and to bring it close to the state border of the USSR. In the Kamenets-Podolski and Vinnitsa regions the 4th Cavalry Corps, the 25th Armoured Corps and the 17th Rifle Corps, two independent armoured brigades and seven air regiments were transferred. At the same time the Shitomir Army Group with the 2nd Cavalry Corps, the 15th and 8th Rifle Corps was concentrated in the Kiev, Chernigiv and Shitomir regions and in the Novograd-Volynsky and Shepetovka area. The operational group of the Staff of the Kiev Special Military District was placed in Proskurov.\" This statement, the accuracy of which can be assumed, provides the following information: The military alliance France-Soviet Union of 1935 was quite serious and could have serious consequences, for instance in September 1938. It was therefore quite justified that HITLER, shortly after the conclusion of this treaty, after having warned Paris beforehand against it, terminated the Locarno Treaty of 1925 (renouncing the violent revision of the western border) because France had abandoned the common basis laid down in it. Furthermore, the Soviets were ready to intervene in Central European crises as early as 1938. Finally, this confirms the German assessment at that time that Czechoslovakia was the >aircraft carrier< of the Soviet Union in Central Europe, which advanced far into the Reich territory with this country.  This was a strategically impossible situation for Berlin to tolerate in the long run. It was much more dangerous and peace-threatening than the existence of the communist Cuba before the USA for the latter, which under US President John F. KENNEDY in autumn 1962 immediately drew military consequences when Moscow began to equip the island with missiles. Hacha and Hitler in Berlin 1939 The events during the visit of the Czechoslovak President HACHA (1872-1945) to Berlin on March 14-15, 1939, are often reported in a false or distorted manner. For example, it is stated that HACHA had been summoned by HITLER and had been forced by \"race for the negotiating table\" to agree to the protectorate treaty, had been made compliant and mistreated by injections. The opposite had rather been the case. External political circumstances hardly allowed any other alternative to the protectorate solution, thanks to which the Czechs - apart from the Swiss - probably came through the Second World War best of all the peoples of Europe. The following facts are usually ignored in assessing the events of that time, but they were decisive for the situation in question. After the Munich Agreement of September 29, 1938, the multi-ethnic state of Czechoslovakia, which had been forced together by the dictates of St. Germain in 1919, was slowly disintegrating. On November 22, 1938, Slovakia had finally obtained autonomy in the Czechoslovakian constitutional law and had established its own state parliament in Bratislava. In a vote 98 percent of its inhabitants had declared themselves in favour of autonomy, so they wanted to leave Prague. On 10 March 1939 HACHA, from Prague, deposed Father Tiso and his whole government, who had been elected head of the Slovakian government by the Slovakian parliament on 23 February 1939, occupied Bratislava with Czech military and dissolved the Slovakian parliament. A new Slovakian government did not come into being. On the morning of March 14th the newly convened state parliament in Bratislava voted unanimously for the independence of Slovakia. As early as March 6, 1939, the Czech General PRCHALA had been appointed by HACHA, against the protest of the Carpato-Ukrainians, who were also oriented towards independence from Prague, as Minister of the Interior, Finance and Transport with practically dictatorial powers in Ruthenia (Carpato-Ukraine), in order to prevent the threatened secession of this part of the country. On March 14, Slovakia and Carpato-Ukraine placed themselves under the protection of the German Reich as independent states in the early hours of the morning, following declarations of independence and decisions by their new governments. HITLER took over the protection of Slovakia, not the Ruthenia, to which Hungary also laid claim.  Still on 14 March, Hungary marched into Ruthenia after a 12 hour ultimatum to Prague. In view of this worsening situation of the dissolution of Czechoslovakia, the British Ambassador in Berlin, Nevile HENDERSON, urgently suggested to the Czech envoy in Berlin, MASTNY, on March 14, 1939, that he should see to it that the Czech Foreign Minister, KHVALKOVSKY, should come to Berlin immediately and discuss the situation with HITLER. The British ambassador in Prague, NEWTON, supported this. HACHA's later visit to Berlin with his Foreign Minister was therefore at the British suggestion, not initiated by HITLER. In addition, before HACHA's arrival in Berlin, the German Secretary of State in the Foreign Office, Ernst VON WEIZSÄCKER - father of the later German President - had asked HENDERSON how the British government would behave if HACHA, as was to be expected, would place the rest of Czechoslovakia under the control of a German protectorate. HENDERSON therefore knew of the German intentions regarding the future of Bohemia and Moravia, informed London immediately, and was authorized by the British Foreign Secretary HALIFAX to declare that Britain had no desire to interfere in matters directly affecting other countries. HENDERSON assured the Germans that London would not interfere in their Czech policy. A few hours after the wish they had expressed on March 14 at 11 o'clock, HACHA and KHVALKOVSKY had obtained German approval for a conversation with HITLER in Berlin and left Prague at 4 o'clock in a special train which arrived in Berlin at about 10:40 p.m. HACHA, who had a heart condition, could not be expected to take a flight. Here HACHA was received with all the military honours of a head of state: An honorary company of the >Leibstandarte Adolf Hitler< had lined up for him at the station. The conference with HITLER, GÖRING, RIBBENTROP and KEITEL as well as German Secretaries of State lasted until the early morning hours of March 15, 1939. HACHA told his daughter, who had accompanied him to Berlin, all the details after his return. She denied in all interrogations after the war that her father had been pressured or mistreated by the Germans. HACHA, who was suffering from heart disease, suffered a fit of weakness during the conference, where he had first spoken at length and expressed his wishes, and expressly agreed to German medical assistance. After the injection of a circulating agent by HITLER's personal physician Dr. MORELL, he recovered very quickly and was able to endure the following hours. HACHA initially wanted to work for the continuation of the independence of the Czech Republic and offered to reduce the Czech troops in return. HITLER rejected this as insufficient and proposed a protectorate relationship, with German troops already marching into Czechia on March 15th. Prague should forbid its military any resistance. In the meantime HACHA and KHVALKOVSKY were able to telephone Prague at length, especially with the Minister of Defence General SIROVY. In view of the situation they agreed to refrain from any resistance. That must have been bitter for the Czechs. Apart from moral concerns - France and England had established protectorates several times in earlier decades - HITLER's surprising encroachment on the Czechs' right to self-determination was probably politically unwise at the time and poured water on the mills of the warring parties in London and Washington, which then became widely covered in the world press. But afterwards everything is easy to judge. It was only after these talks in Berlin and HACHA's agreement to the protectorate solution had been reached that German troops marched into the new protectorate on the morning of March 15, 1939 - with one exception: already in the evening of March 14, some German units had marched into the area around Moravian Ostrava in order to forestall Polish intervention, which both Germans and Czechs feared. Even the Czech population in this area understood this. HACHA had been informed of this on his arrival in Berlin. On March 15, that is, after these events, Prime Minister CHAMBERLAIN, speaking before the House of Commons in London, expressed his understanding for the events surrounding Prague: \"In our opinion, the situation has changed radically since the Slovakian parliament declared Slovakia's independence. This declaration had the effect that the state, whose borders we intended to guarantee, broke down from within and thus came to an end, and consequently the situation, which we always regarded as temporary, has now ceased to exist, and His Majesty's Government can no longer feel bound by this obligation. .. I deeply regret what has happened, but that is no reason to depart from the path we have followed so far. We hope to remember that the aspirations of all the peoples of the earth are now also directed towards the hopes for peace.” It was not until two days later, on March 17, that he turned to the war course of HALIFAX and CHURCHILL with his Birmingham speech. In it he described the old Czechoslovakia as a problem \"which has existed since the Treaty of Versailles and which could have been solved long ago if only the statesmen of the last 20 years had had a more comprehensive and enlightened view of their duty. It had become like a long neglected disease. The only thing that could help was a surgical intervention to save the patient\". HACHA was arrested in the Czech Republic after the end of the war and, on the orders of BENESCH, who had returned home from exile, was murdered without trial in a Prague dungeon in June 1945 after gruesome treatment. He was no longer able to testify. It should be emphasized once again: after the Munich Agreement of 29 September 1938 - contrary to their original intentions - neither England nor France had a issued a guarantee for Czechoslovakia, they were therefore not guarantor powers that would have had to be consulted in connection with events surrounding Prague. However, prior to their meeting, the German government... with HACHA, which was also based on a British suggestion, via HENDERSON in London, and was able to use the answer as a basis for the British consent, at least the acquiescence, from German politics. Even before that, parts of Czechoslovakia - Slovakia and Ruthenia - had voluntarily placed themselves under the protection of the German Reich. The establishment of a protectorate over the remaining part was also following earlier, similar models from England and France. For the political justification of this solution - the internal collapse of the Czechoslovakian state, the growing influence of the Communists and the Red Army in Prague (Czech Republic = Soviet aircraft carrier in Central Europe), claims of Poland and Hungary to certain territories, another 175,000 Germans as a minority in the rest of Czechoslovakia - we should refer to the specialist literature. \"For centuries our peoples have lived side by side, and the Czechs have never fared so well as when they lived in harmony with the Germans. That is why I have asked you for a meeting, because I want to clear up the misunderstandings that may have arisen between our two countries. I place the fate of my people in your hands with the conviction that I could not put it in any better hands.\" Emil HACHA on March 15, 1939, reproduced in: IMT, vol. XXXI, p. 139. Agreement between HITLER and HACHA of March 15, 1939 The Führer and Chancellor of the Reich, in the presence of the Reich Minister of Foreign Affairs VON RIBBENTROP, today received the Czechoslovak President Dr. HACHA and the Czechoslovak Foreign Minister KHVALKOVSKY in Berlin at their request. At the meeting, the situation created by the events of the past week on the former Czechoslovakian territory was openly examined. Both sides were unanimous in their conviction that the aim of all efforts must be to secure peace, order and quiet in this part of Central Europe. The President of the Czechoslovak Republic has declared that, in order to serve this goal and to achieve final satisfaction, he is placing the fate of the Czech people and country in the hands of the Führer of the German Reich with confidence. The Fuehrer accepted this declaration and expressed his determination that he would take the Czech people under the protection of the German Reich and guarantee them an autonomous development of their national life in accordance with their individual characteristics. In witness whereof this document has been signed in duplicate. Berlin, March 15, 1939 signed. HITLER, V. RIBBENTROP, HACHA, CHVALKOWSKY Taken and translated from “Corrections to Contemporary History” (DER GROSSEWENDIG - Richtigstellungen zur Zeitgeschichte Vol.1, P 555–570), for notes, sources, photos and document facsimiles see there. ",
            "date": "Answered June 14, 2020",
            "views": "189",
            "upvotes": "0"
        }
    ]
}