{
    "title": "Why doesn't China need religion, and how have they lived for thousands of years without God? - Quora",
    "tags": [
        "Philosophy of Religion",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Zerusalem",
                "href": "/profile/Jacob-Zerusalem"
            },
            "answer_text": "In 2018, God gave us a new book to explain all fundamental questions of the humanity, including the different religions all over the globe. I guess his own words are the best answer: First there is the background of the answer: The universe is a simulation, but not exactly done by computer. There is a spiritual network over the universe, which is similar to a multi-player online game, where our spirits are serving as our game consoles. So our souls in the heavens(other dimensions/universes) can live out a parallel life on Earth with our organic bodies as the hardware/characters. Everything is physical and scientific. This Earth Project is set up by the Creator(God) to test the health of his heavenly residents and promote their spiritual growth. Then he talked about religion: “Religions, on the other hand, are the answers to these questions (fundamental questions) directly from the Spiritual Realms. They overlap with philosophies, but religions put more emphasis on “origins.” Religions have been trying to clarify people’s spiritual confusion about the truth and meaning of creation, but they also serve as a crucial component of community life. Well-established religious traditions and organizations usually have a long-lasting and powerful influence on regional civilizations. As you might have noticed, many different and contradictory religious theories exist around the world today, and this phenomenon usually causes great confusion among the people: If there is only one God, why are there so many versions of the high being/deity/Creator? Why didn’t I just inspire all people to believe in the same God and solve the problem once for all? I will explain it here. First, please remember that this beautiful universe exists as a testing field. If I want to give people the freedom to choose, there have to be different options to choose from. I try my best to guide my children to the light, but I don’t force my will upon anybody. I prefer to use the same ways to inspire people to develop their own understanding of the creation, just as I do with philosophies, technologies, and art. The distinctive local natural and cultural environments of the early civilizations have influenced and sculpted many religions. People tend to sketch an image of a Creator or heavenly ruler based on their lifestyles and experiences. That’s why there are so many versions of the high deity: Zeus, Jade Emperor, an invisible force called Dao, the truth of Buddha, and many more. Usually, these images are the exalted versions of Earthly rulers in their regions or some embodiment of the Holy Spirit, whose Almighty force had been sensed by the early thinkers through their random glimpses into the Spiritual Realm. These primitive myths and the later, more mature religious systems all serve the same purpose: to precondition my children before they are ready to embrace the truth I would gradually release into the Earth. Do you remember the comparison of my truth with a string of most magnificent pearls? You need to find them all to finish the final version of the masterpiece. There’s no other way. This gospel is doing this job to present you with the crystal-clear truth of mine like never before. My Scripture, the Holy Bible, has been guarding the heart and veins of the divine truth until now and the stream of my divine blood has kept my word alive. Now it is time for me to pump the full amount of divine blood to make my truth stand tall as a giant whose great force will shake the world and wake up the last of the chosen ones. Everything on Earth leads my children to me. And there will be nothing called “religion” in the Kingdom of God. I the Lord will become part of your life and walk among you. God will be in plain sight, like the sun over the Earth, and there will be no further need of speculation and imagination. My divine knowledge will fill the hearts of all my children like living water filling the sea. The whole creation is divine and will be bathed in the eternal glory of the Lord.” -The Book of the Lord: The great revelation of the final harvest I personally believe the whole China will come to the knowledge of God within 10 years, the time is here. The whole world needs to be awakened to the Truth. ",
            "date": "Answered May 11, 2018",
            "views": "253",
            "upvotes": " Answer requested by Stanford Gu",
            "upvoters": [
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                },
                {
                    "user_id": "Alex Pismenny",
                    "user_href": "/profile/Alex-Pismenny"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hough",
                "href": "/profile/James-Hough-1"
            },
            "answer_text": "Nobody can live “without God”. God is, by definition the Creator and Sustainer of all life, and the earth itself. He not only created us at a point in time, but He continues to create us (sustains) or we would cease to ever have been. We are contingent creatures, we can be or not be, there is no necessity in my existence. If my parents had not married, then I would not be. from Modern Catholic Dictionary by John A. Hardon, S.J. Doubleday & Co., Inc. Garden City, NY 1980 Contingent. Whatever can be or not be other than it is; that which need not exist. Thus all creatures are contingent beings, since they come into existence out of nothing, and they are changeable realities that depend totally on the sustaining power of God. from A Catholic Dictionary, edited by Donald Attwater, Second edition, revised 1957 Contingent. I. Contingent being is that which does not contain within its notion the idea of existence, namely that to which existence belongs in such wise that without any contradiction existence can be absent. It is opposed to necessary being in whose idea existence is contained. All beings other than God are contingent. All contingent being is ens ab alio, (a being from another) and the converse. Moreover the ultimate reason or explanation of the existence of contingent being is necessary being. Now, this life on earth is nothing but a temporary trial for us to tell God where we wish to spend eternity: in Heaven with Him, or in Hell separated from Him forever. Outside of the Catholic Church, there is no salvation, which is not to say that it is impossible for anyone to be saved outside the Catholic Church, only that it is more difficult, and that if someone is saved, it is only through the Catholic Church. There has been a Catholic Church in China since at least the 8th century. However, they are still in need of conversion and repentance, and we must all do our part towards this, even if it is only prayer. ",
            "date": "Answered May 11, 2018",
            "views": "161",
            "upvotes": " View 2 Upvoters "
        }
    ]
}