{
    "title": "Why is TAMILNADU government against NEET? - Quora",
    "tags": [
        "Tamil Nadu NEET",
        "National Eligibility cum Entrance Test (NEET)",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "SreeHari Karanam",
                "href": "/profile/SreeHari-Karanam"
            },
            "answer_text": "Some background about higher education in Tamilnadu: Tamilnadu higher secondary examination pattern is inferior to the CBSE examination pattern. In Tamilnadu state boards, one can be rest assured that in the Board exams, the questions are bound to appear from the text book or from questions that the students have already solved. Thus, there is no scope for innovation largely. (Though some students are performing very much out of the box, the problem is this pattern is not getting replicated across the larger cluster of students). Rote learning means that many students are adept with the content in the books but not with the real world problems related to the contents taught in higher secondary education. Why does the state government oppose NEET? If Medical courses were to enrol students on the basis of NEET, a large percentile of medical course aspiring students from Tamilnadu, who have studied their grade XI and XII in Tamilnadu state higher secondary Board would not make it to the medical courses, for NEET has higher standards in terms of candidate evaluation. If most students aren’t able to crack medical entrance exams, the parents, kith and kin would certainly be disappointed. Also, there will come in an aspect of comparison across years, and this eventual comparison of before NEET and after NEET, will allow the parents of medical aspirants that failed to crack NEET, to have a go at the state government for spoiling the dreams of their wards by not protesting in open against NEET. This would certainly affect the vote bank of the ruling party in the next election. Also, if state government were to support NEET, it would have faced severe backlash, particularly after the suicide of Anitha, a medical aspirant. So, there’s a good deal of political motive behind opposing NEET. What should the government have done ideally in the last few years? The government of Tamilnadu should have focused on gradually strengthening the standards of higher secondary education in Tamilnadu and bring it to some comparable standard against the CBSE.Also, some changes should have been brought about in the examination pattern to do away with rote learning and allow for critical thinking by the students by fielding more scenario based problems than the exact replica of bookish problems.Why has the government not bought in to the above ideal requirements? A bunch of reasons: The year they start tightening the screws would see a dip in the results.In a society where people (read as parents, relatives, peer, any damn individual who has nothing to do with a student’s marks) are particularly keen on the total marks scored (TN Stateboard higher secondary exam score of 1197/1200 is more pleasing than having a good deal of practical knowledge but having scored only 400/500 in CBSE senior secondary exams), when there is a dip in overall results across the state, the government might be at the receiving end of the anger of parents, kith, kin and every damn individual, which the government might not want to risk, because, governments have been more prone to see an average result but an instant gratification (favouring the government), than a delayed gratification with excellent results (favouring the students in the long run).If the ruling government were to make a bold move to change the syllabus and examination pattern, but this increases the failure rate across the state in higher secondary exams, the opposition parties would waste no time in bringing up huge protests and rallies against the ruling party and also, setup public meetings and agitate the masses against the government, and in extreme cases, lay a strong demand for bringing down the government.Who are affected by all this? Hands down, students are the ones that are affected by all this. For one, NEET is there to stay, as per Supreme Court, and two, students have been given false hopes that NEET will be done away with, and three, syllabus and exam pattern is not being upgraded, all leading to medical aspirants taking the brunt of the impact. Will this change anytime soon in Tamilnadu? I highly doubt if this will change anytime soon, as everyone seems to be so strongly subscribed to their respective views, that they are blindfolded to the actual scenario and the need for change. ",
            "date": "Answered September 7, 2017",
            "views": "84",
            "upvotes": " View 48 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshaya S",
                    "user_href": "/profile/Akshaya-S-136"
                },
                {
                    "user_id": "Sankar",
                    "user_href": "/profile/Sankar-265"
                },
                {
                    "user_id": "Shrihari R. Iyengar",
                    "user_href": "/profile/Shrihari-R-Iyengar"
                },
                {
                    "user_id": "Sandeep Chandra",
                    "user_href": "/profile/Sandeep-Chandra-1"
                },
                {
                    "user_id": "Sagarika Kullu",
                    "user_href": "/profile/Sagarika-Kullu"
                },
                {
                    "user_id": "Prathik Srinivasan",
                    "user_href": "/profile/Prathik-Srinivasan"
                },
                {
                    "user_id": "Aarthy",
                    "user_href": "/profile/Aarthy-26"
                },
                {
                    "user_id": "Vinaya",
                    "user_href": "/profile/Vinaya-25"
                },
                {
                    "user_id": "Godavarthy Aashritha",
                    "user_href": "/profile/Godavarthy-Aashritha"
                },
                {
                    "user_id": "Subbrammanian Nochur Ganeswaran",
                    "user_href": "/profile/Subbrammanian-Nochur-Ganeswaran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanagaraj Madheswaran",
                "href": "/profile/Kanagaraj-Madheswaran"
            },
            "answer_text": "First we need get the answer for why central government forces NEET on States? then we can understand why Tamilnadu is against it. Every year approximately 10 lakh students are appearing for CBSE 12th board exams. Let’s see about the infrastructure that central government built to accommodate these students. For CBSE Engineering aspirants, Central government has the following institutions IIT (10,000 seats)NIT (30,000 seats)Some Central funded institutes (20,000 seats) Around 10% of the total engineers produced in India are out of these institutes. The entrance for these institutes is conducted by CBSE based on its own syllabus. If you check the infrastructure built by central government for the CBSE medical aspirants, you can find the REAL REASON behind the imposition of NEET. Before 2012, AIIMS Delhi(100 seats)JIPMER Pondy(200 seats)Few Central funded institutes (200 seats approximately) These institutions are conducting its own entrance exams based on CBSE syllabus. Only 1.25% of doctors of India come out of these institutions. Due to the lack of central institutions, CBSE students are forced to compete with their state board students for getting into state-run Medical colleges, in which state-board students clearly has advantage over CBSE students. The central government realized its MISTAKE too late and started increasing its medical institutions. Initiated the construction of AIIMS in multiple parts of India. In 2012, 6 new AIIMS has been opened and still doesn’t meet the need. So the central government wanted a QUICK FIX by getting a SHARE of seats from the state run medical colleges. The QUICK FIX is nothing but NEET. Tamilnadu people are against NEET, because we are thinking why we should suffer for the mistake of central government? To implement NEET, they started talking about the quality of doctors and they dont care about the quality of engineers. ",
            "date": "Answered September 14, 2017",
            "views": "45",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parikshit Sivan",
                    "user_href": "/profile/Parikshit-Sivan"
                },
                {
                    "user_id": "Aha Oho",
                    "user_href": "/profile/Aha-Oho-9"
                },
                {
                    "user_id": "Sankar",
                    "user_href": "/profile/Sankar-265"
                },
                {
                    "user_id": "Abhishek M (అభిషేక్)",
                    "user_href": "/profile/Abhishek-M-అభిషేక్"
                },
                {
                    "user_id": "Ishwarya Arinathan",
                    "user_href": "/profile/Ishwarya-Arinathan-1"
                },
                {
                    "user_id": "Abdul Raheem",
                    "user_href": "/profile/Abdul-Raheem-39"
                },
                {
                    "user_id": "Prathip Pepy",
                    "user_href": "/profile/Prathip-Pepy"
                },
                {
                    "user_id": "Arunachallam DX",
                    "user_href": "/profile/Arunachallam-DX"
                },
                {
                    "user_id": "Shanmugaprabhu R",
                    "user_href": "/profile/Shanmugaprabhu-R"
                },
                {
                    "user_id": "Rishikhant Pandian",
                    "user_href": "/profile/Rishikhant-Pandian"
                }
            ]
        }
    ]
}