{
    "title": "Why did Christianity spread so rapidly in the Roman Empire? - Quora",
    "tags": [
        "History of Christianity",
        "History of Religion",
        "Roman Empire",
        "Ancient Rome",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mert Toker",
                "href": "/profile/Mert-Toker-1"
            },
            "answer_text": "I take Titus-Vespasian theory quite seriously. Christianity looks like a religion to gain members from many classes and probably it is designed for it. I will avoid the concepts like ‘’have Jesus ever lived’’ or ‘’Paul’s mission’’ etc. I guess respect for believers is a pre requisite to answer a question like that.. Needs some prudence.. Christianity was the reformed Jewish religion and if Christ ever lived he did not have the aim of building a new religion. He was a reformer and protestant jewish fulfilled the expectancy of Messiah… He tried to reform the Jewish religion however he never claimed to have a new one. The societies around Mediterranean was waiting for Messiah for centuries..It was a very common idea of the time. Why Christianity spread so fast? Few points… 1) Vespasian and Titus promoted and protected Christianity during and after the revolt of Jerusalem. They wanted to divide Jewish resistance throughout the empire, a Jewish sect at the time ( Christianity originally a Greek term not Hebrew) was perfect for it. Christianity was humanistic, avoids war even says words like when you get slapped turn the other cheek. On the other hand, Jewish religion said eye for eye, teeth for teeth ( originally Hammurabi’s law) Not exactly useful for Romans.. Especially these two emprerors protected and promoted Christianity in order to divide Jews. Christian jews did not fight with jews of Jerusalem and they did not get involved in Bar Kokhba revolt neither. Anyway Jewish authorities expelled Christians out of their religion in late first century officially. They had seperate ways after a while. Jews found Christians not trustworhy against Romans. Roman political authorities turned against Christianity when their numbers increased and looked like a political threat but a century later. They were tolerant most of the time no matter some court historians say… 2) Jews and Greeks of Alexandria had tensions in Egypt.. There was difficulty in tax collection and productivity. Romans needed a softer Jewish philosophy. Philo’s family was very close to the Roman court. Philo could see Caligula( Little boots in Roman, a nickname )in person and talk about the problems. They were wealthy Jewsih tax collectors for Rome. His cousin was also involved in oppressing Jewish rebellion in Jerusalem and being a Jew ( changed his name and religion) was on the side of Romans. The historain Josephus a jew by birth (real name Ben Matthias) also turned and became Titus-Vespasian family court writer. He specially wrote history for the benefit of Romans and Roman court. .One of the first writers mentions Christianity after a century later. Philo’s Logos and Plato style approach has many similarities with Christianiy. It is strange that although Canaan rabbis knew him ( Philo and the family) very well, he never met Christ in person, probably never heard of him. That’s strange… 3) Christianity as a religion was not news for Egyptians and even Romans… The growth rate was unbelievable specially in Egypt. Europe followed Egypt’s footsteps. A cultural exporter of the time..It was very similar to former religions of Egyptions and was old news for them. Check Horus-Osiris stories… Or ankh and cross.. Or Dec. 25… Reborned stories etc… I am not claiming it was same but similar.. I am not claiming anything which might offend the believers of the religion. A sensitive issue for many people.. Mithras temples were so similar to Christians.. Some Christian temples (church)were built on former Mithras temples. Even Justin the Martyr claimed Mithras religion imitated Christianity after a couple of centuries..Actually Mithras religion was much more older therefore it is speculative to say who imitated who if there is any imitation. From my point of view, Christianity eventually became sythesis of Jewish religion and antique Roman religions. Therefore it suited to masses with humanistic approach, specially to oppressed people 4) Christianity was open to everyone( Gentiles) not exactly a religion of chosen people… Therefore it had some advantages. It was open to regular people, poor people, slaves,soldiers who were effected from Mithras ideas of east, businessmen etc. In Christianity everybody was equal therefore it created a major revolutionin human history. That’s the basic reason for the expansion of Christianity… Therefore in couple of centuries their numbers became a politic reality. Christianity became a a type of political party in empire. ( Populace against aristocrats) . Christianity’s growth rate was higher in eastern parts of empire than western. From my point of view , this is due to there were more dissidents of Rome in east than west and Christianity became a smooth way to oppose Romans. East was very tired of Rome’s taxes and asia minor specially was a bridge to exhange beliefs and religions. Some scholars claim that men were more inclined to accept Christianity than women. Women of the time wanted to see visible gods and goddesses at home. Eventually Christianity also became full of idols.( as opposed to Jewish and Islamic religion) 5) Constantine( the great) had Christian soldiers in his army and since his rival was on the side of pagan party, he emphasized Christianity and eventually became Christian. Although his printed coins reflect pagan values as well Christianity became a great political tool because many people believed in it. Constantine himself was not a real believer according to many scholars. Disputable… 6) Even Western Roman Empire chose Christianity as official religion. So called barbarians( mostly germanic races some of them also christians) pushing empire’s borders and they needed a social unity. Although many pagans continued to live in Europe through 10 -11 th centuries Christianity became a legitimized social and politic platform. It replaced Roman laws and provided a new justice system in middle ages. Pope institution( Papacy) replaced former religious authorities and heavily involved in politics. ",
            "date": "Answered January 26, 2019",
            "views": "37",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marilyn George",
                    "user_href": "/profile/Marilyn-George"
                },
                {
                    "user_id": "Marksman Rivalle",
                    "user_href": "/profile/Marksman-Rivalle"
                },
                {
                    "user_id": "Adrian Sean Heidmann",
                    "user_href": "/profile/Adrian-Sean-Heidmann"
                },
                {
                    "user_id": "Merimar Ni Fiach",
                    "user_href": "/profile/Merimar-Ni-Fiach"
                },
                {
                    "user_id": "Robert Zuch",
                    "user_href": "/profile/Robert-Zuch"
                },
                {
                    "user_id": "Marcus Deans",
                    "user_href": "/profile/Marcus-Deans"
                },
                {
                    "user_id": "Rajendra Trivedi",
                    "user_href": "/profile/Rajendra-Trivedi-3"
                },
                {
                    "user_id": "Matthew Webster",
                    "user_href": "/profile/Matthew-Webster-34"
                },
                {
                    "user_id": "Jeff Dean Arndt",
                    "user_href": "/profile/Jeff-Dean-Arndt"
                },
                {
                    "user_id": "Elena Foulkes",
                    "user_href": "/profile/Elena-Foulkes"
                }
            ]
        }
    ]
}