{
    "title": "Why was Stalin annoyed with Churchill and Roosevelt in World War II? - Quora",
    "tags": [
        "Franklin D. Roosevelt",
        "Winston Churchill",
        "Joseph Stalin"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grahame Nicholson",
                "href": "/profile/Grahame-Nicholson"
            },
            "answer_text": "Stalin was always complaining the allies (Soviet Union was an enemies enemy not an ally) were not giving sufficient support and demanding an invasion of Europe to take the pressure off his forces. The Americans wanted to try it the British said don’t be dumb we will get slaughtered we are too weak and unprepared yet. The British convinces the US to invade North Africa Sicily and Italy instead to draw off German forces and destroy them there. Stalin was continually saying the USSR was about to collapse if another European front was not opened. Now Stalin was the ally of Germany when the war started, He and Hitler had a pact to divide up Poland and eastern Europe . Stalin invaded Poland shortly after they were attacked by Germany and the USSR got eastern Poland. Germany agreed that Russia could have the Baltic states Latvia Lithuania and Estonia and the eastern part of Finland. The USSR provided Germany with oi,l steel, rare minerals that were used in aircraft and tank production and masses of food particularly wheat which allowed a lot of he German farmers to be sent to the army for operations without a concern of food shortages. This all stopped only after Hitler back stabbed Stalin two years after the start of the war and invaded. Up to that time the USSR was hostile to Britain and France pre invasion France. There were great fears that USSR would enter the war on the side of Germany. One of the issues put to Hitler by his generals was that by invading the USSR Germany would be initially cut off from the massive Russian aid they were getting. Hitler said the war will be short and then we will have it all. This was a great problem in the end because the war was not short and Germany suffered a lot from not having this mas of material. Stalin was absolutely shameless in then making incredible demands from Britain and the US to immediately invade Europe and send everything he might need and complaining bitterly and publicly if the Allies did not jump through the particular hoop he was holding in quick time. The Americans were less wary of Stalin because they were not in the war and had not suffered because of USSR’s support for Germany. But the British had been screwed by Stalin for nearly 2 years and they had no nice feelings for him at all. The did know that: they needed the USSR to keep fighting Germany or the other way around actuallyother than that Stalin could p..s up a rope.They would support Russia in the war effort but they would not bleed just because this vicious untrustworthy proven enemy demanded it. They blamed Stalin’s machinations for a lot of the pain Germany had inflicted. Pre war Germany had been limited in war technology and numbers by the Versailles treaty from their surrender in WW1. Russia was instrumental in helping Hitler to overcome many restrictions of the treaty. He allowed German tank and aircraft trials and development to be done on Soviet territory. This prevented the inspectors that the treaty had agreed on from shutting down the work as the treaty agreement allowed. Hitler shared German tech information with Stalin as a reward. So Stalin was a manipulator. The British could not care less how much Stalin complained and got angry. They looked at it as “What is needed to keep the USSR in the war that will not damage us too much.” The USA not being part of European politics more tended to react to Stalin’s demands thinking that if Stalin said this or this must happen or USSR will collapse as a realistic scenario. Britain had to work hard to convince the USA that Stalin was a liar and would manipulate to put the Soviet Union in a position of insurmountable European dominance after the war and the US and Britain had to make sure that they did not allow the creation of a bigger threat than Hitler. So Stalin was annoyed he did not get everything he wanted. The USA gave him far more influence than the British wanted but Eisenhower was a very sick man at the Yalta conference and it seemed he just wanted it all to end asap. Churchill said that the conference ended up being Stalin and Roosevelt voting against Britain and the results were seen in the cold war. ",
            "date": "Answered April 15, 2020",
            "views": "23",
            "upvotes": " Answer requested by Amy Alkon"
        },
        {
            "author_info": {
                "name": "Allen Edwards",
                "href": "/profile/Allen-Edwards-12"
            },
            "answer_text": "Despite his very paranoid personality and not trusting them, Stalin felt Roosevelt & Churchill were to slow to launch a second front against the Germans. Stalin felt the Western Allies were leaving the USSR to do all the fighting, Stalin kept pushing for them to launch one as early as 1942 to take some of the pressure off the Soviet Union who was taking on the bulk of the German army on their own. But each time Churchill claimed the Western armies weren’t ready to mount an invasion of mainland Europe, Churchill favoured the option of invading Europe via Italy and striking Germany from the south ‘the soft under belly of the crocodile’ as Churchill described fortress Europe. Stalin at first was intrigued by this idea, and the invasion of Italy did force Hitler to withdraw some tank divisions from the battle of the Kursk on the eastern front to Italy, however the advance in Italy was slow and Roosevelt & Stalin wanted a second front to take place sooner. ",
            "date": "Answered April 15, 2020",
            "views": "7",
            "upvotes": " Answer requested by Amy Alkon"
        }
    ]
}