{
    "title": "Why do masses love Vikings? - Quora",
    "tags": [
        "Early Middle Ages (era)",
        "Vikings (TV series)",
        "Vikings",
        "Culture (social science)",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Singewald",
                "href": "/profile/Peter-Singewald"
            },
            "answer_text": "There are probably many reasons. 1st they are “cool”, at least, that is the image we get shown. They are strong, wild, rough, manly, successfull, and have good press, because there are several countries they conquered or held and became kings or at least dukes of. So here we have something for the tough boys / men to like. 2nd the viking women had more rights than women in most other countries in the middle ages (at least, that is how it seems). And we get Shield-Maidens, although there is some debate about that. Here we get some love from girls / women. 3rd they were kind of anti-establishment. They started by robbing monasteries and churches and the boring, established kingdoms (they were not boring, but raiders are more interesting). This is bs, but somehow for some people, it seems to make the some kind of “freedom-fighters”. 4th they were explorers who “found” Island, Greenland and America, explored into the mediteranian and even traded with Constantinopl. What is not to like about daring explorers and traders. 5th the Varangian Guard. 6th somehow the old germanic gods have a special appeal and the vikings are at the front of most peoples thought when they think about their worshipers. Here we get some love from people with alternative religions. 7th their history is quite interesting, with lots of connections to the history of many other countries (sometimes even starting it). Here we get the historians and people who like history-documentations on TV. 8th though we know quite a bit about them, they are still somewhat mysterious. We have many stories, that are not complete or where we only know, that there must be more, We have legends, where we can see a bit of actual history, We have ritual places, where we can only guess, what happened there. We have the discovery of America, what for a long time seemed to be a myth. Myths are allways popular. My two pence on the topic. ",
            "date": "Answered October 24, 2020",
            "views": "533",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anju Julius",
                    "user_href": "/profile/Anju-Julius"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Riis",
                "href": "/profile/Simon-Riis-2"
            },
            "answer_text": "Romanticized Idealization started in the early 1800s. It’s understandable from the contemporary perspective that the Viking became popular. But we seem to have forgotten that the people we are idolizing are mostly farmers who really isn’t that remarkable, or criminals. We could have chosen to idolize them for their enginelity and craftsmen ship. How they were the best travelers of their day. But no, to us the Viking stands for brute force that won’t stop for anything and doesn’t care who gets hurt. And that is not a good trait in my book. Plus, their pottery was crap :-b ",
            "date": "Answered October 25, 2020",
            "views": "671",
            "upvotes": "0"
        }
    ]
}