{
    "title": "Why are a lot of people bashing Joe Biden? - Quora",
    "tags": [
        "Joe Biden Possible 2016 Presidential Campaign (2015)",
        "Joe Biden (politician)",
        "Democratic Party (US politics)",
        "Politics",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arthur Newton",
                "href": "/profile/Arthur-Newton-3"
            },
            "answer_text": "The people bashing Biden the hardest are the republicans who are scared of him. They can’t paint Biden as corrupt so the best they can do is go after his son who cashed in on his name. Imagine cashing in on your father’s name, right Ivanka, Eric and Don Jr…… When Joe Biden was a Senator he was always at the bottom of the list as far as wealth went. He lived in an upper middle class neighborhood in Delaware believe it or not. He would take the AMTRAK Metroliner train to Washington on Sunday night or early Monday, work as a congressman and then a Senator and ride the Metroliner back home fro the weekend. No private planes or questionable use of government transportation there. Biden is far from perfect. He has a tendency to base his votes on whatever he thinks will be the popular way and hasn’t gone against the grain to do the right thing always. Two examples of this: Clarence Thomas - This was a man that was not qualified to be on the Supreme Court. He had harassed women including Anita Hill as was proven in sworn testimony. There were others waiting in the wings to also testify. The GOP was claiming racism in the allegations against Thomas. Joe Biden had a choice to make. He could have allowed other victims of Thomas to testify or stop them and just do the vote. He weighed his opitions and decided that pissing off women would be better for him than pissing off black people. And that is why Clarence Thomas is on the Supreme Court. The other example was his vote in favor of the Iraq War. There was ample evidence that George W Bush was lying about the WMDs being in Iraq and Iraq being a threat to the US. They never were. Biden probably knew this but voted in favor of the war because he was afraid of political backlash. To his credit Biden has acknowledged both of these actions as mistakes, something that no Republican ever does. Joe Biden is a decent man, experienced and fully capable of doing the job of President. Certainly far more than the alternative. ",
            "date": "Answered March 13, 2020",
            "views": "746",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Minami",
                    "user_href": "/profile/David-Minami-2"
                },
                {
                    "user_id": "Alan Atkinson",
                    "user_href": "/profile/Alan-Atkinson-4"
                },
                {
                    "user_id": "Steven Salamon",
                    "user_href": "/profile/Steven-Salamon"
                },
                {
                    "user_id": "Sam Burns",
                    "user_href": "/profile/Sam-Burns-135"
                },
                {
                    "user_id": "Greta Sproul",
                    "user_href": "/profile/Greta-Sproul"
                },
                {
                    "user_id": "Richard Johnson",
                    "user_href": "/profile/Richard-Johnson-133"
                },
                {
                    "user_id": "Dean Jones",
                    "user_href": "/profile/Dean-Jones-146"
                },
                {
                    "user_id": "Diane Griffith",
                    "user_href": "/profile/Diane-Griffith-1"
                },
                {
                    "user_id": "Deb Headley",
                    "user_href": "/profile/Deb-Headley"
                },
                {
                    "user_id": "Jean Lamb",
                    "user_href": "/profile/Jean-Lamb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Polityka",
                "href": "/profile/Robert-Polityka"
            },
            "answer_text": "There are several concerns I'd ask about Joe Biden: Is he healthy enough to serve as President? On Day 1, he'd be the oldest person to serve as President, at age 78. Also, i'd be worried if he had history of 2 brain aneurysms before becoming Vice President.Who would he choose as his Vice President? I'm thinking that he might die or become incapacitated before the term is over.Where does he stand when it comes to the Obama Administration? He wants to emphasize his close relationship with the Ex-President. He likes to speak of his role and the accomplishments in the Obama Administration, but doesn't want to speak of areas where he disagreed with Obama. (Most Vice Presidents keep what is said between themselves and the Presidents they serve under as confidential). His ties to Obama make him the defacto front runner.He served 36 years in the Senate.There's a papertrail of where he stood on the issues during those six terms and he talks about he would act differently if he could do it again.He speaks of his relationships with former Senators. However, the media tend to focus mainly on Southern Conservatives, such as Strom Thurmond and Jesse Helms. What is not mentioned is the fact that some Southern Democratic Senators were there to help him out with his committee assignments and that they were there after his first wife died when he was a Senator-elect. He thought about resigning, but they convinced him to stay for six months before making a final decision. Biden was only 30 years old and they looked after him like a son. He didn't have to agree with them ideologically, but was able to make friends. When Biden rose to leadership positions on Judiciary and Foreign Relations, he dealt with Southern Republicans as his counterpart from the opposite party, mainly Thurmond and Helms. He found a way to find common ground and was able to disagree without being disagreeable.",
            "date": "Answered August 27, 2019",
            "views": "233",
            "upvotes": "0"
        }
    ]
}