{
    "title": "Why have so many people hated Jews, down through the ages and still to this day? - Quora",
    "tags": [
        "Judaism",
        "Jewish Ethnicities and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Birch",
                "href": "/profile/Rebecca-Birch-11"
            },
            "answer_text": "There are a LOT of reasons, but antisemitism goes far back in history, back even before the days of Christianity (although it got a significant boost around then). Speaking as a Jew, one of the most common things that I have noticed is that it’s just, well, easy. It’s easy to fall back onto the group that has been scapegoated for literally thousands of years. Another reason, going back in time, is because Jewish culture has always been rather insular. We aren’t in the practice of actively trying to grow our community by inviting others in (we are actually prohibited from going out to convert people, and it’s difficult to choose to convert). Because of this, it has always been easy to paint Jews as the “outsider”, and therefore paint us as dangerous. Antisemitism itself is also structured in a way that makes it easier to maintain and perpetuate. When you think of bigotry- for example, anti-Black racism, the premise of that is that Black people are lesser. They have been persecuted and enslaved because they have been portrayed as having less worth and power than white people. But antisemitism operates differently. It works on the idea that Jews are all part of a secret, powerful group. That Jews “control the (insert thing here)”- we’ve been accused of controlling everything from Hollywood to the banks to the whole world. Antisemitism is such that it allows people to hate Jews, all while they act like they are punching up instead of down. When people hate Jews and accuse us of things like blood libel, it isn’t racist, because the Jews have power and are oppressing us! When people accuse Jews of controlling banks and being rich, they can frame their antisemitic bigotry as pushing back against an evil power. It’s exactly this that allows swells of antisemitism, especially like what we are currently seeing on the political left in America: Jews are being kicked out of movements (like the Women’s March, the Dyke March, the LGBTQ+ rights movement, various human rights movements) on the false pretense that these groups are “protesting the actions of a violent nation” (Israel)- nevermind that these movements are based in the USA and us Americans Jews have nothing to do with the government over there. But this is based in the antisemitic trope that Jews are all linked, and that we have power. That got longer than I expected, so Tl;Dr- Jews have been scapegoats from the start for a number of reasons, and antisemitism itself is constructed in such a way that it allows anti- Jewish sentiments to be passed off as “fighting an oppressive power”. ",
            "date": "Answered July 5, 2019",
            "views": "31",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kawali Kawalikah",
                    "user_href": "/profile/Kawali-Kawalikah"
                },
                {
                    "user_id": "Joni Okun",
                    "user_href": "/profile/Joni-Okun"
                },
                {
                    "user_id": "Sean Kean",
                    "user_href": "/profile/Sean-Kean-2"
                },
                {
                    "user_id": "Jesse Freeman",
                    "user_href": "/profile/Jesse-Freeman-18"
                },
                {
                    "user_id": "Alyce Minsky",
                    "user_href": "/profile/Alyce-Minsky"
                },
                {
                    "user_id": "Steve Ribich",
                    "user_href": "/profile/Steve-Ribich-1"
                },
                {
                    "user_id": "John Engelman",
                    "user_href": "/profile/John-Engelman-4"
                },
                {
                    "user_id": "Sol Tuller",
                    "user_href": "/profile/Sol-Tuller"
                },
                {
                    "user_id": "Eric Mallett",
                    "user_href": "/profile/Eric-Mallett"
                },
                {
                    "user_id": "Tammy Collier Loll",
                    "user_href": "/profile/Tammy-Collier-Loll"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Laitman",
                "href": "/profile/Michael-Laitman-4"
            },
            "answer_text": "There are all kinds of stated reasons for people hating Jews over the course of history, whether it be holding too much power in countries we’ve assimilated into, ruling the whole world, being greedy, envy of our disproportionate success in the world compared to other nations, oppressing Palestine as a Jewish State, the fall of Germany in World War I, the assassination of Tsar Alexander II in 19th Century Russia, drinking children’s blood in the Middle Ages, denying Muhammad’s prophethood and murdering Jesus Christ. More fundamentally, however, according to the wisdom of Kabbalah, the reasons many people give for Jew hatred are preceded by the sensation of hatred in and of itself. As Kabbalist Rav Yehuda Ashlag (Baal HaSulam) writes in his article The Solution: “It is a fact that Israel is hated by all nations, whether for religious reasons, racial reasons, capitalist reasons, communist reasons, or for cosmopolitan reasons, etc. It is so because the hatred precedes all reasons, but each merely resolves its loathing according to its own psychology.” In other words, hatred of Jews is independent of the many varied actions and behaviors of the Jewish people. Hatred of Jews is rather a sensation embedded in nature that emerges within people. How does the sensation of Jew-hatred surface? In order to answer this, we need to understand the foundation of the Jewish people, the Jewish role in the world, and how non-Jews respond in relation to whether or not Jews are performing this role. The Foundation of the Jewish People The Jewish people emerged in ancient Babylon some 4,000 years ago. It was a time when Babylon was experiencing a crisis of social division, with conflicts and hatred tearing up the ancient Babylonian society. During this period, Abraham, a Babylonian priest who discovered the path to unite above the growing divisions, i.e. reaching the revelation of the single force of love and bestowal that exists in reality above the growing ego, began openly teaching his method to anyone who wanted to learn. Since social division was felt as a burning problem, many people flocked to learn with Abraham. He guided them to the discovery of the single force of love and bestowal above their divisive drives. The group he led became known as “the people of Israel” (i.e. “Israel” coming from “Yashar Kel,” which means “straight to God,” i.e. straight to the single force of love and bestowal that exists in reality), and later they became known as “Jews” (the Hebrew word for “Jew” [Yehudi] comes from the word for “united” [yihudi] [Yaarot Devash, Part 2, Drush no. 2]). Therefore, the Jewish nation was founded not on a biological basis, but on an ideological one. People from all over ancient Babylon who felt a problem with social division and a need for unity gathered under Abraham’s method and united above their divisive drives. By doing so, they became known as “a light unto the nations,” as the attainment of the one, unique and unified force of nature above the human ego, which causes all the divisiveness and problems in society, has a positive domino effect that “upgrades” human consciousness: it leads to more positive connections, more consideration, support, love and care, among humanity in general. The Jewish Role in the World As it was then, so it is today, but on a much larger, global scale. The overblown human ego, social division, conflicts and hatred are all experiencing an exponential boost, bringing about myriad problems and crises. For instance, despite more human population than ever before on the planet, and all the technological connections that have been established worldwide, human society feels more and more isolation, stress, depression, emptiness and anxiety. The more people feel such problems, the more there is a subconscious feeling that the Jews are the cause of these problems. That is where the sensation of Jew-hatred comes from: that the Jews have a role in the world, to unite (“love your friend as yourself”) above division (“love will cover all transgressions”), and by doing so, be a conduit for the single unifying force of love and bestowal to spread throughout the collective human consciousness (“a light unto the nations”). The Response to the Jews from the Nations of the World in Relation to the Jewish Role If we function correctly in relation to our role in the world, uniting among each other in order to pass unity to the world, then we will experience a positive reaction from everyone in the world. If, however, as it currently stands, we fail to acknowledge or make any effort to unite among each other, we thus block the positive unifying force from reaching humanity, and hatred stirs up in non-Jews toward the Jews as a natural phenomenon that serves to pressure us Jews to perform our role. It is thus my hope that we Jews will realize our role in the world sooner rather than later, sparing the world and ourselves much suffering. We simply don’t see what it would mean if we make some steps toward uniting, how much all the tension in human society and between nations would calm down, how all the exploitation, manipulation, hatred and abuse in humanity would be replaced by mutual support, consideration, love and care for our fellow human beings. This is why I put in so many efforts to disseminate the message about the role of Jews in the world, and the cause and solution to anti-Semitism, since humanity's future of happiness or torment depends specifically on this. ",
            "date": "Answered November 28, 2019",
            "views": "24",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stan Tarne",
                    "user_href": "/profile/Stan-Tarne"
                },
                {
                    "user_id": "Ed Stoner",
                    "user_href": "/profile/Ed-Stoner-1"
                },
                {
                    "user_id": "Noah Frank",
                    "user_href": "/profile/Noah-Frank-21"
                },
                {
                    "user_id": "Pauline Underwood",
                    "user_href": "/profile/Pauline-Underwood-1"
                },
                {
                    "user_id": "William Lee",
                    "user_href": "/profile/William-Lee-720"
                },
                {
                    "user_id": "Abhi Irina",
                    "user_href": "/profile/Abhi-Irina"
                },
                {
                    "user_id": "Vaibhav Mohit",
                    "user_href": "/profile/Vaibhav-Mohit"
                },
                {
                    "user_id": "Leta Rosetree",
                    "user_href": "/profile/Leta-Rosetree-1"
                },
                {
                    "user_id": "Lucifer Morningstar",
                    "user_href": "/profile/Lucifer-Morningstar-453"
                },
                {
                    "user_id": "Ryan G",
                    "user_href": "/profile/Ryan-G-451"
                }
            ]
        }
    ]
}