{
    "title": "Why was the Battle of Khanwa fought? - Quora",
    "tags": [
        "Historic Battles",
        "Historical India",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maarij Ali",
                "href": "/profile/Maarij-Ali"
            },
            "answer_text": "The first and greatest Mughal Emperor, Babur, had just defeated the last Sultan of Delhi, Ibrahim Lodhi, at the First Battle of Panipat in 1526. Delhi and Agra had both fallen to him and he resolved to stay in India permanently (instead of returning to Kabul) and to establish an empire. His fledgling kingdom was surrounded by hostile nations and imminent dangers on all sides. By far the most threatening of these was the Rajput Confederacy under the redoubtable Rana Sanga of Chittor.  Rana Sanga Rana Sanga was the most formidable Rajput chief of his age and the lords of Marwar, Amber, Gwalior, Ajmir and many other principalities swore fealty to him. Sanga had fought countless wars to bring these states under his control and had paid the price. He had lost an eye and an arm in battle and his body was covered with eighty wounds. In battle he commanded 120 chieftains, 80,000 horse and 500 war elephants. Hearing of Babur’s victory, Rana Sanga perceived him as a danger due to the close proximity of their kingdoms and, more importantly, gunpowder weapons he had employed so effectively to end the Sultanate of Delhi once and for all. Babur too knew that the Rajput confederacy posed the greatest threat to his empire, given the fighting prowess of the Rajputs and the fact that the confederacy was virtually located in the backyard of Delhi. If he was to be secure in his new domains he would have to deal with Sanga. Sanga felt the same. There could only be one dominant power in Northern India and only battle would decide which it was. Rana Sanga proceeded with the entirety of his Rajput army against Babur’s reinforced army of 48,000 Afghans and 500 artillery pieces. In preparation for the battle Babur chained his gun carriages and baggage wagons together on the front of his army and placed his guns between them. Behind the guns were the matchlock men under Ustad Ali Quli Khan. He was one of the Turkish generals, along with Mustafa Rumi, sent by the Ottoman Sultan Selim I to aid Babur. The forward guns were placed under Ustad Ali’s command while the left was under Mustafa Rumi. The armies met near the village of Khanwa on 16 March 1527 and the battle began on the same day. Rana Sanga’s Rajputs attacked Babur’s right flank. Babur instantly threw his reserves at them and ordered his gunners to open fire. The Rajput charges were almost unstoppable and barely did Babur contain the situation. After several hours of hand-to-hand fighting, Babur sent his flanking columns to wheel around the Rajputs and charge them from the rear, the tulughma. Sandwiched between the cavalry and guns, the Rajputs were pressed into a disorganized crowd. What would otherwise have been a quick victory was only prolonged by Rajput valor and bravery. But at the end of the day Babur emerged victorious. Essential in his victory had been Ustad Ali’s skillful use of the artillery. This battle was Babur’s finest hour where he decimated the first class fighters of India. Rana Sanga escaped but died soon due to the wounds obtained from the battle. The Rajput Confederacy broke up. No chief of Sanga’s line ever faced an emperor of Babur’s line after this battle.  Zahir ud Din Muhammad Babur “With fame, though I die, I am content, Let fame be mine, though life be spent.” -Babur ",
            "date": "Updated January 6, 2019",
            "views": "31",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bharath S.r",
                    "user_href": "/profile/Bharath-S-r-6"
                },
                {
                    "user_id": "PRABHKARAN SINGH",
                    "user_href": "/profile/PRABHKARAN-SINGH-11"
                },
                {
                    "user_id": "Shaurya Vardhan Thakur",
                    "user_href": "/profile/Shaurya-Vardhan-Thakur"
                },
                {
                    "user_id": "Ahmed Shah",
                    "user_href": "/profile/Ahmed-Shah-323"
                },
                {
                    "user_id": "Shariq Nawaz khan",
                    "user_href": "/profile/Shariq-Nawaz-khan"
                },
                {
                    "user_id": "Amit Verma",
                    "user_href": "/profile/Amit-Verma-221"
                },
                {
                    "user_id": "Gerhard Herzet",
                    "user_href": "/profile/Gerhard-Herzet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dipali Tikhile",
                "href": "/profile/Dipali-Tikhile"
            },
            "answer_text": "The Battle Khanwa was fought between the Rajput ruler Rana Sanga and Mughal ruler Babar. Actually, at that time the Rajput King Rana ruler wanted to destroy the Lodi dynasty in Delhi and establish himself in Delhi. At the same time, to end the Lodi dynasty, Rana Sanga and Daulat Khan Lodi invited Babar in India and at the same time they think that like other Muslim ruler , would go back to India after plundering, and same think would be done by babar and after that they would be able to sit on the throne of Delhi.  But later when Babur decided to rule in India and did not return, a fierce struggle broke out between Rajput King Rana Sanga and Babur, which later became famous as the Battle of Khanwa. ",
            "date": "Answered August 13, 2019",
            "views": "357",
            "upvotes": "0"
        }
    ]
}