{
    "title": "Why was the atomic bomb created in the first place? How close was Germany to creating the bomb? - Quora",
    "tags": [
        "Atomic Bombs",
        "Atomic Bombings of Hiroshima and Nagasaki (August 1945)",
        "Explosives",
        "Bombs",
        "Nuclear Physics",
        "Nuclear Weapons",
        "World War II",
        "Germany",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harvey Ardman",
                "href": "/profile/Harvey-Ardman-1"
            },
            "answer_text": "Fears that Germany might be developing an atomic bomb inspired the US to begin its own effort. The bomb was developed with the idea of using it on Germany, but Germany surrendered before that could happen, before the bomb was ready. There was, however, another worthwhile target for the bomb—Japan. The US was winning the war against Japan, but the prospect of invading that nation to totally subdue it was daunting. US military authorities calculated that such an invasion might cost America the lives of a million soldiers, not to mention a similar number of Japanese soldiers and civilians. And so, we had Hiroshima and Nagasaki and the quick surrender and occupation of Japan—the end of the war in the Pacific. As for German’s nuclear developments, that nation never made it a first priority. It did not devote the necessary resources of men, material or money to do the job urgently. Research and development work was undertaken, but it was relatively primitive and unpromising. At war’s end, Germany was years away from developing a nuclear bomb. ",
            "date": "Answered November 19, 2019",
            "views": "370",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Tenbrink",
                    "user_href": "/profile/Steve-Tenbrink"
                },
                {
                    "user_id": "Patricia Cooper",
                    "user_href": "/profile/Patricia-Cooper-18"
                },
                {
                    "user_id": "Carey Cain",
                    "user_href": "/profile/Carey-Cain"
                },
                {
                    "user_id": "Liam Crowleigh",
                    "user_href": "/profile/Liam-Crowleigh"
                },
                {
                    "user_id": "Thomas Kinney",
                    "user_href": "/profile/Thomas-Kinney-3"
                },
                {
                    "user_id": "Richard Anthony Scales",
                    "user_href": "/profile/Richard-Anthony-Scales"
                },
                {
                    "user_id": "Tony Hartzell",
                    "user_href": "/profile/Tony-Hartzell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Holmén",
                "href": "/profile/Robert-Holmén"
            },
            "answer_text": "As all weapons are, the atom bomb was created to have an advantage in war. Prior to WWII, knowledgeable people in the west had noticed research in Germany that seemed to be making an atom bomb possible. They warned the US government, which began its own a-bomb research program. In hindsight, we now know the Germans never got very close. They didn’t have the resources and didn’t put the time into it that such an endeavor needed. But, during the war, no one knew it would turn out that way. The race was on to get it before they did. ",
            "date": "Answered November 19, 2019",
            "views": "142",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Tenbrink",
                    "user_href": "/profile/Steve-Tenbrink"
                },
                {
                    "user_id": "Harvey Ardman",
                    "user_href": "/profile/Harvey-Ardman-1"
                }
            ]
        }
    ]
}