{
    "title": "Why did Christianity not gain as large a following in the pre-Islam Middle East as it did in Europe? - Quora",
    "tags": [
        "The Middle East",
        "Europe",
        "Islam",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Cannon",
                "href": "/profile/Thomas-Cannon-15"
            },
            "answer_text": "Christianity spent its first few centuries as an oppressed and persecuted minority within the Roman Empire with varying levels of influence wherever it went. It didn’t have the earthly gratification or named and faced gods of differing spheres of the other world religions like Hellenism and was pretty much an off-shoot sect of Judaism, a religion that a lot of people have never really liked. Christianity had a slow but steady growth of influence through preaching and evangelism until it was adopted as the religion of the Romans, the big world power that ruled pretty much the entire Northern Hemisphere excluding Asia and most of Africa. However, Christianity remained at its middling status in the Middle East despite the rule of Rome because of one simple fact - the Middle East had old and complex political systems that Rome left largely untouched. The Jews, for example, were allowed to be as Jewish as they wanted so long as they paid the taxes due to Rome - “Render unto Caesar what is Caesar’s.” The Romans typically either conquered, colonised or adopted nations, with differing treatment based on each individual nation. Christianity was adopted as the state religion of Rome in the 4th century but not forced onto the conquered peoples, so saw a moderate rise in the Middle East and was fairly well-established in the area by the 6th century. Islam exploded onto the scene at the tail end of the 6th century and violently dominated the Middle East in a very short span of time. The next part may be controversial but is important to understand why Christianity quickly fell out of the region for a long time. Muhammad ibn Abdullah quite famously had a very… tenuous relationship with both Christianity and Judaism who had sizeable presences in the region, although nothing compared to the various polytheistic tribes of the era. Muhammad preached that he was the successor to their collective faith, tried to convince them that he was their final prophet and that the monotheists of Islam, Judaism and Christianity would be victorious against the polytheists, but his attitude soured when he was firmly rejected by both Jews and Christians for not just providing no evidence for his claims such as performing no miracles and creating weak stories to justify his claims (God crucified someone else in Jesus’ place and lied to everyone about it because… reasons, I guess) but also for displaying such a weak understanding of their teachings and scripture (like believing that the Christian Trinity is God, Jesus and Mary instead of the Father, Son and Holy Spirit) that they mocked him for believing everything he was told by small heretical sects and gave him the nickname of ‘the Ear’ because he was all ears. Therefore he became increasingly violent and oppressive in his treatment of Jews and Christians, introducing the concept of dhimmitude (second-class citizens who paid extortionate taxes to be allowed to practise their faith) and swearing to “expel the Jews and Christians from the Arabian Peninsula until I leave none but Muslims.” That’s not to say he actually followed through on the matter - he died soon afterwards and his successors were more concerned with the conflict and warfare within their ranks, such as the conflict between Muhammad’s wife Aisha (yes, the child bride) and his son-in-law Ali that would lead to the divergence of Sunni Islam and Shia Islam in the First Fitnah and the rebellion against the third caliph Uthman. Christians and Jews have since had a small but recognisable presence in the region. But Christianity was never a dominating influence in the Middle East because of Rome’s policy of allowing states autonomy so long as they paid taxes and provided resources for the empire. ",
            "date": "Answered September 25, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Maher",
                    "user_href": "/profile/Joe-Maher-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maciej Czyż",
                "href": "/profile/Maciej-Czyż-1"
            },
            "answer_text": "It did get much bigger following in pre-Islam Middle East than in Europe. So the premise of this question is wrong. The true centers of ancient Christianity were the patriarchates: RomeConstantinopleAlexandriaAntiochJerusalemAlso, there was a catholicate of the East in Seleucia, and there was Armenian church, and so on. And other great centres of Christianity included Ephesos, Caesarea Mazaca, Nisibis, Carthago, the monasteries of Nitria, of Syria, of Cappadoce, and so on. So most of those centers were either outside Europe, or on the edges of it. Most of the lands in the Middle East were Christianised, which cannot really be said about Europe. It’s a problem of people assuming that current state lasted since the beginning of time. But from time to time some major changes happen… Christianity was Middle Eastern and Mediterranean religion. Not European one. Inside Rome, it was the inner European provinces that were last to get Christianised. It’s only the Muslim conquests and the subsequent gradual expansion of Christianity in Europe, and gradual decline in the Middle East, that changed that and made Christianity an “European” religion. ",
            "date": "Answered September 25, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elmy Khattab",
                    "user_href": "/profile/Elmy-Khattab-1"
                }
            ]
        }
    ]
}