{
    "title": "Why are you voting for Joe Biden? - Joe Biden🇺🇸 - Quora",
    "tags": [
        "Voting Methods",
        "Voting in the American Elections",
        "Joe Biden (politician)",
        "Voting",
        "Political Campaigns",
        "Democratic Party (US politics)",
        "US Presidential Elections",
        "Politicians and Government Leaders",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chad Kukahiko",
                "href": "/profile/Chad-Kukahiko-1"
            },
            "answer_text": "Joe Biden wasn’t my pick in the primary. He wasn’t my last choice - at least not until the field was whittled down to the last few - but as a lifelong independent, I’ve honestly never really had my pick. That said, I’ve been saying it for months and months: if they Dems nominate a genital wart, then I’ll be all about President Genital Wart, 2020. As an amateur historian my entire adult life, and an enormous fan of our founding fathers - especially the group I consider the original three, Ben Franklin, John Adams and Thomas Jefferson (in that order) - the more I learned about the founding of our country, the more impressed by it I’ve been. Despite the glaring oversight (to say the least) of slavery, the step our founding fathers took to take the entire world out of feudalism was monumental. And yet, what McConnell and the rest of the GOP has done to our country in just a few short years made it psychically and spiritually impossible for me to live another day in the United States. After years of trying, my wife and I finally made it to New Zealand on Christmas Day 2019 - barely escaping the sheer and utter incompetence of the Trump administration’s handling of the COVID nightmare. I’ve never been a fan of Trump, but my issue with him has always been his incompetence. Yeah, he’s petty and small and seems negligently indifferent to people who are not Donald Trump, but it’s his complete inability to get anything of substance done that I have issue with. But let’s be honest, normally the presidency doesn’t really have much lasting power. I mean sure they can get us into wars and waste trillions of dollars, but they can’t write law. What they’re essentially supposed to be is on the one hand a spiritual and emotional leader for the citizenry and on the other a national manager - a person to oversee the cabinet whose job it is to enforce the laws that the Article One branch passes and the Article Three branch (in essence) validates. A POTUS is supposed to be the person at the heart of the administrative storm who can multi-task like a mofo and ensure that all those laws and legal precedents are being enforced. Yeah, that’s why too much work for a single person, of course, so they’re supposed to hire the next level of super bad-ass administrative geniuses to in turn hire the next tier of administrative bad-asses, and that’s the Executive Branch - the branch of the government that’s just supposed to keep it all working. Of course the GOP calls all of these people “the Deep State,” so … Anyway, in light of all that, truly ask yourself - do you really want another four years of this? Trump would kill his own grandmother if it’d get him a few more minutes on the ole TeeVee, but do you honestly think he cares even the tiniest bit about whether HUD or the FCC or the IRS are doing anything, but help him and his rich trillionaire homies? Biden might not be the bee’s knees, but do you think he at least has the ability, the wherewithal and the inclination to hire the administrators we sorely need to put the US back together? ",
            "date": "May 3, 2020",
            "views": "805",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "MaryAnne Helton",
                    "user_href": "/profile/MaryAnne-Helton"
                },
                {
                    "user_id": "Kent Witte",
                    "user_href": "/profile/Kent-Witte"
                },
                {
                    "user_id": "Rodney Buenafe",
                    "user_href": "/profile/Rodney-Buenafe"
                },
                {
                    "user_id": "Christopher Anderson",
                    "user_href": "/profile/Christopher-Anderson-125"
                },
                {
                    "user_id": "Michelangelo Roseni",
                    "user_href": "/profile/Michelangelo-Roseni"
                },
                {
                    "user_id": "Monita Zhang",
                    "user_href": "/profile/Monita-Zhang"
                },
                {
                    "user_id": "Carla Cottingham",
                    "user_href": "/profile/Carla-Cottingham"
                },
                {
                    "user_id": "Mary Williams",
                    "user_href": "/profile/Mary-Williams-86"
                },
                {
                    "user_id": "Ingrid Scott",
                    "user_href": "/profile/Ingrid-Scott"
                },
                {
                    "user_id": "Steph Mantos",
                    "user_href": "/profile/Steph-Mantos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Rhodes",
                "href": "/profile/Tony-Rhodes-32"
            },
            "answer_text": "Because if what I think about dumb Donny dimwit. 22,000 + proven fact checked lies. To see them listed, go to http://Vhttps://www.washingtonpost.com/graphics/politics/trump-claims-database/ Avoided the draft during the Vietnam war multiple times by claiming imaginary bone spurs (per his doctors daughter) CONTINUOUSLY bypasses the CONSTITUTIONALLY MANDATED requirement of congressional oversight of the executive branch such as ignoring legal subpoenas, appointing TEMPORARY agency directors instead of permanent directors so that he can avoid congressional approval and more. Serial adulterer, cheated on every wife Serial whoremonger Self admitted sexual predator Accused serial rapist by multiple women Cheat (many MANY cheated out of money due to his multiple bankruptcies) Incompetent (refuses advice from military and intelligence chiefs stating his “guts” are more accurate) Racist, refuses to condemn racist attack Sexist, name calling, talking about women’s “bleeding” Islamaohobic Transphobic Nepotistic, even to the point of ignoring and overriding intelligence agencies who refused to issue his family members top secret security clearances. Homophobic Xenophobic Misogynistic Bigoted Hitleresque Fascist Clownish Clumsy Stupid Chauvinistic Rude Ignorant Hateful Insensitive Brash Dangerous Incompetent Arrogant Egotistical Narcissist (WITHOUT A DOUBT!!!) Sociopath Coward (lied as stated by daughter of the doctor) to get out of service in Vietnam Obnoxious Fraud Disgusting Unamerican Constitution hating Greedy Annoying Power hungry Perverted (no doubt about this one either) Mean Did I mention HES A FUCKING LIAR???? ",
            "date": "October 29, 2020",
            "views": "104",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "MaryAnne Helton",
                    "user_href": "/profile/MaryAnne-Helton"
                },
                {
                    "user_id": "Steven Salamon",
                    "user_href": "/profile/Steven-Salamon"
                },
                {
                    "user_id": "Eugene M Steinfeld",
                    "user_href": "/profile/Eugene-M-Steinfeld"
                },
                {
                    "user_id": "Donna Scott",
                    "user_href": "/profile/Donna-Scott-26"
                },
                {
                    "user_id": "Michael Gilliam",
                    "user_href": "/profile/Michael-Gilliam-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mel Kimsey",
                "href": "/profile/Mel-Kimsey"
            },
            "answer_text": "I know most democrats will have mixed emotions about my answer, but I am a conservative Republican, and I see Biden as the only path to get our party back. I and thousands of other republicans and independents will be pulling for Biden in every way. Four years—or even 8 years of democrats is worth it to dump trump and regain our party. Trump is no more a Republican than Putin is. Biden will never damage this country as much as trump has done in the past 3+ years. trump is a buffoon, a poser, a—you’ve heard it all before. This administration has been like a reality show up to this point—entertaining until it started costing lives. With this pandemic his incompetence is in full display. Biden may have plenty of faults and even done things wrong, but he’s not unaware of himself like trump And he tends to surround himself with good people, not sycophant ideologues as trump does. You will see a national paradigm shift; and I don’t use that phrase loosely. He will be on TV a tenth as much as trump because there won’t be videos of other countries’ leaders laughing at him, there won’t be an administration firing every week, there won’t be embarrassing comments made about our allies at the same time he’s bragging about phone calls to dictators… My god, really, when you think about it…Biden’s tenure can’t come soon enough. ",
            "date": "April 11, 2020",
            "views": "366",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kent Witte",
                    "user_href": "/profile/Kent-Witte"
                },
                {
                    "user_id": "Rodney Buenafe",
                    "user_href": "/profile/Rodney-Buenafe"
                },
                {
                    "user_id": "Marsha Cope Huie",
                    "user_href": "/profile/Marsha-Cope-Huie"
                },
                {
                    "user_id": "Christopher Ogle",
                    "user_href": "/profile/Christopher-Ogle-1"
                },
                {
                    "user_id": "Nathaniel Kisslinger",
                    "user_href": "/profile/Nathaniel-Kisslinger"
                },
                {
                    "user_id": "Marie Lucas",
                    "user_href": "/profile/Marie-Lucas-33"
                },
                {
                    "user_id": "Janice Prichard",
                    "user_href": "/profile/Janice-Prichard"
                },
                {
                    "user_id": "Ken Gray",
                    "user_href": "/profile/Ken-Gray-78"
                },
                {
                    "user_id": "Jo Karel",
                    "user_href": "/profile/Jo-Karel"
                },
                {
                    "user_id": "Deb Danielson",
                    "user_href": "/profile/Deb-Danielson-2"
                }
            ]
        }
    ]
}