{
    "title": "Why are communist leaders considered dictators? - Quora",
    "tags": [
        "Communist Leaders",
        "Dictators",
        "Dictatorships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Roberts",
                "href": "/profile/Ted-Roberts-26"
            },
            "answer_text": "Because most of the communist leaders we consider dictators were in fact dictators. Now, let’s first get the definition of a dictator. Dictionary.com defines a dictator as “a person exercising absolute power, especially a ruler who has absolute, unrestricted control in a government without hereditary succession”. Merriam-Webster defines a dictator “as one holding complete autocratic control; a person with unlimited governmental power”. So we are looking for autocrats and, to use a more specific if a bit more obscure term, monocrats. People who ruled on their own. Now, obviously no man can rule alone - but someone exercising total control over an entire system and running any other needed government position using his personal puppets and protegés can thus relatively safely be considered a dictator. — With that out of the way, we can look at a few specific examples of countries that are generally accepted as being or having been “communist”. The Soviet Union So we first have to look at the mother of all communist states, the Union of Soviet Socialist Republics, now defunct. The leaders of the Soviet Union, in order, were Vladimir Lenin, Joseph Stalin, Georgy Malenkov, Nikita Khrushchev, Leonid Brezhnev, Yuri Andropov, Konstantin Chernenko and Mikhail Gorbachev. At the very end, you might also include the Vice President Gennady Yanayev, who tried to coup against Gorbachev and revert his reforms. Out of all of these, Joseph Stalin is the one who is definitely considered a dictator by the majority of contemporary historical scientists, and some historians will also include Vladimir Lenin and maybe Leonid Brezhnev. Stalin’s claim to dictatorship is mainly his talent in gaming the system. Stalin, a relatively unknown local bureaucrat and local fighter during the Soviet revolution and the early Soviet era, found the ideal government position within the USSR’s chain of command to establish his personal utopia: The General-Secretary of the CPSU. Now, you might be confused how a position within the Soviet Union’s governing party, not even a government post in the council of ministers, would be able to be the bedrock of a dictatorship. Well, the General-Secretary is the main man in assigning, re-assigning and dismissing individuals in the other positions within the party. Now, if that sounds like a guy who loves to fill offices with his buddies, that is exactly what Stalin started to do - he built a faction within the communist party around himself. His toolbox included the likes of Vyacheslav Molotov and Vladimir Kalinin, both of whom filled actual government posts even during the time where Stalin chose to stay in the background. It was only in 1941 that Stalin actually took on the title of Prime Minister of Russia as well as Minister of Defense of the USSR - until then he didn’t hold an actual government post, yet he was the main man overseeing the negotiation of treaties, the man talked to by all the ambassadors. The man who single-handedly set government doctrine, superseding the Trotzkyists in the foreign policy debate and then having most of them murdered during the Great Purge. He replaced Lenin’s economic ideas with his own centralization plans. And he built a personality cult around himself that has rarely been seen in world history. Something that sounds a little odd for a position like Secretary-General of a political party. Normally, you imagine people like this to be silent desk clerks out of the public’s sight, not someone who has his 70th birthday celebrated by a foreign country (China, in this case) with thousands of portraits of himself overseeing a jubilant crowd. China While there currently seems to be a real effort by the current Chinese strongman Xi Jinping to become the most powerful man in his country’s recent history, it is doubtful whether he will be able to stand up to Mao Zedong. Zedong took power in the People’s Republic of China - his personal creation - after the communist victory in the Chinese Civil War in the year 1949. Although initially popular, his reign would quickly grow to include insanities like his personal idea of economic revolution: Trying to get uneducated farmers to put up steel furnaces in their backyards to grow production numbers. His true dictatorial ambitions however show themselves most clearly in the number of his victims. I usually don’t like to play the “genocide lottery”, as I like to call it, where one tries to quantify the level of badness between various totalitarian regimes by the number of dead people they have to answer for, but which Mao Zedong, you have the numerically largest genocide in human history on your hands: the “Great Leap Forward”. This 1958 through 1961 rejuvenation campaign to supposedly catch up to more advanced industrial states, which managed to kill 45 million Chinese civilians, was around the time of the Sino-Soviet split, when the Soviet government around Khruschev started to disavow the Stalinist cult after Stalin’s death in 1953. Fearing the results of such an act, Mao Zedong rebranded his governmental style as Mao Zedong Thought, or, as we call it in the west, “Maoism”. Naming your ideology after yourself already shows a certain humility, doesn’t it? Well, anyway. Mao Zedong really liked how Stalin used to do things: Purge your enemies, invade neutral countries, kill anyone who disagrees with or poses a threat to you, get a cult of personality and lots of (very) young women while you’re at it. Khruschev’s meddling in this picture really made Mao despise the new Hippies - that is to say not quite as totalitarian totalitarians - in the Soviet government. — If you wish, I could also elaborate on Pol Pot of Cambodia, the Kim family in North Korea, Ho Chi Minh of Vietnam and Fidel Castro of Cuba and why these respective leaders are considered dictatorial at least at several points in their individual history. And, just to show that in fact not all communist or radical socialist leaders are considered dictators, a few examples of communist non-dictatoral leaders might include Deng Xiaoping of China, Nikita Khruschev and Mikhail Gorbachev of the Soviet Union, Salvador Allende of Chile, Bounnhang Vorachith of Laos and others. ",
            "date": "Answered March 4, 2018",
            "views": "553",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nitin Nair",
                    "user_href": "/profile/Nitin-Nair-115"
                },
                {
                    "user_id": "Tom Anderson",
                    "user_href": "/profile/Tom-Anderson-68"
                },
                {
                    "user_id": "Katr W",
                    "user_href": "/profile/Katr-W"
                },
                {
                    "user_id": "Sofie Ostroverkhova",
                    "user_href": "/profile/Sofie-Ostroverkhova"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " Communism has always required force, terror and intimidation to operate. The Bolsheviks started a police state when Lenin was alive, they arrested and shot many, they were not too concerned with the exact facts …. and they did this continually until Stalin died in 1953 … and did it in reduced fashion thereafter. People like to own things, and they work harder and smarter for themselves than they do others or the state. Individual initiative is stifled by communism, whether you call it communism or socialism. Nearly all the communist leaders have been dictators … and the leader of China just declared his own one-man rule. Dictatorship is not restricted to communists; National Socialism was pretty bad, too. ",
            "date": "Updated August 4, 2018",
            "views": "525",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Zaddack",
                    "user_href": "/profile/Chris-Zaddack"
                },
                {
                    "user_id": "Adrian McDonald",
                    "user_href": "/profile/Adrian-McDonald-1"
                },
                {
                    "user_id": "Katr W",
                    "user_href": "/profile/Katr-W"
                },
                {
                    "user_id": "Mark White",
                    "user_href": "/profile/Mark-White-163"
                },
                {
                    "user_id": "Lidia Fedorska",
                    "user_href": "/profile/Lidia-Fedorska"
                },
                {
                    "user_id": "Kevin Fox",
                    "user_href": "/profile/Kevin-Fox-74"
                },
                {
                    "user_id": "Horacio Camba",
                    "user_href": "/profile/Horacio-Camba"
                },
                {
                    "user_id": "Felipe Nachamkes",
                    "user_href": "/profile/Felipe-Nachamkes-1"
                },
                {
                    "user_id": "Stephen Bridges",
                    "user_href": "/profile/Stephen-Bridges-6"
                },
                {
                    "user_id": "James Yi",
                    "user_href": "/profile/James-Yi-25"
                }
            ]
        }
    ]
}