{
    "title": "Why does Israel support Azerbaijan in the Nagorno-Karabakh conflict? - Quora",
    "tags": [
        "Culture of Azerbaijan",
        "Azerbaijan (country)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sable de Oliveira",
                "href": "/profile/Sable-de-Oliveira"
            },
            "answer_text": "The key reasons for Israel’s support of Azerbaijan in the Nagorno-Karabakh conflict are more of a consequence of their strong strategic alliance, as opposed to Israel having any direct stake or interest in the conflict or disputed region(s) themselves. It’s not that Israel have anything in particular against Armenia (and indeed they still officially maintain diplomatic relations), but the Azerbajani partnership is by far more valuable to nurture and grow. Most, but not all, of these reasons have already been touched upon in other answers. I shall try to avoid duplication: Major arms & security contracts: Azerbaijan is Israel’s third largest trade partner for annual weapons exports to the tune of hundreds of millions of dollars. Purchasing arms from Israel (and of course Turkey) allows Azerbaijan to further diversify its weaponry and combat systems capability, since Russia supplies both Armenia and Azerbaijan. This capability includes unmanned systems technology and advanced radar.Stance on Iran: Azerbaijan serves as a strategic ally for Israel due to its geographic location, as it borders Israel’s most significant adversary, Iran. Azerbaijan have always been skeptical of Iran and any aspirations it may have that the two could unite in some sort of Persian Islamic brotherhood. Iran’s siding with Armenia has alienated Azerbaijan even further, but any confrontation could spark conflict and present a major problem for the significant Azerbaijani population living over the Iranian border. However, this alliance opens up possibilities for Israel to leverage the geographic proximity of Azerbaijan and Iran, should they desire.Trade & energy partnerships: It’s not all one-way in terms of trade in the form of Israeli exports, as Azerbaijan are still their primary supplier of oil. Sourcing a reliable (and cost-effective) supplier for oil/gas has never been easy for Israel. The Iranians cut off their TIPline supply in 1979, the Egyptian supply has dwindled, and there are other challenges in getting buy-in from their neighbours in order to use other existing pipelines. Caspian oil continuity is therefore critical to Israel’s energy sustainability in the near future.Perceptual analogy: Whilst Israel have no direct interest in the Nagorno-Karabakh conflict/contested regions, it is interesting to observe the rhetoric among a number of Israeli politicians. Clearly, some see an analogy with their own recent history and find an injustice by the fact that the UN urged them to withdraw from and hand over occupied territory (stating that they have complied), whilst there is no such international pressure for Armenia to do the same. This is what appears to have provoked some of the more emotive statements from Israel on the matter.",
            "date": "Answered December 30, 2018",
            "views": "15",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Lesperance",
                    "user_href": "/profile/David-Lesperance-6"
                },
                {
                    "user_id": "Chris Hudi",
                    "user_href": "/profile/Chris-Hudi-1"
                },
                {
                    "user_id": "Nargiz Zeynalova",
                    "user_href": "/profile/Nargiz-Zeynalova"
                },
                {
                    "user_id": "Elshan Azeri",
                    "user_href": "/profile/Elshan-Azeri-1"
                },
                {
                    "user_id": "Kamran Huseynzade",
                    "user_href": "/profile/Kamran-Huseynzade-1"
                },
                {
                    "user_id": "Ahmad El-Sheikh",
                    "user_href": "/profile/Ahmad-El-Sheikh-3"
                },
                {
                    "user_id": "Kami Qaza",
                    "user_href": "/profile/Kami-Qaza"
                },
                {
                    "user_id": "Amal Kinani",
                    "user_href": "/profile/Amal-Kinani"
                },
                {
                    "user_id": "Joakim Laksman",
                    "user_href": "/profile/Joakim-Laksman"
                },
                {
                    "user_id": "Georges Kabi",
                    "user_href": "/profile/Georges-Kabi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Kueffer",
                "href": "/profile/Laurence-Kueffer"
            },
            "answer_text": "In fact, Israel has a long established alliance with Azerbaijan, which has been a source of grief to both Armenia, and its Karabakh Stronghold. Most of Israel’s support for Azerbaijan is in the commodity of weapons sales. Israel has also provided military personnel for the training of some portions of Azerbaijan’s military. And, Israel has hinted that it would like to use Azerbaijan’s Airbases for their aircraft, especially as bases of aggression against Iran. There are two primary reasons: (1) In the first place, a big percentage of Israel’s petro-oil is imported from Azerbaijan (by way of the Baku/Tbilisi/Ceyhan Oil Pipeline). In 2015, it was determined that 40% of Israel’s petro-oil is imported from Azerbaijan. Perhaps, Israel’s reliance upon Kurdish petro-oil has gradually increased, despite this, Israel continues to import a huge percentage of its oil from Azerbaijan. Azerbaijan has used petro-oil to finance armament purchases, from Israel, and other countries too. (2) In the second place, Israel’s longstanding political alliance with Turkey has been a powerful influence, because Baku, Azerbaijan’s foremost political and military ally is Turkey, an alliance based upon an implication of Pan-Turkic Brotherhood. Aside from the trilateral political and military alliance, the three countries (Turkey, Azerbaijan, and Israel) have also banded together in the information war against Armenia, the kind of war that involves foreign lobbies, internet warfare, diplomatic alliances, and general propaganda. While Israel’s cooperation with Azerbaijan dates back to the Karabakh War (1988 - 1994), their cooperation with Turkey goes back much further — decades earlier than the Karabakh War. These matters of import/export finance, diplomacy, and information war propaganda, all contributed immensely to Israel’s drift into the war camp of Azerbaijan. ",
            "date": "Updated May 24, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maitena Tigranyan",
                    "user_href": "/profile/Maitena-Tigranyan"
                },
                {
                    "user_id": "Anna Karenian",
                    "user_href": "/profile/Anna-Karenian"
                },
                {
                    "user_id": "Parthena Tigranyan",
                    "user_href": "/profile/Parthena-Tigranyan"
                },
                {
                    "user_id": "Levon Gevorgyan",
                    "user_href": "/profile/Levon-Gevorgyan-2"
                }
            ]
        }
    ]
}