{
    "title": "Why has Sweden not adopted the euro as its currency? - Quora",
    "tags": [
        "Euro (currency)",
        "Sweden"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesper Hansen",
                "href": "/profile/Jesper-Hansen-22"
            },
            "answer_text": "Only Denmark and the soon to be former EU member UK (maybe?) has a negotiated option not to join the EURO. Sweden joined the EU at a later time, where the acceptance of one day using the EURO as its currency was an integrated part of the requirements. Sweden is obligated to join as soon as they meet the criteria for it. Euro convergence criteria - Wikipedia  The people of Sweden however did not like this, and just like in Denmark the people had to be asked in a referendum. The Swedish people rejected the EURO by a higher percentage of voters in 2003, than Denmark did in 2000. That left the Swedish parliament with a big problem. They had agreed to voluntarily switch to the EURO, but they could not do this. because its national laws had placed such a decision with the voting majority of the Swedish citizens. So Sweden found a loophole. Sweden and the euro - Wikipedia The EURO Convergence criteria means that a country has to live up to a number of requirements, that indicates the nations economy and political management is stable and strong enough, to not become a drain on other EURO country members (Greece?). Sweden has not joined the ERM II (European Exchange Rate Mechanism), Which means Denmark who has no plans to adopt the EURO is the only country in the ERM II. European Exchange Rate Mechanism - Wikipedia It is not Just Sweden, but 6 other countries as well who has said yes to both the EU and EURO, but just happens to continually refuse the ERM II membership. So Sweden stays out of the EURO currency commitment by a technicality, where as Denmark can join anytime they want since they have not deviated from the economic or political criteria for membership since 1. January 1999 (The Euro introduction). At a time the EURO support was increasing in Sweden and a possible yes was a getting realistic. Then in 2008 the economic crisis saw the growing YES turn into a resounding NO. According to the SOM Institute, University of Gothenburg, Sweden just 9% of the Swedes supported the EURO in 2013. Even if those numbers were slightly exaggerated, there really was no point in asking the People of Sweden for another referendum. The reasons for the EURO skepticism is perhaps based on the failure of the Scandinavian Monetary Union, which proved to Norway, Sweden and Denmark that a currency union without a fiscal union is highly problematic. Denmark and Norway were the PIIGS of the Scandinavian Currency Union . The 2008 economic crisis saw Sweden performing a lot better than its Euro bounded neighbor Finland and also better than Denmark with its EURO PEG. The Swedish currency suits the Swedish economy, and since it only had Sweden to accommodate it bounced back quickly from the 2008 crisis. This reminded the Swedes that your own currency is a lot more than just printing money with portraits of famous Swedes Swedish krona - Wikipedia  ",
            "date": "Updated August 27, 2018",
            "views": "46",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcus Gustafsson",
                    "user_href": "/profile/Marcus-Gustafsson-14"
                },
                {
                    "user_id": "Marcus Sucram",
                    "user_href": "/profile/Marcus-Sucram-1"
                },
                {
                    "user_id": "Michael Johnsson",
                    "user_href": "/profile/Michael-Johnsson-2"
                },
                {
                    "user_id": "Linus Strand",
                    "user_href": "/profile/Linus-Strand"
                },
                {
                    "user_id": "Bror Hellman",
                    "user_href": "/profile/Bror-Hellman"
                },
                {
                    "user_id": "Marko Plazanic",
                    "user_href": "/profile/Marko-Plazanic-1"
                },
                {
                    "user_id": "Megan Jackson",
                    "user_href": "/profile/Megan-Jackson-194"
                },
                {
                    "user_id": "Klas Färd",
                    "user_href": "/profile/Klas-Färd"
                },
                {
                    "user_id": "Jonas Hellberg Hellberg",
                    "user_href": "/profile/Jonas-Hellberg-Hellberg"
                },
                {
                    "user_id": "Magnus Lyckå",
                    "user_href": "/profile/Magnus-Lyckå-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Klas Färd",
                "href": "/profile/Klas-Färd"
            },
            "answer_text": "The obvious answers, as some others has pointed out, is that the Swedish people did not want the Euro, and we have found a loop hole to avoid it (for now). But on of the underlying reasons is that our economy was, at the time, and still isn’t, in sync with the major Euro economies. I.e. we do not have the up’s and downs at the same time. Also: We are doing some things differently, and we are a very small county, relying heavily on exports, so we would have to adopt to the “Euro way”, instead of the other way around. Having said that, Finland did join the Euro. And they have similar systems as we have. So it could have been done. But there would probably be a decade of hardship, which we are not prepared to have… ",
            "date": "Answered October 16, 2020",
            "views": "107",
            "upvotes": "0"
        }
    ]
}