{
    "title": "Why is CSK losing matches back to back in the IPL 2020? - Quora",
    "tags": [
        "2020 Indian Premier League",
        "Chennai Super Kings (IPL franchise)",
        "Indian Premier League (IPL)",
        "Cricket in India",
        "2020 (year)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sunoj Suresh",
                "href": "/profile/Sunoj-Suresh"
            },
            "answer_text": "All the answers rightly pointed out the fact that CSK's team selection really is pathetic this time around. I cannot even imagine why Piyush Chawla is in the team, with full respect to him as a player, he is well past his prime. Taking into consideration that all the aged warhorses in the team are well past their prime, they need to understand the situation and play accordingly. I really think these according to me are some worthy reasons why CSK has lost 2 back to back matches. Meaningless batting at the top of the order : In the second game against Rajasthan Royals where CSK needed almost 217 runs to win in 120 balls, Murali Vijay played a wonderful, exquisite and amazing run a ball knock of 21. Well what an innings LOL… Shane Watson chipped in with 33 of 21 if i am correct. Well this is the biggest problem. While chasing a mammoth score like 200+ chewing up balls at the top of the order doesn't help. Today was no different( the second game vs Delhi Capitals) The amazing Murali Vijay once again proved that he is a genius by scoring 10 runs off 15 balls and Shane Watson too was not far behind scoring 14 off 16 balls. Now thats a start given by both the openers when the team needed them to blast off from the word go. I know its not easy and no one plays that slow an inning on purpose, but if you aren't able to time the ball and score freely, get out and go, let others who can give it a try. Now I have nothing against Murali Vijay, he was really a wonderful and swashbuckling cricketer 5–6 years back, not now. He is just milking the balls for ones and twos and not even making an effort to accelerate. He should be dropped for sure. Team management needs to talk about the batting at the top of the order. Its plain and simple, while chasing a big total a good opening partnership is something which lays the foundation, if not you are doomed, no matter even if you have Dhoni or Faf in the Team. \" I literally don't understand getting singles and doubles when you need 15 and 16 an over\". Except CSK all the teams have good top order, like Rohit Sharma for Mumbai, Aaron Finch for RCB, Shikhar Dhawan and Prithvi Shaw for Delhi, KL Rahul for Punjab, Sanju Samson for Rajasthan, David Warner and Jonny Bairstow for Hyderabad. You need to have a strong top order to win matches.Waste Middle order: The middle order consists of Rituraj Gaikwad, Kedar Jadhav, Sam Curran, Jadeja and Dhoni if he feels like batting ( normally he is more interested in watching the match than batting). All this middle order was doing in both the matches was trying to rotate the strike and look for the loose ball to hit a four or a six if at all it comes your way. Seriously ? This is the way you play T20 cricket? If you play T20 cricket like an ODI or a Test match, its not rocket science that you will end up on the losing side. In the first game Faf brought them closer to the imposing total and I suppose only Faf has taken his job seriously, rest all are God knows what they are upto.Dhoni thinking he is the same Superman finisher even now: Dhoni is coming to bat lower down the order at no. 7 and when asked is giving lame excuses, saying he is testing out his players, if so sir you have lost 2 matches in the process of testing, and in a Tournament like the IPL 5–6 back to back loses while help you in not making the playoffs. Dhoni is trying to do the impossible by taking the game to the wire and snatching victory from the jaws of defeat, thats really was possible during your prime not now when you have retired. Even if Dhoni fires on all cylinders he needs support at the other end which he isn't getting. Like in the first game he came at no. 7 when the game was almost over and struck 4 consecutive sixes showing the world that he still has that in him to make the impossible possible. Instead of trying to be a hero if he had come at no. 5 and steadied the ship when the team needed, CSK would have easily won. Today too came at no. 7 and tried really hard to no avail, in the end lost the game by 44 runs, well thats a huge margin in T20s. I am a huge Dhoni fan and really love his batting, his leadership skills, presence of mind, his cricketing acumen everything, but here he is really calling all shots wrong. Had Dhoni batted up the order CSK would have won both the matches. These are some reasons I feel because of which CSK is losing. I am an ardent CSK fan, even though RCB is my favourite team. I was really miffed by the way CSK played, so thought of writing this answer. Sorry was a long one. Thanks for reading.",
            "date": "Answered September 25, 2020",
            "views": "51",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivendra Sharma",
                    "user_href": "/profile/Shivendra-Sharma-86"
                },
                {
                    "user_id": "Dhruv Bangde",
                    "user_href": "/profile/Dhruv-Bangde"
                },
                {
                    "user_id": "Thavaguru S",
                    "user_href": "/profile/தவகுரு-சே-Thavaguru-S"
                },
                {
                    "user_id": "Sharon Paul",
                    "user_href": "/profile/Sharon-Paul-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MARK-WRONG"
                },
                {
                    "user_id": "Anmol Srivastava",
                    "user_href": "/profile/Anmol-Srivastava-93"
                },
                {
                    "user_id": "Naman Khandelwal",
                    "user_href": "/profile/Naman-Khandelwal-59"
                },
                {
                    "user_id": "Shriram",
                    "user_href": "/profile/Shriram-33"
                },
                {
                    "user_id": "Shreyas Kamat",
                    "user_href": "/profile/Shreyas-Kamat-13"
                },
                {
                    "user_id": "Binoy Pillai",
                    "user_href": "/profile/Binoy-Pillai-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayan Raza",
                "href": "/profile/Ayan-Raza-8"
            },
            "answer_text": "People were blaming Kedar Jadhav and Murali Vijay for the consecutive loses. And I was one of them. But now I have a different opinion. ( I am writing this answer after CSK vs RCB match which CSK lost by 37 runs.)  Talking about the bowling first. CSK do not have a good bowling attack. They do not have a bowler who can haunt the opposition with his sheer pace in the playing XI.If IPL was played in India then their spin attack would have been the most effective among all the eight teams as half of their matches would have been played in Chennai. CSK likes to control the match in the middle overs with their spin attack. But it's simply not working in UAE. We do not have Bhajji this year and Tahir, the purple cap holder of previous season is unable to find a place in the playing XI. We are missing them a lot. Their pacers either give too many runs in the powerplay or in the death overs. But they need to control the things in both phases, knowing the fact they do not have that much strong bowling line up like MI or other teams. They are an average fielding side which are trying hard to improve but have limitations. They often leak runs. They take good catches and drop catches as well.But I have a feeling that we cannot expect too much from this bowling line up. Bowlers like Deepak Chahar, Shardul Thakur, Karn Sharma are trying their best with their capabilities.Now, coming to the batting. It is not hidden from the world how bad their batting is performing.They are relying too much on Watson and Faf. If one of them gets out early then, in some way or other, they start playing slow. They are scoring very less in the powerplay except a few matches. When you are chasing a target like 180 or 200, you cannot start that much slow.Even if you started slow, then someone from the middle order should take responsibility. One should anchor the innings and the other should take risks and accelerate like most of the teams do. I mean this is a basic thing of a T20 game. You cannot leave too much for the end.For example, the game against RCB. Both Rayudu and Jagdeeshan were playing with the same approach. For what were they waiting? And this is not only about that game. They are playing in the same manner in all the matches. They do not accelerate at the right time and leave so much for the end. Whether it's Rayudu, Dhoni or Jadhav. You may say that this is their style of chasing. Take the game to the deep and firepower in the end. But this is simply not working this year. Dhoni is not the same that he used to be previously. I am his fan and most of you may be. But this is a fact. You may say that he is out of form or he is hitting well in the nets and unable to copy that in the match or something else. If he is not performing well then it simply means he is not performing well. As simple as that. So you cannot leave too much for the end and expect him to finish like he used to do earlier. Any player who is playing in between 6–14 overs whether its Rayudu, Faf, Watson, Jagdeeshan or Dhoni himself, one of the two need to take the responsibility and accelerate. And they are unable to do so in this tournament so far, which is the primary reason for consecutive loses.We are missing Raina a lot. He was the one who used to control that phase. I don’t know what’s going on between him and CSK. But even if he returns, it’s too late. They have batting till number 11 (Karn Sharma). Any of them can hit a few in the end when less runs are required. Why don’t they take risks when there is a need? I am unable to understand. But I think it’s too late to talk about this.CSK have aged players in their team. You may say that they are great in their respective roles. But the fact is that they are past their prime. It may have worked in the previous two seasons. They may have found ways of winning. But you can’t win every time with so many loop holes. We, fans, also know all these things even though we try to hide and support our team. CSK team management, captain, coach and all the other people related to this are responsible for that. I am not saying all these things because they have started loosing today. This has to happen at some point or other. What’s next for CSK? They have 7 matches left. They need to win atleast 6 of them to qualify for playoffs which seems to be possible but is practically impossible after comparing their and other team’s form. Only a miracle can help them to qualify for playoffs. But they will try hard to get atleast close to top 4.CSK team management should start thinking their auction strategy for the next season. Which player they are going to release or what is their real core. Who are the individuals who are performing well consistently. And should select a team which can win at any venue.What fans can do? Support them in their difficult time. You can criticise them but don’t involve their families. And hope for the best for the next seasons.This is a perfect time for all the fans and the haters. Fans can stand by them. Haters can troll them. Blind fans can deny all the facts and blind haters too. Some fans can turn into haters as well.I am unable to express how am I feeling. CSKians do not have the experience of getting out of contest this early or not getting qualified for playoffs which other teams have. But this too shall pass by. Hope for the best and move on with a smile :).  Thanks for reading. Have a nice day. ",
            "date": "Answered October 11, 2020",
            "views": "326",
            "upvotes": " View 830 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dharun Aditya Senthilkumar",
                    "user_href": "/profile/Dharun-Aditya-Senthilkumar"
                },
                {
                    "user_id": "Rajan Vaghela",
                    "user_href": "/profile/Rajan-Vaghela-5"
                },
                {
                    "user_id": "Dhruv Bangde",
                    "user_href": "/profile/Dhruv-Bangde"
                },
                {
                    "user_id": "Thavaguru S",
                    "user_href": "/profile/தவகுரு-சே-Thavaguru-S"
                },
                {
                    "user_id": "Vishnu Unni",
                    "user_href": "/profile/Vishnu-Unni-65"
                },
                {
                    "user_id": "Sharon Paul",
                    "user_href": "/profile/Sharon-Paul-9"
                },
                {
                    "user_id": "Nanda Kishore",
                    "user_href": "/profile/Nanda-Kishore-194"
                },
                {
                    "user_id": "Isha Singh",
                    "user_href": "/profile/Isha-Singh-928"
                },
                {
                    "user_id": "ALEX Rajan",
                    "user_href": "/profile/ALEX-Rajan-25"
                },
                {
                    "user_id": "Anmol Srivastava",
                    "user_href": "/profile/Anmol-Srivastava-93"
                }
            ]
        }
    ]
}