{
    "title": "Why isn't Earl Spencer the earl 'of' anywhere? Most English aristocrats have a place name attached to their title (Earl of Shrewsbury, Earl of Derby, etc.) but why not Earl Spencer? - Quora",
    "tags": [
        "Earls",
        "Noble Titles",
        "Peerage",
        "Aristocrats",
        "Nobility",
        "The Upper Class",
        "History of Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Spencer",
                "href": "/profile/Chris-Spencer-120"
            },
            "answer_text": "Historically, the lowest rank of peers, the barons, hardly ever had a title with a place name: their titles reflected the family name. A few take the form Baron X of Y, and a few of the very oldest have the form Baron de X (which generally predates the use of family names). The senior peers, the Dukes, have always used a place name as a title. The oldest earldoms also used place names, but from the 18th century some started to use family names, sometimes with the addition of a place name in the form Earl X of Y. Earl Spencer was actually the fourth to take that form - and it became more common in the 19th and 20th centuries. Those elevated to the peerage, or promoted within it, have usually been given some say in which titles they took, and it probably reflects an increasing pride in a historic family name. ",
            "date": "Answered October 18, 2020",
            "views": "138",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christopher Spencer",
                    "user_href": "/profile/Christopher-Spencer-127"
                },
                {
                    "user_id": "Chris Hawkes",
                    "user_href": "/profile/Chris-Hawkes-11"
                },
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carolyn King",
                "href": "/profile/Carolyn-King-118"
            },
            "answer_text": "Earldoms with the family name attached don’t get the “of.” For instance, Earl Grosvenor (a subsidiary title of the Duke of Westminster), doesn’t get the “of” because the family name is Westminster. Similarly, the former Prime Minister Clement Attlee was made Earl Attlee, not Earl of Attlee. “Most” aristocrats actually don’t have a place name attached to their title. Only dukes, marquesses, and some earls get “of” in their titles. The rest of the earls and all the viscounts and barons don’t get “of” at all, and they’re much more numerous.[1] Footnotes[1] Peerage Basics",
            "date": "Answered October 17, 2020",
            "views": "116",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Hawkes",
                    "user_href": "/profile/Chris-Hawkes-11"
                },
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                }
            ]
        }
    ]
}