{
    "title": "Why did Hindus accept the Mughal rule while they were in majority? - Quora",
    "tags": [
        "Mughal Empire (1526–1857)",
        "Hindus",
        "Historical India",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Baba Vickram Aditya Bedi",
                "href": "/profile/Baba-Vickram-Aditya-Bedi"
            },
            "answer_text": " Emperor Babur The Mughal Dynasty was far better than what it replaced after the battle of Panipat, in 1526. The victory at the Battle of Panipat, would end the age of Islamic Invasion in India. For, many this fact remains unknown, as they view the Mughal Sultanate as merely another form of Islamic Invasion. The fact is that the form of Islam that the Mughal Dynasty would practice during it’s reign would range from Shiaism, Suni beliefs and during the range of Emperor Akbar a complete departure and the implementation of Secular Tolerance. This does not mean, that the Mughal Dynasty was accepted by all people of the Indian Subcontinent, as Mohammad Babur started his rule in a rather cruel way. However even with all his faults, Babur was not like the Muslim rulers who came before him. In fact after imprisoning Baba Nanak and other voices which were vocal of his rule, Babur became perplexed with the nature of his own Empire. He would release Baba Nanak and then hold a meeting with him. Though there are those who claim that this meeting never happened, there simply is too much evidence that it did. And, then of course there is the undeniable change in Babur’s behavior during the later part of his rule. Babur would embrace, the basis of what Baba Nanak told him. It is said that Baba Nanak told him that if the Mughal Sultanate adopted the rule of tolerance and justice, than it would rule for 1000 years, but if intolerance became the basis of it’s rule than it would survive for no more than seven generations, in great form. Babur became a tolerant ruler. By the time of his death Babur would tell his son Hamayun, to treat Hindus fairly and to ban the slaughter of the cow. This transformation of Babur from an invader and person who thoroughly disliked all things Indian, to a promoter of tolerance was not something which happened during the prior period of Islamic Invasion, which predated the establishment of the Mughal Empire.  Baba Nanak and Emperor Babur As time progressed, the Mughal Empire weakened under the rule Humayun. An invasion by Sher Shah Suri came, and when Akbar was born, the Mughal Empire centered around Punjab. It seemed that it would be extinguished. Akbar was only 12 when he came to it’s throne. Through a series of military victories, Akbar’s regents managed to expand the small Empire. As Akbar became an adult, he began to have an interest in philosophy, religion and deep seated desire to bring people together in India. Though once more, there are historians in India today who wish to take away from Akbar’s genuine intent and state this was a political ploy to engage Hindus as it was a necessity for rule. The evidence in this case is too overwhelming to be ignored, as the written records support our traditional historic view of Akbar as a dynamic and enlightened individual and ruler. In fact as the Mughal Sultanate grew, Emperor Akbar became more concerned for average people in his Empire. He would go in disguise at night to see what issues affected his subjects. He would learn how forced conversions had occurred to Islam, that the system of taxation was unfair, and he would become exposed to the Bakhti Movement founded by Baba Nanak and Sant Kabir. Emperor Akbar would build the Ibadat Khana, and in this house of debate, he would allow complete freedom of speech. Emperor Akbar would ask members of different religious communities to speak about the merits of their faith. At night before he would sleep a Brahman priest would recite the Indian Epics so that he could understand them. It would be the Brahman who would pull the curtain of Emperor Akbar’s bedroom, this symbolic act signified that the Emperor now slept.  Emperor Akbar  Golden Temple, Amritsar, Punjab, India The land for the building of the Golden Temple was granted by Emperor Akbar, and he would give land grants to the families of Indian thinkers, philosophers, and descendants of religious teachers. Finally, Emperor Akbar, decided that all this was not enough for he needed to change how people were treated. In 1580, the Navratan court came up with the concept of taxation based upon land conditions and yields. The state would support agriculture and all new land brought into the system would be tax exempt. Additionally, when climatic conditions were not favorable no taxation would occur. On a social front, all Hindus who had been force converted in previous times could choose any religion they wished. The Jazya tax was abolished. All subjects were to be treated equally. This included civil and criminal cases. Here, ultimate appeals were to be reviewed by the Emperor. And, during the later part of Emperor Akbar’s rule, mercy was far more judicially handed out than in any period since the age of Emperor Ashoka. The Indian state itself became secular. In fact in 1580, India became the world’s first secular state. Massive irrigation projects would follow, and when Emperor Akbar passed away in October, 1605, India was the world’s largest economy and had the highest standard of living for it’s population.  Mughal Art The institutions that Emperor Akbar built, possessed vast arrays of technology. Indian agriculture would remain the most advanced in the world until the end of the Mughal Age. The techniques of the multiple tubed seed drill, and large scale irrigation, made food production less expensive in India than anywhere in the world. This in effect gave Indian exports a competitive advantage around the globe. India became the world’s largest exporter with nearly 33% of global G.D.P. under Indian Control. The state financed trade and Indian checks could be cleared as far away as Morocco. Interest rates were regulated. During this time in Indian history, homelessness and poverty were unheard of. European travelers at the time, marveled at India’s prosperity and multitudes of people. The world’s most expensive property would be in the Chandi Chowk district of Delhi. As here commerce from the globe flowed in, the levels of gold and silver bullion coming into India for trade was so great, that the price of gold was less expensive in India than anywhere in the world. The Mughal Empire’s prosperity would be embodied in it’s arts, poetry, architecture, language and cuisine which still are part of India’s National soul.  The demise of the Mughal Empire came not because of lack of success, but because after Emperor Akbar, lesser men who became Mughal Emperor’s came to the throne who slowly undid his policies of magnanimity and tolerance. By the time Emperor Aurangzeb came to the throne, Hindus, Sikhs and minorities were persecuted to an intolerable level. The Sikh and Maratha rebellions would end the Mughal Empire, Seizing upon this weakened state, an upstart Nadir Shah from Iran, would lay siege to Delhi and carry out a campaign of rape and murder in Delhi for three weeks in 1738. Finally, he would depart with much of the Mughal Treasury. On June 23, 1757, the Subah of Bengal would be annexed by the British and India would enter it’s long night under colonialism. At that time the ship building capacity of India, was larger than that of all of Western Europe combined. In fact repairs which could not be made anywhere in the world could be done in India. India would loose it’s status as the world’s largest economy, it would be racially discriminated against and economically exploited to levels never seen in it’s history. The population would actually decline during most the period of British rule in India. And,by 1947 a nation which once had been the largest exporter of food in the world could not even feed itself. It would take 35 years of Indian Independence for India to even reach the adjusted level of food production that Emperor Akbar’s India had reached in 1605.  To state if Indians accepted the Mughal Sultanate is not really a question. As Indians were part of this Empire. And, at the end it was Indians who ended it because of it’s intolerance and discrimination against the majority of the population. Yet, even when the Marathas conquered Delhi, they did not dismantle the Mughal Dynasty, rather they made it a protectorate under their rule. This act alone shows that this familiar institution had become Indian. During the first war of Indian Independence in 1857, Indian patriots from a broad spectrum of Indian Society came to the last Mughal Ruler, Bhadur Shah Zafar, who briefly was again proclaimed the Emperor Of Hindustan, for his blessing. For they wanted the backing of the symbolic throne of Hindustan before they laid down their lives fighting against colonialism. There was no reason for them to have done this, had it not been for memory of an India which had not been impoverished, starved, demeaned and subjugated with no concern for it’s well being. It was for the memory of the third golden age of Indian National History they gave their lives. It was because the vision of Baba Nanak, Sant Kabir and Emperor Akbar were still remembered. It would be Prime Minister Nehru who would remark that Emperor Akbar was the architect of Modern India. Perhaps genuine intentions matter more at the end than ultimate realities. For the vision of tolerance and humanity survived well past the tyrannies of Emperor Aurangzeb and later colonialism. This vision has become joined to the modern, secular Republic of India. _________________________________________________________________________________ Exhibits and Citations Economic Statistics can be viewed in a number of ways. There are many who wish to cast doubt on the Economic success of the Mughal Age. Much of this is based upon colonial views and divisive politics created at that time. But, this should not cloud our vision of economic realities neither past nor present. The following are exerts from Wikipedia. The fact that even here the Mughal Economy is rated to be 25% of global industrial output in 1700. This statistic is actually quite low in my estimation. As the way this figure was reached did not take into full account Indian Trade with with Central Asia and Middle East, regions to which it was far more connected to then. I have used a figure of 33% which is very conservative. And, in actuality this figure may well be proven to be low.  “The Maurya Empire was followed by classical and early medieval kingdoms, including the Cholas, Guptas, Western Gangas, Harsha, Palas, Rashtrakutas and Hoysalas. During this period, Between 1 CE and 1000 CE, the Indian subcontinent is estimated to have accounted for one-third, to one-fourth of the world's population, and product, though GDP per capita was stagnant. India experienced per capita GDP growth in the high medieval era after 1000, during the Delhi Sultanate, but was not as productive as 15th century Ming China. After most of the subcontinent was reunited under the Mughal Empire, the empire became the largest economy by 1700, producing about a quarter of global GDP, before fragmenting, and being conquered over the century. During the Mughal Empire, India was the world leader in manufacturing, producing 25% of the world's industrial output up until the mid-18th century, prior to British rule. Due to its ancient history as a trading zone and later its colonial status, colonial India remained economically integrated with the world, with high levels of trade, investment and migration. India experienced deindustrialization under British rule, which along with fast economic and population growth in the Western World resulted in India's share of the world economy declining from 24.4% in 1700 to 4.2% in 1950,”  As can be seen, by 1605 India was the largest economy in the world. This would remain the case until the early 1700’s, when India would be fragmented again.  There are many historical texts with which to support the transformation of Babur. Though a case can be made that he was a an intolerant fanatic, there is much that casts this conclusion into doubt. Below are some sources which inline with this historical perceptive. “He is reported, however, to have shown Guru Nanak, whom his army briefly held in captivity, respect, falling “at his feet with the cry…on the face of this faqir, one sees God himself” “The kingdom that Babur founded developed into the largest empire in India prior to the arrival of the European powers. The Mughal Empire was to contribute much to art and learning. Among the skills that were developed was that of book engraving, “incorporating techniques from as afield as China and Byzantium” “Even if he was not hands on in the running of his empire, it was still founded on his policy of religious toleration. Babur was a Sunni Muslim (Manas: History and Politics, “Babar”), but he was very lax in Muslim religious observance and practice (Farooqui, 285) and practiced open-minded, tolerant Islam (BBC, “Mughal Empire (1500s, 1600s)). He did not persecute other religions’ followers and even prized learned men’s religious discussion (Farooqui, 284). Babur died in 1530 and passed the torch to his son, Humayun (Duiker and Spielvogel, 434” “Historians and political theorists have often spoken of the relevance of Akbar and Ashoka, two of the great figures in India's long history of large-scale state formation. Though Babur's name is much maligned for his association, even if only in name, with that demolished mosque at Ayodhya, it is important that politicians — whether at 24 Akbar, 11 Ashoka or elsewhere — learn from what the founder of the Mughal empire had to say on how not to squander the great opportunity of running the country with all its religious and ethnic diversities. Babur's wasiyat-nama (will) for his son and successor Humayun is a fine text of political ideas, that clearly draws from the language of politics evolved in Khurasan — the intellectual reference point of north India, Central Asia and Iran. The cosmopolitan inclusiveness of this language reveals traces of the political ideas of ancient India, Persia and Greece being effortlessly merged to develop a political framework or theory relevant also to a pluralistic society like that of medieval India. Babur has highlighted half-a-dozen issues of crucial importance of the kind politicians are always faced with and often mishandle. “Babur advises a ban on cow-slaughter, which will help to earn a place in the hearts of the majority population.” “He first tells his son that he should steer clear of any kind of religious prejudice and, keeping in mind the religious sentiments and customs of the people, he should be just to all of them without exception. This is what may be identified as an important precept of secularism in modern India.” Religious Toleration in Mughal India ",
            "date": "Updated July 12, 2018",
            "views": "366",
            "upvotes": " View 312 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Krishna Murthy",
                    "user_href": "/profile/Krishna-Murthy-405"
                },
                {
                    "user_id": "Mihir Tupe",
                    "user_href": "/profile/Mihir-Tupe"
                },
                {
                    "user_id": "Raj Prasad",
                    "user_href": "/profile/Raj-Prasad-240"
                },
                {
                    "user_id": "Sudheshna Yakkala",
                    "user_href": "/profile/Sudheshna-Yakkala"
                },
                {
                    "user_id": "Jerin Benny Palathingal",
                    "user_href": "/profile/Jerin-Benny-Palathingal"
                },
                {
                    "user_id": "Aryan Sharma",
                    "user_href": "/profile/Aryan-Sharma-295"
                },
                {
                    "user_id": "Kartik Gupta",
                    "user_href": "/profile/Kartik-Gupta-445"
                },
                {
                    "user_id": "Sheetal Jain",
                    "user_href": "/profile/Sheetal-Jain-247"
                },
                {
                    "user_id": "Aameer",
                    "user_href": "/profile/Aameer"
                },
                {
                    "user_id": "Helena Angel",
                    "user_href": "/profile/Helena-Angel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venkita Seshadri",
                "href": "/profile/Venkita-Seshadri"
            },
            "answer_text": "For any group to rebel against a ruling class, certain minimum conditions must be met: they need to be aware of the oppression being perpetrated against them, and they need to be able to organize to mount a rebellion. I argue that conditions in India during the Mughal rule were not conducive for a general uprising. The Mughals co-opted the Hindu nobility including the royalty to rule their subjects and did not usually interfere in Hindu religious practices. They chose to co-opt the nobility by selective sharing of power and wealth and enacting strategic marital alliances. Of course, there were exceptions such as Aurangazeb who did much to alienate the Hindus by his bigoted actions, but this was not the norm. For a significant fraction of Hindus, their proximate ruler was a Hindu and not a Muslim. It was in the interest of the Hindu rulers to keep their subjects pacified and not permit them to organize in any significant fashion. While some of the Hindus may have been aware that their own ruler was a vassal, I do not think that the majority entertained any rebellious thoughts towards the Mughal Emperor. The economic condition of the people during the Mughal rule in India was comparable to or better than in rest of the world. Wikipedia has an article on Mughal India which states that the GDP of India (22.4% of world GDP in 1600) grew by 2 percentage points by 1700. By 1800, India constituted nearly a quarter of the world economy. India’s population also grew significantly during the Mughal rule. The purchasing power and living standards of Indians is stated to have exceeded that of the English. The Mughals built roads, schools and other infrastructure and instituted a multitude of administrative reforms. It is not clear that economic issues would have served as a platform for a rebellion. The level of education, availability of information and social awareness was much less during the Mughal times compared to the present. Even if a subset of the people had grievances against their rulers, it would have been difficult to mount an organized and sustained insurrection. ",
            "date": "Answered July 5, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashok Medhi",
                    "user_href": "/profile/Ashok-Medhi"
                },
                {
                    "user_id": "Chhabi Badaik",
                    "user_href": "/profile/Chhabi-Badaik"
                }
            ]
        }
    ]
}