{
    "title": "Why do professional sports teams typically change cities? - Quora",
    "tags": [
        "Sports Team Ownership",
        "Team Sports",
        "Sports Business",
        "National Basketball Association (NBA)",
        "National Football League",
        "Professional Sports"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Cuzzocrea",
                "href": "/profile/Frank-Cuzzocrea"
            },
            "answer_text": "In the early days a sports league (or with newer franchises in existing leagues), it is typically because the team cannot make money This happened a lot in all for major sports (even baseball, as the Baltimore Orioles became the NY Highlanders (Yankees) and Milwawkee Brewers to St. Louis Browns <later Baltimore Orioles 3>). In the early days of a league it is usually find a new owner, move, or die. The NHL “Original Six Era” had more than 6 teams, many founded after the league started, and many of those other teams moved locations (though the O6 teams we know of today stayed in the same metro era since each teams founding). Even in recent times, the Vancouver Grizzles left for Memphis in 2001 because they were losing money hand over fist in the pacific northwest and the same was true for the Quebec Nordiques to Colorado Rockies in 95 and the Atlanta Thrashers to Winnipeg Jets-2 in 2011. As leagues become more established, teams would move because of competition in their own market and they were usually the #2 team The Chicago Cardinals to St. Louis (eventually Arizona) and Cleveland Rams to LA (after the Browns joined the NFL from the AAFC) did this in the NFL. The Dallas Texans took their AFL Championship to KC since the Cowboys dominated at the gate; same for the Baltimore CFLers to Montreal Alouettes 3 when the Ravens moved to town. Most of the 50–60s MLB Franchise moves lefts duel markets to new vacant cities, and the ABA-NBA and NHL-WHA duel city problems usually forced one team out of the market so both wouldn’t fold. To a lesser extent this also happens between sports; The Buffalo Braves become the San Diego Clippers because the Sabres were more profitable with better dates, same with Basketball teams in Pittsburgh in the 60s-70s, and the Oakland/California/Golden Seals to Cleveland Barons (later merged with Minnesota North Stars) because of the Warriors. In well established and prosperous leagues; they move for two reasons First, teams move because existing owners are looking to sell and new ownership wants the club to move to a bigger or more financially prosperous city. A lot of times a buying group represents a different city that wants the team (Seattle Supersonics to OKC Thunder, Winnipeg Jets 1 to Phoenix Coyotes, Montreal Expos to Washington Nationals) or a minority owner takes control and wants to relocate to his base of operations (Philadelphia Warriors to San Fran (Golden State), KC-Omaha Kings to just Kansas City (later moved to Sacramento for financial reasons), Colorado Rockies NHLers to New Jersey Devils). The San Jose Sharks and the Austin MLS expansion team were created from existing clubs (Minnesota North Stars and Columbus Crew) when ownership groups split and were rewarded new teams. The second is because they can make more money then were they already are (usually with new stadium deal) even in a smaller market. This would include both the moves out of LA in 1994 and the moves into LA in the late 2010s for the NFL, the Minnesota North Stars to the Dallas Stars, and Houston Oilers to Tennessee Titans. ",
            "date": "Answered January 18, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shane Zimmerman",
                    "user_href": "/profile/Shane-Zimmerman-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael J Zupon",
                "href": "/profile/Michael-J-Zupon"
            },
            "answer_text": "Money. Every major decision a professional sports organization makes is always about money. These days, that money comes from new stadia. Bigger, better, fancier, with more luxury suites so more wealthy “fans\" can watch the games on televisions with no chance of being touched by a commoner. Teams that move move because their current city either can't or won't build a new playground, at taxpayer expense, but with the majority (or all) of the revenue going to the team owner. Socialized cost, privatized profit. Then, when the new city's offering is eclipsed by the neighboring team's new digs, teams threaten to move again unless more public cash is shovelled into the owner's vaults. A new stadium is why the Rams moved to St. Louis from LA, and then back again. Better stadiums are why the Raiders went from Oakland to LA back to Oakland and on to Las Vegas. Money is why the Colts left Baltimore for Indy and why Cleveland left for Baltimore. A new arena is why the Sonics became the Thunder and the Expos became the Nationals. ",
            "date": "Answered December 23, 2019",
            "views": "103",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shane Zimmerman",
                    "user_href": "/profile/Shane-Zimmerman-5"
                },
                {
                    "user_id": "Louis Juliot",
                    "user_href": "/profile/Louis-Juliot"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Richard Blaine",
                    "user_href": "/profile/Richard-Blaine-3"
                },
                {
                    "user_id": "Steven Haddock",
                    "user_href": "/profile/Steven-Haddock"
                }
            ]
        }
    ]
}