{
    "title": "Why did the United States stop using silver to make coins? - Quora",
    "tags": [
        "Silver Coins",
        "Money in the United States of America",
        "Silver (element)",
        "Coins",
        "Currencies",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Ciarrocchi",
                "href": "/profile/Peter-Ciarrocchi"
            },
            "answer_text": "Metal coins no longer need to have actual value no more than printed money does. Precious metal is not needed to sustain value, but ‘world confidence’ in the United States government’s stability in maintaining its currency’s monetary value is. Also, it makes little sense to put any precious metal in any coins. Coins represent a ‘set’ value; whereas, a precious metal’s valuation fluctuates on the open market. In the future, as technologies progress, the need for any actual physical form of pocket money will become non-existent among modernized countries. However, cultural preferences and limited modernization capabilities will slow/prevent other countries down, so such electronic everyday trading will be hard to achieve globally. But, for America, and other fortunate modernized countries, we see this trend toward electronic ‘everyday’ monetary transactions becoming more dominant as the present, and each new generation, gets used to not needing actual physical money in their pockets. ",
            "date": "Answered March 13, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tom Gray",
                    "user_href": "/profile/Tom-Gray-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Spencer",
                "href": "/profile/Chris-Spencer-120"
            },
            "answer_text": "Silver coinage (and gold) only works if the weight of silver in the coin is equal in value to the coin itself. As the price of silver increased, it became necessary to use less of it - either my making it less pure, or by making the coins smaller. There is no point using a dollar’s worth of silver to make a 50 cent coin - they will just get melted down for the metal value. ",
            "date": "Answered March 13, 2020",
            "views": "34",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Gray",
                    "user_href": "/profile/Tom-Gray-55"
                },
                {
                    "user_id": "Sarah Weaver",
                    "user_href": "/profile/Sarah-Weaver-18"
                }
            ]
        }
    ]
}