{
    "title": "Why aren’t there any “White” tribes left like there are Native-American tribes, Arab tribes, African tribes, or Asian tribes? Why is that? - Quora",
    "tags": [
        "Native American Tribes",
        "Native American History",
        "Tribalism",
        "Africans",
        "Native Americans",
        "Anthropology",
        "Asian People",
        "White People",
        "Africa",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aurora Silavong",
                "href": "/profile/Aurora-Silavong"
            },
            "answer_text": "There are tons of “white” tribes left in the world, if you mean indigenous groups of Caucasian/European descent. They generally have preserved their traditional way of life, although like tribes everywhere else, many have succumbed to the encroachment of modern society. All over Europe, there are ethnic minorities that speak separate languages and have distinct cultures from the sovereign nations that now govern them. Although many of those people also have assimilated (to a degree) to the culture of their sovereigns, they may still retain elements of their original culture. Here are some: The Sami people live in northern Scandinavia. They speak Sami languages, and they have a distinct culture from the rest of the region. The majority of them are Christians now, but there are still pockets that practice the old Sami shamanistic religions. They’re traditionally sheep-herders, fishers, and fur-trappers. Circassians are a predominantly Muslim people who once occupied parts of the Caucasus, but have since scattered throughout the world due to conquest and genocide. Circassian women have historically been considered beauties, which made them popular targets for slavers. They speak Circassian languages, and they still retain their traditional costumes. Though they live in the Middle East and are Muslims, they are not Arabs. The Faroese are descendants of ancient Gaelic and Norse peoples who live predominantly on the Faroe Islands. They speak a Germanic language, but also Danish, as they are now part of Denmark. They primarily practice Lutheran Christianity, but their ancestors followed old Norse paganism. ",
            "date": "Answered April 28, 2020",
            "views": "940",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tavai Bailey",
                    "user_href": "/profile/Tavai-Bailey"
                },
                {
                    "user_id": "Patrick McLoughlin",
                    "user_href": "/profile/Patrick-McLoughlin-45"
                },
                {
                    "user_id": "Nassima Hamadou",
                    "user_href": "/profile/Nassima-Hamadou"
                },
                {
                    "user_id": "Jonathan Liebowitz",
                    "user_href": "/profile/Jonathan-Liebowitz"
                },
                {
                    "user_id": "Renea Seigrist",
                    "user_href": "/profile/Renea-Seigrist"
                },
                {
                    "user_id": "Kirby Cho",
                    "user_href": "/profile/Kirby-Cho-2"
                },
                {
                    "user_id": "Emanuel Leung",
                    "user_href": "/profile/Emanuel-Leung"
                },
                {
                    "user_id": "Alexandru Vălcăneanțu",
                    "user_href": "/profile/Alexandru-Vălcăneanțu-1"
                },
                {
                    "user_id": "Ronald Kimmons",
                    "user_href": "/profile/Ronald-Kimmons"
                },
                {
                    "user_id": "Asimina Giannikaki",
                    "user_href": "/profile/Asimina-Giannikaki-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wouter Kulche",
                "href": "/profile/Wouter-Kulche"
            },
            "answer_text": "In any place in the world (except for maybe the Sentinal Islands and other very remote regions) did/do tribes (better said, communities) split up/isolate themselves as a group and mix once more with others at some point. This is a process that has happened before humans evolved to the point where we consider them humans and that at times will continue to do so (or in case of an apocalyptic event even more so). Due to globalisation and transport does the isolation part seldomly happen anymore and this has happened in some areas in Asia, the Middle East and Europe generally more than elsewhere but there are many exceptions in both ways. The Mayans in Mexico are from every reasonable viewpoint less of a tribe than the Samen in Scandinavia except for how we ‘feel’ about the word ‘tribe’ being used for whites. Why would a village which has been in existence for centuries, where the people have particular traditions and where the inhabitants have typical physical features not be a tribe just because they also adapted to modern technology, economy and culture….or because of their ethnicity? Also many tribes which we see as tribes have mixed themselves with individuals from outside. Thus the word ‘tribe’ is a misused word. By definition some villages in Europe or by now the US would more fit the description ‘tribe’ than some communities we generally use it for but what hangs in mind with the word ‘tribe’ is a group of hunter gatherers in a warm region that appears to sticks to itself. With that unofficial connotation it seems that caucasoids can never be a tribe nor have they been when in fact the have, and many are. ",
            "date": "Answered June 11, 2020",
            "views": "198",
            "upvotes": "0"
        }
    ]
}