{
    "title": "Why did Armenia recognize pro-Azerbaijan Israel but didn’t recognize pro-Armenia Palestine? - Quora",
    "tags": [
        "Armenia",
        "Palestine",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Artur Aslanyan",
                "href": "/profile/Artur-Aslanyan"
            },
            "answer_text": "Armenia recognized Israel in 1992, shortly after gaining its independence and establishing bilateral relations. All the former Soviet Republics did so after their independence. It should be reminded that the Soviet Union, the preceding state of these republics, recognized Israel and was the first state in the world to do so on May 17, 1948. About Israel being pro-Azerbaijan and Palestine being pro-Armenia, I would not describe the geopolitics that way. Israel has better relations with Azerbaijan because they share interests. Namely, Israel likes to have a friendly Muslim-majority country in the region and one with plenty of funds to purchase military hardware from it. Furthermore, Azerbaijan has a notable Jewish community, some of whom have moved to Israel, and they help to further relations between the two states. Palestinians have better relations with Armenia and Armenians because of their own set of shared interests. Armenian communities throughout the region and elsewhere in the world have shared some of the same space and as two exiled communities, they share an understanding with each other. Furthermore, as both people have two unrecognized states (State of Palestine and the Nagorno-Karabakh Republic) and have powerful foes, they again find camaraderie in their struggles. But it is not true to say that Armenians do not have such contacts and shared experiences with Jewish communities or that there is a particular antagonism between Armenia and Israel (except perhaps that certain interests in Israel and abroad refuse to accept the Armenian Genocide). There are many Jews in Israel and abroad that are quite supportive of Armenia and Armenians, and likewise for voices in Armenia and abroad that would like nothing better than better relations with Israel. Speaking personally, I have family members that emigrated from Armenia to Israel about 30 years ago and love it in that country, actively working to share Armenian culture with the Israeli public. It would be wrong to say that because Israel has better relations with Azerbaijan, Armenia and Israel must have extremely hostile relations. ",
            "date": "Answered September 21, 2017",
            "views": "61",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rachmiel Shmuel Murphy",
                    "user_href": "/profile/Rachmiel-Shmuel-Murphy"
                },
                {
                    "user_id": "Bishes Be Mad",
                    "user_href": "/profile/Bishes-Be-Mad"
                },
                {
                    "user_id": "Anatoly Mayburd",
                    "user_href": "/profile/Anatoly-Mayburd"
                },
                {
                    "user_id": "Neil Horowicz",
                    "user_href": "/profile/Neil-Horowicz"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Benny Fridman",
                    "user_href": "/profile/Benny-Fridman"
                },
                {
                    "user_id": "Eli Litvak",
                    "user_href": "/profile/Eli-Litvak"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "IiamCarrie BSP",
                    "user_href": "/profile/IiamCarrie-BSP"
                },
                {
                    "user_id": "Alex Leonidov",
                    "user_href": "/profile/Alex-Leonidov-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orem Frien",
                "href": "/profile/Orem-Frien"
            },
            "answer_text": "First of all, while Azerbaijan does have much more fruitful relations with Israel, primarily based on a petroleum-for-weapons trade which Palestine cannot replicate, Azerbaijan recognizes Palestine and opposes Israeli control over the West Bank. Concerning Armenia’s non-recognition of Palestine, there are two major reasons for it: 1) Uselessness: Palestine cannot do anything for Armenia, but serve to needlessly antagonize Israel. Palestine has no large economy or diplomatic weight. Israel, conversely, can trade with Armenia and does. Armenia recognizes that because both countries have the tenuous positions as the only two Non-Muslim nations in the Middle East (aside from perhaps Cyprus), they need to carefully align their foreign policies to maintain a cadre of protectors. Israel needs the help of Turkey and Azerbaijan for this and Armenia needs Iran. That these Muslim protectors are the enemy of the other state does not severely impact the way that the Israelis and Armenians see one another. 2) Separatism: Given the Nagorno-Karabakh Conflict, the first separatist republic that Armenia would like to recognize is Artsakh Republic. However, such recognition cannot occur without reigniting the Nagorno-Karabakh Conflict. Until such time as Artsakh Republic can be recognized, Armenia has a strict policy of not recognizing other separatist republics. As former Armenian President Serzh Sargsyan said in 2008 to an annual meeting of ambassadors: Today one is wondering from time to time why Armenia is not recognizing the independence of Abkhazia and South Ossetia. The answer is simple: for the same reason that it did not recognize Kosovo’s independence. Having the Nagorno-Karabakh conflict, Armenia can not recognize another entity in the same situation as long as it has not recognized the Nagorno-Karabakh Republic. This applies, in the Armenian view, to Palestine with equal fidelity. ",
            "date": "Answered May 2, 2018",
            "views": "25",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Alz",
                    "user_href": "/profile/Jay-Alz-2"
                },
                {
                    "user_id": "Aemiro Adgeh",
                    "user_href": "/profile/Aemiro-Adgeh"
                },
                {
                    "user_id": "Irene Avet",
                    "user_href": "/profile/Irene-Avet"
                },
                {
                    "user_id": "Arman Melikyan",
                    "user_href": "/profile/Arman-Melikyan-3"
                },
                {
                    "user_id": "Vano Sasuntsi",
                    "user_href": "/profile/Vano-Sasuntsi"
                },
                {
                    "user_id": "Nancy Dills",
                    "user_href": "/profile/Nancy-Dills"
                },
                {
                    "user_id": "Zach Montazeri",
                    "user_href": "/profile/Zach-Montazeri"
                },
                {
                    "user_id": "Abraham Dominski",
                    "user_href": "/profile/Abraham-Dominski"
                },
                {
                    "user_id": "Solomon Malekani",
                    "user_href": "/profile/Solomon-Malekani"
                },
                {
                    "user_id": "Giles Cattermole",
                    "user_href": "/profile/Giles-Cattermole-1"
                }
            ]
        }
    ]
}