{
    "title": "Why did Lincoln just barely win both of his elections? - Quora",
    "tags": [
        "Abraham Lincoln",
        "Political Campaigns",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Schwartz",
                "href": "/profile/Daniel-Schwartz-37"
            },
            "answer_text": "“Why did Lincoln just barely win both of his elections?” He didn’t. In 1860, Abraham Lincoln of the Republican party (and his vice-president, Hannibal Hamlin) ran against not one, but three other tickets — Stephen Douglas of the Northern Democrats, John Breckinridge of the Southern Democrats, and John Bell of the Constitutional Union party. Lincoln received only 39.8% of the popular vote. But as watchers of the 2000 and 2016 presidential elections know all too well, it’s the electoral college votes that count… and, with 152 electoral college votes needed to win, Lincoln got 180, carrying 18 states. In other words, Lincoln won, and it wasn’t close. (An interesting historical tidbit — John Bell’s running mate was Edward Everett, the former Secretary of State, Senator from Massachusetts, and governor of Massachusetts. After losing the election in 1860, Everett would largely be remembered for giving a two-hour speech at Gettysburg in 1863, which was followed, and almost immediately eclipsed, by President Lincoln’s two-minute Gettysburg Address. Everett graciously wrote to the President afterwards, saying that he flattered himself to think that he had summarized the Union cause as well, in two hours, as the President had done in two minutes.) 1860 United States presidential election - Wikipedia In 1864, Lincoln ran for re-election, this time with Democrat Andrew Johnson as his running mate. This time he had only one opponent — his former top general, George McClellan. And this time, Lincoln won in a landslide, with 55% of the popular vote and 212 out of 233 electoral college votes. Saying that it wasn’t close is putting it mildly indeed. Another interesting historical tidbit: Lincoln is sometimes remembered as the last third-party candidate to win the Presidency. It’s not often remembered that Lincoln did it twice. He won in 1860 with the brand-new Republican party, and he won in 1864 with the ad-hoc National Union party. Every American president since then, without exception, has been a Republican or a Democrat. 1864 United States presidential election - Wikipedia ",
            "date": "Answered February 27, 2020",
            "views": "79",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jose Bustamante",
                    "user_href": "/profile/Jose-Bustamante-21"
                },
                {
                    "user_id": "Alan Mcintire",
                    "user_href": "/profile/Alan-Mcintire-1"
                },
                {
                    "user_id": "James Keenley",
                    "user_href": "/profile/James-Keenley"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Giridharan Velamore",
                    "user_href": "/profile/Giridharan-Velamore-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Overland",
                "href": "/profile/Brian-Overland-1"
            },
            "answer_text": "Lincoln won his second presidential election (1864) by an electoral college landslide and a big popular vote margin: 55% to 45% (for retired general McClellan). These days, if any president is elected with 55% or more of the popular vote, it’s generally considered a popular-vote landslide. BUT… before the victories at Gettysburg and the fall of Atlanta, Lincoln had to face a strong possibility of losing re-election, and thus the Civil War, as McClellan would’ve negotiated a one-sided settlement with the South. But Lincoln would not consider canceling the election. He had to hope for some victories, so that people could see a light at the end of the tunnel, as it were. Those victories on the battlefield did happen, tho, and this made Lincoln popular, as people could now look forward to Johnny marching home again. If the war had dragged on further, Lincoln would have been increasingly unpopular… as it was, he was (in the north) the Hero who had saved the Union, and therefore the country. Lincoln’s first election was closer because — He was so hated in the South (for his opposition to slavery) that in nine Southern states he wasn’t even on the ballot. So he had to have such a big victory in the northern states that it overcame his not even being on the ballot in much of the nation. However, when he was elected, this just contributed more to the Southern anger against him, as now people of the South could say… the new president is someone that NOT ONE of our people even voted for!!!!! Lincoln won the popular vote and electoral college. And yet he had only 40%… but won because that year the Democratic Party split into several segments and there were four major candidates running as a result. ",
            "date": "Answered February 27, 2020",
            "views": "151",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Glenn R. Anderson",
                    "user_href": "/profile/Glenn-R-Anderson"
                },
                {
                    "user_id": "Alan Mcintire",
                    "user_href": "/profile/Alan-Mcintire-1"
                },
                {
                    "user_id": "Thomas Rath",
                    "user_href": "/profile/Thomas-Rath-2"
                },
                {
                    "user_id": "Daniel Schwartz",
                    "user_href": "/profile/Daniel-Schwartz-37"
                },
                {
                    "user_id": "Giridharan Velamore",
                    "user_href": "/profile/Giridharan-Velamore-1"
                },
                {
                    "user_id": "James Keenley",
                    "user_href": "/profile/James-Keenley"
                },
                {
                    "user_id": "John Caporaso",
                    "user_href": "/profile/John-Caporaso-1"
                }
            ]
        }
    ]
}