{
    "title": "Why was Napoleon Bonaparte so successful? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " Napoleon was a much better general than the aristocrats he defeated and had better armies, tactics and morale. At first, his armies spread the ideals of Liberty, Equality and Fraternity, noble goals and values, and the common people of Europe were originally very receptive to this message and Napoleon’s troops. Napoleon’s Civil Code was a legal improvement that Europeans valued. Napoleon promoted officers on the basis of merit, not pedigree. He organized his Grand Army in corps of about 25,000 men each; each corps had a balanced number of infantry, artillery, cavalry, medical personnel, etc.; and each corps could fight on its own under a capable Marshal of France. Front line officers were allowed to make decisions on the spot, and did not have to wait for permission from above like France’s enemies required of their front line soldiers. Napoleon outworked many of his opponents and was able to move troops much faster than before in Europe. He saw to every detail in office and on the battlefield, worked incredibly long hours without sleep before and during battles, and won people over as an inspiring leader. When tired, he could lie down and go to sleep while guns and artillery were firing. Napoleon was very intelligent, well-educated in military science at a top military school, a great tactician, robust physically, charming when needed and optimistic. Napoleon knew how to pick, reward and promote good officers and administrators. He took the ideals of the French Revolution, put them to work in modified form, and understood how his forces surpassed traditional European armies. Napoleon did not interrupt his enemies when they were in the process of making a mistake. Napoleon created an excellent intelligence network, with spies all over Europe, and generated useful propaganda. Personally, Napoleon was an artillery expert, excellent horseman, understood terrain, and was very decisive and able to make sound decisions under pressure in the fog of war. ",
            "date": "Updated April 18, 2017",
            "views": "104",
            "upvotes": " View 64 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam May",
                    "user_href": "/profile/Sam-May-11"
                },
                {
                    "user_id": "Star Scream",
                    "user_href": "/profile/Star-Scream-13"
                },
                {
                    "user_id": "Kayode Adesanya",
                    "user_href": "/profile/Kayode-Adesanya"
                },
                {
                    "user_id": "TheOneAndOnlyZeno .",
                    "user_href": "/profile/TheOneAndOnlyZeno"
                },
                {
                    "user_id": "Ech0Chamber",
                    "user_href": "/profile/Ech0Chamber"
                },
                {
                    "user_id": "Adrien Monsellato",
                    "user_href": "/profile/Adrien-Monsellato-1"
                },
                {
                    "user_id": "Natacus Maximus",
                    "user_href": "/profile/Natacus-Maximus"
                },
                {
                    "user_id": "Simon Carter",
                    "user_href": "/profile/Simon-Carter-95"
                },
                {
                    "user_id": "Jet Đỗ",
                    "user_href": "/profile/Jet-Đỗ"
                },
                {
                    "user_id": "Free Spirit",
                    "user_href": "/profile/Free-Spirit-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Inglis",
                "href": "/profile/David-Inglis-8"
            },
            "answer_text": "Because for most of his career he faced poor Generals, leading smaller armies, which were no where near as good as the quality of the French army. His record against well lead, well trained armies that outnumbered he wasn't so good. 1. France was the most powerful nation in Europe. by the Time Napoleon came to power the French Empire was the largest in Europe, the most advanced Militarily. 2. the Odds. Under Napoleon France was mostly directly opposed by 1 major land power at a time, Austria in 1805, Prussia 1806, Austria 1809, Russia in 1812. Russia sent Auxiliary Corps in 1805 and 1806 but was well short of the wholehearted participation . That France could defeat the much smaller Nations of Prussia (1/4 the population )and Austria (1/2 the population) should came as a big surprise. In most of his campaigns he enjoyed a significant advanatge in the operational threatre, and indeed in most of his battles his had a significant numerical advantage. (of course a lottos this was due to Napoleon’s diplomatic and operational manoeuvres which he deserves credit for) 3. Opponents Errors. His opposing Monarchs and Generals made some and strategic errors. Napoleon’s opponents were often poor generals. Notably in 1805 advance of the Austrians under Mack, (and failure to withdraw against the advice of his fellow generals which he could easily have done) the Rush of the Prussian army to fight in 1806, in both cases the defeat of the principle army of Austria and Prussia well before any Russian force could arrive. bad Strategic errors. before Austerlitz , Prussia was mobilising, another Russian corps was arriving and Charles was marching from Italy, there was no need to rush to decisive battle, Napoleon’s strategic situation was deteriorating, the decision to fight at Austerlitz was a gift. Schwartzenberg kept moving avery slowly and making bad deployments in 1813–14 which greatly assisted Napoleon. 4. Good Subordinates. Davout, Soult, Lannes, Massena, which other leader had that quality of subordinate available. In general especially the pre-1812 there is no doubt Napoleon had more able subordinates available than the opposition did/ 6. The French Army The French army by a variety of factors had advanced beyond the ancient regimes armies, when Napoleon took power, Napoleon consolidated these advances, 6. Operational mastery Napoleon was pretty handy at operational manoeuvres, though it helped that the French army was better organised and quicker marching, ",
            "date": "Answered May 28, 2017",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Murat Yucel",
                    "user_href": "/profile/Murat-Yucel-1"
                }
            ]
        }
    ]
}