{
    "title": "Why is Israel's David considered a great king? - Quora",
    "tags": [
        "David (king of Israel)",
        "Jerusalem",
        "Kings (royalty)",
        "Israeli–Palestinian Conflict",
        "Judaism",
        "Jewish Ethnicities and People",
        "Israel",
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harvey Gornish",
                "href": "/profile/Harvey-Gornish"
            },
            "answer_text": "I think your question should be rephrased to be : Why is David considered a great man? Sure as a king he accomplished many things. He unified Israel from a loose confederacy of 12 tribes into a strong religious nation. Conquering the hardy Jebusites, David built their city Jerusalem into his capital and planned it's spiritual destiny so as to become the source of holiness the has lasted until today. But was he a great man? David was not successful as a father; two of his sons rebelled against him even seeking his death. His wife Michal did not respect him, neither did his brothers. David himself admits in the Psalms, \" I have more people who hate me than the hair on my head\". His sin with BasSheva was unforgivable even to him \" my sin lies before always\" he lamented. So what endear this little man to G-d? (He was short with red hair) Well he is the only person in the Bible about whom we are told so much of his background. Without revealing the source of his stigma, his family considered him a product of adultery. Notice that when Samuel asks his father Jesse to show all of his sons so as to pick the future king of Israel, Jesse fails to invite David. And even after David is anointed, his brothers show him no respect. But if no one loved David, yet G-d did. Why? So many reasons. David is not a nerdy bookworm. No he is a real man, who truly has passions for life . He likes women. (he marries 18 of them) He likes to do battle whether with giants like Goliath or even lions and great bears. He is a great Warrior a great poet, a great singer of G-d's sweetest psalms. For he thinks about his G-d constantly. He sins, yet he repents deeply . Nor does he lose hope after his sin. He forgives the flaws of others while refusing to forgive himself. He loves Jonathan, not in a sexual way, but as the Mishnah advises, two souls, intertwined in a friendship so true that they became the symbol of friends for eternity. He defeats his gentile enemies, but he can not defeat the irrational hatred in the heart of his king. He is humble and shy, yet not ashamed to dance like a simpleton before his G-d and the Holy Ark. What a complex man! Scholar, prophet, poet, soldier, father, husband, monarch, victim, loved and hated, and thinking always of his love for his only Friend of his lonely childhood— his G-d who alone gave him consolation. If The Al-Mighty G-d declared his love for David, shouldn't we see him as a most precious soul? ",
            "date": "Updated June 2, 2019",
            "views": "182",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Needsnew-Postcode"
                },
                {
                    "user_id": "Joseph Ward",
                    "user_href": "/profile/Joseph-Ward-103"
                },
                {
                    "user_id": "James Daniel Garza",
                    "user_href": "/profile/James-Daniel-Garza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yair Davidiy",
                "href": "/profile/Yair-Davidiy"
            },
            "answer_text": "The first King of Israel was Saul from the Tribe of Benjamin. After Saul came David from the Tribe of Judah. David defeated the enemies of Israel. He established his capital in Jerusalem. David prepared much of what was needed for the Temple whose construction was completed by his son, Solomon.  David was extremely pious. He wrote a good portion of the Book of Psalms. David was the Prototype for the future Messiah who will be descended from him. David represents the future restoration of the Jewish People and their re-unification with the Lost Ten Tribes. Who Was David?  David was a descendant of Judah who was a son of Israel. The first Hebrew was Abraham. Abraham begat Isaac who begat Jacob.  Jacob was re-named Israel. He gave rise to the 12 Tribes of Israel. The fourth son of Israel was named Judah. The mother of Judah was Leah. The sons of Judah who survived and begat children were Sheliah, Zerach, and Peretz (sometimes written as \"Perez\"). Peretz was an ancestor of Boaz who married Ruth the Moabitess. Her story is related in the Book of Ruth (Ruth 4:18-22). From Boaz descended Jesse the father of David. Expressions such as \"Son of Jesse\" (1-Samuel 16:18, 20:27, 22:9, 25:10, 2-Samuel 23:10, 1-Chronicles 12:18), \"Trunk of Jesse\" (Isaiah 11:1,) \"Root of Jesse\" (Isaiah 11:10). all refer to David, or to the future Messiah descendant of David. ====== David was made King over Israel. 1-Kings (KJB) 8: 16 Since the day that I brought forth My people Israel out of Egypt, I chose no city from any tribe of Israel to build a house where My name might be praised, but I chose David to be over My people Israel. ====== An Eternal Throne David had been promised that his seed would rule over Hebrews forever. This blessing was confirmed to Solomon. 1-Kings (KJB) 2: 45 But King Solomon shall be blessed, and the throne of David shall be established before the LORD forever. God spoke to Solomon promising him an eternal lineal right to the Kingdom in the name of the promise given to David. 1-Kings (KJB) 9: 5 then I will establish the throne of your kingdom upon Israel forever, just as I promised to your father David, saying, 'You shall not fail to have a man upon the throne of Israel.' 1-Kings (KJB) 11: 36 To his son will I give one tribe, so that My servant David will always have a light before Me in Jerusalem, the city in which I have chosen to put My name. ====== In the Name of David Solomon prayed to God on behalf of his kingdom in the name of his father David. 1-Kings (KJB) 8: 25 Therefore, LORD God of Israel, now keep what You promised Your servant David my father, saying, 'You will not fail to have a man sit before Me on the throne of Israel, so long as your sons take heed to their way, that they walk before Me as you have walked before Me.' ====== David was Chosen When Solomon built the Temple he praised the Almighty and quoted the promise God had made regarding the lineage of David. 2-Chronicles (KJB) 6: 6 but I have chosen Jerusalem for My name to dwell there, and I have selected David to be over My people Israel. ====== David the Anointed In Psalms David is referred to as the \"Anointed,\" in Hebrew \"Mashiach\" i.e. Messiah. Psalm (KJB)18: 50 He gives great deliverance to His king, and shows lovingkindness to His anointed, to David and to his descendants for evermore. Psalm (KJB) 89: 20 I have found David, My servant; with My holy oil I have anointed him:  Temporary Rejection of the Son of Jesse! When the Ten Tribes rebelled against Rehoboam the son of Solomon they described themselves as rejecting the son of Jesse, i.e. descendants of David. The Future Redemption will come when they repent and return to request that David (i.e. the Messiah, son of David) rule over them (Midrash Shmuel 13; Midrash Yalkut Shimeoni-2, remez 106; Rashi on Hosea 3:5). 1-Kings (KJB) 12: 16 So when all Israel saw that the king did not listen to them, the people responded to the king, saying, 'What portion do we have in David? We also do not have an inheritance in the son of Jesse. To your tents, O Israel, and see to your own house, David! So the people of Israel departed to their tents. ====== The Future Messiah will be a Branch of David The Future Messiah is referred to as a Branch of David i.e. an offshoot meaning a descendant. Jeremiah (KJB) 33: 15 In those days and at that time, I will cause a righteous Branch to spring up for David; and he shall execute justice and righteousness in the earth. Ezekiel (KJB) 34: 24 I the LORD will be their God, and My servant David shall be prince among them. I the LORD have spoken. Hosea (KJB) 3: 5 Afterward the children of Israel will return and seek the LORD their God and David their king. They will come in fear to the LORD and to His goodness in the latter days. ===== Ingathering the Exiles, The Stem of Jesse i.e. David. Isaiah (KJ2000) 11: 1 And there shall come forth a rod out of the Stem of Jesse, and a Branch shall grow out of his Roots: 2 And the spirit of the LORD shall rest upon him, the spirit of wisdom and understanding, the spirit of counsel and might, the spirit of knowledge and of the fear of the LORD; 3 And his delight shall be in the fear of the LORD: and he shall not judge after the sight of his eyes, neither reprove after the hearing of his ears: This \"Rod out of the Stem of Jesse,\" and Branch Growing out of his Roots is the future Messiah son of David son of Jesse. He will judge the Earth and reform mankind (Isaiah 11:4-9). He will also ingather the Exiles including those of Ephraim and the Lost Ten Tribes (Isaiah 11:11–13). Jeremiah (NKJV) 33: 14 Behold, the days are coming, says the LORD, that I will perform that good thing which I have promised to the house of Israel and to the house of Judah: 15 In those days and at that time I will cause to grow up to David A Branch of righteousness; He shall execute judgment and righteousness in the earth. 16 In those days Judah will be saved, And Jerusalem will dwell safely. And this is the name by which she will be called: THE LORD OUR RIGHTEOUSNESS.  17 For thus says the LORD: David shall never lack a man to sit on the throne of the house of Israel;  18 nor shall the priests, the Levites, lack a man to offer burnt offerings before Me, to kindle grain offerings, and to sacrifice continually. ",
            "date": "Updated July 21, 2019",
            "views": "64",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Marchment",
                    "user_href": "/profile/James-Marchment-1"
                },
                {
                    "user_id": "Joe Barra",
                    "user_href": "/profile/Joe-Barra-2"
                },
                {
                    "user_id": "William Dsouza",
                    "user_href": "/profile/William-Dsouza-30"
                },
                {
                    "user_id": "Rafi Sadowsky",
                    "user_href": "/profile/Rafi-Sadowsky"
                },
                {
                    "user_id": "Elizabeth Bhebe",
                    "user_href": "/profile/Elizabeth-Bhebe"
                },
                {
                    "user_id": "Jolie Gonzalez Padilla",
                    "user_href": "/profile/Jolie-Gonzalez-Padilla"
                },
                {
                    "user_id": "Steve Evans",
                    "user_href": "/profile/Steve-Evans-134"
                },
                {
                    "user_id": "Augustin James",
                    "user_href": "/profile/Augustin-James-1"
                },
                {
                    "user_id": "Shlomo Sokolinski",
                    "user_href": "/profile/Shlomo-Sokolinski"
                },
                {
                    "user_id": "Zev Bitman",
                    "user_href": "/profile/Zev-Bitman"
                }
            ]
        }
    ]
}