{
    "title": "Why did FDR see Winston Churchill naked? - Quora",
    "tags": [
        "Franklin D. Roosevelt",
        "Winston Churchill",
        "Specific Presidents of the United States of America",
        "History of Great Britain",
        "British Monarchy",
        "Great Britain",
        "World War II",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Howard Westfall",
                "href": "/profile/Barry-Howard-Westfall"
            },
            "answer_text": "Roosevelt entered the main bathroom on the second floor of the White House in his wheelchair — just down the hall from his office — while being pushed by his aide. Most people do not realize that FDR seldom used the Oval Office for anything other than for formal press conferences due to his disability. Churchill was just getting out of the tub and standing to be toweled off by his valet. He saw the president pause at the door to then be withdrawn by his aide, and he said, “Come in! The Prime Minister of Great Britain wants the President of the United States to know that there are absolutely no secrets between them!” (Or words to that effect.) Roosevelt laughed. Churchill left with his valet. And after Roosevelt was finished in the bathroom, they presumably continued with their conversation. Churchill was always walking in to someone’s office unannounced on the second or third floors of the White House with one of his “bright ideas” about the war while carrying his ever-present cigar and always wearing one of his “jump suits” he had specially designed that zipped up the front. So, Roosevelt was probably “playfully” trying to turn the tables on him, some suppose! Churchill stayed at the White House for an extended period of time during the period when the US was balanced between supporting Lend Lease and actually entering the war. ",
            "date": "Updated March 4, 2020",
            "views": "491",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deborah Hamilton",
                    "user_href": "/profile/Deborah-Hamilton-48"
                },
                {
                    "user_id": "Christian Hans",
                    "user_href": "/profile/Christian-Hans-13"
                },
                {
                    "user_id": "Richard Vanni",
                    "user_href": "/profile/Richard-Vanni-1"
                },
                {
                    "user_id": "Nicki Hansen",
                    "user_href": "/profile/Nicki-Hansen-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vini Jay",
                "href": "/profile/Vini-Jay"
            },
            "answer_text": "It wouldnt surprise me if Churchill did it for a stunt. Churchill was oh so eager to get along closely with Roosevelt, not in a gay sort of way, but like brothers. He wanted to break down any mental barriers between them, so he invited Roosevelt to enter the bathroom & stood up from his bath & said (quoting from memory here) “The Prime Minister of Great Britain has nothing to hide from the President of the United States.” I dont think it had the effect Churchill would have hoped. Although Roosevelt made sure to get along well with Churchill, he admitted in private that he had never really liked him. Roosevelt had met Churchill in the first world war (which Churchill had long since forgotten). Roosevelt’s private comments on the episode were that Churchill had been a “Stinker…Lording it all over us”. I gather from this that Churchill was probably very high handed & arrogant in his younger WW1 days, which is probably why he was so disliked by other politicians from that period. Churchill, no doubt, was mystified as to why Roosevelt, though friendly, was not always so brotherly, and would remain so throughout the war. ",
            "date": "Answered February 22, 2020",
            "views": "223",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Nicki Hansen",
                    "user_href": "/profile/Nicki-Hansen-6"
                }
            ]
        }
    ]
}