{
    "title": "Why did Outer Mongolia become independent after the Republic of China (ROC) withdrew from China, while Tibet, except for southern Tibet, is still under Chinese leadership? - Quora",
    "tags": [
        "People's Republic of China (PRC)",
        "Tibet",
        "Mongolia",
        "Independence",
        "Foreign Policy of China",
        "Taiwan",
        "History of China",
        "Politics of China",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bertrand Fang",
                "href": "/profile/Bertrand-Fang"
            },
            "answer_text": "That reference map is incorrect about Taiwan and Outer Mongolia: According to the 1943 Cairo Declaration by President Roosevelt, Generalissimo Chiang Kai-Shek and Prime Minister Churchill: “It is their purpose that Japan, shall be stripped of all the islands in the Pacific which she has seized or occupied since the beginning of the first World War in 1914, and that all the territories Japan has stolen from the Chinese, such as Manchuria, Formosa, and the Pescadores, shall be restored to the Republic of China”.Outer Mongolia was de factor Independent under Soviet protection by 1928, although without the consent of the Republic of China. At the infamous 1945 Yalta Conference, Stalin demanded the recognition of Mongolian independence by Roosevelt and Churchill. China was given the fait accompli without being present at that conference. As a face-saving gesture, the Republic of China negotiated a ‘friendship treaty’ with the Soviets in 1945 that, among some other matters, China agreed to have Mongolian people vote about the issue of independence. The Chinese foreign minister T. V. Song knew this would not be viewed favorably by future Chinese historians, would not sign the treaty, and had another officer, Mr. Wang signed it. Of course, an overwhelming majority of Mongolians voted for independence. Thus legally the Republic of China recognized Mongolian independence. It was only after moving to Taiwan that Chiang Kai-Shek rescinded that Treaty. PRC probably recognized it was futile and too late to claim sovereignty over Outer Mongolia.",
            "date": "Answered October 20, 2020",
            "views": "147",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Wu",
                    "user_href": "/profile/Mike-Wu-62"
                },
                {
                    "user_id": "Thomas Francis",
                    "user_href": "/profile/Thomas-Francis-49"
                },
                {
                    "user_id": "Zane Liu",
                    "user_href": "/profile/Zane-Liu-12"
                },
                {
                    "user_id": "Andrew Chang",
                    "user_href": "/profile/Andrew-Chang-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Chiu",
                "href": "/profile/Alan-Chiu-10"
            },
            "answer_text": "Mongolia independence was supported by USSR, and both KMT and CCP wanted the cooperation of USSR. Tibet is not a neighbor of USSR, so USSR is not interested in having Tibet as a buffer region. Though British India is a neighbor of Tibet, Britain was more interested in protecting its interest in China and wouldn’t want to fight China over Tibet independence. Therefore though Tibet expelled Chinese influence from Tibet in 1913, it never got diplomatic recognition from major powers. CCP was therefore free to invade Tibet after it came into power. ",
            "date": "Answered October 20, 2020",
            "views": "138",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Serhat Yanıkoğlu",
                    "user_href": "/profile/Serhat-Yanıkoğlu"
                },
                {
                    "user_id": "Jopan Sheng",
                    "user_href": "/profile/Jopan-Sheng"
                }
            ]
        }
    ]
}