{
    "title": "Why are sweet potatoes always more expensive than regular potatoes? - Quora",
    "tags": [
        "Economies of Scale",
        "Yams & Sweet Potatoes",
        "Potatoes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hugh Durden",
                "href": "/profile/Hugh-Durden"
            },
            "answer_text": "The simplest answer is that sweet potatoes AREN'T always more expensive. I suspect that the questioner is of a certain age and from somewhere that sweet potatoes were once thought of as \"poor-people food,\" as am I. As a result, this old Louisiana boy is always shocked and appalled when he sees big red yams at Kroger for $1/lb and big Idaho russets for $.60/lb. When sweet potatoes show up for $.33/lb. I notice and I buy them, but what always stands out in my mind is when the cheap food, like sweet potatoes and catfish and crabs, are expensive. It's just not the way things are sposed-to-be. As for why, well, basic economics. And, yes, I haven't seen cheap catfish or crabs in a long, long time, but I'm just that old. ",
            "date": "Answered April 8, 2019",
            "views": "910",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Xico Acosta",
                    "user_href": "/profile/Xico-Acosta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Gordon",
                "href": "/profile/Jim-Gordon"
            },
            "answer_text": "Why are sweet potatoes always more expensive than regular potatoes?  Sweet potatoes or yams or boniatos are more expensive than potatoes in countries where white/gold/blue potatoes are grown in huge quantities. Demand for sweet potatoes is irregular and inconstant, higher in some holiday seasons. Food logistic system operators like high-volume products with steady demand, because the purveyors can bring their costs down while selling to the mass of consumers who routinely prefer the white potatoes. The question’s premise isn’t ALWAYS true. In some climates and locations, sweet potatoes grow better and last longer than the tender white/gold/etc varieties, and the latter cost more to raise and transport and warehouse than the sweet potatoes. ",
            "date": "Answered June 28, 2017",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nicole Koch",
                    "user_href": "/profile/Nicole-Koch-2"
                },
                {
                    "user_id": "Noah Noel",
                    "user_href": "/profile/Noah-Noel-1"
                },
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                }
            ]
        }
    ]
}