{
    "title": "Why are things more expensive when they are old? - Quora",
    "tags": [
        "Antiques",
        "Pricing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grant Miller",
                "href": "/profile/Grant-Miller-52"
            },
            "answer_text": "Age alone does not determine value. It may play a role in determining value but is never the only factor. An item’s value is contingent on two things: supply and demand. Some years ago, a client of mine had roughly 40 pre-Colombian artifacts, mostly vessels and objects d’art all dating from 1492 or earlier. Their age was confirmed by scientific analysis. Altogether I valued the collection at less than $5,000. My valuation was based on where comparable pieces had sold in recent years on the secondary market. One might think the item’s would have greater value considering their age and the limited supply on today’s market. But there was also a fairly limited demand for such items, keeping sales prices in check. I don’t think I valued any one item for more than $600.  ",
            "date": "Answered March 10, 2019",
            "views": "843",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Kahn",
                "href": "/profile/Martin-Kahn-2"
            },
            "answer_text": "There is no hard and fast rule, and tastes change all the time. If you watch Antiques Roadshow on PBS, you will see what I mean. At the same time, having a trained, experienced, discerning eye can enable you to identify the Antiques of the 22nd Century now. An example of that is LaVerne tables, which were made in small quantities about 40 years ago, and are already being prized by collectors. That was one I nailed. but as I say, there “ain’t no equation”. ",
            "date": "Answered January 21, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farook Ajose",
                    "user_href": "/profile/Farook-Ajose"
                }
            ]
        }
    ]
}