{
    "title": "Why does Russia hate the United States of America? - Quora",
    "tags": [
        "Russia and the United States of America",
        "Hate",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Troy Williams",
                "href": "/profile/Troy-Williams-29"
            },
            "answer_text": "I don't believe “hate” is the correct word. Envy would be a better choice. Russia has always been sort of the redheaded step child of the “first world” while America has been the “golden boy” since WWI. The Russian economy has never lived up to the promise of Marx, while the American’s thrived in complete contradiction to Marx and the Soviet leader’s predictions. World War II was a horrible, tragic event for the Soviets. Their country was wrecked by the invading Germans. They suffered horrendous casualties both on the battle field and in civilian areas. America, however, was virtually untouched and received the credit for victory over the Nazis. During the Cold War era, Russia was really only at the table because of her military might which, while large, was mostly about her atomic weapons. She never developed a true blue water navy that could challenge the American preeminence and lagged behind in almost every technological area compared to the west and especially America. The deficit militarially was brutally demonstrated by the first Gulf War when America’s technological edge was displayed for the entire world against Soviet weapons, which at the time, were first line systems. I suppose the world treats Russia a bit like that brutish neighbor who thinks he is cultured but is looked down upon with a bit of pity by everyone else. Russia realizes this and is constantly struggling to prove they really are better. Their attempts are generally on the brute force side so they make no progress toward their goal of actual acceptance by the West. ",
            "date": "Answered March 16, 2017",
            "views": "36",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Loki Rorikstead",
                    "user_href": "/profile/Loki-Rorikstead-1"
                },
                {
                    "user_id": "Radnaa Bayarsaikhan",
                    "user_href": "/profile/Radnaa-Bayarsaikhan"
                },
                {
                    "user_id": "Katharina Blehm",
                    "user_href": "/profile/Katharina-Blehm"
                },
                {
                    "user_id": "Anastasia Maximova",
                    "user_href": "/profile/Anastasia-Maximova-1"
                },
                {
                    "user_id": "Prajwal Chilap",
                    "user_href": "/profile/Prajwal-Chilap"
                },
                {
                    "user_id": "Jan Stubbs",
                    "user_href": "/profile/Jan-Stubbs"
                },
                {
                    "user_id": "Ben Ellis",
                    "user_href": "/profile/Ben-Ellis-90"
                },
                {
                    "user_id": "Henrique Morais",
                    "user_href": "/profile/Henrique-Morais-4"
                },
                {
                    "user_id": "Elise Chevalier",
                    "user_href": "/profile/Elise-Chevalier-2"
                },
                {
                    "user_id": "Luis Almeira",
                    "user_href": "/profile/Luis-Almeira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harrold Johnson",
                "href": "/profile/Harrold-Johnson"
            },
            "answer_text": "Au contraire. Russia does not hate the United States. Judging by Russia’s action of hacking Hillary’s private bathroom server, it should be obvious they love America by exposing the truth about Hillary’s illegal activity. They could easily have helped the American Media cover up Hillary’s deceitfulness, and stayed silent which may have resulted in Crooked Hillary becoming President. The Russians exposing the truth prevented that disaster. The Russians are actually more patriotic than the American media. They saw illegal activity and they made sure Americans knew about it. The American media tried to seeep Hillary’s crimes under the rug. I trust the Russians way more than the Libs and leftists in America. Russia didn't say anything bad about America. They simply provided the verbatim truth. No distortion of the facts. No opinions. No innuendo. Wow. Wouldn't it be great if CNN and MSNBC reported the news like the Russians? Just the facts, Jack! ",
            "date": "Answered August 11, 2017",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luke David",
                    "user_href": "/profile/Luke-David-67"
                },
                {
                    "user_id": "Blake Johnson",
                    "user_href": "/profile/Blake-Johnson-172"
                },
                {
                    "user_id": "Irina Kovalevich",
                    "user_href": "/profile/Irina-Kovalevich"
                }
            ]
        }
    ]
}