{
    "title": "Why couldn't capitalism and communism coexist? - Quora",
    "tags": [
        "Economic History",
        "Political Philosophy",
        "Economic Policy",
        "Capitalism",
        "Socialism",
        "Communism",
        "Political Science",
        "Government",
        "Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Johnson",
                "href": "/profile/Brian-Johnson-429"
            },
            "answer_text": "Communism/socialism has never been tried. What happened in the USSR was state capitalism not communism/socialism. The rivalry of the Cold War period between East and West was over the dominance of the global market. Their ideological differences served as a facade for economic imperialism. Capitalism and communism have no comparison with one another, for they are two totally different versions of producing the means of living which we all depend on in order to survive. Capitalism is a system of commodity production for profit, whereas communism is production for use and free access to human needs. They are as different has chalk and cheese on the ownership of the means of production: in capitalism the social relationship of private property determines where we live, how we live and where we work; in socialism Common Ownership of the means of living - not to be misconstrued with public or social ownership - allows the voluntary associated producers to determine where they live, how they live and where they work. Capitalism is not dependent on a democratic framework for the profit system can function equally well in a dictatorship. But the concept of democracy becomes meaningless when the means of living are owned and controlled by a wealthy minority. Socialism will be a global society based on the common ownership and democratic control of the world’s natural and industrial resources. But how might this work? How will production, decision-making and culture be affected? Production There will be a complete transformation in the calculation of resources, and their production and distribution. In capitalism articles of wealth (commodities) are produced to be bought and sold on markets, at a profit. This trade in commodities generates: waste; pollution and externalities; overproduction and under -production; built-in obsolescence; quantity over quality; crisis and booms; poverty amidst plenty; employment for some and a waste in human potential for most; and obscene wealth for the few. With no commodity production and trade there will be no exchange value and prices, just the inputs and outputs of resources and human needs. The decision-making process will aim to ensure there’s sufficient stock control to meet projected needs through calculation in kind. This decision-making process will also configure: environmental impact assessments; a high standard of quality control and durability; positive recycling - where products will be deliberately designed so to ensure that they last longer and when they are passed their usefulness all their component parts are easily recycled into other useful products; and transportation miles for distribution of human needs so the shortest journey possible is covered. This efficiency of calculation will ensure the energy required for producing needs will be kept to a minimum and promote the production of renewable energy sources. Decision-making Here the system will be participatory delegate democracy. In capitalism political parties represent the sectional interests within the capitalist class with all of them competing for political control of the state and its machinery of government. With no sectional interests to be represented when there is common ownership, there won’t be political parties or a state machinery. Nonetheless, major issues will be thrashed out with decisions being made on what’s the best course of action for gaining a successful outcome. A bottom up decision-making process involving voluntary participation cannot be imposed by a hierarchy or a vanguard or the concept becomes meaningless. The basic building block is the community or neighbourhood assembly, face-to-face meetings where citizens meet to discuss and vote on the issues of the day, not that there will need to be a vote on every issue as most of day-to-day work carried out will be routine. These assemblies elect mandated and recallable delegates who then link with other assemblies forming a confederated council, a 'community of communities'. The difference between this form of delegate democracy and our current form of representative democracy is that in a representative democracy power is given wholesale to the representative who then is free to act on their own initiative. In a delegate democracy the initiative is set by the electing body and the delegate can be recalled at any time should the electing body feel that their mandate is not being met, thus power remains at the base. Culture Due to the impact of common ownership on the global community there’ll be even more of an increase in cultural choices and options than there is under capitalism. Unrestricted to the social conformity of private property relationships, individuals and communities will be able to focus on an ongoing celebration of freedom of expression - leading to an increase in cultural diversity. Leisure activities are likely to increase in scope and decrease in size. Presently, with package holidays the most affordable way of taking a break from the drudgery and monotony of the production line or the office, they are the most popular form of holiday. In socialism, where the principle of free access underpins the common ownership of the means of living, our options and choices on travel and holidays would be extended and influenced by what positive contribution we can make to the country we are visiting. And with package holidays and mass tourism a thing of the past, it is likely holidays in socialism would not be restricted within a timescale of 10 to 14 days of hectic hedonism, but transformed into an unique opportunity to stay in a particular location for as long as it takes to understand the history and culture of that region. In effect the transformation in the social relationships from private property ownership to common ownership will radically alter our perception of culture, leisure and travel. Human nature But wouldn’t all this be against human nature? No. Socialists make a distinction between human nature and human behaviour. That people are able to think and act is a fact of biological and social development (human nature), but how they think and act is the result of historically specific social conditions (human behaviour). Human nature changes, if at all, over vast periods of time; human behaviour changes according to changed social conditions. Capitalism being essentially competitive and predatory, produces vicious, competitive ways of thinking and acting. But we humans are able to change our society and adapt our behaviour, and there is no reason why our rational desire for human wellbeing and happiness should not allow us to establish and run a society based on co-operation. Needs have a physiological and a historical dimension. Basic physiological needs derive from our human nature (e.g. food, clothing and shelter), but historically conditioned needs derive from developments in the forces of production. In capitalism, needs are manipulated by the imperative to sell commodities and accumulate capital; basic physiological needs then take the historically conditioned form of ‘needs’ for whatever the capitalists can sell us. Social evolution suggests that no mode of production is cast in stone and the dynamics of change also affects capitalism as a social system. Studies of social systems with distinct social relationships related and corresponding to their specific mode of production have identified, for instance, primitive communism, chattel slavery, feudalism, and capitalism. All of these societies changed from one into another due to the contradictions inherent in that society and also due to technological advancement which each society found itself incapable of adapting to. Capitalism reached this point over a century ago. It’s time to move on to socialism. http://www.worldsocialism.org/sp... ",
            "date": "Answered October 24, 2016",
            "views": "46",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Santino Colombo",
                    "user_href": "/profile/Santino-Colombo-1"
                },
                {
                    "user_id": "Erran Yearty",
                    "user_href": "/profile/Erran-Yearty"
                },
                {
                    "user_id": "Rebecca M. Phaedra-Whitlock",
                    "user_href": "/profile/Rebecca-M-Phaedra-Whitlock"
                },
                {
                    "user_id": "Malcolm Ng",
                    "user_href": "/profile/Malcolm-Ng"
                },
                {
                    "user_id": "George Evans",
                    "user_href": "/profile/George-Evans-27"
                },
                {
                    "user_id": "Alan Johnstone",
                    "user_href": "/profile/Alan-Johnstone-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/R-B-Galker"
                },
                {
                    "user_id": "Ian Rae",
                    "user_href": "/profile/Ian-Rae-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Sheridan",
                "href": "/profile/William-Sheridan-17"
            },
            "answer_text": "First, the form of Communism we are all aware of is the 2nd stage to the path to Anarchy. The Stage is called Socialism. The reason they cannot coexist is when the government has or asserts the right to take ownership or control of businesses and industries, even a small level, then the rest of the economy remaining private (Capitalism) must bow to the Party and change their system from the tenents of Capitalism to snuggling up with the Socialist Party Leadership. Many call that Krupping as the Krupps were assigned by Hitler to cartelize and lead the Steel , Iron and related businesses as an Industry to be run by the State. Private ownership remained, but all rights of ownership resided in the government. That system is called Corporatism and was the preference of FDR and Obama. Obama did succeed in direct Nationalization of the New GM but failed to fully get control of the Healthcare, Energy, Banking, Finance, Agriculture, Media, Entertainment and Internet / Tech industries. However companies in those Industries are now rightly concerned about the chance of Trump and Republicans being overtrown or voted out and the Socialists take the country. It pays to wait on certain investments now and for sure, you want to suck up to the Democratic Party or risk future punishment. In El Paso, some Democrat Politician listed all the businesses that donated to the Trump campaign or are Republican leaning so that the Nue Fascist party can boycott them like they did the Jews in the 30s Germany. ",
            "date": "Answered August 7, 2019",
            "views": "750",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dániel Kőszegi",
                    "user_href": "/profile/Dániel-Kőszegi"
                },
                {
                    "user_id": "Dov Shmuel Freedman",
                    "user_href": "/profile/Dov-Shmuel-Freedman"
                }
            ]
        }
    ]
}