{
    "title": "Why do Spain and Portugal always seem to get a pass on the millions they murdered and enslaved in Mexico, Central, and South America? - Quora",
    "tags": [
        "Central America",
        "South America",
        "Portugal",
        "Spain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Albert Cornelius Doyle",
                "href": "/profile/Albert-Cornelius-Doyle"
            },
            "answer_text": "Good question, and I’m not sure Spain truly gets a pass, but Portugal definitely does. Interbreeding is the most likely suspect. The Anglo genocides in the North were aimed at wiping out entire populations, and appropriating their lands for invader farms. A great many came with their wives and kids, so were not interested in taking indigenous wives. Additionally the massacres were largely justified with a dehumanizing of the indigenous, even if they were willing to convert to Christianity. Once you had rendered them sub-human in the Anglo mind, massacring them was no different from shooting bison with repeating rifles from moving trains, just for the sport of killing. In Mexico, on the other hand, most of the early invaders were single men seeking their fortunes, either in the mines or by creating fruit and sugar cane plantations, forcing the natives into monoculture or slavery. But the Dominicans and Franciscans and Benedictines, and most particularly the Jesuits, were rather insistent that after conversions, they should no longer be worked to death, nor beaten too severely. The Vatican got so annoyed with the Jesuits’ lenience that it expelled them all from the New World in the 1760s. And the young men were of course interbreeding, whether through mutual understanding or rape. Within a few generations there were more mestizos than either Spaniards or indigenous, pretty much from the Yucatan on up through San Francisco. Spanish from Spain treated everyone shabbily up through independence. People born in New Spain from two Spanish parents (criollos, or creoles) were treated as almost equal to a Spaniard born in Spain, but not quite, so of course they looked down on the mestizos, who looked down on the pure indigenous. Mestizos were granted essentially full rights after Independence, and more rights codified during La Reforma, but were still second class citizens well into the 20th century. And the indigenous still get the shaft. But since the late 1950s/early 1960s, no Mexican has claimed “I am of pure Spanish blood”, firstly because virtually none are, and secondly you really sound like an asshole. Kind of like if some gringo from Boston or New York went on and on in a Thurston Howell III accent about how his family was in the Social Register or she was a debutante. But essentially every Mexican shares Spanish and indigenous ancestry. In El Norte, over 90 percent of the Anglos who claim native roots are wrong, DNA tests prove it, their ancestors were forced to lie, and what they really have is African ancestry. But there was less shame in Dixie if Grampa was a Cherokee than if he was a former slave. Mexico’s first great leader was Benito Juarez, a full-blood Zapotec. Can you imagine Anglos ever voting for Sitting Bull or Crazy Horse??? Finally, Spain has left Mexico pretty much alone since Independence, whereas Anglos have continued to regularly break treaties, shunt the indigenous off onto poorer and poorer lands, until we discover oil or metals there, then kick them off again. In the same way we still treat our former slaves like shit. So it’s less easy to forgive your erstwhile oppressor if he’s still oppressing you. ",
            "date": "Answered June 28, 2018",
            "views": "2",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carlos C. Salazar",
                    "user_href": "/profile/Carlos-C-Salazar"
                },
                {
                    "user_id": "Eddi Ferry",
                    "user_href": "/profile/Eddi-Ferry"
                },
                {
                    "user_id": "Martín-Blas Pérez Pinilla",
                    "user_href": "/profile/Martín-Blas-Pérez-Pinilla"
                },
                {
                    "user_id": "Subhrangshu Chakraborty",
                    "user_href": "/profile/Subhrangshu-Chakraborty-6"
                },
                {
                    "user_id": "Marcos Iglesias Valle",
                    "user_href": "/profile/Marcos-Iglesias-Valle"
                },
                {
                    "user_id": "Yannick Nelama",
                    "user_href": "/profile/Yannick-Nelama"
                },
                {
                    "user_id": "Johnny Hernandez",
                    "user_href": "/profile/Johnny-Hernandez-122"
                },
                {
                    "user_id": "David Carballo",
                    "user_href": "/profile/David-Carballo-3"
                },
                {
                    "user_id": "Monsour Palmeira",
                    "user_href": "/profile/Monsour-Palmeira"
                },
                {
                    "user_id": "Dallas Manning",
                    "user_href": "/profile/Dallas-Manning-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ozgur Zeren",
                "href": "/profile/Ozgur-Zeren"
            },
            "answer_text": "That’s because in contrast to Anglo establishment propaganda, they didn’t do any such genocide, enslavement or repression as incessantly advocated in Anglosphere. Especially Spain: In 1512, Fernando II signed a decree which declared Native americans as ‘free men’, and mandated that they would be paid a fair wage for any job they were employed in. (Laws of Burgos) This happened even before first reports of wide scale and systematic maltreatment of Natives started to come in. At this point remember that Columbus himself had been recalled and died in disgrace and poverty as a result of maltreatment of natives during his stint. It wasn't Cortez and his men who massacred the ~200,000 Aztecs when Tenochtitlan was conquered by ~1000 Spaniards and their ~80,000 Native american allies - it was their allies. People whose relatives, even family members were taken as tribute by Aztecs and were massacred or were eaten in ritual slaughter, or were kept as food stock to be eaten in famines. These people didn't have any mercy for their Aztec compatriots. It’s questionable whether Cortez and his men would want to stop their allies after knowing what Aztecs did to them, and its totally questionable that they could. When Cortez was recalled back to Spain in 1528, the remaining colonial administrator, Guzman, engages in pillaging, enslavement and wars against the native american populations. Then Cortez returns with a bunch of judges. Spanish had been insisting that natives keep written records of history, which they were not doing until then. The first written records which the natives created during Guzman’s stint are used as evidence against him and native americans testify as witnesses in court for his crimes. Court condemns and sentences Guzman, who is sent back to Spain in chains as a traitor and enemy of the crown for his crimes against native americans. One of the judges not only rails against slavery of natives in his reports to the Spanish crown, but also proceeds to repair and rebuild the native communities with his own money. He sets up advanced communities in which native americans are taught European technical skills, but their native culture is preserved. They rule themselves and are called “Republicas de Indios”. To top that, In 1542, a Spanish humanist, las Casas, succeeded in persuading Spanish court, nobility and clergy that Indians could not be treated as subhumans and could not be subjected to slavery, based on humanitarian arguments, leading to Native Americans to be declared Spanish subjects with equal standing with Spaniards. (New Laws) This is a major feat, since such a result could only come with broad agreement of crown, top nobility, and the clergy, not just the crown itself. This means that the majority of the Spanish establishment agreed with these humanist arguments. Bartolomé de las Casas Again, in 1550, he won another debate against private interests who were arguing that Natives were subhuman and therefore needed ‘masters’ to ‘civilize’. Local nobility and establishment tried to circumvent these decrees to the extent they could, to exploit and prosper at the expense of Natives, rebelled against the New Laws under the leadership Pizzaro’s half-brother Gonzalo Pizzaro who ruled major regions as a noble, but then this led to Spanish crown recalling then appointed viceroy and sending a viceroy who was specifically tasked with implementing these laws, who beat Pizzaro and executed him. Even if the crown was not able to fully assert all the laws it issued due to resistance from local nobility, it still succeeded in granting immense protections, rights and comparable equality for its native subjects. As a result, there are 6 million~ pure blooded Incans today, Native Americans are either majority in numerous South American countries or constitute significant segments inside the population in others, and there are entire races of mixed European-Native ancestry which we call Mexicans and other South Americans. Compare this to North America, where someone is counted ‘Native american’ if s/he has 1/40 native american blood, solely because Anglo establishment eradicated an entire continent. Such arguments as las Casas made were unimaginable in Anglosphere. There wasnt even such an ongoing debate - native americans were non-human, and because they weren’t even good for using as slaves (they knew the land and escaped), it was better to totally eradicate them. This fit in totally with the agenda of chartered colonization companies because it maximized their profit, and English crown, because it maximized the share it got from those profits and the trade. But, it wasn’t only las Casas who was in contrast with the Anglo-literature propaganda that goes back to Elizabethan age. Spanish actions and deeds in South America from the start spark a large contrast to what is claimed by that literature: 1 - Brutal conquistadors They were only ~300–500 people. As any student of history would know, 300 people can never conquer an entire continent. Even if they were actually brutal. The reality is that it was Spanish conquistadors and their Indian allies who conquered the Aztec. In the last pitched battles, Aztec army numbered towards 100,000~, and the alliance army that fought them also numbered around the same 100,000~ mark. Spanish was just a part of that army, and they were leading the army as the alliance leaders. And, they did it spectacularly well, through strategy, diplomacy and all the traits which the Anglo-literature deprives them of; for it takes a lot of diplomatic skill to lead hundreds of different tribes which had numerous enmities among themselves that go back to hundreds of years and unite them in a cohesive military operation. By the way, Europe has never seen any military operation that big like these ones from ancient Rome to Early Modern Age. It is a major feat in many ways. There was a factor which united all these tribes and allied them with the Spanish: their hatred of Aztecs. Aztecs, who were yearly sacrificing up to ~100,000 people empire wide, including children. As you can understand, after a hundred or so years of having your youth, women, children murdered in altars, camaraderie towards the fellow natives who rule you goes out of the window. As such, many local tribes and kingdoms were utterly hating the Aztec with their guts. The brutality which a segment of Aztec population was subjected to after the fall of their empire, therefore, becomes very easy to understand - it wasnt something that was propagated by the ~300–500 conquistadors, it would necessitate hundreds of thousands of people seeking revenge for their people slaughtered in the altars. 2 - Spanish treatment of Natives In contrast to what Anglo-sphere used to do with natives, seeing them as non-human and treating them as such, Spanish treated them as equals: Conquistadors immediately started marrying into native nobility to establish legitimacy as rulers. This is something unthinkable in Anglosphere. Incidentally it is the start of today’s mestizo (mixed) races in South America.Combined with decree of 1512 which declared Native Americans as free men, conquistadors marrying into the nobility from the start, and especially later laws declaring Native Americans as Spanish subjects, marriage in between Spaniards and natives was not only now legal, but also socially acceptable. As a result, today we have a country called Mexico which is populated by 125 million people, all of which are either mestizos or totally/partially pure blooded Native Americans. There is no such phenomenon in North America, where Native Americans were actually eradicated.While native american kingdoms’ top governance was replaced with a viceroy, many kingdoms and their administration were left intact. Conquistadors and early viceroys only changed top administration, though middle level administration were also replaced by Spaniards or Mestizos in later times, majority of Native American culture, institutions and governance were kept.So much that Spanish crown granted autonomy to major tribes which allied with them. These Indian kingdoms were subject to Spanish crown in foreign policy, but totally independent in their internal affairs. This went on until early 19th century.Natives and Mestizos consisted part of Spanish empire’s institutions, ranging from its bureaucracy in New Spain to even its navy: The biggest, most successful privateer in history isn’t Drake, Kidd or Hawkins, it is a mestizo, Miguel Enríquez, who was such a successful privateer that he operated a fleet of 300 ships at the top of his career, and he was ennobled for his deeds. He was awarded with various medals and exceptions for his service, and his fleet was also functioning as a courier network for Spanish crown. The impact of Miguel on merchant and naval power of the other powers in the region was such that it is said Spanish king stated that he only needed a few more people like Enrique and he wouldn’t need a navy.Aside from the early plagues brought from Europe, no native population under Spain’s control risked eradication or ethnic cleansing: The native populations of western and south western North America started to disappear only after they came under Anglosphere domination through United States, whereas they did not suffer any such genocide during Spanish or Mexican rule. Same applies to the native peoples in central North America, under French rule.3 - Spanish treatment of New Spain Spanish declared and treated New Spain as a part of Spain. Not as a colony, or a land to exploit. Over 23 universities were opened in New Spain, which were open to Native Americans. With first university being founded in 1538.In 1580, by the order of Spanish Crown, Indigenous languages departments were set up in Mexico and Lima universities, with the purpose of studying and teaching of indigenous languages. Indigenous languages were not only kept, but also studied and taught extensively.Even as late as early 19th century, Spain was still spending tax revenue on infrastructure building in New Spain, building it up as a part of Spain itself - buildings, roads, bridges and whatever you may pick. Doing as such instead of solely exploiting and sucking the land dry like English colonizers did, was a major factor in weakening of the Spanish power since it drained funds from the crown’s coffers.……….. There are many other sub-topics which can be examined here, however these main points go beyond the needed arguments which would explain the great disparage in between actual historical reality and Anglosphere-propagated narrative. Why is there such a narrative in Anglosphere? Simply because of the fact that when Elizabethan establishment tried the ‘Look how evil they are, look how we are the torch bearers of freedom’ propaganda to legitimize their political position and interests and vilify their enemy, it worked. And as you have possibly immediately noticed, this propaganda mechanic stayed exactly the same throughout 500 years, and it is still employed by the Anglosphere establishment today - ranging from invasions in Middle East to economic/clandestine warfare against any targeted country. The propaganda, as you can judge from recent history, is effective both abroad and at home - it easily persuades the citizens of its own country that they are ‘the good guys’, due to the tendency in mankind to be on the good side, and abroad it easily instills doubt about and even successes in vilifying the targeted country. Naturally, those who grow up in Anglosphere or Anglosphere-influenced countries with a never-ending torrent of ‘we are the good guys, they are the bad guys’ in every topic of history including the colonization era, grow up with a view of reality that is practically manufactured at the expense of actual history. And naturally these people find ‘outrageous acts’ of the rival establishments as things that require justice, but the civilization-scale genocidal acts of their own establishment as ‘mistakes’, or just ‘happenings’. Like how majority of North American native american populations have stayed virtually intact under the rule of French, Spanish and Mexican establishments for ~300 years and did not get wiped out by epidemics, but they suddenly started suffering epidemics which wiped them out when they fell under United States rule… An epidemic, indeed, but not an epidemic of the biological kind. Nice Day for a Genocide: Shocking Quotes on Indians By US Leaders, \n - IndianCountryToday.com  This historical information by no means justifies or rationalizes conquest of New World… By Spain, Portugal or anyone else… Conquest cannot be justified - if some ‘superior’ alien civilization would attempt to conquer you today, ‘for your own good’ , you would resist with all you have. As a result this information does not support any ultra-nationalist or extremist viewpoint. Neither it can be used for such purposes in any way. What it does is to just set the historical record straight to free it from extreme bias of a particular establishment. ",
            "date": "Updated December 17, 2019",
            "views": "206",
            "upvotes": " View 715 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Larregla Del Palacio",
                    "user_href": "/profile/Miguel-Larregla-Del-Palacio"
                },
                {
                    "user_id": "Álvaro Pacheco da Silva",
                    "user_href": "/profile/Álvaro-Pacheco-da-Silva"
                },
                {
                    "user_id": "Lizajoy Morales",
                    "user_href": "/profile/Lizajoy-Morales"
                },
                {
                    "user_id": "Eddi Ferry",
                    "user_href": "/profile/Eddi-Ferry"
                },
                {
                    "user_id": "Anaeksuk Saraesin",
                    "user_href": "/profile/Anaeksuk-Saraesin"
                },
                {
                    "user_id": "José Castro",
                    "user_href": "/profile/José-Castro-17-1"
                },
                {
                    "user_id": "Jaeson Monteiro",
                    "user_href": "/profile/Jaeson-Monteiro"
                },
                {
                    "user_id": "Nico Neira",
                    "user_href": "/profile/Nico-Neira"
                },
                {
                    "user_id": "B M",
                    "user_href": "/profile/B-M-750"
                },
                {
                    "user_id": "Ade Omotayo",
                    "user_href": "/profile/Ade-Omotayo"
                }
            ]
        }
    ]
}