{
    "title": "Why is the Gregorian calendar accepted worldwide? - Quora",
    "tags": [
        "Gregorian Calendar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ram Narayan",
                "href": "/profile/Ram-Narayan-1"
            },
            "answer_text": "Thank you Vedansh Seth for the A2A The Gregorian calendar is used because Winner takes all. Usually, history is witness to the fact that wars are often fought and invasions undertaken with a certain level of “cultural domination” in mind. When Columbus conquered America, he had FIVE million natives summarily killed, their native literature and practices almost entirely eliminated, and supplanted it with Spanish culture, religion and practices. Tell me, which entirely native tradition or practice of the natives survives in Latin America to this day? A handful if at all. Contrast That with how rigidly Christian That territory is now. That is simply because our man believed his native land was so great he had to replicate it elsewhere! When the Mughals conquered India, the court language was declared to be Farsi and the official calendar the Muslim Hijra calendar, with a small allowance made for the solar calendar to allow natives to plan for and pay agricultural taxes. It was just the Turkic/Iranian Muslim invaders trying to impose their way of life on the natives, and by the sword When the British started conquering the world they did it with the traditional European hubris, that their variant of every single thing was the best in the world, and the others were useless. They did the same with traditional Indian practices, ridiculing the ones they found troublesome to their mission of conquering India (demonizing Hinduism was part of it), and banning the useful ones (the travelling mendincants who had the small pox needles, a form of vaccination long before it was passed off as an invention of the West!). Contempt for Indian calendars, festivals and practices, and differentiating it from “uncouth, heathen cultures” was part of it. In the early Christian years, they took a lot of Jewish traditions and added their flavours to it, to set themselves apart. One prominent example is the shifting of the weekly holiday from Saturday (the Jewish day of Sabbath) to Sunday (which in reality was a pagan veneration day of the Sun, passed off as Son worship, referencing the Son of God story!) This just extended to demonizing and banning the native calendar wherever they went! It was also them imposing administratively what THEY followed, and asking natives to follow. Why would u go all the way to a new land, loot and plunder it thereby imposing your domination on them, only to mingle with the natives? You'd rather have the natives follow YOUR way of life. The British did that all over the world, partly by propaganda and largely by force. They just happened to hold 3/4 of the world's inhabited landmass at one point So it was just a natural course of action they would impose that calendar on their conquered lands. It became a world standard in course of time because most of these conquered lands were already following the Gregorian calendar administratively. The Gregorian calendar was used as it waa a Roman hand-down that then mixed supposed dates in Christian theology, sanctified by the church. That explains why when Britain was all conquering, France, Germany and Spain used it too. It flowed from instructions issued from the Church of Rome. While the Gregorian calendar is extensively used, it is by no means universal. The Russian Orthodox Church uses the Julian Calendar which is 11 days behind! This resulted in the Russian Olympic team arriving in St Louis, USA for the 1904 competition 11 days later!! China is a prominent example of this ethnic pride. So much so, in China, YOU are the one who has to work out thr Gregorian date u are used to, using the traditional Chinese dates they use. There is very less usage of Georgian systems. Many Islamic countries use the lunar Hejira Islamic calendar, even officially, as being theocracies, local holidays and observances are bound by that. They also have a Friday weekly off instead of Sunday due to the same reason. Iran uses the Shamsi Islamic Calendar, a solar calendar based on traditional pagan Persian usage. Many countries that were under such occupation by European Colonial Powers have since dumped the Gregorian calendar for local ones - for example UAE. But doing that would make India “unscientific and “superstitious”. We even have some characters who think India didn't even have a calendar until the Brits gave them one! Ram Narayan's answer to How were dates calculated, and kept, in ancient India before the widespread awareness of Christianity? Look at the tone and tenor of the question, clearly suggesting they thought noone knew how to date things before Christianity came along! By the way, as recent as a hundred and fifty years ago, our government offices had a fortnightly off not a weekly off. Those were on amavasya, and pournami (no moon and full moon days), easily trackable as people would need time off on those days for observances like the tarpana on the Amavasya day for their forefathers! All that got abrogated when the Brits imposed a Calendar. And what are we left with? “Rationalist” government officers who search for and deduct half day wages for employees who clock in an hour late after the Avani Avittam ceremonies! Oh, the wonders of a secularised Calendar! ",
            "date": "Answered July 13, 2017",
            "views": "18",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DIVYASHREE NAYAK",
                    "user_href": "/profile/DIVYASHREE-NAYAK-4"
                },
                {
                    "user_id": "Shiva Chandar",
                    "user_href": "/profile/Shiva-Chandar"
                },
                {
                    "user_id": "Pratip Vijayakumar",
                    "user_href": "/profile/பிரதீப்-விஜயகுமார்-Pratip-Vijayakumar"
                },
                {
                    "user_id": "Kirti Neotia",
                    "user_href": "/profile/Kirti-Neotia"
                },
                {
                    "user_id": "Visali Krishnan",
                    "user_href": "/profile/Visali-Krishnan-1"
                },
                {
                    "user_id": "Venkatesh Rathnam",
                    "user_href": "/profile/Venkatesh-Rathnam-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Purvis",
                "href": "/profile/Jay-Purvis-6"
            },
            "answer_text": "Originally, it wasn’t accepted worldwide. It started out as a calendar implemented under a papal bull from the Roman catholic pope. It was designed to address concerns with how Easter was calculated and observed. Only countries that recognized the Roman catholic pope initially accepted the calendar. Interestingly, by solving the Easter issue (which relied on a stable vernal equinox), it effectively created a very accurate CIVIL seasonal calendar. As the centuries went by, the civil virtues of a stable seasonal calendar began to be recognized by other countries. Even countries that didn’t recognize papal bulls. Hence the Gregorian calendar began to be adopted for its civil virtues. For those who didn’t wish to pay homage to the pope, they just implemented a calendar with the same attributes without calling it Gregorian (e.g., the British did this when they adopted it in law, never mentioning Gregorian but simply identifying the same rules). Also, adopting this calendar as a civil calendar does not requires anyone to give up their other calendars, especially calendars based on religious observances. Those religious calendars still exist, and are accepted/observed by adherents to their respective religions. Colonialism also played a role, as others have noted. The adoption of this calendar by many European countries occurred during colonial days, and hence spread around the world. Once you reach a certain worldwide cultural momentum, the momentum itself is often enough to push into areas that might otherwise resist it. Hence, we get a worldwide CIVIL calendar (call it whatever you wish) that syncs very nicely with the seasons, recognized by many countries, enabling us all to stay sync’d in our global world. All this, and everyone still gets to continue to use whatever other calendar they desire for their cultural or religious purposes. ",
            "date": "Answered November 11, 2019",
            "views": "264",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denis Sequeira",
                    "user_href": "/profile/Denis-Sequeira"
                },
                {
                    "user_id": "Thanos S",
                    "user_href": "/profile/Thanos-S-1"
                }
            ]
        }
    ]
}