{
    "title": "Why did the United States traditionally oppose imperialism? - Quora",
    "tags": [
        "Imperialism",
        "World History",
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucas Messmer",
                "href": "/profile/Lucas-Messmer"
            },
            "answer_text": "The United States only opposed imperialism when European imperialism was beginning to wind down (1950s-60s). And even then, it was only when it was diplomatically convenient to say so. The United States went to war with Spain in 1898 with the goal of building a global empire, and as a direct result obtained the Philippines as a colonial possession. Millions of native Filipinos died during American occupation, a period that lasted for just under fifty years. The United States, like all modern countries in the Americas and arguably many in the old, is directly founded upon imperialism. The United States is founded on territories previously owned by Spain, France, Britain, and Russia; sometimes they were conquered, and sometimes they were bought. Almost everything West of the Mississippi (not including Texas) came from war, either with Mexico or with one of the hundreds of Native American tribes. Hawaii became a part of the union when American landowners launched a coup and overthrew the native government. There are a great deal of examples in Latin America that could definitely also be called imperialism, but my knowledge in that area isn’t specific enough for me to confidently provide all the details. ",
            "date": "Answered October 11, 2020",
            "views": "300",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Kenneth Eng",
                    "user_href": "/profile/Richard-Kenneth-Eng"
                },
                {
                    "user_id": "Peter Dunlop",
                    "user_href": "/profile/Peter-Dunlop-4"
                },
                {
                    "user_id": "Stephen Gilmore",
                    "user_href": "/profile/Stephen-Gilmore-23"
                },
                {
                    "user_id": "Salvatore Barrera",
                    "user_href": "/profile/Salvatore-Barrera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Boyle",
                "href": "/profile/Joseph-Boyle"
            },
            "answer_text": "The US was founded on continentalism in opposition to the European continent’s chronic internal strife and competitive overseas colonialism. The initial institutions were even called Continental. Furthermore for a time the Southern US supported southern expansion but the North turned against it and defeated the South, with Republican anti imperialism continuing up to the 1898 alliance with British empire against European imperialism. ",
            "date": "Answered October 12, 2020",
            "views": "487",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}