{
    "title": "Why does nearly every form ever require you to give your mother's maiden name? - Quora",
    "tags": [
        "Legality",
        "Married and Maiden Names",
        "Driver's Licenses",
        "Mothers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gigi J Wolf",
                "href": "/profile/Gigi-J-Wolf"
            },
            "answer_text": "I never thought much about it, either. And it's getting harder and harder to remember things like my mom's maiden name. She's not around anymore, so I can't even call and ask her. I'm willing to bet it started before Social Security numbers came into existence. If it didn't, then it was because people either made up Social Security numbers, didn't know theirs, didn't have one, or made an error when they wrote it down. Since so many people have the same name, even the same middle name, or even no middle name, their mother's maiden name was another way to identify a person, and differentiate them from someone else. It's always possible to have a mother with the same last name as someone else. I don't know what they do in that case. ",
            "date": "Updated August 25, 2016",
            "views": "238",
            "upvotes": " View 137 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol M. Staples",
                    "user_href": "/profile/Carol-M-Staples"
                },
                {
                    "user_id": "RAJ BAHADUR JAISWAL",
                    "user_href": "/profile/RAJ-BAHADUR-JAISWAL"
                },
                {
                    "user_id": "Isabelle Rogando",
                    "user_href": "/profile/Isabelle-Rogando"
                },
                {
                    "user_id": "Andrew Hernandez",
                    "user_href": "/profile/Andrew-Hernandez-84"
                },
                {
                    "user_id": "Karina Torres",
                    "user_href": "/profile/Karina-Torres-27"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                },
                {
                    "user_id": "Oshi Shikigami",
                    "user_href": "/profile/Oshi-Shikigami"
                },
                {
                    "user_id": "Kenny Fraser",
                    "user_href": "/profile/Kenny-Fraser-4"
                },
                {
                    "user_id": "Sue Jenkins",
                    "user_href": "/profile/Sue-Jenkins-5"
                },
                {
                    "user_id": "Angela Abel Goldsmith",
                    "user_href": "/profile/Angela-Abel-Goldsmith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Froese",
                "href": "/profile/Joel-Froese"
            },
            "answer_text": "It is a password that you are unlikely to forget. Unfortunately, it is also not very secure; for starters, your entire extended family knows this piece of information. As such, I have decided when asked this question to respond with a common English surname that only I know (instead of giving my mother's real maiden name, a foreign name that I'd have to carefully spell out several times.) If I am asked for both of my parents full name by a government authority (e.g. for a passport) I, of course, supply the correct name. But this question alone is usually asked by banks and other financial institutions as a \"security question\", and I find my policy is a more prudent choice. The one caveat is that this information is probably requested of your next-of-kin in the unfortunate case you are deceased or otherwise incapacitated. ",
            "date": "Answered March 9, 2016",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mercy Reyes",
                    "user_href": "/profile/Mercy-Reyes-1"
                },
                {
                    "user_id": "Sean Bard",
                    "user_href": "/profile/Sean-Bard"
                }
            ]
        }
    ]
}