{
    "title": "Why did the Spanish mix so much with the natives? - Quora",
    "tags": [
        "Local Natives (band)",
        "Native Americans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Eugenio Thompson Pinzón",
                "href": "/profile/Carlos-Eugenio-Thompson-Pinzón"
            },
            "answer_text": "The Spanish colonization of the Americas begun with a conquering period. It has become so relevant that even in English they use the Spanish words conquista and conquistador to refer to the period and the men that adventured. And by men, I mean men. The Spanish adventurers that came to the America for the conquista were mostly men. They didn’t brought families. These men came and many raped and married the local women. After the period of military conquest ended, some adventurers, entrepreneurs, officials, soldiers, landlords and bureaucrats, brought their Spanish women and families to the Americas, and in the administrative centers and important Spanish cities in the Americas, white families begun to be prominent, leading to the implementation of several formal and informal laws of segregation and race classification, but the mestizo population was already large. And outside the influence of those Spanish elites and their wifes, intermixing continued, as well as mestizo inbreeding.  This pattern was not exclusive to the Spanish. The Portuguese had a similar situation. The Métis people in North America, mostly French, but also Dutch and English, also. The main difference is that the English colonies in North America were mostly settler colonies, with small periods of military conquest or indigenous exploitation before European families moved in. Furthermore, Calvinist traditions in many of the English protestants that came to North America also had an influence by producing some aversion against mixed marriages. Mostly, the level of intermixing in the different European colonies all around the world was determined to how many and how soon white women moved in. ",
            "date": "Answered April 7, 2017",
            "views": "24",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruining Yuan",
                    "user_href": "/profile/Ruining-Yuan"
                },
                {
                    "user_id": "Jay Sosa",
                    "user_href": "/profile/Jay-Sosa-9"
                },
                {
                    "user_id": "Muhammad Fadlurohman Fauzi",
                    "user_href": "/profile/Muhammad-Fadlurohman-Fauzi-1"
                },
                {
                    "user_id": "Toaste D",
                    "user_href": "/profile/Toaste-D"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Clarence Vermont",
                    "user_href": "/profile/Clarence-Vermont"
                },
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                },
                {
                    "user_id": "Alexandra Dahlem",
                    "user_href": "/profile/Alexandra-Dahlem"
                },
                {
                    "user_id": "Heidi Cool",
                    "user_href": "/profile/Heidi-Cool"
                },
                {
                    "user_id": "John A. Whitehead",
                    "user_href": "/profile/John-A-Whitehead"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Salvatori",
                "href": "/profile/Marco-Salvatori"
            },
            "answer_text": "Most of the early Spanish conquistadores embarked on an adventure in the so called New World seeking riches and fortune.  This endeavor was seen as risky and inappropriate for Spanish women to partake in, so they mostly stayed in Europe. In the new Spanish colonies there were lots of Native American peoples whose men were nearly totally annihilated by the Spaniards during the conquista, leaving behind the women who were then taken by the Europeans as wives. Essentially there were very few Spanish women in the colonies but plenty of Native women, so the Spaniards simply intermixed with the latter. ",
            "date": "Answered March 7, 2016",
            "views": "23",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruining Yuan",
                    "user_href": "/profile/Ruining-Yuan"
                },
                {
                    "user_id": "Jay Sosa",
                    "user_href": "/profile/Jay-Sosa-9"
                },
                {
                    "user_id": "Muhammad Fadlurohman Fauzi",
                    "user_href": "/profile/Muhammad-Fadlurohman-Fauzi-1"
                },
                {
                    "user_id": "Toaste D",
                    "user_href": "/profile/Toaste-D"
                },
                {
                    "user_id": "Javier Blanco",
                    "user_href": "/profile/Javier-Blanco-4"
                },
                {
                    "user_id": "Joshua Del Pilar",
                    "user_href": "/profile/Joshua-Del-Pilar-2"
                },
                {
                    "user_id": "Marco Chevez",
                    "user_href": "/profile/Marco-Chevez"
                },
                {
                    "user_id": "James Greer",
                    "user_href": "/profile/James-Greer-14"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                },
                {
                    "user_id": "Danny Vilches",
                    "user_href": "/profile/Danny-Vilches"
                }
            ]
        }
    ]
}