{
    "title": "Why did Lenin destroy (take over) the self-managed socialist workers' councils shortly after gaining power? Was he a socialist in name only? - Quora",
    "tags": [
        "Vladimir Lenin",
        "History of Politics",
        "Socialism",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Wetzel",
                "href": "/profile/Tom-Wetzel-4"
            },
            "answer_text": "It’s a complicated story. In 1917 there were two kinds of worker councils. There were the shop delegates committees which were the main vehicle of struggles with the employers in 1917. In several hundred workplaces the assemblies and their delegate committees decided to seize control and directly socialize the workplace. This was one form of “self-managed socialism” that was created. At the January 1918 All Russian Trade Union Congress, the syndicalist and maximalist delegates (members of the Russian Anarcho-Syndicalist Federation (KRAS) and the Union of Socialist Revolutionaries-Maximalist (USRM)) put forward the proposal to create a national congress of the shop committees to achieve coordination and planning across the national economy. This was voted down, with the Bolsheviks opposing. The Bolsheviks, under Lenin’s leadership, had just created the Supreme Council of National Economy, top down. After getting the Soviet Congress to allow them to set up a central state cabinet in Nov 1917, one of their first acts was to create this council, stacked with managers, party stalwarts, various bureaucrats, to devise a plan top down — no worker input. They also took over the glavki, which were industrial planning bodies set up by the old tsarist regime. So the Leninists wanted to create a top down centralized form of national planning, and this was inconsistent with worker planning from below. After the onset of War Communism in 1918, with the Leninist regime nationalizing the economy from above, they replaced the worker shop committees with single managers appointed from above. The other kind of “worker council” were the soviets. These were local delegate bodies elected from the assemblies in workplaces. For the most part they did not do running of economic operations. They had a more political role — countering the old government initially. In some cases they did take over things like housing or businesses. In Kronstadt in January 1918 the KRAS-URSM alliance got passed a measure to seize the local government (Duma) and all housing and businesses in Kronstadt, and institute worker assemblies and committees and control by the soviet. But that was opposed by the Bolshevik delegates who voted “no”. In general the Leninists opposed local moves to take over control of economic operations. These local soviets were initially highly diverse, multi-party democratic bodies — with various left wing organizations represented. But over the first couple years after the revolution in 1917, the Communists used the Cheka to gradually repress the various alternative tendencies — such as the syndicalists, maximalists, left-mensheviks, etc. The KRAS (syndicalists) were repressed finally in 1921 due to the fact that with the suppression of the Worker Opposition faction in the Communist party, many of the workers who supported the Workers Opposition were shifting to KRAS. By 1921 Trotsky and Lenin both were strongly beating the drum for the “dictatorship of the party.” I think this has its basis in the whole Marxist idea of the hegemony of the party. If only the “one Marxist party” can build socialism, then they can argue any other working class group must be “counter-revolutionary”. And indeed that’s how the Communists argued. ",
            "date": "Answered December 29, 2018",
            "views": "610",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tamás Faraga",
                    "user_href": "/profile/Tamás-Faraga"
                },
                {
                    "user_id": "Jesus Mercado",
                    "user_href": "/profile/Jesus-Mercado-3"
                },
                {
                    "user_id": "Nathan King",
                    "user_href": "/profile/Nathan-King-280"
                },
                {
                    "user_id": "Eleanor Kett",
                    "user_href": "/profile/Eleanor-Kett"
                },
                {
                    "user_id": "Matthew Moppett",
                    "user_href": "/profile/Matthew-Moppett"
                },
                {
                    "user_id": "Roland Kanarius",
                    "user_href": "/profile/Roland-Kanarius"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Rae",
                "href": "/profile/Ian-Rae-8"
            },
            "answer_text": "Lenin: a socialist analysis Lew Higgins | Lenin | LeninismWhen Vladimir Ilich Ulyanov was sixteen his brother was hanged for complicity in a plot to assassinate the Tsar. Later, he himself got involved in anti-Tsarist revolutionary activity, was arrested and spent three years in prison in Siberia. In 1900 he was exiled, eventually settling in Switzerland and adopting the pseudonym “Lenin”. He founded and was the leader of the Bolshevik wing of the Russian Social Democratic Labour Party in 1903. After the revolution of February 1917 Lenin returned to Russia and in October he led the Bolsheviks to power in a coup. When he died in January 1924, most of the main feudal obstacles to capitalist development had been removed, together with all effective political opposition.The socialist analysis of Lenin and his legacy is different from the Cold War propaganda which can still be found in books such as Orlando Figes' A People's Tragedy: The Russian Revolution 1891-1924, published in 1996, which depicts Lenin and the Bolsheviks as forerunners of Hitler and the Nazis. The socialist argument against Lenin is based on the evidence that he distorted what Marx claimed and thereby damaged socialist theory, pursued political action that was against the interests of the working class and dragged the name of socialism through the mud.Starting with What Is To Be Done? (1902) Lenin said: “the history of all countries shows that the working class, exclusively by its own efforts, is able to develop only trade union consciousness.” Lenin argued that socialist consciousness had to be brought to the working class by professional revolutionaries rather than a parliamentary party, drawn mainly from the petty-bourgeoisie, and organised as a vanguard party. But in 1879 Marx and Engels issued a circular in which they declared the opposite:“When the International was formed we expressly formulated the battle cry: The emancipation of the working classes must be conquered by the working classes themselves. We cannot, therefore, co-operate with people who openly state that the workers are too uneducated to emancipate themselves and must be freed from above by philanthropic big bourgeois and petty bourgeois” (www.marxists.org/archive/marx/works/1879/09/18.htm).It must be noted however that Lenin's elitism was consistent with the outlook of the Second International. As Hal Draper has written: “The fact is that Lenin had just read this theory in the most prestigious theoretical organ of Marxism of the whole international socialist movement, the Neue Zeit. It had been put forward in an important article by the leading Marxist authority of the International, Karl Kautsky.” (The Myth of Lenin's Concept of The Party,www.marxists.org/archive/draper/works/1990/myth/index.htm). The difference between Kautsky and Lenin here was over who was to lead the workers beyond “trade-union consciousness”, though historically Lenin's interpretation that this should be a vanguard party of professional revolutionaries has been more influential. By contrast, when the Socialist Party of Great Britain was formed in 1904 it repudiated leadership as a political principle and insisted that the emancipation of the working class really had to be the work of the working class itself.False distinctionLenin was not the first to describe socialism as a transitional society, but through his followers, he turned out to be the most influential. In Lenin's Political Thought (1981), Neil Harding claims that in 1917 Lenin made “no clear delineation” between socialism and communism. But in fact Lenin did write inState and Revolution (1917) of a “scientific distinction” between socialism and communism:“What is usually called socialism was termed by Marx the 'first', or lower, phase of communist society. Insofar as the means of production become common property, the word 'communism' is also applicable here, providing we do not forget that this is not complete communism” (www.marxists.org/archive/lenin/works/1917/staterev/ch05.htm#s1).The first sentence of this quote is simply untrue and Lenin must have known this. Marx and Engels used the terms socialism and communism interchangeably to refer to the post-revolutionary society of common ownership of the means of production. It is true that in his Critique of the Gotha Programme (1875) Marx wrote of a transition between a lower phase ofcommunism and a higher phase of communism. Marx held that, because of the low level of economic development (in 1875), individual consumption would have to be rationed, possibly by the use of labour-time vouchers (similar to those advocated by Robert Owen). But in the higher phase of communism, when the forces of production had developed sufficiently, consumption would be according to need. It is important to realise, however, that in both phases of socialism/communism there would be no state or money economy. Lenin, on the other hand, said that socialism (or the first phase of communism) is a transitional society between capitalism and full communism, in which there is both a state and money economy. According to Lenin:“It follows that under communism there remains for a time not only bourgeois right, but even the bourgeois state, without the bourgeoisie!… For the state to wither away completely, complete communism is necessary.”But Lenin failed to see what this would involve. In effect, the theory of “socialism” as a transitional society was to become an apology for state capitalism.In terms of its impact on world politics, Lenin's State and Revolution was probably his most important work. This was derived from the theoretical analysis contained in his earlier work, Imperialism, the Highest Stage of Capitalism (1916). Lenin's theory of imperialism demonstrated to his satisfaction that the whole administrative structure of “socialism” had been developed during the epoch of finance or monopoly capitalism. Under the impact of the First World War, so the argument ran, capitalism had been transformed into state-monopoly capitalism. On that basis, Lenin claimed, the democratisation of state-monopoly capitalism was socialism. As Lenin pointed out in The Impending Catastrophe and How to Combat It (1917):“For socialism is merely the next step forward from state-capitalist monopoly. Or, in other words, socialism is merely state-capitalist monopoly which is made to serve the interests of the whole people and has to that extent ceased to be capitalist monopoly” (original emphasis, www.marxists.org/archive/lenin/works/1917/ichtci/11.htm).In State and Revolution Lenin claimed that according to Marx work and wages would be guided by the “socialist principle” (though in fact it comes from the christian saint, Paul): “He who does not work shall not eat.” This was eventually adopted in the USSR Constitution of 1936 and amended to read: “to each according to his work.” as a “principle of socialism.” Marx and Engels used no such “principle” and they made no such distinction concerning socialism. Lenin in fact did not “re-establish what Marx really taught on the subject of the state”, as he claimed, but substantially distorted it to suit the situation in which the Bolsheviks found themselves. When Stalin announced the doctrine of “socialism in one country” in 1936 (i.e. the establishment of state capitalism in Russia) he was drawing on an idea implicit in Lenin's writings.DictatorshipIn State and Revolution, Lenin gave special emphasis to the concept of the “dictatorship of the proletariat”. This phrase was sometimes used by Marx and Engels and meant working class conquest of power, which (unlike Lenin) they did not confuse with a socialist society. Engels had cited the Paris Commune of 1871 as an example of the dictatorship of the proletariat. The Commune impressed Marx and Engels for its ultra-democratic features, which involved a non-hierarchical structure and the use of revocable delegates. Lenin, on the other hand, tended to identify the term with a state ruled by a vanguard party. When the Bolsheviks actually gained power they centralised political power more and more in the hands of the Communist Party. Modern-day Leninists claim that the rise of Stalin was due to the ravages of civil war and Russian isolation, but the fact remains that “democratic centralism” can allow dictators to rise to power and all openly pro-capitalist political parties have a similar structure which can allow the leadership to act undemocratically.Lenin's short article The Three Sources and Three Component Parts of Marxism(1913) is a concise explanation of the basics of Marxism (www.marxists.org/archive/lenin/works/1913/mar/x01.htm). But by 1918 the dictatorship of the proletariat had become for Lenin “the very essence of Marx's teaching” (The Proletarian Revolution and the Renegade Kautsky, 1918, www.marxists.org/archive/lenin/works/1918/prrk/index.htm). It is noticeable however that Lenin's Three Sources article contained no mention of the phrase or Lenin's particular conception of the dictatorship of the proletariat. Harding alleges that Lenin was the most “doctrinaire” of all Marxists at this time, but here again we see that Lenin was only too willing to distort Marx's arguments in order to fit into the reality of Russia's capitalist revolution. That is, the further development of wage labour, capital, commodity production and the state, which resulted in the exploitation of the working class by the party bureaucracy as the exploiting class.Lenin's greatest positive achievement was getting Russia out of the bloody futility of World War One, something that the Socialist Party acknowledged at the time. The Socialist Party was the only British organisation to publish the Bolsheviks' anti-war declaration during the war. The trouble really started when claims about the “socialist” nature of Russia began to be aired, first within Russia then in the Communist parties being formed around the world. (See www.worldsocialism.org/spgb/archive/revolution(1918).pdf) The false claims about Russian “socialism” are largely derived from Lenin's opportunism as he distorted Marxism – working class socialist theory. In this country, the Socialist Party always denied that socialism existed in Russia (or anywhere else) or that Russia was on a transition towards socialism.For its anti-democratic elitism and its advocacy of an irrelevant transitional society misnamed “socialism”, in theory and in practice, Leninism today deserves the hostility of workers everywhere. Lenin seriously distorted Marxism and thereby severely damaged the development of the socialist movement. Indeed, Leninism still continues to pose a real obstacle to the achievement of socialism.Lew Higgins‹ 50 Years Ago: Vote for a Case not a FaceupMore Lenin or less Lenin?Therefore in name only regards ian. ",
            "date": "Answered March 20, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Markku Larkimo",
                    "user_href": "/profile/Markku-Larkimo-1"
                },
                {
                    "user_id": "Robin Cox",
                    "user_href": "/profile/Robin-Cox"
                },
                {
                    "user_id": "Brian Johnson",
                    "user_href": "/profile/Brian-Johnson-429"
                },
                {
                    "user_id": "Bobby Havens",
                    "user_href": "/profile/Bobby-Havens"
                },
                {
                    "user_id": "Dennis Fischman",
                    "user_href": "/profile/Dennis-Fischman"
                }
            ]
        }
    ]
}