{
    "title": "Why did Italy and Japan switch sides for WW2? - Quora",
    "tags": [
        "Military History and Wars of Japan",
        "Japan in World War II",
        "Italy",
        "Japan",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yao Zhan",
                "href": "/profile/Yao-Zhan-4"
            },
            "answer_text": "(I thought the question was asking why one of the combatants switched sides and one did not) The Italians switched sides in WW2, they went over to the Allied side. The Japanese did not. Why? The Italians were smart. They realized that the war was lost by 1943. The writing was on the wall. They saw no point to carrying on the war effort. It was plain suicide. So they switched sides. There was no way, short of a miracle, that the Axis forces could win WW2. They were geared for a fast quick war. It was obvious in 1943 that the war was lost. The Japanese were not so smart. Maybe its a cultural thing, they feel no shame in suicide. Well to be fair to them their leaders were very stubborn and were unconcerned about the fortunes of their own people, thinking only of glory, honor, etc.. Japanese society was very cohesive and organized. It was very hard for them to consider the fact that their leaders were delusional. Their Emperor was also considered a God despite being a nominal figurehead. This did not stop his soldiers from fighting to the death or committing horrendous atrocities in “His Name”. They also thought that they could overcome the enemy’s military superiority through sheer will power. Maybe they could have if it was a limited war. But they had engaged the enemy in total war. A war that they could not win. There were plenty of Japanese leaders who were delusional or felt no qualms about sending millions of their own people, including children to their death. Because getting killed in battle for your God Emperor is glorious apparently.  ",
            "date": "Updated February 17, 2017",
            "views": "296",
            "upvotes": " View 140 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malinda Shumpert",
                    "user_href": "/profile/Malinda-Shumpert"
                },
                {
                    "user_id": "Jennifer Barrett",
                    "user_href": "/profile/Jennifer-Barrett-148"
                },
                {
                    "user_id": "Mario Barcelon",
                    "user_href": "/profile/Mario-Barcelon"
                },
                {
                    "user_id": "Antonio Colangelo",
                    "user_href": "/profile/Antonio-Colangelo"
                },
                {
                    "user_id": "Seyi Asomba",
                    "user_href": "/profile/Seyi-Asomba"
                },
                {
                    "user_id": "Ben Stephens",
                    "user_href": "/profile/Ben-Stephens-31"
                },
                {
                    "user_id": "Bima Sakti",
                    "user_href": "/profile/Bima-Sakti-2"
                },
                {
                    "user_id": "Al Zenix",
                    "user_href": "/profile/Al-Zenix-1"
                },
                {
                    "user_id": "Chooi Wai Loon",
                    "user_href": "/profile/Chooi-Wai-Loon"
                },
                {
                    "user_id": "Roger Harman",
                    "user_href": "/profile/Roger-Harman"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Ware",
                "href": "/profile/James-Ware-8"
            },
            "answer_text": "During the Second World War, the Axis Powers was an alliance between Germany, Italy, and Japan. Nearly two decades ago, Japan and Italy were at war with Germany during the First Great War. The reasoning for their switch to being allies with Germany can mostly be blamed because of the Treaty of Versailles, as can most of the Second World War. Italy had actually been allies before with Germany. Beginning in 1882, Italy was a member of the Triple Alliance with Germany and Austria-Hungary that counter the Triple Entente of the United Kingdom, France and Russia. When war broke out in 1914, Italy was not enthusiastic about it and opted out because the alliance was a defensive one and they saw Germany and Austria-Hungary as the aggressors. Also because Austria-Hungary had tried to prevent Italian unification, they had no wishes to fight in a war with them. A year later, Italy would sign the Treaty of London in which for finical aid and promise of territory the would join the war and fight their former allies. By the end of the First World War, 420,000 Italians were killed and another 955,000 wounded. Italy hoped to gain territory from Austria-Hungary, but their efforts during the Paris Peace Conference failed. Benito Mussolini used this failure as a way to gain political power and by 1922, after his March on Rome, he became Prime Minister of Italy. He would eventually have dictatorial powers of the nation. His actions would inspire Hitler to take power in Germany. The two nation would sign a treaty of friendship, the Rome-Berlin Axis, in 1936 and would sign the Pact of Steel in 1939 creating a military alliance. Japan was an ally of Great Britain so they entered the First World War on the side attacking German colonies in the Pacific. After the war, they were given more territory mostly from German holdings in the Pacific. Ever since Japan was brought out of isolation in the mid 1800s, the nation became more Westernize in order to compete with Europe. They defeated Russia in 1905 proving their advancements during the Meiji restoration. Due to racial reason they were not treated as fairly during the Paris Peace Conference. The Japanese government became more militaristic following the Great Depression and began to expand such as the Invasion of Manchuria in 1931. The League of Nations, which was created by the Treaty of Versailles, condemned this, but they could do nothing about. Japan withdrew from the League of Nations and became closer to Germany. In 1940, Japan, Germany, and Italy signed Tripartite Pact creating the Axis Alliance. Spartacus Educational Axis Alliance in World War II ",
            "date": "Answered February 12, 2017",
            "views": "101",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Birchler",
                    "user_href": "/profile/Mark-Birchler"
                },
                {
                    "user_id": "S Harrish",
                    "user_href": "/profile/S-Harrish"
                },
                {
                    "user_id": "Jeremiah Jung",
                    "user_href": "/profile/Jeremiah-Jung"
                },
                {
                    "user_id": "Manya Nagar",
                    "user_href": "/profile/Manya-Nagar-3"
                },
                {
                    "user_id": "Shirsha Ray",
                    "user_href": "/profile/Shirsha-Ray"
                },
                {
                    "user_id": "Sambit Roy",
                    "user_href": "/profile/Sambit-Roy-10"
                },
                {
                    "user_id": "Havoc Parker",
                    "user_href": "/profile/Havoc-Parker"
                },
                {
                    "user_id": "Pat Hamm",
                    "user_href": "/profile/Pat-Hamm-2"
                },
                {
                    "user_id": "Kohei Sakaike",
                    "user_href": "/profile/Kohei-Sakaike"
                },
                {
                    "user_id": "Janet Jonga",
                    "user_href": "/profile/Janet-Jonga"
                }
            ]
        }
    ]
}