{
    "title": "Why do pirates often wear an eye patch? - Quora",
    "tags": [
        "Maritime Piracy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Baker",
                "href": "/profile/Daniel-Baker-37"
            },
            "answer_text": "There’s no reason to believe any significant number of pirates wore eye patches. Contemporary illustrations and descriptions of pirates never mention eyepatches. One Arab pirate was described by an eyewitness as missing an eye - Rahmah ibn Jabir al-Jalahimah. Al-Jalahimah might have worn a patch, but it’s not sure; the witness only mentions the missing eye, and says nothing about whether he covered it. The image of the pirate with an eye patch, like the image of the pirate with a peg leg, comes mostly from a distortion of Treasure Island. Blind Pew in the novel has lost both his eyes, and covers them with a “great green shade over his eyes and nose.” In movies and art, this has inspired an eye patch, just as Long John Silver’s crutch has been turned into a peg leg. But wooden legs have actually been described in primary sources on pirates, albeit rarely; eye patches don’t appear at all. It has been speculated that pirates with two good eyes wore an eye patch over one eye to keep it adjusted to the darkness so they could fight below decks better. Mythbusters ran an episode proving that this tactic would have worked had it been tried. Sure, and Colt revolvers and steel jackstays would have worked had they been tried in the 18th century, but they weren’t. There remains no evidence whatsoever that any pirate wore an eye patch to preserve his night vision or for any other reason. Furthermore, the idea of the tactic doesn’t match the way pirates actually operated. Pirates rarely fought on board enemy ships at all - the vast majority of all pirate captures were unresisted - and when they did fight, it was invariably above deck. An enemy crew that had been driven below deck was already trapped and at your mercy; all you had to do was weight down the hatches so they couldn’t get out, and then dump grenades through the hatch gratings or the portholes. There was no reason to risk going down there after them at all, much less sacrifice half your peripheral vision and all your depth perception in preparation for such an unnecessary fight. ",
            "date": "Answered August 30, 2016",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Onnimanni Mäki",
                    "user_href": "/profile/Onnimanni-Mäki-1"
                },
                {
                    "user_id": "Erich Zorn",
                    "user_href": "/profile/Erich-Zorn"
                },
                {
                    "user_id": "Mike Shurkin",
                    "user_href": "/profile/Mike-Shurkin"
                },
                {
                    "user_id": "Carter Langen",
                    "user_href": "/profile/Carter-Langen"
                },
                {
                    "user_id": "Shyam Sundar Sridhar",
                    "user_href": "/profile/Shyam-Sundar-Sridhar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Suttle",
                "href": "/profile/Chris-Suttle"
            },
            "answer_text": "Pirates wearing eyepatch is is more of a choice made by illustrators and artist than anything historical. There are a number of theories behind the reasoning for eyepatch is one being that wearing an eye patch above deck would give you better vision when you go below deck and remove it. Another theory is wearing a patch over one eye would make the vision in the other stronger so whatever eye the pirate would use with a spyglass he would wear a patch over the opposite eye to give him better vision. In reality accidents did happen frequently on a pirate ship. Cannon balls would cause wooden splinters to fly all over the deck and the chances of getting an eye injury from flying debris Is quite possible. Because of the limited amount of supplies on a pirate ship the typical eyepatch people think of would not be what they would wear to cover an injury. It would’ve been a tour and strip of sail cloth or leather not be formed patch with string attached to either side that most people think of. Is quite possible. Because of the limited amount of supplies on a pirate ship the typical eyepatch people think of would not be what they would wear to cover an injury. It would’ve been a torn strip of sail cloth or leather not the formed patch with string attached to either side that most people think of ",
            "date": "Answered May 14, 2019",
            "views": "279",
            "upvotes": "0"
        }
    ]
}