{
    "title": "Why did most of the world’s inventions come from China? - Quora",
    "tags": [
        "History of Inventions",
        "History of China",
        "Invention and Inventions",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "“Most” did not come from China, but it is true that in certain periods of history China was particularly fruitful; at other time Mesopotamia was, or southern Europe, or northern Europe, or North America. What complex set of features makes a particular culture thrive at one point and shrivel up at others is notoriously hard to pin down since it occurs cross-culturally, e.g. not always where agriculture is invented, or not always where individualism is rife, etc. You can say about China that writing was early and a continuous tradition existed since while invaded outsiders assimilated; in some other places like Mesopotamia sometimes there was assimilation and sometimes not. Egypt is a counter-example since it was also continuous but not as fruitful. It may have been adoption of the scholar idea, with the state encouraging promotion of smart hard-working people, since when Islam and pockets of Judaism did so they, too, were fruitful. ",
            "date": "Answered October 9, 2019",
            "views": "105",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Walt Nicholes",
                    "user_href": "/profile/Walt-Nicholes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Weber",
                "href": "/profile/Mark-Weber-133"
            },
            "answer_text": "I think most is quite an overstatement. A number of inventions came from China because they were a thousand years or mor ahead of Europe in establishing civilization. Considering that situation one would expect even more inventions to have come from China. That is a real mystery. They invented printing but it was a European who invented moveable type to make it much cheaper and faster. They invented gunpowder but it was the Europeans who invented guns and cannons. It was the Indians who invented the zero which revolutionized thinking in math. ",
            "date": "Answered October 10, 2019",
            "views": "50",
            "upvotes": " Answer requested by Carl Fabian"
        }
    ]
}