{
    "title": "Why can’t the United States build a wall on its southern border? - Quora",
    "tags": [
        "Borders (geography)",
        "Border Security"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clifford Heseltine",
                "href": "/profile/Clifford-Heseltine"
            },
            "answer_text": "Let’s see… Much of the land is privately owned and they don’t…Bullshit. People with property abutting the Mexican border would GLADLY allow the government to build a wall along the portion of their property that was the U.S. Mexican border if for no other reason than to keep the illegals and drug couriers off of their land.It would be impossible to build a 2,000 mile long wall - Well, it doesn’t have to be the entire 2,000 miles to start with. Much of the border is terrain that is not easily traversed on foot or by vehicle and so no wall would need to be built there. As for the rest of the span, detailed plans for the design, construction and costs are already available which prove that it can indeed be done. Is it really believable that the only country in history to land men on the moon could not build a border fence to protect their frontier?It would have to be 30,000 feet high! Sorry, while some people enter the country illegal by airplane, or enter legally and do not leave when their visa expires, the vast majority of illegal immigrants walked across the border from Mexico and the people we are really concerned about, Muslim jihadis, would most likely choose that route if we are ever successful in closing off importation through (phony) refugee status.Down the center of the Rio Grande…The Rio Grande does not run the entire length of the border. The wall could be built far enough inside the U.S. territory that the river would not be an issue, even in flood stage. Water for irrigation and other uses, if desired, could still be pumped across no man’s land.Bottom line, the only thing preventing the wall from being built is not any engineering hurdle, it is politics pure and simple. The term for illegal Mexican and other Latino immigrants is commonly “undocumented Democrats”. That about sums up why the Liberals do not want a wall and a major reason why conservatives do. ",
            "date": "Answered May 15, 2017",
            "views": "233",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Czikalla",
                    "user_href": "/profile/Robert-Czikalla-1"
                },
                {
                    "user_id": "Larry Rohovit",
                    "user_href": "/profile/Larry-Rohovit-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Eshleman",
                "href": "/profile/Henry-Eshleman"
            },
            "answer_text": "’Cause it’s a colossally expensive concept that wouldn’t work as well as investing in people. The Berlin Wall, erected to control illegal border crossings by a far more ruthless bunch than I hope we will ever be, would have been useless without the heavy guard presence. Same rules apply. Also… you… do know we have more borders, right? If I wanted to cross into Canada, there are any number of places I could do it without even thinking, and vice-versa. We also have many maritime ports of entry, which handle truly staggering volumes of cargo- including containers which can be and have bee used to smuggle humans. So why the terminal fixation on the southern border? Ah, because more people come in illegally that way than along the Canadian borders? All right, look into why that is. We don’t seem to have a big hassle with Canadians marching through dangerous terrain in desert conditions to reach us. Moreover… as of a 2006 study, around 45% of the people illegally in the country arrived on legitimate visas of one kind or another and overstayed. Another, smaller group used Border Crossing Cards and then violated the terms. A wall won’t help with that. Of those who didn’t enter through ports of entry in this fashion, many actually did- hidden in cargo trucks, because there is too high a volume of trade crossing that border to actually physically search every truck. A wall won’t help with that. A decent chunk of illegal immigrants are also, in essence, victims of human trafficking- which means their crossings are coordinated by organized criminal enterprises which have the resources to find weak points, bribe officials, or simply route enough traffic through a given legal crossing that local authorities cannot feasibly check every vehicle. A wall won’t help with that. And if you’re worried about bad actors entering via our southern border?Actual terrorists and criminals have funding. They can get plane tickets and tourism visas. Every foreign-born terrorist to stage an attack in the United States so far has entered legally. They haven’t marched across a desert with no guarantee of survival- they’ve simply entered via conventional channels. A wall won’t help with that. Worried about terrorist influencers entering the country and radicalizing people? They don;t have to, there’s an ap for that! The Tsarnaev brothers were radicalized by online videos. A wall won’t help with that. Useful reading: Solving human trafficking between Mexico and the United States (2017) Enforcement and illegal migration (2019) Illegal immigration, state law, and deterrence (2017- and an indicator that harsh policy law can have an impact on the inflow) ",
            "date": "Answered January 8, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Phillips",
                    "user_href": "/profile/David-Phillips-491"
                }
            ]
        }
    ]
}