{
    "title": "Why did the Spanish Empire help the United States become independent from the British Empire? - Quora",
    "tags": [
        "Spanish Empire",
        "British Empire",
        "Empires",
        "Independence",
        "History of Great Britain",
        "World History",
        "History of the United States of America",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Hughes",
                "href": "/profile/Richard-Hughes-104"
            },
            "answer_text": "Same reason the French and Dutch helped, to try and weaken Britain. Out of the 6 European powers at the time(Britain, France, Spain, Portugal, Austria and the Netherlands) 5 of them were colonial Empires, 3 of those were all rivals with Britain. A revolution in one of Britain's colonies is exactly the sort of opportunity Spain,France and the Netherlands had been waiting for. Spain and Britain(Specifically England) had a long standing rivalry and the increasing level of colonialism in the Americas and Caribbean had only seen to strengthen this. The Spanish thought that by helping the 13 colonies(which were some of Britain’s most developed colonies) become independent they would be able to weaken Britains overall position as a colonial power. It was common practice for all powers to do this, Britain even helped Brazil gain its independence from Portugal despite Britain and Portugal being the worlds oldest allies. However Spain's plan sort of backfired, losing America made Britain look to Africa and Asia which is of course where Britain went onto dominate and become the worlds most powerful Empire. Bit of a silly mistake but you can see where there thought process was taking them. ",
            "date": "Answered July 12, 2017",
            "views": "571",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noah Cornett",
                    "user_href": "/profile/Noah-Cornett-2"
                },
                {
                    "user_id": "Antoni Carl Mojica",
                    "user_href": "/profile/Antoni-Carl-Mojica"
                },
                {
                    "user_id": "Ted Exstein",
                    "user_href": "/profile/Ted-Exstein"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Vicini",
                "href": "/profile/Eric-Vicini"
            },
            "answer_text": "In the Grand Game of Alliances of the 18th century, Spain had become allied with France. There was a Bourbon on the throne of both kingdoms. In fact, an entire war has been fought in order to stop Louis XIV from annexing Spain to France. It did, but the alliance persisted. Furthermore, in the New World, Spain felt more threatened by its old rival than by upstart revolutionaries. I guess they didn’t figure that the United States would amount to much, in the long run. Or they didn’t care, they figured that it would be easier to deal with a presumed weak power than with the UK. Or maybe their decisions weren’t that informed. I mean, people sitting in offices in Madrid don’t always know what they’re doing, in spite of having people in place to advise them. Either way, most people would rather have an upstart, unstable neighbor who’s too busy with its own affairs to meddle with yours, than a Great Power like Great Britain for whom you are nothing but an adversary playing a global game. Not to mention that in that very game of alliances, Great Britain was now dominant, and therefore attracting a coalition of states trying to cut her down to size. Which they did. ",
            "date": "Answered July 11, 2017",
            "views": "364",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zaid Dinally",
                    "user_href": "/profile/Zaid-Dinally"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                },
                {
                    "user_id": "Ted Exstein",
                    "user_href": "/profile/Ted-Exstein"
                },
                {
                    "user_id": "Joseph Boyle",
                    "user_href": "/profile/Joseph-Boyle"
                }
            ]
        }
    ]
}