{
    "title": "Why did Oscar Wilde wait until his deathbed before converting to Catholicism? - Quora",
    "tags": [
        "Oscar Wilde (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leon Zylicz",
                "href": "/profile/Leon-Zylicz"
            },
            "answer_text": "Wilde’s relation to Catholicism is highly complicated. At first glance, he seems to be torn between his religious and moral feelings and the artistic vocation throughout his life. Being a man of the “obliquity,” as he put it, Wilde saw in Catholicism a sort of moral support and remedy. Three weeks before his death, he declared to a journalist from the Daily Chronicle as follows: “Much of my moral obliquity is due to the fact that my father would not allow me to became a Catholic. The artistic side of the Church and the fragrance at its teaching would have cured my degeneracies.” Long before, Wilde had considered Catholicism as “the only religion to die in.” In his view, the Catholic Church was for saints and sinners alone - for respectable people, “the Anglican Church will do.” On other side, however, Oscar - as a free artist and nonconformist - was not able to accept some catholic dogmas. For instance, he denied the divinity of Christ and the existence of the hell. Moreover, the whole Catholicism was not true for him. No wonder that even Wilde’s closest friend, Robert Ross, did not know whether he should bring a priest to the dying Oscar or not, when he, on November 29, 1900, arrived in writer’s hotel at Bagneux, France. Earlier, on 10th, Wilde had undergone an operation on his ear. Since then, his health rapidly deteriorated; the were periods of delirium and talking nonsens in English and French. The doctors feared that the inflammation would go to his brain. Ross, in face of his friend’s agony, asked him whether he wished to see a priest. Wilde, being unable to speak, held up his hand. So, Ross brought a certain Father Cuthbert Dunne for the formal obsequies. Then, Father Dunne asked the dying if he wished to be received, and Oskar held up his hand once again. (Later, Ross would note that he had not been sure whether his friend was conscious at that time or not.) Anyway, Father Dunne gave Oscar baptism, absolved and anointed him. The next day, on November 30, Oscar Wilde died at 10 minutes to 2 p.m. (According to the death certificate - at 2:00 p.m.). On December 03, he was buried in the “11th grave in the 7th row of the 17th section at the Bagneux cemetery. Nine years later, Wilde’s remains has been moved to Pere Lachaise, the biggest and the most famous cemetery of Paris. All quotations after Oscar Wilde by Prof. Richard Ellmann, Chapters: ”Decline” and “Epilogue,” (London: Penguin Books, 1987). Leon Zylicz, author of Witold Gombrowicz: A Biography as William Whiteford, (West Columbia, SC, USA: Createspace Independent Publishing Platform, an Amazon Company, 2017). ",
            "date": "Answered June 7, 2018",
            "views": "13",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Parrott",
                    "user_href": "/profile/Michael-Parrott-17"
                },
                {
                    "user_id": "Naisha Islam",
                    "user_href": "/profile/Naisha-Islam"
                },
                {
                    "user_id": "Gerard Marque Raymond",
                    "user_href": "/profile/Gerard-Marque-Raymond"
                },
                {
                    "user_id": "Evan Cowie",
                    "user_href": "/profile/Evan-Cowie"
                },
                {
                    "user_id": "Christopher Meade",
                    "user_href": "/profile/Christopher-Meade-3"
                },
                {
                    "user_id": "Edward Ball",
                    "user_href": "/profile/Edward-Ball-15"
                },
                {
                    "user_id": "Mohammed Bashir Khan",
                    "user_href": "/profile/Mohammed-Bashir-Khan"
                },
                {
                    "user_id": "Sonia Fanucchi",
                    "user_href": "/profile/Sonia-Fanucchi"
                },
                {
                    "user_id": "Frances De Creus Maria",
                    "user_href": "/profile/Frances-De-Creus-Maria"
                },
                {
                    "user_id": "Diego Martins",
                    "user_href": "/profile/Diego-Martins-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose' Arroyo",
                "href": "/profile/Jose-Arroyo-207"
            },
            "answer_text": "Only Oscar Wilde can truly answer that. Bob Hope was another that converted near the end of his life. Ultimately, the reasons for someone wanting to be reconciled to God is an internal disposition. Personally, I would prefer to be “right” with God before the last minute! ",
            "date": "Answered June 1, 2018",
            "views": "300",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Cowie",
                    "user_href": "/profile/Evan-Cowie"
                },
                {
                    "user_id": "Gabriel J. Ferrer",
                    "user_href": "/profile/Gabriel-J-Ferrer"
                },
                {
                    "user_id": "John Kenning",
                    "user_href": "/profile/John-Kenning-2"
                },
                {
                    "user_id": "Ethan A. Hayes",
                    "user_href": "/profile/Ethan-A-Hayes"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Anija Philip Mathew",
                    "user_href": "/profile/Anija-Philip-Mathew"
                },
                {
                    "user_id": "Peter Francis Joseph DeFazio",
                    "user_href": "/profile/Peter-Francis-Joseph-DeFazio"
                }
            ]
        }
    ]
}