{
    "title": "Why in the 1960’s into the 1970’s couldn’t Women help us Men and mass protest the Vietnam War? Like at least 50% Not just 1%. - Quora",
    "tags": [
        "Warfare in Vietnam",
        "1960s",
        "1970s",
        "Vietnam War",
        "Protests",
        "Vietnam",
        "History of the United States of America",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Morris Kamelgarn",
                "href": "/profile/Morris-Kamelgarn"
            },
            "answer_text": "I remember that time. The country was bitterly split on the subject of Vietnam, probably more so than at any time since the Civil War. While I wasn't a protestor myself, I do remember that most, if not all of the leaders of the antiwar movement were men, but I don't think you can blame women for that. This was before the Women's Liberation movement, and this was still a very sexist society. Despite their professed political liberalism, the leaders of antiwar groups like the SDS were largely sexist men who looked upon the women in those groups as suitable only for supportive and clerical roles, because after all, they were only women. There were at least as many women as men at the mass protests against the war in Washington and other places, but they were less visible because they weren't the leaders. ",
            "date": "Answered October 23, 2020",
            "views": "116",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohammad Tarek",
                    "user_href": "/profile/Mohammad-Tarek-15"
                },
                {
                    "user_id": "David Johnston",
                    "user_href": "/profile/David-Johnston-21"
                },
                {
                    "user_id": "Judith Watson",
                    "user_href": "/profile/Judith-Watson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Verdoia",
                "href": "/profile/Ken-Verdoia"
            },
            "answer_text": "My response is not academic, and is not backed by data or additional research. I can only offer my anecdotal experiences as a college student in California during the Vietnam era. And those experiences demonstrated women played overt, strong and prominent roles in public protests against US government policies in Vietnam. To say women represented “1%” of those protesting the war, is not accurate by any observation I had in that era. Both in public demonstration, and in the organizing of student mobilization, women played very prominent roles…both in leadership and in numbers. There was also are very powerful presence of mature women protesting the draft and war policies as mothers of soldiers or young men subject to induction. ",
            "date": "Answered October 23, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Blyth",
                    "user_href": "/profile/David-Blyth-1"
                }
            ]
        }
    ]
}