{
    "title": "Why did the United States lose the Vietnam War? - Quora",
    "tags": [
        "Warfare in the United States",
        "Military History of the United States of America",
        "Vietnam War",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Santhouse",
                "href": "/profile/Ben-Santhouse"
            },
            "answer_text": "As others have stated, the US didn't lose the Vietnam War in the traditional sense. A peace was negotiated by Kissinger and the N.Vietnamese representatives in Geneva, after neither side was seeing progress. The US then pulled itself fully out of S.Vietnam after the Fall of Saigon: the embassy was taken, and many, many diplomats and refugees were airlifted to the USS Midway. The reasons for the failure of the US in the war are numerous, however. Firstly, let us look at US military itself. Having not learnt from the French defeat at Diem Bien Phu in 1954, US troops were poorly trained for guerilla warfare; most training happened over a few weeks in Texas or Alabama, hardly representative of the Vietnamese jungle. Of the 2.8 million troops who served, 2 million were conscripted; in the end over 500,000 soldiers deserted, and most were unwilling to fight-only 10% ever saw combat. Due to the lack of career soldiers and the yearly 'tour of duty' only 6% of deaths happened in the final three months, as troops tried to stay clear of danger. By comparison, due to their inexperience, 43% of deaths occurred in the first three months of duty, which was not helped by the reception the 'cherries' received from their fellow men. If they survived, drug abuse was rife: in 1971 5000 men were admitted to hospital for combat wounds, but 20,000 for drug abuse. Officers were not liked either: 3% were killed by their own troops.  Strategy was no better. The US went into the war without a clear aim, only to attempt to halt or slow the Domino Effect. This occurred when Johnson was under pressure having seen the US fail in Cuba and Berlin the same year, and he used the USS Madox incident as an excuse to pass The Tonkin Resolution. He admitted soon after that it was just fisherman shooting at flying fish. Consequently, without a war aim, when the US could have won the war after the failed Tet Offensive in 1968 Westmoreland's request for a further 200,000 troops was rejected by Nixon (although the public's opinion also affected/constrained his views). The US also did a good job of alienating the locals. By supporting Diem with $400,000,000, their name was associated with 2/3 of the S.Vietnamese peasants being moved into strategic hamlets. Diem forced them to pay for the materials, and far from stopping local intelligence on the ARVN being passed on to the Viet Cong, it just meant that Communism was spread to new areas. During Operation Rolling Thunder more bombs were dropped on Vietnam than during the entirety of WW2. Unlike Germany, there was a lack of factories to bomb, with China and the USSR predominantly supplying the NVA's weapons. This damage to civilian infrastructure, coupled with the lack of success of Hearts and Minds, further angered the locals, who provided vital intelligence to the VC. Chemical weapons such as Napalm and Agent Orange damaged crops and food supplies of the locals, but importantly also poisoned the water supplies of the US' own troops!  One must also not overlook the North Vietnamese tactics, which unlike the US, quickly won over the peasants. The Code of Conduct meant that they respected the local villagers, even stealing land from the rich to give to the poor, whilst women were respected. This meant that the VC could easily find new recruits and gain vital intelligence, which they could spread using the Ho Chi Minh Trail. This ran through Cambodia and Laos, having been set up during the French-Indochina war, and it allowed the VC to easily, but covertly, transport supplies. The guerilla tactics were also a major shock for the Americans. The tunnel system was impressive, and booby traps and landmines scared the US troops. With no uniform and jungle-covered tunnels, they really did blend-in, and therefore could easily ambush American groups with hit and run attacks, a very effective demoraliser. Many VC also got jobs in the US bases, allowing them to easily pass on information to their comrades.  The other major problem was at home. The media was a worry for the US: known as the first TV war, images such as the self-immolating Buddhist monk and the napalm girl reached US shores for the first time. Harrison Salisbury went to Vietnam for the New York Times, and was denied the Pulliter's Prize as a consequence. Magazines such as Life changed their opinion as the war went on, affecting public thought. Dead bodies, both American and Vietnamese were seen on TV, while ex-soldiers such as Parks and Simpson described the horrors they had seen. With international perception poor, Johnson even resorted to threatening Walter Cronkite and CBS, having personally invited them to the White House for a telling-off. My Lai may have only been reported by Seymour Hersh 18 months after the event, but it caused such a shock in the US that 49% refused to believe the report. By 1971 however, after the Pentagon Papers had been leaked, public approval for the war fell to 30%. This public disapproval was what stopped Johnson standing for re-election, and Nixon pledging 'peace with honour', rather than carrying on the war after the VC had been practically wiped out trying to fight conventionally. The Fulbright Hearings featuring John Kerry, and the International War Crimes Tribunal (who described US involvement as 'no better the the Nazis'), didn't help the cause. The media led to this downturn in public opinion, and consequently, public protests were rife. The war was costing $66 million a day, angering both Wall Street and black-rights leaders, who were hoping that change would happen with Johnson's 'Great Society' program and Civil Rights Act of 1964. One activist said that blacks were fighting for 'something(freedom) that they don't have themselves', and another suggested that they 'ought to be fighting in Mississippi' as a disproportionate number of blacks were drawn by the lottery conscription. Between 1963-73, 9118 men were prosecuted for tearing up their draft letters, including Muhammad Ali. Angered at the use of chemical weapons, over a million people marched nationwide in The Peace Moratorium of 1969, whilst The Women Strike for Peace, having seen their children in coffins on TV, turned up at The White House every Sunday, for two hours over an eight year period. Soldiers throwing away their medals and veterans speaking against the war only fuelled this sentiment. In 1970, on the 4th May, four students were killed at Kent State University in a protest against the war, after the State Guard had been called in. The Governor of Texas labelled the dead as 'Communists', even though they were indirectly caught up in the protests; this was the first time since WW1 that a Western nation had killed it's own citizens for protesting. All of a sudden, America's message of freedom and democracy had failed in it's own backyard. This public perception, as said earlier, meant that those standing for election to replace Johnson had to promise peace, and assisted by the media, whilst a military victory was possible, the US had lost the battle of morals with its own people. ",
            "date": "Updated March 20, 2018",
            "views": "147",
            "upvotes": " View 59 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Chesire",
                    "user_href": "/profile/John-Chesire"
                },
                {
                    "user_id": "Kien Duy Nguyen",
                    "user_href": "/profile/Kien-Duy-Nguyen"
                },
                {
                    "user_id": "Phil Downey",
                    "user_href": "/profile/Phil-Downey-1"
                },
                {
                    "user_id": "Annu Gonda",
                    "user_href": "/profile/Annu-Gonda"
                },
                {
                    "user_id": "Sameet Pattnaik",
                    "user_href": "/profile/Sameet-Pattnaik"
                },
                {
                    "user_id": "Rick Sanchez",
                    "user_href": "/profile/Rick-Sanchez-113"
                },
                {
                    "user_id": "Pham Gia Hiep",
                    "user_href": "/profile/Pham-Gia-Hiep"
                },
                {
                    "user_id": "Adam Stuhlman",
                    "user_href": "/profile/Adam-Stuhlman-1"
                },
                {
                    "user_id": "Otis Beck",
                    "user_href": "/profile/Otis-Beck"
                },
                {
                    "user_id": "Pedro Morales",
                    "user_href": "/profile/Pedro-Morales-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Sheridan",
                "href": "/profile/Bill-Sheridan-3"
            },
            "answer_text": "I fought in Vietnam in 1969 and 1970. I was an infantry advisor and during the last four months there I was with the 5th Special Forces. During WWII, Ho Chi Minh begged the allies for assistance, saying he would fight the Japanese if they would not allow the French to resume control of Vietnam after the war. After the war, in return for the French surrendering to the Germans, the allies gave Vietnam back to the French. The result was the French-Indochina war. The French lost this war and the result was the splitting of Vietnam into North and South with the North controlled by the communists. Ho Chi Minh had no intention of honoring the peace treaty and soon an insurgency was mounted against the South Vietnamese government. South Vietnam was part of the Southeast Asia Treaty Organization as was the United States. and S. Vietnam requested our assistance. The US soon began sending advisors into S. Vietnam. And things escalated from there. By the end of the war, the local insurgency, known as the VC was dominant mainly in the southern part of S. Vietnam, the Mecong Delta. Elsewhere, most of the major enemy units were N. Vietnamese units. So why did the US get involved in Vietnam? Mostly because of the so called \"Domino Theory\" which stated that communism would spread like a cancer through out Southeast Asia and Australia, etc. if it weren't stopped in S. Vietnam. Of course there were many in the US that felt that we had no strategic interests there. It is true that the US limited fighting outside S. Vietnam because of strategic reasons, but we did bomb N. Vietnam. John McCain, now senator and former presidential candidate was shot down over N. Vietnam while on a bombing mission in 1967, while LBJ was still president. The war was largely fought by draftees, many of whom were black, Hispanic, and poor. Before I joined the Army, I was going to school in Lubbock, TX (Texas Tech). Every week the local paper would publish the names of Lubbock residents killed that week. Usually the soldiers who died has Hispanic surnames or were from the black part of town. Being a student was one way to avoid being drafted. Student deferments caused people to stay in school or to go to graduate school. College didn't cost so much back then. Tuition at Texas Tech both for graduate and undergraduate schools was $50 per semester. As the war drug on and the casualties mounted (we lost over 58,000 US soldiers killed in this war) the war became more and more unpopular. LBJ declined to run for reelection and Nixon became president. He and Kissinger finally negotiated a peace settlement, and in 1973 American troops left Vietnam. The North began invading almost immediately, and Saigon fell in 1975. Saigon is now called Ho Chi Minh City. The US failed utterly and lost over 58,000 KIA. Estimated cost of the war in 2015 dollars is over one trillion dollars. There was also tremendous political upheaval in the US. The Domino Theory proved false. All Ho Chi Minh wanted was to get westerners and western influence out of his country. He did not want Australia or the Philippines. Judging by the mess we have made in the Middle East, we didn't learn much from our defeat. ",
            "date": "Answered March 27, 2016",
            "views": "2861",
            "upvotes": " View 1.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ria Avut",
                    "user_href": "/profile/Ria-Avut"
                },
                {
                    "user_id": "Bill Miller",
                    "user_href": "/profile/Bill-Miller-88"
                },
                {
                    "user_id": "Gogou Chongloi",
                    "user_href": "/profile/Gogou-Chongloi"
                },
                {
                    "user_id": "Jay Dabhi",
                    "user_href": "/profile/Jay-Dabhi-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RISHABH-RAVIPRASAD"
                },
                {
                    "user_id": "Ganesh Ram",
                    "user_href": "/profile/Ganesh-Ram-26"
                },
                {
                    "user_id": "Mike Obi",
                    "user_href": "/profile/Mike-Obi-2"
                },
                {
                    "user_id": "Saijaan Alex",
                    "user_href": "/profile/Saijaan-Alex"
                },
                {
                    "user_id": "Christian Cummings",
                    "user_href": "/profile/Christian-Cummings-1"
                },
                {
                    "user_id": "Pip Nips",
                    "user_href": "/profile/Pip-Nips"
                }
            ]
        }
    ]
}