{
    "title": "Why didn't Russia discover America? With Alaska being so close to Russia what did they think the land to the east was? - Quora",
    "tags": [
        "Alaska (state)",
        "Russia",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lars Eidevall",
                "href": "/profile/Lars-Eidevall"
            },
            "answer_text": "Russia ended by the Ural mountains in the times of Columbus. And Russian colonisation of Siberia mirrored Western colonisation of North America, and the mythical 400 year quest for the Northern passage via America to Asia. Russia defeated the Khanate of Sibir in 1598 and reached the Pacific coast in 1640, bringing smallpox to the natives. In the 1720s, a Swede mapped inland Siberia and suggested a border between europe and Asia along the Urals to the Tsar. By 1740, Danish explorer Vitus Bering had reached the strait of Bering while mapping the North coast of Siberia, and he died at Bering island, having proved a sea passage between the two continents. After that, Alaska was open for Russian plundering from 1784 to 1867. In the 1770s, Spanish sailors explored the West coast of Canada, followed by James Cook. And after the loss of Erebus in the Canadian Arctic in 1840, a Norwegian explorer (Roald Amundsen) and his team finally made it through the Northern passages between Greenland and Alaska (1903-1906). By then, Russia had sold Alaska to USA before the coming of the gold rush. The Norwegian Norse also discovered Newfoundland on the Canadian East coast 500 years before John Cabot and Columbus, and they claimed Greenland and all land West of it from the Pope at the time of the bishopry of Gardar, which ended around 1378CE. ",
            "date": "Updated April 16, 2020",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Igor S. Rossine Gleb",
                    "user_href": "/profile/Igor-S-Rossine-Gleb"
                },
                {
                    "user_id": "Tyson Key",
                    "user_href": "/profile/Tyson-Key"
                },
                {
                    "user_id": "Kaushik Gudapati",
                    "user_href": "/profile/Kaushik-Gudapati"
                },
                {
                    "user_id": "Abhishek Verma",
                    "user_href": "/profile/Abhishek-Verma-975"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Zhubrak",
                "href": "/profile/Sean-Zhubrak"
            },
            "answer_text": "Good question I think the issue is mainly in that we are saying Columbus went to “discover America”. But that wasn’t his intention. Instead, he wanted to find a faster route to Asia…. In other words, everyone knew that Asia was EXTREMELY far east. The Europeans knew that if they traveled east, they would reach the east coast of Asia. But Columbus calculated and determined that if he traveled west by sea, it would be MUCH closer. Turns out his calculations were Extremely off. He had no intentions of landing on another continent at all. So I guess I’m saying, Russia didn’t “discover” America because they werent aware that they should be looking for it, no one in the Russian kingdom suspected that the East coast of Asia would “bridge” into a new continent. Even the Europeans didn’t expect it. It was an accidental discovery. Also, I think it’s very possible that a Russian did discover it, but that explorer never returned to tell anyone…. ",
            "date": "Answered January 2, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Darb",
                    "user_href": "/profile/Brad-Darb-6"
                },
                {
                    "user_id": "Tyson Key",
                    "user_href": "/profile/Tyson-Key"
                },
                {
                    "user_id": "Johenny Lopez Lantigua",
                    "user_href": "/profile/Johenny-Lopez-Lantigua"
                }
            ]
        }
    ]
}