{
    "title": "Why was it difficult for Europeans to obtain spices and other goods from Asia? - Quora",
    "tags": [
        "Spices",
        "European Ethnicities and People",
        "Asia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suzanne Taylor",
                "href": "/profile/Suzanne-Taylor-154"
            },
            "answer_text": "It depends on when you mean. Hundreds of years ago, even as recently as the early 20th century, spices would be transport by sea. Ships were originally powered by sail and were made of wood. They were very slow, taking weeks for that sort of journey, they also used loads of manpower. The goods being transported sometimes got damp. There was no plastic or other waterproof wrapping to use. Methods of preservation and storage weren’t so well developed. Not all the spices starting on the journey to Europe would have arrived, or arrived unspoilt. This would make them very expensive to buy. The journeys themselves weren’t always without mishap. Because many of the spices needed a specific climate to grow, they were simply unknown to the European cook and so weren’t asked for. The spices available were initially brought as novelties, things of interest. So it wasn’t just a question of them not being readily available, they were expensive and difficult to transport and also people just didn’t have the knowledge of how to use them. As people started to move around the world more they started to eat local food and wanted it when back at home. This created a demand. Once there was a demand it was worth shipping spices to Europe, but transporting them was still expensive, making the spices too expensive for the average person to use. Trade between countries was not developed in the way it is now. Communications were poorly developed. Most purchases would be negotiated directly with the grower either in person or by letter which would travel by sea. In an undeveloped country that wouldn’t have been straightforward. So not surprising that in times gone past spices weren’t readily available. ",
            "date": "Answered September 13, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Parker",
                    "user_href": "/profile/Joe-Parker-256"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paolo Carpi",
                "href": "/profile/Paolo-Carpi"
            },
            "answer_text": "It’s so difficult I have to walk down to the market in my city, Genoa, and ask to the stand owner… Europe got spice from Orient and Asia from the Middle Ages, and before… Never heard about the silk road? ",
            "date": "Answered September 13, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankhi Mun",
                    "user_href": "/profile/आखीं-मुन-Ankhi-Mun"
                }
            ]
        }
    ]
}