{
    "title": "Why was 19th century Meiji Japan able to modernize so effectively, but not China? - Quora",
    "tags": [
        "History of Asia",
        "China and Japan",
        "History of Japan",
        "History of China",
        "Culture of Japan",
        "Culture of China",
        "Korean Peninsula",
        "Japan",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaiser Kuo",
                "href": "/profile/Kaiser-Kuo"
            },
            "answer_text": "Note: this was written in response to a similar question that was merged into this one but asked about the different responses at mid-19th century, so this answer focuses only on responses to initial impact. Part of the answer, ironically, is that the Qing dynasty was actually in pretty good shape when it encountered, in force, the power of the west. Look closely of course and there were sure signs of decline from its peak in the Yongzheng and Qianlong reigns, but China was still robust enough to support a kind of complacency and a certain arrogance. China borrowed ideas from outside, for sure, but the periods when these borrowings were happening—the popularization of Buddhism, for instance, or the adoption of Central Asian artistic motifs and musical instruments—happened a long, long time ago from the perspective of mid-19th century China, and by that time, they were regarded as basically Chinese already. There wasn't this sense that borrowing ideas from abroad was something that Chinese people did.  That was never the case in Japan. Japan was very aware of the extent to which it had borrowed. Its very writing system (kanji literally means Han (Chinese) characters), dress (from Tang), architecture (from Tang), governing philosophy (Neo-Confucian), and much more were unmistakably Chinese in origin. And Japan's state wasn't in a place where complacency and arrogance were likely: The Tokugawa bakufu was much more obviously sick, with a heavily indebted, mostly parasitic class of Samurai who made the Bannermen—who were also dissolute and not exactly in fighting shape— Qing look like the picture of health.  Japan benefited too by having a second but still traditional source of legitimacy in the Meiji emperor. It could end the shogunate but pack massive reforms into what was outwardly a \"restoration\" of traditional, imperial authority. China didn't really have something to which it could appeal to sneak westernization in with the imprimatur of revered tradition. Japan had time to react, too, and to appreciate the scale of the threat: By the time Commodore Perry's \"black ships\" sailed into Edo Bay, Japan had already seen what China had gone through at the hands of the British during the first Opium War. They knew that militarily in the 1850s they weren't even a match for the Qing, and look at the drubbing that this much larger, much more resource-rich and traditionally respected neighbor had been given. Then there's something that really doesn't have a grounding in good history but which I actually believe: It's the surface-to-volume ratio—specifically, coastline to land area. Honshu is a long, skinny, island and ideas, trade goods, institutions, technologies, all these things from without penetrate and permeate much more quickly than they would in a country like China. ",
            "date": "Updated December 24, 2014",
            "views": "134",
            "upvotes": " View 148 Upvoters",
            "upvoters": [
                {
                    "user_id": "Achmad Firdaus Gassing",
                    "user_href": "/profile/Achmad-Firdaus-Gassing"
                },
                {
                    "user_id": "Sebastian Jonathan",
                    "user_href": "/profile/Sebastian-Jonathan-6"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Esrarengiz Kanal",
                    "user_href": "/profile/Esrarengiz-Kanal"
                },
                {
                    "user_id": "Michael Zuo",
                    "user_href": "/profile/Michael-Zuo"
                },
                {
                    "user_id": "Kumar Swapnil",
                    "user_href": "/profile/Kumar-Swapnil-16"
                },
                {
                    "user_id": "Alex Edwards",
                    "user_href": "/profile/Alex-Edwards-34"
                },
                {
                    "user_id": "Sam Kinison",
                    "user_href": "/profile/Sam-Kinison-3"
                },
                {
                    "user_id": "Gabriel McKennett",
                    "user_href": "/profile/Gabriel-McKennett"
                },
                {
                    "user_id": "Zhuo Hui Chen",
                    "user_href": "/profile/Zhuo-Hui-Chen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "Thanks to Mikhail Kotykhov for the A2A. This is purely my opinion based on my own experience, schooling and past living there (during and after my formative years). I think it gets at the underlying reasons beyond the historical details (i.e. why the two countries have their own kind of histories). Internal cohesion It boils down to Japan being a more cohesive society by far than China. Even the Chinese themselves have long described Chinese society as \"a pile of loose earth and sand,\" which surely must have a grain of truth to it. (And in my family's general experience, more than a few grains.) For those who are 50-somethings or older (my generation), we grew up (roughly speaking) just accepting the premise in the saying \"the Japanese are good businessmen, but they are better soldiers.\" Despite the portrayals of antisocial or moody youngsters in the popular press, manga and anime, in my direct experience the Japanese are the world's most disciplined people on earth. I recall back in the late 1980s that demonstrators in Tokyo all wore \"protest uniforms\" and had their own \"safety officers\" and \"medical teams\" to handle contingencies. I also recall the punks, greasers and various other subcultures who hang out in the park in Harajuku, Tokyo, nearly always change back to their modest normal dress from their brand of weird gear -- no matter how bloody rebellious they were. Attitudes to the outside It's also a matter of basic national character. The Japanese want to know what's happening on the \"outside\" -- yet keep \"the outside\" at arm's length. In short, they want to know you, but don't like you knowing them. The Japanese do tend to see foreign influence (especially into Japanese society) in terms of \"what's in it for them\" and \"how to better them at their own game.\" By contrast, the Chinese did (and largely still do) tend to view outside influence as \"interruptions of Chinese ancient/customary customs\" and want nothing to do with it. In terms of \"problems,\" the Japanese are more apt to use your strength against you (like in judo) -- instead of the Chinese tendency for \"hard collision\" (硬碰 yìng pèng, Cantonese: ngaang pohng). Competitiveness: 'to be' vs. 'want to be' the top dog Another very real difference when you've got Japanese and Chinese people in front of you in a business setting is their competitive attitude to outsiders. The Chinese attitude is one of \"want\" to be on top. The Japanese is simply \"we will be, just you wait and see.\" That makes for a very different way of operating in your markets. Witness how the West got one helluva  shock when Japan trounced Russia at the Battle of Port Arthur (now Lüshun Port) in north China in 1905. Witness  the camera industry -- Canon, Nikon, Olympus and Mamiya totally killed off Alpa, Voigtlaender and nearly all the Western brands by the 1960s. Witness home electronics -- Panasonic singlehandedly (and casually) pummelled Saba of West Germany into oblivion. The list is endless. This is a carry-over from the old days. Japan was isolationist physically, not information-wise. China was just the reverse: no need to learn from the West -- until things became too late to fix. This is still part of the general psyche of the Chinese, although it is changing. If we can feel this difference in Hong Kong, then it must be quite strong in mainland China. Not the best of answers, I'm afraid, as I've got a heavy cold. (Updated 27 Nov 2014 to move around one or two paras for clarity.) ",
            "date": "Updated January 1, 2016",
            "views": "154",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Li Jianxi 黎建熙",
                    "user_href": "/profile/Li-Jianxi-黎建熙"
                },
                {
                    "user_id": "Liya Shah",
                    "user_href": "/profile/Liya-Shah-3"
                },
                {
                    "user_id": "Esrarengiz Kanal",
                    "user_href": "/profile/Esrarengiz-Kanal"
                },
                {
                    "user_id": "Jonathan Buttall",
                    "user_href": "/profile/Jonathan-Buttall"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Louis Wang",
                    "user_href": "/profile/Louis-Wang-8"
                },
                {
                    "user_id": "Chan Kah Wai",
                    "user_href": "/profile/Chan-Kah-Wai-1"
                },
                {
                    "user_id": "Ilyas Yag'ya",
                    "user_href": "/profile/Ilyas-Yagya"
                },
                {
                    "user_id": "Pheobe Chen",
                    "user_href": "/profile/Pheobe-Chen-1"
                },
                {
                    "user_id": "Ekaterina Louise Kishimoto",
                    "user_href": "/profile/Ekaterina-Louise-Kishimoto"
                }
            ]
        }
    ]
}