{
    "title": "Why is Urmila Matondkar in controversy? - Quora",
    "tags": [
        "Urmila Matondkar (actor)",
        "Bollywoodlife.com",
        "Bollywood News and Events",
        "Times Now",
        "Kangana Ranaut (Indian Actress)",
        "Bollywood News and Entertainment",
        "Sushant Singh Rajput",
        "Bollywood Actors and Actresses",
        "Bollywood",
        "Politics of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Rocky",
                "href": "/profile/Paul-Rocky-1"
            },
            "answer_text": "Urmila Matondkar is in controversy because she wants to be in controversy. Now , everybody has started talking about her because of her interviews and statment about kangana , bollywood and drug. Urmila was 1 or 2 film wonder. She gives some hit movies but her acting career was flop. She was completely forgotten. Then she tried her luck in politics from Congress party in which she losses with more than 4 lakhs votes. After that she became dissppear again :xD. She had no work so makes some youtube video. Now when bollywood is already trening due to various bad reason and everybody is saying something , she suddenly appeared. In an interview, she supported bollywood and attack kangana and said -” First you should talk about your place, Himachal pradesh. Everybody know about Drug connection of Himachal. Why are you silent and why are you not doing something about that.” The main problem of these people is that they think, Mumbai is only for them or Mumbai is like another country. People come from another place have to follow rules and should not say any thing against this. They tweet like “Mumbai hi Hindustan hai” . “Mumbai gives, Mumbai has never taken any thing from anyone” “How can you say against Mumbai” According to bollywood, Mumbai is everything, Mumbai has never taken any thing from anyone. Man!!!! Which city has taken any thing from any person. And Urmila ji, it does not matter from where do you belongs, you don't have power to change anything. You can change or take action or decision in that field in which you work. If you logic is correct then why did you loss from Mumbai election. Urmila further said that - How dare you to said “kya Ukhaad lega” and “TU”to a CM. We are from Indian culture. And in indian culture , woman is someone’s mother, woman is someone’s daughter. You are a woman” So she does not has problem when his one minister said “ Haraamkhor” to kangana and threaten her to break her jaw. Then kangana was not a woman of indian culture ??? I am not saying Kangana is totally right or does not say anything wrong but the way these people trying to save crime and others person is shameful. I can't say about movie but hope Urmila Matondkar gets some role in any webseries. ",
            "date": "Answered September 17, 2020",
            "views": "997",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akshita Sharma",
                    "user_href": "/profile/Akshita-Sharma-469"
                },
                {
                    "user_id": "Namadev Pise",
                    "user_href": "/profile/Namadev-Pise"
                },
                {
                    "user_id": "George Lapakaran",
                    "user_href": "/profile/George-Lapakaran"
                },
                {
                    "user_id": "Radhika",
                    "user_href": "/profile/Radhika-594"
                },
                {
                    "user_id": "Surendra Pratap Singh (सुरेन्द्र प्रताप सिंह)",
                    "user_href": "/profile/Surendra-Pratap-Singh-सुरेन्द्र-प्रताप-सिंह"
                },
                {
                    "user_id": "Kesava Nittala",
                    "user_href": "/profile/Kesava-Nittala"
                },
                {
                    "user_id": "Sudha Ganapathy",
                    "user_href": "/profile/Sudha-Ganapathy"
                },
                {
                    "user_id": "Varun Vamana",
                    "user_href": "/profile/Varun-Vamana-1"
                },
                {
                    "user_id": "Minutha Karkera",
                    "user_href": "/profile/Minutha-Karkera"
                },
                {
                    "user_id": "Yogesh Kumar",
                    "user_href": "/profile/Yogesh-Kumar-2886"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sweta Tomer",
                "href": "/profile/Sweta-Tomer-3"
            },
            "answer_text": "Ms Matondkar criticised Ms Ranaut for comments comparing Mumbai to PoK and said she would \"never tolerate any defamatory remark\" about the city. ",
            "date": "Answered September 16, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Om Ram",
                    "user_href": "/profile/Om-Ram"
                }
            ]
        }
    ]
}