{
    "title": "Why was Charles V so important in the 16th century? - Quora",
    "tags": [
        "16th Century"
    ],
    "response": [
        {
            "author_info": {
                "name": "Logan Wilkerson",
                "href": "/profile/Logan-Wilkerson"
            },
            "answer_text": "Mostly the sheer power he had at his disposal, but several other achievements as well. Charles V’s empire was the closest Europe would reach to having a universal monarch and this justifiably terrified many Europeans.  His lands were not restricted to just Europe though, Spain at the time was also the strongest colonial power.  All this territory makes for quite a powerful monarch. Outside of ruling during the apex of the Hapsburg Empire, his reign also coincided with several significant European events. Charles’ empire would be the driving power behind halting the Ottoman expansion into EuropeHe centralized control of the Aragon and Castilian crowns, actually creating a united SpainThe protestant reformation occurred during this time. Charles policies towards the Germanic states would begin the tension buildup of religious persecution that would lead to the later 30 years warEstablished the Tericos, the first professional army of EuropeSponsored the conquistador expansions that would conquer the Aztec, Mayan and Incan empiresWould strengthen the Spanish inquisition and fully embraced the counter-reformation",
            "date": "Answered May 3, 2017",
            "views": "33",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Antone Mendivil",
                    "user_href": "/profile/Antone-Mendivil"
                },
                {
                    "user_id": "Monhbold Naiman",
                    "user_href": "/profile/Monhbold-Naiman"
                },
                {
                    "user_id": "Sander Vv",
                    "user_href": "/profile/Sander-Vv"
                },
                {
                    "user_id": "Bagus Anugerah Yoga",
                    "user_href": "/profile/Bagus-Anugerah-Yoga"
                },
                {
                    "user_id": "Asad Tariq",
                    "user_href": "/profile/Asad-Tariq-32"
                },
                {
                    "user_id": "Joshua Watts",
                    "user_href": "/profile/Joshua-Watts-16"
                },
                {
                    "user_id": "Jay Sapinsky",
                    "user_href": "/profile/Jay-Sapinsky"
                },
                {
                    "user_id": "Vincent Evens",
                    "user_href": "/profile/Vincent-Evens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Lee",
                "href": "/profile/Tom-Lee-278"
            },
            "answer_text": "Because by luck, his grandparents were legitimate rulers of vast european territories and he was the heir to all of them. From his paternal grandfather - Most of Germany, Savoy, Florence, Genoa From his paternal grandmother - Burgundy, Flanders, Netherlands From his maternal grandfather - Spain except Castile From his maternal grandmother - Castile, Southern Italy, Corsica, Sicily, Milan Not only did he inherit half of western and central Europe from his grandparents, he also inherited the American possessions of his maternal grandparents which were beginning to ship massive amounts of gold and silver back to Europe. So Charles V was the first modern person who had the territory, the army, and the finances to make a serious attempt to rule Europe. ",
            "date": "Answered February 16, 2017",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krushang Shah",
                    "user_href": "/profile/Krushang-Shah-1"
                },
                {
                    "user_id": "Monhbold Naiman",
                    "user_href": "/profile/Monhbold-Naiman"
                },
                {
                    "user_id": "Madalena Tavares",
                    "user_href": "/profile/Madalena-Tavares-4"
                },
                {
                    "user_id": "Sander Vv",
                    "user_href": "/profile/Sander-Vv"
                },
                {
                    "user_id": "Ingibjörg Stefánsdóttir",
                    "user_href": "/profile/Ingibjörg-Stefánsdóttir"
                },
                {
                    "user_id": "Parth Thakur",
                    "user_href": "/profile/Parth-Thakur-1"
                },
                {
                    "user_id": "Rory O'Brien",
                    "user_href": "/profile/Rory-OBrien-6"
                },
                {
                    "user_id": "Isaac Hessel-Robinson",
                    "user_href": "/profile/Isaac-Hessel-Robinson"
                }
            ]
        }
    ]
}