{
    "title": "Why did Ronald Reagan switch from being a Democrat to a Republican in 1962? - Quora",
    "tags": [
        "Reagan Presidency (1981–89)",
        "Ronald Reagan",
        "Republican Party (US politics)",
        "Democratic Party (US politics)",
        "History of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Brohinsky",
                "href": "/profile/William-Brohinsky"
            },
            "answer_text": "Like most people, it is easy to be a Democrat when you are young, inexperienced, and lacking wisdom. It is very hard to continue to support radical changes to a system which is working, and to work hard to continue previous radical changes which are failing. It is fairly normal for people who own property, have written papers they wish to maintain as their own possessions, made some money and learned to save it, and achieved a position of authority or at least trustability among their peers, to turn their political thoughts and aspirations to a more conservative ideology, which focuses on preservation of the individual’s privacy, ownership of property and income in the hands of individuals, and prosperity as a result of work. It is actually a mental aberration for an adult to consider it needful to “rob from the rich to give to the unwilling to work”. This can be seen well in the antics of the leaders of the Democrat party. Even my father, who was a stalwart Democrat all his long life, admitted that Bill and Hillary, Obama and ol’ drunk Joe, were collective embarrassments to the DNC. Fortunately (for him) he didn’t live long enough to see the DNC board sign a contract with Hillary giving her full control over the DNC campaign warchest, or Bernie’s run for President based on a vision of America that is still frozen in 1964, Jill wassname’s rampent Communism. Nor did he have to answer for the DNC’s Muslim and Brainless female Representatives, which would have crushed him, being that his Parents were Jews, and our whole family (yes, even and especially the libertarian and conservatives) believed strongly that Women would make better, or at least as good, leaders as men, only to see the DNC fill its ranks with stereotype women who suffer from continuous PMS, Antisemitism, and in AOC’s case, a total lack of connection to reality, but a diuretic connection between her hindbrain and her mouth. ",
            "date": "Answered April 24, 2019",
            "views": "790",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacquelyn Harper",
                    "user_href": "/profile/Jacquelyn-Harper-2"
                },
                {
                    "user_id": "DC Rogers",
                    "user_href": "/profile/DC-Rogers"
                },
                {
                    "user_id": "John Rennie",
                    "user_href": "/profile/John-Rennie-5"
                },
                {
                    "user_id": "Steve Zinck",
                    "user_href": "/profile/Steve-Zinck-1"
                },
                {
                    "user_id": "Frank Simoes",
                    "user_href": "/profile/Frank-Simoes-2"
                },
                {
                    "user_id": "Bruce Emerson",
                    "user_href": "/profile/Bruce-Emerson-2"
                },
                {
                    "user_id": "Tony Winkler",
                    "user_href": "/profile/Tony-Winkler"
                },
                {
                    "user_id": "Bruce George Sutherland",
                    "user_href": "/profile/Bruce-McKenna-7"
                },
                {
                    "user_id": "Charlie Johnson",
                    "user_href": "/profile/Charlie-Johnson-245"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Cate",
                "href": "/profile/John-Cate-2"
            },
            "answer_text": "For the very legitimate reason that he no longer felt the Democratic Party reflected his ideals. Ronald Reagan fell into line with what was then known as the “Goldwater Republicans,” which were Republicans who were strict constructionists and free-market conservatives, and who took a hard line against Socialism in any of its various forms. Goldwater Republicans were willing to engage in equitable dialogue with Socialist states, but they would not take one step backward to them. Reagan campaigned for Barry Goldwater in 1964, but the country wasn’t ready for him then. It took another 15 years of disastrous policies and the horrible stagflation of the late 1970s before Reagan won the presidency in 1980, running on pretty much the same platform Goldwater had. George Will even wrote at the time that “they finally counted the votes from 1964 and Goldwater won.” Even 22 years later, Reagan’s advertising reflected the Goldwater stance on foreign policy during the Cold War:  There are valid reasons for switching parties, for those who might have read my answer about Andy McKean from earlier today. At the time Reagan switched to the GOP, he was not a politician, although he was well-known in political circles from the speeches he gave. All of the political offices he held were as a Republican. He changed parties because he felt like the then-nascent Goldwater wing of the GOP is what best reflected his views. And even though Goldwater came along too soon, Reagan picked up the torch and eventually became President. It’s just a shame it happened so late in the game for that political faction: John Cate's answer to If Barry Goldwater won the 1964 general election and the re-election in 1968, what role, if any, would Ronald Reagan have played in the Republican Party? ",
            "date": "Answered April 23, 2019",
            "views": "119",
            "upvotes": " View 338 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Graziano",
                    "user_href": "/profile/David-Graziano-4"
                },
                {
                    "user_id": "Jeroen Westmaas",
                    "user_href": "/profile/Jeroen-Westmaas"
                },
                {
                    "user_id": "Advokat Samuel Sihombing SH",
                    "user_href": "/profile/Advokat-Samuel-Sihombing-SH"
                },
                {
                    "user_id": "Samuel Chen",
                    "user_href": "/profile/Samuel-Chen-78"
                },
                {
                    "user_id": "Aman Jain",
                    "user_href": "/profile/Aman-Jain-1518"
                },
                {
                    "user_id": "Ben Levin",
                    "user_href": "/profile/Ben-Levin-39"
                },
                {
                    "user_id": "Roko Marasović",
                    "user_href": "/profile/Roko-Marasović"
                },
                {
                    "user_id": "Evan Darrow",
                    "user_href": "/profile/Evan-Darrow-1"
                },
                {
                    "user_id": "John Hooks",
                    "user_href": "/profile/John-Hooks-13"
                },
                {
                    "user_id": "Brian Klee",
                    "user_href": "/profile/Brian-Klee-2"
                }
            ]
        }
    ]
}