{
    "title": "Why did the US choose Japan and not Germany to nuke? - Quora",
    "tags": [
        "U.S. in World War II",
        "Warfare and Nuclear Weapons",
        "Warfare in the United States",
        "Military History of the United States of America",
        "Nuclear Weapons",
        "Japan",
        "World War II",
        "Germany",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Kwiatkowski",
                "href": "/profile/Richard-Kwiatkowski-1"
            },
            "answer_text": "After the first test, which was successful, the scientific community failed to convince the government to only demonstrate it as a humanitarian gesture to show what would happen if the war continued. However, they did manage to convince President Truman that it should only be used tactically as a “last resort”. Truman mentioned to Stalin during the meetings at Potsdam that the U.S. had made a “new” bomb of “tremendous force”. Stalin was not impressed, he already knew.Organized German military resistance was collapsing and the Russians were closing in on Berlin, so there was no place to demonstrate such a weapon without great harm to civilians since military targets were no longer available (German weapon manufacturing was destroyed by then). German military units were beginning to surrender for lack of petrol and ammunition (and fear of Russians). The civilians were tired of war and were submissive. There was no tactical “last resort” reason to use it.Organized Japanese military resistance was also collapsing, but became less strategic and more fanatic. It was “stand your ground” and “fight to the death”. Army intelligence discovered the Japanese government was training all capable civilians, including old men, women and children over the age of 13, to fight. That is exactly what Japan wanted us to think; that invasion would be too costly in American lives. Our military command estimated the invasion of the Japanese mainland would result in 1 to 1.5 million American casualties. Truman made the decision that this was a tactical “last resort” to end the war as mercifully as possible for both sides and avoid the invasion of the mainland. The use of the bomb was less objectionable than killing women and children in combat and losing a million Americans. This was almost exactly what the president envisioned would be the only way he would use it. To stop a maniacal enemy from fighting to the last man and wasting their entire country, population and culture for a losing (and unjust) cause.As it was, after Hiroshima, the Japanese scientific community immediately knew what had hit them, but argued over whether the Americans had enough fissionable material to have another. The answer came a week later at Nagasaki after Japan failed to answer the U.S. call for surrender. The emperor then intervened and called for the military to ask for terms.The U.S. (as far as I could find out) had enough plutonium for another bomb, but construction of a plutonium bomb is more complex and cannot be done quickly. The U.S. also had enough uranium for two more uranium bombs and those were easy to construct quickly. American industry could have produced enough fission material for 15 bombs over the next month. However, at that moment in time we didn’t want to use any of the few we had without a good tactical reason. There is such a thing as a dud.If you are inquiring because of bias against Asians, it was a 100% military decision that was approved by the president. There was no real need for it in Germany when we were finished making the nukes. Remember too, that we had to capture an airbase close enough to Japan to drop one and we had to manufacture a bomber that could carry it and get away without its wings being blown off. Logistics, logistics, logistics.I have to add this edit to my answer since I’ve received many replies that the first test was after the Germans surrendered. This is true, but in 1943 we had enough Uranium to start a nuclear breeder reactor to produce plutonium. In 1944 we had two breeder reactors producing plutonium. This was the correct thing to do since it would be able to produce fissionable material much faster. Instead of mining a ton of ore, separating the Uranium for the dirt, refining out the U238 from the U235, they could just refine it to 40 % and directly manufacture Plutonium in a breeder reactor. The Uranium in those breeder reactors was only 40% U235 and 60% U238. The U238 was being turned into Plutonium from the neutron bombardment in the reactor. The reason to use an implosion bomb over a projectile bomb is that the implosion bomb has a far more efficient explosive yield/lb. from the fissionable material than a projectile bomb. Also, the manufacture of plutonium permits a much higher production of fissionable material from each ton of pitchblende ore. So, if they really wanted to bomb a dying Germany that had nothing left to bomb and with U.S. and Soviet troops in the battlefield, they could have continued to purify the Uranium into U235 and produced a single projectile bomb before the surrender of Germany but would not have left enough fissionable material ready for Japan. Now THAT would have been stupid. So, when they had enough plutonium for two bombs (one for New Mexico and one for Japan) after the surrender of Germany, they grabbed what fissionable uranium (80% U235) they had on hand for the little boy bomb (Hiroshima). After Nagasaki, they had enough Plutonium to build another bomb. To recap what I just said, we had more than enough fissionable uranium in 1944 to build a bomb but it wasn’t refined enough for a bomb. It was refined enough for a breeder reactor and was producing plutonium. Enough could have been diverted for further refinement to produce a uranium bomb. In fact this is exactly what happened after enough plutonium was produced for two bombs, just in case the “test” failed. I hope this helps to end the “test vs surrender date” comments. They did the right thing. Thanks for the upvotes, guys. ",
            "date": "Updated February 4, 2019",
            "views": "111",
            "upvotes": " View 550 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathon Hanson",
                    "user_href": "/profile/Jonathon-Hanson"
                },
                {
                    "user_id": "Chinmay Limaye",
                    "user_href": "/profile/Chinmay-Limaye-8"
                },
                {
                    "user_id": "Roberto Fronteddu",
                    "user_href": "/profile/Roberto-Fronteddu"
                },
                {
                    "user_id": "Snake Eyes",
                    "user_href": "/profile/Snake-Eyes-92"
                },
                {
                    "user_id": "Sohan Daivik",
                    "user_href": "/profile/Sohan-Daivik"
                },
                {
                    "user_id": "Stefan Hauge",
                    "user_href": "/profile/Stefan-Hauge"
                },
                {
                    "user_id": "Shayan Abbas",
                    "user_href": "/profile/Shayan-Abbas-2"
                },
                {
                    "user_id": "Andrei Girlea",
                    "user_href": "/profile/Andrei-Girlea"
                },
                {
                    "user_id": "Srinivasa Rao",
                    "user_href": "/profile/Srinivasa-Rao-1757"
                },
                {
                    "user_id": "Ethan Sallis",
                    "user_href": "/profile/Ethan-Sallis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Simons",
                "href": "/profile/Timothy-Simons-2"
            },
            "answer_text": "F.D. Roosevelt was still alive when the Battle of the Bulge began. That German offensive made the President more than just slightly perturbed. He called in BG Leslie Groves (military commander of the Manhattan Project), and asked him if they had one of the “gadgets” ready to go, and if so, get it ready for Berlin. The allied forces had recently taken Strasbourg (now in France), where the seat of the German nuclear program was located. Groves personally went to Strasbourg to determine how far along the German program had been. Groves determined that the German program was a very long way from developing a bomb, what they did have was going the wrong way to get there, and most of Heisenberg’s research was pointed at trying to develop a nuclear (pile) for a propulsion system, probably for U-Boats. The US program had enough fissionable material for three bombs. The U235 (Hiroshima) gun type bomb (the gun fired a plug of U235 onto into another plug of 235 on the other end of the barrel) required a large amount of that, difficult to isolate, fissionable material, but it didn’t need to be tested. They had enough plutonium to make two bombs, but the plutonium (squeeze bomb) did need to be tested to see if the complicated, detonation-lensing sequence would work. The Battle of the Bulge lasted less than a month, and, although there was another four months of futile, desperate fighting left in the Germans, the outcome of the war was assured, without the use of a “gadget.” Among many other considerations, Groves wanted at least two bombs for the continued fighting against Japan. One bomb was to let the Japanese know what we had, the second, dropped fairly soon after the first, was to make the Japanese government think a nuclear rain was about to befall them. From various accounts, it would have taken about six months for the US to have another bomb ready to go. Had Hitler crouched behind the Rhine, and the Siegfried line in the west, and used the forces he had squandered in the Second Ardennes Offensive (Battle of the Bulge) against the Soviets, the war in Europe might just have lasted long enough for Berlin to feel a new kind of heat. Of course, because of Roosevelt passing away, and the necessity of bringing Truman up to speed, with the ramifications of the new weapon, and the looming gloom of an invasion of Japan, history might not have changed much. ",
            "date": "Updated July 27, 2018",
            "views": "6657",
            "upvotes": " View 2K Upvoters",
            "upvoters": [
                {
                    "user_id": "The Shimmering Shimmering",
                    "user_href": "/profile/The-Shimmering-Shimmering"
                },
                {
                    "user_id": "Douglas C. Miller",
                    "user_href": "/profile/Douglas-C-Miller"
                },
                {
                    "user_id": "Andj Skdnr Lekbrg",
                    "user_href": "/profile/Andj-Skdnr-Lekbrg"
                },
                {
                    "user_id": "Abdel Rahman El Dib",
                    "user_href": "/profile/Abdel-Rahman-El-Dib"
                },
                {
                    "user_id": "Anand Masti",
                    "user_href": "/profile/Anand-Masti"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Joe-R-210"
                },
                {
                    "user_id": "Edward Hahm",
                    "user_href": "/profile/Edward-Hahm"
                },
                {
                    "user_id": "Tiago João",
                    "user_href": "/profile/Tiago-João-3"
                },
                {
                    "user_id": "Alan Morland",
                    "user_href": "/profile/Alan-Morland"
                },
                {
                    "user_id": "Ricardo Peters",
                    "user_href": "/profile/Ricardo-Peters-3"
                }
            ]
        }
    ]
}