{
    "title": "Why do we say anti-Semite when we mean anti-Jewish? - Quora",
    "tags": [
        "Anti-Semitism",
        "Judaism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Krakowsky",
                "href": "/profile/Susan-Krakowsky"
            },
            "answer_text": "Good question. “Anti-Jewish” would be a more fitting term. The term “Anti-Semitism” was invented by a German Anti-Semite, Wilhelm Marr, 1879. It is interesting that a racist Jew hater got to invent the term for his moral ailment and now the whole world uses it as the legitimate term. The truth is that the term “Semitic,” properly used, denotes a family of languages, like “Indo-European,” and not a “racial’ or genetic or ethnic or cultural category. Antisemitism - Wikipedia “In 1879 German journalist Wilhelm Marr published a pamphlet, Der Sieg des Judenthums über das Germanenthum. Vom nicht confessionellen Standpunkt aus betrachtet (The Victory of the Jewish Spirit over the Germanic Spirit. Observed from a non-religious perspective) in which he used the word Semitismus interchangeably with the word Judentum to denote both \"Jewry\" (the Jews as a collective) and \"jewishness\" (the quality of being Jewish, or the Jewish spirit). “This use of Semitismus was followed by a coining of \"Antisemitismus\" which was used to indicate opposition to the Jews as a people and opposition to the Jewish spirit, which Marr interpreted as infiltrating German culture. His next pamphlet, Der Weg zum Siege des Germanenthums über das Judenthum (The Way to Victory of the Germanic Spirit over the Jewish Spirit, 1880), presents a development of Marr's ideas further and may present the first published use of the German word Antisemitismus, \"antisemitism\". ‘ ",
            "date": "Answered October 21, 2020",
            "views": "252",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mitch Cohen",
                    "user_href": "/profile/Mitch-Cohen-20"
                },
                {
                    "user_id": "Yochanan Ben Hernandez",
                    "user_href": "/profile/Yochanan-Ben-Hernandez"
                },
                {
                    "user_id": "Caroline Ben-Ari",
                    "user_href": "/profile/Caroline-Ben-Ari"
                },
                {
                    "user_id": "Dennis Fischman",
                    "user_href": "/profile/Dennis-Fischman"
                },
                {
                    "user_id": "Martin Handwerker",
                    "user_href": "/profile/Martin-Handwerker"
                },
                {
                    "user_id": "Larry Wallace",
                    "user_href": "/profile/Larry-Wallace-57"
                },
                {
                    "user_id": "Misha Shauli",
                    "user_href": "/profile/Misha-Shauli-1"
                },
                {
                    "user_id": "Courtenay Rule",
                    "user_href": "/profile/Courtenay-Rule"
                },
                {
                    "user_id": "Charles Hiikie",
                    "user_href": "/profile/Charles-Hiikie"
                },
                {
                    "user_id": "Charles Polák",
                    "user_href": "/profile/Charles-Polák"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Duby",
                "href": "/profile/Douglas-Duby"
            },
            "answer_text": "It is called generalization bs. What are semites? They are the people asserted to have been born from Shem, the brother of Ham and Yapeth, who was one of the famous patriarchs in an abrahamic faith. Anyone who is of the linage or Shem is a Semite by definition, and that would include the whole Middle East and more by now. If you are against semites, you are against all of these people. The Jews aren’t the only semites and being against modern Jews is neither racist nor antisemitc, because not only is there not a proof you hate all Shem’s descendants Judaism is a religion and has been treated as such after the Israelites returned to their land and lost their customs and converted their neighbors which they have conquered to their faith, making them so mixed I can’t tell what they are. ",
            "date": "Answered October 22, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}