{
    "title": "Why was history so violent? - Quora",
    "tags": [
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kay",
                "href": "/profile/Jeff-Kay"
            },
            "answer_text": "History can be violent, mostly because we don't bother to write things down when they are boring. Not all of history is about conflict, killing, maiming and rape.  It's mostly about big changes, and big events.   We know a bit about the building of the Acropolis.  Sure, people outside Athens weren't really happy about the extravagant use of taxes, but there weren't any wars started over it. We know a lot about the trading practices and commerce of various ancient countries.  Writing wouldn't be popular without ancient book keeping. We know the (almost) day to day life of the pharaoh Akhenaten, who pretty much stayed away from warfare and just kind of kept to himself in his self made religious commune. There are tragedies, like the Titanic, the Black Death, or Bhopal, India.   Accomplishments, like the first airplane flight, reaching the poles, walking on the Moon, Marco Polo's travels to Asia, and the Seven Ancient Wonders.   Violence is really only a part of history.  But conflict and wars cause upheaval, change the course of empires and generally imprint themselves on peoples memories, either because they won, or because they lost.   It's pretty much like any individual's memories.  Very few of us remember the normal, everyday days.  But throw in a really great birthday party, game winning catch, or after school beatdown, and you remember that for the rest of your life. ",
            "date": "Answered January 29, 2014",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Lê",
                    "user_href": "/profile/Jim-Lê-1"
                },
                {
                    "user_id": "Seth Pace",
                    "user_href": "/profile/Seth-Pace"
                }
            ]
        },
        {
            "author_info": {
                "name": "Musharraf Sheikh",
                "href": "/profile/Musharraf-Sheikh"
            },
            "answer_text": "The other day I was watching a movie named Imitation Games. There was this dialogue “Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. but remove the satisfaction, and the act becomes... hollow.” And now you know why human history was so violent. It was and it is all about satisfaction. Remember Joker from the Dark Knight movie. He killed people for probably no reason(at least he said that) at all but because he felt satisfied doing that. He said that he has got no plans. He's like a dog chasing cars. Once he has it, he wont know what to do with that. So he showed the world that why their was so much violence all around. ",
            "date": "Answered December 16, 2016",
            "views": "16",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vini Chaudhary",
                    "user_href": "/profile/Vini-Chaudhary-2"
                },
                {
                    "user_id": "Wuji King",
                    "user_href": "/profile/Wuji-King"
                },
                {
                    "user_id": "Sweety Pareek",
                    "user_href": "/profile/Sweety-Pareek"
                },
                {
                    "user_id": "Petro Adûnâi Tymoshenko",
                    "user_href": "/profile/Petro-Adûnâi-Tymoshenko"
                },
                {
                    "user_id": "Nancy Mann",
                    "user_href": "/profile/Nancy-Mann-3"
                },
                {
                    "user_id": "Radhika R Babu",
                    "user_href": "/profile/Radhika-R-Babu"
                },
                {
                    "user_id": "Govardhan N(கோவர்தன். என்)",
                    "user_href": "/profile/Govardhan-N-கோவர்தன்-என்"
                },
                {
                    "user_id": "Anurag Kumar",
                    "user_href": "/profile/Anurag-Kumar-253"
                },
                {
                    "user_id": "Raghavendra Raghu",
                    "user_href": "/profile/Raghavendra-Raghu-33"
                },
                {
                    "user_id": "Soubhik Mishra",
                    "user_href": "/profile/Soubhik-Mishra"
                }
            ]
        }
    ]
}