{
    "title": "Why were early cannons made of brass or bronze? - Quora",
    "tags": [
        "Cannons (artillery)",
        "Bronze (metal)",
        "Brass (material)",
        "Weapons",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Middleton",
                "href": "/profile/Paul-Middleton-20"
            },
            "answer_text": "While there are aspects of the lower answers that are part of the point there is one key factor that many do not mention. Bronze and Brass were highly advanced alloys by the time gunpowder reached Europe. Steel and Iron? not so much. Iron is also a very brittle metal. Casting from iron would be a problem because the tools to cut a uniform bore were barely available for it. Doing so would take a long time. This made Iron cannon expensive and dangerous. Both bronze and brass had a tendency to expand rather than rupture under pressure (as long as it was not too much extra pressure.) Steel and Iron tended to shatter. That made steel and iron cannon especially basically a 50% chance of being cannon and a 50% chance of being a bomb that would kill them all in the eyes of gunners. Which made them very cautious when using them, reducing their rate of fire until metallurgy and quality control improved. Nor did the variability of explosive power in gunpowder help. Even a gun tested with double charges and double shot could blow up in your face if it was tested with a weak batch and you got a particularly strong batch. All these combined to make bronze and brass safer, more cost effective and more effective on the battlefield. ",
            "date": "Answered August 30, 2019",
            "views": "789",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Washington",
                    "user_href": "/profile/Thomas-Washington-14"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Jeff Isozaki",
                    "user_href": "/profile/Jeff-Isozaki"
                },
                {
                    "user_id": "Alexander Hogg",
                    "user_href": "/profile/Alexander-Hogg-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Lyon",
                "href": "/profile/Steven-Lyon-5"
            },
            "answer_text": "Casting. The heat and materials required to turn iron or steel into a liquid state for casting were nigh to impossible. Forging them wasn't an option back then as the seam created as well as the possibility of voids that went into forging meant that the force of the explosion will follow the path of least resistance. Meanining you no longer have a cannon but a bomb. The final reason is metallurgy steel making was still more of an art then a science. Bronze they had down pat in roman times. By the early renaissance due to art and other metal work casting bronze became extremely refined. To the point that the casting methods we use today only have incremental improvements over how they did it back then. ",
            "date": "Answered August 28, 2019",
            "views": "455",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Washington",
                    "user_href": "/profile/Thomas-Washington-14"
                },
                {
                    "user_id": "Jason Almendra",
                    "user_href": "/profile/Jason-Almendra"
                },
                {
                    "user_id": "Jeff Isozaki",
                    "user_href": "/profile/Jeff-Isozaki"
                },
                {
                    "user_id": "Todd Scheller",
                    "user_href": "/profile/Todd-Scheller"
                }
            ]
        }
    ]
}