{
    "title": "Why haven’t anyone checked for altitude sickness and Diamox for treatment? - Quora",
    "tags": [
        "Altitude Sickness",
        "Altitude",
        "Medical Treatments",
        "Pharmaceuticals",
        "COVID-19 (2019-2020)",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wilk Dedwylder",
                "href": "/profile/Wilk-Dedwylder"
            },
            "answer_text": "Off the top of my head, the two reasons that jump quickly to mind: Acetazolamide (Diamox) isn't useful in treating high-altitude illnesses. (It does enhance respirations, and has some use in prophylaxis, if it's started a couple of days before ascent, but it has no role in treatment)One form of COVID-19 pneumonia has some aspects that resemble HAPE, but it isn't HAPE, and the pathophysiology is very much different.",
            "date": "Answered April 16, 2020",
            "views": "32",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennie Rowe",
                    "user_href": "/profile/Jennie-Rowe-6"
                },
                {
                    "user_id": "Robert Scoyni",
                    "user_href": "/profile/Robert-Scoyni-1"
                },
                {
                    "user_id": "Lyle Dokken",
                    "user_href": "/profile/Lyle-Dokken-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrea Bianconi",
                "href": "/profile/Andrea-Bianconi"
            },
            "answer_text": "I am not sure I got the question. Anyway, altitude sickness has two aspects of completely different origin, although both related to the lower pressure. Lack of oxygen, to which you body reacts by filing your blood with more red cells, within days or weeks. This does not kill you below 6,000 m if you are healthy, but can make your efforts impossible.External pressure change. It causes small-scale edema in lungs or brain. This may kill you within 24 hours since a time when you were ok, even if it does not necessarily hinder strong efforts. Diamox cannot do much for this, although it is used for edema of different origin and for helping accelerating tolerance against the previous (1) aspect of altitude problems.To understand the difference: if you use oxygen supply as it was customary in Everest climbs, you do not have the problem (1), but problem (2) is still there. The only answer to problem (2) is rise slowly or alternatively rising and descending within a day (edema requires some hours to be produced). If you have it, you must descend as fast as possible, no alternative. ",
            "date": "Answered April 17, 2020",
            "views": "244",
            "upvotes": "0"
        }
    ]
}