{
    "title": "Why aren't the Baltic states part of the CIS states? - Quora",
    "tags": [
        "Canadian Interuniversity Sport (CIS)",
        "Computer Information Systems",
        "Baltic States"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaanis Kruumins",
                "href": "/profile/Jaanis-Kruumins"
            },
            "answer_text": "Because the very essence of CIS is “ex-soviets sans Baltics”. CIS was formed after Baltic states broke free and caused major upstir in the soviet union. Then, CIS was formed as a zombie version of the past union with a pre-requisite that all states within CIS are independent and not integral parts of the union state. The actual independence of all CIS states was questionable for the whole time of its existence, but now when Georgia and Ukraine are essentially out of this deal the whole CIS is largely Russia and a bunch of Russian-controlled Central Asian states. ",
            "date": "Answered February 11, 2017",
            "views": "733",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rainer Vilumaa",
                    "user_href": "/profile/Rainer-Vilumaa"
                },
                {
                    "user_id": "Anindya Permata Widhi",
                    "user_href": "/profile/Anindya-Permata-Widhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehmet Fatih Yüksel",
                "href": "/profile/Mehmet-Fatih-Yüksel"
            },
            "answer_text": "The Baltic states have never considered themselves as SSRs part of the Soviet Union; but simply viewed themselves to be occupied by the USSR, as far as I’m aware all had some sort of government-in-exiles during the Soviet rule, and view their independence during the Soviet break-up not as something new to be proclaimed, but rather a restoration. Therefore, since the CIS is a club of formerly Soviet states (although there is no such written rule), and that they never considered themselves as such, they have never been CIS members. ",
            "date": "Answered January 10, 2019",
            "views": "192",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ingrida Vestartaitė",
                    "user_href": "/profile/Ingrida-Vestartaitė"
                },
                {
                    "user_id": "Carolyn Slap",
                    "user_href": "/profile/Carolyn-Slap"
                }
            ]
        }
    ]
}