{
    "title": "Why do I find medieval history so interesting? - Quora",
    "tags": [
        "Middle Ages (era)",
        "History of Europe",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isaac Hessel-Robinson",
                "href": "/profile/Isaac-Hessel-Robinson"
            },
            "answer_text": "Most of history-and basically anything that happened more than 150 years ago-has no relevance to us today, especially if we are not politicians looking to history for warning signs of economic collapse or war or something like that, and even then it isn’t always that helpful. But there is just something fantastic and indescribably beautifully epic and awesome about the medieval era. It allows our imagination to run wild with swords and armor and romance and chivalry and massive armies clashing together on a backdrop of huge walls and half timbered buildings and religion and oh so many other things. And, if you’re in to that kind of thing (Frodo lives!), elves and trolls an dragons and wizards and magic. And when something captures our imagination, be it Thomas the Tank Engine (I still have a soft spot for trains) or Lord of the Rings, we want to know more about the real life inspiration for it. Some of the earliest non fiction books I can remember reading were about trains. I think I got into Railroad Tycoon 2: Platinum edition even before I started playing Poptropica (I was horrible at it though. I have since revisited it and completed about half of each campaign. The global warming disaster missions are soooooooo hard. So is the Chunnel. I generally connect to Lille and go bankrupt). Similarly, after my dad read LOTR and The Hobbit to me a second time when I was 13 (the first time was when I was about 7; I followed and enjoyed the stories well enough then, but I think I was still a bit young for it), I went into a medieval craze that has lasted to this day. I’m currently reading the Saxon Tales, playing Medieval 2: Total war, writing a fantasy novel set in a content very similar to late medieval Europe that puts realism first (Colorful clothes for everyone! No more boring brown tunics and dresses! Down with Hollywood tyranny!). And even if you’re not into fantasy, or you haven’t ever read LOTR (Heretic! You are a disgrace to all living beings!), there is still an undeniable aura about the middle ages. The uncertainty of so many things (were the men of England really outnumbered 5:1 at Agincourt? Why does spell check want me to change Agincourt to Encouraging? Such mysteries may never be solved, though I suspect the answers are probably not quite and because reasons), the romanticized depictions of warfare and chivalry, and oh so many other things that draw in the adventurous amateur historian. It’s easy enough to say “I am very knowledgeable about WWII”, because it lasted 6 years and everything got recorded by 3857.3 people, give or take 883744774774774747477474774747477474747474747747, but when someone says that about Medieval History, oh, you know that they’re wrong. ",
            "date": "Answered August 6, 2016",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venom Animation",
                    "user_href": "/profile/Venom-Animation"
                },
                {
                    "user_id": "Gabby Keller",
                    "user_href": "/profile/Gabby-Keller-1"
                },
                {
                    "user_id": "Emily Grace Frost",
                    "user_href": "/profile/Emily-Grace-Frost-1"
                },
                {
                    "user_id": "Kendal Strickland",
                    "user_href": "/profile/Kendal-Strickland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriele Kembuan",
                "href": "/profile/Gabriele-Kembuan"
            },
            "answer_text": "Because history is basically a lot of stories, and many of them about people. And in Medieval history, what some individual people do can have a really big impact. How about Isabella of France accusing her sisters in law of adultery and launching two countries into a hundred years war? Or what about Eleanor of Aquitaine, that brilliant woman who divorced a king and married another, and pitted her own son against her husband? Or the controversial Isabella of Castile and her legendary marriage and her conquest of Granada; or the conquest of Constantinople before that and the ingenuity of the Ottomans who bypassed the chains of Galata? And it is still relevant to this day. Human greed, love, lust, power, strategy, cunning. Humanity never goes out of fashion. ",
            "date": "Answered August 6, 2016",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabby Keller",
                    "user_href": "/profile/Gabby-Keller-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Terry-Cupboards"
                },
                {
                    "user_id": "Amileux De Silva",
                    "user_href": "/profile/Amileux-De-Silva"
                },
                {
                    "user_id": "John Siow",
                    "user_href": "/profile/John-Siow-5"
                },
                {
                    "user_id": "Arifa Beh-Afarin",
                    "user_href": "/profile/Arifa-Beh-Afarin"
                },
                {
                    "user_id": "Sameh El-Dessoki",
                    "user_href": "/profile/Sameh-El-Dessoki"
                },
                {
                    "user_id": "Rebecca Warner",
                    "user_href": "/profile/Rebecca-Warner-4"
                }
            ]
        }
    ]
}