{
    "title": "Why did the population of Rome decline so much in the Middle Ages? - Quora",
    "tags": [
        "Rome, Italy",
        "Middle Ages (era)",
        "History of Europe",
        "Roman Empire",
        "Ancient Rome",
        "Populations",
        "Demographics",
        "Ancient History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Marcelo Shäferstein",
                "href": "/profile/Carlos-Marcelo-Shäferstein"
            },
            "answer_text": "The was an immense difference between medieval Rome and ancient Rome on the one hand. Between let us say the 7th and the 14th centuries, the traces of the ancient city were steadily obliterated, so that all that was left to meet the eye was great isolated stacks of ruins, like the Coliseum and the Baths of Diocletion, too vast and solid to be destroyed.  Medieval remains in Rome are by no means common or obvious. We have to search them out, and still more we have to reconstruct the nature of medieval Rome in imagination by the help of documents. Of all the cities of Italy Rome is the poorest in medieval monuments. Population decline, counterurbanisation, collapse of centralized authority, invasions, and mass migrations of tribes, which had begun in Late Antiquity, continued in the Early Middle Ages. The large-scale movements of the Migration Period, including various Germanic peoples, formed new kingdoms in what remained of the Western Roman Empire. In the West, most kingdoms incorporated the few extant Roman institutions. Monasteries were founded as campaigns to Christianise pagan Europe continued. The Franks, under the Carolingian dynasty, briefly established the Carolingian Empire during the later 8th and early 9th century. It covered much of Western Europe but later succumbed to the pressures of internal civil wars combined with external invasions: Vikings from the north, Magyars from the east, and Saracens from the south. The Late Middle Ages was marked by difficulties and calamities including famine, plague, and war, which significantly diminished the population of Europe; between 1347 and 1350, the Black Death killed about a third of Europeans. Controversy, heresy, and the Western Schism within the Catholic Church paralleled the interstate conflict, civil strife, and peasant revolts that occurred in the kingdoms. Cultural and technological developments transformed European society, concluding the Late Middle Ages and beginning the early modern period. Historians from Romance-speaking countries tend to divide the Middle Ages into two parts: an earlier \"High\" and later \"Low\" period. English-speaking historians, following their German counterparts, generally subdivide the Middle Ages into three intervals: \"Early\", \"High\", and \"Late\". In the 19th century, the entire Middle Ages were often referred to as the \"Dark Ages\", but with the adoption of these subdivisions, use of this term was restricted to the Early Middle Ages, at least among historians. But the lack of census, plus the short expectative of life, restricted the knowledge of number of inhabitants of Rome. Difficult to say how much it decreased. ",
            "date": "Answered June 28, 2019",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maleesha Lakshan",
                    "user_href": "/profile/Maleesha-Lakshan-1"
                },
                {
                    "user_id": "Gary Newcomb",
                    "user_href": "/profile/Gary-Newcomb"
                },
                {
                    "user_id": "Nazir Haffar",
                    "user_href": "/profile/Nazir-Haffar"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eamonn Colfer",
                "href": "/profile/Eamonn-Colfer"
            },
            "answer_text": "Some of the aqueducts were broken by the Gothic king Totilla during the Gothic war and the city’s water supply could no longer sustain a large population. By the late 5th century its thought the population was around 70000. Also the loss of North Africa to the Vandals in the early to mid 5th century starved Rome so many would have starved or abandoned the city. The population was expelled by Totilla during the Gothic war and many senators executed. Also the Vandal sack of Rome in 455 is thought to have led to huge numbers of inhabitants being taken to Africa as slaves. The decline of the urban population of the empire probably started in the Crisis of the Third Century though as the roads were full of brigands and farmers were more reluctant to bring their goods to market so the cities became hungrier and some of their inhabitants fled to the countryside where they entered into feudal-type labour contracts with landlords in return for food and a place to stay. ",
            "date": "Updated April 28, 2020",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Valerie",
                    "user_href": "/profile/Brian-Valerie"
                }
            ]
        }
    ]
}