{
    "title": "Why is it called junk food? - Quora",
    "tags": [
        "Prepared Food",
        "Junk Food"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Kamau",
                "href": "/profile/Ben-Kamau"
            },
            "answer_text": "They are called junk because these foods have almost no nutritional value to the body/cells. What happens is that for food to have long shelf life, they are processed and sometimes chemical added to ensure they do not go bad. The processing destroys some enzymes and nutrients contained in these foods. So when you eat these foods, you will just fill up but the body will derive very little benefits from such foods. These foods could actually be the reason behind certain diseases. This is because if you subject your body to junk food over very long periods, you will be depriving your cells nutrients which are necessary for one to be in optimal health. These will be manifested in low immunity and increased level of toxins in the body. When your immunity is low and you have high level of toxins, you easily become sick as the body is weak and cannot fight off some of these ailments. After that you will seek medical help and the doctor will give you drugs. Every drug has some side effects and also the body has deal with the waste coming from the drugs. The liver and the kidneys work to remove waste from drugs. If you take drugs over a very long period of time, you will overwork your kidneys and this sometimes causes kidney failures hence forcing you to use dialysis machine to remove waste from the body. Some of the junk foods especially sugars are addictive, so one can also be addicted to junk food. In view of the foregoing one should avoid junk food the way one avoids poison. Why should you eat something that cause trouble to your body? Can you take poison if you knew it was poison? The answer to this question is NO but many people continue eating junk foods despite being aware that it is causing them harm. ",
            "date": "Answered January 16, 2018",
            "views": "36",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azmin Rasul Chowdhury Shomudro",
                    "user_href": "/profile/Azmin-Rasul-Chowdhury-Shomudro"
                },
                {
                    "user_id": "Tanya Mahara",
                    "user_href": "/profile/Tanya-Mahara"
                },
                {
                    "user_id": "Sharath Pandith",
                    "user_href": "/profile/Sharath-Pandith-1"
                },
                {
                    "user_id": "Piyush Gour",
                    "user_href": "/profile/Piyush-Gour-1"
                },
                {
                    "user_id": "Maulana Nurhuda",
                    "user_href": "/profile/Maulana-Nurhuda"
                },
                {
                    "user_id": "Kuppa Subrahmanyam",
                    "user_href": "/profile/Kuppa-Subrahmanyam"
                },
                {
                    "user_id": "Dipesh Sharma",
                    "user_href": "/profile/Dipesh-Sharma-81"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edwei Alagich",
                "href": "/profile/Edwei-Alagich"
            },
            "answer_text": "Because food labelled as such has almost no nutritional value other than empty kilojoules, is high in saturated fat, salt, sugar and low in fibre and nutrients. American chain brand hamburgers, fried chicken, pizzas and fish and chips all fall into this category. These ‘meals’ have very little vegetable or salad components, and the burgers are made with white bread buns that often have a high sugar content that has an addictive effect. If you have to eat these types of foods, make them an infrequent choice for meals, and when you do, go to your local hamburger joint, and order a burger with lots of vegetables made the Australian way, with tomato, lettuce, beetroot, pineapple and onion plus cut out any bacon, get your fish grilled instead of fried, and have a salad instead of the usual chips, and when you choose pizza, request a smaller one with a thin and crispy base, and ask for lots of vegetable toppings and much less cheese. And generally, cook most of your meals at home; studies show home-cooked meals are generally lower in fat and salt and higher in vegetable/fibre content than food purchased in fast food outlets or restaurants. Ironically there is one ‘fast food’ that is considered a reasonably good choice, and it’s Japanese: sushi and nori rolls. But it’s not classified as junk food. ",
            "date": "Answered January 12, 2018",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Copter The Master",
                    "user_href": "/profile/Copter-The-Master"
                },
                {
                    "user_id": "Dipesh Sharma",
                    "user_href": "/profile/Dipesh-Sharma-81"
                },
                {
                    "user_id": "Kai Alexander",
                    "user_href": "/profile/Kai-Alexander-15"
                },
                {
                    "user_id": "Alicia Parmiter",
                    "user_href": "/profile/Alicia-Parmiter"
                }
            ]
        }
    ]
}