{
    "title": "Why would altitude sickness happen? How is it prevented? - Quora",
    "tags": [
        "Altitude Sickness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Tweety",
                "href": "/profile/Johnny-Tweety"
            },
            "answer_text": "This is literally a copy from the wikipedia page. Sources at the bottom. Altitude sickness—also known as acute mountain sickness (AMS), altitude illness, hypobaropathy, \"the altitude bends\", or soroche—is a pathological effect of high altitude on humans, caused by acute exposure to low partial pressure of oxygen at high altitude. It commonly occurs above 2,400 metres (8,000 feet).[1][2] It presents as a collection of nonspecific symptoms, acquired at high altitude or in low air pressure, resembling a case of \"flu, carbon monoxide poisoning, or a hangover\".[3] The physiology of altitude sickness is based on the following equation:Vgas=ATDk(P1-P2)Diffusion of Pulmonary Gas EquationWhere Vgas is the diffusion rate, A is the area of the lung, T is the thickness of the lung membranes, P1 and P2 are the differences in partial pressure of any gas-but most importantly CO2 and O2-where in high altitudes the partial pressure differences for O2 are low and the differences in partial pressures for CO2 are high. Thus CO2 will have a high diffusion out and O2 will have a low diffusion though the alveolar membranes and into the blood.The body's response to high altitude includes the following: ↑Erythropoietin → ↑hematocrit and hemoglobin↑2,3-BPG (allows ↑ release of O2 and a right shift on the Hb-O2 disassociation curve)↑renal excretion of bicarbonate (use of acetazolamide can augment for treatment)Chronic hypoxic pulmonary vasoconstriction (can cause Right Ventricular Hypertrophy)Ascending slowly is the best way to avoid altitude sickness.[4] Avoiding strenuous activity such as skiing, hiking, etc. in the first 24 hours at high altitude reduces the symptoms of AMS. As alcohol tends to cause dehydration, which exacerbates AMS, avoiding alcohol consumption in the first 24-hours at a higher altitude is optimal. The drug acetazolamide (trade name Diamox) may help some people making a rapid ascent to sleeping altitude above 2,700 metres (9,000 ft), and it may also be effective if started early in the course of AMS.[5] Acetazolamide should be taken before symptoms appear — this is a preventative measure.   The folk remedy for altitude sickness in Ecuador, Peru and Bolivia is a tea made from the coca plant. See mate de coca.Altitude sickness - wikipedia ^ Baillie, Kenneth; Simpson, Alistair. \"Altitude Tutorials - Altitude Sickness\". Apex (Altitude Physiology Expeditions). Archived from the original on 9 January 2010. Retrieved 26 January 2010.^ a b Roach, Robert; Stepanek, Jan; and Hackett, Peter. (2002). \"24\". Acute Mountain Sickness and High-Altitude Cerebral Edema. In: Medical Aspects of Harsh Environments 2. Washington, DC: Borden Institute. Archived from the original on 11 January 2009. Retrieved 5 January 2009.^ The Mountaineers. Mountaineering: The Freedom of the Hills, 7th Edition. Seattle, WA: Mountaineers Books, 2003^ a b c d A.A.R. Thompson. \"Altitude Sickness\". Apex. Retrieved 8 May 2007.^ World Health Organization (1 January 2007). \"CHAPTER 3 Environmental health risks\" (PDF).International travel and health. p. 31. Retrieved 21 November 2009.",
            "date": "Answered July 16, 2013",
            "views": "729",
            "upvotes": " Answer requested by Harry Zhang"
        },
        {
            "author_info": {
                "name": "Jhanvi Gupta",
                "href": "/profile/Jhanvi-Gupta-31"
            },
            "answer_text": "Acute mountain sickness, commonly known as altitude sickness, might develop during the adjustment to the changes in air quality at higher elevations. It mostly happens at about 8,000 feet, or 2,438 meters, above sea level. Altitude sickness may occur once you jaunt to a high altitude too quickly. Breathing becomes troublesome because you are not able to soak up the maximum amount of oxygen. Age, sex or physical fitness have no bearing on your probability of obtaining altitude sickness. Just because you haven't had it before does not imply you will not develop it on another trip. PREVENTING ALTITUDE SICKNESS  Here are some things you can do to avert yourself from acquiring altitude sickness. 1. Climb slowly Your body wants about 2-3 days of slowly going higher so as to regulate the changes. Avoid flying or driving directly to high altitudes. Instead, go up higher day by day, stop to rest, and continue the next day. If you’ve to fly or drive, choose a lower altitude to remain at for 24 hours before going all the way up. When traveling on foot, design your trip up with stopping points at lower elevations before reaching your final destination. Try to advance no more than 1,000 feet each day, and plan a rest day for every 3,000 feet you go higher 2. Eat Carbs  It’s rare we are told to eat additional carbohydrates. But once you’re at a higher altitude, you require extra calories. So pack a plethora of healthy snacks, including lots of whole grains 3. Avoid alcohol  Alcohol, cigarettes, and medications like sleeping pills could make altitude sickness symptoms worse. Avoid drinking, smoking, or taking sleeping pills throughout your trip to higher altitude. If you want to have a drink, wait at least 48 hours to give your body time to adjust before adding alcohol into the mix 4. Drink water  Staying hydrous is also vital to prevent altitude sickness. Drink water regularly during your climb 5. Take it easy Climb at a pace that’s comfortable for you. Don’t attempt to go too quick or engage in exercise that’s too tiring 6. Sleep lower Altitude sickness typically gets worse at night when you are sleeping. It’s a decent plan to try and do a higher climb during the day and then come back to a lower altitude to sleep, particularly if you intend on ascending more than 1,000 feet in a day ",
            "date": "Answered May 13, 2019",
            "views": "206",
            "upvotes": "0"
        }
    ]
}