{
    "title": "Why is Veda called 'sruti'? - Quora",
    "tags": [
        "History of the Vedas",
        "Vedic Hinduism (Historical Vedic religion)",
        "Ancient India",
        "Vedas",
        "Ancient Hindu Epics and Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishnamurti Chandrasekharan",
                "href": "/profile/Krishnamurti-Chandrasekharan"
            },
            "answer_text": "Traditional teaching in India was through ‘Gurukulam’, a simple abode of a teacher, where students of all communities would be brought by their parents, for residential schooling. The children were to lead a simple, frugal and strictly disciplined life, during the period of schooling. Even till the 1950s such schools in modified form, to suit the times, existed in this country, though vastly neutralised from the original concept. Even now, some such exist for learning Veda, shastra (six in number), shrauta and smaarta sutras, advanced studies in Vedas leading upto GHANA PAATHA, and VARNA SAARA KRAMA, BHASHYA,Vedanta and a host of other branches. Unlike the modern teaching methodology of books, notebooks, writing material, blackboard etc as tools, such traditional schools adopted from ancient times to date, oral teaching by GURU, repetition by students, repeat lessons likewise, the number of times depending upon the difficulty of the passage taught, group study by the students, again by oral repetition only, correction by advanced students with respect to alphabets, pronunciation, and correct intonations (for Vedas), repeating the process, till the passage is correctly memorised and the students get confidence of chanting independently, from their memory. No books are kept. Again there was no writing material, long-lasting, which existed in this country, except ‘BHURJA PATRA’ , the leaves made of the bark of the birch tree, and “TAALA PATRA”, tempered palm leaf, which tree grew only in coastal areas. The former was very fragile and required light and lean twig or feather of birds with indegenous colour like ink. The latter required sharp edged nail like writer, with which dots and dashes, curvature etc., could not be written and intonations could seldom be visually represented correctly, which constraint exists even now, due to subtlety involved. Hence, the only teaching and learning methodology was oral and by hearing. The verb root ‘shru’ means to hear and the word ‘shruti’ emanated from this as ‘that which is learnt by hearing or auditory perception’. There is a firmly ingrained belief that the potent virant sounds in waves, existed all through, and were ‘perceived’ by elevated souls, the Rishis, and thus through them, the Vedic Sounds were heard and learnt by all. Each Mantra thus has got a Rishi (a ‘seer’ -mantra drashtaa NOT mantra srashtaa-a creator). Chhandas (the metre of the prosdy) and Devataa (the deity to which the mantra is addressed). This is also a reason for Vedas being called ‘shruti’. Over a period of time, lots of branches of Vedas have gone extinct. The Maitraayani (very few people) and Taittiriiya (large following) of KrishNa Yajurveda, KaaNva (very few) and Maadhyandina (large following) of Shukla Yajurveda constitute overwhelming majority of Hindus, with two branches each of Rg Veda and Sama Veda, too having survived. The last two survivors of one branch each of Atharva Veda were identified after decades of search unde the instructions of the HH Paramacharya of Kanchi Kamakoti PeeTham) and deputing some stuents to learn under their tutelage, His Holiness has ensured the survival of these two Vedas, presently about a hundred Pandits having learnt the same, all NOT original, by birth, Atharva Vedi people but belonging to other vedic schools only. ",
            "date": "Answered July 31, 2019",
            "views": "236",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishnama Ramadurai",
                "href": "/profile/Krishnama-Ramadurai"
            },
            "answer_text": "1)..The simple reason as to why Veda is called as “shruthi-श्रुति’ because these Holy scriptures were taught to students in very ancient days through oral traditions.. 2)..That is Vedas were not in written form..A Guru-(Teacher) used to recite Vedic verses and his students should hear them attentively, with utmost care, memorize and repeat them on command from the Guru..This practice of teaching Vedas continued for millennia.. 3)..As the Vedas were learnt only through ‘hearing’ in ancient days they were /are known as ‘shruthi-श्रुति’. 4)..The Samskrit word “shruthi- श्रुति” has meanings like “hearing’, ‘saying’, ‘listening’, ‘learning’ and a specific meaning as ‘sacred knowledge orally transmitied by the Brahmins from generation to generation’, and also ‘ that which is heard or perceived with the ear’. 5)..Going through the above said meanings you can observe how the name ‘shruthi’ aptly suits ‘Veda’.. ~~~31/07/19~~~~~~~~~~~~~ ",
            "date": "Answered July 31, 2019",
            "views": "221",
            "upvotes": " Answer requested by Apu Das"
        }
    ]
}