{
    "title": "Why did universities appear in medieval Europe? - Quora",
    "tags": [
        "Higher Education in Europe",
        "Middle Ages (era)",
        "History of Europe",
        "Europe",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason St. Pierre",
                "href": "/profile/Jason-St-Pierre-3"
            },
            "answer_text": "Because they were an efficient way to produce highly trained professionals. In the Middle Ages, there was a demand for people with a good education to become doctors, lawyers, and theologians.  All three of which required specialized knowledge that couldn't necessarily be learned through, say, an apprenticeship.  The universities began simply as a way to meet the demand to train them. If you look a little deeper, something more subtle was going on.  We start to see formal schools being founded in the Christian parts of Western Europe as early as the late 8th century - and possibly earlier in Britain and Ireland. There were two factors behind this.  One was that various kings - most notably Alfred the Great and, especially, Charlemagne - were willing to give the schools political and financial support because they needed literate, educated people to help administer their kingdoms.  The other was that the Church was actively trying to promote learning as a means of bringing people closer to God - which meant studying and teaching became a vocation for a good number of priests and monks.  The Church was also key because the only libraries that survived in Western Europe (Spain is an exception here) belonged to the monasteries.  That meant that the Church was pretty much the only organization in the position of producing teachers - because it was the only organization left with an extensive collection of books, the resources needed to copy them, and people with enough time to study them. By the end of the 11th century, we see this blossom into a network of cathedral and monastic schools all across the continent that were free to any boy who attended.  While the quality of education seems to have been pretty good - Orderic Vitalis remarked that in Normandy \"all the monks were seeming philosophers\" - the education was fairly basic.  I don't mean that in the sense that the curriculum was weak - although it was hampered by the slow recovery of classical knowledge - I mean that in the sense that this was the equivalent of a high school education.  The goal was to produce students who were literate, could make a logical persuasive argument, and had some basic training in mathematics, music, and astronomy. At the same time, learning was becoming strongly associated with Christian devotion.  It's no accident that the first major philosopher of the Middle Ages - Anselm of Bec - was famous as a teacher and who argued that the truly faithful will also seek to understand their faith - and who made it his life's work to try to find a way to provide a strong logical argument for his beliefs.  The basic belief was that God was a rational being who created a rational universe that humans could largely understand - in fact trying to understand the universe, what we would call science, could be seen as a devotional act within this framework. With those conditions in place, it was only a matter of time before institutions developed to teach more advanced topics, particularly the ones mentioned above: law, medicine, and, more broadly, philosophy, which, at the time, included both theology and science.  The medical schools came first, starting with the University of Bologna in 1088.  It was quickly followed by Oxford (c. 1096), which became known for its scientists and mathematicians; Paris (c. 1170, if not earlier), which was famous for its theology program; and probably Salamanca and Padua.  Within a few centuries, you had some 80 universities scattered across Europe, many of which are still in operation. Medieval law played a key part in their development.  The fact that the universities were an offshoot of the Church was significant: it meant that the masters, what we would call the faculty, and their students were technically in religious orders and were therefor supposed to be exempt from secular justice.  At the same time, the idea of corporate government existed in medieval law, which allowed the faculty the rights to govern themselves.  Both ideas gave the universities the autonomy they still enjoy today - in fact the idea that a university is supposed to be largely free of political and economic pressures comes straight out of the Middle Ages.  At the same time, the fact that the universities shared the same language, Latin, and grew out of an organization that saw itself as transcending borders, the Church, meant that a degree granted by the university was recognized anywhere in Europe.  A doctorate from St. Andrews was just as valid in Krakow as it was in Scotland.  Both these ideas were revolutionary and are still considered fundamental to higher education to this day. ",
            "date": "Answered September 8, 2015",
            "views": "16",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Federico Bruzone",
                    "user_href": "/profile/Federico-Bruzone"
                },
                {
                    "user_id": "Chan Kah Wai",
                    "user_href": "/profile/Chan-Kah-Wai-1"
                },
                {
                    "user_id": "Emma Sjöström",
                    "user_href": "/profile/Emma-Sjöström-5"
                },
                {
                    "user_id": "ChildrenOfTheFuture",
                    "user_href": "/profile/ChildrenOfTheFuture"
                },
                {
                    "user_id": "Yu Tsai",
                    "user_href": "/profile/Yu-Tsai"
                },
                {
                    "user_id": "Dina van der Sandt",
                    "user_href": "/profile/Dina-van-der-Sandt"
                },
                {
                    "user_id": "Jan Crol",
                    "user_href": "/profile/Jan-Crol"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marcos-Ferrari-1"
                },
                {
                    "user_id": "Marcell Rába",
                    "user_href": "/profile/Marcell-Rába"
                },
                {
                    "user_id": "Long Nguyễn Thanh",
                    "user_href": "/profile/Long-Nguyễn-Thanh-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karin Zetterberg",
                "href": "/profile/Karin-Zetterberg-1"
            },
            "answer_text": "My basic understanding is this: Universities appeared as part of the commercial revolution in late medieval Europe. Reforms in banking and accountancy called for a more elaborate legal system, and for experts in this area. The Church was a dominant financial actor at this time, and needed professionals to handle the growing complexity of its organization. The first students were priests, who travelled to legal experts in Northern Italy in order gains skills that would enhance their career within Church bureaucracy. ",
            "date": "Answered September 4, 2015",
            "views": "317",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Christian Desaix",
                    "user_href": "/profile/Christian-Desaix"
                }
            ]
        }
    ]
}