{
    "title": "Why did the Zulfikar Ali Bhutto rule end in 1977? - Quora",
    "tags": [
        "Zulfiqar Ali Bhutto",
        "History of Pakistan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Javed Kaleem",
                "href": "/profile/Javed-Kaleem"
            },
            "answer_text": "Zulfiqar Ali Bhutto was a rude and shrewd politician who came to power for supporting General Ayub Khan who imposed Martial Law in 1958. But when Ayyub Khan failed to liberate Indian occupied Kashmir and ended 1965 war without liberating Indian occupied Kashmir, he fell from grace. Bhutto used Ayub’s unpopularity to incite people resulting in another Martial Law by Ayub’s second in command, General Yahya Khan. India had a keen eye on Pakistani politics and utilized the chance to invade East Pakistan. Pakistan army was ill prepared to take on India and using the distance between Pakistan and her eastern wing, invaded East Pakistan. She initiated war by sending so-called mukti bahini and then by sending its regular army troops. Pakistan protested but neither UNO nor OIC came to Pakistan ’s rescue. Thus the history observed for the first time defeat of a Muslim Army by coward Hindus. Having lost its respect the army establishment decided to use religious parties to contest elections against Bhutto. Religious parties JUI, JUP and Jamaate Islami obliged and joined hands with army. They lost the election and blamed ZAB for manipulating poll results. Their protest enabled Army Chief Ziaul Haq to impose Martial law in the country. Ever since Pakistan Army has conquered its own country. It allows India to threaten Pakistan and prefers to restrict to war of words. It relied help of USA or China rather than relying on Divine Support. Allah (swt) has said in holy Quran: If Allah helps you, no one can defeat you and if He leaves you, then who can help you? ",
            "date": "Answered November 3, 2018",
            "views": "889",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allauddin Kakar",
                    "user_href": "/profile/Allauddin-Kakar-3"
                },
                {
                    "user_id": "Areeba Abid",
                    "user_href": "/profile/Areeba-Abid-5"
                },
                {
                    "user_id": "Abdullah Qasim",
                    "user_href": "/profile/Abdullah-Qasim-3"
                },
                {
                    "user_id": "Ram Hatti",
                    "user_href": "/profile/Ram-Hatti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Eijaz",
                "href": "/profile/Muhammad-Eijaz-1"
            },
            "answer_text": "General Zia -ul-Huq staged a Coup d'état and assumed power. Operation Fair Play - Wikipedia ",
            "date": "Answered December 5, 2017",
            "views": "355",
            "upvotes": "0"
        }
    ]
}