{
    "title": "Why did the Chinese invent gunpowder but did not use it in warfare? - Quora",
    "tags": [
        "Gunpowder",
        "Warfare in China",
        "Chinese (language)",
        "Invention and Inventions",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yu-Hsing Chen",
                "href": "/profile/Yu-Hsing-Chen-1"
            },
            "answer_text": "It's a fairly common misconception, the Chinese did use gunpowder in warfare quite a bit , it wasn't until say... the 17th century or later that the west clearly developed further than China in that department.   This is called a tiger crouching cannon, it was probably the most overall common east asian (they were also used in Korea, and to some extend Japan) cannon during the 15th - 17th century. size may vary, but generally they were much smaller than European cannons of the period (especially towards the later part.)      this is probably the most distinctively asian gunpowder weapon, rocket arrows, the concept is obviously simple, a big cracker to a arrow and let it fly, the arrow provide penetration and a little bit of stabilization in flight, and the cracker provide propellation and some explosive / fire damage . this was used a lot in the Ming dynasty and Joseon Korea . the myth busters series have a chapter where they tried to recreate it via the korean design and it turned out quite well.   In the Siege of Pyongyang (1593) the Ming army used a huge number of these to retake the city from the Japanese forces, it reportedly set most of the city on fire, and they succeeded in taking a pretty well defended city in half a day. IIRC from the first hand documents i've read, they must have prepared over 20k individual pieces of arrows.  in Siege of Haengju a few months later the Koreans used it to tremendous success on defense. there are also a lot of variants you can play with these sort of weapons (smoke, stink bomb etc.) The Chinese gave up on these sort of weapons after the Ming mostly (the main problem is logistics, these are shoot and forget weapons but they cost quite a bit and is both hard to replace and stock. you keep a musketball there for 20 years and it probably still works, you keep these things for more than a year and it's probably useless. ) but the Indians made their own version in Mysorean rockets which ultimately lead to the first European copies which only came in the early 19th century  , where as the original Chinese version must have existed since the 14th century at the latest (and most likely earlier. though the original versions probably were fired from bows.) ",
            "date": "Answered June 11, 2015",
            "views": "73",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Hooi",
                    "user_href": "/profile/George-Hooi-1"
                },
                {
                    "user_id": "Steven Villareal",
                    "user_href": "/profile/Steven-Villareal-2"
                },
                {
                    "user_id": "David M. Prus",
                    "user_href": "/profile/David-M-Prus"
                },
                {
                    "user_id": "Luca Fagioli",
                    "user_href": "/profile/Luca-Fagioli-1"
                },
                {
                    "user_id": "Victor YM Lai",
                    "user_href": "/profile/Victor-YM-Lai"
                },
                {
                    "user_id": "Александр Кислов",
                    "user_href": "/profile/Александр-Кислов"
                },
                {
                    "user_id": "Su Sim Tee",
                    "user_href": "/profile/Su-Sim-Tee"
                },
                {
                    "user_id": "Wang Shuai",
                    "user_href": "/profile/Wang-Shuai-58"
                },
                {
                    "user_id": "Casey Looney",
                    "user_href": "/profile/Casey-Looney-1"
                },
                {
                    "user_id": "Jay Yan",
                    "user_href": "/profile/Jay-Yan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Organ",
                "href": "/profile/Michael-Organ-1"
            },
            "answer_text": "There is a fairly simple answer to this. China was a unified and very powerful entity were invention was strictly controlled by the state. This actually is detrimental to development so although the Chinese developed the Fire Lance that was it they had no desire to push on and anyway the technology was poor with the weapons only lasting for a few uses. Because of this chinese fire lances were not very accurate and unreliable. They were almost as dangerous for those using them as those being aimed at. Troops with pointy weapons were a whole lot more reliable. Also I don't think the Emperor wanted them to because if they did make them better then the peasants could get hold of them and good night Emperor. On the other hand the Europeans were divided with competing Nations who were rich and powerful. Those nations competed fiercely. In Europe it was an arms race which is why in 30 years the Europeans advanced the primitive fire stick invented over 200 years or more before by the chinese into an array of formidable and devastating weapons. Also chinese iron was not of high enough quality to withstand refined black powder but the Europeans also took Ironmaking to new heights. When the Dutch brought modern firearms to the Japanese, overnight Japan was revolutionised and it heralded the end of the Samurai. After all why do you need to spend years training a bunch of swordsmen when those same swordsmen can be cut down by a peasant with a gun after only a day's instruction. Think Indiana Jones facing the big sword wielding arab in the souk. Jones stops looks up to the sky as if to say wtf and then pulls out a gun and just shoots the poor bugger, turns away with a look on his face that says why did he bring a knife to a gunfight. Don't get me wrong it wasn't because the chinese were incapable but when everything is controlled by a central authority progress is slow or non existent and the Chinese paid for that big time. The French also fell into this trap in the 18th century and whilst Britain became an empire the French ended up bankrupt. So the moral is don't centralise and make it a competition that's the way to do it. I just wanted to add that although the Europeans adopted an array of fire arms it didn't end the use of the longbows which was used right up to the 18th century. A good longbow was far more accurate over shorter distance than a firearm, until truly modern muskets were developed. Cannon were used alongside longbows by the English army as a matter of course. ",
            "date": "Answered January 26, 2017",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Hooi",
                    "user_href": "/profile/George-Hooi-1"
                },
                {
                    "user_id": "Miro Kärkkäinen",
                    "user_href": "/profile/Miro-Kärkkäinen"
                },
                {
                    "user_id": "Alexander Serebriansky",
                    "user_href": "/profile/Alexander-Serebriansky"
                },
                {
                    "user_id": "Stuart Pollock",
                    "user_href": "/profile/Stuart-Pollock-1"
                }
            ]
        }
    ]
}