{
    "title": "Why did Winston Churchill dislike the Irish? - Quora",
    "tags": [
        "History of the Republic of Ireland",
        "Winston Churchill",
        "Ireland (island)",
        "History of Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomás Reddan",
                "href": "/profile/Tomás-Reddan"
            },
            "answer_text": "Hmmmm. I had to think about this as I have never considered Winston Churchill to dislike the Irish, in many ways I like his bluntness, he said what he thought, it wasn't sugar coated, he was very much a man of his time and trying to explain his attitudes or opinions in relation to modern times, standards and current events or with the benefit of hindsight does him a disservice. He did have a flair for drama. But I am also unsure what gives the impression he disliked the Irish? Churchill’s younger years (from age 2–6) were spent in Ireland, as his Grandfather was the 7th Duke of Marlborough and Lord Lieutenant in Ireland from 1876–1880. He had Irish cousins, his Aunt's both married Irish men, he learnt oratory from a Sligo man who had emigrated to the USA William Bourke Cockran who was in a relationship with his mother, and credits him as his first political mentor and one of his influences. I cannot see someone who had close ties to Ireland and was encouraging of his cousin Shane Leslie's attempts to break into Irish politics as anti Irish or having dislike for them. Yes initially when he was first elected an MP in 1900 he was a conservative MP and his political view reflected the then held views of the Conservative and Unionist party, he was very much a unionist and imperialist and against home rule for Ireland at this time, but I don't think this was due to dislike for the Irish, it was a political belief that many English and even some Irish had then. It was very much something his generation was proud of and raised in that way. The British Empire was a huge source of national pride, much the same way Americans nowadays are raised to have pride in their flag. I think that has to be kept in mind, they grew up with the view it was a benefit for everyone, it made Britain great in their view and I'm sure a lot of normal British people at that time knew little about conditions or anything else in the empire, just they had an empire and controlled huge swathes of the world (I know they aren't comparable but the American flag would be the only really modern example of the same line of patriotism, pride and being raised with a belief I could think of). I can’t view his view as dislike for Irish people. He did switch view later when he joined the Liberal party and became in favour of home rule for Ireland, he was threatened by Unionists in Belfast in 1912 for expressing such views, He did mock Ulster unionist politicians in parliament after this, in his own unique way and, I think the timing of the passing of the home rule bill in 1914 along with the outbreak of WW1 was in many ways a blessing for Ireland. Unionist Politicians from the North James Carson and Edward Craig, had been gathering support against home rule from Dublin and achieved over 100,000 signatures of men ready to fight, (100,000 was the target, they achieved over double this) to prevent home rule “using all means necessary” according to their Ulster covenant. This was a huge contributor to the partition of Ireland and while Churchill, supported home rule and the formation of the free state, he also supported partition through Northern Ireland's opt out, although he admitted that Irish unity was his preference and the Liberals desired policy. I think this was simply a case of sensible politics on his part and had nothing to do with disliking anyone. He realised the unionist in the North would wage a civil war against the South and from a political standpoint his view was this was a sensible approach to avoid it. Again I don't think this represents dislike for Irish people. I do think in many ways Churchill like everyone had his flaws, eg the Black and Tans which is credited as his “brainchild”, but at the same time, I think he was very much following the traditional British responses to uprisings or rebellions throughout history, in his then role as British minister for war. I'm not condoning the actions, but I think it's important to consider the time and both sides views and the then British government was largely ignorant of Irish affairs. Not that these events should be forgotten or downplayed by either side. But I don't think this was out of dislike on his part. However he also formed a working relationship during this time with Michael Collins. I see many historians and they try and up play this relationship and while it is known they had dinner together on occasion, I don't believe there was any great friendship. I do believe they had a degree of mutual respect for the other but, ultimately I think their individual aims prevented any kind of friendship as many do try and suggest. Collins wanted independence for the whole of Ireland, while Churchill wanted Ireland to remain in someway part of the empire and preferable in the UK, neither man's views on this were compatible but, both seem to have enough mutual respect to try and build a working relationship. It’s worth noting Churchill in his writings described Collins, writing after his death “He was an Irish patriot, true and fearless” (The World Crisis Volume IV: 1918-1928: The Aftermath, W. Churchill). High praise for a person from a group he disliked. Again I just can't see this disliked Irish people idea. During WW2 he was critical of De Valera’s government's policy of neutrality, especially in his VE day speech but, took care to give credit to the Irish men who had fought in the war. De Valera’s reply speech to Churchill's criticism was pretty epic and imo everyone should hear it, De Valera was calm, measured, understanding and gave Churchill credit for not infringing on Ireland's neutrality, He did wait three days before replying but he explains why in his speech. His speech and the hypothetical situation he finishes with, doesn’t get the attention or credit it deserves. De Valera shows great understanding of Churchill’s views. The criticism was never about dislike of the Irish, but Churchill’s view the war needed to be won at all costs and putting his country's needs first, and Ireland did not play along with those needs, He was not the only leader from another country to think this way, one example being the American President Roosevelt, who tried to make demands about closing the German embassy and their were genuine fears the Americans would interfere in Irish neutrality. (I think it's important to note this as people seem to have a misguided belief it was just the British were a threat to it). De Valera understood that and in his reply clearly shows he was doing the same, putting his people's needs first and the polls clearly supported him on the issue of neutrality. That to me is not dislike, but differences of opinion. De Valera and Churchill had many similarities but, also many differences. I don't think they were particularly fond of the other in the early years. They both had some colourful quips about the other at times, Churchill did seemed to harbour a degree of resent against De Valera stemming back to the 1921 Treaty negotiations and De Valera’s refusal to attend many historians however have also noted that De Valera never publicly admitted he was in the wrong, but he did wrestle with this decision in private. Churchill and De Valera did keep in touch throughout the war and Ireland was not unique in its neutrality, there were others. I don't think anyone can be expected to like everyone though and basing a view on Irish people on one person is narrow minded. He maybe didn't like De Valera initially, but both men especially in later years did have a level of respect for the other, after their one and only meeting at Downing Street in 1953, Churchill remarked to his physician Lord Moran “A most agreeable occasion. I like the man.” after having Lunch with De Valera. In conclusion I can find no evidence supporting Churchill’s supposed dislike for the Irish. I find his interactions with Irish politicians seem to have the same flair for drama and controversy as with his English counterparts. He was a supporter for many things the Irish people wanted, earlier than most of his counterparts such as home rule. Yes he was very much in support of the commonwealth and the Empire, i think in that respect he had views similar to others of his generation. As the man himself said “We have always found the Irish a bit odd. They refuse to be English.” I actually quite like that quote, I am glad we refuse to be English, but I think that quote illustrates his high regard for his own country, while showing his lack of understanding for others to feel the same way about theirs ",
            "date": "Answered May 22, 2017",
            "views": "43",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Huddart",
                    "user_href": "/profile/Peter-Huddart-1"
                },
                {
                    "user_id": "Paul Condon",
                    "user_href": "/profile/Paul-Condon-30"
                },
                {
                    "user_id": "Brian Stewart",
                    "user_href": "/profile/Brian-Stewart-365"
                },
                {
                    "user_id": "John Rodgers",
                    "user_href": "/profile/John-Rodgers-169"
                },
                {
                    "user_id": "Evelyn Gallagher",
                    "user_href": "/profile/Evelyn-Gallagher"
                },
                {
                    "user_id": "Michael Collins",
                    "user_href": "/profile/Michael-Collins-377"
                },
                {
                    "user_id": "Cormac Hugh Neeson",
                    "user_href": "/profile/Cormac-Hugh-Neeson"
                },
                {
                    "user_id": "Gavin Crowley",
                    "user_href": "/profile/Gavin-Crowley-1"
                },
                {
                    "user_id": "John Joseph Mc Dermott",
                    "user_href": "/profile/John-Joseph-Mc-Dermott"
                },
                {
                    "user_id": "Graeme Leggett",
                    "user_href": "/profile/Graeme-Leggett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Tempest",
                "href": "/profile/Stephen-Tempest"
            },
            "answer_text": "This is what Churchill said about the Irish in February 1918: History and poetry, justice and good sense, alike demand that this race, gifted, virtuous and brave, which has lived so long and endured so much should not, in view of her passionate desire, be shut out of the family of nations and should not be lost forever among indiscriminate multitudes of men. He favoured home rule for Ireland, which led to him being mobbed by angry Ulster Unionists during his visit to Belfast. He was close friends with Michael Collins. He disliked Éamon de Valera, not because de Valera was Irish, but because Churchill saw him as trying to foment division and hatred between the British and the Irish. There were two caveats. First, as a British Empire nationalist Churchill was reluctant to see his homeland weakened. His favoured solution was for Ireland to become a self-governing ally of Britain, closely linked in a 'federation of English-speaking peoples all over the world', not a fully neutral and independent state. There were thus limits on his goodwill, and some of his remarks over the years display something of a patronising or dismissive attitude towards Ireland. After all, Churchill was a small-c conservative all his life (and a capital-C Conservative for most of it), which meant he believed in a natural hierarchy and people knowing their place in life. The strong, he believed, did have a moral duty to protect the weak; but in return, he expected the weak to show gratitude for their protection. That's why he had such a visceral hatred of Communism, where the weak join together to pull down the strong. Nationalist movements against the British Empire triggered the same instinct in him, even while he could criticise the Empire if it failed to live up to what he saw as its moral duties. Secondly, Churchill made a a good friend but a bad enemy. His support for compromise and goodwill only lasted as long as he believed the other party was negotiating in good faith and desired a mutually satisfactory agreement. Against self-declared enemies, he was ruthless and uncompromising. That attitude revealed itself most famously in his opposition to Hitler and the Nazis, but it also influenced his dealings with Irish Nationalists. If Sinn Féin was willing to sit down at a table and negotiate with the Ulster Unionists and with the British Government, Churchill would encourage that, and even make speeches urging Parliament to agree to their terms. But when the IRA began murdering British postmen and police officers, Churchill reacted with fury, and his instinctive reaction was not to submit to the IRA's demands, but to send a group of ex-soldiers to go to Ireland and murder them back. So no, he didn't hate 'the Irish' in general. He hated those specific Irish people who hated the British Empire, to which he was loyal. ",
            "date": "Answered January 30, 2019",
            "views": "14",
            "upvotes": " View 354 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Essam Mahmood",
                    "user_href": "/profile/Essam-Mahmood"
                },
                {
                    "user_id": "Stephen Radley",
                    "user_href": "/profile/Stephen-Radley-3"
                },
                {
                    "user_id": "William Morrison",
                    "user_href": "/profile/William-Morrison-43"
                },
                {
                    "user_id": "John O'Connell",
                    "user_href": "/profile/John-OConnell-162"
                },
                {
                    "user_id": "Brian Stewart",
                    "user_href": "/profile/Brian-Stewart-365"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/CW-M"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                },
                {
                    "user_id": "Abbey Laurel-Smith",
                    "user_href": "/profile/Abbey-Laurel-Smith"
                },
                {
                    "user_id": "Tom Keegan",
                    "user_href": "/profile/Tom-Keegan-15"
                },
                {
                    "user_id": "Monty Pitts",
                    "user_href": "/profile/Monty-Pitts"
                }
            ]
        }
    ]
}