{
    "title": "Why were Jews sent to concentration camps? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jes Janicki",
                "href": "/profile/Jes-Janicki"
            },
            "answer_text": "Mr. Insanity had a few mishaps occurs to him while fighting WW1 or “The Great War.” He suffered temporary self induced hysteria which resulted in self induced blindness for a wee bit. Once the Great War was over, Hitler (a failed artist with this pseudo Oedipus complex with his mom, whom eventually died, leaving young Adolf alone and useless. He's the poster child of narcissism, so without his mumsie telling him how awesome he was, he failed to get into art school (although he was a decent artist) so he chose politics. Why the Jews? Simple. They were a threat to Nazi Germany. Most were educated, business savvy, doctors, lawyer's, and Hitler's excuse as to why the German currency (after WW1) was so worthless, people were using it to wipe their butts. When there is such a defect in the economy, someone is always to blame, right? Lil Adolf didn't have a problem with Jews while serving in the Great War. It wasn't until AFTER Germany lost when Hitler put the accountability and reasoning into the Jews. These poor folks have been persecuted from the beginning of time. So Adolf just followed suit, I suppose. Isn't it sad how a specific belief can dictate so much? Hitler himself wasn't exactly 100% sure of his lineage cause his dad was a man whore, so some even say good ol Hitler probably had a wee bit of Jew somewhere in his family tree. He was also said to be a participant in same gender relations, incest (with a much younger niece, who subsequently committed suicide along with 3 other Adolf lovers) and rarely had any type of intimate relationship with Ava Braun. I also read somewhere that he only had one testical and a chode. This man was nothing more that an insecure, lying, narcissistic, in the closet, (not R. Kelly style either) addict who got off torturing those who were better than him. He just had a gift for showing off and convincing. Add to that, the threat of death and you have a lethal combo for population control. I don't and can't guarantee the accuracy of my comments, some is speculative while some theories do have credible and scientific evidence backing his claims. If you have Netflix, I suggest watching the documentary “Hitler's Children.” This very good.And remember. It wasn't just the Jews he went after. It was anyone less than his specified standard.",
            "date": "Answered January 18, 2017",
            "views": "791",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bashir Anastas",
                "href": "/profile/Bashir-Anastas"
            },
            "answer_text": "Primarily because of false allegations that wartime Germany had been betrayed by an enemy within. ‘Antisemitism’ arose in the early Weimar years, led by the paramilitary Freikorps. The Protocols of the Elders of Zion circulated widely in the early 1920’s but the second half the 1920s were prosperous, and antisemitism was much less noticeable. When the Great Depression hit in 1929, it surged again as Adolf Hitler and his Nazi party promoted virulent antisemitism. Perceived undue control by Jews of German society contributed to the problem. According to Sarah Gordon (Hitler, Germans and the \"Jewish Question\"; Princeton University Press, 1984) - 'Jews were never a large percentage of the total German population; at no time did they exceed 1% of the population during the years 1871-1933.' But she adds 'Jews were overrepresented in business, commerce, and public and private service.. They were especially visible in private banking in Berlin, which in 1923 had 150 private Jewish banks, as opposed to only 11 private non-Jewish banks.. They owned 41% of iron and scrap iron firms and 57% of other metal businesses.. Jews were very active in the stock market, particularly in Berlin, where in 1928 they comprised 80% of the leading members of the stock exchange. By 1933, when the Nazis began eliminating Jews from prominent positions, 85% of the brokers on the Berlin Stock exchange were dismissed because of their \"race\".. At least a quarter of full professors and instructors (at German universities) had Jewish origins.. In 1905-6 Jewish students comprised 25% of the law and medical students.. In 1931, 50% of the 234 theatre directors in Germany were Jewish, and in Berlin the number was 80%.. In 1929 it was estimated that the per capita income of Jews in Berlin was twice that of other Berlin residents..' etc etc. (Source) Here is a Jewish answer. (US Holocaust Museum) — Links within the answer are contemporary and ‘anti-Jewish.’ The basis for Nazi antisemitism—prejudice against or hatred of Jewish people—was the Nazis’ distorted worldview of human history as racial struggle. The Nazis falsely considered the Jews to be a race. They incorrectly believed Jews had a natural impulse, inherited through generations, to strive for world domination, and that this goal would not only prevent German dominance but would also enslave and destroy the German “race.” The Nazis believed that all of history was a fight between races, which would culminate either in the triumph of the superior “Aryan” race or in its total extinction. As a result, Nazi leaders considered the death of all Jews to be a precondition necessary for the survival and the eventual dominance of the so-called “German-Aryan” race. According to the Nazis, the Jews, as an “inferior” race, would use their supposed control of world finances and of world mass media to support Communist uprisings and to encourage other “inferior” races to overwhelm and triumph against Nordic-Germanic races. Nazi antisemitism linked traditional negative and false images of Jews and their behavior with modern pseudo-scientific beliefs. Among these stereotypes were those derived from centuries-old Christian anti-Jewish thinking, which incorrectly presented Jews as murderers of Christ, agents of the devil, and practitioners of witchcraft. The Nazis linked these negative stereotypes to a “Jewish way of thinking” that they believed was based in genetics and, therefore, not subject to change. The Nazis used this belief to justify the discrimination, persecution, and, eventually, physical murder of Jewish people. ",
            "date": "Answered January 21, 2017",
            "views": "679",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anja Heiser Einarson",
                    "user_href": "/profile/Anja-Heiser-Einarson"
                },
                {
                    "user_id": "Sasha O'quinn",
                    "user_href": "/profile/Sasha-Oquinn"
                }
            ]
        }
    ]
}