{
    "title": "Why did the Confederate states fight for slavery? - Quora",
    "tags": [
        "The Confederate Flag",
        "U.S. Civil War",
        "Slavery"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Burkhalter",
                "href": "/profile/Karl-Burkhalter-1"
            },
            "answer_text": "The South fought invasion. They seceded to protect their primary credit source Slaves from Colonization out the country or onto Reservations. The North loaned money on Slave Collateral and issued escape insurance. The North shipped Slaves to the Caribbean from Africa to fund the GOP in 1860. The North's #1 revenue source, Textiles, depended on Slave grown Cotton. So the North did not mind profiting from Slavery they just didn't like living with Black Folks. Free State meant free of Blacks not free for Blacks. The popular narrative claims the North’s anti-slavery was motivated by a moral humanitarian concern for the black race. Hear the words of the movers and shakers in the antebellum North: “By God, sir, men born and nursed of white women are not going to be ruled by men who were brought up on the milk of some damn Negro wench!” Congressman David Wilmont of Pennsylvania. Famous for the Wilmont Proviso. “The dark man, the black man declines, it will happen by and by that the black man will only be destined for museums like the DoDo.” Ralph Waldo Emerson, Northern writer, abolitionist, and humanitarian. Expressing his desire that blacks “die out.” “Southerners have retarded progress because of the direct influence of so large a population of half barbarous Africans interspersed among them, GT and who had instructed them in the structures and principles of African despotism.” Thomas Goodwin, Northern author and abolitionist. “I’ve heard you have abolitionists here, we have a few in Illinois and we shot one the other day.” Abraham Lincoln, 9/1848. Spoken in a jocular tone revealing his disdain for abolitionists. “Canada is just to our North, and offers a fine market for wool.” Gov of Conn. William Alfred Buckingham. His response to the need to take in black war contrabands. “There is in the great masses of the people a natural and proper loathing of the negro, which forbids contact with him as with a leper.” Chicago Times. “Confine the negro to the smallest possible area, hem him in, coup him up, sloth him off, preserve just so much of North America as it possible for the white man and to free institutions.“ The Atlantic Monthly. “I went through the State of Illinois for the purpose of getting signers to a petition, asking the Legislature to repeal the Testimony Law, so as to permit colored men to testify against white men. I went to prominent Republicans, and among others to Abraham Lincoln and Lyman Trumbull, and neither of them dared to sign that petition to give me the right to testify in a court of justice! If we sent our children to school, Abraham Lincoln would kick them out, in the name of Republicanism and anti-slavery!… I care nothing about that anti-slavery which wants to make the Territories free, while it is unwilling to extend to me, as a man, in the free States, all the rights of a man.” H. Ford Douglas, free negro abolitionist in Chicago, Illinois. “The white man needs this continent to labor upon. His head is clear, his arm is strong, and his necessities are fixed. He must and will have it. To secure it, he will oblige the Government of the United States to abandon intervention in favor of slave labor and slave States, and go backward forty years, and resume the original policy of intervention in favor of free labor and free States... Mr. President, this expansion of the empire of free white men is to be conducted through the process of admitting new States, and not other- wise. The white man, whether you consent or not, will make the States to be admitted, and he will make them all free States. Sec of State William Seward, Speech before the US Senate 3/3/1858. “The negro is a foreign and feeble element like the Indians, incapable of assimilation, a pitiful exotic unnecessarily and unwisely transplanted into our field, and which it is unprofitable to cultivate at the cost of the desolation of the native vineyard.” William Seward, in a speech at an 1860 political rally. “In the State where I live we do not like Negroes. We do not disguise our dislike. As my friend from Indiana (Mr. Wright) said yesterday, ‘The whole people of the Northwestern States are, for reasons, whether correct or not, opposed to having many Negroes among them, and that principle or prejudice has been engraved in the legislation of nearly all the Northwestern States.’ “ Ohio Senator John Sherman, on April 2, 1862. “Keeping slaves out of the West will confine the negro to the South.” Abolitionist Charles Elliot of Massachusetts. This is just a sampling of Northern quotes, revealing that “anti-slavery” in the North meant “anti-black.” A neutral anti-slavery Englishman you may have heard of had this to say about Northern “anti-slavery” - “I take the facts of the American quarrel to stand thus. Slavery has in reality nothing on earth to do with it…that the North hates the negro, and until it was convenient to make a pretense that sympathy with him was the cause of the war, it hated the Abolitionists and derided them up hill and down dale.” Charles Dickens, 1862. ",
            "date": "Answered July 20, 2020",
            "views": "85",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Beni Habibi",
                    "user_href": "/profile/Beni-Habibi"
                },
                {
                    "user_id": "Thomas Bunner",
                    "user_href": "/profile/Thomas-Bunner"
                },
                {
                    "user_id": "Dewey Smith",
                    "user_href": "/profile/Dewey-Smith-10"
                },
                {
                    "user_id": "Russell Person",
                    "user_href": "/profile/Russell-Person"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Baker",
                "href": "/profile/Daniel-Baker-37"
            },
            "answer_text": "Many of the Southern states didn't think they would have to fight for slavery. If the delegates at the secession conventions had foreseen that four years of war, 9,000% inflation, Atlanta burned to ashes, and a quarter million dead Southerners would be the cost of independence, they wouldn’t have seceded. The Southern leaders had got so used to the North caving in that they didn’t believe, until too late, that by seceding and attacking Fort Sumter they had finally gone a step too far. According to the Mississippi secession delegates, the South seceded because slavery was “the greatest material interest in the world . . . worth four billions of money.” If not the greatest material interest in the world, slavery was at least the greatest material interest in the South. The North had its banks, factories, harbors, and merchant fleets; the South had its slaves, and very little else. If a Southerner owned slaves, his prosperity depended on them; if he did not (as most did not), he hoped to earn enough to buy them. If he hoped to advance in the world in any other way than by slavery, he usually moved to the North or the West. Even among poor Southern whites who had no real hope of ever acquiring slaves, the slave system gave them a higher place in the racial caste hierarchy that they were proud of and guarded jealously. Fear of caste pollution motivated them to revolt much as it had motivated the Bengali Army to revolt just four years earlier, even though, in the Southern U.S. no less than in India, the threat to their caste privileges existed more in their minds than in reality. So, even after it became clear they would have to fight for slavery, white Southerners wanted to protect their actual and potential wealth and their social status, and they were willing to fight to keep it at least as long as they saw some prospect of victory. Unfortunately, the prospect of keeping that social status (and their lives) even without slavery was one of the major reasons Southern troops were willing to surrender, but not willing to accept black voting and other citizenship rights. And the Union, having achieved its main aim of reuniting the nation, was not willing to risk that hard-earned victory for the sake of protecting blacks’ citizenship rights. ",
            "date": "Answered March 20, 2018",
            "views": "721",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Lourie",
                    "user_href": "/profile/David-Lourie-3"
                },
                {
                    "user_id": "Christian Desaix",
                    "user_href": "/profile/Christian-Desaix"
                },
                {
                    "user_id": "Ian Straus",
                    "user_href": "/profile/Ian-Straus"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "Sara Matthews",
                    "user_href": "/profile/Sara-Matthews-5"
                },
                {
                    "user_id": "James Keenley",
                    "user_href": "/profile/James-Keenley"
                },
                {
                    "user_id": "Jackie Almeida",
                    "user_href": "/profile/Jackie-Almeida-6"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3282"
                },
                {
                    "user_id": "Michael Tincher",
                    "user_href": "/profile/Michael-Tincher-1"
                }
            ]
        }
    ]
}