{
    "title": "Why were there so many wars in the middle ages? - Quora",
    "tags": [
        "Middle Ages (era)",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bartram",
                "href": "/profile/John-Bartram"
            },
            "answer_text": "Chimps at war:  I started thinking about this when looking at the warlords of the present Afghanistan. They behave as gangsters, using force to collect protection money (taxes), and manage the (illegal) drugs trade. When they get killed, they are quickly replaced by somebody similar, as if nobody can learn. But when you look at the Roman Empire, you see something very similar. The frequent assassination of Emperors did not deter contenders. As though they could not, or would not learn. Medieval aristocracy were essentially robber-barons. The king was merely the capo, the head of the gang. So I was forced to ask: what - if any - is the difference between modern robber barons and the old? Why ‘king’ as opposed to ‘capo’? The difference is the Church, or just religion. In Christendom, the Church offered a deal: We’ll give you divine authority, through baptism and coronation, in return for favours - political, military and financial. This is known as the relationship between Church and State; it is the theme of European, historical studies. Just as gangs fight, for respect, territory, control, females, so do kingdoms. It’s all very primitive. No doubt anthropologists can point to this with other primates, such as Chimpanzees. You see, we are not so far from brute beasts. Gombe Chimpanzee War The Gombe Chimpanzee War (also known as the \"Four-Year War\" of Gombe), lasting from 1974 to 1978, was a violent conflict between two communities of chimpanzees in Gombe Stream National Park, in Tanzania. The belligerent groups were the Kasakela and the Kahama, which occupied territories in the northern and southern areas of the park, respectively.[1] The two had previously been a single, unified community, but by 1974 researcher Jane Goodall, who was observing the community, first noticed the chimps dividing themselves into northern and southern sub-groups.[2] Later computer-aided analysis of Goodall's notes would reveal that the social rift between the two groups had been present as early as 1971.[3] ",
            "date": "Answered October 8, 2017",
            "views": "2",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Haley",
                    "user_href": "/profile/Samuel-Haley-3"
                },
                {
                    "user_id": "Saul Carreter",
                    "user_href": "/profile/Saul-Carreter"
                },
                {
                    "user_id": "Eugen Simon",
                    "user_href": "/profile/Eugen-Simon-1"
                },
                {
                    "user_id": "Numbername",
                    "user_href": "/profile/Numbername"
                },
                {
                    "user_id": "Disini Fernando",
                    "user_href": "/profile/Disini-Fernando"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Ikmal Reza",
                    "user_href": "/profile/Ikmal-Reza"
                },
                {
                    "user_id": "Gerard van Wilgen",
                    "user_href": "/profile/Gerard-van-Wilgen"
                },
                {
                    "user_id": "Jeff Mackenzie",
                    "user_href": "/profile/Jeff-Mackenzie"
                },
                {
                    "user_id": "James Simpson",
                    "user_href": "/profile/James-Simpson-111"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marek Dohojda",
                "href": "/profile/Marek-Dohojda"
            },
            "answer_text": "For very many reasons, but the most important one typically being power. When a person has power, what he craves most is more power. This is true today too. Another thing to remember is that Kings had a very complicated family life, basically everybody was related to everybody and typically in multiple of ways. Therefore there were plenty of quite legitimate succession struggles. For instance Edward III actually had a far better claim then Philip VI to the throne of France. The reason being is that Edward III was a son of Isabella who was daughter of Philip IV of France. Philip VI was a son of Charles of Valois who was a child of Philip III (a branch of Carpet dynasty) and thereby brother to Philip IV. However in feudal society it was eldest brother who inherited, and his family after words with eldest to youngest.  While Philip V became king only by restricting Women’s succession (i.e. by his edict Women could not inherit Kingdom, although curiously enough they could inherit nobility titles such as Count), his edict was not universally acknowledged. As a matter of fact Duke of Burgundy flat out denied and considered Philip V as usurper. Now this only gets more complicated, but it gives you an idea of just how messed up tings were. In addition Kings always had issues with their Barons as to who should hold the power, and who should make decisions. One of the ways around this was to start a war with neighbors, as then the duty of fealty meant that Barons had to help King to fight external enemies; especially given plunder. Furthermore the idea of a Warrior King was very prevalent in the idea of Medieval society. Kings were supposed to be warriors and be brave. Especially given that almost all kingdoms were in fact won by blood. Finally you didn’t have clear borders; the complicated feudal ties meant that pretty much everything was in flux. For instance King of England had to swear fealty to King of France due to Aquitaine to which King of England was a Duke of. However to swear fealty meant putting king of France above oneself and that is something that sat very poorly with English. In other word the situation was constantly in the flux, with this or that person rebelling, trying to assert their prerogative, or simply trying to get a better deal. Count of Flanders may own allegiance to king of France, or maybe King of England, or his own. Who knows? Think of it another way, think of King as gang leaders of today. Each gang has their own turf that is constantly being contested, with new gangs encroaching on territories of other gangs. Add to that blood bonds, ancient grudges, religion, honor, etc.. and you get landscape of the Middle Ages. ",
            "date": "Answered January 30, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sherwin Brual",
                    "user_href": "/profile/Sherwin-Brual"
                },
                {
                    "user_id": "Disini Fernando",
                    "user_href": "/profile/Disini-Fernando"
                },
                {
                    "user_id": "Khang Nhat",
                    "user_href": "/profile/Khang-Nhat"
                }
            ]
        }
    ]
}