{
    "title": "Why were polish refugees sent to the middle east during world war 2? - Quora",
    "tags": [
        "Polish Ethnicities and People",
        "Refugees",
        "Poland",
        "The Middle East",
        "World War II",
        "Warfare",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Lidia Fedorska",
                "href": "/profile/Lidia-Fedorska"
            },
            "answer_text": "Because the Middle East was strategically important and the Allies needed troops to protect the rich oil fields from a possible German attack. Initially the agreement with the Soviets was intended to secure the release of men only, in order to form the army. Polish general Sikorski insisted stubbornly on allowing the release of whole families. The Allies expected Germans to invade the Middle East, which was considered a crucial operational zone. Before the war the British established Middle East Command in Egypt. During the war the command supervised military operations in and around the Mediterranean basin and the Middle East. The negotiations regarding the Polish - Soviet agreement were initiated by the British minister of foreign affairs, Anthony Eden. He met with the Soviet ambassador Ivan Maisky in London just after the German invasion of the Soviet Union on the 22nd of June 1941. The first meeting between Maisky and general Sikorski took place on the 5th of July 1941. Sikorski was primarily interested in the release of all of the Polish citizens from the Soviet camps and in establishing a Polish army under direct orders of the Polish Government in Exile. Some of the men released from the soviet camps were incorporated in the Soviet army. Due to cutting of rations for Polish soldiers and other circumstances, about 30 thousand of them ended up without rations. As a result most of them, and all of the newly released ones, were redirected to Iran, where the first group arrived in March 1942. Altogether 120 thousand people turned up in Iran, about 40 thousand of them were women and children. They were very well received in Iran. The ones capable of fighting stayed there for a few months and moved on to Iraq, Jordan, Syria and Egypt to be finally transferred into the fighting in Italy. Children under the age of 14 and some women looking after them stayed in Iran (about 5 thousand in total), and were later relocated to various parts of the British commonwealth, including India, New Zealand, Australia, Canada and even Mexico. Most women joined the army. https://www.bbc.co.uk/news/magazine-19586595 Waiting to move on from Iran after a period of training:  Anders army in Iran was made up of the Polish people released from the Soviet camps. After a few months’ stay in Iran:  ",
            "date": "Updated July 31, 2019",
            "views": "826",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yohanan Ben Jacob",
                    "user_href": "/profile/Yohanan-Ben-Jacob"
                },
                {
                    "user_id": "John Aronsson",
                    "user_href": "/profile/John-Aronsson"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Michał Rajewicz",
                    "user_href": "/profile/Michał-Rajewicz"
                },
                {
                    "user_id": "Alex Pismenny",
                    "user_href": "/profile/Alex-Pismenny"
                },
                {
                    "user_id": "Edward Guminiak",
                    "user_href": "/profile/Edward-Guminiak-1"
                },
                {
                    "user_id": "Piotr Szafranski",
                    "user_href": "/profile/Piotr-Szafranski"
                },
                {
                    "user_id": "Solomon Malekani",
                    "user_href": "/profile/Solomon-Malekani"
                },
                {
                    "user_id": "Paulina Gardoń-Szczęch",
                    "user_href": "/profile/Paulina-Gardoń-Szczęch"
                },
                {
                    "user_id": "Jimmy Thomas",
                    "user_href": "/profile/Jimmy-Thomas-113"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Withell",
                "href": "/profile/Randall-Withell"
            },
            "answer_text": "The only situation that I know that might reflect your question is this: With the partition of Poland between Nazi Germany & Soviet Russia in October, 1939, the Soviets departed over 100,000 Polish citizens to the far Soviet East & to the north - many of these were considered dangerous because of their previous positions in the military, or other trained government organizations. They also deported another 100,000 former Polish soldiers. All these Polish citizens & former soldiers languished in primitive & deprived conditions until the Nazi invasion of Soviet Russia in June, 1941. Realizing that the Soviet Union needed all the military support it could get, Stalin authorized the recruitment of Poles willing to fight against Nazi Germany. Stalin expected about 30,000 Poles to form two Polish divisions, which were to be formed in the southern areas like Kazakhstan & Uzbekistan. But, given the chanced to escape Soviet Russia, the numbers grew to about 40,000 former Polish soldiers plus 70,000 Polish citizens. Still, the travel & living conditions remained harsh & primitive, & equipping the soldiers with suitable military gear was problematic, given the catastrophe unfolding to the far west. In January, February, March,1942, this mass of Polish people was transferred across the Caspian Sea, to land in Iran which was under British control. Again, travel conditions were harsh & demanding. Finally, under the command of General Anders, the organized Polish military units, plus thousands of civilians, moved from Iran into what was then called Palestine. The Poles military units went on to fight with the British in Egypt This epic journey may have provided the reference to “Polish refugees in the Middle East” in your question. Recommended Reading: Kochanski, Halik. The Eagle Unbowed: Poland & the Poles in World War Two. Allen Lane, 2012, ",
            "date": "Answered March 11, 2019",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marcin Terlecki",
                    "user_href": "/profile/Marcin-Terlecki-1"
                }
            ]
        }
    ]
}