{
    "title": "Why do we call a century, like the 21st century, but we write it as 2,000 or something? - Quora",
    "tags": [
        "Writing Systems",
        "Centuries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Javier Martinez",
                "href": "/profile/Javier-Martinez-508"
            },
            "answer_text": "Because many people ignore sites that say 2000 was the final year of the 2nd millennium, 20th century, & 200th decade. 2000 was a century leap year that was the 2000th year of the CE, 1475th year of the AD, 1st year of the 3rd millennium, 1st year of the 21st century, & 1st year of the 201st decade 2000 was the 500th leap year of the CE, & the 369th leap year of the AD in the Julian Calendar 2000 was the 485th leap year of the CE, the 357th leap year of the AD, the 5th century leap year of the CE, & the 4th century leap year of the AD in the Gregorian Calendar Remember, the years 1–524 are nonexistent, nobody back in 754 AUC believed they were living in 1 because in 525, a monk invented the AD system & invented 1 for 754 AUC while counting how much years was the birth of Jesus as of 1278 AUC. The 21st century is the current century we are in now, & that century is the 1st century of the 3rd millennium, & the 21st century is considered as the 2000s century. Since 2000 is in the 2000s decade & not in the 90s, it makes no sense how it’s the 1st year of the 2000s decade & the last year of the 2nd millennium, it’s in the 3rd millennium, just like it’s in the 21st century & 201st decade. It’s like that purists claim a decade on 2 centuries & 2 millenniums at the same time, which definitely makes no sense. About everywhere around the world on the last day of the 2nd millennium, 20th century, 200th decade, & 1999 were partying & were so excited for the new year, decade, century, & millennium. When January 1, 2000 arrived, everyone were going crazy everywhere on Earth that the 3rd millennium, 21st century, & the 201st decade arrived. I heard a purist that said 2000 is in the 90s just because it was the last year of the 2nd millennium, 20th century, & 200th decade, & the 90s decade was from 1990–1999, why, that is the 1990s decade because it has 9 on the tens digit place, & 2000 has 3 zeros & 1 two, therefore 2000 is in the 2000s decade, which is in the 21st century & 3rd millennium because the 2000s decade is in the 21st century & 3rd millennium. ",
            "date": "Answered July 17, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Thompson",
                    "user_href": "/profile/Edward-Thompson-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Robson",
                "href": "/profile/Mike-Robson-7"
            },
            "answer_text": "Centuries are 100 year blocks of time. And we are currently in the 21st of these blocks of 100 years since the calendar was restarted in 0 AD. Since the first century of the AD calendar started at 1, the first century was from year 1 to year 100. Fast forward to the year 1000 and you are into the 11 century. However. Before I get shot down by pedants. New centuries technically don't start until the year after. So the 21st century started in 2001 not 2000. But 2000 was popularised as the start of the new millennium so much that it kinda stuck. ",
            "date": "Answered December 30, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashish Meshram",
                    "user_href": "/profile/Ashish-Meshram-34"
                }
            ]
        }
    ]
}