{
    "title": "Why is there almost no one man army in modern day? Is it because technology and other inventions keep it from happening? - Quora",
    "tags": [
        "Modern Technology",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dima Korolev",
                "href": "/profile/Dima-Korolev"
            },
            "answer_text": "Because it’s economically infeasible. Let me phrase it better: Because an army officer who would suggest such an idea would not last long on the job. In establishes countries, anything army-related these days is serving one and only one purpose: increase own budget. To put it blunt, “cheap and brutally effective” is the end of the spectrum that criminals and terrorists use. Modern “real” armies effectively want themselves to be brutalizing, cool-looking, high-volume, expensive, and high maintenance. The better they can send this “hey, we need more money” signal the better off they are. The concept of a one man army is simply a political suicide, if you look at the problem from this angle. It would be a miracle if some country even talks about something like this seriously. ",
            "date": "Answered May 8, 2018",
            "views": "453",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quang Tuyen Pham",
                    "user_href": "/profile/Quang-Tuyen-Pham"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Gerard",
                "href": "/profile/John-Gerard-7"
            },
            "answer_text": "I don’t believe there ever was. The great armies we’re lead by great people but the times of a Rambo dragon slaying ninja Achilles never existed. So famous groups of soldiers are regarded as being formidable but fighting has been played out as described in the Art Of War for almost the entire length of civilisation and the beginning of cities as states. ",
            "date": "Answered June 13, 2018",
            "views": "19",
            "upvotes": " Answer requested by Aaron Pinkerton"
        }
    ]
}