{
    "title": "Why was the Soviet-Finnish war surprisingly hard for Russians? - Quora",
    "tags": [
        "Military History of Russia",
        "Warfare in Russia",
        "History of Russia",
        "Finland",
        "Russian Ethnicity and People",
        "Russia",
        "Warfare",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Foster",
                "href": "/profile/Alex-Foster-137"
            },
            "answer_text": "One major reason it was hard for the soviets to invade Finland was because of the lack of gear, and also really, really bad communication and maybe even a little support from the west.  While its true the Soviets did have huge amounts of equipment, they were also in the midst of a modernization program. The vast majority of the equipment of the Red Army was still gears and weapons from Imperial Russia and the civil war. The artillery was ww1 vintage, and so were the rifles. Only LMGs, airplanes and tanks were decently modern. However, the main tank of the Winter War was not the T-34 (which had yet to be produced) not the KV-1 (which went through field trials in a few examples towards the end of the war) but rather the much smaller and weaker T-26.  The Soviets had sold off massive amounts of old and close to useless equipment at high prices to the Spanish Republic, but still retained large stockpiles of ww1 vintage equipment.  Communication in the Red Army was bad and in many cases was catastrophic. There were very few radios, the tanks and planes were not very good at getting their orders, and neither were lower infantry units. Phone and telegraph lines were often cut, either by artillery fire or enemy patrols. Command and control suffered heavily and there are several reports of Soviet infantry being shelled by their own artillery or Soviet airplanes attacking their own forces because of bad or sabotaged communication.  The Soviet mechanized formations were bound to the road, both for operation and supply. Considering that most roads of eastern Finland at the time were few and far most of the time, far apart, not even speaking of being single-file dirt roads, the Finns knew exactly where the Soviets would be on the roads. Raiding, patrol warfare and eventually motti warfare (cutting the long columns up in pieces and dealing with one piece at a time) was very easy for the fins to conduct, which led to the destruction of many red army supplies, tanks, medicine etc.  However, the worst part of the Red Army at the time was that it had frozen completely as a result of Stalin's purges. While the purges themselves mostly affected Generals and other in the higher command, the message sent and understood by the entire army was to sit still in the boat, do not rock it.  The Red Army become tactically completely inflexible and utterly devoid of initiative, as no-one dared to anything without order. Combined with the bad staff work and lousy communications, this was a recipe for disaster. This recipe was further spiced up by the attempt to blame the failures of the Soviet system in Spain on a lack of discipline and style rather than a lack of tactical skill. Discipline, preferably the draconian type, and zeal were to be the key to success. In practice, however, it was the key to absolute disaster when human wave attacks were thrown against impossible odds.  ",
            "date": "Answered November 12, 2018",
            "views": "308",
            "upvotes": " View 353 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katie Anne Holton",
                    "user_href": "/profile/Katie-Anne-Holton"
                },
                {
                    "user_id": "Zhang Jing Wei",
                    "user_href": "/profile/Zhang-Jing-Wei"
                },
                {
                    "user_id": "Dimtiri Yakovich",
                    "user_href": "/profile/Dimtiri-Yakovich"
                },
                {
                    "user_id": "Astap Loup",
                    "user_href": "/profile/Astap-Loup"
                },
                {
                    "user_id": "Ilari Aalto",
                    "user_href": "/profile/Ilari-Aalto"
                },
                {
                    "user_id": "Allen Flores",
                    "user_href": "/profile/Allen-Flores-2"
                },
                {
                    "user_id": "Pearl Byrd",
                    "user_href": "/profile/Pearl-Byrd-4"
                },
                {
                    "user_id": "Sean Jones",
                    "user_href": "/profile/Sean-Jones-482"
                },
                {
                    "user_id": "Jill Ellis",
                    "user_href": "/profile/Jill-Ellis-35"
                },
                {
                    "user_id": "Daniel Burke",
                    "user_href": "/profile/Daniel-Burke-180"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cass Dean",
                "href": "/profile/Cass-Dean"
            },
            "answer_text": "The Russians were taken by surprise. Khrushchev was present or nearby during the negotiations that led to the war, which Stalin conducted personally, and describes them in Khrushchev Remembers. The western borders of the Soviet Union were wide open and Russians had watched armies pour over them too many times already. Stalin was particularly alarmed by the vulnerability of Murmansk and Leningrad, both with Atlantic access and both little more than a stone’s throw from the Finnish border. He couldn’t construct defensive lines around them without intruding into Finnish territory. The Soviet Union had already been straight-armed by the Finns when they asked to lease four uninhabited islands in the Gulf of Finland to build watchtowers and defenses on the sea access to Leningrad, so Stalin put together a package he thought would be irresistible. It was a long-standing grievance among Finns that they had somehow come away from their secession from the Russian Empire (after a century of peace, prosperity and progress) without the entire Karelian Peninsula. There were actually protest demonstrations and marches over it. So Stalin offered the Finns a land swap, most of eastern Karelia in return for enough land on the margins of Murmansk and Leningrad, total acreage two to one in Finland’s favour, to build defensive lines. He also offered to lease and fortify the Hanko Peninsula at the opening of the Gulf of Finland and the four aforementioned islands. This would have been a thorough deterrent to a sea approach to the western border, and incidentally to Finland had they wanted such a deterrent, and would have provided a maritime supply line to fighting in the neighbourhood. (In the event, the north Atlantic route through Murmansk was the supply line for a substantial part of the Lend-lease material.) It was also much more modest than the land the Soviet Union wound up with; Stalin bent the lines to leave Viipuri in Finnish territory, for instance. When the Finns turned this down, without even a counter-offer, Stalin was astonished. So was their Commander in Chief Baron Mannerheim. He resigned in protest. (But when the bombs started falling, the old warhorse couldn’t stay away.) Out come the maps and some quick war planning is done back in Moscow. One of Stalin’s generals says the terrain is brutal. He advises sending to the east for some seasoned troops. (They’re with Zhukov and have just beaten the Japanese.) Stalin waves the suggestion off. He can’t believe the Finns want to fight over this, and decides they must have been playing footsy with Germany and need a face-saver. “One shot over their heads and it will be finished,” he said. When Stalin saw that the Finns were seriously going to fight, he said “They’ve got a treaty.” I think so too. The Winter War was fought in two parts. Part One, some newly recruited farm boys who were supposed to be polishing off their training. Part Two, February 1940, the Red Army. I’ll bet if we could search every Quora answer that is written about Finland in the ’30s we’d find “Nazi” “Hitler” or even “Germany” conspicuous by its absence. All the collaborators are doing it. They are writing the Nazis right out of history. They weren’t a factor in anybody’s plans or actions or world view. ",
            "date": "Updated June 7, 2018",
            "views": "49",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Russell Warren",
                    "user_href": "/profile/Russell-Warren-24"
                },
                {
                    "user_id": "Arron Wheeler",
                    "user_href": "/profile/Arron-Wheeler"
                },
                {
                    "user_id": "Georgia Kennedy",
                    "user_href": "/profile/Georgia-Kennedy-34"
                },
                {
                    "user_id": "Sarah Frazier",
                    "user_href": "/profile/Sarah-Frazier-70"
                },
                {
                    "user_id": "Paula Banks",
                    "user_href": "/profile/Paula-Banks-14"
                },
                {
                    "user_id": "Armando Thompson",
                    "user_href": "/profile/Armando-Thompson"
                },
                {
                    "user_id": "Andrew Jacobs",
                    "user_href": "/profile/Andrew-Jacobs-121"
                },
                {
                    "user_id": "Doris Lawrence",
                    "user_href": "/profile/Doris-Lawrence-7"
                },
                {
                    "user_id": "Danny Cook",
                    "user_href": "/profile/Danny-Cook-64"
                },
                {
                    "user_id": "April Harrison",
                    "user_href": "/profile/April-Harrison-72"
                }
            ]
        }
    ]
}