{
    "title": "Why did the Ottomans need to capture Constantinople? - Quora",
    "tags": [
        "Constantinople (Byzantium)",
        "Ottoman Empire"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Newman",
                "href": "/profile/Scott-Newman-31"
            },
            "answer_text": "Of course the Ottomans were an Empire, and Constantinople was a desirable prize, completely surrounded by their own territory. BUT to get in to the when's and why's that Mehmet II you have to look at two key events. First in August 1444 his father, Murat II, chose to retire and put his 12 year old son Mehmet on the throne. It didn’t go well, and when war broke out, the Grand Vizier dragged Murad out of retirement to take charge. And so when he became Sultan ‘properly’ on the Murad’s death in 1451 this failure was a massive ‘chip on his shoulder’ and many observers predicted he would be a weak ruler. He wanted a prominent victory on his score card to impress. Secondly, on the news of Murad’s death the newly conquered territory of Karaman in Central Anatolia and one of Mehmet’s first tasks was to march east and subdue it. When, mission accomplished, he tried to return to Edirne he found the Dardanelles blocked by Italian ships. Instead he had to go, back to Bursa and all the way around crossing the Bosphorus instead. The Ottomans already had forts on the east side of the Bosphorus but the west side was still Byzantine, but of course he crossed anyway - and started building a new Ottoman fort on the west side, Rumeli Hisar. Fundamentally the lesson was that any Empire in Anatolia and the Balkans needed full control of the Lynch-pin, the crossing of the Dardanelles and the Bosphorus. And so Constantinople had to fall. ",
            "date": "Answered March 8, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeffrey Wang",
                    "user_href": "/profile/Jeffrey-Wang-156"
                },
                {
                    "user_id": "Simon Jing",
                    "user_href": "/profile/Simon-Jing"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esad Tunc",
                "href": "/profile/Esad-Tunc"
            },
            "answer_text": "Well, before 1453, the Ottomans had already been controlling the lands around the Constantinople. So preparing a siege was so easy for them. And at the time, Mehmet II was ruling, whose dream was to conquer the land. Also, thinking about the financial reasons, Constantinople was an important trade route. And even after the conquest, Mehmet II didn’t wait a second and conquested Trebzionid and then Crimea to route the trade goods there to Constantinople. There was also a religious reason for this. The prophet Muhammad of Islam once said that Constantinople would be conquered by Muslims and honored the general and soldiers who would conquer there. And another reason, because the Byzantium was continuing to intrugue the Ottomans and being an obstruct to them while they were attacking and gaining land from Balkans and Europe, the Ottomans needed to destroy Byzantium for good. ",
            "date": "Answered October 18, 2019",
            "views": "924",
            "upvotes": "0"
        }
    ]
}