{
    "title": "Why was Italy so wealthy during renaissance? - Quora",
    "tags": [
        "The Renaissance",
        "Italy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanner McNeill",
                "href": "/profile/Tanner-McNeill"
            },
            "answer_text": "Italy was extremely wealthy during the renaissance for a variety of factors. The first, and most prominent one, was Rome. Rome was the religious center of Catholicism, and home to the papacy, which owned a good portion of European land. Due to tithing laws, a lot of money flowed into Rome. Being the religious center of Europe also gave incredible political sway, due to Religion and Politics still being intertwined. With political power comes monetary power. Added to this, Italy had a variety of well developed cities, with flourishing economies, such as Florence, Milan, Venice, and so on. The Medici family was also another important factor. The Medici’s were an influential family during the Renaissance that sponsored the arts. They were the first ones to really open banks up in Europe, and became so powerful that one member even claimed the title of Pope, being Leo X. Their economic gains during this time helped fuel the patronage of the arts that would blossom into the renaissance. Italy is also just geographically in a good place. They are almost entirely coastline, protruding out into the Mediterranean. This not only makes them extremely prominent in Mediterranean trade, but it also makes temperatures nice and cool, which encourages people to go out and do stuff, which pushes culture and economy, as well as making the land very farm-able. Even up towards the 1900’s, Italy was able to sustain itself without needing to import food despite their large population and relatively smaller size. With the Alps to the north, there’s a natural buffer against land invasion, making the area relatively stable, which leads to growth. All around, Italy was the best place for monetary gain to happen during the renaissance. ",
            "date": "Answered May 2, 2018",
            "views": "47",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mariah Santos",
                    "user_href": "/profile/Mariah-Santos-23"
                },
                {
                    "user_id": "Ashton Bankston",
                    "user_href": "/profile/Ashton-Bankston-1"
                },
                {
                    "user_id": "Oluwatomisin Mbas",
                    "user_href": "/profile/Oluwatomisin-Mbas"
                },
                {
                    "user_id": "Cecil Yanez",
                    "user_href": "/profile/Cecil-Yanez"
                },
                {
                    "user_id": "Mauro Marabini",
                    "user_href": "/profile/Mauro-Marabini"
                },
                {
                    "user_id": "Mauro Suttora",
                    "user_href": "/profile/Mauro-Suttora"
                },
                {
                    "user_id": "Janis Bell",
                    "user_href": "/profile/Janis-Bell"
                },
                {
                    "user_id": "John Freeberg",
                    "user_href": "/profile/John-Freeberg-1"
                },
                {
                    "user_id": "Vijay Iyer",
                    "user_href": "/profile/Vijay-Iyer-30"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paolo Cuzzato",
                "href": "/profile/Paolo-Cuzzato"
            },
            "answer_text": "Because Italian merchant States - Venice first and foremost - had a stranglehold on the immensely lucrative East-West trade routes that brought into Europe the products of Asia - spices, gems, silk, pigments, you name it. The vast amount of money so amassed made them also financial hubs, where modern banking began, and allowed them to lend money to all Europe. ",
            "date": "Answered May 2, 2018",
            "views": "938",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jérémie Boussand",
                    "user_href": "/profile/Jérémie-Boussand"
                },
                {
                    "user_id": "Anna Keller",
                    "user_href": "/profile/Anna-Keller-5"
                }
            ]
        }
    ]
}