{
    "title": "Why were most slaves black people? - Quora",
    "tags": [
        "History of Slavery",
        "Slavery",
        "African Americans",
        "Black People",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Françoise Marie",
                "href": "/profile/Françoise-Marie-1"
            },
            "answer_text": "There is no why because the content of your question is based on a stereotype : the Negro for European slavers or the abeed for Arab slavers. As someone put it : The stereotype from the Establishment consensus history is of the Muslim slaver herding chained Blacks through the desert. In fact, for seven hundred years, until the fall of Muslim Spain, those being herded were first and foremost overwhelmingly White. Escape from North Africa and the Middle East was almost impossible and those White slaves who were caught trying to flee were punished by having their noses and ears cut off or worse. True be told, stereotypes are exaggerations based on actual facts but they only tell part of the story or they hide the very beginning of the story. The etymology of the word slave (a degraded servant or a perpetual serf) hints at a large scale slave trade that took place in the Middle Ages and long after. The very word slave comes from the Slavs, a European ethnic group, because they were once the vast majority of the people enslaved. It went from Slavs to slaves. White slavery meaning human trafficking for the purpose of prostitution comes from a time when European women were commodifed and sold on Islamic slave markets. Circassian women, Slavic women, were in high demand as they were considered trophy wives and preferred breeding partners. Whites were enslaved in Africa under different names and as early as the Carthaginian Empire : the Punic slaves, the Janissaries, the Barbary slaves, the Saqaliba, the Morean slaves etc. There were Whites enslaved as deep as Northern Cameroun by Shuwa Arabs and as far as Zanzibar where slave women of European origin (Slavs, Greeks etc) were sold to wealthy Zanzibari merchants. The white slave trade of the Moors lasted at least a thousand years until the early 20th with the capture of the last Riff pirate. Whites were sold on slave markets in North Africa as late as the 19th. The Sale slave market of Morocco is well known for that. Barbary pirates raided for white slaves as far as Iceland and the American high seas. European countries and the USA paid tons of money ransoming European and American captives in northwestern Africa (the Barbary states). But white slavery in Africa is a taboo subject. The extraordinary life of British Admiral Sidney Smith who founded a movement to liberate all the Whites enslaved in Africa has been swept under the carpet of history. Not only white slavery in Africa is taboo but other slave trades in Asia or even pre-columbian America are barely covered in history textbooks. Asia is the most populous continent. It is common sense to assume that most slaves in history or today are Asians and it is the truth. Blacks are a race of slaves is a constant historical narrative in the West but others were also slaves and are still slaves, including in Europe. Ukraine has more than 400 000 modern day slaves. ",
            "date": "Updated October 24, 2020",
            "views": "54",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A.J. Summerhayes",
                    "user_href": "/profile/A-J-Summerhayes"
                },
                {
                    "user_id": "Joshua Patterson",
                    "user_href": "/profile/Joshua-Patterson-8"
                },
                {
                    "user_id": "Dave Lee",
                    "user_href": "/profile/Dave-Lee-493"
                },
                {
                    "user_id": "Kevin Einstein",
                    "user_href": "/profile/Kevin-Einstein-2"
                },
                {
                    "user_id": "Osmany Ortiz",
                    "user_href": "/profile/Osmany-Ortiz-1"
                },
                {
                    "user_id": "Fareas Hafy",
                    "user_href": "/profile/Fareas-Hafy"
                },
                {
                    "user_id": "Bunmi Hambolu",
                    "user_href": "/profile/Bunmi-Hambolu"
                },
                {
                    "user_id": "George Tatham",
                    "user_href": "/profile/George-Tatham-1"
                },
                {
                    "user_id": "Pandra Selivanov",
                    "user_href": "/profile/Pandra-Selivanov"
                },
                {
                    "user_id": "Ashley McCalla",
                    "user_href": "/profile/Ashley-McCalla-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vince Parker",
                "href": "/profile/Vince-Parker"
            },
            "answer_text": "Well, if we are speaking for today's world, then most slaves are not Black... I'm talking about sex slaves as well as the average Joe. In the past, slaves were victims of the times.  That is, those who had superior technology and knowlege, commanded the rules.  Even then, Black people were in the minority as slaves.   So it's not color, but the conglomeration of circumstance that dictates who will be a slave to another.   If you think about it, we are all kind of slaves if you live in the USA like me.  Because the system is set up so that the Government controls the people, and not the other way around, as it ought to be.   The people ought to control the Government.  Not some top wealthiest 1% of people in the world who use the American leadership as puppets, and may not even be true American citizens at all, or not even care about the well-being of the average American citizen (work slave.)  Although the slave masters do need the slaves to survive.   So then.  If you work and pay taxes in the USA, then you are a slave.  Even if you love your job playing football or something.  Because if you think about it; you are forced to work, to have the kind of survival you are 'lead' to believe you want.     But then we do want what we want don't we?   So then, this says we are basically all slaves to our own minds.   Please don't take this lightly, our minds are easily made up for us, by others.  Don't ever think that being a 'homeless bum' is a bad thing.  The Earth is still our home, and the sky is the ceiling for us all.  Everything we need to live is provided 'FREE' by nature.  We just pay for it as a convenience of society.   What this means, is that basically 99% of us are slaves to the 1% controlling the world--with our permission.   So maybe start thinking this way: Work is not work, it is always play. Having nothing, is having everything for free.Having everything, is impossible except for the top 1%, who are slaves themselves to their own money. So we are all slaves to 'life' in a way.  We are all here to play (or most would call it work.)But it is all play man.  And play ought to be fun man. Did you know some Black slaves in the USA actually complained about the food they were given?  They were fed lobster, because at the time, it was the cheapest food.  But that was ll they were fed.  And they got sick of it.  So good is bad, and bad is good.  That is what the top 1% know, that most of us do not.  For example, when you get old, then you realize that everything you had taken for granted as 'easy' becomes actual hard labor and work.  Taking a shower is draining and hard work.  Eating and drinking is hard and becomes hard work.  Doing anything at all seems very hard work.  Just breathing becomes a struggle.    But if you are smart, then you will see all this as play, and not work, and then you can die happy no matter what. If you are in the 99% of us that are slaves; then you can see this as play, and not slavery.  You will know that we are all equal.  Equal in every single way, regardless of our stupid minor differences in color or culture, or ethnicity.   We are all God's creatures.  If you don't believe in God, then we are all freaking creatures.  We are all 'slaves' to life.  Or, we can be the masters of life, no matter what our circumstance--whether we are 'masters with a whip' or 'bleeding backs, with a grudge' we are all the same.  We are humans, and we are all here together for a while.  So you can believe in such words as 'slaves'; or you can just think of life as fun and play.You can believe that you are better, or you can believe that you are the same. You can believe that living a life with the best life can offer--like the top 1%--is better than the bottom 99%.  Or you can make it a reality for yourself to have as happy a life as anyone, regardless of life circumstance or 'slavery' or being in the bottom 1% of the bottom 99%...You; are the master of your life.  No one else can ever be.  You decide.  Your choice.  That's all.  Peace to our minds, means peace on earth. If not, then well, war on earth then.",
            "date": "Answered October 26, 2015",
            "views": "22",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse James",
                    "user_href": "/profile/Jesse-James-1323"
                },
                {
                    "user_id": "Kevin Einstein",
                    "user_href": "/profile/Kevin-Einstein-2"
                },
                {
                    "user_id": "Pandra Selivanov",
                    "user_href": "/profile/Pandra-Selivanov"
                },
                {
                    "user_id": "Lutz Dema",
                    "user_href": "/profile/Lutz-Dema-1"
                },
                {
                    "user_id": "Françoise Marie",
                    "user_href": "/profile/Françoise-Marie-1"
                },
                {
                    "user_id": "Gonçalo Melo",
                    "user_href": "/profile/Gonçalo-Melo-13"
                },
                {
                    "user_id": "Matthew Mann",
                    "user_href": "/profile/Matthew-Mann-72"
                },
                {
                    "user_id": "Ta Eleanor",
                    "user_href": "/profile/Ta-Eleanor"
                },
                {
                    "user_id": "Emma Smith",
                    "user_href": "/profile/Emma-Smith-1303"
                },
                {
                    "user_id": "Leah Bir",
                    "user_href": "/profile/Leah-Bir"
                }
            ]
        }
    ]
}