{
    "title": "Why did Scotland finally accept the Union with England in 1707? - Quora",
    "tags": [
        "Kingdom of Scotland (824-1707 AD)",
        "Acts of Union 1707",
        "Kingdom of England (927 – 1707 AD)",
        "Politics of Scotland"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ed Robertson",
                "href": "/profile/Ed-Robertson"
            },
            "answer_text": "Scotland didn't accept “union” with England in 1707. Daniel Defoe, a supporter of the annexation of 1707, estimated that 99% of the people of Scotland were opposed to it. There were riots against the annexation the length and breadth of Scotland. The English army was massed on the border in case their bribed puppets lost control. The following year there was a full scale insurrection which failed only because the English Navy prevented the arrival of weapons from France. Thereafter the Scottish people put their faith in a Jacobite restoration and for their part the Jacobites adopted the slogan “Scotland free and no union”. When the Jacobite war of 1745-6 failed, Scotland was invaded and occupied by an army which amounted to one soldier for every 100 Scots. By contrast, the Nazi invasion of France in 1940 consisted of only one soldier per 250 French. Scotland had been conquered and occupied just like all of England's other imperial colonies. We didn't accept conquest, and an increasing number of people in Scotland want Scotland to be an independent country again. ",
            "date": "Answered April 26, 2019",
            "views": "528",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Audrey Buchan",
                    "user_href": "/profile/Audrey-Buchan-4"
                },
                {
                    "user_id": "Barbara Ross",
                    "user_href": "/profile/Barbara-Ross-27"
                },
                {
                    "user_id": "Gerald Sweeney",
                    "user_href": "/profile/Gerald-Sweeney-4"
                },
                {
                    "user_id": "Robert Fergus",
                    "user_href": "/profile/Robert-Fergus"
                },
                {
                    "user_id": "Dominic Berry",
                    "user_href": "/profile/Dominic-Berry-6"
                },
                {
                    "user_id": "Jes Chetcuti",
                    "user_href": "/profile/Jes-Chetcuti"
                },
                {
                    "user_id": "Coinneach mac Raibeart",
                    "user_href": "/profile/Coinneach-mac-Raibeart"
                },
                {
                    "user_id": "Gillie-Chriosd MacLeòid",
                    "user_href": "/profile/Gillie-Chriosd-MacLeòid"
                },
                {
                    "user_id": "James McGeary",
                    "user_href": "/profile/James-McGeary-3"
                },
                {
                    "user_id": "David Shaw",
                    "user_href": "/profile/David-Shaw-231"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Scurr",
                "href": "/profile/John-Scurr-1"
            },
            "answer_text": "The short answer without all the nationalistic BS which this is sure to attract is that it was accepted because it was in their interest to do. There were those vested interests who railed against it and it was not particularly popular within those interests or the Scots poor who relied on those vested interests for just about every aspect of their being. For many others it was seen as a necessary evil, others merely wanted an escape from their financial plight, others saw it as a way of preventing constant strife, others saw it as an opportunity for advancement. No doubt there were other reasons but I think this list covers the main considerations. The BS of folklore usually predominates when nationalism rears its ugly head and many of the above will be seen as inconvenient to those with an axe to grind. ",
            "date": "Answered May 2, 2019",
            "views": "121",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Hogbin",
                    "user_href": "/profile/Martin-Hogbin"
                },
                {
                    "user_id": "Paul Cartwright",
                    "user_href": "/profile/Paul-Cartwright-28"
                },
                {
                    "user_id": "Gary Terrence",
                    "user_href": "/profile/Gary-Terrence"
                },
                {
                    "user_id": "Alan Green",
                    "user_href": "/profile/Alan-Green-131"
                }
            ]
        }
    ]
}