{
    "title": "Why did the ancient Egyptians depict themselves as 'black' Africans? - Quora",
    "tags": [
        "Ancient Egyptians",
        "Ancient Egypt",
        "Africans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valeria Clark",
                "href": "/profile/Valeria-Clark-5"
            },
            "answer_text": "Ancient Egyptians depicted themselves as black Africans because…drumroll please… Egypt started out as a black civilization. When ppl say the black kings did not exist first in Egypt, that is like saying the Indian wasn't in America...u rarely see a 100% native Indian in America now, but the fact remains they were. There were black, white, and mixed Pharaohs during different time spans. That is why it is so important to post dates.Considering the number of foreign slaves that Egypt had captured from wars, the pharaohs marrying foreign princesses to bind treaties, having many Bi-racial kids, plus being a major trading center since the 2rd Dynasty…One has to be reminded of the fact that ancient Egypt was NOT a racially and ethnically homogenous society even if Africans made up the bulk of the population. However, before 1640 BC, Ancient Egypt started first with black Africans who were indigenous tribes to the Nile Valley located in Africa...then became multicultural...it’s not rocket science. The Black Kings existed from the start. When you speak of Egypt you must specify what period of time you are talking about. Why? Because ownership of this land has been passed around from various empires like a football during a Super bowl game. For instance, Key points are: 1. Modern humans (Homo sapiens) have a single origin in Africa. Africa is the mother of all races. Tribes of people started to migrate to different parts of the earth. (Tower of Babylon in the Bible) The farther away people lived from Africa, the lighter they became due to genetic mutation. The tribes always settled near rivers of water. Some African tribes settled along the whole length of the Nile. These tribes grew and became settlements. The settlements grew and became villages. The villages grew and became towns, then cities, and then kingdoms. 2. Egypt is in Africa. Egypt (Greek name) is at the top of Africa by the Sudan. Its ancient name was Kermit or Kemet meaning black soil. The Africans were Kings there first before the foreign invaders. Then you have invasions from foreigners such as: the Hyksos 1640 BC - 1532 BC, Assyrians invaded around 671 BC, the Persians 525 BC, the Greeks in 332 BC, the Romans invaded in 30 BC to make Egypt part of the Roman Empire, then the Arabs came around 600 AD. 3. The Hebrew and Christian Bibles, tells you that Egypt was the land of Ham Noah had three sons, Shem, Japhet, and Ham. Ham, Shem and Japheth, Sons of Noah -- Courtesy of Return To Glory Ham (Hebrew meaning hot, burnt, black) was part of the family of eight who survived the great flood. Descendants of Ham populated Africa and parts of Asia. The word Ham is believed to come from the word Khawm which means “black, hot, and burnt” in Hebrew. Ham had 4 sons. They make up the AFRO-ASIATIC FAMILY. The Bible stated that Ham and his sons, and their soon-to-be descendants lived and became the forefathers of the modern African continent, the modern Middle East, and the modern West Asia. A. Cush – Nubians/ Ethiopians and Babylonians. Ethiopia's borders at one time, stretched beyond the Red Sea, all the way to modern Yemen. Ethiopia, the land of Cush, was closer, both to India and Israel in ancient times before its borders were shrunken. Apparently, this family divided into two branches early. Some founded Mesopotamia/ Babylon (notably, King Nimrod) and others founded Ethiopia. B Mizraim– Egyptians. Misr is the Hebrew and Aramaic name for Egypt C. Phut – Sometimes called PUT or PUNT. The Land of Punt, also called Pwenet or Pwene by the ancient Egyptians. Punt was an ancient kingdom – founder of Lybia and modern-day Somalia- Somalians. Put (biblical figure) - Wikipedia D. Canaan – All the Ites people in the Bible who descended from Canaan. Canaanites are believed to be the first people in Israel. Before the construction of the Suez Canal, the entire eastern coast of the Mediterranean was a single land mass, adjoining Africa. Canaan was East Africa, later known in modern times as Palestine and Israel. 4. Egypt is mentioned in the Quran, the Christian and Hebrew bibles. The Bible said Egypt is the Land of Ham.( Hebrew meaning hot, black, and burnt). The Bible never mentions once the lands of either England or Germany. However, African nations are mentioned again and again. The Old Testament calls Egypt the Land of Ham. The Bible refers to Egypt as \"the land of Ham\" in Psalms.78:51; 105:23,27; 106:22; 1 Chronicles 4:40. It has over forty references to Ethiopia and over one hundred references to Egypt. Even ancient sources, biblical and non-biblical, mention both Ethiopia and Egypt together long before either country was on any map. Egypt's ancient name was Kermit or Kemet meaning black soil. It talks about the wars that involved the major superpowers since mankind started. These wars can be proven to be true from History books and archaeological finds. Psalm 105:23-27 (KJV) 23 Israel also came into Egypt; and Jacob sojourned in the land of Ham. 24 And he increased his people greatly; and made them stronger than their enemies. 25 He turned their heart to hate his people, to deal subtly with his servants. 26 He sent Moses his servant; and Aaron whom he had chosen. 27 They shewed his signs among them, and wonders in the land of Ham. Psalm 106:20-22 20They exchanged their glorious God for an image of a bull, which eats grass. 21They forgot the God who saved them, who had done great things in Egypt, miracles in the land of Ham and awesome deeds by the Red Sea 5. Egypt would hire solders from his brother’s tribes. Men from the tribes of Canaan, Put, and Cush to help fight the western invaders. Later on in history, there would be civil wars where the brothers would fight among themselves. See the solders: Go to the link and scroll down to the bottom. look at the solders https://en.wikipedia.org/wiki/Land_of_Punt : http://africanknowledge.weebly.com/the-egyptians.html Look at these pictures also. The Bible has historical events, such as wars, that have been proven to be true: The brothers helped each other fight as describe in Jeremiah and other chapters - Jeremiah 46:9 Charge, you horses! Drive furiously, you charioteers! March on, you warriors-men of Cush and Put who carry shields, men of Lydia who draw the bow. (They march out of Egypt, arranged in their divisions; cavalry, chariots, and infantry to begin the campaign.) The forty-sixth chapter contains two prophecies concerning it: one was the discomfiture of Pharaoh Necho at Carchemish by Nebuchadnezzar. Nahum 3:9 Ethiopia and Egypt were her strength, and it was infinite; Put and Lubim were thy helpers. 2 Chonicles12:2-4 In the fifth year of Rehoboam's reign, because they had been unfaithful to the LORD, Shishak king of Egypt came up and attacked Jerusalem 3with 1,200 chariots, 60,000horsemen, and countless troops who came with him out of Egypt— Libyans, Sukkites, and Cushites. 4He captured the fortified cities of Judah and came as far as Jerusalem.… Ezekiel 25-32 consists of prophecies against nations. Ezekiel 30:5 states: Ethiopia, and Libya, and Lydia — (The names in Hebrew are Cush, Phut, and Lud, which are mentioned together as the Egyptian allies), and the people of the covenant land will fall by the sword along with Egypt. The Egyptians, employed mercenary soldiers from their brother’s tribes.  Ethiopians—Hebrew name is Cush:  Libyans--Phut, Mauritania, west of Egypt (compare Genesis 10:6 ). The Libyans used long shields extending to the feet. Lydians sometimes called Ludim ( Genesis 10:13 , 1 Chronicles 1:11 , Nahum 3:9 Isaiah 66:19 ; Jeremiah 46:9 ; Ezekiel 27:10 ; Ezekiel 30:5 and 38:5 ) Ludim --, an African nation descended from Egypt (Mizraim);Mizraite people or tribe descended from Ludim the son of Mizraim; also called Lydians. It is probable that the Ludim were settled to the west of Egypt, perhaps farther than any other Mizraite tribe. Lud and the Ludim are mentioned in four passages of the prophets 6. Race was not a factor only CLASS in Egypt. There were many shades of black in the land of Egypt. You begin to see many shades of Black from the darkest eggplant hue to honey-colored caramel, to brownish- tan, to reddish black (ruddy colored), etc. Even back in Biblical times, the descendants of the 3 sons of Noah, intermingled with each other. Plus, the Kings and Pharaohs would have many wives and concubines. Some of the wives would come from foreign royalty in foreign lands, to bind treaties of the powerful nations at that time. Egypt was a major trading center. Ordinary people also mingled together. Also, since the Middle Kingdom, foreign slaves mainly from Asia, became increasingly numerous. They were either prisoners of war or traded by slave merchants. See Slavery, its causes and practice Some of the wives would come from foreign royalty in foreign lands, to bind treaties of the powerful nations at that time. The powerful nation of Mittani people are from Japhet’s son Madai. They would trade with Egyptians and intermingle. Egyptian dynasties entered into pacts and treaties with Mitanni and the daughter of the Mitanni King Tushratta, the princess Taduhepa, was given in marriage to Pharaohs Amenhotep III (1391-1353 BCE) and Amenhotep IV. 7. Notice the power of Egypt and Israel at this time in history!!!. Egypt did not give to many of their princesses away but many nations would give them their royal daughters. Egypt gave King Solomon an Egyptian Princess. Pharaoh's daughter (wife of Solomon) - Wikipedia 1 Kings 3:1 says,\"And Solomon became allied to Pharaoh king of Egypt by marriage, and took Pharaoh's daughter, and brought her into the city of David, until he had made an end of building his own house, and the house of the Lord, and the wall of Jerusalem round about.\"Most scholars believe the alliance was a result of the reputation of Solomon's father, \"Under David, Israel had become a factor to be reckoned with in Eastern politics, and the Pharaoh found it prudent to secure its friendship.\"1 Kings 7:8–12 \"And [Solomon built] his [own] house where he might dwell, in the other court, within the porch, was of the like work. He made also a house for Pharaoh's daughter, whom Solomon had taken to wife, like unto this porch. All these were of costly stones, according to the measures of hewn stones, sawed with saws, within and without, even from the foundation unto the coping, and so on the outside unto the great court.And the foundation was of costly stones, even great stones, stones of ten cubits, and stones of eight cubits. And above were costly stones, after the measure of hewn stones, and cedar-wood. And the great court round about had three rows of hewn stone, and a row of cedar beams, like as the inner court of the house of the Lord, and the court of the porch of the house.\"The alliance through marriage is seen by scholars as the reason for the reported increase in trade with Egypt at 1 Kings 10:28–29. 8. Egypt takes on more foreign princesses. Pharaoh Amenhotep III is known to have married several foreign princesses as part of treaties which balanced power between nations. • Gilukhepa, the daughter of Shuttarna II of Mitanni, in the tenth year of his reign. • Tadukhepa, the daughter of his ally Tushratta of Mitanni, Around Year 36 of his reign • A daughter of Kurigalzu, king of Babylon. • A daughter of Kadashman-Enlil, king of Babylon. • A daughter of Tarhundaradu, ruler of Arzawa. • A daughter of the ruler of Ammia (in modern Syria). 9. There is a bust of Narmer of 1st Dynasty https://en.wikipedia.org/wiki/Narmer  There is a Bust of Pharaoh Huni from 3rd dynasty. https://en.wikipedia.org/wiki/Huni  There is a bust from Pharaoh Sahure from the 5th Dynasty.https://en.wikipedia.org/wiki/Sahure  Mentuhotep II of the 11th Dynasty https://en.wikipedia.org/wiki/Mentuhotep_II  painting is from the inside of Queen Aashyt chamber in Mentuhotep II temple.  Pharaoh Taharqa - Wikipedia notice the two serpents on his crown. He is King of Cush and King of Egypt, 25th Dynasty. Taharqa - Wikipedia  ",
            "date": "Updated May 8, 2020",
            "views": "18",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Tion",
                    "user_href": "/profile/Chris-Tion-1"
                },
                {
                    "user_id": "Gary Garrett",
                    "user_href": "/profile/Gary-Garrett-1"
                },
                {
                    "user_id": "Hod A",
                    "user_href": "/profile/Hod-A"
                },
                {
                    "user_id": "Kée Mosley",
                    "user_href": "/profile/Kée-Mosley"
                },
                {
                    "user_id": "DaVontae Coker",
                    "user_href": "/profile/DaVontae-Coker"
                },
                {
                    "user_id": "Tavai Bailey",
                    "user_href": "/profile/Tavai-Bailey"
                },
                {
                    "user_id": "Michael Davis",
                    "user_href": "/profile/Michael-Davis-592"
                },
                {
                    "user_id": "Michael Karadjis",
                    "user_href": "/profile/Michael-Karadjis"
                },
                {
                    "user_id": "Phyllis Nordhoff",
                    "user_href": "/profile/Phyllis-Nordhoff"
                },
                {
                    "user_id": "Jamie Smith",
                    "user_href": "/profile/Jamie-Smith-767"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rita Maria Bargash",
                "href": "/profile/Rita-Maria-Bargash"
            },
            "answer_text": "The ancient egyptians did not depict themselves the same as “black” Africans. In fact Egyptian art categorizes people into four separate groups of stereotypes: Its \"Egyptians,\" as defined against \"Asiatics\", \"Nubians,\" and \"Libyans.\"  The four races of the world. From left to right: an Egyptian (\"Reth\")an Asiatic/Canaanite or possibly Syrian (\"Aamu\")a Nubian (\"Nehesu\")and a Libyan/Amazigh/Berber (\"Themehu\") based on a mural from the tomb of Seti I. Each of these stereotypes is easily recognizable based on distinct physical characteristics. Skin tone, clothing and hairstyles must be interpreted as particularly important indicators of perceived ethnic membership based on Egyptian attention to these details and their recurrence throughout Egyptian history. In general, Egyptian men are portrayed with reddish skin, long hair and white linen kilts. Asiatics are depicted with yellow or white skin, long hair, full beards and fringed skirts with colorful patterns while the Berber/Amazigh/Temehu Libyan chiefs were depicted with feathers, tattoos and tunics with colors. Nubians have much darker skin, short knappy hair, and are often shown wearing large earrings and bracelets. They also wear long skirts made of animal skins. Egyptians also differentiated themselves from other peoples linguistically. Egyptians referred to themselves as rmt, a term that could signify \"person\" or \"human\" in addition to \"Egyptian.\" Egyptians contrasted this term with various words for the various peoples they encountered. The peoples of the Near East were broadly termed '3mw, or \"Asiatics. The peoples that inhabited the land to the south of Egypt were generally called nhsj, \"Nubians and the peoples living to the west of Egypt were referred to as tmh,\"Libyans. The political relationship between Egypt and Nubia was quite different from the political connections between Egypt and its Asiatic neighbors. Egypt's political and economic presence in Nubia was much more clearly defined, and it can thus be assumed that Egyptians, at least on the elite and royal levels, had a much higher degree of direct contact with Nubians than with Asiatics. However, much like the Asiatics of this time period, the Nubians that appear in Egypt's literature often serve as a symbolic enemy of the king; once again foreigners serve as chaotic forces in opposition to the ordered world of Egypt. The image of Nubians from the Egyptian textual evidence of the Middle Kingdom is quite negative.  Relief Depicting Egyptian King Ramesses II “Smiting” a Nubian Prisoner  Many of these texts could be however steeped in royal propaganda, and can thus only offer insight into the royal rhetoric of the time. In these texts, Nubians are depicted as being rebellious groups that must be defeated and controlled by the pharaoh. Indeed, they are not merely seen as nuisances to be silenced, but rather, enemies to the Egyptian worldview. An excellent example of the Egyptian view of Nubians is the Boundary Stele of Sesostris III. This text is also referred to as the Semna Stele because it once adorned a stele that stood at Semna on the border between Egypt and Nubia. The text itself clearly characterizes the stele as a boundary marker. Sesostris III praises his own ability to protect the borders of Egypt from attack, and his success in extending these borders farther south. Fixed borders are not simply a means of political control, but in a literary context may also be an ideological definition of the limits of social or even cosmic order.,,thus, the Semna Stele must be interpreted not simply as an official demarcation of Egyptian territory. The ideological and propagandistic elements of this work must also be taken into account. At the end of this inscription, Sesostris III gives us details of his actions in Nubia and his encounters with the Nubians themselves. He explains, I have captured their women, I have carried off their dependents, Gone to their wells, killed their cattle, Cut down their grain, set fire to it. As my father lives for me, I speak the truth! It is, however, the assessment of the Nubians themselves that is of interest here. The Egyptian king expresses his disdain for the Nubians, saying: \"they are not people one respects, they are wretches, craven-hearted.\" It is clear that this royal scorn serves a clear and valuable rhetorical function. There is no need to assume that the Semna Stele was inscribed to be read by any ordinary literate person, whether Egyptian or Nubian, who happened to have an idle half hour at the border. There is an element of address to posterity, and it is assumed that any successor'son'-of Sesostris campaigning in the area will show interest. Thus, the demeaning language used to describe the Nubians serves to \"justify\" Egyptian economic and political control over the peoples to the south. The royal view of Nubians, therefore, must place these people below the Egyptians in order to maintain the legitimacy of Egyptian presence in the region.  Fragment of painted plaster from the tomb of Sebekhotep, part of a tomb wall: showing Nubians bringing tribute from the south to Pharaoh. The figure at the front carries interlocking gold rings over one arm; the man behing bears ebony logs on his shoulder and a giraffe's tail in one hand. The third figure carries a leopard skin and a basket full of chunks of red jasper; a monkey perches behind his head. All three wear earrings. The term “Nubia” is actually a modern word, which may be derived from the ancient Egyptian word for gold – nebu. To both the Egyptians and Nubians, the Nile River was the source of their lifeblood as it brought yearly floods that allowed their crops to grow, so both peoples were geographical orientated along a north-south axis. The Egyptians referred to anything south of the first cataract (cataracts are rocky portions of a river unnavigable by boat) as “Wawat” and anything south of the second cataract was called “Kush.” Collectively, Wawat and Kush comprise the region that modern scholars generally refer to as Nubia  Mural in an ancient Egyptian tomb in the Valley of the Nobles on Luxor's West Bank. The painting shows egyptian mourners bringing foot and lotus blossoms for the afterlife. Last note is that the Egyptians certainly don't fit into modern constructed dichotomy of “black” vs “white” Its pretty annoying when reading these questions trying to pigeonhole the ancient Egyptians into a ‘racial’ category or for political purposes. If this “black” here is a synonym for the negroid race, than no, indigenous north Africans dont cluster with “Black” Africans since they trace their origin from outside of Africa, the result of ancient back migrations from the Near East and therefor Eurasian in origin. ",
            "date": "Updated April 10, 2019",
            "views": "1",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Duly",
                    "user_href": "/profile/Chris-Duly"
                },
                {
                    "user_id": "Sam Khalid",
                    "user_href": "/profile/Sam-Khalid-10"
                },
                {
                    "user_id": "Walter Smyth",
                    "user_href": "/profile/Walter-Smyth"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Army-Motivation-Videos"
                },
                {
                    "user_id": "Phyllis Nordhoff",
                    "user_href": "/profile/Phyllis-Nordhoff"
                },
                {
                    "user_id": "Clifton Walton",
                    "user_href": "/profile/Clifton-Walton"
                },
                {
                    "user_id": "Offizier Hashem",
                    "user_href": "/profile/Offizier-Hashem"
                },
                {
                    "user_id": "Đỗ Tú Việt",
                    "user_href": "/profile/Đỗ-Tú-Việt"
                },
                {
                    "user_id": "Arian Tari",
                    "user_href": "/profile/Arian-Tari-1"
                },
                {
                    "user_id": "Ben James",
                    "user_href": "/profile/Ben-James-413"
                }
            ]
        }
    ]
}