{
    "title": "Why did communism fail in Europe but flourish in China? - Quora",
    "tags": [
        "Communism",
        "Europe",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jansen Junaedi",
                "href": "/profile/Jansen-Junaedi"
            },
            "answer_text": "I will make a short answer here. Communism failed in Europe and also in Latin America because the practitioner doesn’t want to admit that the theory failed in practice. I like to call these people as Communists by the books, as they are too rigid in trying to put Marxist theory in practice. The only countries that successfully applied Marxist theory in Europe are the Scandinavian states, as they only take the good thing about Marxism while staying away from its absurdity, like doing a revolution. China and other East Asian countries are different. Although at first, they went to the same disaster as the Europeans in their first decades, over time reality makes them realize they need to modify Marxism according to the situation they are living, making Communism naturalized to their own respective cultures. Hence, many said that the communist countries in Eastern Asia are not communist countries China is now a Chinese Capitalism slapped with Socialism, Vietnam is now a Sinosphere Capitalism slapped with Socialism, Laos and Cambodia have turned into a generic third world authoritarian government, Mongolia embraced a socialist democracy, while North Korea turns into a Kingdom. ",
            "date": "Answered July 21, 2020",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zena Zeng",
                "href": "/profile/Zena-Zeng-1"
            },
            "answer_text": "In the long history of China, people live a family life. It may be difficult to understand for Europe people. But this is real. The lowest government official is head of a county. Below this level, it is managed by the families. So in the long history, Chinese live a grouping life. You can find many Chinatown in many countries, because Chinese like to live together. The individual is not the most important. This core value is in line with communist values. The communism is a political belief or social state. Communism advocates the abolition of private property rights and the establishment of a society without class system, state and government, and collective production. This is why in the Mao’s time and recent North Korea, the people live a happy life although the people is very poverty. But the low production efficiency make tens of millions Chinese people dying of hungry. This makes the government realize that increasing the production ability is the first thing. Only highly developed productive forces can realize communism. That is why the China reform and reform again. For Europe, the extreme democracy and freedom make the individual value very important. This is not in line with the core value of communism. I think this is why communism fails in Europe. ",
            "date": "Answered July 18, 2020",
            "views": "242",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catalin Olteanu",
                    "user_href": "/profile/Catalin-Olteanu-8"
                },
                {
                    "user_id": "Harry Dandas",
                    "user_href": "/profile/Harry-Dandas"
                },
                {
                    "user_id": "Vladut Alexandru",
                    "user_href": "/profile/Vladut-Alexandru-2"
                }
            ]
        }
    ]
}