{
    "title": "Why is China behaving as a modern day Nazi Germany? - Quora",
    "tags": [
        "Nazism",
        "Nazi Germany",
        "World War II",
        "Germany",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Chen-Smith",
                "href": "/profile/James-Chen-Smith"
            },
            "answer_text": "Definitely not. Maybe in some aspects, such as ethnic cleansing of Xinjiang. But generally speaking, The Chinese Communist Party is Nothing like Nazi Germany. The Chinese Communist Party does not care for their citizens and treats Han, Tibetans and Uighurs equally miserably. In contrast, Nazi Germany prioritized Ethnic Germans whilst marginalizing other ethnic groups. The only thing nationalistic about the Chinese Communist Party is their propaganda. The Chinese Communist Party hates religion, anything deviating from the party line is illegal and “subversive.” In comparison, it is arguable that Nazis persecuted religions, however the scale of which was no way even close to comparing to the target religious persecution of Chinese Christians, Muslims and Falun Gong Practitioners. The Chinese Communist Party hates traditional culture. Although they now claim to champion traditional Chinese culture, nothing can excuse the destruction thereof in the past 60 years. Nazi Germany, in contrast, tried their best to preserve traditional German traditions, festivals and customs. Adolf Hitler himself was a talented classical artist who focused on traditional architecture, criticizing and marginalizing “degenerate modern art (Entarete Kunst).” The Chinese Communist Party hates the environment. The party philosophy of battling with the heavens and the Earth. The Chinese Communist Party does not care about contaminating rivers, releasing harmful particulates into the atmosphere or destroying natural water flow in their ambitious dam projects. Ethnic Germans were living the life during Nazi Germany, if it wasn’t for the war and tough sanctions, Germany had real potential to surpass even the US with Innovation and Technology. The US in fact hired talented Nazi Scientists through Operation Paperclip. “National Socialism is as Socialist as Prager University is a real University.” ",
            "date": "Answered July 29, 2020",
            "views": "408",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arjun Srivastava",
                    "user_href": "/profile/Arjun-Srivastava-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitan",
                "href": "/profile/Chaitan-1"
            },
            "answer_text": "No like Soviet Union severe lack of worker's rights (in particular the hukou systemwhich restricts migrant labourers' freedom of movement), the absence of independent labour unions (which have since been changing and allegations of discrimination against rural workers and ethnic minorities, as well as the lack of religious freedom – rights groups have highlighted repression of the Christian,[ Tibetan Buddhist, and Falun Gong religious groups. Some Chinese activist groups are trying to expand these freedoms, including Human Rights in China, Chinese Human Rights Defenders, and the China Human Rights Lawyers Concern Group. Chinese human rights attorneys who take on cases related to these issues, however, often face harassment, disbarment, and arrest. ",
            "date": "Answered July 24, 2017",
            "views": "640",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Chen-Smith",
                    "user_href": "/profile/James-Chen-Smith"
                },
                {
                    "user_id": "Duncan Bennett",
                    "user_href": "/profile/Duncan-Bennett-10"
                },
                {
                    "user_id": "Aneural Astro",
                    "user_href": "/profile/Aneural-Astro"
                },
                {
                    "user_id": "Jacob Lazar",
                    "user_href": "/profile/Jacob-Lazar-5"
                }
            ]
        }
    ]
}