{
    "title": "Why are Greece and Turkey relations at a historical low? - Quora",
    "tags": [
        "Greek–Turkish Relations",
        "Politics of Greece",
        "History of Turkey",
        "Foreign Policy of Turkey",
        "History of Greece",
        "Politics of Turkey",
        "Greece",
        "Turkey (country)",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhi Mehrotra",
                "href": "/profile/Abhi-Mehrotra"
            },
            "answer_text": "Turkey is continuously voilating international rules and is creating a panic in the world . Both and Greece and Turkey have a unsettled Coastal Territory Dispute and due to which their relations are highly stressed. Turkey is a member Of NATO organization ,so it have USA advanced technology ,Fighter Jets so Turkey is trying to capture the resources Of Meditterian sea which are near the islands of Greece . So , it's Basically a struggle For Energy, Oil Reserves .  How have relations soured? Turkey and Greece have competing ambitions over gas reserves and they disagree profoundly over who has rights to key areas of the Eastern Mediterranean. They have laid claim to overlapping areas, arguing they belong to their respective continental shelves. In July, Turkey put out a naval alert - known as a Navtex - that it was sending its Oruc Reis research ship to carry out a drilling survey in waters close to the Greek island of Kastellorizo, a short distance from the coast of south-west Turkey.   ",
            "date": "Answered October 23, 2020",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikos Tsakonas",
                "href": "/profile/Nikos-Tsakonas-3"
            },
            "answer_text": "They are not. Greece and Turkey have been fighting each other all the time since the independence of Greece. When not in war against each other , there used to be many minor incidents at the borders. As a greek i can say with confidence that the animosity between the two nations will never stop. ",
            "date": "Answered October 23, 2020",
            "views": "179",
            "upvotes": "0"
        }
    ]
}