{
    "title": "Why do people still argue about world war 2? - Quora",
    "tags": [
        "Arguments and Argumentation",
        "World War II",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Carioto",
                "href": "/profile/Robert-Carioto"
            },
            "answer_text": "We study the war. We don’t argue about it per se. We argue about certain points or misconceptions. For example I would argue with a Pearl Harbor conspiracy theorist or the merits of the atomic bombs or the strategy and tactics of a certain campaign, or which weapon or weapon system was better. Its like two sports fans arguing a bout a past Super Bowl or World Series,Besides wit the war,even though it’s over and done with,it’s outcome still effects us to this day. ",
            "date": "Answered February 13, 2017",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alfred Montestruc",
                "href": "/profile/Alfred-Montestruc"
            },
            "answer_text": "I cannot answer for others. For myself I seek to look more at the soundness of the political decisions made by various leaders, and the effects on our history. My take is that WWII was a horrible mistake on the part of everyone. I do not even slightly dispute the evil nature of the Nazi, Japanese, Fascist, or Communist regimes. I do however question the effectiveness and soundness of the policies of all the Allied governments, based on the horrific costs of the war, and looking honestly at reasonable cost-benifit estimates of policy decisions made. Take for example the decision by the British & French Governments to not support Czechoslovakia in 1938, where the Czech had a much larger army in proportion to the Germans than the Poles did, and rugged terrain & fortresses, and were a democracy, and a long standing treaty obligation. The problem I see in discussion of this is people making presumptions that I favor the axis, I do not. I am taking a hard and critical look at the decisions made by the Allied leadership. ",
            "date": "Answered February 12, 2017",
            "views": "338",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akash",
                    "user_href": "/profile/Akash-985"
                }
            ]
        }
    ]
}