{
    "title": "Why were medieval castles built on hills? - Quora",
    "tags": [
        "Medieval Castles",
        "Forts",
        "Medieval Warfare",
        "Castles",
        "Middle Ages (era)",
        "Residential Construction",
        "Architecture",
        "Construction",
        "Civil Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "E. Segal",
                "href": "/profile/E-Segal"
            },
            "answer_text": "Some were, not all. Strategically important castles were generally built to higher standards than landowner’s castles tasked more with agriculture than with defense of the nation/empire/etc. First, in times of peace, height made it easier to survey the surrounding lands and villages, which led to the second, which was during times of unrest, they could spot problems earlier (i.e. villages being pillaged and burned, marauding/marching forces) from much farther away, and could prepare or counter longer in advance. Third, in times of battle, they were easiest to defend. The high ground always was and still is. A second component to the hills is that they were usually rock, whether bare rock or rock with earth on top, but in either case, it was a more stable footing to build on and eliminated the ability for opposing sappers to trench their way closer to the fort or undermine the castle walls by excavating beneath them (thus “sapping” them. ",
            "date": "Answered June 11, 2019",
            "views": "474",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Władysław Łoś",
                    "user_href": "/profile/Władysław-Łoś-1"
                },
                {
                    "user_id": "Geovane Júnior",
                    "user_href": "/profile/Geovane-Júnior-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Campbell",
                "href": "/profile/Susan-Campbell-173"
            },
            "answer_text": "Why were Medieval castles built on hills? Castles, whether wooden or stone, all had the same primary purpose—defence!   Few armies would be eager to attack either castle. Hills are fine, but  this one would be toast in no time! The walls are too low and too many windows. It is called a castle, but has nowhere for sentries to patrol—among other flaws. No, if I were to build or live in a castle, it would be one like this:  Hills are real, but not ideal! ",
            "date": "Answered July 1, 2019",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamie Legaspi",
                    "user_href": "/profile/Jamie-Legaspi"
                },
                {
                    "user_id": "Alison Wild",
                    "user_href": "/profile/Alison-Wild-2"
                },
                {
                    "user_id": "Udo Andre",
                    "user_href": "/profile/Udo-Andre"
                },
                {
                    "user_id": "Nita Pitts",
                    "user_href": "/profile/Nita-Pitts"
                },
                {
                    "user_id": "Jeremy Rutenberg",
                    "user_href": "/profile/Jeremy-Rutenberg"
                },
                {
                    "user_id": "Wiebe de Boer",
                    "user_href": "/profile/Wiebe-de-Boer"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Anthony Hoad",
                    "user_href": "/profile/Anthony-Hoad-1"
                }
            ]
        }
    ]
}