{
    "title": "Why do the Scottish and Welsh accents sound Irish? - Quora",
    "tags": [
        "Welsh (language)",
        "Wales",
        "Northern Ireland",
        "Irish Ethnicity and People",
        "Scotland",
        "Accents",
        "The Republic of Ireland"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gavin Sutter",
                "href": "/profile/Gavin-Sutter-1"
            },
            "answer_text": "As an Irishman, I find this an odd way to phrase the question - you might equally have said “Why do the Scots and Irish sound Welsh”, or “the welsh and Irish sound Scottish”… though all would have made only limited sense. The Welsh sound nothing like either the Irish or the Scots. The distinctive “Valleys” Welsh accent of Neil Kinnock or Huw Edwards softens and blurs to the East of Wales, and some Welsh people sound close to some English people close to the border (best tread with caution, Celts in general don’t like to be taken for English often! IT’s not an intolerance thin,g more a ‘don’t you are erase our identity’ thing… ). Around parts of North East Antrim in Northern Ireland (Ballymena, and moreso Coleraine, Portballintray, *sometimes* Larne), our accents can, to the untrained ear, sound similar to parts of Scotland (Ayrshire especially). Unsurprising, as there has been movement in both trade and population back and forwards for many years, and the Medieval kingdom of Dalriada straddled parts of Antrim and parts of the west coat of Scotland. As well as some similarities in accent, there is also a similarity in dialect. While distinct form each other, speakers of the Northern Ireland dialect of Irish will usually be able to understand those speaking Scots Gaelic for similar reasons. Usually you can pick out the differences quite quickly, though not everyone has the ear for it, I suppose. Back in the eighties I met some English folks who couldn’t tell my Larne-area accent from Dublin, and I’ve also met an Australian or two who did a Cork Leprechaun ‘lucky charms’ accent when imitating a comedian from PortStewart (Well up in Northern Ireland - closer Scotland by far than Cork, in both accent and geography!). ",
            "date": "Answered July 1, 2020",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gill Grant",
                    "user_href": "/profile/Gill-Grant-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barnett Christopher",
                "href": "/profile/Barnett-Christopher"
            },
            "answer_text": "They don’t. The UK has a greater variety of accents than I’ve had cups of tea, so that applies to Wales and Scotland too. The “Music Hall”, for want of a better term, Welsh accent, the rather sing-song style is only found in the South Wales valleys and then not everywhere. Merthyr Tydfil, for example has a very distinct accent that many think sounds North Walian. In North Wales, especially on the coast, many people sound almost like Scousers. Liverpool, remember, is the capital of North Wales. The Scottish “Music Hall” accent is based on the Glasgow dialect, and that doesn’t apply to all of Scotland. The Highlands have a much gentler way of speaking, for example. Ireland is different again, Cork people tend to speak rapidly, Galway sounds rather melodic ( to my ears ) but the biggest contrast I heard was between Dublin Southsiders and Northsiders. Amazing to realise that they live in the same city. Yes, I’m into accents. When I was a kid, my Dad was in the RAF and I changed my own accent every couple of years. ",
            "date": "Answered June 15, 2020",
            "views": "560",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gavin Sutter",
                    "user_href": "/profile/Gavin-Sutter-1"
                },
                {
                    "user_id": "Margret Meyer",
                    "user_href": "/profile/Margret-Meyer-1"
                },
                {
                    "user_id": "Noreen O'Donovan Hage",
                    "user_href": "/profile/Noreen-ODonovan-Hage"
                },
                {
                    "user_id": "Cormac Ó Loingsigh",
                    "user_href": "/profile/Cormac-Ó-Loingsigh"
                },
                {
                    "user_id": "G.Canavan",
                    "user_href": "/profile/G-Canavan"
                },
                {
                    "user_id": "Ben Gee",
                    "user_href": "/profile/Ben-Gee-2"
                },
                {
                    "user_id": "Graeme Stein",
                    "user_href": "/profile/Graeme-Stein-2"
                },
                {
                    "user_id": "Jewell Martin",
                    "user_href": "/profile/Jewell-Martin-7"
                }
            ]
        }
    ]
}