{
    "title": "Why are wars generally fought? - Quora",
    "tags": [
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cristian A. Rodriguez",
                "href": "/profile/Cristian-A-Rodriguez"
            },
            "answer_text": "Wars are nothing but the territory (resources) conflicts like in other animals. Territory in animals is all about the resources.We just took it to an industrial scale. All wars are for resources. Forget ideology, forget religions, forget every excuse. Wars are nothing more than competition for resources. Wars for territory are for resources. If the land has no resource, it has no value. But in modern times even a rock in the middle of the ocean is valuable, because it gives you 200 nm of exclusive economical sovereignty and 350 over seabed resources. The first wars between tribes were for RESOURCES. Hunting grounds, gathering lands, women! (women are a resource, the most important, without them there is no continuation of the family/clan/city/country. Men are expendable, that is why they are always more than 90% of casualties).  Ancient wars were for resources. Not religion, nor against barbarians. More lands, more resources, more taxes.Religions were always excuses.     The fights like the 30 years and 80 years wars, the War of the Roses, all for resources. Control over land, trade lines, access to regions, etc.  Independence wars are for resources. The metropolis takes much and the locals wants more, screw them said the elites, lets make our own country and we are the ones who rule and take it all.  WWII?. RESOURCES. Forget about the NAZIS, Germany was embargoed, had no markets to place their products, had no raw resources to feed their industry. They needed resources.So UK kept locked Germany and they couldn’t obtain copper, iron, oil, rubber, aluminum, fine they went for them in the USSR. But first they had to secure more resources (Austria and Czechs, Romania and Hungary industries, mines, population), then food and mines (Poland), then end France or they would open a second front when they were going for the Russian farm fields, oil fields and mines.  Vietnam?. Communism, yes. Also resources. The more countries aligned to the US, the more human resources and land to maneuver for them. Everything is about resources. War is nothing more that our natural instinct for resources to survive. Just that now large States representing millions of people do it instead of small groups of individuals.Their interests for markets, raw materials, food, trade lines before others. All resources. There is no such thing as war for religion or ideology or democracy or freedom. Is all about power of the ones that lead those wars to control the resources for their country=the ones who rule or are about to rule.Land, people, trade lines are resources. You need to control them better than the rest if you want to keep your access to them.  ",
            "date": "Updated November 1, 2018",
            "views": "18",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frank Rodgers",
                    "user_href": "/profile/Frank-Rodgers-19"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                },
                {
                    "user_id": "Don Mockaitis",
                    "user_href": "/profile/Don-Mockaitis"
                },
                {
                    "user_id": "Subhrangshu Chakraborty",
                    "user_href": "/profile/Subhrangshu-Chakraborty-6"
                },
                {
                    "user_id": "Gregory Blake",
                    "user_href": "/profile/Gregory-Blake"
                },
                {
                    "user_id": "Rymnis Luminux",
                    "user_href": "/profile/Rymnis-Luminux"
                },
                {
                    "user_id": "H. Singh",
                    "user_href": "/profile/H-Singh"
                },
                {
                    "user_id": "Mohammed Ahmed",
                    "user_href": "/profile/Mohammed-Ahmed-136"
                },
                {
                    "user_id": "Fottitude Howard",
                    "user_href": "/profile/Fottitude-Howard"
                },
                {
                    "user_id": "Franchiscu Puliga",
                    "user_href": "/profile/Franchiscu-Puliga"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "Economic gain. This is the underlying reason for both Germany’s and Japan’s invasions in WWII. One country wishes to take control of another’s wealth. There are very often economic reasons underlying most conflicts, even if the stated aim of the war is publicly presented as something more noble. In pre-industrial times, the gains sought might be precious materials such as gold and silver, or livestock such as cattle and horses. In more modern times, the resources sought are more likely to take the form of things like oil, minerals, or materials used in manufacturing. Some scientists believe that as the world’s population increases and basic resources become scarce, there will increasingly be wars fought over fundamental essentials such as water and food supplies. The 8 Main Reasons for War ",
            "date": "Answered December 10, 2017",
            "views": "423",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suz Rau",
                    "user_href": "/profile/Suz-Rau"
                }
            ]
        }
    ]
}