{
    "title": "Why were the ancient Greeks incredibly smart? - Quora",
    "tags": [
        "Greek Ethnicity and People",
        "Ancient Greece",
        "Smart People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Van Basten",
                "href": "/profile/Martin-Van-Basten"
            },
            "answer_text": "They were not. At least not innately so more than any other ethnicities of Europe. Humans are about the same everywhere. The idea that particular ethnicities (especially those within such a small variation as the europid) would have a different intellectual potential is a racist idea that has no scientific evidence and has long been debunked. It’s not nature it’s nurture. The Greeks found themselves in the right place at the right time which was very conducive for the development of an advanced culture. The initial contact with the Minoan culture gave them an alphabet and possibly much more than just that as the Minoans were arguably the most advanced civilization in Europe and possibly the world at the time. We not only see all the architectural elements the greeks borrowed but Linear B (the early Mycenean alphabet) was borrowed from the Minoans (a later development of the initial Minoan alphabet called linear A ). It is highly likely that this came about through wars and conquest by the myceneans. We see quite a bit of archaelogical evidence that the interaction was not a peaceful exchange. The Minoans were subjugated and destroyed.Later after the greek “dark ages” when Linear B was forgotten the Greeks adopted a new alphabet borrowed from (or at the very least highly derivative of that of) the Phoenicians. The greeks were in an incredibly good location as they could trade with the most developed cultures of the period - the Phoenicians and the Egyptians. Many of the early Greeks travelled to Egypt and learned a lot from that culture. It is unclear how much knowledge the Egyptians had as most of the papyrus writings from the period are alas destroyed (most significantly in the burning of the library at Alexandria) but we can surmise that quite a lot was borrowed from the egyptian knowledge. The climate was also quite beneficial for them as they did not have to contend with very harsh winters. Greece is also covered in olive trees that need no cultivation at all. They just bear olives which just need to be picked. Easy access to the Aegean as a food source was also quite beneficial. It was often said about the Bosphorus for instance that you didn’t even need any fishing gear you could just catch the fish with your bare hands. They also had contact with the Phoenicians who were at the time the master tradesmen and who influenced the Greek alphabet immensely and most likely shipbuilding. Their political disunity (some would argue chaotic in many aspects ) was an advantage from other standpoints - it forced the greeks to constantly maintain a fighting force which was also very well trained due to the incessant skirmishes. This provided a very good conscription of non-professional army recruits when the greeks needed to fight others. This disunity in their political culture was also the foundation of free thinking. Since there was no one monarch to submit to the greeks were open to pursue their own ideas. (It was far from a democratic society. It was a plutocratic society. However, it was democratic enough to allow for freedom of thought. Although many a time this “democracy” turned to mob rule. We all know how the general who saved Greece from Persian domination was later banished from Greece as they were afraid he had become too popular and threatened their “democracy”… ) Finally, and perhaps controversially for some, I would posit that the immense slave workforce that they had (most of which was captured people from neighboring greek communities during the incessant wars they lead was a huge factor in promoting science and philosophy. Aristotle would hardly have had any time to write were he expected to till the soil and provide for his sustainance. He had 5 slaves.The immense slave workforce was no doubt a significant factor. It is estimated that the average family of the time had 5 slaves. One census of a county had the slave population at an astounding 10 slaves to every 1 free citizen. ",
            "date": "Updated August 25, 2020",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond Lenin",
                    "user_href": "/profile/Raymond-Lenin"
                },
                {
                    "user_id": "Huy Ngo",
                    "user_href": "/profile/Huy-Ngo-15"
                },
                {
                    "user_id": "Serafim Karalis",
                    "user_href": "/profile/Serafim-Karalis"
                },
                {
                    "user_id": "Jerome Arellano Galang",
                    "user_href": "/profile/Jerome-Arellano-Galang"
                },
                {
                    "user_id": "Shaun Neo Mkhwebane",
                    "user_href": "/profile/Shaun-Neo-Mkhwebane"
                },
                {
                    "user_id": "Özkan Cavit Hoşlan",
                    "user_href": "/profile/Özkan-Cavit-Hoşlan"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Daniel Kalchev",
                    "user_href": "/profile/Daniel-Kalchev"
                },
                {
                    "user_id": "Marin Karimov",
                    "user_href": "/profile/Marin-Karimov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Theodore",
                "href": "/profile/Steve-Theodore"
            },
            "answer_text": "What made them smart was what they were dumbest at.   The great days of Greece were the period when they were incredibly disorganized: at war with each other and the outside world.  They were politically fractious, terrible at compromise, and prone to treachery.  We all remember Leonidas at Thermopylae -- we tend to forget that fellow Greeks led the Persians around the Spartan wall;  we know how the Athenians invented democracy, but we tend to forget the many anti-democratic coups and conspiracies which punctuated Athenian history down to the end. The paradoxical result was weak states and weak institutions, which forced them to argue.  A lot.  In public.  In that time and place, this was unusual: most successful societies of the same time were hierarchical, with received opinions flowing down from the top -- the kings, the priests, the clan elders and so on. The shambolic disorganization of Greece, by contrast, meant that there was no source of authority to which you could appeal: it was necessary to hash things out by arguing.    This tended to teach people how to argue:   Philosophy (philosophia) and political rhetoric (sophistika) are near-cousins: to some degree politicians need concepts and frameworks to make their arguments sound like more than self interest, while the philosophers use the verbal tricks and logical cheats of the politicians to construct their ideas.  \"Natural philosophers,\" or as we would say scientists, applied the same techniques of skeptical inquiry and combative explanation to the natural world that the philosophers and politicians used in public debates.  In later centuries, as the Greeks' tendency to factionalism and disunion left them under the dominion of outside powers, the link between politics and abstract thought weakened.  However the habit of analysis (Greek for unravel or untie)  and argumentation remained a key part of Greek culture. ",
            "date": "Updated October 11, 2015",
            "views": "238",
            "upvotes": " View 133 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Huy Ngo",
                    "user_href": "/profile/Huy-Ngo-15"
                },
                {
                    "user_id": "Roy Kachila",
                    "user_href": "/profile/Roy-Kachila"
                },
                {
                    "user_id": "Chris Ps.",
                    "user_href": "/profile/Chris-Ps-3"
                },
                {
                    "user_id": "Wandile Nyembe",
                    "user_href": "/profile/Wandile-Nyembe-1"
                },
                {
                    "user_id": "Özkan Cavit Hoşlan",
                    "user_href": "/profile/Özkan-Cavit-Hoşlan"
                },
                {
                    "user_id": "Elisa Silva",
                    "user_href": "/profile/Elisa-Silva-7"
                },
                {
                    "user_id": "Javier Castro",
                    "user_href": "/profile/Javier-Castro-24"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Jacob Angeles",
                    "user_href": "/profile/Jacob-Angeles-2"
                },
                {
                    "user_id": "Molly Amrine",
                    "user_href": "/profile/Molly-Amrine-1"
                }
            ]
        }
    ]
}