{
    "title": "Why is there that hate against Eastern Europeans in America and part of Western Europe? - Quora",
    "tags": [
        "Eastern Europeans",
        "Western Europeans",
        "Western Europe",
        "Eastern Europe",
        "Europe and the United States of America",
        "European Ethnicities and People",
        "Hate",
        "Europe",
        "International Relations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Iris Van Laar",
                "href": "/profile/Iris-Van-Laar"
            },
            "answer_text": "I’m from the Netherlands, so I'll focus on the reasons why a part of the Dutch population hates/dislikes/resents Eastern Europeans mainly arose when Eastern Europeans got access to our labor market and some issues caused friction: It happened around the 2008 recession, which means wages were already under a lot of pressure.Then Eastern Europeans came in, not as union employees, but registered as ZZP'er (independent contractors) and undercut the local wages. These local wages are a lot higher than in Eastern Europe, because cost of living is expensive, but they often accepted an income significantly under minimum wage, which is legal as an independent contractor, but not for employees. After the crisis many construction workers were forced to accept those same independent contractor contracts after the crisis.A lot of the first wave of Eastern Europeans never planned to stay, so stayed in overcrowded places, often shared vacation cabins with twice as much people as for what it was built for and quickly those cabins became unhygienic. Which is what happens if a bunch of young guys work long days and drink every night because of boredom. If there were no cabins available nearby, they often stayed where they worked. This could be in the middle of a quiet neighborhood, where people who like it that way live. Public drunkenness is more tolerated in the big cities than a relatively conservative small agricultural town.The resentment has calmed down now, since more families than single young men are coming over and stay and the immigrants have a stake in the attractiveness of the neighborhood they live and the undermining of wages have been limited by getting rid of clandestine employment agencies that are ‘hiring’ them in a country like Romania with a low minimum wage and letting them work here. Although countries like Poland fought this legislation, it is now required to pay the minimum wage of the country the person is actually working in and not the country where they were contracted. The problem with independent contractors remains, though. ",
            "date": "Answered July 1, 2020",
            "views": "207",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Viktor Orban",
                    "user_href": "/profile/Viktor-Orban-2"
                },
                {
                    "user_id": "Carles Manrique Pérez",
                    "user_href": "/profile/Carles-Manrique-Pérez"
                },
                {
                    "user_id": "Christian Flor",
                    "user_href": "/profile/Christian-Flor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Taylor",
                "href": "/profile/Stephen-Taylor-145"
            },
            "answer_text": "With the possible exception of Russia (and even that's pretty rare now), I've never heard of this prejudice in America. I'd actually love to meet a Polish woman. They're beautiful and aren't deranged, like so many American women are now. I've literally never met an American who \"hated\" Eastern Europeans. Where did you encounter this? I think there's a whole lot more curiosity than hatred here. Can't speak much for Western Europe. My only experience with Eastern Europeans there was with the staff at SAD Cars at Keflavik Airport in Iceland, who I'm pretty sure were entirely Polish and Filipino. The guy who picked me up at the airport in the shuttle van (Polish) made it pretty clear to me how much he wanted to get out of Iceland and move to California. I tipped him heavily, hoping it would help with his visa, since I believe Polish immigration to the United States has absolutely made this a better country and I hope for more in the future. Come on in. There's always more space here. Whenever I'm in Chicago, I go to an old Polish church. It takes me straight to Krakow. Sheer beauty. I don't think that Poles and other Eastern Europeans are really \"hated\" in Western Europe. But I assume they're kind of like Mexicans in the United States. Eastern Europeans often work low-end service jobs. Predictably, some pricks like to think immigrants are \"taking over\" and \"invading.\" If you don't think there are any pricks in Western Europe, uh, your knowledge is theoretical. But I'm sure that's not a majority. This hillbilly American has been to seven Eastern European countries — my favorite part of Europe, especially what I've seen of Poland and the former Yugoslavia. I don't really know why our First Lady (Slovenian) married who she did, but even the president of the United States — who's been married to two Eastern Europeans (one of his previous wives was Czech) — obviously doesn't \"hate\" them. ",
            "date": "Answered July 7, 2020",
            "views": "612",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Cassidy",
                    "user_href": "/profile/Ryan-Cassidy-6"
                },
                {
                    "user_id": "Rik Osborne",
                    "user_href": "/profile/Rik-Osborne"
                },
                {
                    "user_id": "Matt Blackshaw",
                    "user_href": "/profile/Matt-Blackshaw"
                },
                {
                    "user_id": "John Kawahara",
                    "user_href": "/profile/John-Kawahara"
                },
                {
                    "user_id": "Patrick Price",
                    "user_href": "/profile/Patrick-Price-1"
                },
                {
                    "user_id": "Mitchell Gonzales",
                    "user_href": "/profile/Mitchell-Gonzales-10"
                },
                {
                    "user_id": "Cyrus Pacht",
                    "user_href": "/profile/Cyrus-Pacht"
                }
            ]
        }
    ]
}