{
    "title": "Why were Japanese so afraid of Russian invasion during WW2? - Quora",
    "tags": [
        "Japan in World War II",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Weidner",
                "href": "/profile/Dennis-Weidner"
            },
            "answer_text": "Look at the map. In East Asia, Japan faces Russia, Korea, and China. Of the three, Russia was the only threat. The Japanese fought the Tsarist Empire (1905), but the Bolshevik/Communist Revolution created a whole new problem. Japan after the Meiji Restoration (1870s) began to industrialize. This created an industrial proletariat in the major cities and thus a challenge to Japan’s conservative political and social structure. And from the very beginning The Bolsheviks began promoting revolution in other countries, especially other industrial countries. The Japanese as a result, during World War I joined the United States in occupying Vladivostok to protect the supplies that had been delivered to the Tsarist forces. And diplomatic pressure had to be applied to get the Japanese to leave after the War. There was more than a military dimension and fear of Russia. Siberia was a vast storehouse of natural resources and the Japanese wanted a piece of it for the same reason they seized Manchuria. And Japan is the most resource poor county in the industrial world. As a result, as the Japanese military seized control of the Government during the Inter-War era, the strongest faction in the Imperial Army was the Strike North Faction—attacking the Soviet Union to seize the resources Japan so badly needed. That attack, however, never came for several reasons: Japan was shocked to find its Army was not on the same level as the Red Army and suffered a stunning defeat in an engagement on the Mongolian/Manchurian border. http://histclo.com/essay/war/ww2/cou/jap/road/mbw.htmlNAZI Germany which Japan was cultivating, without consulting Japan signed an alliance with the Soviets (August 1939). NAZI-Soviet Non-aggression Pact The Japan had envisioned attacking the Soviets in cooperation with the Germans. The German alliance with the Soviets without any consultation with Japan undermined the Strike North Faction. It also affected Japanese views of NAZI Germany as a reliable ally.Siberia at the time did not have developed oil fields. And the United States which supplied most of Japan’s oil was upping diplomatic pressure, demanding Japan end its aggression in China. This forced Japan which was not about to withdraw from China to find alternative sources for oil. This led to the victory of the Strike South Faction. http://histclo.com/essay/war/ww2/cou/jap/road/ssf-vic.html",
            "date": "Answered December 27, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Rodack",
                    "user_href": "/profile/Matthew-Rodack"
                },
                {
                    "user_id": "Michael Vaughan",
                    "user_href": "/profile/Michael-Vaughan-21"
                },
                {
                    "user_id": "Praveen Sharma",
                    "user_href": "/profile/Praveen-Sharma-14"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Keane",
                "href": "/profile/John-Keane-52"
            },
            "answer_text": "Because the only time they met the Russians in combat they got their butts kicked in so hard they never again even considered attacking the USSR, even when the Russians were on the ropes with the German invasion.  The Battle(s) of Khalkhin Gol (1939) was a stunning victory for the Soviets and showed the Japanese, who had seriously underestimated the Soviet ability to defend its eastern territories, that a campaign north of Manchuria would be far less profitable than a push south. Soviet commander Zhukov, who was to become famous for leading the successful counter-offensive against the Germans, first came to notoriety for his leadership in this battle. Tokyo would decide to focus on their campaigns of conquest to the south, and eventually sign a nonaggression pact with the Soviets in 1941. ",
            "date": "Answered December 26, 2017",
            "views": "19",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                },
                {
                    "user_id": "Paulius Sereika",
                    "user_href": "/profile/Paulius-Sereika"
                },
                {
                    "user_id": "Tony Birchill",
                    "user_href": "/profile/Tony-Birchill"
                },
                {
                    "user_id": "Wilson Ma",
                    "user_href": "/profile/Wilson-Ma-5"
                },
                {
                    "user_id": "Márcio Sobral",
                    "user_href": "/profile/Márcio-Sobral"
                },
                {
                    "user_id": "Oliver Johnson",
                    "user_href": "/profile/Oliver-Johnson-47"
                },
                {
                    "user_id": "Don Stallman",
                    "user_href": "/profile/Don-Stallman-1"
                },
                {
                    "user_id": "Geesing Ang",
                    "user_href": "/profile/Geesing-Ang"
                },
                {
                    "user_id": "James Grimm",
                    "user_href": "/profile/James-Grimm-6"
                },
                {
                    "user_id": "John Kenning",
                    "user_href": "/profile/John-Kenning-2"
                }
            ]
        }
    ]
}