{
    "title": "Why was Nynorsk established in Norway? How do Norwegians view it? - Quora",
    "tags": [
        "Norwegians",
        "History of Norway",
        "Culture of Norway",
        "Norwegian Ethnicity and People",
        "Norwegian (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anders Njål Hansen",
                "href": "/profile/Anders-Njål-Hansen"
            },
            "answer_text": "Because Stortinget, the parliament, decided to introduce a new, constructed language that wouldn’t represent Mid-Norway, and both the Southeastern, the Southern, and the Northern parts of Norway in 1885. Basically, nynorsk opposed Danish-infected areas. It is a long story. Nynorsk was a part of a language debate that had lasted a half century. Ivar Aasen and other people favoured a langauge from some parts of West Norway and a few inland areas. It was mostly constructed, but it kept some of the features from old Norwegian. It was a form of «constructive conservatism». Ironically, Ivar Aasen came from Sunnmøre. Today, nynorsk isn’t generally used in this area. Nynorsk is rare in East Norway. Personally, I think nynorsk is a pain in the butt. I am fond of learning it at school, but I hate nynorsk in everyday life, especially on the national tv. But it is kept there because many people appreciate the langauge, and it is the law. Why is «every» documentary texted in nynorsk? I like the spoken words, but I hate to read nynorsk text. Many people don’t want to learn nynorsk at all at school. While some parts in the country are demanding it. Why not an example? «Bjor». What is that word in «bokmål»? Hmmm… you don’t know exactly. If it is an animal, maybe it is «bear»? «Bjørn?» No, but that is actually close. It is a bever, which is also «bever» in «bokmål». ",
            "date": "Answered January 1, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul Vitols",
                    "user_href": "/profile/Paul-Vitols"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magnus Itland",
                "href": "/profile/Magnus-Itland"
            },
            "answer_text": "Nynorsk, or rather its predecssor Landsmaal, was created as a result of the National Romanticism in Norway. This cultural movement had a great impact on many European nations, but especially Norway which had recently been cut loose from its union with Denmark and was now in a looser union with Sweden. There was a great flowering of Norwegian culture, focusing on the rural Norway at the time and on the past, especially the Viking age and the years immediately following that time. As part of this movement, a linguist named Ivar Aasen collected samples of Norwegian dialects. He found that the dialects of the west coast and the valleys were closer to Old Norse as found in the sagas, and therefore counted them as the “most Norwegian” speech of his time. Based on these dialects, he and his friends proposed a new written language for all of Norway, called Landsmål (country language). The original written language of Norway was long lost, after most priests and other intellectuals perished in the Black Death. During the union with Denmark, Danish was the written language in the administration of Norway, and the language in which the Bible was translated after the Reformation. (Before, it was in Latin.) As such, people learned Danish in school. This did not sit quite right with the National Romanticists, who felt that a glorious nation such as Norway had been (in their eyes, at least) deserved its own language. Thus they promoted Landsmål. Other more pragmatic voices argued that now that Norway was in union with Sweden, the major risk was Swedification. Sticking with the Danish writing, which people were already familiar with, and gradually adapting it to reflect “the cultivated daily speech in the cities”, was a better approach. This would create a continuity with the education people already had. (Public schools had already been a thing for a while.) Any major upheaval in the language education would only open the gates for Swedish influence. (There are in fact some similarities between Nynorsk and Swedish even today that separate them from Danish, although there are also traits that are shared with Danish but nor Swedish.) Perhaps most importantly, the powerful people in Norway were mainly urban and therefore educated in Danish or later Dano-Norwegian. They already spoke something similar to Danish with Norwegian pronunciation and some Norwegian words. The Norwegian government, rather than causing a schism in the people at such a vulnerable time, made both of the languages official Norwegian languages, and the rural municipalities on the west and south coast embraced Landsmål while most others used the Danish-inspired Riksmål. The two language forms continued to exist side by side and gradually approached each other. In time this was reflected in a name change (1929), where the more Norwegianized form of Riksmål took the name Bokmål while the less archaic form of Landsmål was named Nynorsk. (Nynorsk definitely got the better deal in the naming process - it means New Norwegian, while Bokmål means “Book Language”.) Both the city population and those living in Eastern Norway were lukewarm at best to the west coast inspired language, and with the urbanization after WW2 the position of Nynorsk has been further weakened. At the same time, the two languages have continued to move closer, especially Nynorsk adopting more eastern forms and Danicisms that have become entrenched in common speech. Today, most Norwegians don’t really see the value of having two separate forms of Norwegian language, and especially not having to learn Nynorsk with its slightly more complex grammar. It seems likely that a complete merger of the two languages will happen within a generation, with the current Nynorsk perhaps being accepted as a side form, except for the more archaic forms which are likely to disappear altogether. The new language will most likely be called simply Norsk (Norwegian), although the word Samnorsk (Common Norwegian or Shared Norwegian) has been used in past attempts at merging the language branches. There exists a substantial literature in Nynorsk, notably poetry and high prose, which will likely be remembered for as long as Norway exists as a country. But the requirement for all Norwegian children to learn Nynorsk is likely to be short-lived, I think. ",
            "date": "Answered December 31, 2019",
            "views": "575",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Geir Bækholt",
                    "user_href": "/profile/Geir-Bækholt"
                },
                {
                    "user_id": "Anthony Morgan",
                    "user_href": "/profile/Anthony-Morgan-93"
                },
                {
                    "user_id": "Bartosz Józefowicz",
                    "user_href": "/profile/Bartosz-Józefowicz"
                },
                {
                    "user_id": "Kjell Andersson",
                    "user_href": "/profile/Kjell-Andersson-8"
                },
                {
                    "user_id": "Anthony Julian Alcos",
                    "user_href": "/profile/Anthony-Julian-Alcos"
                },
                {
                    "user_id": "Marc Lázaro Azkarate",
                    "user_href": "/profile/Marc-Lázaro-Azkarate"
                },
                {
                    "user_id": "Christopher Høe",
                    "user_href": "/profile/Christopher-Høe"
                },
                {
                    "user_id": "Louise Friocourt",
                    "user_href": "/profile/Louise-Friocourt"
                },
                {
                    "user_id": "Lyonel Perabo",
                    "user_href": "/profile/Lyonel-Perabo"
                },
                {
                    "user_id": "Arne Huse",
                    "user_href": "/profile/Arne-Huse"
                }
            ]
        }
    ]
}