{
    "title": "Why does Hinduism have many gods? - Quora",
    "tags": [
        "Hindu Gods and Goddesses",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vipul Gupta",
                "href": "/profile/Vipul-Gupta-94"
            },
            "answer_text": "The effort to reconstruct and understand our past opens many a though-provoking possibilities which although can not be definitive but may still sound equally logical from the multitude of perspectives your question affords. I like to think that the presence of so many Gods in Hinduism is essentially attributable to the inherent secular nature of our belief system. Allow me to elaborate. Hinduism in itself is not a religion in the strict definition of the term borrowed from Abrahamic religions, but rather a way of life loosly spun around a natural belief system. Humans evolved from isolated groups of nomads to tribes to mutually interacting pockets of civilizations. Aided by the bountiful nature of the subcontinent, the tribes or civilizations here must have chosen to cooperate with one another for such a sufficiently long period of time that, unbeknown to them, they developed a common cultural undercurrent, notwithstanding the differences in customs, language, eating habits and even local Gods (even today you will find that most villages in India have their own presiding deities). A clever way around conflicts was to superimpose regional names to the same God or relate one God to another through familial ties, by way of beautifully spun mythologies. Overtime knowledge got the better of our fighting instincts. Along came the invaders to whom we were all the same and we became hindus, and our ‘religion’ became hinduism. Maybe it was the harsh climatic conditions, or evolution through constant want, some prominent primodial animal trait, or some insecurity about their own religion that led people of other regions around the Earth to believe that the only way to survive and prosper is to exterminate and extinguish all other possibilities. What a collosal waste of life and knowledge preserved over many generations but now forver lost to humanity. And here those religions now stand boasting about their belief in a singular male God and mocking Hinduism for our multitude of Gods. But thats another story! ",
            "date": "Answered June 13, 2017",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samantha Elizabeth Fairley",
                    "user_href": "/profile/Samantha-Elizabeth-Fairley"
                },
                {
                    "user_id": "Yash Tiwari",
                    "user_href": "/profile/Yash-Tiwari-507"
                },
                {
                    "user_id": "Poornima Ramachandran",
                    "user_href": "/profile/Poornima-Ramachandran-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anusri",
                "href": "/profile/Anusri-12"
            },
            "answer_text": "Hinduism is generally associated with a multiplicity of Gods ,andit doesnotadvocatetheworship of oneparticulardeity. The Gods and Goddesses of Hinduism amount to thousands,all representing the many aspects of only one supreme Absolute called“Brahman”. However, people who don’t know this misinterprets the fact that Hinduism has a multitude of Gods! What one should understand is that although there are many manifestations the forms of deities anaspect of the Brahmanor, ultimately Brahman itself. Ignorance Is Bliss! The other day, I received an email with the shocking subject–“Attack on Hinduism” –from one of our users Jim Wilson, who was appalled bywhatthechildren’s sectionofan “Objective” Christian sitethathis daughter wasviewing, hadtosay. Jim forwardedme thelink to the web pagewith alinesaying that this wasablatantattemptto pass onpersonalbiasandprejudicial attitude to youngergenerations. Jesus Loves You, Ganesha Doesn't! You'll beshocked at whatthis fundamentalist Christian sitetells itskidusers. Abouthalfwaydown the page a boxitementitled \"Habu's Corner\" depictsa Ganesha-like figureansweringthequestion: \"How many godsdoyouhave?\" Habu'sreply: \"I don't know... I havelostcount!\" Thisis followed bythecomment: \"Wouldn't you rather havejust one Godwho lovesyouabunch thana bunch of godsthatdon't loveyouat all?\" ...then comes themore explicit advisory: \"Jesus loveseverybody, even theunsavedlike Habu! Rememberto prayfor Habuand otherslikehim thattheymayfind JesusandacceptHiminto their hearts! Whatdo youhaveto sayofsuch actsbyChristianfundamentalist propagandists? Catchthem young…! Here’re Jim’s comments: “Irespect theirrighttobelievewhatever they wishto believe, but I am opposed to the aggressive mannerinwhich they attempt to indoctrinateothers and themannerinwhich they attemptto controlthethinkingof theirchildren.” Backto basics, let’s delve deeper into the issue ofmultiplicityofGods in Hinduism. What is Brahman? In Hinduism,theimpersonal Absoluteiscalled“Brahman”. Accordingto thispantheisticbelief, everything inexistence, livingor non-living comes fromit. Therefore, Hindusregardall thingsassacred. We cannot equate Brahmanwith God, because God ismale and is describable, and thistakesaway fromtheconceptoftheAbsolute. Brahmanisformless or “nirakara”, and beyondanything thatwe can conceiveof. However, itcan manifestitselfinmyriad forms, includingGods andGoddesses, the “sakara” formoftheBrahman. Accordingto Prof. JeaneaneFowler of theUniversityofWales College, Newport: “The relationshipbetween the manymanifestdeitiesandthe unmanifestBrahmanisrather like thatbetweenthesunanditsrays. We cannot experience thesunitself butwe canexperienceitsraysand the qualities, whichthoserays have. And, althoughthesun’s rays aremany, ultimately, there is only onesource, onesun. So theGods and GoddessesofHinduismamount tothousands, all representingthe many aspects ofBrahman” ( Hinduism: Beliefs, Practices, and Scriptures ) ",
            "date": "Answered January 20, 2018",
            "views": "591",
            "upvotes": "0"
        }
    ]
}