{
    "title": "Why did we create junk food? - Quora",
    "tags": [
        "History of Food",
        "Junk Food",
        "Eating",
        "Nutrition",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fiona Winters",
                "href": "/profile/Fiona-Winters-5"
            },
            "answer_text": "Well it’s very complicated. Junk food was born, not surprisingly, in various corners of America. The history of junk food can help you know more about the reason. How Junk Food Works The history of junk food and fast food is wrapped up in the industrialization of America. Before the early 1800s, food was almost exclusively prepared in the home and made with minimally processed ingredients grown locally and harvested seasonally. That's not to say that people ate healthy and varied diets, but the very idea of junk food didn't exist. Andrew F. Smith, a food historian and author of \"Fast Food and Junk Food: An Encyclopedia of What We Love to Eat\", credits the industrialization of flour mills in the 1820s with the launch of the junk food era. Innovations in milling technology and improvements in transportation brought inexpensive white flour to the masses. Even today, cheap white flour is the foundation of low-fiber, high-carbohydrate burger buns, cookies and snack cakes. During the American Civil War (the 1860s), troops grew accustomed to eating from cans and jars of mass-produced rations. They came home craving the same convenience and familiar tastes. The rise of the industrial factory drew people away from farms and into the city. Food vendors parked their carts outside the factory gates, offering the first \"fast food\" to hungry workers. The first great American junk food was Cracker Jack, a salty-sweet blend of popcorn, molasses and peanuts introduced by brothers Frederick and Louis Rueckheim at the Chicago World's Fair in 1893. The recipe wasn't a novelty, but the Rueckheim brothers' true genius was marketing − a prize in every box! − and their trademark wax seal packaging. By 1916, Cracker Jack was the best-selling snack in the world. The history of soft drinks goes all the way back to 17th-century Europe, where carbonated water was first mixed with lemon juice and honey for a bubbly sweet concoction. In America, the first batches of Coca-Cola and Pepsi-Cola syrup were mixed at pharmacy counters in the 1880s and 1890s and sold as a refreshing, healthy elixir to aid digestion. The emergence of fast food was fueled by the rise of automobile culture and the suburbanization of American cities in the 1950s. Originally a convenient novelty, ordering a burger and fries at the \"drive-thru\" soon became an American institution. The second half of the 20th century witnessed explosive growth in the variety, affordability and ubiquity of junk food and fast food. Innovations in manufacturing, packaging, transporting and marketing junk food − particularly to children − turned a rare treat into a steady diet for millions. And all the big companies employ an army of food scientists who know just how to get us coming back for more. ",
            "date": "Answered September 24, 2019",
            "views": "368",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Goyal",
                    "user_href": "/profile/Shubham-Goyal-198"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Freyburger",
                "href": "/profile/Doug-Freyburger"
            },
            "answer_text": "“Why did we create junk food?” Follow the money. There was no plan to make junk food. It’s more profitable. Businesses exist to make profit. Businesses exist to sell products. When a product sells more, they make more. When a product makes more profit, they make more. Junk food has cheap ingredients and it sells well. Once businesses started tracking the details of their profits they moved towards selling products with cheap ingredients that sell well. The result was junk food. Humans are drawn to high calorie food. Especially food that is both high carb AND high fat. it’s a formula to get fat. Being fat is a formula to survive famines so we are evolved to do that. But now there are fewer famines in the world every decade. Where fast food is sold there have been no famines in over a century. Humans are also drawn to high salt food. So junk food is very salty. ",
            "date": "Answered September 24, 2019",
            "views": "182",
            "upvotes": "0"
        }
    ]
}