{
    "title": "Why, and how did France own the Louisiana territory (Louisiana Purchase)? - Quora",
    "tags": [
        "Louisiana Purchase (1803–04)",
        "Louisiana (state)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas de La Marnierre (トマ・サレ)",
                "href": "/profile/Thomas-de-La-Marnierre-トマ-サレ"
            },
            "answer_text": "Louisiana was a colony created by France in 1682. It was part of the ensemble called viceroyalty of New France. Louisiana was defined as a territory bigger than what the US would purchase in 1803.As a colony of New France, Louisiana meant this (the part north of the current Canada-US border is missing) :  Map of the viceroyalty of New France, as claimed by France :  At that point I would like to stress : don’t call it territory, as in an US legal meaning. We are speaking of times before it was in the US.At the time of New France, the status of the Pays des Illinois (named from the indigenous Illinois Confederacy) was not clear. Governor Vaudreuil suggested it should be attributed to Louisiana (and hence be known as Upper Louisiana), but it was not obvious. It is the English that set this for good and chose to consider it part of Louisiana.In the 1763 treaty of Paris, the east part of the Mississippi river was transferred to the British, and the remaining colony of Louisiana was transferred to Spain and became part of the viceroyalty of New Spain.North America after the 1774 Quebect Act. Notice the east side of the Mississippi is associated to various British colonies.  After the US independence, the Floridas would be given back to New Spain. Here is a map of New Spain in 1800 : The 1st French Republic signed the San Idelfonso treaty of 1800 with the Kingdom of Spain. Spain gives back to France Louisiana and the Duchy of Parma. France gives to Spain the Grand Duchy of Toscany. The treaty of Aranjuez of 1801 confirmed this exchange.Map of the Italian states, to locate Parma and Toscany :  And this is how in 1803, the 1st French Republic was able to sell what it had left of Louisiana to the United States. This is the “Louisiana Purchase”, and later it was made a “territory”, from which new States would be created. Notice a part of that Louisiana Purchase was ceded by the US to Great Britain in 1818. People keep forgetting about that. ",
            "date": "Answered February 21, 2018",
            "views": "41",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Barney",
                    "user_href": "/profile/Mike-Barney-18"
                },
                {
                    "user_id": "David Kelly",
                    "user_href": "/profile/David-Kelly-368"
                },
                {
                    "user_id": "Laurent Cayre",
                    "user_href": "/profile/Laurent-Cayre"
                },
                {
                    "user_id": "Kim Andereck",
                    "user_href": "/profile/Kim-Andereck"
                },
                {
                    "user_id": "Darrin Vicsik",
                    "user_href": "/profile/Darrin-Vicsik"
                },
                {
                    "user_id": "Tony Pedretti",
                    "user_href": "/profile/Tony-Pedretti"
                },
                {
                    "user_id": "Fred Shirley",
                    "user_href": "/profile/Fred-Shirley-1"
                },
                {
                    "user_id": "Jaroslav Liska",
                    "user_href": "/profile/Jaroslav-Liska"
                },
                {
                    "user_id": "Larence Lowd",
                    "user_href": "/profile/Larence-Lowd"
                },
                {
                    "user_id": "Eric Wang",
                    "user_href": "/profile/Eric-Wang-434"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daivik Thanki",
                "href": "/profile/Daivik-Thanki"
            },
            "answer_text": "The French, upon navigating the entire river, entered into the Gulf Of Mexico, and they had come all the way from Canada, in Québec, but they realised what an enormous river the Mississippi was when they reached its end after a long journey. So, they claimed the river and the land along it for France, but not just this: They claimed all the land between the river and all of its tributaries. Thats right, this enormous river had to have a great many tributaries, spread over an extremely large area. So there it remained, with mostly the South being inhabited by Europeans, until its purchase in 1803 for a whopping $15 million. ",
            "date": "Answered May 10, 2018",
            "views": "408",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Barney",
                    "user_href": "/profile/Mike-Barney-18"
                }
            ]
        }
    ]
}