{
    "title": "Will English in 100 years be the same as it is now? - Quora",
    "tags": [
        "English as a Second Language (ESL)",
        "Learning English"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Weber",
                "href": "/profile/Mark-Weber-72"
            },
            "answer_text": "Probably not. English is getting influenced in all corners of the world. We have imported thousands of words from China, India, the Middle East, American Indians, and every country colonized by the British Empire. Artists will play with it as Shakespeare did. Kids will play with it. Artificial intelligence will play with it. Funny things can change languages. A Spanish king lisped so everyone at the palace lisped to make him feel like it was normal. Then everyone else started lisping to make it seem like they were people of the court. That became Castillian Spanish. The English upper classes started speaking differently to differentiate themselves from the less privileged. The same kind of thing could happen to English down the road. My bet is that some smart kid in Asia somewhere will invent a way to reform the spelling so it’s easier to learn. ",
            "date": "Answered March 31, 2018",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajeeth Peo Francis",
                "href": "/profile/Ajeeth-Peo-Francis"
            },
            "answer_text": "Absolutely not! English a century back was very different from the English we know and use. The thing with languages is that it constantly evolves based on “accepted” styles and includes vast vocabulary elements every day (as technology and thinking evolve). We might, in a hundred years, do away with a lot of the rigid syntactical elements of English as we know it now! ",
            "date": "Answered April 10, 2018",
            "views": "107",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ishaan Sethi",
                    "user_href": "/profile/Ishaan-Sethi-9"
                },
                {
                    "user_id": "Srilakshmi",
                    "user_href": "/profile/Srilakshmi-26"
                }
            ]
        }
    ]
}