{
    "title": "Will Donald Trump cause a third world war? - Quora",
    "tags": [
        "Third World War",
        "World War 3",
        "World Wars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Simpson",
                "href": "/profile/Todd-Simpson-1"
            },
            "answer_text": "No, but at the same time the stage could be set by collateral damage from the “get Trump at all costs” crowd. The Russians cannot help but be more than a little paranoid with all the current anti-Russia rhetoric as part of the attempt at a soft coup in this country. It certainly doesnt help that we supported an anti-Russian coup in Ukraine (yes, by any stretch of the imagination “Maiden” was a coup). As if the Democrat side of the isle hasnt done enough damage to spook the Russians, we just had the latest boneheaded attempt on the part of the Neocon faction of the GOP. That would be John Boltons OFFICIAL “visit” to Belarus. OUR actions are what will start a war with Russia in the way someone uses words and actions to get another party to swing the first punch. Historically, taking the Soviet Union and its Communist Ideology out of the picture, Russia has never been a serious threat to Western Europe. France, Prussia (at least partially part of present day Poland), Austro-Hungary and Germany have been MUCH more of a historic threat to European peace than Imperial Russia. The last thing Russia needs is more land or resources. They cannot even fully exploit what they already have. On the other hand, Western Europe, the US and China can exploit it but they want it under THEIR control (as cheap as possible) and not Russias control. They had that during the time of Yeltsin. Putin on the other hand put a stop to the wholesale sellout of Russia and as a result had to be “punished” (I make no judgement on whether Putin is good or bad just the economic climate of Putin versus Yeltsin). On the other hand, Russia has been invaded by Napoleon, Austro-Hungary, and Hitler to name a few. One of the big things that saved them was a buffer zone of friendly states or territory as there are no natural defensive positions until the Urals. Depth and time is the only “natural defense” of Eastern Russia. As this “depth is being whittled away we are making them VERY nervous, and in my mind rightly so given the previously mentioned history of behavior by Western Europe. I also find a serious flaw in the “logic” of the anti-Trump people. World War 3 would have to involve Russia and or China. On one hand they claim Trump and Putin are one in the same. In the next breath he is going to make WW3 with Russia. The remarkable thing is that in a lot of ways Trump has been trying to get us untangled from a lot of these foreign entanglements. ",
            "date": "Answered September 29, 2019",
            "views": "636",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles A. Binford",
                    "user_href": "/profile/Charles-A-Binford-1"
                },
                {
                    "user_id": "Josef Henrie",
                    "user_href": "/profile/Josef-Henrie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Min Ern Chuah",
                "href": "/profile/Min-Ern-Chuah"
            },
            "answer_text": "I laughed out loud when I read this question. Don't get me wrong, this is not a bad question. If you knew my opinion of Trump, you might find it funny too. Trump is a joke, and the world knows it. He's treating the presidential election like it's literally a game of popularity. He only says what they want to hear. The democratic process in the US is pretty much a game of popularity, but it was always a battle of government policy. It was about the people considering the political reforms and policies of the next government, about how they would do things differently. It was about weighing in the intelligence and character of the next president. The prior presidental debates were professional. Trump has made it personal.  His proposals are laughable. His ideas are painfully simplistic. The real scary thing though, is that Trump is the physical representation of the sociological backwardness of the US. His polls say so. The only way he has made it so far is because they support him, they actually believe in him. This doesn't mean Donald Trump is incompetent, his family is admirable. But to put this into perspective, the UK is currently debating on a petition of 573,000 signatures to ban Trump from entering the UK. I read that a couple days ago. If Trump becomes president, he could start WW3. But that will only be because of a reaction from another country. This goes to show, we really shouldn't let a man like Donald Trump become President of the United States of America. ",
            "date": "Answered January 20, 2016",
            "views": "169",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Iguchi",
                    "user_href": "/profile/John-Iguchi"
                },
                {
                    "user_id": "John McEvoy",
                    "user_href": "/profile/John-McEvoy-34"
                },
                {
                    "user_id": "Steve Anderton",
                    "user_href": "/profile/Steve-Anderton-2"
                },
                {
                    "user_id": "Craig Briggs",
                    "user_href": "/profile/Craig-Briggs-1"
                },
                {
                    "user_id": "Mary Vascos",
                    "user_href": "/profile/Mary-Vascos"
                },
                {
                    "user_id": "Ryu Uy",
                    "user_href": "/profile/Ryu-Uy"
                },
                {
                    "user_id": "Thiago Francisco",
                    "user_href": "/profile/Thiago-Francisco-2"
                },
                {
                    "user_id": "Bark Productions",
                    "user_href": "/profile/Bark-Productions"
                },
                {
                    "user_id": "Benoit Descamps",
                    "user_href": "/profile/Benoit-Descamps"
                },
                {
                    "user_id": "Crystal Ann",
                    "user_href": "/profile/Crystal-Ann-22"
                }
            ]
        }
    ]
}