{
    "title": "Will Amazon survive? - Quora",
    "tags": [
        "Net Neutrality",
        "Survivalism",
        "Survival",
        "Amazon.com (product)",
        "Amazon (company)",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Briggs",
                "href": "/profile/Tim-Briggs-6"
            },
            "answer_text": "The biggest worry for Amazon investors — beyond the question of whether Bezos is lining up a successor who can better manage the company — is the slowdown in its AWS business which accounts for 13% of revenues and 57% of operating income, according to Amazon’s second quarter earnings release. Unless Amazon has a similarly fast-growing and profitable business coming along, rivals and more demanding customer expectations could imperil the profits needed to sustain the 20% or higher growth that makes Amazon’s shares attractive to investors. As customers realize that it’s risky to put all their eggs in the AWS basket, they’re spreading their computing around. The beneficiaries of this diversification are Microsoft and Google, the so-called Hybrid Cloud in which companies keep some of their IT resources in-house, and focused upstarts that offer a better deal on one or two of the over 100 services that AWS provides. AWS is like the referenced Hotel California of The Eagles fame — you can check in any time you like but it’s expensive to leave. As David Friend, CEO of cloud storage service provider, Wasabi, explained in a July 26 interview, “Customers are wary of having all their eggs in one basket. Amazon’s pricing and policies promote ‘vendor lock-in’ and customers are just figuring out how little leverage they have with Amazon. An example is the fees that Amazon charges for taking data out of Amazon storage. It’s free to put data in, but they charge hefty fees to take data out.” Friend is not worried about AWS’s future. “It’s unrealistic to think that anything is ‘broken’ at Amazon and that their strategy or execution is flawed in any serious way,” he said. With Amazon’s businesses so diffused, it remains to be seen whether it will be able to keep fending off the competitive incursions to AWS from Microsoft, Google, and more focused upstarts. But I don't see Amazon having any serious problems anytime soon. ",
            "date": "Answered September 26, 2019",
            "views": "753",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Thomas-Salan"
                },
                {
                    "user_id": "Jacob Handley",
                    "user_href": "/profile/Jacob-Handley-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Bednar",
                "href": "/profile/Jan-Bednar-5"
            },
            "answer_text": "It’s impossible to know for sure about the longevity of a company. With that being said, Amazon has been doing remarkably well. In 2017, Amazon experienced a 30.8% increase from revenue compared to 2016, and these numbers keep going up. In 2018, it was announced that Amazon’s share of the eCommerce market was 49%, or 5% of all retail spend. Those are remarkable numbers, and it’s not just about numbers, either: Amazon’s name is on the tip of everyone’s tongue. They’ve risen not only as an eCommerce giant, but also as a symbol for the new age of buying and selling, and, to some extent, the new age of the Internet. A lot can be said about Amazon, and possibly more can be said about what it represents. There seems to be some vested interest from the public about Amazon’s future — will it fail miserable? Will it overtake everyone and everything else? The answer is very simple: everything is finite. That’s a fact, and not an opinion. Companies have climbed to the top of the ladder and tumbled down. Companies have climbed to the middle of the ladder and slowly stepped down over the years. I think Amazon will be around for a good while, because I haven’t seen any evidence otherwise. Nothing happens overnight, and the truth is that Amazon has experienced continuous success that has yet to be seriously abated. Sources Amazon Revenue 2006-2018 | AMZNAmazon’s share of the US e-commerce market is now 49%, or 5% of all retail spendThanks Samantha for the A2A! ",
            "date": "Answered January 22, 2019",
            "views": "171",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-13"
                }
            ]
        }
    ]
}