{
    "title": "Will the US still produce $1 coins in the future? - Quora",
    "tags": [
        "Coins",
        "Currencies",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Kervin",
                "href": "/profile/Steve-Kervin"
            },
            "answer_text": "The Treasury has tried to several times to introduce dollar coins throughout US history. As the Wikipedia entry on the subject states, “Because of the size and weight of the dollar coins, they circulated minimally throughout their history, except in the West (especially at casinos in the early-to-mid-20th century, where they were commonly used both at the tables and at slot machines.)” Dollar coin (United States) - Wikipedia After the switch to nickle-clad coins in 1965, we’ve had the Eisenhower dollar, the Susan B. Anthony dollar, and most recently Sacagawea and Presidential Dollar coin. I haven’t received any of these in change in the USA. Ever. Americans are extremely conservative when it comes to their cash, and resist change. Yes it makes economic sense to replace the dollar bill with the dollar coin. They last longer and can be easily used in vending machines. But people hate them. A common complaint is that there are close to the same size as quarters, which is why the Treasury made them with a brass surface so that they look different. But still, people refuse to use them. I don’t see the Treasury giving up. The Federal Government is incapable of that. So the only way we will use the dollar coins is if the Treasury withdraws dollar bills from circulation, thereby forcing us to use the coins. ",
            "date": "Answered April 5, 2017",
            "views": "490",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hunter Montgomery",
                "href": "/profile/Hunter-Montgomery-3"
            },
            "answer_text": "Quite likely. There are plenty of people to honor and to my knowledge, gold dollars are still currently being minted with the presidential faces on them to honor them in order of service at a rate of 4 per year. The thing is, with dollar coins, they aren’t hardly popular and are too similar to a quarter to be put into a coin eating machine like a vending machine or a coin bank so they are left out of circulation. When they are handed out by the mint, they are directly ordered from it and given pretty much only to collectors like myself. ",
            "date": "Answered April 5, 2017",
            "views": "163",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-10646"
                },
                {
                    "user_id": "Austin Hawkins",
                    "user_href": "/profile/Austin-Hawkins-11"
                }
            ]
        }
    ]
}