{
    "title": "Will this decade mostly have 2000's nostalgia since the last decade was mostly 90's and the decade before that was 80's nostalgia? - Quora",
    "tags": [
        "Decade",
        "2000s",
        "Nostalgia",
        "1980s",
        "1990s",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Avery",
                "href": "/profile/Richard-Avery-26"
            },
            "answer_text": "Actually this past decade was more 80’s than anything with some 90’s sprinkled in. Because of how marketers work it will depend on if they remain in their positions. This is because the demographics of current chiefs of marketing fit the generation who were teens or young adults in the 80’s and they want to appeal to younger Gen X and older Millennials who were young kids in 80’s as well as those of their own age group. But I can see more 90’s nostalgia on the near horizon. Early 2000’s stuff I predict not til after about the mid point of decade where it would run side by side with 90’s nostalgia. ",
            "date": "Answered April 13, 2020",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Truax",
                "href": "/profile/Roy-Truax"
            },
            "answer_text": "Seems about right… it’s usually a 20–30 year cycle. Consider though the cycle encompasses the prior nostalgia cycle as well. “DEATH BY NOSTALGIA: It isn’t necessary to imagine the world ending in fire or ice — there are two other possibilities: one is paperwork, and the other is nostalgia. When you compute the length of time between ‘The Event’ and ‘Nostalgia For The Event,’ the span seems to be about ‘a year less in each cycle.’ Eventually, within the next quarter of a century the nostalgia cycles will be so close together that people will not be able to take a step without being nostalgic for the one they just took. At that point, everything stops. Death by Nostalgia.” - Frank Zappa 🤕 ",
            "date": "Answered April 17, 2020",
            "views": "62",
            "upvotes": "0"
        }
    ]
}