{
    "title": "With knowledge of modern Greek what historical literature could I read? - Quora",
    "tags": [
        "Byzantine Art",
        "Koine Greek (language)",
        "Greek Literature",
        "Ancient Greek (language)",
        "Greek (language)",
        "Ancient Greece",
        "Greece"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Sallas",
                "href": "/profile/Nick-Sallas"
            },
            "answer_text": "I'll have to side with Nick Nicholas here. I feel that knowledge of Modern Greek is much less of a help in reading older texts if the knowledge isn't native. If your first tongue is Greek and you grew up listening to church hymns in Koine and reading Katharevousa newsprints then you will have a fairly good understanding of how case endings work and what kinds of fluid word order you may encounter. Similarly, your vocabulary will be much greater as it is your mother tongue. On the other hand, I'm guessing based on the wording of the question that you are thinking of learning Modern Greek coming from an English background and are wondering how much help it will be when looking at a given text from x-period in time. That is rather a different scenario. You will be confused. You will have very little experience with matching words to their subjects by case ending, you will have never seen a participle (that's a big problem), no knowledge of moods (another massive obstacle), conditional clauses, infinitives... Plus of course the difference in vocabulary, though that is the smallest issue in my opinion. All of these problems are exacerbated the further back in time you go. You may be able to puzzle out a bit of straightforward Koine once you understand the basics of these concepts, but anything beyond that you will likely be unable to understand or will misinterpret (with either tragic or hilarious results depending on your point of view). That being said, you will have a head start if you choose to study those more ancient forms, and they will come more quickly, because of your familiarity with the basics. In addition you will have little problem with colloquial Greek from the 1.100's or so onwards (insofar as it is available to read).  tl;dr Modern Greek only really makes reading ancient texts easy when it's your native tongue, as there is much more exposure to ancient forms in that environment. ",
            "date": "Answered April 13, 2016",
            "views": "399",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Achilleas Vortselas",
                    "user_href": "/profile/Achilleas-Vortselas"
                },
                {
                    "user_id": "Dimitra Triantafyllidou",
                    "user_href": "/profile/Dimitra-Triantafyllidou"
                },
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitra Triantafyllidou",
                "href": "/profile/Dimitra-Triantafyllidou"
            },
            "answer_text": "I'll side with the majority here. Koine is really straightforward. The Gospels are easy to read. Even Paul that Nick Nicholas thinks is difficult to understand, isn't hard, just verbose, and repetitive. I guess that's where a lot of Greek bishops get their style from. ;). But the four Gospels aren't hard to understand in any language really, since they are actually a narration of events. No weird terminology, no in-depth philosophical discussions (that came later), just a telling of events.  Just to get an idea of how similar the language is this a line of Paul's epistle to Thessalonians and underneath it a modern Greek transcription (I can't call it a tranlation because you'll see there isn't much difference) καὶ ἐπέμψαμεν τιμόθεον, τὸν ἀδελφὸν ἡμῶν καὶ συνεργὸν τοῦ θεοῦ ἐν τῷ εὐαγγελίῳ τοῦ χριστοῦ, εἰς τὸ στηρίξαι ὑμᾶς καὶ παρακαλέσαι ὑπὲρ τῆς πίστεως ὑμῶν και πέμψαμε τον Τιμόθεο, τον αδερφό μας και συνεργάτη του Θεού στο Ευαγγέλιο του Χριστού, για να σας στηρίξει και να παρακαλέσει για την πίστη σας.  If we're talking literature though you have to take two things into account: language and subject. Byzantine upper-class literature -for example Anna Komnene- is really pretty difficult mostly Attic Greek. It gives me a headache. The Orthodox church philosophical texts should not be attempted unless you have fasted for 40 days and have a very learned monk at your side to guide you through the often esoteric and mysticistic paths. It's not the language. It's the content. On the other hand the church's hymns and such, the liturgy of the Orthodox Church, are Koine and accessible to most Greeks with an ounce of education.  As for older texts, classical Greek, it depends on subject and content. Xenophon is an easy read, again because he relates events. Aesop's fables also. These are usually the first texts, after the Gospels, that Greek students are given when they start learning Ancient Greek at school. If you ask about Thucydides, his texts are difficult because of the Attic dialect and because he loves a long sentence. I managed to decipher his texts after learning German. Got a lot of experience in nosing out the verb in the sentence. If you ask about theater, philosophy and poetry well it gets progressively more difficult. A lot of different dialects in the tragedies, poetry is more difficult than prose, terminology and philosophy is tough even in your mother-language. Homer was ancient Greek to the Ancient Greeks, and it's poetry, so doubly difficult. I catch words (often the meaning has changed) and occasionally sentences. I'm very proud of myself when I manage this.  As for useless, it's never useless. Even if I get only 20-30% of Homer it's still 20-30% more than everybody else. It's quite an advantage.  ",
            "date": "Answered April 13, 2016",
            "views": "697",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raphaël du Sablon",
                    "user_href": "/profile/Raphaël-du-Sablon"
                },
                {
                    "user_id": "Evangelos Lolos",
                    "user_href": "/profile/Evangelos-Lolos"
                },
                {
                    "user_id": "Niko Vasileas",
                    "user_href": "/profile/Niko-Vasileas"
                },
                {
                    "user_id": "Robert Todd",
                    "user_href": "/profile/Robert-Todd-10"
                },
                {
                    "user_id": "Vanessa Foudouli",
                    "user_href": "/profile/Vanessa-Foudouli"
                },
                {
                    "user_id": "Ericsson Isidoro",
                    "user_href": "/profile/Ericsson-Isidoro"
                },
                {
                    "user_id": "Nikhil Bellarykar",
                    "user_href": "/profile/Nikhil-Bellarykar"
                },
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                }
            ]
        }
    ]
}