{
    "title": "Would it be correct to say that Genghis Khan was the most powerful person who ever lived? - Quora",
    "tags": [
        "Genghis Khan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Karimura",
                "href": "/profile/Dave-Karimura"
            },
            "answer_text": "YES! Not just because his empire was the biggest. But because of the following reasons: There were many Great Rulers and conquerors who built great empires. But Genghis is the ONLY one who had ABSOLUTE rule. Even Alexander didn’t have absolute rule.His generals. Genghis had generals that sometimes gets compared to great commanders like Alexander the great, Hannibal Barca or sometimes Napoleon. His most notable general is Subedei the Valiant. But anyone who is familiar with Mongolian history knows that Subedei is only ONE of the “Four dogs of war”. And Subedei had the lowest rank among the dogs of war. And also there are the “Nine Marshals of Genghis Khan”. Almost half of them are scholars or lawyers but the rest were all great generals that were equal to the Dogs of war. And there’s also the Commander of the Khishigtens General Naayaa. Who was able to defeat a tribe(Just checked they were my ancestors LOL) that was able to kill one of the dogs of war Borkhul in a previous battle without taking any casualties.His wives and concubines. Yep! Genghis was a real winner. At least to us men anyway. Some says he was able to sleep with over a thousand beauties.EDIT: Borkhul was one of the four Knights or riders of Genghis. They had equal skills to the four dogs. ",
            "date": "Updated March 8, 2018",
            "views": "11",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zijie (James) Yu",
                    "user_href": "/profile/Zijie-James-Yu"
                },
                {
                    "user_id": "Aaryavarta Dhungel",
                    "user_href": "/profile/Aaryavarta-Dhungel"
                },
                {
                    "user_id": "Nathan Pangilinan",
                    "user_href": "/profile/Nathan-Pangilinan-1"
                },
                {
                    "user_id": "Alex Nobes",
                    "user_href": "/profile/Alex-Nobes-2"
                },
                {
                    "user_id": "Leah Brown",
                    "user_href": "/profile/Leah-Brown-42"
                },
                {
                    "user_id": "Utkarsh Dwivedi",
                    "user_href": "/profile/Utkarsh-Dwivedi-14"
                },
                {
                    "user_id": "Eddie Kang",
                    "user_href": "/profile/Eddie-Kang-4"
                },
                {
                    "user_id": "Mandalia Hardy",
                    "user_href": "/profile/Mandalia-Hardy"
                },
                {
                    "user_id": "Jaydeep Desai",
                    "user_href": "/profile/Jaydeep-Desai-10"
                },
                {
                    "user_id": "Graham Chidwick",
                    "user_href": "/profile/Graham-Chidwick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristian Lømo",
                "href": "/profile/Kristian-Lømo"
            },
            "answer_text": "He definitely was the most powerful person who lived in his era due to the numbers of the army he commanded, their ruthlessness, tactic and extraordinary speed, but I wouldn’t say he was the most powerful person who ever lived. What about Augustus, the first Roman emperor who ruled the most important empire from Ancient times and had an army better organized and larger that Genghis? Not to mention the lands, towns, cities and wealth that he had control of compared to a Mongol Khan. Also, Napoleon, Caesar, Stalin, Hitler, Mao, Alexander the Great were powerful leaders of their time. ",
            "date": "Answered December 29, 2016",
            "views": "226",
            "upvotes": "0"
        }
    ]
}