{
    "title": "Would King Edward VIII be allowed to marry Wallis Simpson in 2020? - Quora",
    "tags": [
        "Wallis Simpson",
        "King Edward VIII",
        "History of Great Britain",
        "British Monarchy",
        "2020 (year)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deryn Singleton",
                "href": "/profile/Deryn-Singleton"
            },
            "answer_text": "The divorce wouldn’t be a problem now since both Charles and Camilla are divorced. He had some worrying character flaws though and I think his actions as a King might have tipped the scales on the Monarchy surviving if he’d pushed the boundaries too far. He admired Hitler’s vision for Germany, maybe even the whole of Europe. Not the genocide but the very controlled form of socialism. He was a very odd mix of entitlement in his own life and empathy for the working classes. Unlike other Royals he was reaching out to the poorer classes on a personal level. He instigated schemes for training the many unemployed men, he’d enlisted 200,000 in the early 1930’s which made him very popular. He also had a close circle of friends that weren’t from the same social class as the friends the Royals normally mixed with. Quite apart from Wallis and Hitler I think the government probably feared that he wouldn’t be satisfied with being a powerless head of state but would start demanding a return to the old days when the Monarchy wielded real power. The only person who supported him was Winston Churchill. ",
            "date": "Answered February 8, 2020",
            "views": "879",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Burton",
                    "user_href": "/profile/John-Burton-167"
                },
                {
                    "user_id": "Teri Kamaunu",
                    "user_href": "/profile/Teri-Kamaunu-1"
                },
                {
                    "user_id": "Bev O’Neill",
                    "user_href": "/profile/Bev-O-Neill"
                },
                {
                    "user_id": "Christina Hutchings",
                    "user_href": "/profile/Christina-Hutchings-2"
                },
                {
                    "user_id": "Harriet Eenmaa",
                    "user_href": "/profile/Harriet-Eenmaa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martine Dekker",
                "href": "/profile/Martine-Dekker"
            },
            "answer_text": "The man who was briefly Edward VIII in 1936 shook the monarchy to its core. In 2020 he would have destroyed it entirely. Edward's problem was not just the divorced American he wanted to marry. It wasn't even just his Nazi sympathies. His problem was that he was a completely self-centred and selfish idler who had no concept of duty, honour and service at all. Without Bertie the monarchy would have come crashing down. Those of us who like monarchy can be thankful that in this generation of monarch, as well as the next but one, it has been the eldest in each family cast in Bertie's mould. Far better Elizabeth than Margaret. Far better William than Harry. ",
            "date": "Answered February 7, 2020",
            "views": "232",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Burton",
                    "user_href": "/profile/John-Burton-167"
                },
                {
                    "user_id": "Demetra Olliver",
                    "user_href": "/profile/Demetra-Olliver"
                },
                {
                    "user_id": "Vincent Harriman",
                    "user_href": "/profile/Vincent-Harriman"
                }
            ]
        }
    ]
}