{
    "title": "Would World War 3 be as beneficial in the long-term as World War 2 was? - Quora",
    "tags": [
        "World War 3",
        "World Wars",
        "World War II",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Blomstrom",
                "href": "/profile/David-Blomstrom-1"
            },
            "answer_text": "First, define WWIII. Some people think WWIII is already underway, and it’s only helping the rich and the powerful. If you’re talking about an all-out war between the U.S. and Russia (fat chance) or China (much more likely), then it would probably be far more destructive than WWII. Just think of all the technological advances we’ve made over the past seventy years and all the weapons that are stockpiled around the world. Of course, it’s possible that such a war could be aborted rather quickly. Maybe China would chicken out after losing a couple ships, or the U.S. might sue for peace if China blows up a few hundred bridges and dams and knocks out some computers. Ironically, I personally think WWIII is just about our only hope. The World is going to H*ll, and I don’t know what else is going to break the power of “Global Elitists.” I just hope we can survive to pick up the pieces. On a side note, how was WWII “beneficial”? Over 50 million people died. It was a lucky break for the U.S., because Europe and Japan were bombed into ruins, destroying economic competitors in the process. But it sure wasn’t good for most countries. And how is the U.S. different from Nazi Germany? ",
            "date": "Answered March 6, 2017",
            "views": "442",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prasanta Bandyopadhyay",
                    "user_href": "/profile/Prasanta-Bandyopadhyay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "In case you haven’t noticedWW3 is currently being foughtIt is called the ‘Cyberwar’ and involves countries infiltrating other countriesand interfering with their political systems It is an ongoing warand much money and research is spent on itIt is unlikely to end for quite a while Yes, it will be beneficial in the long-termJust about every technical development we enjoy todayincluding the internetcame out of research of WW2Most of the really big ideas currently being developedwith get their first tests in the military in some way Around 70% of all research being done in the Westis in some way connected to, or funded by the Military The only thing missing isGlenn MillerAnd pin-up girls  Pin up girls - Google Search  ",
            "date": "Answered April 9, 2017",
            "views": "443",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        }
    ]
}