{
    "title": "Would the Nazis have killed as many people as the Soviet Union if they had lasted as long as them? - Quora",
    "tags": [
        "Nazism",
        "Soviet Union",
        "Nazi Germany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Jouravlev",
                "href": "/profile/Alex-Jouravlev"
            },
            "answer_text": "The Nazis did kill more people than the Soviets. Cripto-Nazis cook some numbers to present it the other way.Nazis planned to kill about 150 million once they win - that included 3/4 of Lithuanians, Latvians, Estonians and Western Ukrainians that fought on their side. Plus 3/4 of Russians, Ukrainian, Poles etc. Read Generalplan Ost - WikipediaThat just if they won, resumably by 1945–1946. If they existed for 72 years, meaning till 2005, they wouild likely also nuke a lot of cities. Generally, Nazi policies included extermination of urban population of enslaved nations. One can only guess how many cities with how many people would perish.",
            "date": "Answered June 15, 2020",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Doe",
                "href": "/profile/John-Doe-18224"
            },
            "answer_text": "They would have likely killed far, far more people both directly as part of Generalplan Ost (which on its own would be responsible for several times the number of deaths by the Soviet Union throughout its entire history, including ones that are not directly intended), the Holocaust, and inevitable collapse of Nazi Germany and political strife in Europe. ",
            "date": "Answered June 13, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Milan Vukotic",
                    "user_href": "/profile/Milan-Vukotic"
                }
            ]
        }
    ]
}