{
    "title": "Would World War 1 have happened without the assassination? - Quora",
    "tags": [
        "Assassinations",
        "World War I",
        "Alternate Histories (Hypothetical Historical Scenarios)",
        "World History",
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Danelek",
                "href": "/profile/Jeff-Danelek"
            },
            "answer_text": "That’s an interesting question. Since the assassination of Archduke Franz Ferdinand was the catalyst that kicked off the conflict, the most obvious answer is that no, there would not have been a World War One if the assassination had not taken place. (BTW: I place much of the blame on the Archduke himself for being stupid enough to ride on the streets of Sarajevo without a proper security entourage in an open air car after anarchists had thrown bombs at his motorcade a few hours earlier, which failed to kill him. A smart person would have decided it was too risky to hang around after that and would’ve made tracks out of Sarajevo post haste.) However, considering what a tinderbox Europe was at the time, it seems very possible that some other incident would have eventually sparked a war months or even years later. In other words, the major powers in the region were spoiling for a fight to establish military, political and economic dominance in Europe, so they were almost looking for a reason to go to war to settle the matter once and for all. Of course, they had a much shorter conflict in mind, but that they wanted to fight seems evident when one looks at how quickly things got out of hand in July of 1914. Only countries already determined to “have it out” would have mobilized so quickly or have been so intransigent in their demands (not to mention being so enthusiastic about marching off to war). They got the war they wanted. It just wasn’t the war they anticipated. ",
            "date": "Answered September 3, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gerhard Lauck",
                    "user_href": "/profile/Gerhard-Lauck"
                },
                {
                    "user_id": "Karen Ware",
                    "user_href": "/profile/Karen-Ware-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "Would World War 1 have happened without the assassination? Very, very likely. Some event would have triggered mobilization. The planning for the mobilizations in Europe, especially with France and Germans were astonishing. The level of detail, the fully, sophisticated coordination of transportation, industry, call ups of soldiers, logistics of munitions and other items, were incredible, and they required that those countries actually go to war. Imagine a crazy water between two sides with powerful hoses fed by incredible pumps. Imagine that your war machine is a pump, and you have the pump kick started and it’s flowing at full volume. The only way to shut that flow off is to shut that pump off, but it’ll blow the valves and it’d take forever to fix. Then you’d be vulnerable. the other side’s hose is going to blow you away. That’s what it’s like to stop a mobilization. once those pumps were started, they couldn’t be stopped with out jeopardy and loss if the enemy didn’t do the same. This is why people feared brinksman ship in the 1980’s as it involved much more than mobilization ",
            "date": "Answered September 4, 2020",
            "views": "383",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Noor",
                    "user_href": "/profile/Mohammad-Noor-92"
                },
                {
                    "user_id": "Jodi Schuetzle",
                    "user_href": "/profile/Jodi-Schuetzle"
                },
                {
                    "user_id": "Altuğ Mert Mısırlıoğlu",
                    "user_href": "/profile/Altuğ-Mert-Mısırlıoğlu-1"
                },
                {
                    "user_id": "Peter Jackelen",
                    "user_href": "/profile/Peter-Jackelen"
                },
                {
                    "user_id": "Michael McKee",
                    "user_href": "/profile/Michael-McKee-57"
                },
                {
                    "user_id": "Jake Denny",
                    "user_href": "/profile/Jake-Denny-6"
                },
                {
                    "user_id": "Nate Kaufman",
                    "user_href": "/profile/Nate-Kaufman-6"
                },
                {
                    "user_id": "Jack Respeliers",
                    "user_href": "/profile/Jack-Respeliers"
                },
                {
                    "user_id": "Antonio Luiz Musa De Noronha",
                    "user_href": "/profile/Antonio-Luiz-Musa-De-Noronha-1"
                }
            ]
        }
    ]
}