{
    "title": "Would nuclear weapons go obsolete with age? - Quora",
    "tags": [
        "Weapons and Warfare",
        "Warfare and Nuclear Weapons",
        "Obsolescence",
        "Nuclear Proliferation",
        "Nuclear Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Duncan",
                "href": "/profile/Frank-Duncan-1"
            },
            "answer_text": "As far as the US is concerned, they are already obsolete. They were needed in 1945 to convince the Japanese that if they didn’t surrender, Japan would become a blue lit radioactive parking lot. A few months ago, a rocket with very little if any explosive was used to take out one man responsible for the deaths of hundreds of Americans. No nukes needed. If some country decided to unfriend the US, no nuclear weapons would be needed to give them an attitude adjustment. A high explosive Tomahawk missile directed to the switching room of a power station would take it off line for months, or years. Another directed to the pumping station of the water plant would knock out the water supply of a whole city. Missiles directed to a few critical bridges would paralyze traffic in and out of the city. No food or fuel could get in. Nuclear power plants need not be attacked, just blow up the transformers outside the plant and there would be no way to get the electricity out of the plant, even though it was perfectly functioning. The city would be as paralyzed as if struck by an atomic bomb, but actually in even worse shape, since the government would have to figure out a way to get food, water, and power to the people living there. If an atomic bomb were used, there would be no need since dead people require no food, water, or electricity. So nuclear weapons are obsolete in the age of precision guided weapons, but are kept as part of our deterrence for other countries with nuclear weapons. MAD, Mutually Assured Destruction, has worked very well since 1945 and prevented any adventures by ill intentioned countries who will think twice about using them, knowing retaliation will be swift and certain. Now, if you mean will nuclear devices get old and obsolete, both yes and no. Nuclear weapons do age in several respects. The tritium in some of the bombs has a half life of 12.32 years meaning that in 12.3 years a nuclear device can lose a lot of its power, and another 12.32 years it will lose half, again. So in just about 25 years, the device will lose 3/4 of the power provided by the tritium. This is remedied by replacing the Tritium periodically with new, fresh material. In addition, the explosive package surrounding the fission/fusion core is being constantly exposed to heat and radiation, causing deterioration. That means that periodically, the package must be replaced to ensure proper functioning if it is needed. In the above discussion, the term obsolete is not exactly correct since the weapons are still fully functional, just in need of maintenance. In the strict sense of the word “obsolete,” several types of nuclear devices have become obsolete. The original U235 bomb used on Hiroshima is obsolete. A few of them were made and detonated, but they were replaced by the far more efficient Pu239 powered bombs. Some “neutron” bombs were developed, but were finally scrapped. The “Davy Crocket” was another short lived development of the atomic bomb. The list of obsolete nuclear weapons can be found in Wikipedia for those interested in the list. So whether nuclear weapons are obsolete rather depends on your interpretation of just what obsolete means. ",
            "date": "Answered July 18, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "William Lebotschy",
                    "user_href": "/profile/William-Lebotschy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Hattery",
                "href": "/profile/Jason-Hattery"
            },
            "answer_text": "In the social sense, they can become obsolete when we live in a society that has no use or desire to threaten the annihilation of whole cities or nations (let alone human life on earth). In a way, we should be in that time now. The global economy currently makes large wars, especially nuclear wars, a massive detriment to prosperity. We are at a time in history with the least wars, violence, disease, and poverty ever (even though it -feels- worse due to 24/7 media coverage of all bad events everywhere). International corporations and markets essentially prevent large wars from happening. There’s too much money at stake. Stake holders, including consumers, creators, investors, and governments needing taxes and stability, all demand that wars are avoided at all costs as a practical matter. The military, namely the American military and especially the navy, help ensure that international trade is secure and stable from major threats. The prosperity of all would be threatened like never before in a large war or nuclear exchange, because we are globally dependent on eachother for our goods and services. With nuclear disarmament of the superpowers lowering their nuclear stockpiles by orders of magnitude over the past few decades, we are on our way toward what may be the total obsolescence of nuclear weapons. Only the echoes of our past and our elders’ legacies and baggage still keep the threat present. In a scientific sense, nuclear weapons, or at least that mechanism and power, may never become obsolete. That’s because, as far as we understand the physics of this universe, there is nothing more powerful than E=MC^2, and breaking or creating atoms (or one day perhaps annihilating them via antimatter) is the closest analog we have for creating and employing that equation. If we survive past our scientific adolescence into a tier 2 society, we should never have need for such weapons per military conflicts. Instead that power would only be a tool for energy production, space travel, exploration, terraforming, and resource acquisition. ",
            "date": "Answered October 29, 2020",
            "views": "53",
            "upvotes": "0"
        }
    ]
}