{
    "title": "Would King George VI have been allowed to fight in WW2 if he wanted to? - Quora",
    "tags": [
        "King George VI of the United Kingdom",
        "Kings (royalty)",
        "World War II"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bernard Doyle",
                "href": "/profile/Bernard-Doyle"
            },
            "answer_text": "George VI would not have been allowed to fight in World War II for all of the following reasons: (1) By virtue of the fact that he was the monarch he was the British Head of State. Admittedly, by 1939 this was only a figurehead role. Most of the duties of in that role consisted of rubber stamp approval of the decisions of the government and Prime Minister. While it is arguable that the British monarchy could be replaced with a republican form of government, doing this in the middle of a major war in which the country is fighting for its existence is not the right time. (2) A major part of the role of the modern British monarchy consists of public relations. In wartime this is especially important. During World War II, George VI and his wife had a very important part to play in keeping up the morale of the British people and service men and women. The monarchy and in particular George VI was someone the British people could look up to.   (3) George VI also had an important diplomatic role to play. In June 1939 George VI and his wife visited the United States. The King established an excellent relationship with FDR. the King and Roosevelt had extensive discussions about the deteriorating situation in Europe and also about US naval activity in the Western Atlantic in the event of a war between Great Britain and Germany. Their conversations laid the foundations for what would eventually become the Bases for Destroyers and Lend-Lease Deals. The King and FDR corresponded throughout the war and there was a genuine friendship between the two men.  (4) The final and most obvious reason why George VI would never have been allowed to fight is because his death, or even worse, his capture, would have been a huge propaganda coup for the axis powers. Also, as another answer states, George VI turned 44 in December 1939. This would have made him too old for an active fighting role in any case. ",
            "date": "Answered September 1, 2019",
            "views": "463",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dineo Poo",
                    "user_href": "/profile/Dineo-Poo"
                },
                {
                    "user_id": "Carmen Julia Henry",
                    "user_href": "/profile/Carmen-Julia-Henry"
                },
                {
                    "user_id": "Leonard Groenewald",
                    "user_href": "/profile/Leonard-Groenewald"
                },
                {
                    "user_id": "David Parry",
                    "user_href": "/profile/David-Parry-114"
                },
                {
                    "user_id": "John Bartram",
                    "user_href": "/profile/John-Bartram"
                },
                {
                    "user_id": "Timothy Soo",
                    "user_href": "/profile/Timothy-Soo-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith McLennan",
                "href": "/profile/Keith-McLennan"
            },
            "answer_text": "George VI (the father of Queen Elizabeth II) did serve in the Royal Navy in the First World War. He was mentioned in dispatches for his work as a turret officer on the battleship HMS Collingwood at the Battle of Jutland in 1916. But he suffered from a duodenal ulcer, which was operated on the following year, and he saw no further combat. He went on to qualify as an RAF pilot in 1919. By the outbreak of war in 1939 he was about to turn 44, so he was beyond the usual fighting age. But he would not have been allowed to fight anyway, because by then he had become King. His role in wartime was to serve as a symbol of the nation, and this he did with great effect. He not only remained in London with the Royal Family during the Blitz, but developed a close relationship with Churchill and made extensive visits to British troops in war zones, including France in December 1939, North Africa and Malta in June 1943, Normandy in June 1944, southern Italy in July 1944, and the Low Countries in October 1944. These were not combat missions but were hazardous nonetheless. His younger brother, Prince George, the Duke of Kent, was killed when his RAF aircraft crashed en route from Scotland to Iceland in 1942. ",
            "date": "Answered September 1, 2019",
            "views": "186",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Meller",
                    "user_href": "/profile/Alexander-Meller-1"
                },
                {
                    "user_id": "Barrie Rodliffe",
                    "user_href": "/profile/Barrie-Rodliffe"
                },
                {
                    "user_id": "Diane Moss",
                    "user_href": "/profile/Diane-Moss-7"
                }
            ]
        }
    ]
}