{
    "title": "Would Speaker Nancy Pelosi consider running as Vice-President Biden's running mate for the presidency? - Quora",
    "tags": [
        "U.S. Vice Presidents",
        "Vice Presidents",
        "Nancy Pelosi (politician)",
        "Joe Biden (politician)",
        "Democratic Party (US politics)",
        "US Presidential Elections",
        "Politicians and Government Leaders",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Edwards",
                "href": "/profile/Don-Edwards-34"
            },
            "answer_text": "Why do all of you people coming up with the dumbest questions possible. It is apparent that none of you asking these questions have never taken the time to care about what has been happening to this country in the last three plus years since the 2016 election. Either what you were doing in your life was more important to care until it came to your back Dior, then it got your attention. The things which would bring you into reality would be such things as, self isolating yourself until the government forced you into isolation. Not being able to go to malls BARS AND NIGHTCLUBS, getting massages, haircuts, the beach, parks, skiing in the mountains, hanging out with family and friends, not being able to go to work, shop for food without being rustled through checkout stands with a six foot radius between you and the person in front or behind you. Having to wear face covers like mask if you can even get them, and gloves, freaking out at hospitals if you get sick. Not being able to go to church, hunting, sports events, concerts and all your comedy and talk shows are all without audience. Having less traffic, a good time to travel, but can’t. Going on vacation, but you can’t. Visiting loved ones in their room at the hospital of if they are ordered into isolation alone with no family to help them. Being able to go to rallies, that must be killing both Trump and his voters. Too scary to go vote without putting yourself at risk because the biggest liar who ever drew breath tells you that based on what comes out of his brain, for he is the smartest and best, and most beloved president, before anyone who ever held that office including George Washington and Abraham Lincoln. He even believes he is more beloved then Jesus Christ. We just had a primary on the Democratic side, with 17 contestants running to be nominated consisting of both men and women, the top three all over 70 years of age, one not only gay, but the youngest if the pack and the presidential in every aspect, black men and a black woman, as well as an Asian and a Puerto Rican, and we picked the top oldest ones as our choice, two of them totally socialist that would destroy rather economy if eith of them were elected, so we settle with the best of the three because he has worked in the Oval Office for over eight years and knows how it operates. He is not about to give free stuff to everyone but finding the things like insuring the uninsurable so they do not end up losing everything on a hospital stay, due in part tp Covid, which the president and his party making it seem like nothing more than flu symptoms where the same usual suspects are the victims so what is the big deal. The big deal is, this can and does kill people of all age and there is nothing to stop it. Obama was prepared but setting up an office in the White House staffed with medical people and scientist to work on such things as Abola which struck during his time in the White House and got it under control with less deaths then this of Trump’s Covid-19 pandemics. On the other side of this fiasco of how ill equipped Trump is, he disbanded Obama’s office of scientist and researchers immediately that if it stayed in place, he would have has a jump on this at the start and his actions to actually put country before Trump could have sealed his presidency for another term and leave with a high approval rating. This type of things like world war, pandemics, or other disasters actually will bring out the president in the holder of the office, or show their weakness Tharp the country wants them impeached. Bot Trump is all about Trump and too dumb to realize what a gift this pandemic could be for him, if he only acted presidential than as the start of a reality show from a script he wrote on a subject he knows absolutely nothing about. He likes his name on everything, so let’s give him the granddaddy of them all. Now to answer your ridiculous question should Biden ask Pelosi to be his Vice President, the answer I’d NO. If we keep looking for people older than what we have, why the hell don’t he ask Betty White. She seems to be sharp and smarter then the rest in both sides and if you want them older, let’s go dig up FDR, or maybe Abraham Lincoln. They both were beloved, and just because they are dead why does that matter? We are a country without a leader or a government for that matter. I suggest you lazy late to the party voters who are so confused because they were two busy in the last presidential election to see what Trump was about to care to start using google to ask the dumb questions and not have your name associated as someone so dumb. Maybe it would be best not to vote but leave it up to them paying attention and care for something other than themselves. ",
            "date": "Answered April 23, 2020",
            "views": "56",
            "upvotes": " Answer requested by Milt Hankins"
        },
        {
            "author_info": {
                "name": "Norma Munn",
                "href": "/profile/Norma-Munn"
            },
            "answer_text": "I think not and I certainly hope not. If Biden is president, he will need Pelosi exactly where she is now. I also cannot imagine why she would want the job. It is not as powerful as what she has. Being a heartbeat from the Presidency is not enough to make it an attractive challenge to a lot of people. Ultimately, Pelosi would have to feel that she could be replaced by someone currently in the House who is as capable, tough, ethical and politically astute as she is. A quick look at her immediate colleagues does not turn up a single candidate that I can name with confidence. Finally, i think losing Pelosi would result in a free for all brawl as to who would succeed her at a time when the House is very likely to have to deal with some extremely difficult legislation about voting, the COVID-19 pandemic, a severe downturn in the economy, and a fight over the budget and the debt limit — just to name a few. ",
            "date": "Answered April 18, 2020",
            "views": "92",
            "upvotes": "0"
        }
    ]
}