{
    "title": " Is the tune of the song Janam janam from the movie copied from khushiyaan aur gham sehti hai from the movie mann?  - Quora",
    "tags": [
        "Dilwale (2015 movie)",
        "Arijit Singh (singer)",
        "Plagiarism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Supriyo Mukherjee",
                "href": "/profile/Supriyo-Mukherjee-2"
            },
            "answer_text": "Whenever I have doubts about a song being plagiarised from another song, I try playing them individually first. I then play both the songs together simultaneously to check whether I was hooked to a particular section and since that 5/6 seconds section might sound similar. It is to be noted that a \"tune\" of a song comprises of the music beats, tempo of the song and the \"hook\". The song starts off differently if you play close attention to it. The tempo is completely different. The music beats are more refined and smoother. The hook also feels different. This kind of thing happens a lot in music. You might feel that two songs sound similar but they have different tunes. I know a lot of us like to believe that most Bollywood songs are plagiarised but did you know that I can make the same argument about Harry Potter? The entire HP franchise is also a rip off if you go by the similarity point of view. ",
            "date": "Answered January 2, 2016",
            "views": "34",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shyam Vanga",
                    "user_href": "/profile/Shyam-Vanga-4"
                },
                {
                    "user_id": "Sumeet Mathew",
                    "user_href": "/profile/Sumeet-Mathew"
                },
                {
                    "user_id": "Somashri Mukherjee",
                    "user_href": "/profile/Somashri-Mukherjee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sameer Naik",
                "href": "/profile/Sameer-Naik-31"
            },
            "answer_text": "See this link.  Moomash: Identify music in youtube videos and pay attention to song at 7:30. MooMash says it is Magnus Ringblom - Autumn In Nice but I am not able to get the original version from Google yet. It sounds similar to Initial part of Janam Janam. ",
            "date": "Answered April 17, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melvin Thakkar",
                    "user_href": "/profile/Melvin-Thakkar"
                }
            ]
        }
    ]
}