{
    "title": "(Music) What is the difference between a Minor note and a Flat note? - Quora",
    "tags": [
        "Music Terms and Jargon",
        "Musical Notes",
        "Music Theory",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Mayor",
                "href": "/profile/Philip-Mayor-1"
            },
            "answer_text": "Any note can be made flat. Even a flat note can be flat (known as a double flat). You are just lowering the note by a half step or semitone (some use the term half tone). [1] C flat is the same note as B. When notes are the same but given different spellings we refer to them as enharmonics. [2] But a note is not minor rather an interval is minor: two notes in relation to each other. The term minor refers in this case to an interval: the distance between two notes. (Scales can also be minor). A minor 2nd, a minor 3rd, a minor 6th, minor 7th are the intervals that have a major and a minor. You can think of intervals as objects on their own or parts of a scale. A minor 3rd is always 3 semitones. A major 2nd is always 2 semitones and is often referred to as a whole step.[3] Another important term is root. If someone plays for you a note they might ask “using that note as the root, play a minor third.” The root of a G major chord will be G. When we refer to scales we often use the term degree to refer to each note of the scale. A minor scale is called that because the 3rd degree of the scale is lowered (or flattened) by one semitone. Then we have the very first note of a scale which is referred to as the tonic note, from which the scale derives it’s name. The C scale has as its tonic the note C. If we say “C scale” or the name of any other scale it is understood we mean major scale. If you are referring to the minor scale you must use the word minor so there’s no confusion. Thus in a C minor scale we will find the first third built on the tonic (notes C and E flat) is a minor third. The third degree of the C scale (E) has been lowered to make it minor. And while we’re at it let’s not forget the term inverted. Inverted means to take the notes of an interval and make the other note the root. A third inverts to a sixth. A forth inverts to a fifth.[4]In other words you’ve flipped the notes. Because the vocabulary of music developed over time and relates to how we hear things, people noticed that while a major scale is pretty straight forward, once you change that 3rd degree to make it minor some interesting things happen. Now when you play the scale you expect other stuff might change as well, because your expectations have changed. Expectations are very important in music. So guess what, we have three basic types of minor scales, all because they sound interesting to the ear: natural minor, harmonic minor, melodic minor.[5] We also have intervals so often used in music and so important in correctly tuning an instrument that someone decided they should be called “perfect.” Perfect intervals do not have minors because they are just perfect: a perfect 4th, a perfect 5th. Rather if they are made smaller by a semitone we call it “diminished” instead. I guess that’s a bit less than perfect. Finally you might think the smallest interval in music (at least in Western music) would be a minor 2nd, consisting of one semitone. You would of course be wrong. Someone decided we needed a name for when two notes are the exact same note, and for this we use the word unison.[6] If the notes are 12 semitones apart we call it an octave (easier than calling it an augmented 7th, which it is). An octave can be thought of as the interval made by playing the 8th degree of a scale with the tonic note of that scale, thus its name from the Latin word for eight (octava). And by the way, an octave is also considered a “perfect” interval. Why not? It’s the same note (just 12 semitones apart). So sadly there is no such thing as a minor note — other than that one on your piano that occasionally sticks. Footnotes[1] half tone in music[2] enharmonics - Google Search[3] Major second - Wikipedia[4] inverted in music - Google Search[5] Learn About the Types of Minor Scales | Deciphering Music Theory.com[6] unison in music - Google Search",
            "date": "Answered March 12, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Day",
                    "user_href": "/profile/John-Day-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Regel L. Bisso",
                "href": "/profile/Regel-L-Bisso"
            },
            "answer_text": "Let me start by explaining that a flat note is one which is lowered a half tone. Similarly, a sharp note is one which is raised a half tone. Turning now to your question, there is no such thing as a minor note. The term “minor” refers to a type of scale in music. A scale is any set of musical notes, usually spanning an octave, which forms the basis for our concept of “key.” The key of a piece of music is the series of notes, or scale, that forms the basis of a music composition in western music. Scales are classified in several groups, including major, minor, chromatic, etc. There are several types of minor scales, but they are all formed by replacing certain notes of the major scale with flat notes. ",
            "date": "Answered March 12, 2019",
            "views": "613",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jack Wright",
                    "user_href": "/profile/Jack-Wright-68"
                }
            ]
        }
    ]
}