{
    "title": "According to Vedic astrology, what career should I choose? - Quora",
    "tags": [
        "Horoscopes (astrology)",
        "Career Choices"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sofia Patel",
                "href": "/profile/Sofia-Patel-10"
            },
            "answer_text": "In career path tenth house the primary job as it identified with work and Profession. Additionally, it is the piece of Artha Trikon. Artha Trikon is a mix of Houses in Vedic Astrology. The second Priority Goes to the second House as it shows family and Money assets. sixth House focuses on Job. For salaried representatives, this house should be checked as it additionally focuses on Hard Work, Daily Routine, and so forth. the eleventh and seventh house is significant for money managers and independent work individuals for progress and addition. Before Choosing Career in Business Check This Houses in profession Prediction Profession According to planets in tenth House-Astrology As we Know the tenth House has a straightforward impact on our calling and our career. Now we should examine the Career According to planets in the tenth House-Astrology. Profession Prediction Sun in the Tenth House: Sun is Very Powerful for profession If it is in the tenth house. It gives Authority, position, and Status in your Career. Sun in tenth House additionally liable for Getting vocation in Govt. association. Peruse This Article About Various Career Option According to Zodiac sign. Vocation Astrology Moon in the tenth House: Confronting Changes in your vocation! This might be an indication that Moon is in your tenth house. Moon is additionally Responsible for Travel because of work. Solid Moon can get You vocation in Glamor Industry. Likewise you can Make vocation in Profession like Doctor, Human Resource, Sales and Marketing, and so forth. Vocation Astrology Prediction Mars in tenth House: Mars in tenth spot is a decent sign for Career. In tenth House Mars get Directional quality. Consequently Career like Army, Police, Engineering and Administrative Work Will Be Best. Look at Your Career Horoscope According Zodiac Sing. Vocation Prediction Mercury in tenth House: In the event that You are keen on Intellectual Profession, Mercury in tenth Adds A highlight you for getting accomplishment in vocation. Mercury in seventh House is additionally useful for vocation such as independent work. Mercury in tenth House can be useful for profession Like Journalism, legal advisor, Economist and Chartered Accountant. Take care of Your Career Problems relates in Career Problem arrangement by crystal gazing Vocation Astrology Jupiter in tenth House: Jupiter is answerable for making individuals Honest. So You will be keen on Nobel Profession. Jupiter in tenth isn't acceptable. You can make vocation in the Profession like Teaching, Lectureship, Trainer, Judge, and so on. Know The Solution of Jupiter in tenth Houses Directly. Vocation Prediction Venus in tenth House: A ton of VIP Are brought into the world with Venus in the tenth House. This is acceptable indication of effective profession. Venus increment Creativity and Venus in tenth House can give you profession Like Acting, Painting, Fashion Design, Public relationship, and so on. Vocation Astrology Prediction Saturn in tenth House: Saturn is planet of postponement. It will give great outcomes just in the event that it is Strong in tenth House. You will get Success however it will accompany some deferral. You can Prefer Career Like Management, Lawyer, Mining Industry, and so on. ",
            "date": "Answered September 1, 2020",
            "views": "28",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mehul Telang",
                    "user_href": "/profile/Mehul-Telang-1"
                },
                {
                    "user_id": "Tabij Astrology",
                    "user_href": "/profile/Tabij-Astrology-2"
                },
                {
                    "user_id": "Acharya Bhaskar Puri",
                    "user_href": "/profile/Acharya-Bhaskar-Puri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Visali Krishnan",
                "href": "/profile/Visali-Krishnan-1"
            },
            "answer_text": "Greetings!Profession is determined from the tenth house in one's horoscope,also known as karmasthan.It is judged by locating the key planet which is either; lord of the tenth house,planet in the tenth house,aspect of planets on tenth house.Tenth house should be seen from lagna,moon and sun,which ever is the strongest.Lord of Navamsha of the tenth lord,whichever is strongest ,from lagna moon and sun should also be seen .Second and eleventh houses show nature and quantum of income.planets placed here indicate nature of wealth earned.Fifth house.reveals the pattern of education and the intelligence of the person concerned.Fouth house indicates the pleasure derived from the profession.Planets involved in making yogas with sun and moon such as sunapha,Anapha,vesi,vasi.They will tell us the source of income.Important yogas will give clue to the nature of profession.A strong eleventh house and presence of Lakshmi yoga will make one involved in business.Saraswathi yoga ,makes a person inclined to fine arts.In addition to rasi and navamsha chart ,Dasamsa chart should be analysed for the nature of professionFrom karakamsa(it is the rashi in which the Atma karak is located in navamsa)one can predict the nature of profession.Sun in karakamsa gives public works,political activityMoon and venus- money earned through education,musician,poetsMars-metallurgy,arms,fire,chemist,engine driver,cooks etc.Mercury-merchant,weaver,social worker Jupiter-philosopher,religious head,panditSaturn-person becomes a famous business man if it joins atma karak.Venus - big politicians if joins with atmakarak.Rahu- doctor,chemical related jobs etc.Ketu-mathematician Hope this heps you! ",
            "date": "Answered July 16, 2017",
            "views": "354",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Artsy Neko",
                    "user_href": "/profile/Artsy-Neko-1"
                },
                {
                    "user_id": "Huiwen Z",
                    "user_href": "/profile/Huiwen-Z"
                },
                {
                    "user_id": "Sreetama Ghosh",
                    "user_href": "/profile/Sreetama-Ghosh-19"
                },
                {
                    "user_id": "Kalinka Borissova",
                    "user_href": "/profile/Kalinka-Borissova"
                },
                {
                    "user_id": "Hilary Fox",
                    "user_href": "/profile/Hilary-Fox-9"
                },
                {
                    "user_id": "Divyaa Londhe",
                    "user_href": "/profile/Divyaa-Londhe"
                },
                {
                    "user_id": "Crystal Goddess",
                    "user_href": "/profile/Crystal-Goddess-3"
                },
                {
                    "user_id": "Yuliya Ishkhanyan",
                    "user_href": "/profile/Yuliya-Ishkhanyan"
                },
                {
                    "user_id": "Vamsi Krishna",
                    "user_href": "/profile/Vamsi-Krishna-168"
                },
                {
                    "user_id": "Nataraj Vr",
                    "user_href": "/profile/Nataraj-Vr"
                },
                {
                    "user_id": "Sudhahur Reddi",
                    "user_href": "/profile/Sudhahur-Reddi"
                },
                {
                    "user_id": "Perky Pat",
                    "user_href": "/profile/Perky-Pat-1"
                },
                {
                    "user_id": "Edgar Destry",
                    "user_href": "/profile/Edgar-Destry"
                },
                {
                    "user_id": "Prakash Chilkoti",
                    "user_href": "/profile/Prakash-Chilkoti"
                },
                {
                    "user_id": "Darshana Agrawal",
                    "user_href": "/profile/Darshana-Agrawal-3"
                },
                {
                    "user_id": "Akshra Gj",
                    "user_href": "/profile/Akshra-Gj"
                },
                {
                    "user_id": "Archit Singhal",
                    "user_href": "/profile/Archit-Singhal-18"
                },
                {
                    "user_id": "Hitesh Chavan",
                    "user_href": "/profile/Hitesh-Chavan-1"
                },
                {
                    "user_id": "Nevenka Blažik",
                    "user_href": "/profile/Nevenka-Blažik"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aileen-113"
                },
                {
                    "user_id": "Praveen K",
                    "user_href": "/profile/Praveen-K-31"
                },
                {
                    "user_id": "Leah Alexander",
                    "user_href": "/profile/Leah-Alexander-40"
                },
                {
                    "user_id": "Mohan Raj",
                    "user_href": "/profile/Mohan-Raj-239"
                },
                {
                    "user_id": "Piyush Shrivastav",
                    "user_href": "/profile/Piyush-Shrivastav-8"
                },
                {
                    "user_id": "Jamie Bevan",
                    "user_href": "/profile/Jamie-Bevan-8"
                },
                {
                    "user_id": "Neelesh Adki",
                    "user_href": "/profile/Neelesh-Adki"
                },
                {
                    "user_id": "Santhosh Kumar",
                    "user_href": "/profile/Santhosh-Kumar-6015"
                },
                {
                    "user_id": "R Sudha",
                    "user_href": "/profile/R-Sudha-4"
                },
                {
                    "user_id": "Riddhesh Sakpal",
                    "user_href": "/profile/Riddhesh-Sakpal"
                },
                {
                    "user_id": "Mahagamage don Sisira Rodrigo",
                    "user_href": "/profile/Mahagamage-don-Sisira-Rodrigo"
                },
                {
                    "user_id": "Sunaina Awasthi",
                    "user_href": "/profile/Sunaina-Awasthi"
                },
                {
                    "user_id": "Sarah Ahmed",
                    "user_href": "/profile/Sarah-Ahmed-75"
                },
                {
                    "user_id": "Rajendiran S",
                    "user_href": "/profile/Rajendiran-S-5"
                },
                {
                    "user_id": "Aiswarya",
                    "user_href": "/profile/Aiswarya-83"
                },
                {
                    "user_id": "Brij Patwari",
                    "user_href": "/profile/Brij-Patwari-1"
                },
                {
                    "user_id": "Gopalkrishn Nambi",
                    "user_href": "/profile/Gopalkrishn-Nambi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adv-Devesh-Tripathi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Wara-36"
                },
                {
                    "user_id": "Ramasubramanian Chellaperumal",
                    "user_href": "/profile/Ramasubramanian-Chellaperumal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mamta Singh",
                "href": "/profile/Mamta-Singh-1266"
            },
            "answer_text": "Kundali is the report card based on our birth time, planets, and nakshatra positioning at that moment. Astrology is the science that has various parts in it. The prediction segment is called Falit Jyotish. Kundali Analysis gives us numerous speculation about ourself or about the person whose Kundali is being analyzed. In conventional Vedic Astrology there are 12 houses (Bhava) and each represents some attributions.  Mostly the Tenth house (lord of the tenth house, the planet in it, aspects of the tenth house) influences the profession of a person while the other house 2nd, 5th, 11th, are also seen for analysis. Here your question is “what career should I choose”, well there is no perfect answer I can give here, and even if someone is giving you should not believe in that. For perfect career choices, you should get your kundali analyzed by any expert astrologer. Planets in houses can affect differently according to planet positioning. It may be some planet is creating a negative impact for a particular career which you may not know just by theoretical explanations. Some positive or negative effects get canceled out by some specific combinations. So Kundali analysis is necessary. Pt. Pawan Kaushik is Delhi based celebrity astrologer/ popular as the greatest Indian Jyotish who has vast knowledge in this field. He has been serving in this field for more than 20 years. You can also book consultation from him. ",
            "date": "Answered August 6, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sumit",
                "href": "/profile/Sumit-993"
            },
            "answer_text": "Dear Sameer, The significance of the 10th house takes us to the realm of career and status in life. It displays fundamental possibilities. The 10th is a Kendra and as such, any planet located here will be prominent, powerful, and influential all through life. As this is an upachaya house (attributes that grow with time and effort), any possibility indicated by an occupying planet will grow in strength as life progresses. This in effect also gives great strength in overcoming all kinds of obstacles. The house indicates our ambition, status, profession, father, fame, recognition, foreign travels or affairs, political power, authority and many others. But very importantly, it signifies our determination, self-reliance and patience. The 10th house reveals holy pilgrimages, as well as good and charitable deeds, compassion, etc. Father's reputation is also signified by this house. A strong 10th house will give the person a position of power in career and fame. Different planets may fare in a very unique manner in this house, irrespective of their lordship. Let us see how they fare and how it affects our career or 10 th house significations in general. I will start with the Sun, as it is the most important of all planets. The Sun is a great planet, but it is a natural malefic. All malefics thrive in an 'upachaya' house so by the virtue of this tendency, Sun does well when located in the 10th house. Sun in the 10th house is an excellent placement for career and the person may get success in all undertakings. The Sun is the significator of the 10th and hence gets digbala, or directional strength, when located here. Astrologers often conclude that it is its best position in the horoscope. The person is career-minded and easily rises to a position of authority in his chosen profession. Fame and popularity are associated with this signature and these yield great power. As Sun aspects the 4th house, there may be difficulties in relationship with the mother due to this, but wealth is favoured and a beneficial relationship with the father, who may be wealthy and prosperous, is also indicated.Moon is a neutral planet but it is a beneficial planet as well. Its location and aspect produce calming and soothing effect always. When Moon is located in the 10th house, career matters are highly enhanced. If the waxing Moon is in the 10th house, the person is very fortunate as the significations of both the Moon and the 10th house flourish. The person is sure to enjoy fame and success from a very young age. Moon's location in the 10th house induces the person to love his/ her profession and to be sincere and diligent in efforts.Mars is natural malefic like the Sun and Saturn. The 10th house is one of the few houses that utilize this fiery energy of Mars to good effect. Mars gets digbala or directional strength in the 10th , often making this its best placement in the horoscope. The person is efficient and enjoys success and achievement all through life. The person is highly ambitious and may wish to be a ruler of some sort. Mars aspect on the 4th house may indicate ups and downs in relationship with mother and some amount of unrest in the domestic scenario. But overall, this is a fine location for Mars and makes the person 'a go getter' in his/ her profession.Mercury is a natural benefic and if Mercury is in the 10th house, the person has a successful career and a good reputation. The person has the capacity to earn plenty of wealth. It is necessary to consider the aspects to Mercury - alone and un-aspected in the 10th . If this is true, it can indicate great intellect and involvement in a career connected with communications. Mercury rules commerce and trade, so this placement can mean a very successful person in business. Mercury's aspect on the 4th house indicates a fine education and happiness at home. The person also enjoys fine conveyances and all kinds of comforts and luxuries; a good relationship with mother and benefits from her are well indicated as well.When Jupiter is in the 10th house, the person will enjoy a successful career and will know his purpose right from a very young age. His or her professional activities will succeed almost immediately, and there will be honor and fame. The person may also choose a career, which greatly benefits the public. He or she will especially be attracted to work involving higher knowledge. Jupiter is known as the great benefic and even when it is the lord of inauspicious houses, its location and aspect produce some good somewhere; just as there is some unfavorable hidden in Saturn's blessings.Venus is a natural benefic and like the Moon, it has its wonderful attributes. Its energy is beautiful and its placement in the 10th house makes the person bring joy and happiness to the public and all his or her associates. This is one of the most common placements of successful actors, artists, musicians, and performers. It is also found in the horoscopes of people who make their living selling jewelry, photography, cosmetics, sweets, arts and crafts, fine cars, and other such luxuries. The person enjoys great popularity and has a natural flair for making wealth. The person is lucky in life and makes many lucky contacts with people through his/ her profession. The person is happy and content, as Venus is powerful and prominent in this Kendra, throwing its benefic aspect onto the 4th house. The person gains great wealth and enjoys fine cars and conveyances.Saturn is a natural malefic and is greatly feared by most. When Saturn is in the 10th house, the person normally possesses great ambition, leadership ability and power. However, Saturn in any kendra gives major ups and downs in life and therefore, career successes may fluctuate. The benefits of this malefic's location in the 10th house has its benefits too, though. Saturn in the 10th gives the tendency of leadership and a highly disciplined approach to one's profession. However, the rest of the horoscope should be analyzed to confirm whether a leadership position is likely or not. Otherwise, the person's work may be connected with construction, mining, or any career involving manual labor, like steel, iron, coal, etc. Saturn's aspect on the 4th house is not good and may affect relationships with mother and also cause domestic unrest and sometimes native education is also affected.Rahu is a malefic but the 10th house is one of the finest placements for Rahu. The person is likely to have a powerful and renowned career. Career will flourish most if the person is connected with the masses. Many politicians have this placement. Influencing the masses or selling to the public is the key note of this placement. As Rahu essentially generates ambition, the person may live with insatiable career ambitions, changing career many times. If other houses and planets placements of the horoscope are harmonious, the person's work and effort greatly benefit society. The person will easily reach a position of authority. Money power comes early in life and may help support parents.Ketu is also a malefic and is a profound energy of the unknown. Because malefics in upachaya houses produce good results, Ketu in the 10th gives excellent career success. But generally career is out of the ordinary. The sign placement is also very important as Ketu may cause problems if it is in an inimical sign. In such a case, the person could experience strange difficulties in career. The most common of the troubles caused by Ketu is enmity from unknown and behind-the-scene activities against the person in terms of his/ her career. This can become very troublesome in the career path as well as the person's general success and happiness.When considering matters related to the 10th house, one must never forget that success relates to the status the person is born with. A very good 10th house in a pauper's horoscope may not mean that he/ she will attain royal status - it indicates a status that is better than that of a pauper. But with malefic or Martian attributes, the person may even turn dictator and overthrow the government. There are some subtle significances that must also be understood before any conclusive significance to this house can be attached . The religious philosophy of a man is dharma and dharma without any significance or connection to karma is empty. The 10th house astrologically suggests the fruitification of the 9th house. Dharma must set a certain Karma without which it would be an empty profession, devoid of any significance. It is for this reason that we find planet connections between the 9th, 10th or Ascendant. The 9th and 10th create Raj jog. They are connections that can turn a pauper into a king or a sceptic into a great guru. When we consider the career aspect, it is not only just one or two houses that can be analyzed for a perfect picture. Career is connected with finance, vocation and ultimately, gains and self- satisfaction. If we just consider the 10th house for career, or the 6th house for service, or the 11th house for gains, or the 2nd house for conserved wealth, the analysis will remain half-hearted and incomplete. All the four have to be considered together and analyzed for just how well they are adjusted with each other's planetary energies. Then alone will the true essence emerge! Thank You ",
            "date": "Answered July 15, 2020",
            "views": "18",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-261"
                },
                {
                    "user_id": "Snehal Gawde",
                    "user_href": "/profile/Snehal-Gawde-3"
                },
                {
                    "user_id": "Neda Zhecheva",
                    "user_href": "/profile/Neda-Zhecheva"
                },
                {
                    "user_id": "Sameer Sharma",
                    "user_href": "/profile/Sameer-Sharma-1078"
                },
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esha Chawla",
                "href": "/profile/Esha-Chawla-3"
            },
            "answer_text": "It is not simple and easy to determine a profession using Vedic astrology because there are so many different kinds of profession and there are just 9 planets. Therefore, concluding one single profession of a person is not possible. Still, we have concluded a few points which must be considered while finding the profession. Before heading to Vedic astrology, first find out about the following things: Choices of professions as per the education background or skillsChoices of professionals as per family background or hereditaryNow are some Vedic astrology based points which all the astrologers keep in mind: Look for Artha Trine which is 2-6-10 to know the strength of career in one’s horoscope.Study strength of 6th house in comparison with 10th. If 10th is stronger then the person will have an independent business and if not then he will stay in a job.Look for planets that are related to 6th, 10th house and Saturn. The choice of career will be related with the planet.Study the strength of 10th, Sun, Moon and Saturn. Their strength will be directly proportional to the growth in power and position of the native.Determine relationship with 4th, 9th and 10th.",
            "date": "Answered July 26, 2018",
            "views": "101",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                },
                {
                    "user_id": "Sambangi Adarsh",
                    "user_href": "/profile/Sambangi-Adarsh"
                },
                {
                    "user_id": "Shaubhagya Kumar",
                    "user_href": "/profile/Shaubhagya-Kumar"
                },
                {
                    "user_id": "Nitin",
                    "user_href": "/profile/Nitin-210"
                },
                {
                    "user_id": "Manish Khtri",
                    "user_href": "/profile/Manish-Khtri"
                },
                {
                    "user_id": "Alisha Rai",
                    "user_href": "/profile/Alisha-Rai-10"
                },
                {
                    "user_id": "Ankita Mehta",
                    "user_href": "/profile/Ankita-Mehta-41"
                },
                {
                    "user_id": "Kavya Nanda",
                    "user_href": "/profile/Kavya-Nanda-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Byrnee",
                "href": "/profile/Michael-Byrnee"
            },
            "answer_text": "Well, since you posted your question to strangers on Quora without any information (not that any is required since astrology is nothing but a superstitious hoax for the gullible), I would say that a clueless occupation such as palm reader, tea-leaf reader or some other inane and unfulfilling career would be appropriate. But before you do that, I recommend to go to a prime source for wisdom. That way, there will be no doubt as to what path you follow. Yes, as I suspect you already know - it is time to get some delicious Chinese take-out, and make sure you get several fortune cookies so that you can cherry pick the most appropriate career (and lottery numbers) for you. ",
            "date": "Answered January 8, 2020",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jo Tube",
                    "user_href": "/profile/Jo-Tube"
                },
                {
                    "user_id": "Atri Acharya",
                    "user_href": "/profile/Atri-Acharya-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srihari K",
                "href": "/profile/Srihari-K-6"
            },
            "answer_text": "Hello, The profession, as per Vedic astrology is determined by the 10th hosue and the planets impactiing the 10th house and or 10th lord. There are some sction of astrolgers who consider the 6th for employment and the 10th house for entrpreneurship. Actually it becomes very difficult to pin point the vocation, as there are many types of professions. Going by the basic rules and significations, Jupiter for example, may indicate a profession related to teaching, or priestship, primarily. But, it seldom happens that only a single planet is empowered to deicde what job the native does. In fact, this happens for almost every aspect of the native’s life, as planets, seldom act single.The stronger of the plantes, that is giving imapct on the house concerned or on the planet concerned may give the clue to the vocation of the native. Here, commonsence and the socal conditions also paly a very vital role. ",
            "date": "Answered August 4, 2017",
            "views": "82",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                },
                {
                    "user_id": "Swarnim Sharma",
                    "user_href": "/profile/Swarnim-Sharma-3"
                },
                {
                    "user_id": "Rajendiran S",
                    "user_href": "/profile/Rajendiran-S-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Singh",
                "href": "/profile/Abhishek-Singh-1381"
            },
            "answer_text": "According to vedic astrology you should only choose that carrier which may make you strong enough to earn money for yourself and your family including old parents. You should feed your wife if you are a man and serve your husband if you are a girl. As per modern astrology a career should make you financially independent whoever you are whatever you do and wherever you do. I mean you should get to know what you do. 10th house of D1 chart that is lagan is for career. D10 divisional chart can be seen for more and indepth analysis if time of birth is near correct otherwise moon position will change for sure…so do mind state! ",
            "date": "Answered September 10, 2019",
            "views": "32",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                },
                {
                    "user_id": "Joelle McMurchy",
                    "user_href": "/profile/Joelle-McMurchy"
                },
                {
                    "user_id": "Hargovinddas Harsora",
                    "user_href": "/profile/Hargovinddas-Harsora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Athena Sharma",
                "href": "/profile/एथेना-शर्मा-Athena-Sharma"
            },
            "answer_text": "Profession is a complete study in astrology and need deep analysis of tenth house, Lord of tenth house, planets in tenth house, along with aspects on it, their dispositor, connection with fifth house (house of education), dashamsha etc. Each planet denotes a area of study or work, then there is joint study of planets in conjunction and mutual aspects which changes the profession. The connection with fifth, ninth, and eighth house is also important to judge the career. Apart from these, each planet's conditions in different houses builds your professional attitude and environment. ",
            "date": "Answered July 18, 2017",
            "views": "87",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                },
                {
                    "user_id": "Suneil Rai",
                    "user_href": "/profile/Suneil-Rai"
                },
                {
                    "user_id": "Pravin Yadav",
                    "user_href": "/profile/Pravin-Yadav-153"
                },
                {
                    "user_id": "Kalpita Kanwar",
                    "user_href": "/profile/Kalpita-Kanwar-2"
                },
                {
                    "user_id": "Alok Ranjan Mishra",
                    "user_href": "/profile/Alok-Ranjan-Mishra-3"
                },
                {
                    "user_id": "Santhosh",
                    "user_href": "/profile/Santhosh-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ratnajit Jadhav",
                "href": "/profile/Ratnajit-Jadhav"
            },
            "answer_text": "Career is chosen based on strong points of a person.. Which can be seen from strong planets.. not just by 10th house. 10th house is mostly job oriented… career is something beyond job.. more broader term.. where it can be related to any house.. Also there are factors beyond Kundli as well.. ",
            "date": "Answered October 30, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manoj Vachhani",
                "href": "/profile/Manoj-Vachhani"
            },
            "answer_text": "all nine planets , their nakshatra lord and sub lord need to be anlayzed for most probable profession which can give inner satisfaction. otherwise if gains are destined in horoscope then any profession will fetch money and desire full fill ment. nakshatra of planets and dasha of the lords plays important role in life direction. 4seelife.com ",
            "date": "Answered July 22, 2017",
            "views": "5",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "A Carunaratne",
                    "user_href": "/profile/A-Carunaratne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi Thiagarajan",
                "href": "/profile/Ravi-Thiagarajan-3"
            },
            "answer_text": "Amatyakaraka is the planet that gets second highest degree in the horoscope. Amatyakaraka is the key indicator of native profession Other aspects like 10th house etc are but secondary. They do add value but Amatyakaraka is the key ",
            "date": "Answered December 10, 2018",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srinivas Sitaram",
                    "user_href": "/profile/Srinivas-Sitaram"
                }
            ]
        },
        {
            "author_info": {
                "name": "SubbaRao Venkata Machavaram",
                "href": "/profile/SubbaRao-Venkata-Machavaram"
            },
            "answer_text": "Several factors are to be observed.. 10 th house from Asc, (also from the Moon, Sun ) the planet which governs it, the running Mahradasha…the strength of the planets all will lead. More and more the running Mahardasha should be not bad. ",
            "date": "Answered July 21, 2017",
            "views": "21",
            "upvotes": "0"
        }
    ]
}