{
    "title": "Am I too young or too old to start learning how to play the guitar? - Quora",
    "tags": [
        "Guitar Lessons",
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars",
        "Musical Instruments",
        "Aging",
        "Age",
        "Learning New Things",
        "Learning",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Mishra",
                "href": "/profile/Abhishek-Mishra-22"
            },
            "answer_text": "Nah, that’s bollocks! Sure, starting young is a tremendous advantage. But starting old-er is perfectly fine. I started EXTREMELY late by general guitar playing standards. I have been playing for nearly 5 years. I am far from any respectable level yet. But hopefully, the below vids tell you that you can make progress as long as you keep at it. Feel free to inbox me for any practice queries!   ",
            "date": "Answered May 5, 2020",
            "views": "60",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ushosee Das (ऊषशी)",
                    "user_href": "/profile/Ushosee-Das-ऊषशी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Chaurasia",
                "href": "/profile/Yash-Chaurasia-13"
            },
            "answer_text": "A2A, I’ve witnessed many of them, who would join guitar classes when they were just 9 or 10. And some who even had a job, are either college or school students. And many of them who were just not as sincere as they should be, hence they left the classes, and quit learning. In my case, I first joined when I was in class 7, and continued to learn till class 10, and rejoined again for nearly 2 months in my 2nd year of higher education. Hence all that matters is your dedication and sincerity, and of course you need time from your schedule, which is just a bit difficult, to give on hobbies, as we grow up. Hence, join only if you are really interested in it, else you would just end up wasting your time. Happy Learning -YASH ",
            "date": "Answered May 5, 2020",
            "views": "93",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ushosee Das (ऊषशी)",
                    "user_href": "/profile/Ushosee-Das-ऊषशी"
                },
                {
                    "user_id": "Vidhya Bharathi",
                    "user_href": "/profile/Vidhya-Bharathi-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaushal C",
                "href": "/profile/Kaushal-C-3"
            },
            "answer_text": "It is never too early or too old to start learning an instrument or music in general. As long as you are old enough to recognise the pitch and physically be able to play an instrument, you can start learning the instrument. Most children acquire this ability by the age of 4-5 years and many start training in music around the age of 7. There is no upper limit to start learning either. You only need the will to do it and have the time and patience. ",
            "date": "Answered May 5, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ushosee Das (ऊषशी)",
                    "user_href": "/profile/Ushosee-Das-ऊषशी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kbhanushali",
                "href": "/profile/Kbhanushali"
            },
            "answer_text": "Never. Start learning it when you feel like. Age doesnt matter. All you need to have is some passion. ",
            "date": "Answered May 7, 2020",
            "views": "8",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ushosee Das (ऊषशी)",
                    "user_href": "/profile/Ushosee-Das-ऊषशी"
                }
            ]
        }
    ]
}