{
    "title": "Are there strip clubs where girls are fully naked? - Quora",
    "tags": [
        "Strip Clubs",
        "Strippers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam Crowleigh",
                "href": "/profile/Liam-Crowleigh"
            },
            "answer_text": "“Are there strip clubs where girls are fully naked?” Sure there are. Not all countries are as prudish as the United States. There are lots of countries where full nudity, either professional as a stripper or public as on a beach, aren’t really such a big deal. Although I haven’t visited a strip club for decades when I was taken to one on a business trip in the States I was shocked to find out that the dancers had to keep G-strings on and sometimes even pasties, and yet the patrons of the bar were going wild as if it was a big deal while I found it kind of boring and paid more attention to my drink than to the semi-clothed dancers. It’s probably more common in most countries for strippers to go completely naked than it is for them to have to wear something. It makes the whole thing seem sort of pointless. ",
            "date": "Answered September 24, 2019",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "PJ Smith",
                    "user_href": "/profile/PJ-Smith-64"
                },
                {
                    "user_id": "Kim Smith",
                    "user_href": "/profile/Kim-Smith-1550"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kris Nystrom",
                "href": "/profile/Kris-Nystrom-3"
            },
            "answer_text": "Yes, but it depend upon the state and the city and the rules they have in place. Most states that I have been too the general rule has been; If they serve alcohol topless only, no alcohol fully nude. Generally, if the establishment is fully nude they will have it advertised as such! ",
            "date": "Answered October 15, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dion Shaw",
                "href": "/profile/Dion-Shaw"
            },
            "answer_text": "Sure, the is one close to Madison, Wisconsin that is full nude. In Illinois, the full nude clubs don’t allow alcohol. Topless and booze, but no bottomless and booze. Toronto has full nude clubs that serve booze. ",
            "date": "Answered September 25, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}