{
    "title": "Are “Londonderry Air”, “Danny Boy” and “You Raise Me Up” the same song (music, similarities, IP theft)? - Quora",
    "tags": [
        "British Musicians",
        "Theft",
        "London",
        "Song Lyrics",
        "Song Identification",
        "Music Recommendations",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Graham Howe",
                "href": "/profile/Graham-Howe-3"
            },
            "answer_text": "Are “Londonderry Air”, “Danny Boy” and “You Raise Me Up” the same song (music, similarities, IP theft)? The Londonderry Air is a traditional Irish melody, and as such, is in the public domain. The words of the song “Oh Danny Boy” were written in the early years of the 20th century by Frederic Weatherly - who many will be surprised to learn was an Englishman. “You Raise Me Up” is an entirely different song altogether, written in the early 21st century by Norwegian Rolf Løvland, and Irishman Brendan Graham who performed together under the name Secret Garden. It has one phrase - (the first four notes of the chorus) which are the same as one four note phrase in the Londonderry Air - but there is nothing sinister or unusual about that - the first four notes of Baa Baa Blacksheep are the same as the first four notes of Twinkle Twinkle Little Star and no one accuses the composer of one of plagiarising the other. In the case of both songs, the melodies are otherwise quite distinct. ",
            "date": "Answered May 6, 2020",
            "views": "590",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Duayne Koltowicz",
                    "user_href": "/profile/Duayne-Koltowicz"
                },
                {
                    "user_id": "John Redmond",
                    "user_href": "/profile/John-Redmond-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samantha Andrews",
                "href": "/profile/Samantha-Andrews-21"
            },
            "answer_text": "No. They are three quite dissimilar songs. The lyrics are different and the tunes are different and apart from the fact that there is an Irish connection, I really have no idea why you might think there are any similarities at all. ",
            "date": "Answered May 6, 2020",
            "views": "139",
            "upvotes": "0"
        }
    ]
}