{
    "title": "Are you using K-pop songs or K-dramas to learn Korean? - Quora",
    "tags": [
        "Learning Korean",
        "Television Dramas (Asian)",
        "Korean Dramas",
        "Korean (language)",
        "South Korea",
        "Learning Languages",
        "K-Pop",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luna Lee",
                "href": "/profile/Luna-Lee-60"
            },
            "answer_text": "Yes me it was a lot easier to learn Korean because I liked watching kdramas and listening to kpop so it made it fun to learn Korean and easier for me to remember. Words or sentence that actors keep repeating makes it easier for me to remember. And when listening to a korean song having the translate English transfer makes it easier for me to know what the sentence means. I also learned by repeating the sentence or words that they say or sing a lot so I can listen to my own pronunciation. Hope that this help I also watch kvariety shows and news with English subtitles most of the time to learn words that aren’t being said in dramas or songs. And also it’s really helps to find 1 or 2 Korean friend that you can talk to so you can learn to speak and read ",
            "date": "Answered July 31, 2020",
            "views": "60",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dawn Marshall",
                    "user_href": "/profile/Dawn-Marshall-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jin Zuishou",
                "href": "/profile/Jin-Zuishou"
            },
            "answer_text": "Not particularly, but they help. I am not currently, actively learning Korean, but I am picking bits up from the Korean TV I watch and BTS, who I listen to regularly. It is an easier way to get it into my head and confirm I actually understand the words without reading the subtitles. I mostly watch and listen to Korean-anything just to feel happy. I love the happy endings in most Korean dramas and, of course, I love, love, love anything BTS. TTFN! ",
            "date": "Answered July 31, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tharushi Kavindi",
                    "user_href": "/profile/Tharushi-Kavindi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirby Cho",
                "href": "/profile/Kirby-Cho-2"
            },
            "answer_text": "If by learning the language itself,  If by learning just the vocabulary, “somewhat-ish”. Usually, I would read Korean subtitles/ captions from either movies, Japanese anime, or YouTube. I also do a little translation between Korean, Japanese, and English (and a bit in Vietnamese). Example: Read this… Kirby Cho (ユーイチ)'s answer to What are your thoughts on the \"God of High School\" anime? ",
            "date": "Answered July 31, 2020",
            "views": "251",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sammie Garate",
                    "user_href": "/profile/Sammie-Garate-1"
                },
                {
                    "user_id": "Rafael Ferreira",
                    "user_href": "/profile/Rafael-Ferreira-172"
                },
                {
                    "user_id": "Eri Hayashi",
                    "user_href": "/profile/Eri-Hayashi-2"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                },
                {
                    "user_id": "Vonn Russell",
                    "user_href": "/profile/Vonn-Russell-1"
                },
                {
                    "user_id": "Fan Christian Jiang",
                    "user_href": "/profile/Fan-Christian-Jiang"
                },
                {
                    "user_id": "Kyary Pamyu Pamyu Fan",
                    "user_href": "/profile/Kyary-Pamyu-Pamyu-Fan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Ngo",
                "href": "/profile/Katie-Ngo-27"
            },
            "answer_text": "Some stuff in k-dramas and k-pop is not the most casual and if used in the wrong context (talking to a person) than it’ll really mess your korean up. It’s definitely much more fun learning words through them but if you plan on learning Korean, I don’t suggest basing your korean off of it. ",
            "date": "Answered July 31, 2020",
            "views": "39",
            "upvotes": " Answer requested by Park TaeJoon",
            "upvoters": [
                {
                    "user_id": "Dawn Marshall",
                    "user_href": "/profile/Dawn-Marshall-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nadi S",
                "href": "/profile/Nadi-S-3"
            },
            "answer_text": "I am using two sites (mylanguagexchange) (conversationexchange). I just started so I’ll let you know if i get good results. ",
            "date": "Answered July 31, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Seher Javed",
                "href": "/profile/Seher-Javed-6"
            },
            "answer_text": "Kdramas. As English subtitles, help me to understand wide variety of korean words. ",
            "date": "Answered July 31, 2020",
            "views": "12",
            "upvotes": " Answer requested by Park TaeJoon"
        }
    ]
}