{
    "title": "Are there any professional marching bands in the United States? - Quora",
    "tags": [
        "Marching Bands",
        "Bands (music)",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Betsy Megas",
                "href": "/profile/Betsy-Megas"
            },
            "answer_text": "Yes, depending on what you count as professional. If you mean is there a “major league” for this sport, that would have to go to Drum Corps International. Don’t call these groups marching bands; they are drum corps. They march specialized horns—all brass, no woodwinds. They also have an age limit (typically 21) and a limit to the number of members (currently 154)[1] of any one group. Here’s a tiny sample of the kind of work they do, but there is no way your computer screen and speakers can capture the impact of a live show. I encourage you to attend an event in person if ever you get the chance.  If you mean “getting paid,” then for all their skill and effort, DCI groups might not count. Many have the enthusiastic support of makers of instruments and equipment, but I don’t think the musicians get paid to participate. Some pro sports teams have marching bands, which I presume do get paid. The San Francisco 49ers have, at the least, a drum line.  Some theme parks have marching bands as part of their show:  The U.S. armed forces have marching bands. Here’s one of the Air Force bands in a parade. (There are many videos and recordings, and most are better than this. I was looking for some actual marching. They get to playing more than just the drum cadence after most have gone past this video camera.)  And at least one group, Blast, has taken the drum and bugle corps show elements indoors, expanded and interpreted rather broadly, and is touring the production:  Footnotes[1] DCI 2018 Rule Changes Cheat Sheet",
            "date": "Answered August 10, 2019",
            "views": "592",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joanna Thorman",
                    "user_href": "/profile/Joanna-Thorman"
                },
                {
                    "user_id": "Mikael Bengtsson",
                    "user_href": "/profile/Mikael-Bengtsson"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Annika Peacock",
                    "user_href": "/profile/Annika-Peacock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cameron Parker",
                "href": "/profile/Cameron-Parker-123"
            },
            "answer_text": "That’s a fantastic question! It is a little bit tricky to answer though so I will do my best to explain. Professional in the sense that you get paid to be a member of a marching band sure! Every branch of the military has a band, and they get paid to perform. It might not be marching band in the same sense as high school but still paid performers. The closest thing to it is probably going to be Drum Corps International or DCI. Even though everyone involved has to pay to join and participate they would probably be the marching band equivalent to say the NBA for basketball. Last but not least is the only actual “professional” marching band event I can truly think of. It’s called the Virginia International Tattoo, it is truly an incredible experience for anyone who enjoys marching band. Here is a blog that talks about it in more detail Take Your Students To Virginia Beach | Kaleidoscope Adventures ",
            "date": "Answered February 21, 2020",
            "views": "106",
            "upvotes": " Answer requested by Annika Peacock",
            "upvoters": [
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                },
                {
                    "user_id": "Marc Weyl",
                    "user_href": "/profile/Marc-Weyl"
                },
                {
                    "user_id": "Annika Peacock",
                    "user_href": "/profile/Annika-Peacock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Graham",
                "href": "/profile/Norman-Graham-6"
            },
            "answer_text": "Yes, but they’re Military Bands. I know the Marine Corps has one and I believe the Army and Navy do also. I believe The Salvation Army has one and I’m not sure about The Air Force. As for professional marching bands, beyond those I’ve mentioned, I’m not familiar with them. ",
            "date": "Answered January 7, 2020",
            "views": "53",
            "upvotes": " Answer requested by Annika Peacock"
        },
        {
            "author_info": {
                "name": "Bob Trammell",
                "href": "/profile/Bob-Trammell-1"
            },
            "answer_text": "Are there any professional marching bands in the United States? Yes. Most of them as are part of Drum Corps International: Marching Music`s Major League. ",
            "date": "Answered March 9, 2019",
            "views": "223",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Emily Facemier",
                "href": "/profile/Emily-Facemier-2"
            },
            "answer_text": "Of course, there is the military, but there are some outside of that. They may be more difficult to find, but not impossible. The Royal Hawaiian BandPatriot BassMore information and bands can be found at this link- http://www.halftimemag.com/march-april-2017/professional-marching-bands.html ",
            "date": "Answered October 14, 2019",
            "views": "75",
            "upvotes": " Answer requested by Annika Peacock"
        },
        {
            "author_info": {
                "name": "Kimberly Dawn",
                "href": "/profile/Kimberly-Dawn-63"
            },
            "answer_text": "None where you get paid to march. DCI is the top of the chain and is what everyone looks to as the best of the best, but you still have to pay to participate and once you turn 21, you are no longer eligible to march in most corps. ",
            "date": "Answered October 4, 2019",
            "views": "33",
            "upvotes": " Answer requested by Annika Peacock"
        }
    ]
}