{
    "title": "Are bassists failed guitarists? - Quora",
    "tags": [
        "Bass Guitarists",
        "Guitarists",
        "Guitars",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Gee",
                "href": "/profile/Johnny-Gee-16"
            },
            "answer_text": "we have failure as in financial failure in musical sense and we have 2 excellent musicians, one bass one guitar The bassist is a relatively rare bird, n contrast to the extremely common guitar. Bass playing is a special role, that most guitarists, whether excellent guitarist or average or poor guitarists. lack the “bass gene”. it is not about talent as much as it is about a knack for bass. Au Contraire, Guitarists tend to FAIL at bass… pianists too, in the jazz world where the Acoustic bass is the counterpart to elec bass with electric guitar… eg Jazz most commonly piano and acoustic bass… in rock pop electric guitar and elec bass. As a bass player keyboard player… I can assert that only one in 10 keyboard players could play keyboard AND left hand bass. Such as Keyboardist with Jim Morrison. Playing bass is a selfless act… you are playing fundamentals literally… Most people want to shine like a guitar star… but the bass is in the background… he never stops playing he drives the rhythm usually more than most guitarists and flashy pianists. ",
            "date": "Answered April 7, 2020",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Sackett",
                    "user_href": "/profile/Rich-Sackett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Johns",
                "href": "/profile/Chris-Johns-56"
            },
            "answer_text": "No. If you dig into most genres of music where the bass is a significant instrument you tend to find that the bass player is often the best musician and a driving force behind the band. Obvious examples are : Flea : Red Hot Chilli PeppersPaul McCartney : The BeatlesSteve Harris : Iron MaidenTimmy C : RATM*Ginger Baker : Cream; *as has been pointed out in comments I mean Jack BruceDonald ‘Duck’ Dunn : most Stax records and Blues BrothersLemmy : MotorheadGeezer Butler : Black SabbathI would say that in every single one of the examples above the bass player was absolutely essential to the success of the band ",
            "date": "Answered April 7, 2020",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Jonsson",
                "href": "/profile/Andrew-Jonsson"
            },
            "answer_text": "You know what? I am a failed guitarist. When I was a kid, I made the mistake of settling for a cheap guitar rather than saving my pennies and getting a bass like I really wanted. I had tried out a bass in music class in middle school and loved. But I had the choice of getting a guitar now, or save until I had the difference between the price of the guitar that my parents were willing to pay, and what a bass costed. (This was the early 70s, there were not many inexpensive basses on the market that I knew of like was true a decade later.) I suppose part of that was I just didn’t see how I was going to save the extra money. What little I did have from chores, mowing, and even cleaning the local pizza place didn’t add up to much. So I got a guitar, even learned to play things on it. But I decided I just didn’t like it much. And now my “I want to buy X instrument” well was dry. So I finally got a bass about 8 years later and learned to play it. I never was anything but a journeyman player, but I had fun and had more than one chance to turn professional. ",
            "date": "Answered April 10, 2020",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olivier Demeijer",
                    "user_href": "/profile/Olivier-Demeijer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samar Pant",
                "href": "/profile/Samar-Pant-1"
            },
            "answer_text": "Um, mate, no way…do you know about this guy? He's pretty much recognised everywhere.  he seems to be doing pretty well for someone called a “failure”. Defining the sound of a genre your definition of a failure? Or how about this guy.  He is Les claypool. He pretty much plays bass like it were a guitar. He's made a big name for himself as a bassist. He doesnt look that failed to me. Or what of this person? He was only the bassist for one of the most successful bands in metal (RIP).  Bassists are some of the most sought after musicians and define the sound of their band and even the genre they are in. They are a force unto themselves. If you're still not convinced just watch some bassists on YouTube. Maybe a few hundred will convince you 😀 ",
            "date": "Answered April 7, 2020",
            "views": "198",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "RJ Holland",
                    "user_href": "/profile/RJ-Holland-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlo Mazzini",
                "href": "/profile/Carlo-Mazzini"
            },
            "answer_text": "If so, nothing in this life makes me happier than being a failed guitarist. Because I love playing the bass with a passion. I practice every day. I get better every day. I have 2 basses I enjoy playing, 2 beautiful Jazz basses, one fretted and one fretless. I also have a nice Stratocaster, which I like playing once in a while. And I’m decent with it. I can hold myself, even better than other guitarists. But, nope, doesn’t feel the same. The guitar is nice. The bass is magical. So, the saying is true: Bass: like a guitar, it much cooler! ",
            "date": "Answered May 30, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maria Ryoush",
                    "user_href": "/profile/Maria-Ryoush"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taylor Werner",
                "href": "/profile/Taylor-Werner-4"
            },
            "answer_text": "I believe bass is a totally different entity from guitar. Can a guitarist pick up a bass? Sure but it won’t really make them a bassist and it may become obvious to actual bass players right off the bat that this person is primarily a guitarist. That being said no bassists are not failed guitar players because of the reasons aforementioned above. There are many bassists who put in their own unique style to further define the instrument as its own. ",
            "date": "Answered April 7, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Shelton",
                "href": "/profile/David-Shelton-27"
            },
            "answer_text": "A select few are, but I wouldn't say failed. Maybe just not incredibly efficient at guitar. That said a “real” bassist is completely different. I've seen people play bass like EVH plays guitar. ",
            "date": "Answered April 12, 2020",
            "views": "40",
            "upvotes": "0"
        }
    ]
}