{
    "title": "Are there too many music artists out there? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Singer",
                "href": "/profile/John-Singer-59"
            },
            "answer_text": "Absolutely! The thing with the 50s, 60s, 70s, 80s and up to late 90s was that you had a guard called a major label that made sure only quality talent got to be seen and heard. Although major labels ripped you off and it was in essence signing your life away, they had a knack for picking out artists that showed promise and were marketable. Those are the artists you see like: Elvis, Frank Sinatra, Hendrix, Beatles, Led Zeppelin and basically every band that is a house hold name with fame and fortune. Back then music was important and it meant something to people. Essentially, there weren’t that many bands around. Ultimately, if you weren’t signed to a major label then nobody heard about you and it was almost like you didn’t exist. In the last 20 years what has happened due to the internet is that we live in a connected world where we know about everything that is happening everywhere. In a lot of ways this is detrimental to new artists and very beneficial to old artists. For older artists that got famous before 2000, when Major labels still gave out those huge record deals, it is awesome because they can talk to their fans in newer ways and it just makes their brand stronger. For new artists it is not so good because you are fighting with 30 million other bands and musicians for attention. So what has happened is that there is no more a filter or major label in place who only allows what sounds good to reach the masses. Today, reaching the masses means going on the internet, right? So what would have been an optimum model is to not allow just anyone to post a youtube video or have a social media page. It should have been controlled to the point where you had to be good, different and somewhat original or just be somebody to get to put your content out to get that level of exposure. I know it sounds weird but when you have no filter what happens is that social media and youtube is filled with crap to the point where real artists who could potentially use that medium to gain new fans get lost in the mix. The result now is that music itself got devalued because there are literally a 1000 clones of Adele on YT and other artists. So today the result is that it is all about the image because if you can’t prove a massive following on social media and youtube, a major label won’t sign you and the people only follow you based on your image. The flip side of this is that if you can get millions of followers on social media, you don’t even need a major label but if you want fame only a major label can give you that. Ultimately, what has happened is that today anyone can play guitar or sing. The competition is crazy. If you’ve seen American Idol you know that thousands of people audition per city. No one wants to make art anymore, all they want to do is become famous and rich. In the old days, there was in essence a scene and everybody supported everybody else without judging too much. Today if you play a show it is all about who was better than who and not about just enjoying the show and checking out all the bands. It is 100% ego driven. Also the fact today is that, singing and being a musician is not special anymore, just about anyone can do it by taking lessons on YT. lol. When everybody is good and the competition is tough then for someone to rise to the top, the decision has to be based on other things besides just singing. If you are deemed marketable, then it is not really necessary to be able to sing great. So music is in a awkward place right now where even if you are extremely talented, you could get ignored. If you watch singing shows, they turn it into a contest where it is purely about how well you sing and most importantly your image and not about creating music or art. I actually gave up trying to perform live because it just became about who is better and not about just enjoying all the acts and art that goes on. Today most ‘new’ artists are 100% about FAME. ",
            "date": "Updated May 3, 2020",
            "views": "33",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kieron Jones",
                    "user_href": "/profile/Kieron-Jones"
                },
                {
                    "user_id": "Aeternam Band",
                    "user_href": "/profile/Aeternam-Band"
                },
                {
                    "user_id": "Miloš Jeremić",
                    "user_href": "/profile/Miloš-Jeremić-2"
                },
                {
                    "user_id": "Ema Chuku",
                    "user_href": "/profile/Ema-Chuku"
                },
                {
                    "user_id": "Curt Hedges",
                    "user_href": "/profile/Curt-Hedges"
                },
                {
                    "user_id": "Ashutosh Abhijeet Nanda",
                    "user_href": "/profile/Ashutosh-Abhijeet-Nanda"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Attie",
                    "user_href": "/profile/Attie-1"
                },
                {
                    "user_id": "Hussain Memon",
                    "user_href": "/profile/Hussain-Memon-4"
                },
                {
                    "user_id": "Jose Juan Rivera Reyes",
                    "user_href": "/profile/Jose-Juan-Rivera-Reyes"
                },
                {
                    "user_id": "Kit Krash",
                    "user_href": "/profile/Kit-Krash"
                },
                {
                    "user_id": "Nick Borrego",
                    "user_href": "/profile/Nick-Borrego"
                },
                {
                    "user_id": "Tony Hooper",
                    "user_href": "/profile/Tony-Hooper-2"
                },
                {
                    "user_id": "Ishay Sommer",
                    "user_href": "/profile/Ishay-Sommer"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-1473"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Arya Padhye",
                    "user_href": "/profile/Arya-Padhye-1"
                },
                {
                    "user_id": "Richard Garrett",
                    "user_href": "/profile/Richard-Garrett-4"
                },
                {
                    "user_id": "Erik Nordquist",
                    "user_href": "/profile/Erik-Nordquist"
                },
                {
                    "user_id": "Mejo Joseph",
                    "user_href": "/profile/Mejo-Joseph-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Wasinger",
                "href": "/profile/Brian-Wasinger"
            },
            "answer_text": "That’s an interesting insight. However, I don’t know if there’s a way to answer it definitively. On one hand this could be a result of the fact that it’s easier than ever for recording artists to distribute their music, in many cases completely for free. Along these same lines it’s also easier for people to record their own music. Anyone with a Mac and a usb microphone has a recording studio in their home. On the flipside we’re also more aware of all these artists because of the internet. I remember being in high school and looking through these giant books at the local record store for albums to special order. It was the only way to get some of this more “obscure” music. Now I can literally sit here while I’m typing and have access to way more music than I could have ever dreamed of back then. But getting back to your original question of there being too many artists. I’m not totally sure what you mean by ‘too many.’ The world has always been flooded with artists with questionable talent. Now, maybe what you’re asking is whether there are people doing it just for attention or fame or whatever. I guess that’s entirely possible, especially in a world where twitter followers are almost literally currency - at least in the entertainment industry. The bottom line is that society seems to be progressing in ways and at a rate that is almost impossible to track, much less predict. I had an idea years ago for a movie (probably around 2003 or 2004) about a world where everyone had their own reality show (that was just how we lived). The result was that we could no longer tell what was truly real or not anymore. And there were murders being committed that we couldn't solve because people were claiming to be the ones committing them solely for the sake of ratings. I never really developed it any further than that. But I think about that all the time now because it almost feels that something like that is starting to happen now which freaks me out for obvious reasons. I guess I kind of got sidetracked there, but hopefully this gives somewhat of an answer. ",
            "date": "Answered June 27, 2016",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Curt Hedges",
                    "user_href": "/profile/Curt-Hedges"
                },
                {
                    "user_id": "James Owens",
                    "user_href": "/profile/James-Owens-39"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alfdkjs"
                },
                {
                    "user_id": "Luke Norris",
                    "user_href": "/profile/Luke-Norris-63"
                },
                {
                    "user_id": "Eninotna Martin",
                    "user_href": "/profile/Eninotna-Martin"
                },
                {
                    "user_id": "Marcos Alvear",
                    "user_href": "/profile/Marcos-Alvear"
                },
                {
                    "user_id": "Arthur Holmes-Brown",
                    "user_href": "/profile/Arthur-Holmes-Brown-1"
                },
                {
                    "user_id": "Manyaga Beatrice",
                    "user_href": "/profile/Manyaga-Beatrice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah",
                "href": "/profile/Hannah-208"
            },
            "answer_text": "T.S. Eliot, the modern poet, once said: “One writes, because one has to write.” Any truly valuable contribution in any industry, whether that be music, art, literature, medicinal chemistry, etc. is driven by a deep and genuine need to do what it is that the individual enjoys and does well. If you are more infatuated with the raw investigation of your practice, it will naturally unfold itself into something remarkable. Needless to say, there are naturally a lot of people in the world who also just want recognition for recognition’s sake among other superficial incentives (and will inevitably find themselves unsatisfied with this). There are a number of factors to why that is— but ultimately this is irrelevant. To answer your question, however, no: there are not ‘too many music artists out there’. If you take one piece out of something, the whole structure falls. The ones who lack the true need to do the things that they do will start over somewhere else anyway. They fall into that consequence alone. ",
            "date": "Answered June 28, 2016",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andile Wiseman",
                    "user_href": "/profile/Andile-Wiseman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Pate",
                "href": "/profile/Drew-Pate-2"
            },
            "answer_text": "No; more people than ever are making music and having their music listened to. With platforms such as Spotify, niche, underground artists can now be discovered at no cost to the end user. As such, music is much more accessible. With this accessibility, it's nice to have many artists to discover. Also, more artists means more diversity. Today, there are more people making more creative and unique music than ever before. However, no matter how many artists are out there, if creativity is fueling their work, I'd certainly say that that is a good thing. And no matter how many msucial artists are out there, I'd say that there would alwaya be innvoative, interesting acts to listen to. ",
            "date": "Answered June 27, 2016",
            "views": "981",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haniff D'Jazmach Wilson",
                    "user_href": "/profile/Haniff-DJazmach-Wilson"
                },
                {
                    "user_id": "RJ Bertc",
                    "user_href": "/profile/RJ-Bertc"
                },
                {
                    "user_id": "Sean Peckham",
                    "user_href": "/profile/Sean-Peckham-3"
                },
                {
                    "user_id": "Andile Wiseman",
                    "user_href": "/profile/Andile-Wiseman"
                },
                {
                    "user_id": "Hussain Memon",
                    "user_href": "/profile/Hussain-Memon-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Hoppe",
                "href": "/profile/Doug-Hoppe"
            },
            "answer_text": "I think there are too many music artists out there with expectations of being a famous superstar and making a lot of money — they build up false expectations; but there are probably not enough amateur people performing for fun and more people should practice music, instruments, improvisation and also learn to read and write music as well, it is not only enjoyable but opens up new worlds, and is probably good for developing your mind, your creativity, and also your physical coordination. Of course there is a ton of bad music out there, there always was throughout history, it’s just easier to make it and expose others to it using modern technology. ",
            "date": "Answered June 27, 2016",
            "views": "542",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Collette Mclafferty",
                "href": "/profile/Collette-Mclafferty"
            },
            "answer_text": "Being famous and being a music artist are two very seperate things… That occasionally meet in the middle. Nah, I don't think there are too many artists… There is no greater joy then going in the studio and/or making a music video. There is something for everyone and a few billion people on the planet. Having choice when it comes to music is a great thing. Real music lovers won't have a problem worh having a plethora of artists to choose from. If anything the appearance of “\"too many artists” in my opinion comes from some exposure outlets promoting too few artists. ",
            "date": "Answered June 27, 2016",
            "views": "987",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Willem Joseph",
                    "user_href": "/profile/Willem-Joseph"
                },
                {
                    "user_id": "Clay Mottley",
                    "user_href": "/profile/Clay-Mottley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanika Pandit",
                "href": "/profile/Sanika-Pandit"
            },
            "answer_text": "Well, if the song is not loved by people, it will soon be forgotten regardless of why it was released (to earn extra money, like you said). I do believe that there are many artists so it can be a little time consuming to sift through a gazillion songs to find ones you like. However, because we have more artists, we have more variety. And that’s cool. You get to explore new genres. You can pick and choose songs from all over the place for your playlist. ",
            "date": "Answered June 27, 2016",
            "views": "806",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chagall Sierra",
                    "user_href": "/profile/Chagall-Sierra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry English",
                "href": "/profile/Larry-English-3"
            },
            "answer_text": "there have always been people trying to make easy millions it;s just that now with the internet, it is easier to be aware of them all. like always, most if it is worthless people try because they see talentless people who do make a lot, not realizing these people are basically just lucky, and not very numerous either. also this ‘job’ requires no education, or expensive equipment, or even sweat, to get started. so the entry bar is low, a lot of people try it. wle ",
            "date": "Answered June 27, 2016",
            "views": "466",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Garvey",
                "href": "/profile/Ben-Garvey-3"
            },
            "answer_text": "Music has changes course to be about connecting to audiences and sub cultures. What this means is there has never been a greater demand for more artists, as well as giving rise to a creative engine that knoes no boundaries. therefore, we actually have a shortage of artists. ",
            "date": "Answered June 27, 2016",
            "views": "456",
            "upvotes": "0"
        }
    ]
}