{
    "title": "Are you playing guitar in P4 tuning? - Quora",
    "tags": [
        "Guitar Alternate Tuning",
        "Guitar Tunings",
        "Playing Guitar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guillaume Kuc",
                "href": "/profile/Guillaume-Kuc-1"
            },
            "answer_text": "I am a P4 guitar player. More standard than standard To me this tuning is more of a standard tuning that the standard tuning is. The guitar just feels right, as it should be. All strings are now distant by a perfect fourth, no exception to the rule. There isn’t any inconsistency any more. Every shape that we learn on this tuning is now movable both along and across strings while still retaining its sound. Any kind of logic can be displaced anywhere on the neck and still work. A same fingering always produces the same intervals. This means that the connection between our inner voice and our fingers happens way way quicker. There is a direct translation between a sound and its fingering. Intuition develops faster on this tuning. The interval map gets ingrained pretty quickly and we rely less on rote learning as a consequence. Faster learning, better learning To give a number, there is approximatively 3 times less learning to do on Perfect Fourth to achieve the same result. For instance, a simple triad in root position has 3 possible fingerings on standard EADGBE tuning ; one starting on the E or A string, an other starting on the D string, and yet another on the G string. The same fingering is movable across all strings in P4 tuning.  However the reality is that it’s even faster than that since any confusion is gone. The understanding of various musical concepts is facilitated since they can be seen more easily on the neck. For that reason alone, I would advise any guitarist to at least spend some time on P4 tuning, in the same way that other instrumentalists are often advised to spend time on the piano. P4 tuning is much more of an educational tool than standard could ever be when it comes to music theory. Other regular tunings such as M3 (all major thirds), or P5 (all perfect fifths) could potentially do the job equally well, but this one is close enough to standard so that the transition can be done very quickly and the guitar was originally designed with fourths in mind. This is a tuning for improvisers and composers. In fact, when it comes to writing music, the guitar tuned in perfect fourth has the same visualizing potential as the piano does. No problem with chords The main reproach that is made to P4 tuning is that it hasn’t much to offer on the chord department. I found that to be largely untrue. Not only untrue but instead P4 tuning freed up my playing both for single lines AND chord improv’. Bar chords and classic open chords are indeed lost and some (not all) chords are indeed easier to play on standard tuning. However they were so much harder to see, that I wasn’t playing them anyway when improvising. I think of the P4 guitar as an hybrid between a piano and a bass when it comes to chord playing. The bass has to spell every note of a chord one by one to get its sound across, and pianists use upper-structure triads all the time with their right hand. One approach I like to use on P4 tuning is to spell big chords by playing chunks of said chord in a row, using upper-structure triads and inversions. This has the advantage of creating chord motion and result in a much less static sound. That’s one approach, but I’ve seen other P4 players find great success while using bigger full sounding chords which means that the option is there! Downside : repertoire All in all, the only real downside to switching to P4 tuning is the loss of some repertoire written with the standard tuning in mind. Very often it would need arranging before we can play it. However, if we take the time to learn to read standard notation, we’re not limited to tabs or even guitar music any more, we can now find inspiration coming from all instruments. All in all, for guitarists with an interest for improvisation or composition, I’d say go ahead and try this tuning. ",
            "date": "Answered June 20, 2018",
            "views": "376",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mantas Ptakauskas",
                    "user_href": "/profile/Mantas-Ptakauskas"
                },
                {
                    "user_id": "Guitar Dev",
                    "user_href": "/profile/Guitar-Dev"
                },
                {
                    "user_id": "Chris Gu",
                    "user_href": "/profile/Chris-Gu-38"
                },
                {
                    "user_id": "Diego Didier Andrés Gatica Leiva",
                    "user_href": "/profile/Diego-Didier-Andrés-Gatica-Leiva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Slocombe",
                "href": "/profile/Tom-Slocombe"
            },
            "answer_text": "No, I prefer standard tuning. P4 offers the theoretical advantage of simplifying fingerings because the intervals between the strings are all the same. However, standard tuning allows you to play a major triad by playing the second, third, and fourth strings at the same fret. I think being able to play a major triad this way is more important. Learning the fingerboard and developing the ability to intuitively play what you hear in your mind is difficult. I might have a different opinion if I had used P4 tuning from the beginning of my involvement with guitar. For decades, I wondered why they had a major third between the second and third strings. But now I believe I have the answer, and I’m inclined to think standard tuning is a better approach. However, tuning the guitar to P4 is easily done. Finicky people might complain about the altered tension on the strings, but people change from one tuning to another frequently, such as the “double dropped D” tuning. Try the P4 tuning and see if you like it. Stanley Jordan uses the all-fourths tuning, but he plays the guitar almost like a piano. (If you haven’t heard him play by tapping on the strings, prepare to have your mind blown!) I hate to even think it, but I began playing guitar over 50 years ago, and I’ve decided that instead of trying to learn only the best way to do it, it’s better to learn several ways and have them in your repertoire. Yes, it’s more work, but playing the guitar is a lifelong project. Until you master more than one approach, you don’t really know what is best for you. And you sometimes learn that it’s good to be proficient at more than one method. ",
            "date": "Answered December 8, 2016",
            "views": "680",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scott Hunter",
                    "user_href": "/profile/Scott-Hunter-138"
                },
                {
                    "user_id": "Ed Ardzinski",
                    "user_href": "/profile/Ed-Ardzinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "I don’t and have not played with all-fourths tuning with guitar. I would like to try it but the last time I did (for like 5 minutes just to see how it’s like), the string tension felt weird. I also currently don’t have the time to study the tuning, especially with regards to chords, so I refrain from it. I could probably get away with it if we’re talking lead and melodies, as the tuning is used in bass, as well as this app I use called Mugician, the predecessor of Geo Synthesizer, whose layout is also based on the bass and therefore is also tuned in perfect fourths across all 11 “strings”.  ",
            "date": "Answered December 8, 2016",
            "views": "373",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miloš Milohanović",
                    "user_href": "/profile/Miloš-Milohanović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Jones",
                "href": "/profile/Philip-Jones-76"
            },
            "answer_text": "All fourths? Never heard of it. I just looked it up in Wikipedia. It sounds very interesting. I have lived in the classical guitar world for a couple of decades. The wildest things I usually do is tune the sixth string down to D or tune the third string to F# for playing lute literature. I have a spare guitar. I think I will tune it in P4 and see how it goes. Thanks for the tip. ",
            "date": "Answered December 8, 2016",
            "views": "223",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miloš Milohanović",
                    "user_href": "/profile/Miloš-Milohanović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Abell",
                "href": "/profile/Christopher-Abell-8"
            },
            "answer_text": "No. I’ve thought about it. While it works for bass (4 strings), one would lose the high E at the top and have to rethink every chord again. I wonder if for solos it would make string-skipping uniform.. But, I’ve never done it. I don’t even like 7-string guitars… ",
            "date": "Answered December 8, 2016",
            "views": "170",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miloš Milohanović",
                    "user_href": "/profile/Miloš-Milohanović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben O'Neal",
                "href": "/profile/Ben-ONeal-1"
            },
            "answer_text": "I stick with standard tuning. It’s what I know. There is plenty of ways to spice up your sound with effects or tone adjustments. Muscle memory is a powerful thing, and alternate tunings can lead to playing off key in the heat of the moment, especially while jamming or improv. ",
            "date": "Answered December 11, 2016",
            "views": "164",
            "upvotes": " Answer requested by Miloš Milohanović",
            "upvoters": [
                {
                    "user_id": "Miloš Milohanović",
                    "user_href": "/profile/Miloš-Milohanović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Fouracres",
                "href": "/profile/Mike-Fouracres"
            },
            "answer_text": "Sorry no experience of this tuning. I play in open G or D mostly. I will have to give it a look. ",
            "date": "Answered December 8, 2016",
            "views": "86",
            "upvotes": " View 1 Upvoter "
        }
    ]
}