{
    "title": "Are people who hate music normal? - Quora",
    "tags": [
        "People",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitin K",
                "href": "/profile/Nitin-K-90"
            },
            "answer_text": "Yes. It is pretty much normal. I am now sharing one of my answers which explains a similar thing. Nitin K's answer to How can some people not like music at all? I am a music addict and I think there a lot of things that go through my mind when I am listening to music. They keep flashing up in my mind and sometimes change the way how I feel the music. Some songs change things instantly. The way people hear music is very subjective. It varies vastly. For a musician, it may lead to a understanding of the various dynamics of the song like the expressions (softness, loudness, changes..etc), the tempo, the mood (of course, they enjoy the song too) and so on and so forth. For some other people It can be a resonating experience, it can change they mood instantly, it can make them laugh or smile or cry. But music is not all that can create this. People have their own way finding things. For example, some may find reading or writing or talking or painting to be must more exhilarating than music. It is a matter of perception. I've known people who don't listen to the music of a song but pay interest to the lyrics a lot more. It is not that they cannot enjoy music or have no ability to. It is just that what they feel is completely different. Recently I saw this TED talk that changed the way I thought. (The transformative power of classical music) It goes on to say that everyone can enjoy music and everybody has an ability to do so too (so, no problem with them that). But I guess, It depends on enjoyment. We tend to do things what we love to do. People may have something else where their heart lies in and music could be just another thing for them (like how writing or reading is for another). If one insists someone who does not read much to read a lot, he might find it a disturbance too. People have their own things and you have to go live with that. Maybe you could ask one other what they like and convert it into a day of more fun. ",
            "date": "Updated March 18, 2018",
            "views": "22",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ringo Joy",
                    "user_href": "/profile/Ringo-Joy-2"
                },
                {
                    "user_id": "Realeboga Macomo",
                    "user_href": "/profile/Realeboga-Macomo"
                },
                {
                    "user_id": "Hiiu A",
                    "user_href": "/profile/Hiiu-A"
                },
                {
                    "user_id": "Nishant Kumar",
                    "user_href": "/profile/Nishant-Kumar-131"
                },
                {
                    "user_id": "Yazid Aji",
                    "user_href": "/profile/Yazid-Aji"
                },
                {
                    "user_id": "Daniel Catalan",
                    "user_href": "/profile/Daniel-Catalan-1"
                }
            ]
        }
    ]
}