{
    "title": "Are there any recommended K-pop dance to dance to for K-pop company auditions? - Quora",
    "tags": [
        "Dance (activity)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Min Yoonji",
                "href": "/profile/Min-Yoonji-18"
            },
            "answer_text": "Well, based on my experience you have to WOW the judges so you can get accepted. For Girl Groups ONLY ( sorry Boy groups are hard to impersonate for me) Rumor by Produce 48  (G)-IDLE HANN or LATATA   EXID I LOVE YOU  Egotistic by Mamamoo  SIREN SUNMI  LA VIE EN ROSE IZONE  There's more from Chungha,RED VELVET, and other songs from the artist I chose from above. The reason I didn't choose any popular groups like Blackpink and TWICE is because of their popularity. I'm sure if you did choose from their dances surely someone will have the same chosen dance as you. For my experience in my club if someone has the same song chosen as the other they will choose who's version or who's dancing is better. Although these people or groups I chose are also popular like IZONE,Mamamoo and GIDLE these groups will give you an advantage since our KPOP president said there's a higher chance you'll get accepted if you dance good OR you dance to unpopular groups. If you dance to unpopular groups they will say or think you know a lot about KPOP. Another reason you shouldn't dance to popular songs is that some judges would think you only know about popular groups and have no knowledge of older and underrated KPOP groups. Yes, some aren't fair but it's just how it works. TIPS FOR PERFORMING If you dance to these KPOP groups you need to act like them, like your part of their group. If you dance to Mamamoo or EXID be fierce If you dance to IOI, TWICE, the velvet side or RED VELVET act cute and smile If you dance to Sistar act cute but sexy and smile. Notice in their MV that they act sexy but they look cute while doing it. If you want like BP and (G)-IDLE then you need to have swag while you dance. Mouth the lyrics. You need to act like your the one singing the song. Expression. Like I said imitate the vibe your chosen dance is.Observe everything from the group dancing and imitate it while your performing. Enjoy. ",
            "date": "Answered December 25, 2018",
            "views": "345",
            "upvotes": " View 208 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prakriti Basnet",
                    "user_href": "/profile/Prakriti-Basnet-15"
                },
                {
                    "user_id": "Arisa Aoki",
                    "user_href": "/profile/Arisa-Aoki"
                },
                {
                    "user_id": "Meithzan Javier",
                    "user_href": "/profile/Meithzan-Javier"
                },
                {
                    "user_id": "Kpop/Kdrama Addict",
                    "user_href": "/profile/Kpop-Kdrama-Addict"
                },
                {
                    "user_id": "이 Luxury",
                    "user_href": "/profile/이-Luxury"
                },
                {
                    "user_id": "Rineko Fukosa",
                    "user_href": "/profile/Rineko-Fukosa"
                },
                {
                    "user_id": "Shalini Gupta",
                    "user_href": "/profile/Shalini-Gupta-1410"
                },
                {
                    "user_id": "Purple Milk",
                    "user_href": "/profile/Purple-Milk"
                },
                {
                    "user_id": "Lisa Myo",
                    "user_href": "/profile/Lisa-Myo"
                },
                {
                    "user_id": "Ice Bubbas",
                    "user_href": "/profile/Ice-Bubbas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jowen Lim",
                "href": "/profile/Jowen-Lim"
            },
            "answer_text": "(I’m going to just say that actually, they don’t need you to dance Kpop just because they are a Korean entertainment company. If english songs work better for you, they don’t really care. After all, Kpop is not a genre of dance, only an expression of it. So you should do what best expresses yourself. But anyway to answer the question…) From a dancing perspective, I recommend choosing songs with strong choreography. Reason being that strong choreography really tests your body’s flexibility, adaptability and the coordination/isolation of your various muscle groups performing these dances. However, also bear in mind that not every song is particularly difficult. Examples that come to mind are Orange Caramel’s songs; they aren’t particularly difficult, and you wouldn’t really show any ability that causes them to give you a second look. For this reason, many new idol groups (particularly boy groups) have members with experience in ‘flashy’ dances, like hiphop and B-Boying. Regarding freestyle dances, I’d say prepare a bit, but don’t expect too much about it. Shows like MixNine, PD101, etc tend to show people asking for (and receiving) random songs to ‘test’ their dancing skills. The reality is that it doesn’t really show much, and is just more footage for the PDs to show people that they like so. If you’re good, you’re good, and usually the people observing will know. Remember that they are creating a Kpop group that has dances choreographed for them. Creation isn’t as important as the ability to pick up quickly in the Kpop world. ",
            "date": "Answered December 7, 2017",
            "views": "39",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakrati Buj",
                    "user_href": "/profile/Prakrati-Buj"
                },
                {
                    "user_id": "Lisa Myo",
                    "user_href": "/profile/Lisa-Myo"
                },
                {
                    "user_id": "LAcey JAne",
                    "user_href": "/profile/LAcey-JAne-33"
                },
                {
                    "user_id": "Irene Seojin",
                    "user_href": "/profile/Irene-Seojin"
                },
                {
                    "user_id": "【ПIΛΉ.】",
                    "user_href": "/profile/ПIΛΉ"
                },
                {
                    "user_id": "Adrii Tan",
                    "user_href": "/profile/Adrii-Tan"
                },
                {
                    "user_id": "Aflin Demi",
                    "user_href": "/profile/Aflin-Demi"
                },
                {
                    "user_id": "Kyle Franco",
                    "user_href": "/profile/Kyle-Franco-8"
                },
                {
                    "user_id": "Frania Kang",
                    "user_href": "/profile/Frania-Kang"
                },
                {
                    "user_id": "Taru Singh",
                    "user_href": "/profile/Taru-Singh-22"
                }
            ]
        }
    ]
}