{
    "title": "Are there any alternatives to Gmajor on the ukulele to make it easier? - Quora",
    "tags": [
        "Ukuleles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Boucher",
                "href": "/profile/Ted-Boucher"
            },
            "answer_text": "The other answers are on point. I am going to re-emphasize that this is one of the four basic major chord fingerings. It doesn’t get any easier than this. Practice and repetition will make it easy. That’s it. Things only seem difficult because you’re learn them. You’ll have it down soon… ",
            "date": "Answered July 15, 2018",
            "views": "393",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rachel Streich",
                    "user_href": "/profile/Rachel-Streich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Swarthout",
                "href": "/profile/Mark-Swarthout"
            },
            "answer_text": "The standard format is 0-2-3-2. You can use whatever fingering you are most comfortable with, including barring the first 3 strings at the second fret and dropping another finger on the 3rd fret of the 2nd string. A major chord is a I-III-V chord, which means it needs at least one each of the G, B and D notes to create the chord. You can double up any one of the three notes on the ukulele. The 0-2-3-2 are actually playing the notes G-D-G-B. Doubling the root note of the chord (the G) is always a good idea. You can play those notes anywhere on the keyboard, but it is always a good idea to keep them close to each other so you can fret with one hand. ",
            "date": "Answered June 28, 2018",
            "views": "890",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Smurdly",
                "href": "/profile/Bob-Smurdly"
            },
            "answer_text": "I’d just retune the whole thing so it makes sense. Either like the top 4 guitar strings, DGBE, or just in fourths, DGCF. The first would be easier for a guitar player, the 2nd would be easier for picking out general melodies. ",
            "date": "Answered June 29, 2018",
            "views": "257",
            "upvotes": "0"
        }
    ]
}