{
    "title": "Are 16 ohm headphones better than 32 ohms? - Quora",
    "tags": [
        "Ohm's Law",
        "Ohm (SI unit)",
        "Audiophiles",
        "Earphones",
        "Headphones",
        "Sound",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bauers",
                "href": "/profile/Michael-Bauers"
            },
            "answer_text": "If that’s the only difference, than no, they are neither better nor worse. A lower impedance headphone may be more suited for an amplifier that’s more voltage limited than current limited. The reason being that too much impedance, combined with too little peak voltage from the amplifier could result in headphones that don’t play loud enough. That’s never been a concern in my experience, headphones usually play considerably louder than is good for your hearing. A higher impedance headphone could be better combined with an amplifier that’s not stable into lower impedance loads, specifically, that would, for some reason, struggle with a 16 ohm load. I am merely pointing out some of the physics and electronics possible. But in real world use, my guess is that most of the time either impedance is totally acceptable for typical devices. I have noticed that some headphone outputs are crap, such as on laptops. I want an Ibubrofen after an hour or two of listening. But I can’t tell you what their deficiency is. Guessing they simply can’t put out enough power, and are distorting. But would it help to have a higher or lower impedance? I don’t know, sorry. ",
            "date": "Answered February 15, 2020",
            "views": "741",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Heiblim",
                "href": "/profile/Robert-Heiblim"
            },
            "answer_text": "Ohms are a measure of resistance, nothing more. In and of themselves they indicate mostly nothing about the system other than perhaps the amount of power required to drive them. They certainly do not indicate sound quality, build quality or the ultimate pleasure you may have using your headphones. Like all of these audio systems, they are systems which required choices by the system designer. Since audio is delivered in analogue output, these systems are not perfect and require choices and tradeoffs by the product engineers to hit desired levels of performance and/or price. I would suggest you take a listen to headphones, speakers or other audio equipment while playing music you like to listen to and know well. In the end there is a lot of personal choice and preference here and choosing simply by specification is not the best way to find some musical nirvana. ",
            "date": "Answered February 14, 2020",
            "views": "11",
            "upvotes": " Answer requested by Ram Binay Yadav"
        }
    ]
}