{
    "title": "Are there any other guitarists similar to Jimi Hendrix? - Quora",
    "tags": [
        "Jimi Hendrix (musician)",
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenneth Rose",
                "href": "/profile/Kenneth-Rose-16"
            },
            "answer_text": "There are a ton of guitarists who play using his signature licks and style. Stevie Ray Vaughn, Yngwie Malmsteen (for a while) and Eric Gales to name a few. But, as far as being influential goes. Well, that’s another story. If you watch Hendrix playing ‘The Star Spangled Banner’ at Woodstock you’ll see something nobody ever mentions. For a brief moment, Hendrix gets into two handed tapping. I point this out to support the simple fact that there is nothing that has been done with a 6 string electric guitar since Hendrix that Hendrix did not do. There are guys playing 7 and 8 string guitars out there but it isn’t the norm. In fact it’s sort of a cop out seeing as the Chapman Stick has what, 20 strings or something like that. So 7 or 8 strings is still pretty pedestrian in the overall scheme of things. There were guitarists who were contemporary with Hendrix that were just as, if not more, influential though. Jeff Beck was using feedback before Hendrix, Frank Zappa supposedly gave Hendrix his first wah-wah pedal and was an astounding guitarist, Eric Clapton pretty much ushered in the style of rock that Hendrix played, Jimi Page was around before all of them (he was a child star) and was probably the first virtuoso having played on the soundtrack for ‘Goldfinger’ and being very into music theory, Both Curtis Mayfield and Donny Hathaway pioneered the style Hendrix used on ‘Little Wing’ and other songs like that. In fact Curtis Mayfield tuned his guitar F#A#C#F#A#F# which I still can’t wrap my head around. But he said that he was always the best guitarist when it came to playing his guitar because it made everybody else sound so bad when they tried to play it. But there are things you have to keep in mind is that Hendrix was working with a blank canvas. There was no ‘way’ to play rock. Also, Hendrix played with Little Richard, the Isley Brothers (the original guys who recorded ‘Twist and Shout’), Aretha Franklin, Otis Redding and countless others. So, in short, all the other guys were listening to Hendrix before they even knew who he was. ",
            "date": "Answered October 29, 2018",
            "views": "29",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matt Riegel",
                    "user_href": "/profile/Matt-Riegel-3"
                },
                {
                    "user_id": "Gina Tuia",
                    "user_href": "/profile/Gina-Tuia"
                },
                {
                    "user_id": "Jeff Hargis",
                    "user_href": "/profile/Jeff-Hargis-5"
                },
                {
                    "user_id": "Bruno Pires",
                    "user_href": "/profile/Bruno-Pires-20"
                },
                {
                    "user_id": "Jim Asherman",
                    "user_href": "/profile/Vlad-Dragul"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Gillie-Chriosd MacLeòid",
                    "user_href": "/profile/Gillie-Chriosd-MacLeòid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syd Crimston",
                "href": "/profile/Syd-Crimston"
            },
            "answer_text": "What a difficult question. I also wondered whether there is any similar guitarist to Jimi Hendrix or not. One thing I can be sure is there was no similar guitarist before Jimi Hendrix. Hendrix was really unique, and it seems unfair for me people calls Clapton is a god, but not Hendrix. Hendrix should be called a Guitar god before Eric Clapton was called. Anyway, there are many Hendrix alike guitarists after his death, and he truly inspired many wonderful guitarists like Stevie Ray Vaughn, Yingwie Malmsteen, and Robin Trower. They are truly wonderful guitarists in the wake of Hendrix’ footsteps. The footprints of Hendrix and his legacy will be continued as long as human plays guitar. Now, back to the question, I have one specific guitarist who is most similar to Jimi Hendrix even though other people may not agree with me. I know SRV, Yingwie, and Trower can play Hendrix’s tunes like no one else, but whenever I heard Prince on guitar, his guitar sounds like an incarnation of Hendrix in 80’s. It’s a wild child version of Hendrix, and he really rocks the world as Hendrix did. It is a bit of shame his guitar performance was hidden by his popularity in the pop music business. Prince is not only a music prodigy, but also a guitar genius like Hendrix.  It seems it is hard to match a flamboyant musician like Prince to a shy musician like Hendrix, but I can see and hear the similarity between their performance of guitars and their passions at the same time. They are both Wild Things, and made everyone heart beats. He really made my heart beat with his guitar. He is like a Michel Jackson on guitar, and know how music flows with his insanity.  He also knew how to please woman with guitar.  Again, who is the most similar guitarist to Hendrix? The Artist formerly known as Prince who played crazy guitar like diamond and shone like Hendrix. ",
            "date": "Updated May 31, 2019",
            "views": "1",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Matt Riegel",
                    "user_href": "/profile/Matt-Riegel-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Arnold",
                "href": "/profile/Geoff-Arnold-2"
            },
            "answer_text": "Well, when I was entering the rock and roll music field, virtually every guitar player I knew was learning Hendrix licks and songs. I was the odd one out because I didn’t do this. I think you can hear Hendrix’s influence in a lot of players, among whom are Eric Johnson (who has done the tribute thing on Hendrix with others of note), Robin Trower, Eric Gales, John Friscante, Ernie Isley, and so many more. And, in truth, any guitar players listening to rock and roll from the 1970s on was influenced in some fashion by Hendrix. As to similar style? No, not really. Many tried, and Randy Hansen has made a career out of emulating Hendrix through tribute performances of Hendrix material. Some other answers here go into more detail, and cover ground I won’t go over again. Suffice it to say, the further away from the source we get, the less influence there will be. Players today would have to deliberately pursue Hendrix’s style and everything to make him an influence you can detect through their playing. A lot of people learn Hendrix songs, but that is not the same as studying his style, learning his licks, working out how to play them in such a way as to sound like him with deliberate intention, or that in their own playing you hear the direct influence. Hendrix was an innovator in some ways, and this was also part of what made Hendrix different than others of his time, even unique to a degree, and this affected his sound, even the way he approached playing the guitar. I think the real question is: will we ever see the likes of him again, will we see another innovator that changes the game in such a visceral fashion that all subsequent music produced will have been influenced to some degree by this person? We shall see. ",
            "date": "Answered November 10, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "A Name",
                    "user_href": "/profile/A-Name-99"
                },
                {
                    "user_id": "Hervé Maas",
                    "user_href": "/profile/Hervé-Maas-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Chu",
                "href": "/profile/Dave-Chu-6"
            },
            "answer_text": "There are bunches of them. After all, with Jimi being one of the most influential players ever, how can there not be? There was a guy named Randy Hansen whose act was a full-on tribute to Jimi, right down to dressing like him. He might still be doing that, if you want to look him up. I have mixed feelings about people who base their whole style on one person’s playing. If they’re going to do it, at least they should at least admit it. Robin Trower is an outstanding player, and he does acknowledge it. After all, with the exact same instrumentation in his band, the same guitar model, the same types of effects pedals, same amps, and even the same type of clothes for awhile, you can’t exactly fly under the radar. There have been many others influenced by Jimi, such as Frank Marino. My own favorite Hendrix-influenced player is Eric Gales. He is so good, it’s uncanny, and he’s got plenty of his own stuff. He’s also a lefty, like Jimi, but he plays a regular rightie guitar upside down. He says that he’s a natural rightie, but his brother taught him to play that way, which is just crazy. Here’s a little sample:  ",
            "date": "Answered November 2, 2018",
            "views": "14",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Syd Crimston",
                    "user_href": "/profile/Syd-Crimston"
                },
                {
                    "user_id": "Hervé Maas",
                    "user_href": "/profile/Hervé-Maas-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grant Shuman",
                "href": "/profile/Grant-Shuman"
            },
            "answer_text": "Well, I think it kind of depends on what you mean. Other answers have mentioned several players who were inspired by Hendrix’s playing without being essentially a tribute act. The two players who I think best incorporated his musical style, personal style, and showmanship and used them in a unique way are Stevie Ray Vaughan and Prince. That being said, both of those guys had their own very distinct sonic voice, were incredibly talented, and were very influential as well. As an example, Stevie Ray Vaughan brought blues (properly, I guess, Texas blues) back to the forefront in the early 80’s, when it did not, shall we say, have a lot of mainstream popularity. Likewise, Prince infused really good pop/R&B/ funk songs with a virtuosity that was out of place in a lot of music that occupied the same bandwidth in early MTV culture. Vaughan and Prince were, like Hendrix, more than just ace guitarists (or ace everything-ists as Prince was). They also used a lot of the performance elements that Hendrix popularized (mouth guitar playing, behind the back playing, etc.). Hendrix’s legacy also includes changing the way players approached the instrument as an element of performance. The real answer, I think, is there are not many guitarists who are similar in terms of his overall impact. Playing the guitar itself was a pretty standard affair when Hendrix came along. Sure, some people destroyed them (hello Pete Townshend), and some people played them flamboyantly in differing ways (hello again Pete, Jimmy Page, and Chuck Berry), and some people were virtuosos (hello again Jimmy, Eric Clapton, and Jeff Beck). Hendrix took all of that and fused it into an act (I mean that in a positive way) that was previously unseen and, I think, very shocking (in a good way) in its time. It’s hard to put it in perspective now, but the earliest “great” rock guitar players, like Berry, Buddy Holly, and Bill Haley, got big in the mid-50’s. Hendrix came along in about 1966–67. Just do a mental side-by-side of Buddy Holly and Jimi Hendrix playing. That’s a pretty jarring image, and the two were only really separated by a handful of years. And I think that’s the real heart of it. There were truly amazing guitar players before Hendrix (that owed him nothing, while maybe cribbing a bit after the fact), but the overall effect and impact of Hendrix’s stage presence was mind blowing. Here are a couple quotes for emphasis: (1) Eric Clapton: \"He played just about every style you could think of, and not in a flashy way. I mean he did a few of his tricks, like playing with his teeth and behind his back, but it wasn't in an upstaging sense at all, and that was it ... He walked off, and my life was never the same again\". (Keith Shadwick, Jimi Hendrix: Musician, p. 84); (2) Townshend famously told EC in 1967 that “both he and Clapton were about to be put out of business by . . . Jimi Hendrix.” (10 Things You Gotta Do To Play Like Pete Townshend). That’s two of the best guitar players ever to play the instrument talking right there. Now it’s time for full disclosure. I am not at all a big fan of Hendrix. I understand that his playing is outstandingly great. I recognize that he was a very, very skilled songwriter. I believe he was a singularly expressive vocalist. Still, I have never loved listening to his music. Nevertheless, I have been playing guitar for more than 25 years now. At some point or another, a guitarist who is trying (and for me I emphasize the word trying) to be good works through many different players and styles. Everyone does it, and so have I. That includes Hendrix. It would be a dereliction on my part not to glean what I (and again the emphasis is on I) can from his technique. He is one of the building blocks of modern rock guitar, along with those I mentioned, and several I have not (Harrison, Richards, and on and on). In the end, we all play with a finite set of notes and chord combinations. It is how a player chooses to employ them that matters. And, while there is no doubt that Hendrix’s style was rooted in the blues and R&B, he fundamentally changed how people see and play the instrument in ways that are still apparent 5o years later. He may not be alone, but his company is relatively slim in terms of his overall effect on rock guitar playing in general. So, really, there are precious few “similar” guitarists in that sense. [N.b., I made a couple of changes for clarity and so on. The substance was not altered.] ",
            "date": "Updated November 8, 2018",
            "views": "751",
            "upvotes": " Answer requested by Hervé Maas",
            "upvoters": [
                {
                    "user_id": "Hervé Maas",
                    "user_href": "/profile/Hervé-Maas-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Copfer",
                "href": "/profile/Tom-Copfer"
            },
            "answer_text": "NOW there are plenty—because its easier to play —-its actually a game where you pick up a look alike guitar and the fake noises are similar—- for example-who made the light bulb=edison., who invented the computer?? who invented the iPhone———obviously these persons in that time are considered great inventors and thinkers but of course what they invented. have all been improved upon ONLY because of the inventor. Sure guitars today may have better sound quality but the MAIN reason is because of the GREAT<GENiUS INNOVATION OF Jimi Hendrix ",
            "date": "Answered February 17, 2020",
            "views": "284",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve-Irwin-Miller",
                "href": "/profile/Steve-Irwin-Miller"
            },
            "answer_text": "Well, not in originality or his uniqueness. But I can think of two that were accused of or tried to copy his style, and one that could really copy him.The first guy is still active and is Robin Trower, so you might even be able to check him out live. He started out in the original Procol Harum and sounded or played nothing like him. When he went solo he had a whole new sound and was accused of being a Jimi Hendrix wanna be. ( We'd call him a clone today. ) He admits to being influenced by him but that's all. I’ve always liked him though. He's just a fine guitar player but I can also see the criticism. The other guy is a Canadian that is also active today but mostly in Canada now. In the mid 70′s Frank Marino had a band called Mahogany Rush that had a few good albums. He allegedly sounded like Hendrix on them and he also went solo. I only remember hearing him once and I guess he did, but I haven't followed him. I have always meant to check him out more but he kinda got put on the back burner. The last guy was Stevie Ray Vaughn. He could play some Hendrix songs almost note for note; but he was never really dumped on because he also had his own style, of course, and was known mainly from that. I'm sure some other people can come up more but those were the most known right after his death and in the Classic Rock heyday. ",
            "date": "Answered November 10, 2018",
            "views": "443",
            "upvotes": " Answer requested by Hervé Maas",
            "upvoters": [
                {
                    "user_id": "Karoline Dahl",
                    "user_href": "/profile/Karoline-Dahl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Fowler",
                "href": "/profile/Karen-Fowler-29"
            },
            "answer_text": "Are there any other guitarists similar to Jimi Hendrix? My answer is no. Many have copied, learned, studied what he did, etc. but no one is similar to him in the way I’m taking that word to mean. Robin Trower, in some of his solo work, sounded a bit like Hendrix would have sounded if Jimi had never colored outside the lines, so to speak. ",
            "date": "Answered November 5, 2018",
            "views": "228",
            "upvotes": " Answer requested by Hervé Maas",
            "upvoters": [
                {
                    "user_id": "Brian Radford",
                    "user_href": "/profile/Brian-Radford-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Hoffmann",
                "href": "/profile/Peter-Hoffmann-6"
            },
            "answer_text": "Robin Trower incorporates much of Jimi’s tone in his work. His Bridge of Sighs album is the definitive Hendrix knock off. Stevie Ray Vaughan stole plenty of Hendrix licks, and I say this as a compliment. You steal from the best. Check out Stevie’s cover of Come On (Let the Good Times Roll) and compare it to Jimi’s cover of that song on the Electric Ladyland album. Both versions blow me away. ",
            "date": "Answered October 28, 2018",
            "views": "370",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Spenser Gardner",
                    "user_href": "/profile/Spenser-Gardner-1"
                },
                {
                    "user_id": "Jeff Ely",
                    "user_href": "/profile/Jeff-Ely-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Fong",
                "href": "/profile/Kevin-Fong-40"
            },
            "answer_text": "There are a lot of similar guitarists. Hendrix was essentially a blues guitarist who played electric. Eric Clapton and Jeff Beck are good examples of electric blues players from the same time period. Later on, there are very flashy guitar players like Stevie Ray Vaughn who were influenced by Jimi Hendrix. However, the Jimi Hendrix Experience still holds up because the music is simply that good. ",
            "date": "Answered November 1, 2018",
            "views": "434",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Stephen Harris",
                "href": "/profile/Stephen-Harris-122"
            },
            "answer_text": "Frank Marino Robin Trower Jeff Beck Paul Kossoff Joe Walsh George Thorogood Gary Moore Ronnie Montrose Carlos Santana Joe Satrini Yngwie Malmsteen Hate to sound cliche but Hendrix pretty much in league of his own ",
            "date": "Answered April 16, 2020",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Utz",
                "href": "/profile/Sam-Utz"
            },
            "answer_text": "There are some great guitarists who channel Hendrix in their work. I am not going to include Hendrix impersonators or anyone like that: Uli Jon Roth: probably one of the most Hendrix-inspired musicians alive, but with his own virtuosic flair. Robin Trower: Hendrix inspired for sure but more groove and a unique style. Yngwie Malmsteen: Channeled Hendrix through the lens of neoclassical shred. ",
            "date": "Answered December 4, 2018",
            "views": "260",
            "upvotes": " Answer requested by Hervé Maas"
        },
        {
            "author_info": {
                "name": "Adriaan Beiertz",
                "href": "/profile/Adriaan-Beiertz"
            },
            "answer_text": "No. But checkout John McLaughlin who was hired for Miles Davis’ Bitches Brew album mainly as a replacement to Jimi Hendrix who was unfortunately not able to make it due to his untimely death. If you’re looking for guitarists playing Jimi’s songs there are plenty. ",
            "date": "Answered January 4, 2019",
            "views": "152",
            "upvotes": " Answer requested by Hervé Maas"
        },
        {
            "author_info": {
                "name": "David Lesak",
                "href": "/profile/David-Lesak"
            },
            "answer_text": "Off hand, the only guitarist who comes to mind who specifically is known for his Hendrix inspired playing is Robin Trower. Many guitarist have played tributes to Hendrix, as I am sure you already know - across many different genres, even Jazz. ",
            "date": "Answered November 6, 2018",
            "views": "150",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Joseph Petrov",
                "href": "/profile/Joseph-Petrov-1"
            },
            "answer_text": "There are lots of guitarists influenced by Jimi but to me Robin Trower has his groove and tone down pretty damn close . SRV also but to me Stevie had more range of styles . ",
            "date": "Answered November 22, 2018",
            "views": "55",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Brady Renick",
                "href": "/profile/Brady-Renick"
            },
            "answer_text": "This is Eric Gales. He is the continuation of where Jimi left off, without trying to predict where Jimi would have been had he still been alive.  ",
            "date": "Answered November 8, 2018",
            "views": "86",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Mark MacAulay",
                "href": "/profile/Mark-MacAulay-5"
            },
            "answer_text": "Robin Trower has long played in a style similar to Jimi’s. Same equipment, and a Univibe with even more chorus than Jimi’s. Trower hews closer to the blues than Jimi often did, and his vibrato has changed over the years. A fine , intelligent player, and a nice man. ",
            "date": "Answered April 5, 2020",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "CC James",
                "href": "/profile/CC-James"
            },
            "answer_text": "Kiss The Sky - Hendrix Tribute Band The world’s longest-running Hendrix performer who was in Hendrix’s fan club………………..also gives lecture/demonstrations on Jimi ( https://drive.google.com/drive/folders/1lQAi5_yLY9ByjuAacvi_gCvMX3LveraU?usp=sharing ) & can EXCEEDINGLY recreate Jimi’s sound in the studio on all instruments ( Jimy Bleu as Jimi Hendrix Songs ). ",
            "date": "Answered February 16, 2019",
            "views": "202",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Troy Crisswell",
                "href": "/profile/Troy-Crisswell"
            },
            "answer_text": "Sure, there are many one might call similar, but the hard fact is that there’s just the one and only Jimi Hendrix. That’s all there is to it. ",
            "date": "Answered November 5, 2018",
            "views": "32",
            "upvotes": " Answer requested by Hervé Maas"
        },
        {
            "author_info": {
                "name": "Dan Scheffki",
                "href": "/profile/Dan-Scheffki"
            },
            "answer_text": "Simple answer. No. Many have emulated his playing style but none touch what he did with both the guitar and arranging guitars on his albums. He was one of a kind. ",
            "date": "Answered April 19, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Harrison",
                "href": "/profile/Alan-Harrison-27"
            },
            "answer_text": "Frank Marino is still the best AND he sings well whereas most top guitarists know they can’trust do both ",
            "date": "Answered October 31, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samuel Zagarella",
                "href": "/profile/Samuel-Zagarella"
            },
            "answer_text": "No, he was unique and one of a kind. A genius who redefined the playing of the electric guitar. Many have copied his techniques of course, and why not, he taught guitarists around the world a new way. ",
            "date": "Answered October 28, 2018",
            "views": "119",
            "upvotes": "0"
        }
    ]
}