{
    "title": "Are TikToks really social media influencers than YouTubers? - Quora",
    "tags": [
        "Social Media Influencer",
        "Influencer Marketing",
        "Influencers",
        "YouTube Personalities",
        "Influence",
        "TikTok (mobile app)",
        "Social Media Strategy",
        "Social Media Marketing",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rishav Raj",
                "href": "/profile/Rishav-Raj-975"
            },
            "answer_text": "Well, the answer is it depends! On the person, we are talking about. Some tiktoker's are social media influencers they talk about fashion, communication skills, some facts, news and provide values while on the other hand, we have YouTube who does it for fame, you would remember Dinchak puja she wasn't any influencer but got millions of views. So to conclude I would say that it completely depend on the person we are talking about there are numbers of the creator who provide good content on Toktok and deserve to be social media influencers. But yes you can't compare tiktokers and YouTubers they both have different styles, content, and you get value and knowledge go for it irrespect of the platform. ",
            "date": "Answered June 14, 2020",
            "views": "33",
            "upvotes": " Answer requested by Aryan Kumar",
            "upvoters": [
                {
                    "user_id": "Aryan Kumar",
                    "user_href": "/profile/Aryan-Kumar-2418"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shashank Olivkar",
                "href": "/profile/Shashank-Olivkar"
            },
            "answer_text": "NO MEANS NO ACTUALLY TIK TOKERS DOESNT UNDERSTAND THE MEANING OF SOCIAL MEDIA INFLUENCING ONLY DANCING, SINGING AND DOING ANYTHING IS DEFINITELY NOT THE SOCIAL MEDIA INFLUENCING. ACTUALLY INFLUENCERS HAVE TO GIVE THE VALUE TO PEOPLE WHICH CAN BE TURN INTO CUSTOMER. THEY HAVE TO BUILD TRUST AMONG THEM ( CUSTOMERS) HERE ONLY THEY ARE LACKING, AND DOING ANYTHING. DUE TO SUCH ACTIVITIES, THEY LOSE CUSTOMERS TRUST AND YOUTUBERS DONT ",
            "date": "Answered June 14, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter"
        }
    ]
}