{
    "title": "Are ESP guitars good guitars? - Quora",
    "tags": [
        "Acoustic Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rendy Andrian",
                "href": "/profile/Rendy-Andrian"
            },
            "answer_text": "ESP as a company makes several different brands for international and japan market. To simplify my explanation, I focus only on giitar with Esp logo on the headstock. There four type of esp guitar. A custom order guitar which is built by esp custom shop. This is also include Esp artist’s signature guitar. This is the highest quality of esp. They have the best build quality and material. Off course it is also the most expensive. For signature guitar, the price varies.Esp original lineup. This is a non custom guitar in esp lineup. It also has very good build quality and material. As far as I know, its price is more or less the same as esp signature.Esp usa. This lineup is made in usa. It is a select shop guitar which mean you can choose different wood, color, pickup, and hardware color. The spec for each guitar is fixed. So it isn’t a full custom guitar Because this lineup is made by different factory and employee, It is also made a little bit different, but it’s still a very high quality guitar. Its price is also cheaper than precious esp lineup. It is between $3K - $4K.Esp standards. This lineup was discontinued in 2013 and repleced by E-II. This is the cheapest MIJ guitar in esp lineup. This is a good quality guitar. A lot of people dislike it because it doesn’t have esp logo. Some spread false rumour about its quality. Try it yourself if want to know the quality.Bottom line is any guitar with esp logo should be a good to great quality guitar. Off course there always be lemon among it. Try before you buy is always the best way. ",
            "date": "Answered March 9, 2020",
            "views": "882",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shuang Lyu",
                    "user_href": "/profile/Shuang-Lyu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian J. Paez",
                "href": "/profile/Christian-J-Paez"
            },
            "answer_text": "Asia produced guitars have for the longest time been looked down upon as if they were toys, mass produced with crappy materials by people who dont even play are appreciate them enough to use them prominently in their own music. But I must say the korea made LTD’s are surprisingly good, they have extremely good fit and finish and super tight design tolerances. i have two LTD’s in a collection of about 12 electrics that include fender, gibson, ibanez, PRS and a couple customs ) and The ESP’s are the only 2 that ive never had to dial in. They were set up properly right outta the box. Ive never really been a les paul kinda player nor have I ever found one that liked enough to purchase. Always preferred strats or V’s, charvels or Jacksons . Lighter guitars with smaller and more radius to the fretboard than les pauls afforded . Then one year my kids gave me a ESP LTD for fathers day Which wasfrom all appearances ESP’s take on a LES PAUL but the likeness stops there. I must say they executed their version orders of magnitude better than gibson or epiphone did. If you get a chance to try one out, do. Even if you’re not a les paul kinda guy like me. i think the playability and active electronics will blow you away. Real easy and comfortable to play with a head turning big ,crunchy ,growling, rock n roll kinda sound to it ",
            "date": "Answered May 12, 2019",
            "views": "871",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew Jones",
                    "user_href": "/profile/Andrew-Jones-107"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Arnold",
                "href": "/profile/Tim-Arnold-31"
            },
            "answer_text": "I’ve owned three and two were absolutely great. The other one came out of the box just filthy. I mean the strings were just rusted and grimy. The guitar actually stunk like it had been under rancid water for awhile or something. It took some work to clean it up and put new strings on it. I owned my own music shop at the time so I set up all the guitars myself. I didn’t want to go through all the hassle of sending it back cause most things I could fix myself. I had purchased it for my own personal guitar direct from ESP so I did make them aware of the problem and they refunded part of the purchase price. So to make a long story short the only difference between the three was I bought the two good ones from a dealer and the bad one direct from the manufacturer. The good ones were sold by Sam Ash company and had been set up and inspected before shipping . I still have the last one and play it regularly. They are basically very good guitars. The one I got must have slipped through the cracks somewhere. They have one of the fastest slimmest necks I’ve ever played. I hope this helps. ",
            "date": "Answered May 23, 2019",
            "views": "980",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew Jones",
                    "user_href": "/profile/Andrew-Jones-107"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jared Friedman",
                "href": "/profile/Jared-Friedman-16"
            },
            "answer_text": "The ESP Original guitars are made by the same people that make the custom shop guitars and are custom shop quality. The LTD and E-II models are made on an assembly line. That's not to say that that the LTD and E-II guitars aren't good guitars. I think the guitars across the lines are comparable to other guitars in their respective price ranges. The ESP Original line is not just designed with good components and craftmanship, but its also meant to be designed to be their most aesthetically pleasing line as well, so much of the premium you will pay for the Original series will be for those woods, aesthetics and fine attention to detail, over function and general form. That being said, if we ignore the ESP Original and Custom lines and focus on the comparison between E-II series (technically ESP Standards) and LTD 400 or 1000 series, you will find that there is a bit of a quality difference between them and as expected the E-II are towards the top of that range. I was a long time ESP/LTD user for years and having owned an ESP Standard M-II and a LTD M-1000 as well as having extensively used a LTD Elite M-II, I can say that the ESP Standard and the LTD Elite were pretty much on par with one another, but both were noticeably nicer than the LTD 1000 series. Hope this helps, thanks for A2A. ",
            "date": "Answered July 2, 2019",
            "views": "24",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shuang Lyu",
                    "user_href": "/profile/Shuang-Lyu"
                },
                {
                    "user_id": "David Copper",
                    "user_href": "/profile/David-Copper-4"
                },
                {
                    "user_id": "Jason Hom",
                    "user_href": "/profile/Jason-Hom-3"
                },
                {
                    "user_id": "Rendy Andrian",
                    "user_href": "/profile/Rendy-Andrian"
                },
                {
                    "user_id": "Andrew Jones",
                    "user_href": "/profile/Andrew-Jones-107"
                },
                {
                    "user_id": "Paul Reynolds",
                    "user_href": "/profile/Paul-Reynolds-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Blowinski",
                "href": "/profile/Joseph-Blowinski"
            },
            "answer_text": "Yes, ESP are great guitars that cater to shredders that like fast thin necks, flat fingerboards, and high output pickups. I personally am not a fan of EMG pickups. When I bought a mid-level ESP Eclipse, I didn't know what EMG pickups were, and wondered why it sounded like shit in the clean channel. Long story short, I exchanged it (and a few other cheap guitars) for a used Ibanez GB 200 Jazz box (George Benson signature model). So if you don't like EMG's, be aware of that when you purchase an ESP guitar. Some of their high-end models have EMG's as well. ",
            "date": "Answered April 14, 2019",
            "views": "625",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Jones",
                    "user_href": "/profile/Andrew-Jones-107"
                },
                {
                    "user_id": "Jon Jones",
                    "user_href": "/profile/Jon-Jones-219"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Nelson",
                "href": "/profile/Al-Nelson"
            },
            "answer_text": "They range from affordable learner's guitars to awesome. Generally, the ones made in Asia, but not Japan, so Korea or Indonesia, are decent, like Fender Squires and Epiphones. The models made in Japan and the US are top quality. Their custom shop S and T style guitars have had fans among pros that can afford anything, like Ron Wood. While known more for bolt-on designs, their Edwards and especially Navigator vintage style set neck guitars are excellent. ",
            "date": "Answered April 14, 2019",
            "views": "628",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Jones",
                    "user_href": "/profile/Andrew-Jones-107"
                },
                {
                    "user_id": "Curt Hedges",
                    "user_href": "/profile/Curt-Hedges"
                },
                {
                    "user_id": "Laurn Bedingfield",
                    "user_href": "/profile/Laurn-Bedingfield-1"
                },
                {
                    "user_id": "Lance Watson",
                    "user_href": "/profile/Lance-Watson-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Utz",
                "href": "/profile/Sam-Utz"
            },
            "answer_text": "The Japan-made ESP guitars are as good as it gets. Some of the LTD line are ok guitars for the price with nice hardware, but not comparable to the MIJ ones. ",
            "date": "Answered December 3, 2019",
            "views": "172",
            "upvotes": "0"
        }
    ]
}