{
    "title": "Are singing skills more important than having a good voice? Is it possible to improve singing skills? - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyla Grant",
                "href": "/profile/Kyla-Grant-2"
            },
            "answer_text": "To a HUGE extent.  One of the biggest myths out there about creative talent, including singing, is that it's innate.  Nope. I don't have a speaking voice that anyone would associate with being a singer.  Not that it's particularly abrasive, or unpleasant, but you wouldn't hear me speak and think \"singer.\"  I also didn't start singing--at ALL, in public or private--until age 26, in the wake of my young marriage falling apart.  I suddenly found myself alone in a studio apartment on the Upper East Side in Manhattan with nothing to do, no furniture and a lot of pain.  So, I started to sing all the songs I grew up to, that I knew the lyrics to backwards and forwards but had never really sang aloud. In the beginning, my voice had no strength, a weak tone, and a very limited range.  Normally, I would've heard all those flaws and stopped, but not this time, for two reasons:  (1) there was no one around to make me feel self-conscious; and (2) I wasn't singing to become a singer, I was singing to heal my pain, and there was a lot of it.  Since pain and self-healing were my main motivators, I sang without any attachment to whether I was any good.   I sang every day.  In the shower, while I was getting ready.  With the radio, without.  Then I decided to pick up that guitar I'd bought years ago but never touched.  I started YouTubing how to play it.  I got nowhere, so I hired an instructor.  When she heard me sing along with the songs I was learning, she politely refrained from commenting on my not-that-great voice.   Over time, though, something that (to me) seemed miraculous began to happen.  My voice was getting stronger.  I also began to develop a unique tone; it was sort of airy and softened the parts of my speaking voice that didn't sound like a singer.   Then one night at a party, my friends and I were playing \"Rockband.\"  No one wanted to be the singer, so I volunteered.  I sang \"Piano Man,\" like I meant it, because everyone was drunk and hardly paying attention so may as well go for it.  When I finished, a not-that-close friend of mine who was sitting next to me on the couch said:  \"I like listening to you.  Something about your voice makes me feel better.\" That was the only motivation I needed (and note it was very little) to start pursuing singing for real.  I started doing karaoke every other night.  Every date I went on ended up at a karaoke bar.  Still, though, I was singing at bars where everyone was drunk and hardly paying attention.  But, that gave me the freedom to experiment and stretch myself while tasting what it was like to perform in public.  I also got increasing amounts of acknowledgement and positive feedback from those who were paying attention.  Before long, people began assuming I was a professional singer. I then started taking vocal lessons and watching YouTube videos from vocal instructors.  That filled in some missing pieces.  I had stopped taking guitar lessons, but I'd continued learning on my own.  I decided to play and sing in the subway.  Then at open mics around town.  Then I posted a YouTube video of me playing and singing a song, to the utter shock of my friends and family, who had no clue I could sing (because, up until then, I couldn't).  The guitar instructor I used to see was also shocked--she had heard me sing, but at a time when my voice was still developing.   I then began doing auditions for local bands, ultimately becoming the lead singer of a band.   Keep in mind, again, that I didn't sing so much as a note--in public or private--until age 26.  I had no \"natural\" talent and I hadn't been singing since I was 4, or 10, or 12.   The answer to your question, then, is to a HUGE extent. I'll say one more thing, too.  I'm an attorney, and I have a client who is a wildly successful chef.  He never had any culinary training and never displayed any natural talent, though; he simply taught himself and was very dedicated to learning.  In an interview he gave for a magazine, he said something that's stuck with me. People think it's skill that matters most, but, it isn't; it's passion.  If you're fiercely passionate about something, you'll develop the skills to meet that passion.  You just will.  Anyone can build up skills; the passion is the harder thing to generate.   With creative talent, we think it works differently; it's about \"natural\" skills and \"innate\" talent.  No.  It's about practice, commitment and dedication--but you'll need the passion to carry you through and stick with it.  For me, that passion was generated by pain; I had no designs to become a singer.  But as the pain began to lift and I started to really love singing and performing, a passion for singing itself, and what I could do for others with my voice (bring comfort and healing to them, as I had healed myself), was born.   So:  cultivate your passion for singing first.  Connect to why it's important to you, and your vision of who you'll be as a singer.  Then get to work!   ",
            "date": "Answered April 29, 2016",
            "views": "2",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Stephens",
                    "user_href": "/profile/Anthony-Stephens-43"
                },
                {
                    "user_id": "Farid Ghoreyshi",
                    "user_href": "/profile/Farid-Ghoreyshi"
                },
                {
                    "user_id": "Sukhraj Sekhon",
                    "user_href": "/profile/Sukhraj-Sekhon-3"
                },
                {
                    "user_id": "John Gillman",
                    "user_href": "/profile/John-Gillman-1"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Jacky Tasmin",
                    "user_href": "/profile/Jacky-Tasmin"
                },
                {
                    "user_id": "Catherine Joan",
                    "user_href": "/profile/Catherine-Joan-1"
                },
                {
                    "user_id": "Kirigaya Jade Kun",
                    "user_href": "/profile/Kirigaya-Jade-Kun"
                },
                {
                    "user_id": "Ausriv Ausriv",
                    "user_href": "/profile/Ausriv-Ausriv"
                },
                {
                    "user_id": "Alex Wang",
                    "user_href": "/profile/Alex-Wang-330"
                },
                {
                    "user_id": "Lee Seng Long",
                    "user_href": "/profile/Lee-Seng-Long"
                },
                {
                    "user_id": "James Moriss",
                    "user_href": "/profile/James-Moriss"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Newell",
                "href": "/profile/Patrick-Newell-3"
            },
            "answer_text": "It absolutely is possible to improve your skills as a singer. The entire profession of teaching singing relies on the fact that singing skills, called technique, can be taught. The acquisition of technique will absolutely improve your abilities as a singer. Now regarding having a good voice and its importance in singing, it very much depends on the genre you are considering. To perform at the level of a world-class Opera singer, you must have excellent technique, an excellent “god-given” voice, excellent acting ability, and a thorough understanding of a variety of languages. To perform in pop music, you must have an excellent understanding of spoken cadences, know how to tell a story, and be pretty (unfortunately, this is the currently the biggest requirement to having a pop music career). Take Taylor Swift: she is having a long and lucrative career as a Country singer and as a Pop singer; however, her voice is unremarkable in any way, but she uses it very well, and she is very pretty. Her skills as a songwriter and story teller far eclipse the quality of her voice. I don’t know if she studies with a teacher of singing; I suspect her technique could improve drastically, but the unremarkable quality of her voice will remain the same. And that is OK. Think of all the singers in Commercial genres (Pop, Rock, Country, Indie, etc.) that have unremarkable or sometimes awful voices. And yet they are having nice careers. Sometimes it is the flaws in the voice that make a voice interesting or memorable. Technique cannot remove those flaws, but it can help the singer attain the pinnacle of their abilities, while maintaining health and longevity of the voice. ",
            "date": "Answered June 9, 2017",
            "views": "666",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Narendra Kumar Maurya",
                    "user_href": "/profile/Narendra-Kumar-Maurya-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kendrick VanZant",
                "href": "/profile/Kendrick-VanZant"
            },
            "answer_text": "I started practicing seriously in February of this year. I never developed my voice until recently. It started out as recreation and became an obsession. Working at it has had results. I’ve had at least one public performance I was very pleased with, where the audience responded favorably. And I managed to get a role in a Sondheim production. A very small one. (Even that turns out to be a lot of work). Some of my efforts and reflections are documented here: Piano Ghost. The blog is creative nonfiction. With creepy pictures! As with any skill, you develop enhanced neural connections as you repeatedly perform. You develop both muscle memory and increased cognitive facility. As you practice, as you sing and listen to yourself you promote enhanced physical connections with the auditory cortex. Add to this the development of the vocal muscles. I have approached this from my weight-lifting experience. A muscle group is a muscle group. You strengthen it by challenge, but you must be careful about the muscular connections. They develop more slowly. After a while, you can feel your throat begin to deform when you push hard. I sing in tune with my scooter (25 mph is an F#). I narrate my car trips in song. I sing about my tasks as I perform my day job. (I work at home, obviously!) This last actually helps me work more efficiently, and a good thing. All of my extra time goes to singing and piano. Working smart and diligently will lead to improvement in anything. With basic music talent, anyone can learn to sing more beautifully. Most important: I took a few lessons. At $15 each they were well worth it! ",
            "date": "Answered July 27, 2016",
            "views": "465",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Horatio Oswald",
                    "user_href": "/profile/Horatio-Oswald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Smith",
                "href": "/profile/Christopher-Smith-170"
            },
            "answer_text": "Your singing skill is absolutely improvable, like almost anything else you do. There are three aspects to what you have to improve. Vocal strength. The vocal cords are controlled by muscles that can be strengthened. The problem is we can't consciously control these muscles like you can your individual finger muscles (for example.) So you learn tricks to cause your voice to do the thing you need it to do. Ideally, you would have a teacher help you with this, because there is no use experimenting and wasting time when there are known techniques developed over centuries that can help you. It is also very easy to injure yourself if you overuse your voice.Precision. When I was about 11, I was sick for a week. I stayed in bed amusing myself by flipping playing cards into the wastebasket at the foot of my bed. Typically out of 52 cards, I was able to get about 4 or 5 into the basket. By the end of the week my precision had improved so much through practice that I was able to get almost the entire deck into the basket. Pitch in singing is a bit like this. If you haven't done it enough, you don't have enough control to sing reliably in tune. Some people seem to have it right away, but these people are the minority. Everyone else has to practise.Musical interpretation. Every musician has to learn how to phrase and inflect a musical phrase so that it puts the piece across in a way that a listener can appreciate. Again, some people have a better idea of this than others, but everyone can improve. This is largely cultural, but of the three aspects I have mentioned, this is the one that can be most easily taught (and learned!)In all cases, my experience with students has been that guided, focused practice beats natural ability almost every time. A lazy student who doesn't practise, or doesn't practise the right things in the right way, even a gifted one, will almost always be surpassed by the ones who take it seriously.  On the other hand, talent and practice combined are unbeatable! ",
            "date": "Answered April 29, 2016",
            "views": "504",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Moriss",
                    "user_href": "/profile/James-Moriss"
                },
                {
                    "user_id": "Lee Seng Long",
                    "user_href": "/profile/Lee-Seng-Long"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Ware",
                "href": "/profile/Emily-Ware-2"
            },
            "answer_text": "You would be surprised how easy it is to improve your skills. Granted, you must be born with a certain amount of talent such as being able to hold a tune. My tone used to be quite awful, I could not activate my diaphragm, nor could I sing high notes that did not sound like a cat being strangled. However, three years ago, I began taking lessons with a new voice teacher. I was not growing with my former teacher, and felt that I was backtracking in regards to vocal technique. This new teacher has changed my life. I can now sing incredibly high notes with ease, and my vocal technique is the strongest it has ever been. So, yes, your skill can be improved. But it will take work and dedication. You will be frustrated, discouraged. Don’t give up! Sometimes all it takes is the right teacher who can put you in the correct mindset to achieve. ",
            "date": "Answered November 14, 2016",
            "views": "417",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trevor Red",
                    "user_href": "/profile/Trevor-Red"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Jain",
                "href": "/profile/Harshit-Jain-396"
            },
            "answer_text": "Technically both singing skills and voice are important. However, if you are up on singing skills then you can take a little hit on that voice. I am sure that you might have noticed quite some singers with good voice but they just lack the necessary singing skills. Do they sound good? I guess not! A nice voice definitely attracts as it is hard to find and it’s good to have it but not everyone is so blessed and if you don’t have that melodious voice then do something that can turn this weakness into strength. A good idea will be to train it in such a way that you are able to create your own singing style which doesn’t sound bad at all. It’s just one example of what you could do. I am sure that you will be able to figure out many more! ",
            "date": "Answered June 9, 2017",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia T. Lundy",
                "href": "/profile/Julia-T-Lundy"
            },
            "answer_text": "The thing I typically hear when I tell people I’m a singer is, “Your so lucky; I have no musical talent.”. Barring an incurable medical problem, which is rare, we anyone can learn to sing well, & even the best singers have some aspect they can improve upon. The cool thing about singing is that your body is your instrument. If you take care of your body & are willing to learn how to optimize your potential, you can become a better singer. ",
            "date": "Answered November 16, 2016",
            "views": "182",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thara Ravishanker",
                    "user_href": "/profile/Thara-Ravishanker"
                },
                {
                    "user_id": "Saipriya Nagarajan",
                    "user_href": "/profile/Saipriya-Nagarajan-1"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aravind Madhavan",
                "href": "/profile/Aravind-Madhavan"
            },
            "answer_text": "The upside is huge when you start practicing. You can just wake up one day and become a great singer. It takes years of effort to reach a decent level. However, music is one of the most enriching things to learn. If you put in the effort, you will get the results. As simple as that. I have been singing regularly for about 5 years now. This is my current level. I did not get this overnight..  ",
            "date": "Answered April 18, 2017",
            "views": "99",
            "upvotes": "0"
        }
    ]
}