{
    "title": "Are the Jonas Brothers really brothers? - Quora",
    "tags": [
        "Jonas Brothers",
        "Musicians",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jade Welch",
                "href": "/profile/Jade-Welch-1"
            },
            "answer_text": "How weird I was on Joe Jonas’ Instagram when the notification for this question popped up! Yes. They are brothers. Kevin Jonas - Born Paul Kevin Jonas III but known as Kevin. born on 5th November 1987. Married to Danielle Jonas since 2009. They have 2 daughters: Their first child, a daughter named Alena Rose Jonas, was born on 2nd February 2014. Their second daughter, Valentina Angelina Jonas, was born on 27th October 2016. Joe Jonas - Born Joseph Adam Jonas on 15th August 1989. Married to actress Sophie Turner. Joe started dating Game Of Thrones actress Sophie in 2016. They got engaged in October 2017. They married in Las Vegas, Nevada 1st May 2019. They had their second ceremony in Paris, France on 29th June 2019. Nick Jonas - Nicholas Jerry Jonas born on 16th September 1992. In 2018 Nick married his fiancée Priyanka Chopra in a grand wedding. They had multiple ceremonies that lasted a few days. (They have a younger brother Frankie Jonas who was never in the band as he was a bit younger than the 3 of them.) Jonas Brothers - Wikipedia ",
            "date": "Answered September 24, 2019",
            "views": "59",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malvina Kehle",
                    "user_href": "/profile/Malvina-Kehle"
                },
                {
                    "user_id": "Seraphina Doe",
                    "user_href": "/profile/Seraphina-Doe"
                },
                {
                    "user_id": "Dani Bales",
                    "user_href": "/profile/Dani-Bales"
                },
                {
                    "user_id": "Acänixia Käuradénâka",
                    "user_href": "/profile/Acänixia-Käuradénâka"
                },
                {
                    "user_id": "Matouš Polách",
                    "user_href": "/profile/Matouš-Polách"
                }
            ]
        }
    ]
}