{
    "title": "Are Squier guitars better made than Epiphone guitars? - Quora",
    "tags": [
        "Fender Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Barry",
                "href": "/profile/John-Barry-40"
            },
            "answer_text": "My brother and I both had CV50’s. His sounded better than mine. We experimented putting The same electronics into different guitars and they sounded different. The richest body being a warmoth. We made sure everything had the same block. It struck us as strange the CV50’s both sounded so different. His sounded great, while mine sounded thing and awful. So I opened mine and started chipping at the Alder only to find it wasn’t a solid piece of Alder but wood chips glued tightly together. He did the same with his to find his was also pieces of Alder? glued together. Still, his sounded better than mine. I started buying all kinds of different Squiers. I had an 80’s Japanese Squier, which was amazing. Two Tone Pro’s from 97ish, which were also fantastic but lacked a vintage finish on the neck. They had beautiful ash bodies. One, Indian Squier which had a beautiful Cedar body but stunk of pungent Indian Rosewood. It smelled bad, like defecation. It also had a horrible fret job. I put a lot of chemicals to get rid of the smell and did a very aggressive fret job. Anyway, the necks on Squier CV50 and CV60’s are decent. About the same as some Mexican strats. I’ve used them on different bodies and had great results. As nice as they are they don’t compare to the Made in America Strats nor the Made in Japan strats. They have better tuners, better wood, better fret jobs, better electronics, better pickups, more rounded necks and better finishes. As far as Epiphones, the difference it similar but I haven’t experimented as much with them but they’re not as good as Gibson Les Paul’s because of wood, finish, polyurethane vs nitrocellulose finish. The tuners on Epiphones are generally horrible, pickups and electronics are not as good, fret job is not as good. The thing about Epiphones is they are usually glued on and not as interchangeable as Squiers. If you’re on a budget and want a decent guitar get a used CV50 or CV60, depending on if you want a rosewood neck or not. If you’re into Gibson, try an Epiphone Les Paul Special II plus Limited Edition. You can pick a used one up for about $120 dollars. The Squiers have retained their value and gone up more than the Epiphones, but these Epiphones are decent. ",
            "date": "Answered May 22, 2020",
            "views": "665",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick Hoffman",
                "href": "/profile/Rick-Hoffman-5"
            },
            "answer_text": "They are both well made guitars. The quality in the lowest priced models in both brands is going to be more variable. But the middle to higher dollar models are usually decent guitars for the money. On the Squier, the Affinity series is the cheapest/lowest quality of the Squiers IMHO - I think the Bullet series is a little more solid than those. The CV, Vintage Modified, and Standard series Squiers are all good enough to gig with - and they’re all easy to modify if you want to make changes. The Epi’s are similar - but I’ve only had a few of those over the years. But again, nothing inherently wrong with any of the up-market versions ($250+). I think the biggest decision you have to make between the two is do you want a Fender-ish feel and sound or a Gibson-ish feel and sound. To me the necks are the big difference in playability - I really don’t like the Epi necks. But that’s just a personal preference and says nothing about the quality or the Epi. Other folks feel just the opposite. No one is wrong, it’s just what do you prefer. If you’re looking used, older models from Korea, Indonesia and Japan are going to be the better quality. But newer models from China can be just as good if that’s what their contract calls for. ",
            "date": "Answered October 2, 2018",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Klein",
                    "user_href": "/profile/Charles-Klein-9"
                },
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                },
                {
                    "user_id": "Paul Odenwelder",
                    "user_href": "/profile/Paul-Odenwelder"
                },
                {
                    "user_id": "Sam Gamgee",
                    "user_href": "/profile/Sam-Gamgee-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "The lowest grade Epiphone guitars are as good as the midrange Squier guitars. While Squier has a reputation for offering beginner models, gigging models, and affordable premium/custom/reissue models (if that makes sense), Epiphone has always put out gig-worthy guitars, with their highest end guitars actually getting into the Gibson and Fender brands territory. So now, it depends on which Squier series is being compared to what Epiphone series. For example, I wouldn’t even bother with the Squier Affinity unless it was a gift for a kid, or something to start a friend with. The Squier Classic Vibe vs one of the Epiphone Standard models on the other hand can become a difficult choice. ",
            "date": "Answered October 3, 2018",
            "views": "937",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paulo Rodriguez",
                    "user_href": "/profile/Paulo-Rodriguez-18"
                },
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Ditzel",
                "href": "/profile/Jason-Ditzel"
            },
            "answer_text": "Epiphone really competes with Made in Mexico Fender branded product, not Squire. Having said that, the top end of the Epiphone and Squire lines are fine instruments! I have an Episode Les Paul Pro and the p/us are fabulous. It has the neck binding and a great maple flame top. My son owns a higher end maple top squire, and that had electronics issues. The neck was good as well as the dressed frets, which IMO, is the #1 thing to consider for a lower end guitar. Nothing a new loaded pickguard didn't fix, btw. It was upgraded to humbuckers. ;-) ",
            "date": "Answered October 2, 2018",
            "views": "677",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nic Bongers",
                "href": "/profile/Nic-Bongers"
            },
            "answer_text": "Not all Squiers are created equal. There’s $90 ones, and there’s $400+ ones. Same with Epiphone, there’s $99 all the way up to $1200 guitars. The best Squiers (classic vibe) are as good as the best Epiphones (custom shop/elitist), and some say they even rival their Fender/Gibson counterparts. ",
            "date": "Answered October 2, 2018",
            "views": "451",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roy Koch",
                    "user_href": "/profile/Roy-Koch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Pyne",
                "href": "/profile/Richard-Pyne-2"
            },
            "answer_text": "On the whole I would say they are. ",
            "date": "Answered July 3, 2020",
            "views": "124",
            "upvotes": "0"
        }
    ]
}