{
    "title": "Are upright pianos worth anything? - Quora",
    "tags": [
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "A well-maintained piano of originally decent quality of manufacture by a skilled team of craftsmen in a respected manufacturer’s factory will always be worth at least as much as was paid for it, and usually far more. The market is skewed by the existence of decent quality digital pianos, which are now the choice for the majority of amateur players, for home use, or for beginner and even intermediate students. This is primarily because they remain much cheaper, are smaller and easier to find space for in a home or small studio environment, offer the option of silent practise with the use of headphones, and do a pretty good job of imitating sound and touch. Skilled and well-qualified pianists will still be happier with a good quality acoustic piano than with any current digital model. There remains a noticeable difference in the way the sound behaves in an open space, and in the way the instrument responds to a skilled touch. A real piano still just feels better. As a result of the decline in piano manufacturing brought about by the growth of the digital market, a traditional acoustic piano is now a very expensive item reserved for the most demanding students and professionals, by live music venues and performers, and by orchestras of course. The extra premium for a new piano now means a good used piano is worth more. The running costs are high, because tuners and technicians are fewer, but the musicians still prefer the real thing. Don’t write them off just yet. There’s a way to go before upright pianos become valueless. ",
            "date": "Answered December 28, 2019",
            "views": "118",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Morgan",
                    "user_href": "/profile/Stephen-Morgan-41"
                },
                {
                    "user_id": "Diego Velasco",
                    "user_href": "/profile/Diego-Velasco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Poropat",
                "href": "/profile/Bruce-Poropat"
            },
            "answer_text": "A upright piano is worth between zero and $30,000, depending on the piano. Ones you see for sale in local ads are typically a few hundred dollars. I was thrilled when a local piano technician said my 1930s Fischer upright, if full restored, could sell for $14,000. I asked how much it would cost to restore… $14,000. I suspect both numbers are much lower—but still about equal. ",
            "date": "Answered December 27, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diego Velasco",
                    "user_href": "/profile/Diego-Velasco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan West",
                "href": "/profile/Alan-West-6"
            },
            "answer_text": "I have heard that they are cheap or even free at present. See if you can grab a good one or two! ",
            "date": "Answered December 27, 2019",
            "views": "12",
            "upvotes": "0"
        }
    ]
}