{
    "title": "As a musician, which famous band member could you replace and in doing so, make the band better? - Quora",
    "tags": [
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Baron",
                "href": "/profile/Tony-Baron-2"
            },
            "answer_text": "Terence “Geezer” Butler from Black Sabbath. I never really thought much of his bass playing. In fact, the LAST time the band ever performed (as on the live DVD “The End”) not only was some of his playing a little out of step with the guitar - some lines I cringed over - but other lines were just hamfisted nonsense; the same aimless noodlings I myself played over 25 years ago, only to be severely brow-beaten by the other band members (garage band days, of course). ‘Well, Tony Iommi didn’t seem to mind!’ some may say. Well, I say - on that last performance virtually all of his guitar solos sounded the same! He booted Ozzy out, hired another singer (Ronny James Dio) who ran circles around his predecessor - in the process making the band write songs differently - only to reinstate Ozzy for their final concert; so loyalty to Ozzy (& his contribution to HM music) aside, I don’t think Iommi has particularly good taste himself (I don’t think much of the drummer Bill Ward, either). Turned into a real Sab-bashing, didn’t it? Whilst stepping off my soapbox, I can prove the above with some videos of what I consider to be some tasty playing - albeit in a different style to BS (except for the lethal ‘Heavy Metal Punk band I was in where we wore stockings on our heads as we gatecrashed a band competition in the early 1990s; here’s a clipping from the local paper).  ",
            "date": "Answered October 5, 2018",
            "views": "136",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "John Miller",
                "href": "/profile/John-Miller-1816"
            },
            "answer_text": "A hard question to answer since it is asked famous band member which means they are famous for a reason. Many bands have weak links such as Gene Simons is not a very good bass player but who in Kiss is a really good musician anyway. If a band is successful with a certain line up you may be able to sound a little better with a better drummer of guitarist but that does not mean the fans will like it or if the band really needs it. Replacing Simmons from Kiss or Nikki Sixx from Motley Crue would not probably ruin the bands. A better question is what members of bands would be better off in a better band. Like Les Bormen was much too good to play with Limp Biscuit. ",
            "date": "Answered January 29, 2020",
            "views": "225",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Swanson",
                "href": "/profile/Eric-Swanson-119"
            },
            "answer_text": "I played bass professionally in the 60s and 70s . I am fortunate enough to have seen many of the great & iconic bands and artists of that era . While I was good , I'm not so arrogant to think I would have improved any of them by replacing their respective bassists but I certainly would have relished and jumped at the opportunity to fill in . ",
            "date": "Answered March 6, 2020",
            "views": "147",
            "upvotes": "0"
        }
    ]
}