{
    "title": "As an aspiring producer, how does one analyse EDM music? - Quora",
    "tags": [
        "Music Producers",
        "Electronic Dance Music",
        "Electronic Music",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hershel Flemming",
                "href": "/profile/Hershel-Flemming"
            },
            "answer_text": "First, listen! Then, listen again. Really, just keep listening. I can’t stress this enough. In EDM, there are really two key things that you’ll need to master: sound design and song structure. Sound design is crafting your synthesizer patches to “sound right” for the kind of song you’re making. Try to recreate sounds that you think are cool. You’ll need to understand what synthesizers are and how they work. Song structure is also very important. While listening to your favorite EDM tracks, count out measures. Pay attention to at which measure the song’s buildup ends, where the breakdown occurs and how many measures it lasts. You’re going to notice that these transitions typically occur at measures which are multiples of 4. EDM is all about manipulating the energy of the audience on the dance floor. The buildups and breakdowns are key to achieving audience participation. ",
            "date": "Answered October 28, 2016",
            "views": "301",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manish Sehgal",
                "href": "/profile/Manish-Sehgal-3"
            },
            "answer_text": "It is helpful to get project packs (like another person here said). Also useful to drop a track into a DAW to look at it and examine the sections. Chop up intro, verse, chorus, build, breakdown, etc. and take notes on characteristics: what is the tempo? what genre(s) would this fall into?what are the characteristics of the main drum elements: is kick long or short, is snare tight or have a tail, what is going on with the hats, are they using other percussion elements (shakers, congas, metal hits, pots and pans, etc.)run it through mixed in key to figure out key signatureconsider the mix: what are the dominant elements, where is the sub coming from —- are they focused on mid basses with an underlying sub, or is it an 808 style boomy kick with a long tail providing the subconsider the sounds / sound design: what keeps it interesting? is there movement on the bass (like all dubstep does), or is it a lot of interplay of different sound elements (complextro), is there a vocal and what is it doing?Of course you can go much deeper. This is a great video both for substance and also to coach you on how to dissect and analyze music:  ",
            "date": "Answered December 9, 2018",
            "views": "301",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tristan Nguyen",
                "href": "/profile/Tristan-Nguyen-2"
            },
            "answer_text": "Keep listening to one producer and all of their collaborations. Once you can identify their songs, move on to other artist. Martin garrix has a very distinct genre and style of music. Or sometimes I use lie down and put music in my ears and not listen to the song, but what makes the song. The first layers of the first chords or kicks that are the basic layouts for a song and notes that make the melody catch that isn't the main melody. Since you're an aspiring producer I wouldn't say take my word for this because I don't produce but since you are an aspiring producer, have some fun and try to replicate sounds that you hear in songs that you've never heard. Chainsmokers also have good breakdowns YouTube videos on their song “don't let me down”. They go in detail and talk about what's in their songs and sounds they point out in their track that you don't even hear. ",
            "date": "Answered August 15, 2016",
            "views": "327",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shalin Shah",
                    "user_href": "/profile/Shalin-Shah-35"
                },
                {
                    "user_id": "Michael Vogt",
                    "user_href": "/profile/Michael-Vogt-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Darling",
                "href": "/profile/Will-Darling-3"
            },
            "answer_text": "In a word: listening. It takes practise, but the more intently you can listen, the more you will uncover. You can also search for tips online, such as “How to make a Future Bass patch”, etc. I like to map out the song I’m analysing in Google Sheets (or my DAW), then translate whatever ideas I have into that structure. I’ve recently written a blog post on it: Calvin Harris Production Secrets - This is What You Came For (ft. Rihanna) I hope this helps! ",
            "date": "Answered October 31, 2016",
            "views": "229",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Kim",
                "href": "/profile/Ryan-Kim-256"
            },
            "answer_text": "Learn some theory first , than play the song at normal speed and try to listen for some sidechain, and then mess with the eq to listen to the chords and then the bass. try to replicate them on your DAW to find a pattern. ",
            "date": "Answered April 7, 2018",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Euan Zhang",
                "href": "/profile/Euan-Zhang"
            },
            "answer_text": "If you have a bit of money to spare, go to Cymatics.fm - The #1 Site For Serum Presets, Samplepacks, & More! and buy a project pack (or get one of the free downloads). Go and try to reproduce each individual track in the project. After a few projects like this, you should have the basics down. ",
            "date": "Answered November 27, 2016",
            "views": "198",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        }
    ]
}