{
    "title": "As a musician why are some reasons why you do music? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Wicks",
                "href": "/profile/John-Wicks-12"
            },
            "answer_text": "My dear departed mother, Eileen, was a proficient sight-reading pianist and played majestic classical works on the piano, regularly, in addition to the modern standards of the day. Even though I was a very young boy, those great classical pieces really moved me and touched me emotionally, accordingly, I was hooked in a very natural and organic way, at an early age. I just absolutely loved music, I found it spiritual, and coupled with my love for astronomy, I felt connected to the universe(s), so it kind of became my religion, if you will. So, to coin a cliche: ‘It’s in my blood’. By the age of 8 my parents bought me my first guitar, and by the age of 10 I had learned how to play it. Then I heard The Beatles, who inspired me to compose my own songs and music, as did millions of others! At that point I learned how to play piano so that I could use both guitar and keyboard to assist me with my songwriting, the latter of which has proven to be an extremely therapeutic activity for me over the years. By the time I was 14, I knew what I wanted to do for the rest of my life. I’ve been writing, recording and performing music ever since. You could say it’s an addiction, since, metaphorically speaking, to me, music is by far the best ‘drug’ ever! I also find the creative process to be a form of meditation, since I very often find myself in a trance-like state, where all life’s problems appear to fade away. Suffice to say I have an overactive mind, also a lot of demons and musical creativity, being a cathartic process - really helps me to exorcise them. Over the decades, the music industry has changed so much since I started out - giving me a whole host of very good reasons to hang it up - but try as as I might, I just cannot bring myself to quit. Ultimately, I believe - as some experts suggest - that there’s an energy-field surrounding our bodies, from which we draw in ideas that are then processed in our respective brains. If this is eventually proven to be true, when it comes to creating songs, music, art and such, none of us may really be in that metaphorical driving seat as much as we like to think we are. We might feel we have our hands on that proverbial steering wheel occasionally, but since we don’t completely understand the complex and mysterious mechanisms of the creative process, I honestly feel that some external universal force could very likely be driving US. But whatever the definitive answer to this turns out to be, it’s fair to say - that in my case - the music really, truly, IS, in my blood. ",
            "date": "Answered July 10, 2018",
            "views": "367",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed Pias",
                "href": "/profile/Ed-Pias"
            },
            "answer_text": "For me personally, music has always been my spiritual connection, my personal form of prayer, not from a particular religion but as a way of being totally inclusive and open to all that is good. If I don't have that connection then it's very hard for me to play. I play two instruments, the drum set, which I feel is a public instrument which takes part in music with others for others, bringing joy to an audience, and I also play the Native American flute which is more contemplative and inward. I perform with that for yoga classes, libraries, senior centers etc. and occasionally with other instruments in a more public setting, but in the end, drums are outward, flute is inward for me, and whatever I play, it has to have a prayer like element for me. Which doesn't always happen, especially w drums because the music drums are used in is more ego based to me, but I aim for the heavens every time I play, no matter what or who I'm playing with. ",
            "date": "Answered July 12, 2018",
            "views": "286",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Carleonie Entertainment",
                    "user_href": "/profile/Carleonie-Entertainment"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dale Josef",
                "href": "/profile/Dale-Josef"
            },
            "answer_text": "ORIGINAL QUESTION: As a musician why are some reasons why you do music? Because I enjoy it. In years past, it also provided a substantial income. But making decent money by playing locally is pretty much a thing of the past. Nowadays it’s international superstar or nothing. That’s a shame, because there are many very talented musicians who would be glad to play evenings or weekends if they could make anything from doing so. Not too many people past the age of twenty or so can afford to tour endlessly, working for peanuts in the hope that someday, somehow they might become fabulously wealthy. That’s just not realistic for most people. So, nowadays, I just play occasionally at home. I am cooking up a new project, hopefully to be completed soon. So stay tuned! ",
            "date": "Answered July 10, 2018",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Boibhav Chakraborty",
                    "user_href": "/profile/Boibhav-Chakraborty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dion Kara",
                "href": "/profile/Dion-Kara"
            },
            "answer_text": "When I started learning I did it because of the attention I got from people when I was performing. I was a show off as a kid and I enjoyed people telling me how good I was. That was the best form of motivation for me. That all changed when I played at a club for the first time. There was alcohol, women and people cheering. As a 15 year old that was seductive enough, but I got paid the princely sum of $50. At the time that was a lot of money. After doing some quick calculations I realised I could make a living out of this. That was the moment that made me put my dreams of being an electrician on the back burner and choose music as a career. So adulation and a career where my motivations. When you write it down it seems pretty shallow. Hope this helps. ",
            "date": "Answered July 20, 2018",
            "views": "256",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Helen India Jolly",
                    "user_href": "/profile/Helen-India-Jolly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Mantree",
                "href": "/profile/Rick-Mantree"
            },
            "answer_text": "To ease certain memories of the pain of living. Because it comes naturally to me. Always has, at least since the age of 5 or earlier. Nobody but nobody on my mother’s or my dad’s side played an instrument but, for me, it was eventually playing a musical instrument or choosing not to live. I guess it is an innate part of my “biological make-up”? I LOVE dancing — if a song I really like is playing in store I am in, I have to leave the store because I can’t stop myself from dancing in the store. Playing music is like dancing, but on an instrument of your choice. I compose songs, melody and lyrics. Creating music is an outlet for my creative nature. ",
            "date": "Answered July 10, 2018",
            "views": "80",
            "upvotes": " Answer requested by Jolene Jennings",
            "upvoters": [
                {
                    "user_id": "Easy Yuan",
                    "user_href": "/profile/Easy-Yuan"
                },
                {
                    "user_id": "Monica McCoy",
                    "user_href": "/profile/Monica-McCoy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucero De'Lucero",
                "href": "/profile/Lucero-DeLucero"
            },
            "answer_text": "I've been playing music since my early high school year. Back then I did it cuz I was a shy guy but playing music and standing behind a guitar kind of gave me confidence and made me comfortable. I played music for a living for many years because I wanted to travel and see the country. I wanted to earn a living while I was doing that and so I did. I loved playing music, seeing new cities, meeting new people experiencing different crowd personalities. Now I play music because I love recording, I love being creative, I loved composing new songs and studying people's reactions to those songs. Music soothes my soul and it always has. It may sound corny but it always has. ",
            "date": "Answered July 10, 2018",
            "views": "84",
            "upvotes": " Answer requested by Jolene Jennings",
            "upvoters": [
                {
                    "user_id": "Dion Kara",
                    "user_href": "/profile/Dion-Kara"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Toomey",
                "href": "/profile/David-Toomey"
            },
            "answer_text": "I play music because I have to. Yes, there is financial, personal joy, an excuse to drink, a way to meet people, and so on, but I don’t really have any reason to play music. Music is just who I am, as both a fan and a performer, and despite having no good reason to play music, I still do so. ",
            "date": "Answered July 11, 2018",
            "views": "116",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Ken Fereday",
                "href": "/profile/Ken-Fereday"
            },
            "answer_text": "Why do I do music? I do it because I love the challenge of it, it is physically and mentally demanding. I enjoy the challenge in composing new songs. It is my passion and obsession ",
            "date": "Answered July 14, 2018",
            "views": "45",
            "upvotes": " Answer requested by Jolene Jennings"
        },
        {
            "author_info": {
                "name": "Istvan Geza Juhasz",
                "href": "/profile/Istvan-Geza-Juhasz"
            },
            "answer_text": "The music has to come out, or I’ll blow up… But as a musician I don’t even have to justify myself: that’s what I do, period. ",
            "date": "Answered July 12, 2018",
            "views": "55",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Benjamin Gessel",
                "href": "/profile/Benjamin-Gessel"
            },
            "answer_text": "Because I do the dew. Dadew! :-D It's just what I love the most, and what I do best… ",
            "date": "Answered July 12, 2018",
            "views": "54",
            "upvotes": " Answer requested by Jolene Jennings"
        },
        {
            "author_info": {
                "name": "Tom Howell",
                "href": "/profile/Tom-Howell-10"
            },
            "answer_text": "Peace of heart and mind. Natural prodigy and never had a choice. ",
            "date": "Answered July 11, 2018",
            "views": "48",
            "upvotes": "0"
        }
    ]
}