{
    "title": "At what time in Elvis Presley's life did he start to have serious health problems? What contributed to his physical decline and a premature death? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)",
        "Musicians",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randy Fisher",
                "href": "/profile/Randy-Fisher-18"
            },
            "answer_text": "I think Elvis’ health started to decline in the mid to late 1960’s if I remember correctly. Unlike some other stories you might have read Elvis actually started taking amphetamines while in the army. Not earlier. Elvis did not do illegal drugs or drink alcohol (or not much). The army supplied them, not yet realizing how bad for most people they can become. So the drug would wake you up and keep you awake for hours past the time when you should be getting sleep. This is hard on your heart. When Elvis got home he would need sleeping pills to help him sleep after using the amphetamines. He went for a few years just taking these which would not be healthy. Then I think he had teeth repaired and was given codeine pain killers. The ill effects of these pain killers was not yet fully realized at the time by the medical community. As Elvis would do with most things in his life he took his prescribed drugs to excess. I think he was also prescribed other types of prescription pain killers as time went on as the codiene only goes so far before you’re really taking too much. In the late ‘60’s or early ‘70’s he was diagnosed with a twisted colon. Again, more prescription meds. Then all the touring in the ‘70’s….more prescription drugs to keep him going. A poor to bad diet also didn’t help his health. So Elvis’ poor and declining health was a slow progression toward his death. Excluding his diet, his health issues would’ve started in the army even though that wouldn’t have been recognized for a few years. ",
            "date": "Answered September 8, 2019",
            "views": "519",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Davis",
                "href": "/profile/Susan-Davis-209"
            },
            "answer_text": "When he started abusing prescription medications.I am not sure what years.1970s maybe.He also had health problems too.Even when he was having health issues and on drugs he still could sing well and had a beautiful strong voice. ",
            "date": "Answered February 17, 2019",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Torda",
                    "user_href": "/profile/Jeff-Torda"
                }
            ]
        }
    ]
}