{
    "title": "At what year would a guitar be considered vintage? - Quora",
    "tags": [
        "Vintage Products and Goods",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Bolton",
                "href": "/profile/Charles-Bolton-5"
            },
            "answer_text": "At what year would a guitar be considered vintage? This is an interesting question. At the time of writing my answer there are five other answers. All of the other answers make good points. Bill Cameron’s answer is very detailed and accurate. I particularly like the answer by Andrew Cox whose answer matches my personal opinion or at least the opinion I held when I first became aware of “vintage” instruments in the late 80s/early 90s. My answer will be detailed and relative to my personal experience. I got my first guitar in 1986. It was purchased at the only musical instrument store in my hometown that sold guitars. This store(and the other two instrument stores in town) mainly focused on pianos/keyboards and band instruments. This store was a Yamaha dealer for their full line of products including guitars. They also sold Alvarez (including the high end made in Japan models) and Peavey. My first guitar was a Peavey T-15 because it was the only guitar in the store that looked like a Fender Strat in my price range. Back to vintage guitars, I discovered my first vintage guitar store in 1990 in the nearest major city to where I grew up. I loved that store and learned so much about older guitars and amps just by going in there every chance I got. I would give the name of the store, but there is currently a store in business using the same name and company logo that is NOT the store I used to love. Like Andrew Cox says in his answer, in 1990 I was told that vintage guitars were at least 25 years old. At the time this corresponded with the end of Leo Fender’s ownership of Fender and the perceived drop in quality of the CBS era Fenders, and the temporary ending of Les Paul’s association with Gibson. I will also add that at the time it was pointed out to me that the vintage guitar industry was similar to the classic car/motorcycle industry which also used the 25 year old criteria. At that point I assumed that it was a rolling 25 years which would mean that guitars from 1995 are “vintage” now. However, I no longer think that is the case. I believe that what we have now as “vintage” guitars are those guitars that were made in the 1960s and earlier. The guitars that have been made since 1970 that have increased in value are what I would classify as “collectible” but not “vintage”. I could perhaps give a little and include the 70s/early 80s, but I definitely don’t consider anything past the mid 80s to be vintage. Now that we are more than 25 years past the creation of both Fender and Gibson’s Custom Shops I think it is even more important that there is a distinction between “vintage” and “collectible”. I am also definitely in agreement with the belief that “vintage” implies a certain level of quality and that simply being an old guitar doesn’t automatically make it vintage(although it could be/or become collectible through the association with a major artist). Of course, all the models from all the major brands Gibson, Fender, Gretsch, Martin, and Rickenbacker would be included as quality instruments. I’ll also say that I believe George Gruhn is responsible for the creation of the “vintage guitar industry”. He is celebrating his 50th Anniversary in business this year. He just happened to open his business at a time when new instruments from Fender, Gibson, and even Martin were perceived to be of lower quality. This perception of lower quality in the new instruments coupled with the fact that guitar heroes of the era such as Eric Clapton and Jimmy Page were playing guitars from the 50s increased the desirability of those instruments. Then by the 1980s the prices and desirability continued to grow which lead to “collectors” buying guitars as an investment. Once that caught on prices for the iconic instruments became out of reach for the average person. This in turn prompted companies like Gibson and Fender to build reissues and Custom Shop replicas of the originals both as a service to the true customers who had been priced out of affording an original AND as a way to compete with the vintage guitar market. I like nice, well made instruments regardless of what year they were built, but there is absolutely something special about the ones from the 60s and earlier. For what it’s worth, I feel the same way about amps. In fact I’m more obsessed with amps than instruments. ",
            "date": "Answered February 2, 2020",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Cameron",
                "href": "/profile/Bill-Cameron-15"
            },
            "answer_text": "Generally, in particular for acoustic guitars, especially Martins, pre-1970’s. There are many flavours of vintage but the 70’s was sort of a dark decade between the Golden Age of the classic brands, and the development of modern guitar luthiery. After 1969 Brazil outlawed the export of Brazilian rosewood, which for questionable reasons was considered a key component of quality acoustic instruments. So yer vintage acoustics routinely used this magic ingredient for sides and backs, then suddenly it wasn’t availablex-legally—anymore. At the same time, the baby boom—music culture exploded, resulting a tremendous demand for guitars, and quality suffered. (Mind you, my #1 guitar for almost 40 years has been a 1973 Martin. It had certain construction flaws, which I had fixed in the early 90’s. It’s a great instrument.) But there is vintage, and there is -vintage-. Decade by decade, things change. So: 60’s—late vintage period. Martins of this decade are well regarded, Gibsons less so. Fender Strats and Telecasters, Les Pauls- nuff said. 50’s—classic acoustics some of which still used Adirondack red spruce for tops as well as plentiful Brazilian rosewood. The now super#vintage early Strat, Tele and Les Paul models. 40’s—the true connoisseur’s and collector’s favourites. Also referred to as “pre-war” (a misnomer since of course WW2 was swinging along by 1940, the US just wasn’t in it), “wartime” and “post-war”, since wartime situations affected the instrument industry (like any other) in regards to materials, markets and labour availability or lack thereof. 30’s—be still my beating heart. This is when the modern acoustic as we see it today was developed in production modes, with large bodies, truss rods, big rounded frets that you could play right up the neck, and refinements in bracing that created that iconic dreadnought Martin and Southern Jumbo Gibson which could play a in a barn dance band unamplified. One of my favourite guitars of all time was my friend’s 1939 Martin D-18 that I played a few times in the 70’s, and suddenly realized what the fuss was about. Whoa, don’t get me started. There are of course lots of other makers of vintage guitars than the ones I have mentioned. To recap, the short answer is “1969 and earlier”. The complete answer is “that reminds me of back in the day…how much time do you have?” ",
            "date": "Answered January 30, 2020",
            "views": "154",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Bolton",
                    "user_href": "/profile/Charles-Bolton-5"
                },
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "David Mulata",
                    "user_href": "/profile/David-Mulata"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Cox",
                "href": "/profile/Andrew-Cox-83"
            },
            "answer_text": "It always changes. Generally “vintage” starts being a thing for musical gear when it is 25 years old. That’s when the people who lusted after the best gear around when they were 20 and poor are now 45, and in their prime earning years. They finally have the money to buy what they’ve always REALLY wanted to play, instead of what they had to play when they were young and broke. It should be noted that not all 25+ year-old gear is “vintage”. Usually it's only the lust-worthy stuff. Every era has a bunch of stuff that is overproduced, unfashionable or just crap. And while that stuff may one day be old, it will never be “vintage” in the proper sense. But even that can change. If a great musician takes some of that crap and uses it to make legendary music, it can push some of it into the “vintage” realm. But that is the exception, not the rule. ",
            "date": "Answered January 31, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Bolton",
                    "user_href": "/profile/Charles-Bolton-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "As already said it varies from person to person, or Sales persons. Vintage actually means only a specific year, or at a stretch period (say decade) and it doesn’t imply any particular level of quality. What IS perceived , particularly, in acoustic instruments, is a higher quality of now endangered tonewoods and the tonal benefits of so many years of play and drying out. There is also the question of rarity, as many instruments now regarded as of significant vintage, is rarity. ",
            "date": "Answered January 31, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bo Aakerstrom",
                "href": "/profile/Bo-Aakerstrom-1"
            },
            "answer_text": "Usually if a guitar is at least 30 years old it considered vintage. In reality, it is just an old guitar, and people who want to sell it to you and charge more for it calls it vintage. ",
            "date": "Answered January 30, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Mulata",
                    "user_href": "/profile/David-Mulata"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Shaw",
                "href": "/profile/Richard-Shaw-124"
            },
            "answer_text": "Basically it’s just an old guitar. I bought a ‘vintage’ 1962 Silvertone guitar at a garage sale. >It was designed to look like a Gibson Les Paul. I researched and it was made in Chicago and sold by, I think Sears. It’s not an expensive guitar but it looks cool hanging on the wall in the rec room. ",
            "date": "Answered January 31, 2020",
            "views": "81",
            "upvotes": " View Sharers"
        }
    ]
}