{
    "title": "Can a Squier guitar really last a lifetime? - Quora",
    "tags": [
        "Squier Guitars",
        "Lifetime",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Campbell",
                "href": "/profile/Tom-Campbell-1"
            },
            "answer_text": "Thanks for the A2A, James. No question. The proof has been with us for decades, because: Many, many crappy plywood guitars from brands like Harmony, Sears etc. from the 40s-60s are still doing fine, and they were pretty bad by today’s standards. Think about it. Those guitars are older than I am, and I’m old. Yet people still play and trade them. Boom. There’s your proof. But wait, there’s more.Build quality of your average Squier these days is way better than the average Fender in the mid 60s-early 70s, and those Fenders aren’t going anywhere despite the terrible QA Fender had then. Woods were better on average in the 70s, I admit, but your signal chain pretty much wipes out any differences there.Remember Squiers are made in big factories with high-precision CNC machines to tolerances unknown in guitar mass production for the first 350 years of the guitar’s existence. High tolerance means better fit, means less chance of problems.For years Fenders were made using worn jigs and fixtures from the original factory. These had slowly lost their precision and fit. Meanwhile Squiers after around 1995 or so were made from newer machines on closely watched assembly lines built from scratch, with the things they’d learned from Fender’s mistakes over the years.Squiers are just fine. And don’t even get me started on the higher end Squiers, which are CRAZY good quality per dollar.My guitar range from a $25 Squier that sounds fantastic to a $25,000 1959 Fender that also sounds fantastic. I’m not the least ashamed or uncomfortable playing Squiers. ",
            "date": "Answered December 15, 2019",
            "views": "341",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Krohne",
                    "user_href": "/profile/Martin-Krohne-1"
                },
                {
                    "user_id": "Dave Rice",
                    "user_href": "/profile/Dave-Rice-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Reardon",
                "href": "/profile/Robert-Reardon-20"
            },
            "answer_text": "Sure. Any guitar can last decades or centuries as many have already replied. As others have noted pots and switches and other hardware will last decades but eventually wear out and need to be replaced. Pretty much every moving part will eventually wear. And while they don’t move your frets and nut also fall into this category. They may be stationary but the string itself moves and the string will eventually wear both the frets and the nut. So assuming you bend strings and or use the whammy bar the frets will need dressed. Each time that’s done you remove metal from the taller frets so that they match the lowest fret. There’s a finite amount of times this can be done but I’d still expect the frets to last decades. Playing style has a LOT to do with this. My 1984 Squier is still going strong. But the frets are getting worn down. It’s one of the reasons I don’t play it as much as I used to. Japanese wire and American and European wire is sturdy stuff. But as production has shifted Squier quality has gone up and down with it. I’m not going to say it’s bad fret wire categorically across the board but once production shifted from Japan fretwire becomes a bit of a variable quality. As prices have dropped relative to inflation costs must be recovered somewhere. Pots. Fretwire. Switches. Tuners etc have all undergone cost saving measures at some point in time. I’ve worked on enough heavily played Squiers to say that while not what I would necessarily call the factory wire sub par in all cases it does wear out faster than better wire you find on better and pricier instruments. It’s simply something to be aware of on nearly all entry level brands and truthfully most play these guitars as their primary guitar for a few years then upgrade keeping it as a spare. My advice is play it and let your kids worry about the refret. But if you play it long enough and hard enough the bill may come due on your shift. Just something to be aware of and at this price point it absolutely would not keep me from buying a guitar. And all the other guitars in this price bracket are probably using the same quality wire. ",
            "date": "Answered December 22, 2019",
            "views": "91",
            "upvotes": " Answer requested by James Brodski",
            "upvoters": [
                {
                    "user_id": "James Brodski",
                    "user_href": "/profile/James-Brodski-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "Of course it can. Maybe the wood quality isn’t quite as good, and maybe the hardware is a little cheaper than an American made Strat, but a Squier Strat is really no different than any solid body electric guitar. With the exception of the geared tuners, pots, and maybe tremolo (if you use that. . .I don’t) it has no moving parts. So long as it isn’t grossly abused, there is ZERO reason why a Squier can’t last a lifetime, with the following caveats. Eventually the pots (on any electric guitar) wear out, become “scratchy” and need to be replaced. The tuning machines may eventually wear out and need replacement, though good quality ones will last a LONG time. And if you play a lot, especially if you BEND a lot, the frets will wear out and will need to be replaced. On a Squier it might be more cost-effective to replace the entire neck. ",
            "date": "Answered December 1, 2019",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew J. Orifice",
                    "user_href": "/profile/Matthew-J-Orifice"
                },
                {
                    "user_id": "Jonas Parker",
                    "user_href": "/profile/Jonas-Parker-1"
                },
                {
                    "user_id": "James Brodski",
                    "user_href": "/profile/James-Brodski-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Clute",
                "href": "/profile/Michael-Clute-4"
            },
            "answer_text": "I have a squire Tele, that I bought in 1995 and it continues to operate as it did the first day. It doesn't stay in tune very well after playing it with gusto, but if just strumming it holds up for several hours. I'm certain that it won't just disintegrate one day. In fact with only a little upgrade it would even stay in tune. I bought it for an art project, not to play, and kept it because I liked the way it looked hanging on the wall. I don't use it for anything other than decoration, and almost gave it to a neighbor kid once but he decided he wasn't interested in guitar. ",
            "date": "Answered December 15, 2019",
            "views": "59",
            "upvotes": " Answer requested by James Brodski",
            "upvoters": [
                {
                    "user_id": "Rob McCarthy",
                    "user_href": "/profile/Rob-McCarthy-11"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                },
                {
                    "user_id": "James Brodski",
                    "user_href": "/profile/James-Brodski-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Smith",
                "href": "/profile/Robert-Smith-1969"
            },
            "answer_text": "Sure, why not? The big differences between Squire and Fender are the quality of the hardware and electronics, and maybe how carefully the wood is chosen. So you might end up replacing the pickups and tuners earlier than you would on an American STandard. But if a Squier makes it to it’s 5th birthday and the wood is stable, then I’d expect it to last decades or longer with reasonable care. ",
            "date": "Answered November 26, 2019",
            "views": "96",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Reardon",
                    "user_href": "/profile/Robert-Reardon-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew J. Orifice",
                "href": "/profile/Matthew-J-Orifice"
            },
            "answer_text": "Squire guitars are perfectly fine guitars, i know several pros who play them on stage. if you take care of them there is no reason for them not to last. remember there are still Original Danelectros out there that are perfectly playable, if THEY can last … pretty much anything can ",
            "date": "Answered November 26, 2019",
            "views": "76",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John McGrath",
                    "user_href": "/profile/John-McGrath-108"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abraham Simpson",
                "href": "/profile/Ken-Wood-196"
            },
            "answer_text": "IMO, Yes. A blind musician would find no more differences between a Squire and a Fender, than between two Fenders, or between two Squires, which would make one last longer than the other:-) ",
            "date": "Answered November 26, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Nestor",
                "href": "/profile/Mike-Nestor-4"
            },
            "answer_text": "Yes. Everything on a Fender guitar is replaceable, so if your tuners wear out, your volume and tone controls quit working, you jack wears out, your bridge breaks, whatever, you can easily find a new one and bolt or screw it on. Even the neck bolts to the body. So yes, it can last as long as you want it to. ",
            "date": "Answered December 15, 2019",
            "views": "20",
            "upvotes": " Answer requested by James Brodski",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Rock",
                "href": "/profile/M-Rock-13"
            },
            "answer_text": "Yea, but only f you don’t play it. A Re-fret will cost nearly double what the guitar costs. That in itself makes it disposable. The fretwire is not bad, but it’s a bit malleable and soft. Once the frets wear down on your $200 guitar, go see what a pro refret costs on a maple board. ",
            "date": "Answered December 18, 2019",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Damon Campagna",
                    "user_href": "/profile/Damon-Campagna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Sherman",
                "href": "/profile/Robert-Sherman-10"
            },
            "answer_text": "Well, my old Squier II strat from 1989 is still going strong. I played it for years and then gave it to a friend for his son, and 30 years later, it is still being played and still solid as a rock. ",
            "date": "Answered December 19, 2019",
            "views": "19",
            "upvotes": " Answer requested by James Brodski"
        },
        {
            "author_info": {
                "name": "Peter Choe",
                "href": "/profile/Peter-Choe-20"
            },
            "answer_text": "With regular maintenance and upkeep it can last forever. There are instruments from the 19th century that are still in pristine condition today. All it takes is some TLC every now and then. Just don't pull a Hendrix and light it on fire. ",
            "date": "Answered November 29, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Craig Spector",
                "href": "/profile/Craig-Spector-1"
            },
            "answer_text": "Some Squires, no… but I have a Fender Squire J5 (from famed guitarist John 5) that is built like a tank, sounds fantastic, and will last forever… ",
            "date": "Answered December 17, 2019",
            "views": "13",
            "upvotes": " Answer requested by James Brodski"
        },
        {
            "author_info": {
                "name": "Ken Schuller",
                "href": "/profile/Ken-Schuller"
            },
            "answer_text": "It’s not like other electric guitars are made from different materials - they’re wood, plastic, and metal. Potentially ANY electric guitar could last as long as any other. ",
            "date": "Answered December 15, 2019",
            "views": "25",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ronald Pelletier",
                "href": "/profile/Ronald-Pelletier"
            },
            "answer_text": "Well of course as lo g as you take care of it keep it in its case when not in use. Etc, etc ",
            "date": "Answered December 19, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Joseph Baldassarre",
                "href": "/profile/Joseph-Baldassarre-1"
            },
            "answer_text": "If you take care of it, why not. But if you have such a low opinion of Squire, why not get something you thing WILL last a lifetime? ",
            "date": "Answered December 17, 2019",
            "views": "17",
            "upvotes": " Answer requested by James Brodski"
        }
    ]
}