{
    "title": "Can I use my DVD player as a receiver (hook up TV to it by SPDIF cable and play sound on 5.1 surround that is also hooked up to DVD player)? - Quora",
    "tags": [
        "Surround Sound",
        "DVD Players",
        "Home Theaters",
        "DVD",
        "Audio",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Harris",
                "href": "/profile/Charles-Harris-56"
            },
            "answer_text": "You can not use a DVD player as a receiver. That is like asking if you can use just your cars tires to tow a trailer by connecting them with just ropes. Your missing several things to make the system work. Every audio system has at a minimum 3 components that have to all work together to get the desired result and there are always 3 main components The sourceThe amplificationThe speakersThe sources is what ever generates the audio and video you want to see and hear. It can be a DVD/Blu-ray player, AM/FM radio receiver, record turntable, tape deck, satellite/cable box, etc… The amplifier is where your system gets its power. if you don’t have an amplifier your speakers will not work. It would be like having a car but not having an engine. The speakers is what allows you to hear the sound. Every time you hear a speaker doing it’s job these three components have to exist. Even that little thing you carry in your pocket that allows you to talk to people all over the world has these 3 components built into it. You may not recognize them as being the same but they are there. If you are missing any one of these you are not going to be able to create a surround sound system. That being said, there are some systems that are known as Home Theaters in the Box (HTiB’s) . These systems sometimes have a DVD player integrated into the receiver. The receiver is where the amplifier is located. With systems like this you may have what looks like a DVD player with speaker connections on the back of it. The reality is the speaker connections are part of the amplifier and the DVD player is just the source feeding audio to the amplifier and video to the TV. Both the amplifier and the DVD player gets it power from the same outlet but they are at their core 2 separate components. A source and an amplifier. The S/PDIF cable or Optical cable or Tos-Link, Depending on what you want to call it is a one way cable. Thus if your TV has an optical out and your DVD player / receiver has an optical in you can connect it and play surround sound from your TV through the amplifier and then out to the speakers. However most HTiB systems I have encountered do not have this type of pass through connection. What you likely have is an optical out from the DVD side of the unit that can allow the DVD player to be used as just a DVD player and then the sound sent to a secondary amplifier or dedicated receiver such as this bad boy here.  Home | Onkyo USA For what you are describing to work you will either need a 2nd dedicated amplifier or you will need to let us know exactly which make and model you have so we can look at your system and read the manual. ",
            "date": "Answered December 7, 2019",
            "views": "459",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Filipe M. Cross",
                "href": "/profile/Filipe-M-Cross"
            },
            "answer_text": "If it is a DVD player/recorder you may just get it to work, but that is a long shot. If the DVD machine is just a player it does not have an input, it does not need one. It only has outputs. One of them is probably the SPDIF and there should be also an analogue output and maybe an HDMI output. The SPDIF on your TV device is also an output. Connecting an output to another output will obviously not work. You would need your DVD to have an input and an output for it to work.  Your other option would be to get a SPDIF Toslink to Analog RCA Audio Adapter Converter there are plenty of them on the web. The only issue is that you will only have audio left and right channels. This means you only get a stereo signal, not all the five channels plus the sub out. But it will work. And you can always use virtual surround mode on your surround sound system I am sure it has that feature because most of them do. ",
            "date": "Answered June 13, 2020",
            "views": "612",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jimmy Clemence",
                "href": "/profile/Jimmy-Clemence"
            },
            "answer_text": "“Can I use my DVD player as a receiver (hook up TV to it by SPDIF cable and play sound on 5.1 surround that is also hooked up to DVD player)?” Sorry but your question is not clear on what your trying to do/ask. Would also be helpful to know the brand and model numbers of your TV and DVD player. ",
            "date": "Answered December 4, 2019",
            "views": "228",
            "upvotes": "0"
        }
    ]
}