{
    "title": "Can my YouTube channel be monetized if I have only copyright claims (not copyright strike)? - Quora",
    "tags": [
        "Copyright Infringement",
        "Copyright Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Swisher",
                "href": "/profile/David-Swisher"
            },
            "answer_text": "Can [your] YouTube channel be monetized if [you] have only copyright claims (not copyright strike)? Not really. Posting content which doesn’t belong to you and for which you don’t have permission is a violation of YouTube’s Terms of Service and Community Guidelines, so if you’ve got copyright claims, you’re already skating on thin ice. Further, monetizing content which doesn’t belong to you violates YouTube’s Video monetization criteria as well as Google’s AdSense policies, which would make you ineligible for payment. However, “technically” you could still monetize non-infringing videos. So for channels which were grandfathered in (already monetized) when they raised the threshold on eligibility eligibility requirements for the YouTube Partner Program (January 16, 2018),[1] a few videos with copyright claims (under ContentID, not strikes) would not necessarily prevent someone from monetizing their channel as long as they only monetized videos that had no copyright claims or infringing content and the rest of their channel was in good standing .[2] Once YouTube changed the requirements in early 2018, they dropped existing channels from monetization eligibility after 30 days if the existing (and previously monetized) channel did not meet the minimum thresholds of 1,000 subscribers and 4,000 watch hours in the last 12 months. [3] I was one of those dropped, so remember it well. After that point, all applications are reviewed (this includes new applications as well as those who were dropped and later re-apply after meeting the program thresholds - see “Step 4: Get reviewed”:[4] Once your channel meets the program threshold, we'll review your application to make sure your channel activity adheres to the YouTube Partner Program policies, YouTube Terms of Service, and our Community Guidelines. While they don’t specifically state there that copyright issues would bar you from monetization eligibility, the page on YouTube Partner Program Policies most certainly makes it clear that you must have commercial use rights, own “all the rights to the content submitted for monetization including all audio and video elements,” and understand and follow all terms of any licenses you’ve uploaded content through. So if you’ve currently got copyright claims on videos and you want to monetize, first learn why they got flagged, stop uploading content you don’t have permission to use (and if you DO have permission or a license, learn how to file a proper dispute), and make sure you’ve thoroughly read and understood YouTube’s Partner Program Policies, and AdSense Program Policies. If you don’t, it’s unlikely to be approved for monetization, and if it does make it through, any future violations will result in automatic removal of that content from YouTube. Elsewhere they state:[5] If you're having issues submitting videos for monetization, it may be because some of the videos are age-restricted or claimed by a third party. You can't monetize these types of videos. So this at least infers that you could have a monetized channel with some videos that are ineligible for monetization. However, YouTube’s new YPP requirements require continued maintenance of the 1,000 subscriber and 4,000 watch hours in the last 12 months, so if you drop below either threshold for a period longer than a couple of months, you would be dropped from monetization and have to re-apply and be re-reviewed once re-gaining the minimum eligibility threshold.* There’s also an extensive write-up under “Which videos are NOT eligible” on each user’s individual YouTube Account Monetization page. And yes, YouTube is a LOT more strict about this now post-2017. Finally! - - - - - * That detail came from an email from the YPP about the revised eligibility and I’m unable to locate the same information online Footnotes[1] Additional Changes to the YouTube Partner Program (YPP) to Better Protect Creators[2] YouTube Partner Program - Requirements for monetization[3] Additional Changes to the YouTube Partner Program (YPP) to Better Protect Creators[4] How to earn money from your videos[5] Choose the videos you want to monetize",
            "date": "Updated June 28, 2020",
            "views": "151",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucy Herzig",
                    "user_href": "/profile/Lucy-Herzig-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Pingpong-Sant"
                },
                {
                    "user_id": "Derek Musiime",
                    "user_href": "/profile/Derek-Musiime"
                },
                {
                    "user_id": "RM GamingUK",
                    "user_href": "/profile/RM-GamingUK"
                },
                {
                    "user_id": "Rose Buonasera",
                    "user_href": "/profile/Rose-Buonasera"
                },
                {
                    "user_id": "Kishore Kumar S",
                    "user_href": "/profile/Kishore-Kumar-S-32"
                },
                {
                    "user_id": "Tomas Sadzėivičiūs",
                    "user_href": "/profile/Tomas-Sadzėivičiūs"
                },
                {
                    "user_id": "Uros Er",
                    "user_href": "/profile/Uros-Er"
                },
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-704"
                },
                {
                    "user_id": "Sheerie H",
                    "user_href": "/profile/Sheerie-H"
                },
                {
                    "user_id": "Siva Linga",
                    "user_href": "/profile/Siva-Linga-8"
                },
                {
                    "user_id": "John Fishback",
                    "user_href": "/profile/John-Fishback-1"
                },
                {
                    "user_id": "Manoz Kc",
                    "user_href": "/profile/Manoz-Kc-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Quirk",
                "href": "/profile/Jonathan-Quirk-3"
            },
            "answer_text": "The others have kind of gone more in depth than what you were asking, so here's the straight answer: having Claimes and not strikes, generally doesn't automatically disqualify you from the YouTube partner program, but as the others have stated, if you only upload content that contains media that doesn't belong to you, even if you only use that media in part of your video, that's going to most likely be an issue, especially since,as the other commenters said, a real human will be reviewing the videos when you submit your application for monetization, so if they find more stuff that goes against their rules that the algorithm didn't catch, you'll be in big trouble. A human also may not be as lenient about copyright claims on your channel as the website is, they tend to be more strict when they have to manually review things, so, I'd say don't get your hopes up for being accepted if your entire channel is content that isn't yours. ",
            "date": "Answered February 21, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Softyvibes",
                    "user_href": "/profile/Softyvibes"
                },
                {
                    "user_id": "Apt Ace",
                    "user_href": "/profile/Apt-Ace"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Be aware, once you manage to meet the qualifications for monetization (1,000 subscribers, 4,000 view-hours), a human will review the content of your channel. If there is anything that violates the community principles, you will be denied monetization. You might also get a community or copyright strike, based on what they see. That human is going to be looking for obvious copyright infringing content. This isn’t a matter of Comedy Central or Marvel Studios not caring enough to send a copyright strike. This is about YouTube now knowing that you have illegal content. That makes them responsible as a publisher. Once they know, they have to respond, otherwise they are legally culpable. Since they don’t want to get shut down, you can expect to have that content removed and your account warned or banned. It is not possible to make money on YouTube with someone else’s content. ",
            "date": "Updated August 7, 2019",
            "views": "82",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Leo",
                    "user_href": "/profile/Adam-Leo-23"
                },
                {
                    "user_id": "Official Halista",
                    "user_href": "/profile/Official-Halista"
                },
                {
                    "user_id": "Ammad Khan",
                    "user_href": "/profile/Ammad-Khan-9"
                },
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-704"
                },
                {
                    "user_id": "John Woodworth",
                    "user_href": "/profile/John-Woodworth-11"
                },
                {
                    "user_id": "Manoz Kc",
                    "user_href": "/profile/Manoz-Kc-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Mu",
                "href": "/profile/Mike-Mu-2"
            },
            "answer_text": "Yes. YouTube usually tells you what you need to do, if anything. Most claims means the monetization of the video now goes to the claimant automatically with ads. If you dispute the claim and can prove you properly licensed the property in dispute then the claim can be lifted. ",
            "date": "Answered January 27, 2019",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ammad Khan",
                    "user_href": "/profile/Ammad-Khan-9"
                },
                {
                    "user_id": "Your-Food Delivery",
                    "user_href": "/profile/Your-Food-Delivery"
                },
                {
                    "user_id": "JAYA NANDA Prabhas",
                    "user_href": "/profile/JAYA-NANDA-Prabhas"
                },
                {
                    "user_id": "Adap Kuria",
                    "user_href": "/profile/Adap-Kuria"
                }
            ]
        }
    ]
}