{
    "title": "Can I use another K-Pop song in auditioning? - Quora",
    "tags": [
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nur Roma",
                "href": "/profile/Nur-Roma"
            },
            "answer_text": "Some people might tell you not to, some people might tell you to. Just sing whatever you feel most comfortable with, but never sing a song they are not going to be able to understand or judge your pronunciation, so sing preferably in English or Korean, whichever suits you best. And NEVER sing a song from a group under the label you are auditioning for.For example, if you are auditioning for Cube, don’t sing or dance a Pentagon or a (G)I-DLE song. They want people with talent and charisma, not people who are trying to get in for their idols. ",
            "date": "Answered June 26, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nora Fo",
                "href": "/profile/Nora-Fo-1"
            },
            "answer_text": "I’ve heard from people who’ve auditioned and got in that you can, but try not to use a very mainstream song. That can make you seem like just an obsessed fan of the company/artist, and will greatly lower your chances. Also, make sure it complements your voice, obviously :) ",
            "date": "Answered August 28, 2017",
            "views": "120",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MaryRose Canto",
                    "user_href": "/profile/MaryRose-Canto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shevaun Krans",
                "href": "/profile/Shevaun-Krans-1"
            },
            "answer_text": "Yes, of course you can! Just make sure you pronounce the lyrics correctly and here’s a piece of advice: if you’re auditioning to a company (let’s say YG, for example), and you sing a K-pop song released by an artist under YG, make sure you know all the lyrics by heart and you have correct punctuation. If not, you’re going to get compared. Good luck! ",
            "date": "Answered June 23, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diane Garcia",
                "href": "/profile/Diane-Garcia-24"
            },
            "answer_text": "I don’t think it would be bad however make sure to use a song that compliments your voice and that you can perform very well. For example: Let’s say you choose a song with many high notes but you haven’t trained your voice for high notes, and then you audition and it all goes wrong…get me? Good luck! :) ",
            "date": "Answered August 28, 2017",
            "views": "92",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elsa Monika",
                    "user_href": "/profile/Elsa-Monika"
                }
            ]
        }
    ]
}