{
    "title": "Can you use alto saxophone reeds on a clarinet? - Quora",
    "tags": [
        "Clarinets",
        "Saxophones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Rossi",
                "href": "/profile/Rick-Rossi-7"
            },
            "answer_text": "Alto saxophone reeds will work on an alto clarinet. Soprano sax reeds work on soprano clarinets but they’re not ideal. Clarinet reeds are cut to have more wood in the center of the reed, they are intentionally made that way to make them a little more resonant and less thin and bright. They would work a little better for jazz but technically, reeds are designed for the optimum performance for each instrument. A soprano sax reed can work but it’s not the right cut and also clarinet reeds tend to be longer than soprano reeds. One exception I’ve experienced is that I have used Legere “European Cut” Clarinet synthetic reeds on a soprano sax and actually prefer them to their soprano cut, and I think it’s for the same reason, I like a fat sound on the soprano and the European cut seems to have a fuller, warmer sound and it seemed to resonate more than their standard soprano sax cut. Also, Plaz Johnson, the saxophone player who played the well known solo on “The Pink Panther” said he used baritone saxophone reeds on his tenor saxophone, so trying different cuts is something you can experiment with. It certainly worked for him! You can see a live version of him playing Pink Panther on this youtube video. He’s got a big fat and unique sound and that baritone reed was one of the secrets of his sound.  ",
            "date": "Answered December 3, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Hill",
                    "user_href": "/profile/Alex-Hill-402"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Boucherat",
                "href": "/profile/Philip-Boucherat"
            },
            "answer_text": "Answer by Rick Rossi is good. It is a few years since I’ve actually played the alto sax, and many years since I played the clarinet (although I did once play the Mozart clarinet quintet with a real string quartet at a public concert so I do feel a bt qualified). On alto sax, I used to use tenor sax reeds all the time. That was fine, somehow I got a better sound. Not sure about using alto sax reeds on a clarinet though as I never tried it. For what it’s worth, the best reeds I ever tried for clarinet were Rico Plasticover reeds, which were clarinet reeds with some kind of black plastic coating, don’t think they make them any more, probably haven’t for years. But yes, experiment, give it a go, things may or may not work. Cheers, Phil ",
            "date": "Answered February 7, 2019",
            "views": "753",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Sensor",
                "href": "/profile/Joe-Sensor"
            },
            "answer_text": "No; not a usual Bb soprano clarinet, which is probably what you mean when you say “clarinet.” An alto sax reed will fit on an alto clarinet, a tenor sax reed will fit a bass clarinet, and a Bari sax reed will work on a contra alto clarinet though. Soprano sax and soprano clarinet reeds are pretty similar and should work ok in a pinch. ",
            "date": "Answered December 3, 2018",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wayne Jackson",
                "href": "/profile/Wayne-Jackson-102"
            },
            "answer_text": "I've used alto Gonzalez reeds and have a great experience using it. This isn't the Reed you purchase for jazz band or small combo. This is the reed you purchase for concert band, for UIL solo and group challenge. They are profiled to deliver a smooth, dark sound, and not the rough, throaty, or screaming sounds used in pop venues. You can buy this at Argendonax at affordable price. Key feature of the product: 100% ORGANIC: Free of pesticides and chemical products Best for for classical music 10 REEDS PER BOX ",
            "date": "Answered February 28, 2019",
            "views": "429",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dani Alexis",
                "href": "/profile/Dani-Alexis-2"
            },
            "answer_text": "No. They're too large, as you'll discover the moment you try to attach one to your mouthpiece. (Caveat: They may fit one of the obscure alto clarinets. But they will not fit a regular Bb clarinet.) ",
            "date": "Answered December 3, 2018",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexandra Torres",
                    "user_href": "/profile/Alexandra-Torres-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Rodriguez",
                "href": "/profile/Miguel-Rodriguez-3"
            },
            "answer_text": "No ",
            "date": "Answered December 3, 2018",
            "views": "48",
            "upvotes": "0"
        }
    ]
}