{
    "title": "Can you listen to music too much? - Quora",
    "tags": [
        "Listening to Music",
        "Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brad Sanzenbacher",
                "href": "/profile/Brad-Sanzenbacher-1"
            },
            "answer_text": "Whether listening to music too much is harmful in a medical or phsycological way, I'm not qualified to answer. But I will say this: Many people isolate themselves from reality too much. Wearing headphones all the time is another way to do that. I often see people hiking in beautiful parks in California's Redwood forests, wearing headphones, which cuts them off from the beautiful sounds of nature around them.  Even in someplace like a busy subway platform, there's an energy and noise to the humanity of it. There's beauty in the chaos and the diversity of sound. When you live it with all of your senses, it becomes part of you in a profound way. You become a citizen of the world and not just a tourist in it.  Given that recorded music is a commercial product, listening to it is a form of consumerism. And while there are different spectrums of how commercial vs. artistic or personal a particular piece of music is (within that spectrum lies a lot of nasty arguments between otherwise reasonable people), you really have to ask yourself if the music you're listening to is adding to your experience in the world, or subtracting yourself from it. I love music, including commercial and pop music, but I try to set boundaries with where and how much I consume.  My advice is to learn to appreciate the sounds of the world around you, and in the end, you'll feel a deeper connection to the music when you do listen. ",
            "date": "Answered December 22, 2015",
            "views": "26",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miloš Jeremić",
                    "user_href": "/profile/Miloš-Jeremić-2"
                },
                {
                    "user_id": "Sanjana Thakur",
                    "user_href": "/profile/Sanjana-Thakur-28"
                },
                {
                    "user_id": "Efren Mendoza",
                    "user_href": "/profile/Efren-Mendoza-10"
                },
                {
                    "user_id": "Prathamesh More",
                    "user_href": "/profile/प्रथमेश-मोरे-Prathamesh-More"
                },
                {
                    "user_id": "Xinyu Lu",
                    "user_href": "/profile/Xinyu-Lu-8"
                },
                {
                    "user_id": "Alex Laplantel",
                    "user_href": "/profile/Alex-Laplantel"
                },
                {
                    "user_id": "Andrew Byron",
                    "user_href": "/profile/Andrew-Byron-2"
                },
                {
                    "user_id": "Joshua Graham",
                    "user_href": "/profile/Joshua-Graham-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Atkin",
                "href": "/profile/Ian-Atkin"
            },
            "answer_text": "Absolutely not. Music is a panacea. It can help with many different things, from studying to pain management, and it even has beneficial qualities for Alzheimer's patients. On the contrary, listening to \"too much\" music has never been shown to have adverse or negative effects. Caveat: Listening to sustained, high volume sound (whether musical or not) can cause  permanent hearing loss. Some situations where music helps: Fibromyalgia: Patients in a study were found to be somewhat relieved of their pain after listening to music for 20 minutes. The control group listened to pink noise, and reported no significant change in their pain. Studying: It has been shown that music from the Baroque period (think Vivaldi or Bach), particularly with a tempo close to 60 beat per minute, helps us retain information when we are studying. Exercise: High energy music has been shown to be beneficial to getting through difficult workouts. In studies, people listening to music with a fairly rapid beat where shown to outperform the control group that didn't. Brain Chemistry: Music of certain flavors has been proven to release dopamine in the brain, which makes us happier. Music definitely changes our mood; use it wisely. Read more (while listening): Why listening to music is the key to good health ",
            "date": "Answered December 22, 2015",
            "views": "29",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Arnold Jones",
                    "user_href": "/profile/Matthew-Arnold-Jones"
                },
                {
                    "user_id": "Graham Partis",
                    "user_href": "/profile/Graham-Partis"
                },
                {
                    "user_id": "Greg Spradlin",
                    "user_href": "/profile/Greg-Spradlin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lateefah Stallings",
                "href": "/profile/Lateefah-Stallings"
            },
            "answer_text": "Yes, there can be too much listening to music. I use to listen to music with ear buds in my ear when I'm out walking, doing homework, basically everything I do I listen to music. It eventually became addictive, and then I started sleeping with ear buds in my ears. Now when people are talking to me, they have to repeat several times before I can actually make out what they're saying. So I will advise you not to listen to music a lot especially with ear buds in your ear. ",
            "date": "Answered December 24, 2015",
            "views": "888",
            "upvotes": "0"
        }
    ]
}