{
    "title": "Can you get paid for making Spotify playlists? - Quora",
    "tags": [
        "Spotify Playlists",
        "Playlists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan Maria Solare",
                "href": "/profile/Juan-Maria-Solare"
            },
            "answer_text": "I must say something important. There MIGHT be indirect ways to monetize it (*), but asking for money to include any artist’s track in your playlist is illegal. However I know that several curators do that, and I get messages on a regular basis asking for money that range from “15 dollars to just listen my track” and “if I like it, I include it” up to 100 dollars a track. And I am talking about playlists that (a) don’t have a great number of followers (say 10.000) from which you still have to check how many are actually listening. Or didn’t you know that you can buy fake followers? It is clearly against Spotify’s Terms and Conditions of Use. Concretely: The following is not permitted for any reason whatsoever: (…) selling a user account or playlist, or otherwise accepting any compensation, financial or otherwise, to influence the name of an account or playlist or the content included on an account or playlist.(*) Having said that, you have legal ways of monetising your playlists indirectly, for instance: Make a Patreon page and say your supporters that you are creating playlistsMake a landing page where you talk about your playlists and music taste, and include adds thereimagination is your limitJuan Maria Solare ",
            "date": "Updated October 22, 2018",
            "views": "163",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sunny Moon",
                    "user_href": "/profile/Sunny-Moon-50"
                },
                {
                    "user_id": "João Pedro Cipriani",
                    "user_href": "/profile/João-Pedro-Cipriani"
                },
                {
                    "user_id": "Shiromani Kant",
                    "user_href": "/profile/Shiromani-Kant"
                },
                {
                    "user_id": "Laisan Shafikova",
                    "user_href": "/profile/Laisan-Shafikova"
                },
                {
                    "user_id": "Manan Tibra",
                    "user_href": "/profile/Manan-Tibra-1"
                },
                {
                    "user_id": "Omar Alahmad",
                    "user_href": "/profile/Omar-Alahmad-4"
                },
                {
                    "user_id": "Adam Schuster",
                    "user_href": "/profile/Adam-Schuster-4"
                },
                {
                    "user_id": "Thomas Castillo",
                    "user_href": "/profile/Thomas-Castillo-26"
                },
                {
                    "user_id": "Curtis Dennis",
                    "user_href": "/profile/Curtis-Dennis-5"
                },
                {
                    "user_id": "Avinash T",
                    "user_href": "/profile/Avinash-T-5"
                },
                {
                    "user_id": "Andrew McCluskey",
                    "user_href": "/profile/Andrew-McCluskey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kev Switz",
                "href": "/profile/Kev-Switz-1"
            },
            "answer_text": "Shoot me the link and I’ll tell you if it’s profitable. Also, not really. You don’t own the music or the app. Maybe if someone paid you to see how awesome it was, but then again I wouldn’t pay for anything unless I saw it, and once I’ve seen it I would know the songs on your list and then I wouldn’t need to pay for it. ",
            "date": "Answered February 25, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James O'Toole",
                "href": "/profile/James-OToole-14"
            },
            "answer_text": "Profiting from creating Spotify playlists is actually against the terms and conditions. There are plenty of people offering paid placement on their playlists, but they can and will be banned and the playlists deleted if Spotify dicovers they are charging people to be added to their playlists. ",
            "date": "Answered July 21, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}