{
    "title": "Can I find someone to write lyrics to a song? How? - Quora",
    "tags": [
        "Songwriting",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Tannehill",
                "href": "/profile/Dan-Tannehill"
            },
            "answer_text": "Yes, you can. Find a local venue that hosts an “open mic.” Start showing up and listening to the music. Many singer/songwriters like to showcase stuff they’ve written and use these venues. Listen, first off, to see which performers play the style of music you like-you may have to search around for a few different places. Then listen for key phrases in the between song banter. They will normally say if it’s a song they wrote, or give a personal story of the song’s inspiration. Then you need to become a regular. Joe Blow off the street isn’t as important to a performer as is a regular listener. Once you’ve established a report’ with the songwriter, most are always on the prowl for new ideas. Good Luck! ",
            "date": "Answered September 14, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devyn Thomas",
                    "user_href": "/profile/Devyn-Thomas-5"
                },
                {
                    "user_id": "Dimitri Czapkiewicz",
                    "user_href": "/profile/Dimitri-Czapkiewicz"
                },
                {
                    "user_id": "Tage Hamre",
                    "user_href": "/profile/Tage-Hamre"
                },
                {
                    "user_id": "Tiago Martins Correia",
                    "user_href": "/profile/Tiago-Martins-Correia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anshita Sahay",
                "href": "/profile/Anshita-Sahay"
            },
            "answer_text": "Hey, Yes you can find someone who can write lyrics. First you should ask your friends and known ones who write some kind of songs, poems, gazals, shayari. Then sing that song or poem in your style. Lyricists are not hard to find. This is the best from my side. All the best. ",
            "date": "Answered October 3, 2017",
            "views": "349",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shlok Nigam",
                    "user_href": "/profile/Shlok-Nigam"
                }
            ]
        },
        {
            "author_info": {
                "name": "CS Niraj Chhipa",
                "href": "/profile/CS-Niraj-Chhipa"
            },
            "answer_text": "Yeah you can find them. Every thing can be outsource. Depends what kind of lyrics you want as I too write lyrics. You can find them on Instagram, Facebook and other social sites, and detect them your genre of song and after that they will write lyrics. I hope you are satisfied by my answer ",
            "date": "Answered September 13, 2017",
            "views": "227",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah May",
                "href": "/profile/Sarah-May-362"
            },
            "answer_text": "There is a fantastic website called Soundbetter: Recording Studios, Mixing & Mastering Engineers, Singers | SoundBetter You can hire musicians of all kinds. Lyricists, composers, producers, live musicians, studio engineers, etc. They are all artists typically involved in the industry and are experienced in writing music for other artists. Hope this helps! ",
            "date": "Answered October 20, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neil Bullock",
                    "user_href": "/profile/Neil-Bullock-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitri Czapkiewicz",
                "href": "/profile/Dimitri-Czapkiewicz"
            },
            "answer_text": "You can join this little new space…Song- Music-Collaboration here on Quora and just ask. Or even ask on this site: Making Hit Records there are many more ways here on Quora - but asking and looking around on this platform is good. You can also try the poetry spaces? ",
            "date": "Answered June 26, 2020",
            "views": "57",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Diana Smith",
                    "user_href": "/profile/Diana-Smith-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diana Smith",
                "href": "/profile/Diana-Smith-17"
            },
            "answer_text": "I’m a very bored lyricist at this moment, I write for several major bands in and out of the USA. I could try to topline for your melody, which might be interesting to do. ",
            "date": "Answered October 16, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eduardo Palacios",
                "href": "/profile/Eduardo-Palacios-13"
            },
            "answer_text": "Can't tell you really song writers write songs that come from their personal experiences but you could ask you might luck out ",
            "date": "Answered June 28, 2020",
            "views": "20",
            "upvotes": " Answer requested by Dimitri Czapkiewicz"
        }
    ]
}