{
    "title": "Can a musician legally credit someone else on a song that they had no part in creating? - Quora",
    "tags": [
        "Music Industry Law",
        "Music Copyrights",
        "Copyright Law",
        "Music Industry",
        "Musicians",
        "Songs",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Earl Burton",
                "href": "/profile/Earl-Burton-3"
            },
            "answer_text": "A musician can do whatever the heck they want with the credits for their work. There’s a classic story that exemplifies this point. When he was in school, George Michael wrote the lyrics to “Careless Whisper” and built the music around it. When he and his Wham! co-hort Andrew Ridgeley were putting together their masterpiece Make It Big, Michael brought out the song and it was put on the record. Despite never penning one iota of the song, Michael added Ridgeley as a co-writer of the song so that he could benefit from any future royalties that the song would have - a lifetime pension, so to speak, for Ridgeley. The Story of... 'Careless Whisper' by George Michael It was also common in the 1950s for people to put their names in as songwriters to capture even more of the royalties. Dick Clark did this, as did Alan Freed, to artists that they would then play on their radio programs and make popular. Alan Freed & Dick Clark: Two Stories, One Scandal So, as you can see, it is something that was done quite a bit. Today? Hard to tell just how much someone does on a record when you have seven songwriters, six producers and three arrangers. ",
            "date": "Answered July 13, 2020",
            "views": "111",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Nizam",
                    "user_href": "/profile/Michael-Nizam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "If they actually had no part in the song, then you are trading off the name and identity of that person to sell your product. As you seemed to have guessed, that's not ethical. And is, in fact, illegal. Personality rights do not allow you to use someone's name for promotion of a product or organization without consent. ",
            "date": "Answered July 12, 2020",
            "views": "32",
            "upvotes": " Answer requested by Michael Nizam",
            "upvoters": [
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-805"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Basko",
                "href": "/profile/Sue-Basko"
            },
            "answer_text": "Certain types of pop singers often take songs that someone else already wrote and then, as part of a production deal, put their name on it as a co-songwriter. The songwriters don’t usually like this set up, but they are forced to agree to it if they want their song recorded by that pop singer. ",
            "date": "Answered July 12, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-805"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Foster",
                "href": "/profile/Jake-Foster-57"
            },
            "answer_text": "I mean, sure. Why not? Hell, tell them to write a word down. Any word. Put it in the song, and there ya go. You wouldn’t even be lying. Or just tell them to play a note if it’s an instrumental. ",
            "date": "Answered July 12, 2020",
            "views": "70",
            "upvotes": " View 2 Upvoters"
        }
    ]
}