{
    "title": "Can the ten Beethoven’s violin sonatas also be appropriately referred to as sonatas for violin or piano? I want to perform one, but I only can if I successfully argue it’s a duet. - Quora",
    "tags": [
        "Ludwig van Beethoven (composer)",
        "Violins",
        "Pianos",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juliet Cunningham",
                "href": "/profile/Juliet-Cunningham-1"
            },
            "answer_text": "I just looked up the first sonata on IMSLP. You will have to look up the others yourself. The first edition (1799) of the first violin sonata calls it “A Sonata for Clavicembalo or Pianoforte with a Violin”. I recently played the second movement of the Mozart Violin Sonata in E Minor, which was also listed as a sonata for piano and violin, NOT violin and piano. If anything, the title makes it looks like Beethoven’s violin is itself the accompaniment. Many, if not most, of Robert Schumann’s songs for voice and piano are regarded as duets. Check the violin parts in the Beethoven Sonatas. How often does the violin play an accompaniment figure? Document this to your teacher. Good luck. ",
            "date": "Answered December 13, 2018",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip Mayor",
                    "user_href": "/profile/Philip-Mayor-1"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Reidy",
                "href": "/profile/Peter-Reidy"
            },
            "answer_text": "They are for two instuments. That makes them duets. Both the violin and the piano parts are difficult and interesting. You don’t say exactly what “can” means here. My surmise is that you want to perform one of the sonatas in a class or a competition, and whoever is running it thinks that the piano part is unequal to the violin part, as it might be in some lightweight encore piece. In that case your best move would be to find a pianist who wants to perform with you and who will make the case that playing the piano part is first-class music-making. Or do you mean that you have to present a two-violin piece? In that case I can’t advise you. ",
            "date": "Answered December 13, 2018",
            "views": "70",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Donahue",
                    "user_href": "/profile/Adam-Donahue-6"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Flewelling",
                "href": "/profile/Bill-Flewelling"
            },
            "answer_text": "Beethoven inherited a mature violin sonata idiom from Haydn and Mozart, which in typical fashion he expanded in his own way. In all of his violin sonatas the violin and piano are equal partners. ",
            "date": "Answered February 22, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        }
    ]
}