{
    "title": "Can video game music change the way you play? - Quora",
    "tags": [
        "Video Game Soundtracks",
        "Playing Video Games",
        "Video Game Industry",
        "Video Game Development",
        "Music Industry",
        "PC Gaming ",
        "Games",
        "Video Games",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Rimmer",
                "href": "/profile/Matt-Rimmer-6"
            },
            "answer_text": "I find sound plays a huge part in gaming.Music messes up timings for me because my natural instinct is to follow the beat.Sound is a distraction sometimes too. While it can be very useful to wear headphones and listen for other player's footsteps I have found that in some games the noise affects my concentration.A prime example is Gran Turismo: I had assumed that all the tyre and engine noises were giving me helpful clues and feedback but then one day the TV was on mute for some reason or other while I was playing. I found I stayed far more calm and collected and my thinking was sharper. I stopped making the odd silly mistake here and there. Turning the sound back up made the errors return.Sound tells us so much and music can affect us even more.Good music really improves a game. In my opinion the original Sonic game on the Sega Genesis/Megadrive has a near-perfect soundtrack. You grab certain pick ups and the music reacts instantly. Each level has a different character to it and the music supports each of them.Music creates an atmosphere that convinces you you're actually there (if it's good music). Music gets you psyched up for battle when it switches to being danger music.Music can strongly affect the way you do many things, not just gaming. ",
            "date": "Answered March 21, 2019",
            "views": "271",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "Tom Crooks",
                    "user_href": "/profile/Tom-Crooks-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayson Tyler",
                "href": "/profile/Jayson-Tyler"
            },
            "answer_text": "Yes. Sometimes a good song can really amp up the experience. And sometimes it can be very distracting, so I'll mess up more because I can't not focus on it. Sometimes it also does it's job super well, were it's supposed to add tension, like the theme for Hunk in RE 2 Remake. I don't play as well with it on, yet if I switch to the original soundtrack, I do much better. ",
            "date": "Answered March 24, 2019",
            "views": "49",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "Tom Crooks",
                    "user_href": "/profile/Tom-Crooks-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Mcpeak",
                "href": "/profile/Brett-Mcpeak-1"
            },
            "answer_text": "Personally yea it will. Slime Rancher makes me wanna chill out because it’s sound track is really chill ( I play it when I’m bored or have a headache). But then if I play doom or dying light I’m fast paced. Especially the chase music in dying light tells me what’s happening and that I need to straight up book and not look back. It just depends on what the game is and the soundtrack. Brett ",
            "date": "Answered March 21, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tom Crooks",
                    "user_href": "/profile/Tom-Crooks-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bauers",
                "href": "/profile/Michael-Bauers"
            },
            "answer_text": "I have read multiple stories of people driving around in Vice City games, just to drive around and listen to the car radio stations. So I think that’s a an argument for how music can change how someone plays a game. ",
            "date": "Answered March 21, 2019",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Crooks",
                    "user_href": "/profile/Tom-Crooks-6"
                },
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                }
            ]
        }
    ]
}