{
    "title": "Can anybody become a good guitar player? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "John Newman",
                "href": "/profile/John-Newman-138"
            },
            "answer_text": "Yes. Can anybody become a great guitar player like Page or Clapton? No. The question of ‘natural ability’ seems to deter more people from trying to learn guitar than just about anything else; which is a shame. First the facts: no matter what the internet guitar teachers try and tell you, natural musical ability is a real thing. Just like natural mathematical ability or natural athletic ability. Some people have it, some don’t. Does this mean you can never learn to play? Absolutely not. In fact I’d argue that there have been just as many successful rock guitarists who didn’t have natural ability as did. I look at it like this - natural talent in anything is a combination of innate ability plus innate affinity. Innate ability is probably genetic. not much you can do about that. Innate affinity just means that you’re drawn to certain things instead of others. The fact that you asked the question you did suggests you have an innate affinity for the guitar. But what if you’re lacking that innate ability? Well, in my opinion, that probably means you’ll never be the next Jimmy Page or Steve Vai or Derek Trucks. You might never become a great player but you can absolutely be a good one, and you can absolutely make a career out of it. Even those blessed with natural ability need to put in years and years of practice. For those of us without natural ability the need for hard work is even greater. George Harrison was not a natural musician the way Lennon and McCartney were. He made up for it by working even harder. Jay Jay French from Twisted Sister is another example. Neil Young, Mick Mars, the list goes on. To become good at anything requires years of practice. If it’s something you really want to do and enjoy doing it won’t seem like a chore. So yes, anybody can become a good guitar player. ",
            "date": "Answered August 16, 2019",
            "views": "753",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanjay Bindhani",
                    "user_href": "/profile/Sanjay-Bindhani-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Russell",
                "href": "/profile/Matthew-Russell-5"
            },
            "answer_text": "What constitutes a \"good\" player to you? What do you want to learn the skills to *do* as a guitarist?  It's all very well learning \"all the chords\" (although I doubt you really have learned all the chords), and you could happily learn \"all the scales\" and \"all the notes\" too, but in my opinion that won't make you a \"good\" guitarist any more than knowing \"all the words\" would make you a good writer, or knowing \"all the colours\" would make you a good painter. Theoretical knowledge is simply a tool for creating music, and a master craftsman can do more with one well-chosen tool than a clueless amateur in the same field can with a bag full. What would make you feel you were a \"good\" player?  Do you want to be able to write music?  Do you want to be able to work out \"by ear\" how to play any song you hear? Do you want to be able to play with a band?  Do you want to work out a repertoire of solo acoustic songs that girls like so you can impress people at parties?  Do you want to be able to play face-melting guitar solos?  Do you want to be a \"guitar hero\" that other players admire?  All of those will require different focus to achieve, but all might be considered \"good\". Most of them (all but the last one I reckon) are perfectly achievable to the majority of people too, I'd say, but any one of them would warrant a dedicated question in its own right. ",
            "date": "Answered December 24, 2012",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                },
                {
                    "user_id": "Tolu Omofaye",
                    "user_href": "/profile/Tolu-Omofaye"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Aranda",
                "href": "/profile/Steve-Aranda"
            },
            "answer_text": "Let's exchange the word \"good\" with competent.  I will presume competence to mean that you can play songs alone following basic progressions, and that you can also play together with the ensemble style of your choice, soloing, and filling as required.  No virtuosity, just the ability to play music to entertain yourself, and others.  Can you become a competent player by practicing daily?  Absolutely.   The sky is the limit if you are committed.  That being said it is pretty easy to get to the level I mentioned above with the help of a good teacher, or jam partner.  Check out Active Melody: Blues Guitar Lessons Online  The guy there is really clear in his teaching, it's very affordable, and it will up your level of play from beginner to intermediate fairly quickly if you practice. Good Luck - ",
            "date": "Answered April 14, 2015",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                },
                {
                    "user_id": "Alex Suchman",
                    "user_href": "/profile/Alex-Suchman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-1408"
            },
            "answer_text": "I am a frustrated guitar since the age of 10. I have really short fingers and they just cannot form some of the chords needed to become a really good guitarist. I realized early on I would never be anything more than a basic rhythm guitarist (and I even have my share of shortcomings there). I don’t think anyone else with my situation could either. I feel like there has to be at sliver of natural talent coupled with ability or everyone would be doing it. ",
            "date": "Answered April 19, 2019",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juris Klavins",
                "href": "/profile/Juris-Klavins-1"
            },
            "answer_text": "NYC tourist: ‘How can I get to Carnegie Hall?’ NYC local bystander: ‘Practice a lot’  ",
            "date": "Answered January 25, 2020",
            "views": "131",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Abraham",
                "href": "/profile/Nikhil-Abraham"
            },
            "answer_text": "imo the way to better your skills is to never be satisfied with What Uve learnt or already know.. Keep listening to various genres coz the styles of playing are So diverse.. Everythin from classical Flemenco to trash metal.. Percussive rhythm playin, arpegios, sweep picking, taping, legato , speed picking, slapping, modes, chord inversions, are some of the stuff worth checking out on youtube.. U decide for urself wat technique u wanna check out for now.. If u love it, ul learn it faster.. ",
            "date": "Answered December 23, 2012",
            "views": "956",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Maldonado",
                "href": "/profile/Henry-Maldonado"
            },
            "answer_text": "I get conflicting thoughts reading your question.  What is a decent guitar player to you?  It sounds like you have not defined that.  I get you know many Chords. Fine.  Maybe, the next step is to learn scales so that you can learn how single notes are played up and down the fret board. Just as a thought, you sound really rigid about your playing.  Almost suggesting all guitarist play a certain way and that is how you should play.  Something to know is that every guitarist at some point develops their own style and signature sound.  In my humble opinion, to do that you have to be less rigid. ",
            "date": "Answered December 23, 2012",
            "views": "683",
            "upvotes": "0"
        }
    ]
}