{
    "title": "Can a conductor also be a member of the same orchestra he conducts? - Quora",
    "tags": [
        "Symphony Orchestras",
        "Music Conductors",
        "Music Conducting",
        "Orchestral Music",
        "Classical Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preman Tilson",
                "href": "/profile/Preman-Tilson"
            },
            "answer_text": "Yes, but it isn’t common. In my first orchestral job, the bass clarinet player was also the assistant conductor, and would take the occasional pops concert or educational concert. It would be impossible to be the full-time conductor of an orchestra and also a regular member of that orchestra…except in the case of a conductor who plays as he or she conducts. Before the advent of the modern conductor at the beginning of the 19th century, it was common to conduct from the keyboard (and this is still done in some period instrument groups). So in that case, the conductor is in a sense a part of the orchestra (though not officially “on the roster” as a member). There also used to be “light” orchestras that specialized in things like Viennese waltzes, polkas, etc., sometimes lead by a violinist who would also play part of the time (though in more of a solo capacity). And sometimes a soloist also conducts the orchestra from the keyboard or violin, though they are not “a member of the same orchestra.” Sometimes the concertmaster has to step in for a conductor suddenly taken ill. That is extremely rare - most concertmasters don’t know anything about conducting, and there is usually someone else more qualified on hand. I have worked with musicians who decided to give up their orchestral career to pursue conducting. A few of them have been successful enough to conduct their former colleagues on occasion. Strangely enough, several of them have been from the low end of the wind and brass sections - two trombone players, a tuba player and a contrabassoonist. ",
            "date": "Answered September 19, 2019",
            "views": "928",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Nelson Jenstad",
                    "user_href": "/profile/Nelson-Jenstad"
                },
                {
                    "user_id": "Clement Ng",
                    "user_href": "/profile/Clement-Ng-9"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                },
                {
                    "user_id": "Leo Meyer",
                    "user_href": "/profile/Leo-Meyer-4"
                },
                {
                    "user_id": "Gustavo Britos Zunin",
                    "user_href": "/profile/Gustavo-Britos-Zunin"
                },
                {
                    "user_id": "Inez Spuijman",
                    "user_href": "/profile/Inez-Spuijman"
                },
                {
                    "user_id": "Mark Jordan",
                    "user_href": "/profile/Mark-Jordan-90"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Kefira Ashe",
                    "user_href": "/profile/Kefira-Ashe"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erez Henya",
                "href": "/profile/Erez-Henya"
            },
            "answer_text": "I tend to believe that while this could, in some extreme scenarios work to some very basic degree, a concert in which both the principal conductor and their replacement go missing mysteriously at the last minute, should be put off than turned into a disaster. Maybe there happens to be a player in the orchestra who has enough background in conducting (e.g. one who has taken masterclasses in the past), who also happens to have a particularly profound knowledge of all the pieces to be played tonight—and not just their parts, who miraculously is also admired enough by their peers for them to graciously and humbly take commands from him or her. Is this enough? what about the style of conducting or the dozens of cues that the musicians have learned to rely on during the rehearsals? will the poor musicians have to pick up a new sign language on the fly? after all, the emerging conductor surely hadn’t followed every little gesture of the principal conductor while also playing their part. I think you’re getting the point. If you love conducting, go pursue your dream. You won’t get a second chance. ",
            "date": "Answered October 8, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "JD Mitchell",
                "href": "/profile/JD-Mitchell-2"
            },
            "answer_text": "Thanks for A2A… Q: Can a conductor also be a member of the same orchestra he conducts? Yes. In 1886 Arturo Toscanini was 19-years old and was cellist in a touring company performing Aida. He turned up for one performance to discover the conductor had resigned in a huff and his deputy had been booed off the podium. As he had been responsible for rehearsing the chorus he was given a baton and told to go and conduct the opera. He did so, so successfully that he continued as conductor the rest of the season. It helped that he had memorized the score… In time he became the greatest conductor of his age. But this sort of thing is the exception rather than the rule. (Note: they still only paid him as a cellist for that first season, and it didn’t strike him as odd.) ",
            "date": "Answered September 28, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                },
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Hunter",
                "href": "/profile/John-Hunter-166"
            },
            "answer_text": "Actually, the most common scenario is the concertmaster leading a piece. Robert Chen just led the Chicago Symphony in a Mozart Violin Concerto last season. Johann Strauss, Jr. famously led his Viennese orchestra this way; a tradition that continues to this day. Pinchas Zukerman did this for years as the Saint Paul Chamber Orchestra’s conductor on his own concerto performances. In actuality, there were many, many times, when an incompetent conductor was in front of us, that even a group of 90 musicians kept our eyes glued on our concertmaster to get entrances together and cues for tempo. ",
            "date": "Answered September 19, 2019",
            "views": "53",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nelson Jenstad",
                    "user_href": "/profile/Nelson-Jenstad"
                },
                {
                    "user_id": "Jeff Hamacher",
                    "user_href": "/profile/Jeff-Hamacher"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Pickering",
                "href": "/profile/Roger-Pickering-3"
            },
            "answer_text": "Well it's not common but does happen that a pianist performing a concerto will also conduct the orchestra (except during the difficult bits - no! Except when the piano is supposed to be playing.) Andre Previn certainly did this, and I think Leonard Bernstein did too. And actually I believe Mozart may have been the first to do it, but of course he composed the concertos in the first place as well). Seriously, this works because the piano is a large and powerful instrument that is in any case separated from the orchestra. Come to think of it, Andre Rieu, the Dutch violinist also conducts his own orchestra. It wouldn't really be possible for the larger stringed instruments or anyway if the music isn't a concerto, where at least the soloist stands separately from the orchestra. ",
            "date": "Answered September 19, 2019",
            "views": "167",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                },
                {
                    "user_id": "Erik Dralle",
                    "user_href": "/profile/Erik-Dralle"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fuad Jada",
                "href": "/profile/Fuad-Jada-1"
            },
            "answer_text": "Yes. I have observed many Vivaldi performances where the conductor playes solo violin and conducts at the same time. Other performances, the conductor is leading from the harpsichord. HIP stands for Historically Informed Performance. The above does not apply to music requiring huge orchestra such as music by Mahler. ",
            "date": "Answered September 7, 2020",
            "views": "79",
            "upvotes": " Answer requested by Vickie Bellefontaine",
            "upvoters": [
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                },
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pallavisree Tambraparni",
                "href": "/profile/Pallavisree-Tambraparni"
            },
            "answer_text": "Yes. But it is not common. A conductor needs to stand in the center, where everyone can see him, hold the baton and conduct the whole orchestra. He needs to make sure that everyone is watching him for the cues. The conductor will usually turn his head side to side to each section of the orchestra or even his whole body to cue the tempos, syncopation, the dynamics, etc of the musical piece. This will be difficult to do if the conductor himself is also in the orchestra. The same thing goes for a conductor of a choir or a chorus. All the members of the chorus need to have their eyes on watching the conductor for cues on tempo changes, syncopation, dynamics, etc.. I hope this helps. ",
            "date": "Answered September 10, 2020",
            "views": "50",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                },
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helen Rupp",
                "href": "/profile/Helen-Rupp"
            },
            "answer_text": "Yes, but pretty much exclusively if they’re the lead violinist of the orchestra. If there are two conductors with the orchestra they can take turns between playing and conducting, but if the only conductor were to want to play in the orchestra as well as playing they would have to be at least a front desk strings player. This is because the position of the front desk can be seen by the whole orchestra, and also the bow can be used as a tool to keep tempo whilst playing. You’ll notice that moss baroque ensembles, especially performances of Vivaldi’s seasons, are conducted by the first desk first violinist/soloist. Also *ahem* female conductors exist ",
            "date": "Answered September 30, 2020",
            "views": "39",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clement Ng",
                    "user_href": "/profile/Clement-Ng-9"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Sullivan",
                "href": "/profile/John-Sullivan-619"
            },
            "answer_text": "Conductor, yes. Music Director, no. The latter would be unworkable. As to the former, our 3rd seat trumpet player is conducting a program with us this very week. And there’s another part time musician who plays with us on occasion and is frequently hired to conduct. The only thing that would be unworkable would be conducting and playing the same concert, unless perhaps this person played a solo from the podium. ",
            "date": "Updated September 24, 2019",
            "views": "41",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Jeff Hamacher",
                    "user_href": "/profile/Jeff-Hamacher"
                },
                {
                    "user_id": "Iriuchijima Ken",
                    "user_href": "/profile/Iriuchijima-Ken-入内島-健"
                },
                {
                    "user_id": "Séverine Godet",
                    "user_href": "/profile/Séverine-Godet-1"
                },
                {
                    "user_id": "Vickie Bellefontaine",
                    "user_href": "/profile/Vickie-Bellefontaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Holmén",
                "href": "/profile/Robert-Holmén"
            },
            "answer_text": "The most common instance of this is a chamber orchestra where the concertmaster (the first violin) is leading it. This works in small ensembles where everyone knows what they are dong and don’t need more than a few head nods from the concertmaster to stay in one piece. A large orchestra needs a conductor on a podium, however. The conductor is a member of the orchestra in the sense that his/her paycheck is cut by the same org that pays the players. They are employees like everyone else. Here is a an ensemble that appears to have no conductor, but there is one in plain sight. Can you tell who it is?  . . . . . . . . It’s the trombone player in the center. He’s cueing the entrances and cutoffs with the tip of his slide. ",
            "date": "Answered September 20, 2019",
            "views": "338",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "James Linn",
                    "user_href": "/profile/James-Linn-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andi Alexander",
                "href": "/profile/Andi-Alexander"
            },
            "answer_text": "You mean play an instrument in the orchestra while conducting? No. He would need both hands for both things. That’s four hands. People don’t have four hands. The exception is with early music with a small chamber ensemble playing. Usually a harpsichord and string quartet. Maybe a flute or oboe. The harpsichordist leads the ensemble, and accompanies the recitatives which are led by the singer. This isn’t done with actual conducting, mostly just head cues from the harpsichordist as he plays. ",
            "date": "Answered September 20, 2019",
            "views": "64",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Linn",
                "href": "/profile/James-Linn-2"
            },
            "answer_text": "In my small chamber choir our conductor is also our accompanist, unless we are singing acapella. So we don't get more than a downbeat, we are expected to get the pulse from the harpsichord. I have seen the same in small orchestral groups. But the larger the group the more important a separate conductor is. ",
            "date": "Answered September 19, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Firda Fairuz",
                    "user_href": "/profile/Firda-Fairuz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Hamacher",
                "href": "/profile/Jeff-Hamacher"
            },
            "answer_text": "In addition to the various affirmative answers that you’ve received, I’d add the example of the Orpheus Chamber Orchestra which performs with no “dedicated” conductor. Orpheus Chamber Orchestra ",
            "date": "Answered September 22, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihail Ghiga",
                "href": "/profile/Mihail-Ghiga"
            },
            "answer_text": "Yes. There are a few pianist who did or do this, and it’s current in baroque music too. The smaller the orchestra, the easiest is. It will NOT work for big works, like a Stravinski, for opera, and so on. ",
            "date": "Answered September 20, 2019",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Baldassarre",
                "href": "/profile/Joseph-Baldassarre-1"
            },
            "answer_text": "Conductors are most often a member of their orchestra in their position as conductor (as opposed to guest conductors). In the 18th century, the conductor was often the harpsichordist or the concert master (1st chair, 1st violin). ",
            "date": "Answered January 28, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Ross Driedger",
                    "user_href": "/profile/Ross-Driedger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonny Meyers",
                "href": "/profile/Sonny-Meyers"
            },
            "answer_text": "Sure. Happens all the time in smaller orchestras. ",
            "date": "Answered September 19, 2019",
            "views": "20",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Faxon Gallo",
                "href": "/profile/Emily-Faxon-Gallo"
            },
            "answer_text": "In a professional situation, very unlikely. The conductor is drawing a salary for conducting, and the players are paid as well. ",
            "date": "Answered September 22, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Rosenzweig",
                "href": "/profile/Michael-Rosenzweig-2"
            },
            "answer_text": "Yes ",
            "date": "Answered September 23, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        }
    ]
}