{
    "title": "Can you do university while you are in a K-pop band? - Quora",
    "tags": [
        "K-Pop Bands",
        "Bands (music)",
        "Music Industry",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andi Roselund",
                "href": "/profile/Andi-Roselund"
            },
            "answer_text": "Many do, but if and how (1) professors will allow a compromise or not during for inevitable absences during one’s term of promotion, and (2) what is permitted by management and the entertainment company really depends. I saw Kim Dong-Ryul (전람회) on campus at Yonsei University during our freshman year just as he was promoting possibly the biggest K-pop ballad of all time (기억의 습작), I often would see JYP in one of the cafeterias at school during the term of promotion of his second album (Fall 1995), and I myself was active on Inkigayo and all the big shows with Joybox while attending grad school in 2001. No doubt it was the craziest semester of my life.  And hey look, it’s a former student of mine!  That’s right, a number of years ago I lectured a block of classes once a week at GDU[1] (Music Department chair held by original K-pop “flower boy” Kim Won-Jun), and Niel from Teen Top was actually in my freshman Pop Music History class. To be sure, he wasn’t there most of the time, and come finals, we had to do a proper work-around with his submitted homework and projects to make sure he was eligible to get credit for the class. All worked out. Note that schools that have celebrities enrolled really like to hype the fact that the student body in enriched with such influencers, and promotional materials and advertisements often have them featured to highlight this-and-that about a school. And much of it is quite warranted when it comes to image and personality: no lie, Park Bo-Gum was a student in one of my best friends’ classes at Myongji University, [2] and the fellow is/was a proper champ, as (up to his enlistment) he would still send holiday greetings to my friend at Chuseok and Seol, even years after taking the class. All in all, there are no written rules, and everything depends on the school and one’s allotted enrollment/deferment, K-pop group’s term of promotion, and what a entertainment company chooses to allow for active artists under contract. Footnotes[1] 강동대학교 > 실용음악학과[2] 명지대학교",
            "date": "Answered September 23, 2020",
            "views": "265",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charlotte Miller",
                "href": "/profile/Charlotte-Miller-269"
            },
            "answer_text": "You have to be willing to be the starving artist. Jobs, University, etc., puts your K-pop band into the hobby category. They take up most of your attention and energy. You cant be half in this, half in that. You have to be full into what you're doing, or else your efforts will be too diffuse. You have to really face yourself and ask yourself what you want to be, and if you’re willing to face the suffering that comes with the Artistic life. If you can work through the suffering, eventually the suffering will be a walk in the park, and suddenly you’re doing great, and in the habit of permanent growth. It’s a leap of faith and ruthless effort. ",
            "date": "Answered September 23, 2020",
            "views": "161",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Davis",
                    "user_href": "/profile/Faith-Davis-198"
                },
                {
                    "user_id": "Frankie Boon",
                    "user_href": "/profile/Frankie-Boon"
                },
                {
                    "user_id": "Emily Stevens",
                    "user_href": "/profile/Emily-Stevens-259"
                },
                {
                    "user_id": "Natalie Johnson",
                    "user_href": "/profile/Natalie-Johnson-660"
                },
                {
                    "user_id": "Charles Richards",
                    "user_href": "/profile/Charles-Richards-103"
                },
                {
                    "user_id": "Samantha Boyd",
                    "user_href": "/profile/Samantha-Boyd-114"
                },
                {
                    "user_id": "Rachel Bradford",
                    "user_href": "/profile/Rachel-Bradford-35"
                },
                {
                    "user_id": "Kayla Ray",
                    "user_href": "/profile/Kayla-Ray-110"
                },
                {
                    "user_id": "Dorthy Gaines",
                    "user_href": "/profile/Dorthy-Gaines"
                },
                {
                    "user_id": "Faith Yorkshire",
                    "user_href": "/profile/Faith-Yorkshire"
                },
                {
                    "user_id": "David Bradford",
                    "user_href": "/profile/David-Bradford-187"
                },
                {
                    "user_id": "Amy Anderson",
                    "user_href": "/profile/Amy-Anderson-637"
                },
                {
                    "user_id": "Jessie Welsh",
                    "user_href": "/profile/Jessie-Welsh-4"
                },
                {
                    "user_id": "Wendy Peluso",
                    "user_href": "/profile/Wendy-Peluso"
                },
                {
                    "user_id": "Gwen Walden",
                    "user_href": "/profile/Gwen-Walden-3"
                },
                {
                    "user_id": "Olivia Caruso",
                    "user_href": "/profile/Olivia-Caruso-9"
                },
                {
                    "user_id": "Isla Perez",
                    "user_href": "/profile/Isla-Perez-4"
                },
                {
                    "user_id": "Caitlyn Davis",
                    "user_href": "/profile/Caitlyn-Davis-71"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zoe Yousefi",
                "href": "/profile/Zoe-Yousefi-2"
            },
            "answer_text": "Meet SF9 “smartest” member and their “brain”.  Yup Inseong from SF9 did so. During Enough era or Mamma Mia era he studied on Kyunghee University (His hair color says that, plus he said it on Idol room so yeah).  He had to focus both on studies and promotion, but yet he scored over 800 in the test🤓!! (He's smart, that's why he put ice cubes on the bowl under gas when he wanted to cook something (I mean he could use water, it would melt🙄 But he's adorable tho😄))  Bye ",
            "date": "Answered September 21, 2020",
            "views": "167",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jamila Francis",
                    "user_href": "/profile/Jamila-Francis-10"
                },
                {
                    "user_id": "Jennifer Wallace",
                    "user_href": "/profile/Jennifer-Wallace-286"
                },
                {
                    "user_id": "Zahraa Zerkan",
                    "user_href": "/profile/Zahraa-Zerkan"
                },
                {
                    "user_id": "Indah Nur",
                    "user_href": "/profile/Indah-Nur-8"
                },
                {
                    "user_id": "Edweena",
                    "user_href": "/profile/Edweena-1"
                },
                {
                    "user_id": "Annick Christa",
                    "user_href": "/profile/Annick-Christa"
                },
                {
                    "user_id": "Esmer Itsuki",
                    "user_href": "/profile/Esmer-Itsuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bell Martin",
                "href": "/profile/Bell-Martin-4"
            },
            "answer_text": "Yes but it would be difficult. You could do online courses too, many idols still went to college but it is very difficult especially with schedules. But it also depends on how active and busy a group is. A population group will have trouble finding the time, but a group that has very little activities and popularity might not have much of an issue. ",
            "date": "Answered September 21, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}