{
    "title": "Can I audition in YG if I don't know how to speak Korean? - Quora",
    "tags": [
        "YG Entertainment",
        "Auditions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lumiere Belle",
                "href": "/profile/Lumiere-Belle"
            },
            "answer_text": "Hello!!! Yes you can, go for it!!! Lisa from Blackpink was the first foreign trainee and idol at YG entertainment. She said when she first came to South Korea all by herself, she didn't know any word other than “Annyeonghaseyo\" which means “hello\". Now she is fluent in the language. Other trainees and staff weren't allowed to speak to her in any other language other than Korean. Lisa said this maybe one of the reasons she learned so quickly. Lisa trained for 5 years so I think YG made sure she was fluent in Korean since she was the first foreigner there. You will have to work hard, but in the end it is worth it. It's better to make sure that you know basic Korean so that you can communicate with your fellow trainees and instructors. I hope you got your answer, Have a great day, Lumiere belle ",
            "date": "Answered July 13, 2020",
            "views": "441",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth N. Ebbertt",
                    "user_href": "/profile/Elizabeth-N-Ebbertt"
                },
                {
                    "user_id": "Ash Wolfie",
                    "user_href": "/profile/Ash-Wolfie-1"
                },
                {
                    "user_id": "Anais Slabbinck",
                    "user_href": "/profile/Anais-Slabbinck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Lee",
                "href": "/profile/Jesse-Lee-51"
            },
            "answer_text": " Theoretically not. Most big entertainment companies in Korea are open and if you get selected as a trainee, it is most likely that you’ll have to follow courses to learn Korean. Many idols became trainee without speaking Korean, such as recently Sorn (CLC), or Prince Henry Mak talking[1] about his past experience: “I'm the alien here,\" says Mak. \"Sometimes they joke around and I don't understand.” And anyway, whatever your dream is, don’t stop at the first barrier, just do it!  Footnotes[1] Prince Mak: K-pop's Australian star",
            "date": "Answered October 9, 2018",
            "views": "840",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Senni Jokinen",
                    "user_href": "/profile/Senni-Jokinen"
                },
                {
                    "user_id": "Lina Han",
                    "user_href": "/profile/Lina-Han-13"
                },
                {
                    "user_id": "Ishanee",
                    "user_href": "/profile/Ishanee"
                },
                {
                    "user_id": "SB",
                    "user_href": "/profile/SB-345"
                }
            ]
        },
        {
            "author_info": {
                "name": "SkyLeeHarris Entertainment",
                "href": "/profile/SkyLeeHarris-Entertainment"
            },
            "answer_text": "Yes you can. YG along with lots of other companies are doing global auditions now meaning that you can audition with your native language. If you do get into the company they will teach you Korean and if you are a minor they will teach you academic lessons like math, history, etc. I hope this helps you out. ",
            "date": "Answered January 2, 2019",
            "views": "266",
            "upvotes": "0"
        }
    ]
}