{
    "title": "Country Music: Which acts have been suspended from the Grand Ole Opry? - Quora",
    "tags": [
        "Country Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laura Boggs",
                "href": "/profile/Laura-Boggs-1"
            },
            "answer_text": "Hank Williams Sr. Wikimedia Commons Yes, even Hank Williams went too far. Williams may now be untouchable country music royalty, but in 1952 he was mostly a drunken, pill-popping mess. His unfortunate addictions peaked around the same time as his fame. The Opry finally had enough of Williams' repeated drunkenness and unannounced absences from shows. On August 11, 1952, they gave him the boot. Williams tragically passed away only months later. Fans have been petitioning to posthumously reinstate Williams for years. Skeeter Davis Facebook/efemeridas del Rock y Heavy Metal After 15 years on the show, Skeeter Davis went too far on air one night. At least in the eyes of the Opry. Perhaps at the height of her career, Davis began a December 8, 1973 performance by criticizing local police. Earlier in the week, throngs of Bill Lowrey's Christ Is The Answer Crusade descended upon Nashville to street preach. Police arrested 11 of the 200 members when customers at the nearby mall complained of harassment. Davis, who witnessed the ordeal, began her Opry performance that night by saying, \"This is really something that I should share. I didn't ask our manager, but they've arrested 15 people just for telling people that Jesus loves them. And that really burdened my heart, so I thought I would sing you all this song.\" The Opry promptly banned her for the unrehearsed on-air criticism, though she was reinstated a year later. Johnny Cash Google Creative Commons This one comes as no surprise. In fact, most people saw a reenactment of the moment that got Cash kicked out of the Opry in the Oscar-winning biopic Walk The Line. That scene where he drunkenly bashed out the stage lights with a microphone stand? Definitely happened. And it definitely earned Cash a ban from the Opry in 1965. Well, for three years at least. He eventually returned to even host TV specials from the historic stage beginning in 1969. Neko Case Flickr/Juan Bendana This one is a bit odd. In 2001, Neko Case got the opportunity to play the Grand Ole Opry Plaza Party, an outdoor event sponsored by the Opry. In the sweltering July heat, Case repeatedly asked for water or to take a break to offset her fear of impending heatstroke. But, to no avail. So the singer-songwriter took her shirt off, revealing her bra to the crowd for the rest of the set. Anybody familiar with summer festivals knows that outdoor daytime sets and exposed bras go hand in hand, but the Opry banned Case for life. Jerry Lee Lewis Flickr/kait jarbeau Well, Jerry Lee Lewis was never technically banned from the Opry, but he broke its two biggest rules. In 1973, Lewis experienced a bit of a career revival, thanks in part to new country-leaning tunes. When he was invited to play, the Opry asked him to refrain from singing any of his rock n' roll songs. And, seeing as it's a live radio show, to not curse. That was all out the window in a few minutes, when Lewis said, \"Let me tell you something about Jerry Lee Lewis, ladies and gentlemen: I am a rock and rollin', country-and-western, rhythm and blues-singin' mother******!\" He proceeded to play five times the length of a normal Opry set and brought the crowd to its feet. Dierks Bentley Tasos Katopodis/Getty Images Dierks Bentley is such an outlaw, he managed to get banned before he even got famous. Ok, it's not quite what it seems. Bentley actually had a job at now-defunct TV station The Nashville Network as a researcher. Being so close to the Opry, he'd stay late on weekends and slip backstage to mingle with the artists. Finally, Opry management kicked him out. But Bentley had the last laugh, getting inducted in 2005 and going on to be one of the Opry's best modern members. Drums Flickr/Dave Kobrehel Yep, the Grand Ole Opry was strictly a no-drums affair for decades after it first opened. Bob Wills ignored the Opry's rules in 1944 and brought a drummer, making him the (disputed) first artist to ever do so. Every now and then for the next 3 decades artists, like Jerry Reed, broke the rules without ruffling too many feathers. But full-time use of drums wasn't allowed until a management shift in 1974. There could be plenty of reasons to not allow drums. On one hand, technology at the time made it hard to broadcast music cleanly, and a big loud drum set may disrupt the storytelling of the songs. On the other, the Opry was a very traditional affair, and many saw the shift to drum usage in the 1950s as \"not real country.\" That's right. Even in the 50s people were saying that newfangled music ain't real country. ",
            "date": "Answered May 26, 2020",
            "views": "480",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jan Branger",
                    "user_href": "/profile/Jan-Branger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaelan Dreyer",
                "href": "/profile/Kaelan-Dreyer"
            },
            "answer_text": "These three great acts: Hank Williams Sr. yes Hank! was banned off the show in 1952 due to his addiction and was asked to sober up,unfortunately hank died in a car crash in 1953 before he could return. Still to this day the opry has not honorably reinstated him despite honoring him as a legend.there is a campaign to reinstate him (http://www.reinstatehank.com/) Johnny Cash was famously banned from the opry in 1965 during a drunk performance where he stomped on the stage lights. Eventually he would return a few years later. Neko Case this great alt country-noir singer (check her out if you haven't,she has a fantastic voice), was ridiculously banned for life from the opry after she took off her shirt to avoid a heatstroke during a opry sponsored outdoor performance. one of her albums Blacklisted is likely named from this ban. ",
            "date": "Answered February 4, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonny Armstrong",
                    "user_href": "/profile/Sonny-Armstrong-5"
                },
                {
                    "user_id": "Ralph Smith Sr.",
                    "user_href": "/profile/Ralph-Smith-Sr"
                },
                {
                    "user_id": "Doctor Pepper",
                    "user_href": "/profile/Doctor-Pepper-2"
                }
            ]
        }
    ]
}