{
    "title": "Did Charles Bronson ever say 'Badges? We don't need no stinking badges' in any film? - Quora",
    "tags": [
        "Charles Bronson (actor)",
        "Movie Lines",
        "Movie Quotations and Dialogue"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darren McDee",
                "href": "/profile/Darren-McDee"
            },
            "answer_text": "Maybe this would help. Badges? We don't need no stinkin' badges!\" is a widely quoted paraphrase of a line of dialogue from the 1948 film The Treasure of the Sierra Madre. [1] That line was in turn derived from dialogue in the 1927 novel, The Treasure of the Sierra Madre, which was the basis for the film. In 2005, the full quote from the film was chosen as #36 on the American Film Institutelist, AFI's 100 Years...100 Movie Quotes.i [2] The shorter, better-known version of the quote was first [citation needed] heard in the 1967 episode of the TV series The Monkees, \"It's a Nice Place to Visit\". It was also included in the 1974 Mel Brooks film Blazing Saddles, and has since been included in many other films and television shows. Check out these links Stinking badges - Wikipedia   ",
            "date": "Answered September 28, 2017",
            "views": "736",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reuben Wilder",
                    "user_href": "/profile/Reuben-Wilder"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Mullich",
                "href": "/profile/David-Mullich"
            },
            "answer_text": "The line “\"Badges, to god-damned hell with badges! We have no badges. In fact, we don't need badges. I don't have to show you any stinking badges, you god-damned cabrón and chinga tu madre!\" originated in the movie The Treasure of the Sierra Madre (1948), starring Humphrey Bogart and Walter Huston. Although the line has been paraphrased (typically as “Badges? We don’t need no stinking badges”) and parodied in many films and television shows, I can find no instance of Charles Bronson ever saying it. However, Bronson did appear in the television series The Man Behind the Badge (TV Series 1953–1955). ",
            "date": "Answered September 28, 2017",
            "views": "614",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Maguire",
                    "user_href": "/profile/Paul-Maguire-26"
                },
                {
                    "user_id": "Jon Painter",
                    "user_href": "/profile/Jon-Painter"
                },
                {
                    "user_id": "Maguluri sai Nitin",
                    "user_href": "/profile/Maguluri-sai-Nitin"
                }
            ]
        }
    ]
}