{
    "title": "Did the Beatles sell out in 1966? - Quora",
    "tags": [
        "History of The Beatles",
        "The Beatles (band)",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas J. Beaver",
                "href": "/profile/Thomas-J-Beaver"
            },
            "answer_text": "No. The tour made money, but ticket sales did decline relative to 1965. The tour — first Germany, Japan, The Philippines, then, starting Aug. 11, 1966, the US — was a financial success (meaning all venues but one made money — the Beatles' fee at each venue was either set or was a percentage of ticket sales, so The Fabbers were making out no matter what), but ticket sales did decline compared to the group's previous visit, in August 1965. Why? Mainly because a controversy erupted just as The Beatles were about to begin the tour in summer 1966 -- 'the John saying they’re more popular than Jesus controversy' ... (see below) ... and that did affect ticket sales in the US.  Here are the US Tour-Stop Venues ... Attendance vs Seating Capacity The US tour included several outdoor stadium venues, including Cleveland Stadium, RFK Stadium in DC, JFK Stadium in Philly, Cosley Field in Cinci, Busch Stadium in St. Louis, Cleveland Stadium, Dodger Stadium in LA, as well as Suffolk Downs Racetrack in Boston. In Chicago, The Lads played two nights at the Chicago Amphitheater, and about 500 seats went unfilled each time from the 13,500 capacity. In Detroit, at Olympia Stadium hockey arena, 30,000 fans attended the two nights there ... which I'd assume was capacity (15,000). At Cleveland Stadium, the attendance was 20,000 ... I don't know how many seats went up for sale, but that was not 'baseball capacity'. At RFK Stadium in DC, attendance was 32,164 ... again, not baseball capacity tho I don't know how many seats were put up for sale. At JFK Stadium in Philly, attendance was 20,000 ... less than half of the stadium's capacity (tho, again, I don't know how many seats were put up for sale.) At Maple Leaf Gardens in Toronto, the two shows had attendances of 15,000 and 17,000. At Suffolk Down in Boston, attendance was 25,000 (again, I don't know how many seats were put up for sale.) In Memphis' Mid-South Coliseum, which seats 13,300, the two shows were attended by 7,589 and 12,539 (down because of the Jesus-controversy … see below) The CInci show at Crosley Field was postponed to noon the next day, due to heavy rain (I don't know the final attendance). The Busch Stadium show in St. Louis had heavy rain as well, but the show went on ... 23,143 attended again, I don't know how many seats were put up for sale). Then the Fab Four returned to Shea Stadium in New York on August 23rd, where they performed to an audience of 45,000, compared with the 56,000 world record attendance they had achieved the previous year (still, the Beatles made more money from this appearance than they did their previous Shea concert, receiving $189,000 – which was a 65 per cent cut of the $292,000 gross ... that $189k equals roughly $2mil in today's dollars). At the Seattle Coliseum, the 3 pm show had an attendance of just 8,200 seats in a 15,000-seat arena. The evening show, however, was a sell-out -- with the gross gate for both shows reported at $118,071 – then “the biggest single day’s gross ever in (Seattle’s) entertainment history,” according to the show's producer. Of that amount, the Beatles received some $73,717.81 for the two shows. At Dodger Stadium in LA, a full capacity of 45,000 attended the show. (here's a shot of the Dodger Stadium concert set-up)   And finally, The Beatles' final paid concert of their career took place on August 29 at Candlestick Park in San Francisco.The band played to an audience of 25,000, leaving 7,000 tickets unsold. Due to the reduced ticket sales and the expense of paying the Beatles their prearranged $50,000 performance fee, this one concert stop resulted in a loss for the local production company. (much of the data above came from Pop History Dig)  The John saying they’re ‘more popular than Jesus’ controversy In March 1966, the London Evening Standard conducted interviews with each of the band for a series. And John happened to say, “Christianity will go, it will vanish and shrink. We’re more popular than Jesus now.” The comment raised narry a ripple in the UK. All of this changed when the US teen magazine Datebook reproduced the interview in early August 1966, just before the group was due to arrive in the country. Of course John didn’t CLAIM any kind of superiority over Jesus … Yes, it caused an uproar - but at the time I put it in the ‘all publicity is good publicity’ category … certainly the whole of the world - adults as well as teens - were now aware of the tour. And of course John didn't apologize ... once int eh US he was asked by the press about it, and 'explained' ... then 'explained again' ... each time probable just making things worse, lol. \"It was pointed out that fact, in reference to England ... that we meant more to kids than Jesus did ... [t was] more for England than here [in the US] ... I'm not saying that we're better, or greater, or comparing us with Jesus Christ ...\" (see: Thomas J. Beaver's answer to Was the damage to the Beatles' image from John Lennon's statement about the Beatles bigger than Jesus irreversible and much greater in strongly Catholic Roman Catholic nations than in the United States? ) Nevertheless, the Memphis, Tennessee city council voted to cancel the group's 19 August afternoon and evening concerts at the Mid-South Coliseum rather than have \"municipal facilities be used as a forum to ridicule anyone's religion\". The KKK nailed a Beatles LP to a wooden cross, vowing \"vengeance\", and conservative groups staged further public burnings of Beatles records. Although no problems took place during the afternoon show, an audience member threw a lit firecracker onstage that did not hit any of the members, but the band believed for that one moment that somebody had tried to shoot them ... each member of the Beatles looked at each other, wondering which of them had been hit.  The Germany, Japan, Philippines legs Before the final U-M leg portion, the Beatles toured Germany, Japan, and The Philippines, and the tour-troubles started over in Asia ... The bookings at the Budokan, Japan, a venue reserved for martial arts, offended many traditionalists in Japan, resulting in death threats to the Beatles and a heightened police presence throughout their stay. Then in Manila, the band's nonattendance at a social engagement hosted by Imelda Marcos led to a hostile reaction from citizens loyal to the Marcos, plus government officials and army personnel. The Beatles and their entourage were manhandled while attempting to leave the country and forced to surrender much of the earnings from the group's two shows.  (Here's a little tidbit of The Fabbers at Shea Stadium, Aug, 23,1966)  ",
            "date": "Answered May 29, 2020",
            "views": "285",
            "upvotes": " View 62 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Flack",
                    "user_href": "/profile/Steven-Flack-6"
                },
                {
                    "user_id": "Solly Marshall-Radcliffe",
                    "user_href": "/profile/Solly-Marshall-Radcliffe"
                },
                {
                    "user_id": "James Algeo",
                    "user_href": "/profile/James-Algeo-1"
                },
                {
                    "user_id": "Nick Mastro",
                    "user_href": "/profile/Nick-Mastro-8"
                },
                {
                    "user_id": "Al Hoffeld",
                    "user_href": "/profile/Al-Hoffeld-1"
                },
                {
                    "user_id": "Jacob M. Rivedal",
                    "user_href": "/profile/Jacob-M-Rivedal"
                },
                {
                    "user_id": "John Jewell",
                    "user_href": "/profile/John-Jewell-6"
                },
                {
                    "user_id": "Jackson Moore",
                    "user_href": "/profile/Jackson-Moore-23"
                },
                {
                    "user_id": "Rodney Hatley",
                    "user_href": "/profile/Rodney-Hatley"
                },
                {
                    "user_id": "Deb Rider",
                    "user_href": "/profile/Deb-Rider-1"
                },
                {
                    "user_id": "Dan Messersmith",
                    "user_href": "/profile/Dan-Messersmith-2"
                },
                {
                    "user_id": "Antonino Bongiovanni",
                    "user_href": "/profile/Antonino-Bongiovanni"
                },
                {
                    "user_id": "John Juett",
                    "user_href": "/profile/John-Juett"
                },
                {
                    "user_id": "Butch Johnson",
                    "user_href": "/profile/Butch-Johnson-17"
                },
                {
                    "user_id": "Charlie Walsh",
                    "user_href": "/profile/Charlie-Walsh-6"
                },
                {
                    "user_id": "Tony Craib",
                    "user_href": "/profile/Tony-Craib-1"
                },
                {
                    "user_id": "Paul Herrick",
                    "user_href": "/profile/Paul-Herrick-5"
                },
                {
                    "user_id": "John Southern",
                    "user_href": "/profile/John-Southern-6"
                },
                {
                    "user_id": "Gary Spinelli",
                    "user_href": "/profile/Gary-Spinelli-2"
                },
                {
                    "user_id": "John O Plumer Jr",
                    "user_href": "/profile/John-O-Plumer-Jr"
                },
                {
                    "user_id": "Grahame Woods",
                    "user_href": "/profile/Grahame-Woods-1"
                },
                {
                    "user_id": "Grant Porter",
                    "user_href": "/profile/Grant-Porter-8"
                },
                {
                    "user_id": "Isaiah Howansky (イザヤホワンスキー）",
                    "user_href": "/profile/Isaiah-Howansky-イザヤホワンスキー"
                },
                {
                    "user_id": "Benja Poupin",
                    "user_href": "/profile/Benja-Poupin"
                },
                {
                    "user_id": "Mark Pilkington",
                    "user_href": "/profile/Mark-Pilkington-13"
                },
                {
                    "user_id": "Kirtley Scott",
                    "user_href": "/profile/Kirtley-Scott"
                },
                {
                    "user_id": "Jocelyn Hurtubise",
                    "user_href": "/profile/Jocelyn-Hurtubise-1"
                },
                {
                    "user_id": "Joe Higgins",
                    "user_href": "/profile/Joe-Higgins-12"
                },
                {
                    "user_id": "Carlos Andres Barrera Espinosa",
                    "user_href": "/profile/Carlos-Andres-Barrera-Espinosa"
                },
                {
                    "user_id": "Connie Casella",
                    "user_href": "/profile/Connie-Casella"
                },
                {
                    "user_id": "Norman Kavanagh",
                    "user_href": "/profile/Norman-Kavanagh"
                },
                {
                    "user_id": "Bjorn Petersen",
                    "user_href": "/profile/Bjorn-Petersen-1"
                },
                {
                    "user_id": "Aniekan Thomas",
                    "user_href": "/profile/Aniekan-Thomas"
                },
                {
                    "user_id": "Tony Coleman",
                    "user_href": "/profile/Tony-Coleman-12"
                },
                {
                    "user_id": "Ed Tywoniak",
                    "user_href": "/profile/Ed-Tywoniak"
                },
                {
                    "user_id": "Leonardo Bosi",
                    "user_href": "/profile/Leonardo-Bosi-1"
                },
                {
                    "user_id": "Susan Erxleben",
                    "user_href": "/profile/Susan-Erxleben"
                },
                {
                    "user_id": "John Jensen",
                    "user_href": "/profile/John-Jensen-40"
                },
                {
                    "user_id": "Charles Winkler",
                    "user_href": "/profile/Charles-Winkler-6"
                },
                {
                    "user_id": "Tom Stanley",
                    "user_href": "/profile/Tom-Stanley-5"
                },
                {
                    "user_id": "Garland A. Gerard",
                    "user_href": "/profile/Garland-A-Gerard"
                },
                {
                    "user_id": "Terry Johnson",
                    "user_href": "/profile/Terry-Johnson-434"
                },
                {
                    "user_id": "Rick Adams",
                    "user_href": "/profile/Rick-Adams-111"
                },
                {
                    "user_id": "George Uman",
                    "user_href": "/profile/George-Uman"
                },
                {
                    "user_id": "Ron Cohen",
                    "user_href": "/profile/Ron-Cohen-51"
                },
                {
                    "user_id": "Walter Eskridge",
                    "user_href": "/profile/Walter-Eskridge-1"
                },
                {
                    "user_id": "Mark Cowras",
                    "user_href": "/profile/Mark-Cowras"
                },
                {
                    "user_id": "David Bell",
                    "user_href": "/profile/David-Bell-879"
                },
                {
                    "user_id": "Christopher McLaughlin",
                    "user_href": "/profile/Christopher-McLaughlin-35"
                },
                {
                    "user_id": "Randy Radcliff",
                    "user_href": "/profile/Randy-Radcliff"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                },
                {
                    "user_id": "Ivan Jordanov",
                    "user_href": "/profile/Ivan-Jordanov-4"
                },
                {
                    "user_id": "Toby Phillips",
                    "user_href": "/profile/Toby-Phillips-2"
                },
                {
                    "user_id": "George Hurst",
                    "user_href": "/profile/George-Hurst-5"
                },
                {
                    "user_id": "Marcus Kreider",
                    "user_href": "/profile/Marcus-Kreider"
                },
                {
                    "user_id": "Kurt Boyle",
                    "user_href": "/profile/Kurt-Boyle"
                },
                {
                    "user_id": "Mike Demsky",
                    "user_href": "/profile/Mike-Demsky"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                },
                {
                    "user_id": "Greg Knittel",
                    "user_href": "/profile/Greg-Knittel-3"
                },
                {
                    "user_id": "Mark Casey",
                    "user_href": "/profile/Mark-Casey-25"
                },
                {
                    "user_id": "Faustina Prima Aksara",
                    "user_href": "/profile/Faustina-Prima-Aksara"
                },
                {
                    "user_id": "Jonathan Ankin Dranoff",
                    "user_href": "/profile/Jonathan-Ankin-Dranoff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Virginia Abreu de Paula",
                "href": "/profile/Virginia-Abreu-de-Paula"
            },
            "answer_text": "Of course not. How could they still be there it is miracle. Because the campaign against there were strong. Most of their fans were teens at that time and parents were afraid to let them go as even Ku Klux klan was in front of the entrance in New York not to let them in. They were burning their pictures and records on the streets! As I said, it was a mirable they manage to give those concerts. It is miracle lots of people did go in spite of everything. But not the same amount of people like the previous years. So, they showed how strong they were because the concerts happened anyway, and those who went behaved just like before…girls screaming their love all the time. ",
            "date": "Answered June 9, 2020",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Butera",
                "href": "/profile/John-Butera"
            },
            "answer_text": "Did the Beatles sell out in 1966? Actually they sold out around 1963. Before they made it big in the U.S. they were kind of scruffy looking and wore leather suits. Then suddenly they started wearing matching suits without collars, got the mod haircuts , released songs aimed at 12 year old girls and allowed their record company to make 2 American albums out of each album released in Britain. A few years later they regained their integrity and started dressing as individuals and releasing better material. When they did that, another corporate run group stepped in to give the youngsters they type of music the Beatles used to perform … The Monkees. ",
            "date": "Answered May 29, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Matwick",
                "href": "/profile/Alexander-Matwick"
            },
            "answer_text": "I found the bookSell out maybe not a good answer. my answer would probably be no. I think Paul wanted to keep pushing the Beatles forward with more of the same but each one of them wanted to express their own music. Being a long term fan I found the book written by their Engineer Geoffrey Emerick was the best to explain some questions It's like being married like many other groups. Some get divorced and come back on their own and hire new players. …even Paul, Sting and a host of others. Read the book. ",
            "date": "Answered May 27, 2020",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harold Philip Benson",
                "href": "/profile/Harold-Philip-Benson"
            },
            "answer_text": "Sell out? To whom? For what? If anything, the GOT out of the very, very hectic schedule of touring with screaming girls in the audience. So loud they could not hear each other play and their playing deteriorated. Hostile people in the South of the USA came and yelled at them with signs, burned their albums and records, and banned them on their local radio stations because they didn’t understand what John Lennon meant when he said that the Beatles were more famous than Jesus. Once a firecracker went off in their tour of the southern USA at that time and they thought it was a gun shot at them because they were contantly in fear of assassins at the time. Sold out? You kidding? The GOT out to get safety and peace. ",
            "date": "Answered May 27, 2020",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lynn Granata",
                    "user_href": "/profile/Lynn-Granata-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trennon King",
                "href": "/profile/Trennon-King-2"
            },
            "answer_text": "If anything, they did the opposite when they concluded their touring to focus soley on their studio efforts. In the 60s, artists would typically go on tour to promote their records. By 1966, the Beatles already had a strong enough grip on pop culture. Having their name on an album was enough to sell millions of albums. And that's exactly what they did with Sgt. Peppers in 1967.  ",
            "date": "Updated June 9, 2020",
            "views": "207",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Moxey",
                "href": "/profile/Brian-Moxey-1"
            },
            "answer_text": "The Beatles never sold out at any time. They stopped touring in 1966 because they were tired of Beatlemania and all the mayhem and screaming that went with it. Instead, they concentrated on developing their songwriting and studio skills which resulted in Sgt Pepper’s Lonely Hearts Club band ",
            "date": "Answered May 27, 2020",
            "views": "95",
            "upvotes": "0"
        }
    ]
}