{
    "title": "Did Freddie Mercury study Music Theory? - Quora",
    "tags": [
        "Freddie Mercury",
        "Queen (band)",
        "Music History",
        "Music Theory",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Smith",
                "href": "/profile/Christopher-Smith-170"
            },
            "answer_text": "That depends on what you mean by “music theory”. As a musician myself, I have noticed that laypersons (non-musicians) tend to group all musical knowledge under the “music theory” umbrella, which is not the way musicians themselves think of it. Freddie Mercury took piano lessons as a child, and played in a lot of different bands as a teen. He claimed to “barely read music” but he obviously knew what chords and keys were, otherwise he wouldn’t have been able to compose the pieces he did, with wild modulations and tons of chords, some of which were medium complex (not just major and minor triads). Now, as for the term “study”. He probably learned the names of the notes, how to read treble and bass clef, basic rhythms, scales, keys, and chords. He probably didn’t go on to advanced studies in music theory, which is how musicians think of theory. The other stuff is just basics, most musicians know this, and I doubt Freddie was an exception, even if he didn’t have to read or notate much music. ",
            "date": "Answered December 18, 2018",
            "views": "19",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "MR. Junior",
                    "user_href": "/profile/MR-Junior-3"
                },
                {
                    "user_id": "Uros Djukanovic",
                    "user_href": "/profile/Uros-Djukanovic-1"
                },
                {
                    "user_id": "Jean Garaffo",
                    "user_href": "/profile/Jean-Garaffo"
                },
                {
                    "user_id": "Steve Rapaport",
                    "user_href": "/profile/Steve-Rapaport"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Salta Akhmetova",
                    "user_href": "/profile/Salta-Akhmetova"
                },
                {
                    "user_id": "Arati Chhetri",
                    "user_href": "/profile/Arati-Chhetri-2"
                },
                {
                    "user_id": "Nicolas Azéraut",
                    "user_href": "/profile/Nicolas-Azéraut"
                }
            ]
        }
    ]
}