{
    "title": "Did the Rolling Stones influence Bob Dylan? - Quora",
    "tags": [
        "Bob Dylan (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Austin",
                "href": "/profile/Chris-Austin-83"
            },
            "answer_text": "I guess the question comes from Bob Dylan’s Like a Rolling Stone song. Actually, its the pretty opposite. Bob Dylan wasn’t inspired by Rolling Stones. If anything then Dylan inspired The Rolling Stones. Not that he only inspired Rolling Stones but also Beatles. The Beatles were a cheesy band in early ‘60s, something serious had happened after 1964, that they became very innovative and gone wild on their music and playing psychedelic rock. Ironically this was the year when they had met Bob Dylan. Its not drugs that Dylan had passed. He also passed his influence on them. Bob Dylan was an original artist who was playing folk music. Later he tried electric guitar and went heavy. But that just wasn’t it. Bob Dylan was a very good harmonic player. He used his harmonica to drive wild sounds. And I can guess his high pitched harmonica solos made an impact on psychedelic music. He stuck to his folk roots with mixed of country and blues which ultimately led pop rock gone mixed with folk music and creating psychedelic rock. A prime example would be the Byrds. The Byrds were playing folk rock but later they diverted into psychedelic rock.  (The Byrds) So, its not a coincidence that most artists who were influenced by Dylan turned out to be psych rock. Initially they were British gents with combed hair and then they turned out with long messy hair. So, in conclusion what could be said that in UK there were great pop rock artists and out there in US there was Bob Dylan playing folk rock. And when it mixed it resulted psychedelic rock. Whereas in the case of Rolling Stones. They might not get influenced by Bob Dylan like Hendrix or Byrds but wouldn’t say they never liked Bob Dylan. While Dylan on the other hand remained same all his life. ",
            "date": "Answered August 29, 2020",
            "views": "448",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charalampos Xenophon Lampadarios",
                    "user_href": "/profile/Charalampos-Xenophon-Lampadarios"
                },
                {
                    "user_id": "Colleen Flannery",
                    "user_href": "/profile/Colleen-Flannery-9"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Todd",
                "href": "/profile/Jason-Todd-137"
            },
            "answer_text": "No, Woody Guthrie did. As he went along Dylan found himself more and more influenced by Appalachian folk, Irish funeral songs, hymnals, gospel and minstrel. Even his Sinatra covers make more sense when viewed in that context. I don’t claim a huge familiarity with Dylan, but from what I know, he has never been a “rocker” as most people understand the word. He’s not from the Chuck Berry or Bo Diddley 3/2 school like the Stones. He doesn’t boogie like the Dead nor he doesn’t crank up the volume like Neil Young. He doesn’t do “beats” or “groove”. Honestly, his attempts to “go modern” on albums like Empire Burlesque and Under the Red Sky are laughable. Dylan may have started his career in the Rock Era but he’s definitely not OF the Rock Era. ",
            "date": "Answered December 5, 2018",
            "views": "259",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Guilherme Carneiro",
                    "user_href": "/profile/Guilherme-Carneiro-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Barron",
                "href": "/profile/David-Barron-15"
            },
            "answer_text": "I don't think it was just The Stones that influenced Bob Dylan. I guess that by the time the British Invasion and the rise of folk-rock was in full swing that Bob Dylan had realised that he could only go so far on acoustic, and decided to go electric. Let us be thankful he did, because several careers would have been very different if Bob Dylan didn't go electric. ",
            "date": "Answered May 14, 2015",
            "views": "698",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Austin",
                    "user_href": "/profile/Chris-Austin-83"
                },
                {
                    "user_id": "Guilherme Carneiro",
                    "user_href": "/profile/Guilherme-Carneiro-5"
                },
                {
                    "user_id": "Raf Beenaerts",
                    "user_href": "/profile/Raf-Beenaerts"
                },
                {
                    "user_id": "Chandra Siburian",
                    "user_href": "/profile/Chandra-Siburian"
                },
                {
                    "user_id": "David Stewart",
                    "user_href": "/profile/David-Stewart-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Stewart",
                "href": "/profile/David-Stewart-8"
            },
            "answer_text": "Not as much as he influenced them.  Dylan has always been interested in going back to roots and finding the original source point as much as possible. Rather than being influenced by The Stones he was more influenced by the people that they drew from themselves. The Stones main cultural reference points were blues artists that influenced Dylan heavilly in his early days but less so as his career progressed. He didn't need to be influenced by an English interpretation of the music of Robert Johnson and Chuck Berry when he had the real thing himself. (Disclaimer- I'm a huge stones fan and not trying to put down their music in any way). ",
            "date": "Answered October 17, 2012",
            "views": "2",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrian Rego",
                    "user_href": "/profile/Adrian-Rego-3"
                },
                {
                    "user_id": "Chris Austin",
                    "user_href": "/profile/Chris-Austin-83"
                },
                {
                    "user_id": "Guilherme Carneiro",
                    "user_href": "/profile/Guilherme-Carneiro-5"
                },
                {
                    "user_id": "Jason Todd",
                    "user_href": "/profile/Jason-Todd-137"
                },
                {
                    "user_id": "Ed Newman",
                    "user_href": "/profile/Ed-Newman-1"
                },
                {
                    "user_id": "Raf Beenaerts",
                    "user_href": "/profile/Raf-Beenaerts"
                },
                {
                    "user_id": "Stanley Okimoto",
                    "user_href": "/profile/Stanley-Okimoto"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Maria Margarita",
                    "user_href": "/profile/Maria-Margarita-3"
                },
                {
                    "user_id": "Mitchell Martin",
                    "user_href": "/profile/Mitchell-Martin-7"
                },
                {
                    "user_id": "Giuseppe Longo",
                    "user_href": "/profile/Giuseppe-Longo"
                },
                {
                    "user_id": "Rohit Nagargoje",
                    "user_href": "/profile/Rohit-Nagargoje"
                },
                {
                    "user_id": "Saqib Fazal",
                    "user_href": "/profile/Saqib-Fazal"
                },
                {
                    "user_id": "Shahriar Dadgar",
                    "user_href": "/profile/Shahriar-Dadgar"
                },
                {
                    "user_id": "Deepanshu Mehndiratta",
                    "user_href": "/profile/Deepanshu-Mehndiratta"
                },
                {
                    "user_id": "Amy S. Melman",
                    "user_href": "/profile/Amy-S-Melman"
                },
                {
                    "user_id": "Tom J Hume",
                    "user_href": "/profile/Tom-J-Hume"
                },
                {
                    "user_id": "Prarabdh Mishra",
                    "user_href": "/profile/Prarabdh-Mishra"
                },
                {
                    "user_id": "Rob Russo",
                    "user_href": "/profile/Rob-Russo"
                },
                {
                    "user_id": "Parag Kulkarni",
                    "user_href": "/profile/Parag-Kulkarni"
                },
                {
                    "user_id": "Yann Tessier",
                    "user_href": "/profile/Yann-Tessier"
                },
                {
                    "user_id": "Johanan Devanesan",
                    "user_href": "/profile/Johanan-Devanesan"
                },
                {
                    "user_id": "Thomas Hemsley",
                    "user_href": "/profile/Thomas-Hemsley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Ashlock",
                "href": "/profile/Peter-Ashlock"
            },
            "answer_text": "I wouldn't think so. They both were influenced by American Rythmn and Blues from the fifies such as Howlin' Wolf and Muddy Waters and etc. Fishing in the same pond. ",
            "date": "Answered February 13, 2013",
            "views": "549",
            "upvotes": "0"
        }
    ]
}