{
    "title": "Did Paul McCartney die and get replaced? - Quora",
    "tags": [
        "Paul McCartney",
        "The Beatles (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas J. Beaver",
                "href": "/profile/Thomas-J-Beaver"
            },
            "answer_text": "Of course. Suddenly the ‘new Paul’ was singing alot in a rougher, more gravelly voice. And they suddenly stopped performing live … hmmmm. In Taxman, George sings, “My advice for those that die …” meaning Paul. And at the end of Strawberry Fields, if you slow the record down, John sings, “I buried Paul.” In A Day In The Life, John tells us, “He Blew his mind our in a car …” And, most importantly, when the song is played backwards, you hear, \"Paul is dead, miss him, miss him.” If you put a mirror in front of the Sgt. Pepper album cover, the words “Lonely Hearts” on the drum logo reads as \"1 ONE 1 X HE DIE 1 ONE 1.\" The original cover of 1966's Yesterday and Today album featured The Lads amid raw meat and dismembered doll parts — clearly, symbolizing McCartney's gruesome motor accident. On the cover of Abbey Road, Paul is barefoot - a sure sign that he is dead. And the procession across the road is a funeral. John is all in white, like a clergyman. Ringo as the mourner, is dressed in black. George wears jeans, like a gravedigger. Also, ‘this’ Paul holds his ciggie in his right had, whereas real-Paul was left-handed. And in Magical Mystery Tour, to the song “Your Mother Would Knew,” the boys are coming down stairs all dressed in white … somehow that’s futher proof, tho I forget why (edit: it’s that Paul’s carnation is black, the others’ red). “Fake Paul” married Linda Eastman of course … lucky boy. Let’s see … What else? I forget, all these years later — but there are many clues that we all poured over circa 1966. All great, marvelous fun, and - of course - complete nonsense (shhh … don’t tell anyone tho … and especially don’t tell Paul - he’s old now and the shock might “blow his mind out”). ",
            "date": "Updated September 18, 2019",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Willey",
                    "user_href": "/profile/Robert-Willey-8"
                },
                {
                    "user_id": "Aideen Ghafouri",
                    "user_href": "/profile/Aideen-Ghafouri"
                },
                {
                    "user_id": "Peg O'Connor",
                    "user_href": "/profile/Peg-OConnor-1"
                },
                {
                    "user_id": "Piet Nel",
                    "user_href": "/profile/Piet-Nel-4"
                },
                {
                    "user_id": "Tom Fisher",
                    "user_href": "/profile/Tom-Fisher-92"
                },
                {
                    "user_id": "Michael Morgan",
                    "user_href": "/profile/Michael-Morgan-309"
                },
                {
                    "user_id": "Derek Gandy",
                    "user_href": "/profile/Derek-Gandy-1"
                },
                {
                    "user_id": "Russell Crow",
                    "user_href": "/profile/Russell-Crow-8"
                },
                {
                    "user_id": "Yash Sharma",
                    "user_href": "/profile/Yash-Sharma-478"
                },
                {
                    "user_id": "Shamik Bhattacharjee",
                    "user_href": "/profile/Shamik-Bhattacharjee-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Willey",
                "href": "/profile/Robert-Willey-8"
            },
            "answer_text": "just think of how badly you are defacing his family if you think he died and was replaced. Why on god’s green earth would Paul’s family, who were a very loving close group of people, go along with some scheme to say their son was still alive? How did they fake not having the pain and agony of losing the child, sibling, etc? they would have had to have been cold-hearted calculating evil people to have ever gone along with such a scheme. and that’s just one thing…..as many so called “reasons” there are to believe Paul died, there are 1000x more reasons to prove he did not die. it’s silly. it’s nonsense. But, to still have this come up as conversation some 50 years later, just shows how impactful these 4 lads were on the world. ",
            "date": "Answered October 28, 2019",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Shelton",
                "href": "/profile/James-Shelton-3"
            },
            "answer_text": "I believe he did. In a interview in 1964,Paul McCartney said that he wanted to retire in 2 years. In between August and October of 1966 the whereabouts of him are not around. The current JPM says the following things in different interview: I do not imagine that I’m him,otherwise it would blow my head off He died in a car crash on a batty conk There are two Paul McCartney’s George Harrison said: Hello Billy to the current JPM There is a picture online of JPM driving a car in 1964 where he looks like he is wearing a mask and this was before the Rubber Soul album even came out:  What do you think. I could go on and on about it,yet what is the point? If he died then what point is in it to go on and on. ",
            "date": "Answered September 13, 2019",
            "views": "301",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Snead",
                "href": "/profile/Jay-Snead-1"
            },
            "answer_text": "The other three Beatles died and were replaced with doubles. McCartney staged this elaborate hoax of his death to distract the public from the truth. Clever, fellow, Sir Paul . . .  ",
            "date": "Answered June 13, 2020",
            "views": "252",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Gouldstone",
                    "user_href": "/profile/David-Gouldstone"
                },
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                },
                {
                    "user_id": "Preet Shah",
                    "user_href": "/profile/Preet-Shah-89"
                },
                {
                    "user_id": "Micheal Anthony",
                    "user_href": "/profile/Micheal-Anthony-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisab Sau",
                "href": "/profile/Lisab-Sau"
            },
            "answer_text": "This is a insane urban legend that Paul died on November 9, 1966 and the rumor began circulating around 1967. On 21 October 1969, the Beatles' press office issued statements denying the rumor, deeming it \"a load of old rubbish\" and saying that \"the story has been circulating for about two years – we get letters from all sorts of nuts but Paul is still very much with us\" A comparison of young and old Paul proves it is him. Young & old Beatles (With images) | The beatles ",
            "date": "Answered June 14, 2020",
            "views": "98",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Walshe",
                "href": "/profile/Sam-Walshe-2"
            },
            "answer_text": "Yeah it was really sad. Apparently it was a car accident. Luckily Billy Shears had more than a passing resemblance to Paul AND he sounded like him, so he took on his identity. It was all hushed up at the time. You wouldn’t know the difference would you? ",
            "date": "Answered June 13, 2020",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Micheal Anthony",
                    "user_href": "/profile/Micheal-Anthony-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Mansfield Jr",
                "href": "/profile/Don-Mansfield-Jr"
            },
            "answer_text": "No. ",
            "date": "Answered June 25, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wyatt Catlin",
                    "user_href": "/profile/Wyatt-Catlin"
                },
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                }
            ]
        }
    ]
}