{
    "title": "Did David Bowie sleep with Mick Jagger? - Quora",
    "tags": [
        "Mick Jagger",
        "David Bowie (musician, actor)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry Hrebien",
                "href": "/profile/Henry-Hrebien"
            },
            "answer_text": "Angie Bowie is the only person that’s put this forward, implying that the pair were having a homoerotic affair as she has said they were in bed and naked, but emphasized she saw nothing sexual going on as if she’s retreating from the gaping chasm of innuendo she just kick-started. Nobody else has come forward with any other similar allegations or confirmed what Angie says she saw. So, her whole story remains in the realm of suspect volition, salacious gossip, unsubstantiated rumour and urban legend. There are people who want to believe it happened and others who think the whole thing preposterous, and yet others, preposterous as it is to them, certainly possible, as anything would be possible in this life that passes like a surreal dream, and yet even more others who don’t really care, couldn’t give a fig. I’m in the couldn’t give a fig category. I see the story as just some sensationalist crap that fed into the image mill and reputations of both men. It went something like this, that Bowie being openly bisexual with a voracious sexual appetite that matched his coke consumption coulda and woulda and Jagger being equally the same, except primarily hetero, monkey manning around with fashion models and yet bisexually curious enough to cross the divide, also coulda and woulda. The reality was probably a lot more prosaic, normal and boring, that Mick Jagger and David Bowie were just good friends, they liked each other. They would sometimes hang out, be seen together in public but sex between them likely didn’t enter into the relationship. Bowie, for all his rep as a bisexual, was known by those who knew him best as being primarily hetero in his tastes with a fondness for black females. It’s the people that observe celebrities seen together as putting two and two together, ‘’oh, they must be having an affair.’’ And then the hearsay and the rumours start. ",
            "date": "Answered October 8, 2020",
            "views": "237",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Garrett Stokes",
                "href": "/profile/Garrett-Stokes"
            },
            "answer_text": "Why would you think that? I know there is speculation that they were found asleep together but Jagger has always maintained he is hetero and his string of girlfriends would seems to indicate this . Bowie experimented a lot in his youth and proclaimed he was bi sexual but everything would indicate he was more hetero than anything but with an eye for the exotic ! I think the bi publicity was true but announced for shock value at the time. He did lots of things at the time to get fame . No, I do not think they were in love . They were friends and rivals , that’s all ",
            "date": "Answered September 7, 2019",
            "views": "2",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Heine",
                    "user_href": "/profile/James-Heine-1"
                },
                {
                    "user_id": "Allyson Zaccaria",
                    "user_href": "/profile/Allyson-Zaccaria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Anderson",
                "href": "/profile/Neil-Anderson-30"
            },
            "answer_text": "The story goes that Angie found them in bed together. It’s never been confirmed by anyone, and the nearest I’ve heard to a sensible answer is that they were both drunk and/or high and crashed in the same bed. Bowie certainly slept with guys in the 60s and 70s, even if he did rather over sell the bisexuality image for sensationalism. I’ve never heard another rumour about Mick being bisexual. I would think it possible but unlikely. ",
            "date": "Answered July 31, 2018",
            "views": "47",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elisabeth Case",
                    "user_href": "/profile/Elisabeth-Case-3"
                },
                {
                    "user_id": "Kitsch",
                    "user_href": "/profile/Kitsch-6"
                },
                {
                    "user_id": "Genatzvalee .",
                    "user_href": "/profile/Genatzvalee"
                },
                {
                    "user_id": "Allyson Zaccaria",
                    "user_href": "/profile/Allyson-Zaccaria"
                },
                {
                    "user_id": "Jim Shelley",
                    "user_href": "/profile/Jim-Shelley-6"
                },
                {
                    "user_id": "Gerald Feltch",
                    "user_href": "/profile/Gerald-Feltch"
                },
                {
                    "user_id": "Alan Morrison",
                    "user_href": "/profile/Alan-Morrison-32"
                },
                {
                    "user_id": "Modesto Martinez",
                    "user_href": "/profile/Modesto-Martinez-5"
                },
                {
                    "user_id": "Michael Dwerryhouse",
                    "user_href": "/profile/Michael-Dwerryhouse-2"
                },
                {
                    "user_id": "Elizabeth Ellis",
                    "user_href": "/profile/Elizabeth-Ellis-40"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "R.C. Moore",
                    "user_href": "/profile/R-C-Moore"
                },
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "Mark Jordan",
                    "user_href": "/profile/Mark-Jordan-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Virginia Abreu de Paula",
                "href": "/profile/Virginia-Abreu-de-Paula"
            },
            "answer_text": "Only Mick can answer that. And he never talked about it. So nobody can answer it. We only know that Angie, Bowie’s first wife, suggested they had had an affair. She found them in bed once. They were in bed, but she didn’t see anything sexual. She concluded it was and possible it really was. But it doesn’t mean they were in love. David also never conffirmed it. This subject is still such a taboo most people keep their feelings in secret. ",
            "date": "Answered September 7, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Guilherme Carneiro",
                    "user_href": "/profile/Guilherme-Carneiro-5"
                },
                {
                    "user_id": "Garrett Stokes",
                    "user_href": "/profile/Garrett-Stokes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lars Erik Vestergaard",
                "href": "/profile/Lars-Erik-Vestergaard-1"
            },
            "answer_text": "Who knows?!?…the 70′ies was a pretty crazy time. Nobody was sober or clean. Maybe they did, but cant remember, maybe they didn't….all I know is, that everybody fucked everybody, smoked everything and drank everything back then…it was a pretty wild era. Ultimately my stand is: Who gives a fuck? It’s of no consequence to their artistic output. ",
            "date": "Answered June 23, 2019",
            "views": "32",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guilherme Carneiro",
                    "user_href": "/profile/Guilherme-Carneiro-5"
                },
                {
                    "user_id": "Genatzvalee .",
                    "user_href": "/profile/Genatzvalee"
                },
                {
                    "user_id": "Allyson Zaccaria",
                    "user_href": "/profile/Allyson-Zaccaria"
                },
                {
                    "user_id": "Angela Goodale",
                    "user_href": "/profile/Angela-Goodale"
                },
                {
                    "user_id": "Khamille Lim",
                    "user_href": "/profile/Khamille-Lim"
                },
                {
                    "user_id": "Heather Hutchi",
                    "user_href": "/profile/Heather-Hutchi"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Heine",
                "href": "/profile/James-Heine-1"
            },
            "answer_text": "Don't be ridiculous. A crap book by a hack writer claimed that, amongst other things about Mick. Both those men are straight. Mick himself dismissed this rumor as, 'insipid rubbish'. ",
            "date": "Answered April 15, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elizabeth Ellis",
                    "user_href": "/profile/Elizabeth-Ellis-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Lewanski",
                "href": "/profile/Karl-Lewanski-1"
            },
            "answer_text": "Admired each other. Just two honey guys. ",
            "date": "Answered September 7, 2019",
            "views": "146",
            "upvotes": " Answer requested by Tom Branagan"
        }
    ]
}