{
    "title": "Did Paul McCartney look for anyone besides Denny Laine to complete the major three-person portion of Wings (Paul+Linda+_____)? - Quora",
    "tags": [
        "Paul McCartney",
        "The Beatles (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Curt Bourque",
                "href": "/profile/Curt-Bourque"
            },
            "answer_text": "Former Beatle Paul McCartney with his wife Linda on keyboards, and session drummer Denny Seiwell recruited former Moody Blues guitarist Denny Laine to join the group.  Seiwell, Laine, Linda, and Paul… Hugh McCracken had been asked to be a part of Wings and passed on the offer before Laine was asked. So Laine was originally the 4th to join Wings until Seiwell left. Laine remained as a core member with Paul and Linda until the band broke up nearly a decade later. There was never an intent to have a three person core to the group but when two left just before recording the award winning Band On The Run album it worked out that way. The band went through several pairs of drummers and guitarists but the trio remained the same, producing some of the finest music of the 1970’s. ",
            "date": "Answered September 23, 2018",
            "views": "131",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Strickland",
                    "user_href": "/profile/Jon-Strickland-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hooper",
                "href": "/profile/Michael-Hooper-16"
            },
            "answer_text": "Elvis Costello - Wikipedia See Veronica (song) - Wikipedia & My Brave Face - Wikipedia Linda was never, or very rarely, credited with songwriting credits, so Elvis was the best I could think of. ",
            "date": "Answered September 23, 2018",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Strickland",
                    "user_href": "/profile/Jon-Strickland-5"
                }
            ]
        }
    ]
}