{
    "title": "Did Elvis Presley suffer from mental illness? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)",
        "Mental Illness",
        "Musicians",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marina Gkane",
                "href": "/profile/Marina-Gkane"
            },
            "answer_text": "Elvis Presley had issues. He was pathologically attached to his mother Gladys to the point that he could not have sex with a woman who gave birth. He was heartbroken after Gladys died and a part of him died with her. The fact that he wanted to be mothered by a woman says it all. When he was in hospital he held Linda Thompson’s hand non stop. At the same time he liked very young women. That was the main reason for his divorce with Priscilla. Elvis met Priscilla when she was 14 years old and she moved in with him when she was 16. They married when she was 22 years old and welcomed their first and only child within a year at which point he lost sexual interest in her, hence their divorce. Elvis was a womanizer and he had numerous adulterous affairs which everyone knew about including Priscilla. She cheated on him with two men, one of whom was his karate instructor Mike Stone, whom Elvis wanted to kill at some point. Elvis was taken aback by Priscilla‘s decision to divorce him, his ego was really hurt. Elvis had an inflated yet fragile ego. He neglected Priscilla yet her decision to leave him hurt him. Priscilla left Elvis but he filed for the divorce first to satisfy his hurt ego. He didn’t want her to have his last name after the divorce. It never occurred to him that maybe she wasn’t happy being constantly cheated on, deprived of sex and left alone. I don’t think he was ‘’husband’’ material. He couldn’t be faithful to a woman. Linda Thompson said he broke his record of faithfulness the first year they were together. Then, he cheated on her non stop. According to Priscilla he would always give her a present after an indiscretion or a fight, that was his idea of dealing with his marital problems, which means that he had no clue from the dynamics of a marriage. Also, Elvis had mood swings and a temper. At some point, he gave Priscilla a black eye and he even threw a chair at her. I think he may have suffered from depression. He was bulimic, he would stay at home all day, with the drapes closed, he suffered from insomnia, he had a temper, he was pathologically dependent on his Memphis Mafia friends, he was idle and passive. Also, he was self destructive. All these are symptoms of depression. Elvis did everything in excess. He lacked control and discipline, which is indicative of people who suffer from depression. He bought too many cars, he wore too much jewelery, he wore too flashy costumes, he ate too much, he spent too much money. He had an uncontrollable appetite for food, hence his weight gain. Instead of adopting a healthy diet to help him lose weight he went on dangerous crash diets , during which he ate only grapefruit and melon, but a lot of it. He even put himself to an induced coma to stop himself from eating. He could have consulted a nutritionist, a therapist or a pathologist to help him deal with obesity and bulimia which he no doubt had but he chose the easy way. In a way he was superficial and short sighted. He was willing to put himself in a coma to lose weight so as to improve his looks yet he had no interest in his health whatsoever, hence he was diabetic, he suffered from constipation and hypertension. Elvis was insecure and deeply hurt by the nasty comments about his weight which meant that he cared about his looks and his image more than his own health. Does that mean he was a vain person? I don’t know. Elvis had a personality that made him prone to anything addictive. Cigars, drugs, food. Food was a release for him, he comfort ate, which means that he wasn’t happy. Why was he sad if he seemingly had everything? Could it be because he was not really loved but his ‘’friends’’ and the women were in it for the money? Elvis surrounded himself with ‘’yes’’ people who didn’t dare tell him ‘’NO’’ for they would lose their benefits. Elvis would not take no for an answer and they knew it. If he didn’t get his way he got really upset. In the end he was impossible to live with and women left him. He had a tendency to shoot at electrical appliances and TV sets. Was he angry? Paranoid from long term drug use? Who knows? His daughter Lisa Marie Presley seems to have similar traits. She has 4 failed marriages, she comfort eats, she battles a cocaine addiction since she was 14, she also likes to sleep around, she has out of control spending habits and she is no doubt self destructive. Currently she is broke, she has been to rehab 5 times last decade alone, divorced from her #4 estranged husband Michael Lockwood recently. This is a repeated pattern in her life which in fact is a vicious circle of drug use, deadbeat husbands and out of control spending habits. She finds release in sex, which is probably a result of growing up in a family where both parents slept around. She finds a release in food and she struggles with weight gain, which she seems to lose only when she abuses cocaine. She is a street junkie since she was 14 years old which means that either she tried to get someone’s attention by taking drugs or she tried to escape from her reality. She was sexually active at 14. Usually promiscuous girls have been sexually molested. Could one of her mother’s boyfriends have sexually molested her? She doesn’t seem to be able to form a healthy relationship with a man. She has boyfriends and husbands but she ends up divorcing all the time. She found no interest in school. She dropped out of school at 14. These are traits of people who have been sexually abused. She is no doubt self destructive. Her half brother Navarone battles a drug addiction too so their mother Priscilla obviously did something very wrong. These are some traits of Elvis’ personality: bulimia; nobody needs 13000 calories diet daily, especially when it consists exclusively of eggs, bacon, steak, peanut butter, beef, ice cream, cookies. He might as well have injected cholesterol in his blood, he slowly ate himself to death, his bad and unhealthy diet eventually killed himinsomnia; he slept all day and he stayed up all night long, he would stay all alone in Graceland without ever getting out FOR DAYS. That is a need to escape from reality, which means that he clearly wasn’t happy with his lifeunable to form healthy and longterm relationships with women; he liked particularly young and beautiful women and he treated them like a Barbie doll in a doll house. Elvis could not even fathom why Priscilla would want a divorce even if he cheated on her non stop, he was a notorious philanderer, he couldn’t be faithful to a womanuncontrollable anger; which he released by shooting at furniture and electrical appliancesa love for guns, the army and the police; which means that he needed to have some sort of control that way, which he clearly lacked as a personpathologically attached to his mother to the point he could not have sex with a woman who gave birth and he gradually lost interest in life in general after his mother Gladys passed awayno grasp of money; he bought 10 Mercedes Benzes and 32 shotguns for Christmas aloneprone to anything addictive; drugs, food, cigarsidle, passive, paranoid probably due to long term drug use; he would spend days and days in Graceland, doing nothing, staying in bed all day, shooting at the TV sets and at furniture",
            "date": "Updated September 8, 2020",
            "views": "756",
            "upvotes": " View 139 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sara Falk",
                    "user_href": "/profile/Sara-Falk-6"
                },
                {
                    "user_id": "Keith Karvelis",
                    "user_href": "/profile/Keith-Karvelis"
                },
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                },
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Nicole Crawford",
                    "user_href": "/profile/Nicole-Crawford-129"
                },
                {
                    "user_id": "Puja Pulsaria",
                    "user_href": "/profile/Puja-Pulsaria"
                },
                {
                    "user_id": "Craig Dixon",
                    "user_href": "/profile/Craig-Dixon-63"
                },
                {
                    "user_id": "Barbara Albonici",
                    "user_href": "/profile/Barbara-Albonici"
                },
                {
                    "user_id": "Margaret Arbo",
                    "user_href": "/profile/Margaret-Arbo"
                },
                {
                    "user_id": "Camilla Hestmark",
                    "user_href": "/profile/Camilla-Hestmark"
                },
                {
                    "user_id": "Vasif Juzbašić",
                    "user_href": "/profile/Vasif-Juzbašić"
                },
                {
                    "user_id": "Sherry Jean",
                    "user_href": "/profile/Sherry-Jean-9"
                },
                {
                    "user_id": "Debra Oz",
                    "user_href": "/profile/Debra-Oz"
                },
                {
                    "user_id": "Matt Carter",
                    "user_href": "/profile/Matt-Carter-188"
                },
                {
                    "user_id": "Joy Chappell",
                    "user_href": "/profile/Joy-Chappell-2"
                },
                {
                    "user_id": "Juli Marcone",
                    "user_href": "/profile/Juli-Marcone"
                },
                {
                    "user_id": "Julia Stolyarova",
                    "user_href": "/profile/Julia-Stolyarova-2"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Damocle Damoclev",
                    "user_href": "/profile/Damocle-Damoclev"
                },
                {
                    "user_id": "Jennifer Hernandez",
                    "user_href": "/profile/Jennifer-Hernandez-62"
                },
                {
                    "user_id": "Crystal Gandrud",
                    "user_href": "/profile/Crystal-Gandrud"
                },
                {
                    "user_id": "Walter McRae",
                    "user_href": "/profile/Walter-McRae-1"
                },
                {
                    "user_id": "Mark Sprinkle",
                    "user_href": "/profile/Mark-Sprinkle-4"
                },
                {
                    "user_id": "Perry Sams",
                    "user_href": "/profile/Perry-Sams-1"
                },
                {
                    "user_id": "TL Jaybird",
                    "user_href": "/profile/TL-Jaybird"
                },
                {
                    "user_id": "Lynn Marie",
                    "user_href": "/profile/Lynn-Marie-246"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serenade-11"
                },
                {
                    "user_id": "Richard Schweizer",
                    "user_href": "/profile/Richard-Schweizer-3"
                },
                {
                    "user_id": "Radina Vasileva",
                    "user_href": "/profile/Radina-Vasileva-3"
                },
                {
                    "user_id": "Jamie Nelson",
                    "user_href": "/profile/Jamie-Nelson-59"
                },
                {
                    "user_id": "Wendy Greenaway",
                    "user_href": "/profile/Wendy-Greenaway-3"
                },
                {
                    "user_id": "Klaire Padlo",
                    "user_href": "/profile/Klaire-Padlo-1"
                },
                {
                    "user_id": "Patricia Ennis",
                    "user_href": "/profile/Patricia-Ennis-1"
                },
                {
                    "user_id": "Erin Young",
                    "user_href": "/profile/Erin-Young-28"
                },
                {
                    "user_id": "Terry Cantrell",
                    "user_href": "/profile/Terry-Cantrell-2"
                },
                {
                    "user_id": "Marat",
                    "user_href": "/profile/Marat-10"
                },
                {
                    "user_id": "Mary Rose Caceres",
                    "user_href": "/profile/Mary-Rose-Caceres"
                },
                {
                    "user_id": "Evelyn Batu",
                    "user_href": "/profile/Evelyn-Batu"
                },
                {
                    "user_id": "Michael Perks",
                    "user_href": "/profile/Michael-Perks-9"
                },
                {
                    "user_id": "Geraldine Hogg",
                    "user_href": "/profile/Geraldine-Hogg"
                },
                {
                    "user_id": "Rainbowbubbleful",
                    "user_href": "/profile/Rainbowbubbleful"
                },
                {
                    "user_id": "Karen Kappel",
                    "user_href": "/profile/Karen-Kappel-1"
                },
                {
                    "user_id": "Violet",
                    "user_href": "/profile/Violet-404"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Wolf Krakowski",
                    "user_href": "/profile/Wolf-Krakowski"
                },
                {
                    "user_id": "Skander K. Hakiri",
                    "user_href": "/profile/Skander-K-Hakiri"
                },
                {
                    "user_id": "Neal Bracken",
                    "user_href": "/profile/Neal-Bracken"
                },
                {
                    "user_id": "George Holland",
                    "user_href": "/profile/George-Holland-36"
                },
                {
                    "user_id": "Dana Lirette",
                    "user_href": "/profile/Dana-Lirette"
                },
                {
                    "user_id": "Maggie",
                    "user_href": "/profile/Maggie-650"
                },
                {
                    "user_id": "Elaine Mcfadden",
                    "user_href": "/profile/Elaine-Mcfadden-4"
                },
                {
                    "user_id": "Anna Salmonsen",
                    "user_href": "/profile/Anna-Salmonsen-1"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Curtis THOMSON",
                    "user_href": "/profile/Curtis-THOMSON-4"
                },
                {
                    "user_id": "Jane Mooberry",
                    "user_href": "/profile/Jane-Mooberry"
                },
                {
                    "user_id": "al brown",
                    "user_href": "/profile/al-brown-104"
                },
                {
                    "user_id": "Chris Oldham",
                    "user_href": "/profile/Chris-Oldham-6"
                },
                {
                    "user_id": "Sasha Williams",
                    "user_href": "/profile/Sasha-Williams-66"
                },
                {
                    "user_id": "Haise Kiku",
                    "user_href": "/profile/Haise-Kiku"
                },
                {
                    "user_id": "Anton Jeldres Tiselj",
                    "user_href": "/profile/Anton-Jeldres-Tiselj-1"
                },
                {
                    "user_id": "Rachael LaRock",
                    "user_href": "/profile/Rachael-LaRock"
                },
                {
                    "user_id": "Nm Gonzalez",
                    "user_href": "/profile/Nm-Gonzalez"
                },
                {
                    "user_id": "Quentin Cervera",
                    "user_href": "/profile/Quentin-Cervera"
                },
                {
                    "user_id": "Lori DeSantis",
                    "user_href": "/profile/Lori-DeSantis-1"
                },
                {
                    "user_id": "Erin Keen",
                    "user_href": "/profile/Erin-Keen-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Catharina-12"
                },
                {
                    "user_id": "Michelle LoPrete",
                    "user_href": "/profile/Michelle-LoPrete"
                },
                {
                    "user_id": "Steven Witt",
                    "user_href": "/profile/Steven-Witt-2"
                },
                {
                    "user_id": "Jesse Spangler",
                    "user_href": "/profile/Jesse-Spangler"
                },
                {
                    "user_id": "Justyna Krammer",
                    "user_href": "/profile/Justyna-Krammer"
                },
                {
                    "user_id": "Veronica Wakeling",
                    "user_href": "/profile/Veronica-Wakeling-2"
                },
                {
                    "user_id": "Deborah Savage",
                    "user_href": "/profile/Deborah-Savage-13"
                },
                {
                    "user_id": "Joe Ahearn",
                    "user_href": "/profile/Joe-Ahearn"
                },
                {
                    "user_id": "Jennifer Haubrich Goodall",
                    "user_href": "/profile/Jennifer-Haubrich-Goodall"
                },
                {
                    "user_id": "Karen Harman",
                    "user_href": "/profile/Karen-Harman-7"
                },
                {
                    "user_id": "Siobhan Moore",
                    "user_href": "/profile/Siobhan-Moore-21"
                },
                {
                    "user_id": "Mary Field Ringestetter",
                    "user_href": "/profile/Mary-Field-Ringestetter"
                },
                {
                    "user_id": "Alissa Mower Clough",
                    "user_href": "/profile/Alissa-Mower-Clough"
                },
                {
                    "user_id": "Marie-Josee Duchesne",
                    "user_href": "/profile/Marie-Josee-Duchesne"
                },
                {
                    "user_id": "Alex Green",
                    "user_href": "/profile/Alex-Green-449"
                },
                {
                    "user_id": "Bette Stalford",
                    "user_href": "/profile/Bette-Stalford"
                },
                {
                    "user_id": "Wim Hulme",
                    "user_href": "/profile/Wim-Hulme"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-Ser"
                },
                {
                    "user_id": "Mark Proctor",
                    "user_href": "/profile/Mark-Proctor-11"
                },
                {
                    "user_id": "Ann Arnold",
                    "user_href": "/profile/Ann-Arnold-9"
                },
                {
                    "user_id": "Eileen Rosie",
                    "user_href": "/profile/Eileen-Rosie"
                },
                {
                    "user_id": "Jordan Grace Patino",
                    "user_href": "/profile/Jordan-Grace-Patino"
                },
                {
                    "user_id": "Zachary Abelardo",
                    "user_href": "/profile/Zachary-Abelardo"
                },
                {
                    "user_id": "Sara Gould",
                    "user_href": "/profile/Sara-Gould-3"
                },
                {
                    "user_id": "Mary Alex",
                    "user_href": "/profile/Mary-Alex-11"
                },
                {
                    "user_id": "Erin Sullivan",
                    "user_href": "/profile/Erin-Sullivan-85"
                },
                {
                    "user_id": "Ed Ortiz",
                    "user_href": "/profile/Ed-Ortiz-10"
                },
                {
                    "user_id": "Joseph McCourt",
                    "user_href": "/profile/Joseph-McCourt-1"
                },
                {
                    "user_id": "Teresa Beyer",
                    "user_href": "/profile/Teresa-Beyer-4"
                },
                {
                    "user_id": "Isabel Riley",
                    "user_href": "/profile/Isabel-Riley-4"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                },
                {
                    "user_id": "Susan Rivas",
                    "user_href": "/profile/Susan-Rivas"
                },
                {
                    "user_id": "Anna Marie Mayers",
                    "user_href": "/profile/Anna-Marie-Mayers"
                },
                {
                    "user_id": "Aliye Sonmez",
                    "user_href": "/profile/Aliye-Sonmez"
                },
                {
                    "user_id": "Michael Xan",
                    "user_href": "/profile/Michael-Xan"
                },
                {
                    "user_id": "Laverne Bartlett",
                    "user_href": "/profile/Laverne-Bartlett"
                },
                {
                    "user_id": "Carina Jane Hartley",
                    "user_href": "/profile/Carina-Jane-Hartley"
                },
                {
                    "user_id": "Barry Dean Kobe",
                    "user_href": "/profile/Barry-Dean-Kobe"
                },
                {
                    "user_id": "Zeina Helou",
                    "user_href": "/profile/Zeina-Helou"
                },
                {
                    "user_id": "Anthony Freeman",
                    "user_href": "/profile/Anthony-Freeman-9"
                },
                {
                    "user_id": "Darlene Lugo",
                    "user_href": "/profile/Darlene-Lugo-1"
                },
                {
                    "user_id": "Craig Bateman",
                    "user_href": "/profile/Craig-Bateman-4"
                },
                {
                    "user_id": "Nicole Johnson",
                    "user_href": "/profile/Nicole-Johnson-1311"
                },
                {
                    "user_id": "Ginger Bailey",
                    "user_href": "/profile/Ginger-Bailey-1"
                },
                {
                    "user_id": "Elaine Nacht",
                    "user_href": "/profile/Elaine-Nacht"
                },
                {
                    "user_id": "Jean Šadl-Ferš",
                    "user_href": "/profile/Jean-Šadl-Ferš"
                },
                {
                    "user_id": "Aryana Alina",
                    "user_href": "/profile/Aryana-Alina"
                },
                {
                    "user_id": "Martin Mullane",
                    "user_href": "/profile/Martin-Mullane"
                },
                {
                    "user_id": "Tammy Adams",
                    "user_href": "/profile/Tammy-Adams-141"
                },
                {
                    "user_id": "Christine Tremayne",
                    "user_href": "/profile/Christine-Tremayne-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Rice-54"
                },
                {
                    "user_id": "Brian Rosales",
                    "user_href": "/profile/Brian-Rosales-4"
                },
                {
                    "user_id": "Randy Renfrow",
                    "user_href": "/profile/Randy-Renfrow-1"
                },
                {
                    "user_id": "Joanna Matlusky",
                    "user_href": "/profile/Joanna-Matlusky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Kolman",
                "href": "/profile/Ron-Kolman"
            },
            "answer_text": "Elvis isn’t known to have any specific mental illness. There are, however, behaviors which suggest some questionable emotional issues. Elvis experience a great deal of loss in his life: his twin brother, Jesse Garon, the end of his marriage to Priscilla, and the seminal importance of the death of Elvis’ beloved mother, Gladys. There was the loss of a possible career the Colonel stole from him, the impotence he felt stuck in contracts and career tracks, which took him from what he was gravitating to at the peak of his career. When the Beatles visited Graceland one afternoon, Elvis and his guests finally got around to jamming and story swapping. History says the Colonel saw this, didn’t like the draw to the (very free-willed) lads, and about midnight, interrupted the famous meeting , and sent the lads off home. Midnight! They could have jammed all night certainly, he WAS an idol to them. It’s also said Parker allowed no video or audio of the visit. What would that have been like to watch! Elvis seemed from the start to be especially shy, conflict averse, a loner, and potentially suffering a depressive disorder (either parent contributed genetically). Some of these issues could have been responsible for Elvis’ unusual attachment to his mother; she became his world. This topic could require a thesis to justice to. There was a dichotomy to his bond with his mother. (Elvis as a natural blonde, a young boy, with his beloved mother, Gladys)  While she represented all that was good, safe, and reliable in his life, there’s also a good chance Elvis was at least vaguely aware, his mother was a prison for him, the attachment and need to please was so strong. To create a separation in his psyche, Elvis was obsessed with gorgeous teen girls, the literal antithesis of his mother. It’s been noted he could not have intercourse with a woman once she had given birth. Elvis wanted a life that others kept taking from him. Colonel Parker, whom he trusted with his life, was in fact a flimflam man, one who stole Elvis’ talent for personal gain. At some level, I believe Elvis was aware of the dynamics at play. Not crisply so, or seeing the specifics at work, but the vague sense he was always thwarted by someone/something, and could never take control to make his life his own. Later in his career, he longed to do some Rock songs, become a bit more aligned with the later 1960s when the Beatles were in the thick of their creativity. Parker said ‘No’, to that, and Elvis went back to Gospel, Adult Contemporary, and his usual mix including musicals (Elvis hated the films he was contractually tied to). But again, unable to pull strings, make demands, as other artists did, and extricate himself from the course others had chosen for his career. While no formal diagnosis has been made, there is a condition that seems to reflect much of what he struggled with. “Williams syndrome” — a genetic disorder that can bring developmental delays and very mild mental retardation, along with an overly friendly and trusting personality. Remarkably, those diagnosed with Williams Syndrome, experienced a spike in the hormones (associated with love and loving feelings) oxytocin and arginine vasopressin (AVP), when music played. Individuals without this condition saw little or no change in their oxytocin and AVP levels while listening. Interesting! A new study shows that when people with Williams syndrome listen to Elvis’ “Love Me Tender,” to that song or others, they experience more distinct and higher levels of the hormones associated with feelings of love. This is all conjecture based on (1.) the understanding of the Williams Syndrome, and (2.), looking back at Elvis’ life and how this might have been a factor. His reacting to music with loving feelings, and singing those very songs, might have been a remarkable experience, almost a true “high”, for Elvis (and his fans - all reacting to his voice, music, and presence or persona). The love from his audience would have been an exaggerated loving experience. If Elvis could have found the words, at the end he might have mused, ‘What A Long, Dark, Ride It’s Been.’ ",
            "date": "Updated August 16, 2020",
            "views": "331",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyle Kirn",
                    "user_href": "/profile/Kyle-Kirn-1"
                },
                {
                    "user_id": "Jenny Resch",
                    "user_href": "/profile/Jenny-Resch-1"
                },
                {
                    "user_id": "Melika Pei",
                    "user_href": "/profile/Melika-Pei"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-11"
                },
                {
                    "user_id": "Daniel Stengert",
                    "user_href": "/profile/Daniel-Stengert"
                },
                {
                    "user_id": "Margaret Arbo",
                    "user_href": "/profile/Margaret-Arbo"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Marina Gkane",
                    "user_href": "/profile/Marina-Gkane"
                },
                {
                    "user_id": "Martha Rettig",
                    "user_href": "/profile/Martha-Rettig-3"
                },
                {
                    "user_id": "Ann Shriner",
                    "user_href": "/profile/Ann-Shriner"
                },
                {
                    "user_id": "Marie Angele Barelier",
                    "user_href": "/profile/Marie-Angele-Barelier"
                },
                {
                    "user_id": "Mark Varela",
                    "user_href": "/profile/Mark-Varela"
                },
                {
                    "user_id": "Erin Young",
                    "user_href": "/profile/Erin-Young-28"
                },
                {
                    "user_id": "Niko Rosse",
                    "user_href": "/profile/Niko-Rosse"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bob-F-14"
                },
                {
                    "user_id": "Debbie Colosi",
                    "user_href": "/profile/Debbie-Colosi"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Steven Phillips",
                    "user_href": "/profile/Steven-Phillips-132"
                },
                {
                    "user_id": "Xavier Lopez",
                    "user_href": "/profile/Xavier-Lopez-17"
                },
                {
                    "user_id": "Dheeraj Meena",
                    "user_href": "/profile/Dheeraj-Meena-17"
                },
                {
                    "user_id": "Charalampos Xenophon Lampadarios",
                    "user_href": "/profile/Charalampos-Xenophon-Lampadarios"
                },
                {
                    "user_id": "Lehloo Meh",
                    "user_href": "/profile/Lehloo-Meh"
                },
                {
                    "user_id": "Shiloh Jay Edsitty",
                    "user_href": "/profile/Shiloh-Jay-Edsitty"
                },
                {
                    "user_id": "Sarah Gordon",
                    "user_href": "/profile/Sarah-Gordon-48"
                },
                {
                    "user_id": "Angela Singleton",
                    "user_href": "/profile/Angela-Singleton-11"
                },
                {
                    "user_id": "Joanne Lindstrand",
                    "user_href": "/profile/Joanne-Lindstrand"
                },
                {
                    "user_id": "Jenifer DePaolo",
                    "user_href": "/profile/Jenifer-DePaolo"
                },
                {
                    "user_id": "Margaret Ann",
                    "user_href": "/profile/Margaret-Ann-57"
                },
                {
                    "user_id": "Anthony Julian Alcos",
                    "user_href": "/profile/Anthony-Julian-Alcos"
                },
                {
                    "user_id": "Jeanne Spencer Beekley",
                    "user_href": "/profile/Jeanne-Spencer-Beekley"
                },
                {
                    "user_id": "Nancy Gordon-Brooks",
                    "user_href": "/profile/Nancy-Gordon-Brooks"
                },
                {
                    "user_id": "Roxanne Molina",
                    "user_href": "/profile/Roxanne-Molina"
                },
                {
                    "user_id": "Sharon Nicole Gillette",
                    "user_href": "/profile/Sharon-Nicole-Gillette"
                },
                {
                    "user_id": "Hugh Weller-Lewis",
                    "user_href": "/profile/Hugh-Weller-Lewis-1"
                },
                {
                    "user_id": "Marie Roberts",
                    "user_href": "/profile/Marie-Roberts-5"
                },
                {
                    "user_id": "Mary Abel",
                    "user_href": "/profile/Mary-Abel-6"
                },
                {
                    "user_id": "Nita Pitts",
                    "user_href": "/profile/Nita-Pitts"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/CM-388"
                },
                {
                    "user_id": "Diane Powell",
                    "user_href": "/profile/Diane-Powell"
                },
                {
                    "user_id": "Hannah Smith",
                    "user_href": "/profile/Hannah-Smith-177"
                },
                {
                    "user_id": "Kosi Onwuamaegbu",
                    "user_href": "/profile/Kosi-Onwuamaegbu"
                },
                {
                    "user_id": "Sophia Shear",
                    "user_href": "/profile/Sophia-Shear"
                },
                {
                    "user_id": "Neha Kumaran",
                    "user_href": "/profile/Neha-Kumaran-2"
                },
                {
                    "user_id": "Jasmine",
                    "user_href": "/profile/Jasmine-1982"
                },
                {
                    "user_id": "Lumine Grey",
                    "user_href": "/profile/Lumine-Grey"
                },
                {
                    "user_id": "Jose Rodriguez",
                    "user_href": "/profile/Jose-Rodriguez-183"
                },
                {
                    "user_id": "Stephen Comer",
                    "user_href": "/profile/Stephen-Comer-4"
                },
                {
                    "user_id": "Melinda Vaughn",
                    "user_href": "/profile/Melinda-Vaughn"
                },
                {
                    "user_id": "Brian Gill",
                    "user_href": "/profile/Brian-Gill-79"
                },
                {
                    "user_id": "Cathlynn Cannon",
                    "user_href": "/profile/Cathlynn-Cannon-1"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bomani Clarke",
                "href": "/profile/Bomani-Clarke"
            },
            "answer_text": "….thangyaveramuch for requesting an answer from me! as a huuuge elvis fan, i don’t think he had any form of mental illness. first, let me begin with how it fascinates me how icons adjust to all the adoration. there are a rarefied few who have ever even experienced fame on a level that elvis did - without any real road map to follow. the beatles had each other to help cope and were directly influenced and reaping benefits from elvis’ career, yet still made mistakes - lennon was right as, before elvis, there was nothing! perhaps the closest one, p.e. who’s ascendance came close was sinatra, musically, but even his fame didn’t approach elvis-level when you really think about it. i think, on that level, you have a guy like brando where every generation of same era and subsequent actors looked to him as that one figure who defined their lives and careers w/almost sycophantic adoration…how does one cope w/that? post elvis, only muhammad ali had that kind of genre/industry dominance where you are that one and only figure who separates whatever came before from everything that comes after. in reggae, you had marley; in martial arts you had bruce lee, but, still neither on elvis’ level. elvis was the only public figure i know of who was known around the world by his 1st name and never performed outside the country other than a jaunt, or two, to canada in the ‘50s. in addition, elvis was in high school in ‘53, started making his way in ‘54, became a regional buzz in ‘55, and achieved global dominance in ’56 until he died and beyond. as such, who else went from total obscurity to omnipresence in 2 yrs and stayed in the upper echelon of power players? nobody. further, elvis still hold records that may never be broken. some have only recently been broken - the list of his accomplishments and records is way too extensive for me to name in this already lengthy response. finally, how many other acts were chart dominant every year of their career - for elvis some 22 years? i believe he was always one of the top 5 acts from the ’50’s - ‘70’s. now, against this backdrop, add in a young, impressionable, humble, good-natured/-mannered southerner who was patriotic yet rebellious, polished but raw, simple yet complex, spiritual but sensual. elvis had issues, for sure, but who doesn’t? like howard hughes before him, elvis had complexes that would be easily diagnosed and treatable today, so he was ahead of his time, unfortunately. however, none of his idiosyncrasies takes away from his talent, his legacy, or his legend. he is still, for me, the single greatest figure in rock & roll, if not 20th century popular music. now that’s not to say he was more influential than, say, louis armstrong - who i believe was popular music’s closest comparison to abraham in the bible - in that everything ppl are doing today, vocally, performance-wise, and musically can be drawn back generationally to him…but elvis shines above everyone else as far as impact, and is why i consider him the big bang of popular music! ",
            "date": "Updated February 10, 2020",
            "views": "42",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wolf Krakowski",
                    "user_href": "/profile/Wolf-Krakowski"
                },
                {
                    "user_id": "Kyle Kirn",
                    "user_href": "/profile/Kyle-Kirn-1"
                },
                {
                    "user_id": "Eliud Saul Juarez",
                    "user_href": "/profile/Eliud-Saul-Juarez"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-11"
                },
                {
                    "user_id": "Ginny Johnson",
                    "user_href": "/profile/Ginny-Johnson-22"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Cathy Masterson",
                    "user_href": "/profile/Cathy-Masterson-2"
                },
                {
                    "user_id": "Deb Frazier",
                    "user_href": "/profile/Deb-Frazier-7"
                },
                {
                    "user_id": "Ann Shriner",
                    "user_href": "/profile/Ann-Shriner"
                },
                {
                    "user_id": "Patricia Dixon LaFarr Dunaway",
                    "user_href": "/profile/Patricia-Dixon-LaFarr-Dunaway"
                },
                {
                    "user_id": "Stefanie Hasandras",
                    "user_href": "/profile/Stefanie-Hasandras-1"
                },
                {
                    "user_id": "Debi Yorek",
                    "user_href": "/profile/Debi-Yorek"
                },
                {
                    "user_id": "George Rutnam",
                    "user_href": "/profile/George-Rutnam"
                },
                {
                    "user_id": "Cheryl Wickes",
                    "user_href": "/profile/Cheryl-Wickes-1"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Wendy Radebaugh",
                    "user_href": "/profile/Wendy-Radebaugh"
                },
                {
                    "user_id": "Carl Thomas",
                    "user_href": "/profile/Carl-Thomas-159"
                },
                {
                    "user_id": "Connie Mccormick",
                    "user_href": "/profile/Connie-Mccormick-8"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                },
                {
                    "user_id": "John Alexander",
                    "user_href": "/profile/John-Alexander-223"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Mishkin",
                "href": "/profile/Aaron-Mishkin-1"
            },
            "answer_text": "First, I’m not a medical doctor nor clinical psychologist, so I’m going to look at mental illness from a different perspective. It is from the perspective of looking at Elvis as being a universally recognized famous unique individual. Disregard whether or not you’re a fan; whether you loved or hated him. Simply try to imagine that everything that you did, said, thought, etc was open season for the entire world to comment upon. What foods you ate, what clothes you wore, the cars you drove, what you drank, every single thing about you was important to someone. And everyone, everyone wanted to profit in some way from being close to you or knowing something about you. And in Elvis’ case there was Col. Tom Parker who did make money on every single thing Elvis did. Next, imagine that every time you said something, anything, someone was there to try and fix it or take care of it. You’re thirsty? What would you like to drink? Hungry? What would you like to eat? Headache? Aspirin, Tylenol or something stronger? Sounds great! Or does it? As humans, we normally do stuff, and as we get more specialized in the stuff that we do, we hire people to do the lesser stuff. Elvis had people to do all of his stuff except his performances: in studio, on stage or on camera, which were just a couple of hours a day but not that often during the mid- to late-sixties when he was doing mostly movies. I think that may be why he did the Las Vegas thing in the 70’s so he could perform more, and have a purpose; have stuff to do. I think that his mind began to suffer the 60’s when he was doing movies; i.e., when he didn’t have enough stuff to do because everyone would do stuff for him and he wasn’t allowed to do stuff because of his movies contracts. The thing that Elvis did and that only Elvis could do, sing like Elvis, he wasn't doing much of it. Though it’s not like he didn’t do anything at all. He became a black belt in martial arts (Karate?), wanted to join law enforcement and work for Richard Nixon. He wanted to do stuff (kinda crazy stuff), but the world wanted him to perform: movies, TV, songs, stage, etc. And so this was his form of mental illness. He was trapped being Elvis and not being able to do Elvis or do other stuff. His mental illness in the sense I’ve tried to describe was that he wasn’t allowed to be mentally healthy. And ultimately, it was everyone’s desire to please Elvis instead of caring for Elvis that made it worse for him; and therefore, all of us too. ",
            "date": "Answered August 25, 2020",
            "views": "613",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Africanprincess21",
                    "user_href": "/profile/Africanprincess21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Kahre",
                "href": "/profile/Ken-Kahre"
            },
            "answer_text": "Here’s the thing - Elvis Presley was never diagnosed for any kind of psychological evaluation while he was alive. Any thing we know about him today was done after he was dead. We can speculate, but we really don’t know. Its possible that he suffered from bipolar disorder, which is a more technical name for manic depression. Elvis’ substance abuse, eating disorders, and chronic depression should be placed in the larger context of a personality disorder. What we know about his behavior in the years and months prior to his death is legion, but as to the cause - well, that’s just speculation. As an example, much has been made about the food that he ate. Fried foods, fried meat, even two or three cheeseburgers at a single meal. To many writers of the day that was pretty peculiar and is still commented on all the time - even introspectively - unless you were from the South, as he was. That was pretty common back then. At that time of his life, Mr. Presley was suffering from depression, diabetes and prescription drug abuse. That would be enough for any man and it was a sad way to go. ",
            "date": "Answered January 3, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Patricia Dixon LaFarr Dunaway",
                    "user_href": "/profile/Patricia-Dixon-LaFarr-Dunaway"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marietta Kosovsky",
                "href": "/profile/Marietta-Kosovsky"
            },
            "answer_text": "I don’t think he did; the business that propelled him sky high wasn’t easy to deal with for sure. Always have to be on when you’re on stage, you’re being pulled in many different directions and the need to stay on top is always the wind pushing you on. And the Colonel Parkers of the world, good as he might have been for making Elvis what he became, probably demanded a lot from Elvis. Elvis was a sweet, nice boy from Memphis who loved his Mama through and through and was distraught when she died. No, I don’t think Elvis was ever mentally ill but the entertainment world was so demanding that it’s easy to succumb to drugs and drink. I don’t excuse him but I understand that he must have wakened in the mornings and said, ‘What happened? Where am I, how did I get here, am I that good, why are all those women screaming at me (me included) and wanting a piece of me?” How do you maintain your sanity in the midst of all of that? To die at such a young age; to never know your child or grandchildren. Success demands a very exorbitant price, doesn’t it, and too often? ",
            "date": "Answered December 9, 2019",
            "views": "16",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Africanprincess21",
                    "user_href": "/profile/Africanprincess21"
                },
                {
                    "user_id": "Wendy Greenaway",
                    "user_href": "/profile/Wendy-Greenaway-3"
                },
                {
                    "user_id": "Debi Yorek",
                    "user_href": "/profile/Debi-Yorek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Mellinger",
                "href": "/profile/Jeff-Mellinger-3"
            },
            "answer_text": "Did Elvis suffer from a mental illness? I would have to say that yes he did in the form of drug and alcohol addiction which is the same mental illness that millions of other people have to deal with including me. Many experts would probably disagree with me on that addiction is not a mental illness but rather a mental disorder or something like that, but wouldn't go as far to say that it is a mental illness. There has to be something wrong with your brain that would justify your putting yourself in danger just to get high every day of your life to escape from reality. I can understand that Elvis Presley had to deal with the stress of being famous and that everyone wanted to have a piece of his life, but when you turn to drugs and alcohol to escape from life and its problems then there has to be some kind of mental illness that you are dealing with too. Like I said before this is my opinion if addiction is a mental illness or not and in my humble opinion it is, and I think that Elvis suffered from the same illness that I have which is the life long mental illness of addiction. ",
            "date": "Answered December 5, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Alderete",
                "href": "/profile/Frank-Alderete"
            },
            "answer_text": "What is mental illness? How do you define it? Unless a person has lost mental acuity, it is highly subjective. Do people that commit suicide all suffer from mental illness? I think Elvis suffered from depression - and this depression was the root cause of his drug addiction. Grief causes depression - the loss of self esteem, or the loss of a very close family member (parent, spouse, etc). I have known several people that committed suicide, and the common factor has been grief. Elvis was extraordinarily close to his mother, and her death at a relatively young age, caused a cataclysmic change in his attitude, behavior and perspective. His divorce, years later, compounded an already elevated level of self destruction. No - I do not believe that Elvis was mentally ill, anymore than I believe that Janis Joplin, Jimmy Hendrix, Amy Weinstein or James Morrison (Doors) were mentally ill. They were not retarted - they simply couldn’t deal with their inner-demons. ",
            "date": "Answered October 12, 2020",
            "views": "226",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Africanprincess21",
                    "user_href": "/profile/Africanprincess21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Leigh",
                "href": "/profile/Dana-Leigh-5"
            },
            "answer_text": "No, he suffered from addiction. Addiction is a maladaptive behavior or action to (often subconsciously) avoid, dull, or eliminate any painful feeling, memory, or concept in a person’s life. Addiction can mimic closely sometimes a mental disorder because the withdrawals, side affects (of any chemical alteration), cravings, moods, and alteration in behavior to get the addiction are similar. The cycle of addiction can cause an array of erratic emotional responses and behavior as well. This is why mental disorders and addictions are not treated as the same and of many instances fail because of the illiterate and unknowledgeable educational background some practitioners implement in actions towards their patients. Addictions are a deep rooted behavior that is conditioned to ease or eliminate any form of pain which needs to be relearned and mental disorders are derived from a chemical imbalance that needs pharmacological approaches to treat. ",
            "date": "Answered January 27, 2019",
            "views": "28",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melika Pei",
                    "user_href": "/profile/Melika-Pei"
                },
                {
                    "user_id": "Wolf Krakowski",
                    "user_href": "/profile/Wolf-Krakowski"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Elzanna Zapperelli",
                    "user_href": "/profile/Elzanna-Zapperelli"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Ligia Carmen Jarda",
                    "user_href": "/profile/Ligia-Carmen-Jarda"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                },
                {
                    "user_id": "Shad Collins",
                    "user_href": "/profile/Shad-Collins-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elzanna Zapperelli",
                "href": "/profile/Elzanna-Zapperelli"
            },
            "answer_text": "Did Elvis Presley suffer from mental illness? We all suffer from different forms of mental illness, some of us just learn to control it better. (Me? Maybe not so much. I kind of like how it works.) The think that Mr. Presley suffered from in the end was drug addiction, obesity, high blood pressure and heart disease. That’s what killed him. His support staff was full of “yes men.” He was seldom told, “No, you shouldn’t/can’t do that.” He could have easily afforded a “keeper” who would look after his well being, but at the time, those kinds of people weren’t a “thing.” (We have a great number of people who could use a “keeper.”) However, I don’t think Presley was anymore mentally ill than any of the rest of us. His condition(s) simply presented in a different way. ",
            "date": "Answered January 16, 2020",
            "views": "959",
            "upvotes": " Answer requested by Evan Argall",
            "upvoters": [
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Crystal Gandrud",
                    "user_href": "/profile/Crystal-Gandrud"
                },
                {
                    "user_id": "David Dashevskiy",
                    "user_href": "/profile/David-Dashevskiy"
                },
                {
                    "user_id": "Klaire Padlo",
                    "user_href": "/profile/Klaire-Padlo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lyle Fales",
                "href": "/profile/Lyle-Fales"
            },
            "answer_text": "Elvis experienced things most of us didn't. He father was gone most of the time during the depression and Elvis and his mother barely kept from starving. So of course they became dependent on each other. That would go on into his adult life. But I would not call that mental illness. But the fact that he could never go out in public and was a prisoner in his home would wear on a body. But during the 1968 Singer special, sometimes known as the “comeback session”, a producer convinced him to come down to the sidewalk outside with him. Elvis was skittish. But he did it and was blown away by the fact that fans were no longer like they were back in the 50’s. But there was a lot of weirdness he had to deal with so that might mess with anyones mind. ",
            "date": "Answered October 14, 2020",
            "views": "205",
            "upvotes": " Answer requested by Evan Argall",
            "upvoters": [
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juanita Agboola",
                "href": "/profile/Juanita-Agboola"
            },
            "answer_text": "Elvis was the first human to reach such a superstar status on the planet, he was called “The King.” His genre-bending and rough sound catalyzed the movement known as rock n’ roll.  Did Elvis Presley suffer from mental illness? Possible, as he was never psychologically diagnosed while alive. Truth is, Elvis never really felt comfortable in his skin, unless he was on stage. He found himself in the middle of an issue many of us find ourselves in: living an outer life that doesn’t match what’s going on inside. This creates an anxious tendency to cling to an ever-elusive image. It creates an issue that many didn’t even know existed at that time: anxiety.  If you found this answer useful, please leave an upvote. ",
            "date": "Updated May 15, 2020",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wendy Greenaway",
                    "user_href": "/profile/Wendy-Greenaway-3"
                },
                {
                    "user_id": "Patricia Dixon LaFarr Dunaway",
                    "user_href": "/profile/Patricia-Dixon-LaFarr-Dunaway"
                },
                {
                    "user_id": "Sarah Katherine Renzetti",
                    "user_href": "/profile/Sarah-Katherine-Renzetti"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Vicki Fairman",
                    "user_href": "/profile/Vicki-Fairman"
                },
                {
                    "user_id": "Marina Gkane",
                    "user_href": "/profile/Marina-Gkane"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Weingarten",
                "href": "/profile/Rob-Weingarten"
            },
            "answer_text": "There is no public record that Elvis was ever officially diagnosed with a mental health disorder. Growing up as he did in the rural south, it is likely he would have viewed seeking treatment for depression or anxiety as a sign of weakness. Based on what we know about his life, his attachment to his mother, the loss of his twin, being something of an outsider as a youth, his being thrust into the spotlight at an early age, those certainly can be factors that drive mental health challenges. His impulsive behavior, addiction, difficulty in maintaining lasting relationships can be signs of someone who is struggling with a psychological disorder. We will never know the answer for sure, but it’s likely. ",
            "date": "Answered October 12, 2020",
            "views": "197",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nicolette Brown",
                    "user_href": "/profile/Nicolette-Brown-10"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan C. Weber",
                "href": "/profile/Susan-C-Weber"
            },
            "answer_text": "I doubt it. Elvis had everything in overabundance. Looks, talent, women, and money. But he was basically just a small-town boy at heart. It’s pretty easy to get your head turned around when success and wealth come as fast and furiously as they did in his case. He later got into drugs and put on a ton of weight, neither of which did his health any good. Life definitely got difficult for Elvis during his last years. ",
            "date": "Answered January 27, 2019",
            "views": "17",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Leo",
                "href": "/profile/John-Leo-77"
            },
            "answer_text": "I can relate to his life on pills because the book I read Elvis by Albert Goldmen taught me to stop street drugs and move on to legal drugs. But Elvis over did it because he could and like most addicts always had a reason for taking the drugs any of them and was a person that knew he can pay for his drugs no matter where he got them. Not mental case just a drug addict with plenty of money,to keep him over taking and no one can stop Elvis because his money and fame ruled. ",
            "date": "Answered December 20, 2019",
            "views": "792",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frank Bertaina",
                    "user_href": "/profile/Frank-Bertaina-2"
                },
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacqueline Taylor",
                "href": "/profile/Jacqueline-Taylor-160"
            },
            "answer_text": "I’m not sure. I haven’t read much about Elvis. The only studying I’ve did is projects on him at school. Specially because I’m from Mississippi. Besides that, I don’t know. I believe he had anxiety and I think he was taking medicine for it. Also, weight gain/loss that has negatively impacted your life, is a classic sign of mental health issues and he gained a lot of weight. He also suffered from addiction. ",
            "date": "Answered August 23, 2020",
            "views": "224",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erroll Flynn",
                "href": "/profile/Erroll-Flynn"
            },
            "answer_text": "Absolutely not. But he was prone to getting all shook up.Elvis had a few faults but being crazy wasn’t one of them. He did not have good sleeping habits, and abused prescription drugs. His eating habits were questionable.Elvis Presley was an immense talent who changed the course of popular music. However, his rock ‘n’ roll lifestyle led him to an early demise at age 42. ",
            "date": "Answered December 10, 2019",
            "views": "758",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Murray",
                "href": "/profile/Scott-Murray-52"
            },
            "answer_text": "A lot of good answers here already and I am not a trained medical professional, so I’ll not venture down this path, but the nonstop touring and Las Vegas engagements played a part in Elvis Presley's physical and spiritual decline as did his dependency on a variety of prescription drugs. These alone could give the appearance of someone struggling with mental illness… ",
            "date": "Answered August 23, 2020",
            "views": "375",
            "upvotes": " Answer requested by Evan Argall",
            "upvoters": [
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Baron",
                "href": "/profile/Tony-Baron-2"
            },
            "answer_text": "Hmm, all these answers range from outright accusations to musings on his frame of mind/influential & surrounding elements. Without overindulging in my own opinions/thoughts or overthinking anything, if Elvis did have any inkling of mental illness (& who are we to decide that?) - it was certainly exacerbated by his corrupt manager. Also, being eventually addicted to pharmaceutical drugs obviously didn’t do well for him. ",
            "date": "Answered September 15, 2020",
            "views": "206",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Ribeiro-Accouche",
                "href": "/profile/Veronica-Ribeiro-Accouche"
            },
            "answer_text": "He did suffer from long term depression which is a type of mental illness; his wife Priscila Presley spoke about it. Hear is a link to an interview where she mentioned her former husbands problems. Priscilla Presley reveals how a depressed Elvis Presley \"knew exactly what he was doing\" when he died ",
            "date": "Answered December 11, 2019",
            "views": "795",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Evan Argall",
                    "user_href": "/profile/Evan-Argall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Lee",
                "href": "/profile/Jennifer-Lee-1426"
            },
            "answer_text": "He suffered from drug addiction. He took pills to help him sleep and then he needed more to help him wake up. It was a vicious cycle that took its toll on his body and his personality. ",
            "date": "Answered November 29, 2019",
            "views": "488",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Patricia Giglio",
                "href": "/profile/Patricia-Giglio-1"
            },
            "answer_text": "Could very well be possible sometimes taking too much prescription medication and adding stress onto it you can suffer a breakdown that you never come out of. Anyone abusing drugs besides the fact they like to get high, usually gets high everyday because they’re masking something ",
            "date": "Answered November 30, 2019",
            "views": "537",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Kosta Berou",
                "href": "/profile/Kosta-Berou"
            },
            "answer_text": "no more than any other normal person.he had great advantage of many friends and hangers on to feel wanted and secure regardless of any psychological analyses.. ",
            "date": "Answered December 10, 2019",
            "views": "312",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Terry Stull",
                "href": "/profile/Terry-Stull"
            },
            "answer_text": "I don’t think so. Maybe the pressures of his fame made him a bit eccentric but I believe he remained the good-hearted, down-home guy he always was. ",
            "date": "Answered August 21, 2020",
            "views": "116",
            "upvotes": " Answer requested by Evan Argall"
        }
    ]
}