{
    "title": "Did hippies wear a tie dye? - Quora",
    "tags": [
        "Tie-dye",
        "Hippies",
        "Fashion and Style"
    ],
    "response": [
        {
            "author_info": {
                "name": "De Noon Joy",
                "href": "/profile/De-Noon-Joy-1"
            },
            "answer_text": "Did hippies wear a tie dye? Yes, they did wear tie-dye. The hippies also wore a lot of eclectic, incongruous clothing--anything that looked bright, far-out, folkloric, or trippy— peasant clothes, bell bottoms, Indian pattered textiles, beaded, tapestry, headbands, handcrafted sandals or moccasins, and fringed jackets for example. They wore long, natural hair. Haight Street in San Francisco was one of the central places for the youth in the 1960s to be as the hippy movement grew. Now famous stars like Janice Joplin lived not far from others in San Francisco such as the Grateful Dead. San Francisco and hippies' style included the tie-dye as well as other eclectic eye catching elements. They wore flowers in their hair and believed that n peace and love.The hippies were anti-draft and antiwar during the time of the Vietnam War. These days hippies wear many styles. Tie-dye can still be seen being worn by some hippies. As for tie- dye itself, ancient written records about tie-dye originate from China and Japan. History shows tie-dye being done in China as far back as the T'ang Dynasty (618 and 906 C.E.). During the Nara Period in Japan ( 552 to 794 C.E.) the Japanese were producing tie-dyed materials. Tie-dye and tie-dye like techniques exist in other parts of the world as well, yet Asians have been using it for a very long while —-even before written history. Known as Shibori, the Japanese method of tie-dye is a craft technique that typically results in a vibrant, rich, indigo color which is combined with lively patterns and is a treasured art. Japanese tie-dye is popular today in the USA. It is especially popular in many parts of California as a fashion statement and with many hippies as well. Major fashion labels have recently picked tie-dye for their clothes and home goods as tie-dye remains popular with many people. Even companies that produce polished clothing for women have the included tie-dye and Shibori style accessories/ dresses in their clothes collections in recent years. Even rugmakers and home textiles have been influenced by the tie-dye /Shibori/hippy trend, creating items such as tie-dyed rugs, pillows and draperies and often marketed as boho/hippy-inspired styles to cater to the tastes of a niche of people who appreciate this type of craft and aesthetic. Certainly a few hippies in California I know currently have some type of this tie-dye or Shibori in their homes! So again, contemporary creations of tie-die can be worn by hippies : old hippies as well as younger people these days. Tie-dye has ancient roots and can be seen being worn as fabric in clothing and displayed in the homes by both hippies and non-hippies alike as current fashion trends favor tie dye. Tie-dye is also considered an ancient and traditional craft to some Asian cultures such as the Japanese where it exists as Shibori and in the fashion world as tie-dye as well. Tie-dye was worn by the original hippies along with other eclectic clothing and the beauty of the craft of the tie-dye is still practiced and can still be seen in many places today. ",
            "date": "Answered November 2, 2019",
            "views": "254",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Udo Andre",
                    "user_href": "/profile/Udo-Andre"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Leto",
                "href": "/profile/Adrian-Leto"
            },
            "answer_text": "Yes, the hippies work tie dye. The tie dye was a form of psychedelic art. It as based on hippies claimed they saw during exposure with hallucinogenic drugs during their trips[1] . Tie-dye for shirts was invented in the United States in the mid-1960s, though the concept was recorded earlier in 1941 in the writing called “Orphans Of the Pacific”[2] and mentioned in 1909 as “tied and dyed” by Luis C. Changsut. Various methods are used to produce tie-dye, including fiber reactive acid and vat dyes[3] . These methods of tie dye in cloth technically dates back to societies in Peru back in 500 AD[4] , but the hippies brought it to the modern day. Footnotes[1] http://Nicholas Murray, Aldous Huxley: A Biography, 419[2] http://\"Orphans of the Pacific\", a book about Philippines published in 1941, referring to tie-dying among the Bagobo tribe: \"There are a few thousand Bagobos, who wear highly decorated clothing made of hemp fiber, all tied-and-dyed into fancy designs, and who further ornament themselves with big metal disks.\"[3] Techniques 2 - First Decisions[4] Projects",
            "date": "Answered November 2, 2019",
            "views": "797",
            "upvotes": " View 3 Upvoters "
        }
    ]
}