{
    "title": "Did Greta Van Fleet start as a Led Zeppelin tribute band? - Quora",
    "tags": [
        "Tribute Bands",
        "Greta Van Fleet (rock band)",
        "Led Zeppelin (band)",
        "Bands (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Baron",
                "href": "/profile/Tony-Baron-2"
            },
            "answer_text": "No. They came together through a mutual love of the Blues (unlike LZ; 2 members were Blues aficionados & 1 was more into Jazz & Motown), but they had other interests. Although sounding more redolent of Black Crowes, the only Led Zeppelin influences I can detect are the drum sound & the occasional ‘yelps’ from the singer. The guitarist is too cliche to be a Jimmy Page-clone (which is the essence of ‘tribute bands’ - although a musician must have their own identity). What I find a little disappointing is that Robert Plant praises them, saying ‘They are Led Zeppelin ! (LZ’s debut album)’. Then again, if some young kids are reminiscing in your style, that’s a good thing. ",
            "date": "Answered September 6, 2018",
            "views": "299",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clint Davis",
                    "user_href": "/profile/Clint-Davis-35"
                },
                {
                    "user_id": "David Esparza",
                    "user_href": "/profile/David-Esparza-4"
                },
                {
                    "user_id": "Raymond Davis",
                    "user_href": "/profile/Raymond-Davis-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony P. Puricelli",
                "href": "/profile/Anthony-P-Puricelli"
            },
            "answer_text": "From their conception in 2012, Greta Van Fleet has covered the following Led Zeppelin songs: The OceanTravelling Riverside BluesCommunication BreakdownI Wanna Be Her ManImmigrant Song*Stompin’ All Down* Now, this isn’t a Led Zeppelin song, but if you listen to Whole Lotta Love off of ‘The Song Remains the Same’, about 8–12 minutes in, Zeppelin goes into a rendition of John Lee Hooker’s Boogie Chillun. The orchestration and flow of their rendition is copied and pasted by Greta Van Fleet when they play “Stompin’ All Down”That is all I can think of. So, I suppose, in the tradition sense of the word, No they are not a cover band, they are a band which, in the past, has covered Led Zeppelin songs. ",
            "date": "Answered December 27, 2018",
            "views": "247",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Brian Radford",
                    "user_href": "/profile/Brian-Radford-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Jacobs",
                "href": "/profile/Tom-Jacobs-62"
            },
            "answer_text": "Without doing any research at all on this, I will say I don’t know. However, that kid who’s the lead singer sure sounds like the spittin’ image of Robert Plant! No foolin’! He’s got Plant’s vocals down!!! Robert Plant: The best vocalist in rock history! It’s refreshing to see young millennials like this band revive the ’60s and early ‘70s classic rock sound (with their own original material) which was the best ever in rock/pop history. ",
            "date": "Answered September 6, 2018",
            "views": "112",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamie Winterhalt",
                    "user_href": "/profile/Jamie-Winterhalt"
                },
                {
                    "user_id": "Clint Davis",
                    "user_href": "/profile/Clint-Davis-35"
                },
                {
                    "user_id": "Raymond Davis",
                    "user_href": "/profile/Raymond-Davis-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Connors",
                "href": "/profile/Chris-Connors"
            },
            "answer_text": "Of course there’s this video from a couple years ago:  Does that answer your question? They would be 100% less insufferable if they weren’t so adamant about their denials of influence and even basically indignant that anyone would even make the comparison. \"You know, they were one of the greatest bands in the history of rock music, and while we're absolutely unworthy of any comparison, I'm just thrilled and honored to be mentioned in the same paragraph let alone same sentence as them.\" HOW HARD WAS THAT ",
            "date": "Answered October 27, 2018",
            "views": "272",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clay Crenshaw",
                    "user_href": "/profile/Clay-Crenshaw"
                }
            ]
        }
    ]
}