{
    "title": "Did Freddie Mercury know he had AIDS during Live Aid? - Quora",
    "tags": [
        "Freddie Mercury",
        "Queen (band)",
        "AIDS"
    ],
    "response": [
        {
            "author_info": {
                "name": "Concetta Ribolli",
                "href": "/profile/Concetta-Ribolli"
            },
            "answer_text": "Probably he suspect, but he wasn’t tested. Back in the 1980's,a lot less was known about HIV than we know about today. Back then,you didn't get 1 test and that was it, you had AIDS. Doctors weren't sure. It usually took multiple tests for a doctor to tell you most certainly that you had the HIV virus in your blood. Up until 1985, tests hadn't been widely available to test for the virus. Up until then, people generally didn't know they had the virus until they were becoming ill and showing serious opportunistic infections. Doctors generally made an AIDS diagnosis based on the patients helper T-Cell level – or lack of them. So it was hard for a doctor to tell someone who wasn't sick that they had HIV virus – the first tests just weren't that accurate. In 1984 there was a test in the primary stages of deployment called the ELISA test & it was being developed to screen out HIV from the blood supply. It was highly sensitive, and very nonspecific, which means it gave a positive result easily even when, in some cases, there is actually no HIV present. It is very unlikely the Freddie's GP would have a offered up his blood to the testing labs in Paris. So, based on the fact that Freddie was still healthy and hadn't changed any of his behaviour by 1984, I don't think he had any real inkling that he was infected. 1985 - Looking at the events - this was the year alarm bells started to ring for Freddie. Firstly, this was the year that the ELISA test had become more accessible and available for doctors in the UK (and the rest of Western Europe) to test their patients for the possibility of HIV turning up in their blood. Freddie was still healthy at this time, or at least he was not showing serious opportunistic infections. But he may very well have had some of the tell-tail signs of HIV infection that doctors in the mid-80's began to recognize as precursors for a person who had the virus, but who had not yet developed full blown AIDS. Some of these initial symptoms are swollen lymphnodes throughout the body, night sweats, and a mild to moderate general malaise. Freddie may have mentioned something to his doctor at one of his checkups - or his doctor may have had his blood tested for HIV along with other possible diseases that were routine for sexually active gay men. If an ELISA HIV test would have come back positive in 1985, Freddie's doctor would have told him, but would also have told him of the high possibility of a 'false positive' result - and would have requested him to do a second, third, or fourth follow-up test. October 2nd, 1985 – Rock Hudson dies from AIDS. It is strange that toward the fall of 1985, Freddie suddenly left Munich and returned to London. Some may say it was because he was ready to settle down at Garden Lodge. He had abruptly cut off some of his closest friends from that city – Kurt (died from AIDS), Winnie K (died from AIDS), & Barbara Valentin (to name a few) without even returning their phone calls or offering any real explanation for the sudden and drastic departure. Another person that was suddenly out of the picture...Paul Prenter. Paul had been employed under Freddie/Queen since the mid-70's and had worked for Queen as recently as the Live Aid concert in July of that year. He was, in many respects, Freddie's sexual liason when Queen were on tour. If you wanted to get to Freddie in a club, you had to go through Paul. 1986 - is where the crap really begins to hit the fan. It was in 1986 that insurance companies began screening their clients for HIV. You can bet that all the members of Queen would have taken out insurance to cover a whole gauntlet of possible liabilities that may arise in the face of a disaster while on tour. Freddie, most likely, under the guidance of Jim Beach, took out a policy that would cover expenses if Queen were unable to take the stage at, let's say, Wembley Stadium, because Freddie lost his voice due to a health issue. Health insurance is essential for singers who earn their living from their instrument. Cover for touring abroad, loss of voice, accidental injury, engagement cancellations and loss of earnings will protect the singer if they are unable to perform due to illness or other unforeseen events. In 1984, the last time Queen started a tour, the ELISA HIV test had not been available to Insurance Companies for the screening of their clients for HIV. You can bet that any insurer willing to cover a voice like Freddie Mercury's on a Stadium Tour across Europe would want to know every little detail of their subject's health and the possibility of having to pay thousands or even millions of pounds due to a tour or concert cancellation if Freddie became ill. It is almost a certainty that before the beginning of the Magic Tour, Freddie, whose liability would have been greatest in the band, would have been tested for many diseases (Now including HIV) and would have found out that he was positive for the virus. No insurance company in their right mind would offer coverage to a person with HIV - especially in 1986 when AIDS was a death sentence. We all know Freddie decided to do the tour -even though he would have been aware of the gamble: if he suddenly became ill or lost his voice (like in Sun City, 1984) - he would be screwed financially! His behaviour on the tour seems to back up this theory. The other band members noticed that something was up with him. He wasn't out partying anymore. Paul Prenter wasn't hired for the tour. (Paul Prenter also died of AIDS in 1991) Freddie knew that this tour would be the last one! Even though my above 'theory' would have a doctor telling Freddie that he had tested positive for HIV in late 1985 or early 1986, that doctor would have told him that the test result may not be so & He would have had to go for multiple tests - and when test result after test result would have come back positive throughout 1986, perhaps Freddie didn't want to hear it again. Perhaps that is why Mary Austin says she received a call from his GP telling her that Freddie wasn't returning his calls and to tell Freddie to call back him? (Do you recall a tabloid story in The Sun (sept 1986) alleging that Freddie had recently taken an AIDS test and Freddie angrily responding: Does it look like I'm Dying?) Early 1987, coincidentally, saw the development of a newer and more reliable HIV test called the Western Blot. It was a much more accurate test than the ELISA. My hypothesis is that Freddie was probably alerted to his HIV status a year and a half earlier in 1985. He had gone for test after test throughout 1986 and finally, in the Spring of 1997 ",
            "date": "Answered February 14, 2019",
            "views": "252",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay Harewood",
                    "user_href": "/profile/Jay-Harewood"
                },
                {
                    "user_id": "James Robertson",
                    "user_href": "/profile/James-Robertson-482"
                },
                {
                    "user_id": "Lorice Walker",
                    "user_href": "/profile/Lorice-Walker-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Miami-Beach-11"
                },
                {
                    "user_id": "Daniel DeMelis",
                    "user_href": "/profile/Daniel-DeMelis"
                },
                {
                    "user_id": "Joe Cohen",
                    "user_href": "/profile/Joe-Cohen-59"
                },
                {
                    "user_id": "Cary Smith",
                    "user_href": "/profile/Cary-Smith"
                },
                {
                    "user_id": "Glyness Roney",
                    "user_href": "/profile/Glyness-Roney"
                },
                {
                    "user_id": "Matt Carrelo",
                    "user_href": "/profile/Matt-Carrelo"
                },
                {
                    "user_id": "Cathy Stubbs",
                    "user_href": "/profile/Cathy-Stubbs-26"
                },
                {
                    "user_id": "Shelley Marks",
                    "user_href": "/profile/Shelley-Marks-1"
                },
                {
                    "user_id": "Karen Cook",
                    "user_href": "/profile/Karen-Cook-215"
                },
                {
                    "user_id": "Ken Wilkie",
                    "user_href": "/profile/Ken-Wilkie"
                },
                {
                    "user_id": "Niki Labiri",
                    "user_href": "/profile/Niki-Labiri"
                },
                {
                    "user_id": "Leticia Woolrich",
                    "user_href": "/profile/Leticia-Woolrich"
                },
                {
                    "user_id": "Beverlie Beck",
                    "user_href": "/profile/Beverlie-Beck"
                },
                {
                    "user_id": "Lawrence Scott",
                    "user_href": "/profile/Lawrence-Scott-10"
                },
                {
                    "user_id": "Victoria Makhmaltchi",
                    "user_href": "/profile/Victoria-Makhmaltchi"
                },
                {
                    "user_id": "Beatriz Matias",
                    "user_href": "/profile/Beatriz-Matias"
                },
                {
                    "user_id": "Sandy Milinkovic",
                    "user_href": "/profile/Sandy-Milinkovic"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Tonya Byrd",
                    "user_href": "/profile/Tonya-Byrd"
                },
                {
                    "user_id": "Pam Skinner",
                    "user_href": "/profile/Pam-Skinner-2"
                },
                {
                    "user_id": "Chelee Riley",
                    "user_href": "/profile/Chelee-Riley"
                },
                {
                    "user_id": "Zoe Ann",
                    "user_href": "/profile/Zoe-Ann-34"
                },
                {
                    "user_id": "Donna Mumford-Stroup",
                    "user_href": "/profile/Donna-Mumford-Stroup"
                },
                {
                    "user_id": "Richelle Isidro",
                    "user_href": "/profile/Richelle-Isidro"
                },
                {
                    "user_id": "Jazzy Stefan Mananian",
                    "user_href": "/profile/Jazzy-Stefan-Mananian"
                },
                {
                    "user_id": "Alyce Dal",
                    "user_href": "/profile/Alyce-Dal"
                },
                {
                    "user_id": "Judie Kolmetz",
                    "user_href": "/profile/Judie-Kolmetz"
                },
                {
                    "user_id": "Augustas Petrošius",
                    "user_href": "/profile/Augustas-Petrošius"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicolette Queen",
                "href": "/profile/Nicolette-Queen-1"
            },
            "answer_text": "Freddie was worried about it since 1982, many friends and people from the gay community succumbed to the illness and Freddie assumed/were worried he'd have it too. He had some tests done somewhere in 1982. However, the tests for HIV was crap back then and inaccurate. I'd even go as far as to say that medici hadn't really fully understood the disease at that stage either. He waited for more accurate tests which came in the later 80s. It's not confirmed when Freddie knew he had contracted Hiv, but he was officially diagnosed with full blown aids in 1987 according to his partner, Jim Hutton. Due to poor medical tests, it's possible that Freddie never officially knew he had HIV, he only officially knew when it already transitioned to AIDS. I think at the back of his mind, he'd known for years something wasn't right even if it wasn't confirmed. Freddie knew his lifestyle and habits, and he knew the fate that had befallen his peers who had similar sexually promiscuous habits. He wasn't blind to the spread of AIDS and he must've been worried. But, to answer your question, NO. Freddie did not know for sure he had AIDS during live aid (1985), as he was diagnosed in 1987 only. That part of the movie is purely fictional for dramatic effect. ",
            "date": "Answered February 14, 2019",
            "views": "91",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorice Walker",
                    "user_href": "/profile/Lorice-Walker-1"
                },
                {
                    "user_id": "Alena Hronská",
                    "user_href": "/profile/Alena-Hronská"
                },
                {
                    "user_id": "Alice Samsara",
                    "user_href": "/profile/Alice-Samsara"
                },
                {
                    "user_id": "Melonie Gregory",
                    "user_href": "/profile/Melonie-Gregory-1"
                },
                {
                    "user_id": "Shelley Marks",
                    "user_href": "/profile/Shelley-Marks-1"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Deborah Brady",
                    "user_href": "/profile/Deborah-Brady-15"
                },
                {
                    "user_id": "Matt Rimmer",
                    "user_href": "/profile/Matt-Rimmer-6"
                },
                {
                    "user_id": "Matthew J. Carlo",
                    "user_href": "/profile/Matthew-J-Carlo-1"
                },
                {
                    "user_id": "Lawrence Scott",
                    "user_href": "/profile/Lawrence-Scott-10"
                },
                {
                    "user_id": "Nikita Agrawal (निकिता अग्रवाल)",
                    "user_href": "/profile/Nikita-Agrawal-निकिता-अग्रवाल"
                },
                {
                    "user_id": "Darlene Johnson Petry",
                    "user_href": "/profile/Darlene-Johnson-Petry"
                },
                {
                    "user_id": "Judie Kolmetz",
                    "user_href": "/profile/Judie-Kolmetz"
                },
                {
                    "user_id": "Richelle Isidro",
                    "user_href": "/profile/Richelle-Isidro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lane Russell",
                "href": "/profile/Lane-Russell-5"
            },
            "answer_text": "Freddie Mercury wasn’t diagnosed with AIDS until 1987 (Live Aid was in 1985). He knew he was HIV-positive before that (allegedly as early as 1982), but it wouldn’t even be referred to as HIV until mid-1986. Chances are good that Mercury didn’t get a proper diagnosis in the early ’80s (most scientists and doctors didn’t even know what they were looking at during that time) and if he did it would have been known as GRID (“Gay-Related Immune Deficiency”). Furthermore, unlike in the movie Bohemian Rhapsody, the band wasn’t sore and disjointed after Mercury released his solo album - the solo album was made with their blessing, and Live Aid capped off their most recent world tour. The Changes 'Bohemian Rhapsody' Made To Freddie Mercury's Life Story Are Impossible To Ignore History of HIV and AIDS overview ",
            "date": "Answered March 10, 2019",
            "views": "82",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nour Elalmi",
                    "user_href": "/profile/Nour-Elalmi"
                },
                {
                    "user_id": "CW CW",
                    "user_href": "/profile/CW-CW-26"
                },
                {
                    "user_id": "Melonie Gregory",
                    "user_href": "/profile/Melonie-Gregory-1"
                },
                {
                    "user_id": "Rumay Oosthuizen",
                    "user_href": "/profile/Rumay-Oosthuizen"
                },
                {
                    "user_id": "Susana Ritenour",
                    "user_href": "/profile/Susana-Ritenour"
                },
                {
                    "user_id": "Shelley Marks",
                    "user_href": "/profile/Shelley-Marks-1"
                },
                {
                    "user_id": "Beverlie Beck",
                    "user_href": "/profile/Beverlie-Beck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Fernandes",
                "href": "/profile/Mark-Fernandes-77"
            },
            "answer_text": "He hadn’t had a blood test yet at that stage, but maybe suspected that he was highly likely to be HIV positive, as it was around the mid 1980’s that facts were emerging worldwide about high risk activities and methods of transmission etc. Freddie was definitely HIV positive for many years prior to Live Aid, but it hadn’t been confirmed and he was unaware of his status, until the following year, 1986. His 13th Blood test in 1987 confirmed that he had developed full blown AIDS. So, he definitely knew from 1986, but not at Live Aid, though he maybe suspected at that time. ",
            "date": "Answered June 11, 2019",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorice Walker",
                    "user_href": "/profile/Lorice-Walker-1"
                },
                {
                    "user_id": "Melonie Gregory",
                    "user_href": "/profile/Melonie-Gregory-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Girvin",
                "href": "/profile/Veronica-Girvin"
            },
            "answer_text": "Freddie mercury had saw a doctor in New York 1982 between July and August. An was ask had he heard of it had everyone Rock Hutchison who die 1985 . Look everything 1 thinks it won't happen it pass I'm burning myself out . Aid is not a tonken bad life stile. Just bad choice. An he made a difference to music. Is what he live for ",
            "date": "Answered February 14, 2019",
            "views": "966",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Starstruck",
                "href": "/profile/Larry-Starstruck"
            },
            "answer_text": "It is my understanding that it was added to the film for dramatic effect and from a narrative standpoint, made the Live Aid Concert a bigger part of the story. He still looked very healthy at that time. Around the time of the Miracle album, you started seeing some signs where Freddie was starting to lose weight. In fact, the I want it all video shows a few signs but one of his best songs. ",
            "date": "Answered February 15, 2019",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorice Walker",
                    "user_href": "/profile/Lorice-Walker-1"
                },
                {
                    "user_id": "Melonie Gregory",
                    "user_href": "/profile/Melonie-Gregory-1"
                },
                {
                    "user_id": "Pam Skinner",
                    "user_href": "/profile/Pam-Skinner-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aley Crooker Martin",
                "href": "/profile/Aley-Crooker-Martin"
            },
            "answer_text": "Nope! He did not know that early. He did have a kaposi’s sarcoma on his arm, but I do not think he :knew what it was! He did not tell the band anything until 1990 or so…they just condensed it for the movie. ",
            "date": "Answered February 14, 2019",
            "views": "697",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Howard Ashley",
                "href": "/profile/Howard-Ashley"
            },
            "answer_text": "My wife saw “Bohemian Rhapsody” last night. We were discussing it this morning at breakfast. According to this account of his life, yes, he knew his HIV status at the time of the Live Aid Concert. ",
            "date": "Answered February 14, 2019",
            "views": "731",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Stevens",
                    "user_href": "/profile/Robert-Stevens-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Luchmanan",
                "href": "/profile/Steven-Luchmanan"
            },
            "answer_text": "No ",
            "date": "Answered February 14, 2019",
            "views": "739",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neil Anderson",
                    "user_href": "/profile/Neil-Anderson-30"
                }
            ]
        }
    ]
}