{
    "title": "Did Arianna Grande kill Mac Miller? - Quora",
    "tags": [
        "Mac Miller (musician)",
        "Ariana Grande (actor, musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Killing",
        "Hip Hop Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maiya Parker",
                "href": "/profile/Maiya-Parker-2"
            },
            "answer_text": "No. Mac died of an overdose to deadly drugs. He overdosed. She did not kill him. He made the decision to take drugs that day. Ariana loved and still loves him so much. If you think she killed just cause they broke up a few months before, you should be ashamed of yourself. She should not have stayed in that relationship. It was toxic. She was not his mom or babysitter, and she didn’t even feel like his girlfriend anymore. Why would she stay? It was probably breaking her heart more and more everyday to know he was hurting himself. She did not need the stress and worry that came with being with him anymore. She still loved him, of course, but they couldn’t be together anymore. She’s not responsible for him. She was his girlfriend. There to love and support him. Not to take care of him 24/7. She loved & supported him, and took care of him for a while. She ended it. They probably fought a lot near the end. Would you really want to see the man you’re in love with take something and be addicted to it, something deadly? No of course not. There was probably some conversations where she was crying and begging him to stop. That’s heartbreaking. Ariana Grande did not kill Mac Miller. She was devastated, and that most likely broke her entirely. She misses him everyday. I can’t believe you would have the indecency to even ask this. RIP Mac Miller, January 19th, 1992 - September 7th, 2018 You we’re so loved. You are still loved. And you will always, always be remembered and you and your music will live in our hearts. I love you. Thank you for all that you gave us. You really were an angel and did not deserve the fate you got. ",
            "date": "Answered September 11, 2019",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Spotify Stan",
                    "user_href": "/profile/Spotify-Stan"
                },
                {
                    "user_id": "CrownTownz",
                    "user_href": "/profile/CrownTownz"
                },
                {
                    "user_id": "Kairi Sunn",
                    "user_href": "/profile/Kairi-Sunn"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jane-Doe-6207"
                }
            ]
        },
        {
            "author_info": {
                "name": "Des Yeats",
                "href": "/profile/Des-Yeats"
            },
            "answer_text": "No. Why would she? He died of a drug overdose (according to popular media) and that’s that. Ariana Grande didn’t do anything. Mac just… massively screwed up. I love his music. Kool Aid and Frozen Pizza screams to me. Ariana grande didn’t do anything to Mac. She publically mourned his death. Could she have killed him? Yes. Is it unlikely? Oh yeah. Just don’t go around thinking that Ariana killed Mac. ",
            "date": "Answered February 20, 2019",
            "views": "576",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devin Anthony Florio",
                "href": "/profile/Devin-Anthony-Florio"
            },
            "answer_text": "No she didn’t, if she did then she would be in jail right now, Mac Miller died because of an overdose of a certain type of drug, Ariana Grande would never kill any celebrity she collaborated with or anything like that, she wasn’t raised to kill anybody in her life!! I suggest that this question has got to be deleted because this question just scares me a little bit. ",
            "date": "Answered February 22, 2019",
            "views": "486",
            "upvotes": "0"
        }
    ]
}