{
    "title": "Do you often like to sing? - Quora",
    "tags": [
        "Juilliard Pre-College",
        "Till Lindemann",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Willmoth",
                "href": "/profile/Emily-Willmoth"
            },
            "answer_text": "I love to sing so much that I miss it when I go away to uni. It’s not singing by myself that I like, you see. It’s singing with my family. Sometimes one of us will start singing a song that we all know, like ‘Yellow Bird’ or ‘In the Jungle’ or ‘Amazing Grace’ and the others will join in on the harmony. My sister sings the main tune, usually, and my other sister does the mid-range harmony whilst I do the high bits and our dad sings low-range, even though I should swap with my sister because my voice is deeper than hers, and sometimes someone will take up the piano or the guitar parts… In the car it’s the best. We’ll have the CD that we all know and we’ll sing ad-lib harmonies (sometimes dubious) to all the pieces we like, and sometimes I’ll doze and listen to them, and sometimes we’ll all belt out the main tune because we’re alone on a country road or we’re going down a motorway in the dark and that’s just what you should do at those times. My sister’s friend said that he likes to play the piano and let us sing to it because it makes him feel like he’s in Little Women. I don’t know why people are so reluctant to sing with people. Maybe people can’t sing perfectly. I can’t. Maybe they’re afraid of messing up. I do. But it’s sad to be on a coach for two hours with your friends and it’s entirely songless the whole way, even if there are songs to which you’d all know the words. ",
            "date": "Answered January 20, 2019",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Will Rimmer",
                "href": "/profile/Will-Rimmer-3"
            },
            "answer_text": "I LOVE TO SING SOOOOO MUUUUUCH! It’s just as much of an experience for me as it is for those that like to hear me sing. I’ll say this, the majority of those I knew think positively on my voice so I’m not trying to say I sing carelessly. And the positive feedback I’ve gotten, having the ability to sing almost any song I desire, and liking how I sound overall are the reasons why I like to sing over all other things I practice. ",
            "date": "Answered June 15, 2020",
            "views": "46",
            "upvotes": " Answer requested by Olga Fransiola",
            "upvoters": [
                {
                    "user_id": "Jojo Bee",
                    "user_href": "/profile/Jojo-Bee-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alisonn Quinn",
                "href": "/profile/Alisonn-Quinn"
            },
            "answer_text": "A ton! I play the piano for at least 2 hours a day on weekends, and about one and a half on school days. I sing when I am playing piano, I sing in the car, and I sing at home. I don’t sing at school though, because I don’t really like singing in front of people that aren’t my family. They make a big deal about it because they are suprised that I can actually sing. They think that I’m just a nerd. ",
            "date": "Answered June 9, 2020",
            "views": "79",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "David Palmer",
                "href": "/profile/David-Palmer-393"
            },
            "answer_text": "it’s my greatest love in life apart from family and friends. It nurtures me spiritually mentally and physically.. it has provided me with friendships, admiration, kudos, and an income. It makes me use my memory, intelligence, empathy and imagination. ",
            "date": "Answered June 9, 2020",
            "views": "25",
            "upvotes": " Answer requested by Olga Fransiola"
        },
        {
            "author_info": {
                "name": "Micah Lidonde",
                "href": "/profile/Micah-Lidonde"
            },
            "answer_text": "A lot. ",
            "date": "Answered June 9, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}