{
    "title": "Do young French people think French popular music is cool? - Quora",
    "tags": [
        "French Ethnicity and People",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "François Chevallier",
                "href": "/profile/François-Chevallier-2"
            },
            "answer_text": "A2A. It is not very clear anymore what “French popular music” is. Nowadays, the most famous groups making music in French are rap groups using an idiom not understandable by the majority. Young French people, let’s say teenage until late twenties, are very familiar with his type of music, wether they like it or not, because it gets most broadcast and publicity. And it’s supposed to be “badass”, which young people tend to like . But then when a big figure like Charles Aznavour dies (yes, he was also Armenian…), all the young people ask what the big deal is and they listen to what it sounded like. All old major Aznavour hits have been topping the French charts since yesterday. And the funny thing is that many young people discover them on such occasions. Their reactions are typically a bit startled, as it sounds both fully understandable and yet almost alien. But then they (often) get aware that there is quite an impressive heritage of “old French pop”, with quite a few really big voices and very elaborate lyrics, entwined with the melodic specificities of the language. It does work on “young people”, but only gradually.  I rediscovered the French pop heritage myself for example mostly after it had been popular, much more than when I was “young”. In the 1980’s, what was cool to listen for young people was… rock music in English (which hardly anyone could fully understand back then). Now rock has been replaced by hip hop or electro or metal, but what’s “cool” is STILL in English. However, as you get more mature, you often lose interest in shallow stuff, and get to appreciate classics more. That’s how they may serve as inspiration for new artists, with surprising results. Even if Stromae sounds very different from Brel, inspiration gets very obvious when you pay attention. So the answer to the question at this point seems to be no, not really. But “French popular music” has quite a consistent heritage only waiting to be rediscovered, once the young French people think Lady Gaga and the like is no longer cool. ",
            "date": "Updated September 1, 2019",
            "views": "35",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "GP Chen",
                    "user_href": "/profile/GP-Chen"
                },
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                },
                {
                    "user_id": "Andrei Istrate",
                    "user_href": "/profile/Andrei-Istrate-3"
                },
                {
                    "user_id": "Charley Custer",
                    "user_href": "/profile/Charley-Custer-1"
                },
                {
                    "user_id": "Emmanuel Florac",
                    "user_href": "/profile/Emmanuel-Florac"
                },
                {
                    "user_id": "Hanna Gee",
                    "user_href": "/profile/Hanna-Gee"
                },
                {
                    "user_id": "Ed Hakobyan",
                    "user_href": "/profile/Ed-Hakobyan"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                },
                {
                    "user_id": "Robby Shima",
                    "user_href": "/profile/Robby-Shima"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Oscar Ekman",
                    "user_href": "/profile/Oscar-Ekman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lina Chemin",
                "href": "/profile/Lina-Chemin"
            },
            "answer_text": "Yes, there are a whole variety of French artists that are successful in France with the youth. Some rappers and young singers are very popular with the 15–25, some alternative singers like Christine and the Queens with 20-something people. There is a whole scene of French music in France that is very popular. ",
            "date": "Answered October 11, 2018",
            "views": "297",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will Walker",
                    "user_href": "/profile/Will-Walker-163"
                },
                {
                    "user_id": "Kimi Drago",
                    "user_href": "/profile/Kimi-Drago"
                },
                {
                    "user_id": "Jack Rizio",
                    "user_href": "/profile/Jack-Rizio"
                },
                {
                    "user_id": "Justin Mihalick",
                    "user_href": "/profile/Justin-Mihalick"
                }
            ]
        }
    ]
}