{
    "title": "Do you think rap music is black people music? - Quora",
    "tags": [
        "Rap Music",
        "Black People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manny Faces",
                "href": "/profile/Manny-Faces"
            },
            "answer_text": "Depends on what you mean. Rap as a genre came to life as a combination of many musical styles that came before it, many that were indeed created and popularized by African Americans (gospel, jazz, soul, rock and roll, disco, reggae). The socio-economic forces that created the atmosphere around which rap music came into its own in the South Bronx largely affected African and Americans and people of Caribbean decent — and to a great degree, Hispanic Americans as well. But yes, the creation, growth and popularization of the genre was largely fueled by the talents, voices and perspectives of African Americans. In that regard, rap music is, as was jazz and rock and roll, “black people music.” However, rap has always been enjoyed by a wide variety of people, including many non-African Americans. Indeed, several successful artists in hip-hop have been white or Hispanic and much of the genre’s consumers over the years have been white. The expansion of rap music into popular culture, has widened its appeal even greater, so that today, much of pop music is rap-influenced, made and enjoyed by people from all ethnicities. So, the answer is, yes, at its core, the creation of rap music should almost completely be attributed to African Americans. At the same time, as it has grown into a form of expression that has crossed all boundaries — ethnic, linguistic, geographic — it is not a genre that is exclusive to African Americans. ",
            "date": "Answered October 29, 2017",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Courtney Nelson",
                    "user_href": "/profile/Courtney-Nelson-135"
                },
                {
                    "user_id": "Cavaugn Sharkey",
                    "user_href": "/profile/Cavaugn-Sharkey"
                },
                {
                    "user_id": "Ethan Hein",
                    "user_href": "/profile/Ethan-Hein"
                },
                {
                    "user_id": "T Prez",
                    "user_href": "/profile/T-Prez-1"
                },
                {
                    "user_id": "Jeffrey Howard",
                    "user_href": "/profile/Jeffrey-Howard-6"
                },
                {
                    "user_id": "Grant Hartlage",
                    "user_href": "/profile/Grant-Hartlage-1"
                },
                {
                    "user_id": "Robert Strickland",
                    "user_href": "/profile/Bobby-Strick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Featherstone",
                "href": "/profile/Mark-Featherstone-5"
            },
            "answer_text": "Rap is black music.   Does that mean non Black people can’t participate? No, sir. It does not, but it is Black music. Incidentally, I don’t agree with everything the god, Jamar, says but I respect him 500 percent. And he doesn’t lie like a lot of the rap Toms. A lot of them will say whatever in an interview, because they are mentally castrated. And for the first time in Us musical history, mostly due to the change in demographics of the US population and the decision of Black people to continue to rap: rap has stayed mostly Black. Most Black kids in the hood don’t really fuck with White artists, because they can’t relate and White artists don’t have to deal with Black rage, white supremacy and rampant depression everyday. It is what it is. Here’s the thing though hip hop in all its’ forms was popularized by three groups of people of Black descent: Jamaicans (Kool Dj Here with the dub plates that lead to all DJ culture worldwide)Black AmericasBoricuasIn addition, Graf was always multicultural from the very beginning. Rappers were not my role models coming up. When cats first started rapping, there were all mostly dead broke doing house parties and mixtapes. 95 percent of the emcees were eating massive shit living with they Moms in the PJS— projects. MY HEROES COMING UP were these people.  LADY PINK  LEE QUINONES  DONDI WHITE When I wanted to learn my letters, my father had this blond French- American kid teach me my letters. If I hadn’t of learned how to draw my letters, I would have never made it. Dead or in jail. The streets were bad. Now they’re worse.    Those two books above were my guide after I learned my letters. Most of the graf writers doing pieces when I came up were Puerto Rican or White. I would like to lie and say it was because of money. It was NOT. Most of the Black kids who wrote just wanted to tag, fight and do throw ups. My experience. And brothers can pretend that’s not what we did, but we mostly smoked lye, tagged and ducked sirens. Self hate and black rage are horrendous. FOH. The purpose of all aspects of hip hop is to do something positive besides running the streets , killing yourself or killing other people. The rap game has hijacked hip hop for a long time. Rap is not hip hop. That’s it. ",
            "date": "Answered November 22, 2017",
            "views": "677",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cavaugn Sharkey",
                    "user_href": "/profile/Cavaugn-Sharkey"
                },
                {
                    "user_id": "T Prez",
                    "user_href": "/profile/T-Prez-1"
                },
                {
                    "user_id": "Migilla Jonesy",
                    "user_href": "/profile/Migilla-Jonesy"
                },
                {
                    "user_id": "Nathaniel Quinones",
                    "user_href": "/profile/Nathaniel-Quinones-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gil Fragoso",
                "href": "/profile/Gil-Fragoso-3"
            },
            "answer_text": "yes but anyone can listen to it, but if your white dont sling the n word around too hard in the car black people invented blues and jazz, but white people took blues and made rock and roll mainstream but like i dont identify with tpac as much for example because he raps about the black struggle but i like wu tang because they are funner and instrumentals are awesome i dont know decide for yoursellf just listen to it ",
            "date": "Answered January 7, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cavaugn Sharkey",
                    "user_href": "/profile/Cavaugn-Sharkey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isaiah Pablo",
                "href": "/profile/Isaiah-Pablo"
            },
            "answer_text": "It was started by blacks and shared with the world in a way so yes. However, every race listens to it now. Whites, blacks, Hispanics, Asians, list goes on. I remember stopping at an intersection and seeing this Asian guy blasting out Chief Keef’s “Understand me” lol. It’s become a popular form of music especially since pop and rock artists collaborated with rappers.  ",
            "date": "Answered May 29, 2018",
            "views": "304",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thunder Powell",
                "href": "/profile/Thunder-Powell-1"
            },
            "answer_text": "It’s a known thing that it’s heavily influenced by black culture, has a artist demographic almost entirely of black males, and is a staple in the black community. However the main listeners of rap are actually white males. So you know…. take it how you want. ",
            "date": "Answered October 29, 2017",
            "views": "344",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Blowinski",
                    "user_href": "/profile/Joseph-Blowinski"
                },
                {
                    "user_id": "Scott Foreman",
                    "user_href": "/profile/Scott-Foreman-15"
                },
                {
                    "user_id": "Robert Strickland",
                    "user_href": "/profile/Bobby-Strick"
                },
                {
                    "user_id": "Ethan Swain",
                    "user_href": "/profile/Ethan-Swain-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack DiNucci",
                "href": "/profile/Jack-DiNucci"
            },
            "answer_text": "It is a music form from black people, so technically it is “black people”, but this does not mean it is only for black people. And it sure as hell does not mean that it is cultural appropriation for any non black person to listen to it. ",
            "date": "Answered October 29, 2017",
            "views": "123",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cavaugn Sharkey",
                    "user_href": "/profile/Cavaugn-Sharkey"
                },
                {
                    "user_id": "Xavion Brown",
                    "user_href": "/profile/Xavion-Brown-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carrie Stewart",
                "href": "/profile/Carrie-Stewart-17"
            },
            "answer_text": "No. It’s not even music. It usually consists of some attempt at rhyming dialogue laced with political or racsist hatred combined with elements of misogyny and disrespect for establishment values. It’s not music. It’s dogma at best. ",
            "date": "Answered October 29, 2017",
            "views": "534",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cody Bailiff",
                    "user_href": "/profile/Cody-Bailiff"
                },
                {
                    "user_id": "Joseph Blowinski",
                    "user_href": "/profile/Joseph-Blowinski"
                },
                {
                    "user_id": "Brian Yendzik",
                    "user_href": "/profile/Brian-Yendzik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Thuse",
                "href": "/profile/Jay-Thuse"
            },
            "answer_text": "See, rap music/street poetry was initially found by the African-American people in 1970. They are the pioneers of rap music/street poetry. But, why do you call rap music as a black people music? Music is music, irrespective of any human race. :) ",
            "date": "Answered October 29, 2017",
            "views": "280",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Suklabaidya",
                    "user_href": "/profile/Abhishek-Suklabaidya"
                },
                {
                    "user_id": "Aadit Sabareesh Nair",
                    "user_href": "/profile/Aadit-Sabareesh-Nair"
                },
                {
                    "user_id": "Neeraj Joglekar",
                    "user_href": "/profile/Neeraj-Joglekar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morris Martinez",
                "href": "/profile/Morris-Martinez"
            },
            "answer_text": "I don’t think so, but I’m pretty sure a good portion of people do. Especially those who tend to put an emphasis on race in most other aspects of life. The fact of the matter is that it is predominately created by black artists, and it was invented by inner city black youths. But now it’s just music. It’s mainstream music. ",
            "date": "Answered October 29, 2017",
            "views": "194",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MaBee Diamond",
                    "user_href": "/profile/MaBee-Diamond"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gilang Rupaka",
                "href": "/profile/Gilang-Rupaka"
            },
            "answer_text": "That’s a stereotype. nowadays shitty rappers that mumble along the song were black. ",
            "date": "Answered October 29, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mara McGuirk",
                "href": "/profile/Mara-McGuirk"
            },
            "answer_text": "No not at all ",
            "date": "Answered October 29, 2017",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Mason",
                "href": "/profile/Michael-Mason-69"
            },
            "answer_text": "I do. ",
            "date": "Answered November 4, 2017",
            "views": "48",
            "upvotes": "0"
        }
    ]
}