{
    "title": "Does Bob Dylan even write all of his lyrics? - Quora",
    "tags": [
        "Bob Dylan (musician)",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Burr",
                "href": "/profile/James-Burr-20"
            },
            "answer_text": "The objective answer is ‘Yes’. He writes all of his lyrics. Any Lyrics attributed to (Bob Dylan) were written by Bob Dylan, to my knowledge. He doesn’t write all of the lyrics to all of the songs he has recorded. In his first album I know he he covered ‘House of the rising sun’ and ‘Man of constant sorrow’. Judging by the sass in your questions through your use of the word ‘even’ I’m guessing you see this as a bad thing? I hope you’re as tough on actors as you are on songwriters, both artists in their own right. Does Meryl Streep even write all of the movies she’s in? Bob Dylan never claimed he wrote every single lyric that he sang, but damn, he wrote some beautiful songs. ",
            "date": "Updated July 18, 2018",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Ray",
                    "user_href": "/profile/Stephen-Ray-1"
                },
                {
                    "user_id": "Jamie Strauss",
                    "user_href": "/profile/Jamie-Strauss-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "KB Me",
                "href": "/profile/KB-Me-1"
            },
            "answer_text": "No, but why write ‘even’ in your question? It seems a bit disparaging to the man who is unquestionably the greatest lyricist/musician of our age…. You do realize that he won the Nobel Prize for Literature ?..) …His best and most frequent co-lyricist is Robert Hunter…Bob Dylan Rep Confirms Robert Hunter Co-Wrote “Together Through Life” Lyrics Also, his lyrics are replete with quotes and or para-phrasings of poems, songs, literary allusions, etc… ",
            "date": "Answered October 15, 2018",
            "views": "831",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Pearson",
                "href": "/profile/Paul-Pearson-4"
            },
            "answer_text": "Pretty much. He’s had a few collaborations and some covers albums, but the bulk of his songs are all his lyrics. ",
            "date": "Answered March 24, 2018",
            "views": "372",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leonard Haid",
                "href": "/profile/Leonard-Haid-1"
            },
            "answer_text": "Most of them. He’s made a few albums of traditional folk songs not written by himself, and has put a few songs on other albums which were not written by himself. He’s never falsely claimed to have written songs he never actually wrote, if that’s what you’re implying. ",
            "date": "Answered October 13, 2016",
            "views": "798",
            "upvotes": "0"
        }
    ]
}