{
    "title": "Does vibrato on the cello become so natural you can sustain it for lengthy periods of time? - Quora",
    "tags": [
        "Vibrato"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Huestis",
                "href": "/profile/George-Huestis"
            },
            "answer_text": "More than that, it becomes a sort of reflex that you fine-tune to particular sounds and frequencies without actively thinking about it. You’ll note when learning vibrato that you frequently find yourself in situations where the vibrato gets in the way of what you’re trying to do with your hand other than vibrato. For this reason, students are first encouraged to do vibrato on long notes, but teachers tend to look the other way on the short ones. Eventually, this grace period ends and your teacher starts asking you to do the seemingly impossible. …But at that point, you’ve had a year or two of experience doing vibrato on long notes, and it turns out that doing vibrato on short notes is the same, just either faster or fewer “iterations.” Your teacher will start saying annoying things like “don’t ramp up the vibrato, start full tilt!” It will feel impossible, but you’ll get it eventually, even though you won’t be really sure why they’re asking for it in places where it seems like you have plenty of time to ramp up. From there, you’ll learn to control vibrato on “runs” - where you’ll realize that you no longer have time to ramp up at all. Eventually you stop thinking about it altogether, it just happens. Automatically. All the time. You’ll be able to decide whether you’re ramping up or not (different sound each way) and whether you’re tailing off or not. You’ll feel like the bestest cellist ever. …And then your teacher will do something supremely annoying. They’ll say “great! Now do that again… without vibrato.” ",
            "date": "Answered December 10, 2017",
            "views": "198",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wade Williams",
                    "user_href": "/profile/Wade-Williams"
                }
            ]
        }
    ]
}