{
    "title": "Does anyone feel that BlackPink is overrated? - Quora",
    "tags": [
        "BLACKPINK",
        "Overrated Things or People",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Siyoon",
                "href": "/profile/Kim-Siyoon-1"
            },
            "answer_text": "Totally over hyped and overrated. Since their recent late arrival at the event where David Beckham had to wait for them, their public image have gone worse too. (please look at the edit) I am Korean, and I want to mention about YG’s media manipulation here… Korea’s newspapers maximized way much about Blackpink’s great success in U.S., like how their U.S. concert tours have been sold out, while none of the official accounts of their concert places have confirmed the truth about their sold out. Another manipulation; there was a comparison newspaper about BTS and BLACKPINK. The title was, “the different way of billboard successors, bts and blackpink”. It says that BTS succeeded with their social media, and blackpink with their musicality. In fact, Blackpink was out of billboard withn a week, which many people assumed was due to their youtube views, and their albums were sold less than ten thousand in America. Also, they have 1o songs since their debut in 2016(before kill this love comeback), neither participated in the makings. Secondly, they are not talented as they are rated in public. Do you think they are? Their dance moves are simpler in comparison to other girl groups like Gfriend. Also Mamamoo’s vocal is way better. I am not saying Blackpink is not talented but they are not talented enough to be said in such ways in public. Third, are they passionate? It’s well known about Jenny’s ‘lazy’ dance, how she dances differently since her debut and now. And the amount of songs they released? 16 songs, for 4 years? That does not sounds passionate for music nor performance. Or breaking the dating rules, for her own good sake(Jennie). For those who don’t know, Blackpink was banned from dating for their career, and it turned out that YG didn’t know at all about Jennie’s dating, until dispatch broke a news about Jennie and Kai of EXO being a couple. A few months later both SM and YG admitted their breakup. Fourth, they are not popular in US. Most of their youtube views are from Eastern Asian countries like Thailand, since Lisa is from Thailand. EXO had more success in US than Blackpink. They sold more albums in US than Blackpink. Even now, Korean newspapers are publishing news about how Blackpink is the revolution. Lastly, their lyrics are meaningless, neither they themselves are truthful. They seemed very fake in front of cameras, and their lyrics are only talking about boys, love, breakups, or even worse, nothing. Some said Blackpink represents women power or feminism, but I don't really see any lyrics to support that. And personally, I don’t understand why they would do a concert with 10 songs(practically nine, because one is acoustic version of their song). Seungri(former member of Big Bang) often performed at their concert to fill the time, since Blackpink’s songs are not fully enough for the concert. The funny thing is, Seungri got better reaction and applause at the time. Edit: Blackpink's concert sold-out is not true, since some tickets are re-sold, so now a quarter is vacant in their concert. Some people think that YG bought these re-sell tickets to report of Blackpink’s “sold-out US tour” in public to maximize their success. Edit2: BP was criticized recently hard by the Korean public. On Oct 9th, there was Adidas event, and David Beckham and BP were invited since they both were the brand models. However BP arrived late more than 20 minutes, and the public criticized BP hard for making Beckham wait. There were other opinions that Blackpink have been waiting for their turn, but YG admitted Blackpink’s arrival later. There is a very good example that can be compared with BP; Red Velvet. RV also have been late to an event, but they apologized right after they got on their stage with their heads down. BP did nothing. There are even witnesses who have been at the place, that BP have been laughing and talking altogether as they entered the event hall, even though their staffs’ expression were dark for the late arrival. Also, they were criticized for posting a video of Jennie and Jisu playing by taking selfies on their Instagram account on the day Seungri and YangHyeonsoek’s crimes have been reported. There were opinions that they are airheaded, since it was the day YG’s public image has crashed. Literally. BP’s other faults have been mentioned again, too. For example how Doyeon Jang, a comedian had to make up for Blackpink’s late arrival for ‘Elle style award’. Until BP showed up, she had to fill up the time by her ad-lib. Not only this, but YG staffs have been also controversial, such as for their illegal parking in front of a restaurant with Jennie in the car, and how they pushed an elder on the street to make a way for BP to pass, and all of these with no apology. ",
            "date": "Updated December 21, 2019",
            "views": "563",
            "upvotes": " View 1.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miyu Tanabe (田辺 実結)",
                    "user_href": "/profile/Miyu-Tanabe-田辺-実結"
                },
                {
                    "user_id": "Hiral Jawarkar",
                    "user_href": "/profile/Hiral-Jawarkar"
                },
                {
                    "user_id": "Juhi Rathore",
                    "user_href": "/profile/Juhi-Rathore-6"
                },
                {
                    "user_id": "Santosh Pinisetty",
                    "user_href": "/profile/Santosh-Pinisetty"
                },
                {
                    "user_id": "Johannes Acuna",
                    "user_href": "/profile/Johannes-Acuna"
                },
                {
                    "user_id": "A Little Creative",
                    "user_href": "/profile/A-Little-Creative"
                },
                {
                    "user_id": "Dhriti",
                    "user_href": "/profile/Dhriti-31"
                },
                {
                    "user_id": "Carmen Yong",
                    "user_href": "/profile/Carmen-Yong-20"
                },
                {
                    "user_id": "Grace Elizabeth",
                    "user_href": "/profile/Grace-Elizabeth-362"
                },
                {
                    "user_id": "Philomina Perishial",
                    "user_href": "/profile/Philomina-Perishial"
                }
            ]
        }
    ]
}