{
    "title": "Does the clarinet have the same fingerings as a saxophone? Which is easier to play? - Quora",
    "tags": [
        "Clarinets",
        "Saxophones",
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Harris",
                "href": "/profile/Charles-Harris-56"
            },
            "answer_text": "Yes and No. The clarinet and saxophone share a similar fingering pattern, they differ in that the saxophone overblows the octave while the clarinet overblows a perfect 12th or an octave plus a 5th. Thus when the saxophone and clarinet plays a D on the forth line of the staff they will both use the same fingering. X TXX—XXX Now when the sax player removes the thumb the saxophone will drop exactly one octave playing the D directly below the 1st line of the staff. However when the clarinet player does the same thing the clarinet will be playing the G just under the 2nd ledger line below the staff. To understand the reason for this you first have to have some understanding of the overtone series. Any pitch when sounded produces a series of overtones. The number, frequency and volume of those individual overtones creates the overall sound of that instrument (called the tamber) and its the reason why a saxophone sounds different than a trumpet, a trumpet sounds different than a piano, and a piano different than a banjo, etc, etc… For example take middle C on the piano. When you play this note several overtones are generated and they look like this C, This is considered the primary pitch.C, one octave higherG, a Perfect 5th higherC, a Perfect 4th higherE, a Major 3rd higherG, a Minor 3rd higher(b)Bb, a flat Minor 3rd higherC, a slightly sharp Major 2nd higherD, A major 2nd higherIf you notice the distance between each note gets closer and closer together. I only stopped at the 9th pitch for pragmatic reasons, however the series continues and distance between each partial becomes smaller and smaller until you have less than a half step between each partial. An instrument such as the saxophone, the trumpet and even the guitar and violin will produce each overtone as part of their overall sound, but instruments such as the clarinet are incapable of this due to the cylindrical bore thus the clarinet skips the even numbered overtones. A Clarinet playing middle C would jump to a G when they press the “register” key. The next partial is E which would be the 5th partial of the series. Than they would have to deal with the flat 7th partial which most instruments shy away from as it’s out of tune. As far as which instrument is easier to play, ask someone who started on the clarinet and someone who started on the sax. They will both tell you their instrument is easier for the exact opposite reasons. The sax player will tell you it’s easier because you only have to learn the fingerings for each note once and then you add the octave. The clarinet player will tell you their instrument is easier as there are different fingerings for each register. ",
            "date": "Answered October 5, 2017",
            "views": "64",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giacomo Le Bourgeois",
                    "user_href": "/profile/Giacomo-Le-Bourgeois"
                },
                {
                    "user_id": "Dean Glover",
                    "user_href": "/profile/Dean-Glover-9"
                },
                {
                    "user_id": "Hayley Liddell",
                    "user_href": "/profile/Hayley-Liddell"
                },
                {
                    "user_id": "Alec Katz",
                    "user_href": "/profile/Alec-Katz"
                },
                {
                    "user_id": "Michael Arthur",
                    "user_href": "/profile/Michael-Arthur-42"
                },
                {
                    "user_id": "Sondra Miller",
                    "user_href": "/profile/Sondra-Miller"
                },
                {
                    "user_id": "Dan Noble",
                    "user_href": "/profile/Dan-Noble-13"
                },
                {
                    "user_id": "Tom Alexis",
                    "user_href": "/profile/Tom-Alexis"
                },
                {
                    "user_id": "Sue Olson",
                    "user_href": "/profile/Sue-Olson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Eastwood",
                "href": "/profile/Chris-Eastwood-5"
            },
            "answer_text": "I started out in music with the clarinet at age 8. I learned flute and saxophone during my teenage years. The modern flute key and fingering configurations are based on the Boehm system, invented by Theobald Boehm in the mid-1800s in an effort to make the flute more acoustically accurate and to improve ease of performance for the player. You can read more about it here: Boehm system - Wikipedia This system was eventually adopted, with variations, by clarinet and saxophone designers and makers. The clarinet has similar fingerings to the saxophone due to the shared Boehm design history with the flute, but there are differences, particularly at the high and low end of the instrument’s natural range. Which is easier to play? Having played both for over five decades, my smart-ass answer is “neither, they’re both the same”. There are challenges with both instruments and they are different enough that having similar fingering patterns and a single reed mouthpiece are only small advantages. Intonation and embouchure are perhaps the biggest challenges with either, and they’re different enough that they are equally challenging. ",
            "date": "Answered October 4, 2017",
            "views": "3",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wes Fahlstrom",
                    "user_href": "/profile/Wes-Fahlstrom"
                },
                {
                    "user_id": "Frederic Rachford",
                    "user_href": "/profile/Frederic-Rachford"
                },
                {
                    "user_id": "Juan Fabrizio Lara",
                    "user_href": "/profile/Juan-Fabrizio-Lara"
                },
                {
                    "user_id": "Melinda Coleman",
                    "user_href": "/profile/Melinda-Coleman-3"
                },
                {
                    "user_id": "Dave Gouldstone",
                    "user_href": "/profile/Dave-Gouldstone"
                },
                {
                    "user_id": "Marc Kirschenbaum",
                    "user_href": "/profile/Marc-Kirschenbaum-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Paul Yardley",
                "href": "/profile/John-Paul-Yardley"
            },
            "answer_text": "I am not a clarinet player but although it has some similar fingerings, I believe they are not the same across all octaves - which they mostly are on the saxophone. I would imagine a clarinet is easier to play because the bore is parallel and all the keyholes are the same size. On a saxophone, the low note key holes in each register are much larger than those for the high notes, so mechanically have more mass and require more pressure to close them. I also suspect the clarinet is easier to blow because, again by dint of the parallel bore, every note requires the same amount of wind. ",
            "date": "Answered October 4, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dave Gouldstone",
                    "user_href": "/profile/Dave-Gouldstone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Smith",
                "href": "/profile/Bob-Smith-3115"
            },
            "answer_text": "The fingerings are similar but not the same. A clarinetist can learn the saxophone fingerings in under an hour - and visa-versa. As far as which is easier, training the muscles around the mouth (the “embouchre”) is easier on sax. Creating an excellent tone quality, after mastering the embouchre, is easier on the clarinet. Many saxophonists, including myself, begin on clarinet and add saxophone as their second instrument but that is not a necessity. ",
            "date": "Answered April 2, 2018",
            "views": "702",
            "upvotes": " Answer requested by Dan Noble",
            "upvoters": [
                {
                    "user_id": "John Tomczyk",
                    "user_href": "/profile/John-Tomczyk-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alfredo Romero",
                "href": "/profile/Alfredo-Romero-19"
            },
            "answer_text": "The clarinet has very similar fingerings, although not exactly the same. The differences are not enough that you wouldn’t be able to pick it up quickly, although if you’ve played the sax for a very long time you may find yourself falling into old habits. The embouchure is somewhat similar as well, although you still have to adjust your mouth to the vertical position of the clarinet and a smaller mouthpiece. ",
            "date": "Answered October 5, 2017",
            "views": "952",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sania B",
                    "user_href": "/profile/Sania-B-3"
                },
                {
                    "user_id": "Dave Gouldstone",
                    "user_href": "/profile/Dave-Gouldstone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Lee",
                "href": "/profile/Daniel-Lee-1140"
            },
            "answer_text": "I play both clarinet and saxophone, and for the main part the fingerings are similar. The easier one to play is definitely the saxophone, because in my opinion it has a much less range of notes that you require to play. Clarinet has three octaves that you need to know: the lower octave, the middle octave, and the upper octave. For sax, you mainly need to know the middle octave. Saxophone is definitely easier, but most of their fingerings are the same, with exceptions of some notes ",
            "date": "Answered October 4, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jude Bennett",
                    "user_href": "/profile/Jude-Bennett-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnny Gee",
                "href": "/profile/Johnny-Gee-16"
            },
            "answer_text": "Similar, but not the same. Clarinet is less straight forward than sax. The holes on the clarinet take some skill to place fingers on, without leaks. Sax is much easier at a beginner level. ",
            "date": "Answered March 12, 2020",
            "views": "115",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Darrell Dally",
                "href": "/profile/Darrell-Dally-1"
            },
            "answer_text": "Imho, the clarinet is more difficult fingering -wise (i have played both). As far as which one is more difficult to play overall, I do not think it is a question of saxophone vs clarinet but rather soprano vs lower pitched single reed instruments. If you compare a standard soprano clarinet to a soprano sax, the embouchures of both instruments are much tighter than for the tenor sax and bass clarinet. ",
            "date": "Answered October 5, 2017",
            "views": "860",
            "upvotes": "0"
        }
    ]
}