{
    "title": "Does a 'wake' happen before or after a funeral? - Quora",
    "tags": [
        "Wake (ceremony)",
        "Burial (death ritual)",
        "Funerals",
        "Loss, Grief, Bereavement and Mourning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Armstrong",
                "href": "/profile/Alan-Armstrong-21"
            },
            "answer_text": "I guess every culture’s different. We Māori know that grieving takes time and we’ve kept our traditional four-day way of saying goodbye. The day of death is for close family only, and tradition says they must remain with the deceased continuously until the burial three days later. Occasionally that can cause problems with Police, coroners or pathologists but most of those people now understand and respect Māori custom and the need to have those matters completed by the end of that day. The body is taken that night or early next morning to the deceased’s home marae for the lying-in-state and the casket remains open for 2½ days, with family alongside to grieve with visitors. If there’s to be a large attendance (like 1,000+) the first day is reserved for groups with some special relationship to the deceased who are welcomed individually, and the second is for everyone else. On that last evening there may be special tributes of song and dance. Before dawn the casket is closed and the burial takes place that morning. Afterwards there will be a meal and many of the guests will leave, but later that day close relations will accompany the bereaved back to the deceased’s home for a ritual purification and blessing ceremony. By the time it’s over those most acutely affected will have had four days of loving support and tributes, outpouring of grief and sharing of many stories from others who knew the deceased. The long vigil can be exhausting, but it’s also profoundly healing and by then everyone’s ready for a sound sleep and the start of a new day. It’s a lovely way to say goodbye, and here’s my answer to another question about one I attended several years ago that will explain more about the details.[1] Footnotes[1] Alan Armstrong's answer to Have you ever seen a dead person?",
            "date": "Answered May 14, 2019",
            "views": "287",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaylene Levesque",
                    "user_href": "/profile/Gaylene-Levesque"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erin Phelps",
                "href": "/profile/Erin-Phelps-6"
            },
            "answer_text": "Traditionally the wake was held in the deceased’s home where they were laid out prior to being taken to church for the funeral and burial. People would come help the family with preparations and extend their condolences, food and drink were served at this time and people would sit with the deceased thru the night. The underlying reason for this was to ensure that the person was indeed dead and not just in a very deep sleep. Many people today equate the word “Wake” with the Irish tradition of alcoholic beverages being served and a festive mood to the event. The reading I have done does not necessarily confirm this. ",
            "date": "Answered May 14, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Esther Dion",
                    "user_href": "/profile/Esther-Dion"
                }
            ]
        }
    ]
}