{
    "title": "Does humming improve my singing voice? - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Faris Litster",
                "href": "/profile/Faris-Litster"
            },
            "answer_text": "Yes and no. It can improve things like pitch matching and helping your voice get into shape. However, being able to hear and sing back those awesome runs that the people you hear on the radio do is not the only part of singing. Things like vowel shaping, the support you give with your diaphragm and abs to air flow, where in your body you’re doing the resonating, and your vocal cords (which the one thing you unfortunately cannot change), all go together into your singing voice. The way you shape your vowels not only makes you sound better (especially when singing those long e sounds), but also makes it easier to open up your throat and relax. Your support will help your range and volume, and where you resonate affects your voice greatly. So it will help some aspects, but you’ll need to improve the other aspects of your voice to make a significant difference ",
            "date": "Answered June 28, 2018",
            "views": "65",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Sharma",
                    "user_href": "/profile/Shubham-Sharma-7806"
                },
                {
                    "user_id": "Amruta Venkatesh",
                    "user_href": "/profile/Amruta-Venkatesh-1"
                },
                {
                    "user_id": "Ermengarde McAllister",
                    "user_href": "/profile/Ermengarde-McAllister"
                },
                {
                    "user_id": "Marcus Omowole",
                    "user_href": "/profile/Marcus-Omowole"
                },
                {
                    "user_id": "Aw Jinjie",
                    "user_href": "/profile/Aw-Jinjie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Diaz",
                "href": "/profile/Phil-Diaz-1"
            },
            "answer_text": "Humming is a great way to work on vocal function. You can use the hum or the “m” sound to map where the voice lives across different registers. For example, as a tenor I may feel notes in my chest voice vibrating on my lips versus feeling a lighter vibration toward my eyes as a head into the pre passaggio/passaggio, etc. Biggest thing to make sure is to keep the throat relaxed and open during the process. You don’t to create tension just to achieve the “m” sound. There’s even more to the hum but hope this gives you a good start. Happy Singing! ",
            "date": "Answered January 4, 2018",
            "views": "7",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amruta Venkatesh",
                    "user_href": "/profile/Amruta-Venkatesh-1"
                },
                {
                    "user_id": "D Roy",
                    "user_href": "/profile/D-Roy-43"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                }
            ]
        }
    ]
}