{
    "title": "Does childbirth hurt? - Quora",
    "tags": [
        "Childbirth",
        "Pain (sensation)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle Dressler",
                "href": "/profile/Michelle-Dressler-1"
            },
            "answer_text": "I am one of the rare women who can say unequivocally no. I am not trying to give anyone false expectations, but for me,it didn't even register on the top 20 of my most painful experiences. I was very ill from the beginning of my pregnancy on with hyperemesis, preeclampsia, and hellp syndrome,and finally what doctors believed was fatty liver of pregnancy. I vomited to the point of being covered with petechiae all over my body and my face was bruised. I had blood red whites of the eyes,and black eyes like I had been beat up.I lost a total of 28 lbs by the day I gave birth before the baby was born then lost another 15 lbs immediately afterwards then continued to lose for a total of 53lbs in all.Got pregnant at 208 left the hospital at 155 two weeks after giving birth. I was sick, hemorrhaging violently in the room after I delivered as my blood could not clot.I was so sick and my baby was sick at birth.But Thank God he pulled it around and left the hospital in relatively good shape considering. I was induced at 34 weeks due to all the complications.I was given two internal vaginal pills ,that to me was the only time I felt pain. My doctor wanted them placed in my cervix and he was aggressive about it. My water was broken by him and I was started on a pitocin drip. This was at midnight. I feel asleep exhausted from the commotion of the day and the drowsiness I believe the Magnesium Sulfate they put me on caused. I was allowed no lights,no TV, nothing that could be environmentally upsetting for me, for fear I would have a stroke or seizure at best. My blood pressure hovered around 280 over 160 that day. So with the silence my husband fell asleep too. About 4 hours later they came and checked and said I had made no progress and uped the pitocin. I feel asleep with some cramping. I can honestly say was no worse than bad menstrual cramps. I could feel tightening and then a release nearly back to back. I just said aloud ow,ow,ow for the tightening part. No need for any breathing management. The nurse came in looked at the monitor and asked if I wanted an epidural. I said yes,but only because I had heard if you progress too far you can no longer get one or the anesthesiologist might not be available. I was afraid of the horrible pain I was sure to come and really had no idea where I was in the process of labor. My husband held my arms as the anesthesiologist placed the needle in my back ,which I was terrified of, I kept saying “tell me before you do it.” But my husband and he were looking at each other with weird looks because it was already placed. Then I tanked and my BP bottomed out the anesthesiologist after just starting the drip had to shut it off. Only later did I find this out because they didn’t want me to worry and set off any more problems. They put an internal monitor on the top of my son's head.I felt bad because it was a stretched open s shape,like an upholstery screw. That's how it was attached too.They screwed it to the top of his little head under the skin. That pain I felt in my heart emotionally for my little boy. This was about 4am. I again fell asleep and my husband approached the nurse and said, out of the range of my hearing, why isn't this the screaming fest I was prepared for and she said to him go get more rest for later as I later found out I was only at four centimeters. Next thing it was 9am and they examined me and didn't say much of anything. I figured it would all kick in and I would be one of those poor ladies in labor for 2days. At 11 am I woke up and told my Husband I have to poop get a nurse.He said wait they were all busy. I told him no I am going to poop now. Well a nurse was passing by and said sweetly “hun if you have to poop just do it and we will clean it up.” She had no idea I had been through transition and neither did I.Great I thought. Still it was better I figured,to poop now than pooping all over my baby when it was born. So I pushed gently as I had to my entire pregnancy as I was on bed rest on my left side,my head lower than my hips and taking internal vaginal hormones.I was told not to strain for fear of early labor. So I tried there in the hospital all while on my left side in the tradleberg position my head lower than my hips. Since my head was so significantly lower I felt as if I wasn’t going to be able to poop. Again my husband said wait. So naive me did as I was told fearing I would have to strain as I really thought I have to poop now! When a nurse came by he told her my predicament. She came in and looked under my gown and that's when all heck broke loose. She hit an emergency alarm and yelled “I need help in here baby is half out Sunnyside up!” He was facing face first and was trying to work his way down the birth canal at the widest angle possible without turning posterior. Again that should have been excruciating but I just thought it was a bm giving me pressure,although surprisingly intense pressure as it was. The doctor ran in,one arm in his coat said push and did an episiotomy which I felt.it felt sharp and burned a bit just enough to make me yelp for a second and he said push again and my son was out. Then I exploded like a blood water balloon allover the ceiling,out to the hall,the TV the incubator , I soaked the doctor, the nurses then I started to fade out. From here on it gets goary and I almost died. My Son was whisked away to the NICU with an enlarged liver,a hole in his heart,poor sugar and a host of other things.I was stabilized after quite sometime. I had passed out due to blood loss and the whole rest of the day to this day is still a blur.I remember the nurses placed a photo of him above me on a bar so I could see him. I ached in my heart to see him that was pain,but an entirely different type. I was praying he survived first,then if it was possible both of us. I didn't want to live without him,so I turned it over to God and God's Mercy and Blessings he bestowed the doctors and nurses with. We fortunately were in a great hospital equipped for sick babies and Lifestar helicopter was on standby to one of the World's top hospitals only 20 mins away by flight preperation and all. We both spent 2 weeks in the hospital,me in the ICU my son in the NICU. I am still here however and my son is 6ft tall and training to become a Police Officer. I was told I'd never have anymore children but my daughter turned 13 yesterday and is her school leader in shotput. I am Blessed. My 2nd pregnancy was just as hard and I had a csection at 34 weeks.She spent 11 weeks in the NICU. However both Children have fully recovered with only tiny vestiges of their struggles at birth and a bit beyond.They needed to be specially taught how to eat,swallow and talk. You can hear it in their voices today.All their friends just thought they were foreign by birth and had accents lol. I was left disabled and a shell of my former active self .I ended up having a rare genetic disease called Multiple Mitochondrial Myopathy,however my presentation is the first case they have ever seen. It is a Founder's case,meaning it will be named after me. I have been around the world for studies and treatment. I spent most of their childhood in the hospital or bedbound.I have had seizures,broken bones including a skull fracture and an orbital socket fracture. I have liver and kidney failure. Bone marrow failure, Meningitis and on and on. I have woken up in the middle of being given last rights at least 20x. So no, my birthing of my children didn't hurt at all in the traditional way. But I would give up all the complications for it to have hurt in the traditional way. Although I would also go through this 100x to get my beautiful kids again! All the pain of any kind would be worth it to me. A weird thing that has happened and I can't get over though is actual guilt from not hurting. To this day. my husband is not an emotional type nor very understanding.He makes me feel less of a true woman because unlike “other men” he knows he can't say” Oh Honey, you were such a brave woman in all that pain, nah you had it easy,you just slept through it.” I feel cheated sometimes because of that. I wrote about that here in Quora too.I feel less womanly like I got off too easy. I know the rest was pure torture that I wouldn't wish on anyone. But not to have the hugs afterwards,or visitors or cards balloons etc,not to have a celebratory feeling after, just fear and guilt has taken its toll.So I guess pain can be gauged on many different levels I am still hurting emotionally for cheating my husband a grand experience and my kids out of a peaceful entrance into this world and the presence of Mommy at home whenever they needed me during their childhoods. But they love me dearly and I do too I would be willing to put my life on the line at anytime for them I did it twice and as long as I am alive they have my promise of that and my Eternal Love as their Mama even after that. ",
            "date": "Updated September 25, 2020",
            "views": "54",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clarence Elledge",
                    "user_href": "/profile/Clarence-Elledge"
                },
                {
                    "user_id": "Steve Horvath",
                    "user_href": "/profile/Steve-Horvath-16"
                },
                {
                    "user_id": "Manas Sarma",
                    "user_href": "/profile/Manas-Sarma-1"
                },
                {
                    "user_id": "Sakeenah Mohiuddin",
                    "user_href": "/profile/Sakeenah-Mohiuddin"
                },
                {
                    "user_id": "Joe Peters",
                    "user_href": "/profile/Joe-Peters-34"
                },
                {
                    "user_id": "Mulki Abdikarim",
                    "user_href": "/profile/Mulki-Abdikarim-1"
                },
                {
                    "user_id": "Katherine Anderson",
                    "user_href": "/profile/Katherine-Anderson-158"
                },
                {
                    "user_id": "Chloe Shaver",
                    "user_href": "/profile/Chloe-Shaver"
                },
                {
                    "user_id": "Ana Romero",
                    "user_href": "/profile/Ana-Romero-149"
                },
                {
                    "user_id": "Judy Watson",
                    "user_href": "/profile/Judy-Watson-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Billy",
                "href": "/profile/Rebecca-Billy"
            },
            "answer_text": "I've had kidney stones, gallstones, migraines, and countless injuries. Other than one horrendously bad allergic reaction to a steroid shot, from which the pain is indescribable, I would put childbirth high on the list. It was similar in intensity to kidney stones, although the nature of the pain is different. The first few hours of contractions were not terribly painful. I walked a lot and just paused every few minutes when a contraction hit. When the contractions had been three minutes apart for an hour, I went to the hospital. After my water broke, the pain increased sharply and it was a matter of some time before I was able to stop yelling out with pain. As the contractions got closer together, they became even more painful. The transition, while relatively short, was the most painful part; my entire focus was on managing the pain. The more I was able to move around, the more manageable it was. I was unfortunately very weak from months of extreme illness and muscle wastage, so my legs were not strong. Still, the pain was intense and I moved around as much as I was able. By the time I needed to push, my legs were so weak that the midwife and nurses were unable to get me into a full squatting position, so I gave birth in what is probably the most awkward ever half-kneeling, half-squatting position. The perineal tearing was by far the most painful thing. The baby's head was large and my tearing was unusually bad. The first attempt at stitching had to be removed and a more experienced doctor was called in. They were already prepping the surgery for emergency labiaplasty, but the doctor was a whiz and managed to sew me back up like a champion seamstress. Although I had given birth naturally, I had demerol for the second set of stitches. Perhaps because of this, the doctor seemed to think I was unaware when she told my then-husband that in all her years of obstetrics, it was the worst she had ever seen. At any rate, while things are a bit different down there, everything healed with minimal scarring and everything works just like it ought. My experience was unusual in a couple respects, and of course my decision to have natural childbirth was not insignificant. While the pain was likely much more intense than it would have been with an epidural, the process was shorter--which was significant considering my weakness and lack of stamina going in. If I had not remained upright and in control of my body, I would most likely have had an emergency C-section; it was something the midwife spoke to me about when my labor slowed after arriving at the hospital. My labor overall was only about 10 hours, including several hours before I arrived at the hospital, which is a fairly short labor for a first pregnancy. The first couple of hours at the hospital, when the contractions were one to two minutes apart, seemed long. But after that, I was focused on breathing through the contractions and resting, and the time seemed to pass quickly. Childbirth is different for everyone. The healthier and more active you are during your pregnancy, the shorter and less painful the delivery usually is. The most painful part of the process is mercifully short compared to the early stage of labor which is painful but often no worse than typical menstrual cramps. Some women get an oxytocin rush after delivery. I sure as heck didn't experience anything like that, but I've never had what you could call good luck. I have no idea what labor and childbirth would have been like if I'd done it a second time. It might have been much easier. It probably would have. But my choice not to have another child wasn't based on the pain of childbirth; it was because the pregnancy up until then was terrible. It had a strong effect on my long-term health and I was already nearing 30 when my son was born. I wasn't willing to risk doing it a second time. The pain of childbirth--while not something I'd want to relive, is something I could manage. ",
            "date": "Updated December 10, 2018",
            "views": "5355",
            "upvotes": " View 901 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Janice M Vian",
                    "user_href": "/profile/Janice-M-Vian"
                },
                {
                    "user_id": "Clarence Elledge",
                    "user_href": "/profile/Clarence-Elledge"
                },
                {
                    "user_id": "Jeremy Diaz",
                    "user_href": "/profile/Jeremy-Diaz-6"
                },
                {
                    "user_id": "Ann MacLeod",
                    "user_href": "/profile/Ann-MacLeod-2"
                },
                {
                    "user_id": "Antoine Lamy",
                    "user_href": "/profile/Antoine-Lamy-3"
                },
                {
                    "user_id": "Pooja Khatkar",
                    "user_href": "/profile/Pooja-Khatkar-1"
                },
                {
                    "user_id": "Tracey Miller",
                    "user_href": "/profile/Tracey-Miller-14"
                },
                {
                    "user_id": "Tee Com",
                    "user_href": "/profile/Tee-Com"
                },
                {
                    "user_id": "Sue Quinton-Hill",
                    "user_href": "/profile/Sue-Quinton-Hill"
                },
                {
                    "user_id": "Elizabeth Mikeska",
                    "user_href": "/profile/Elizabeth-Mikeska"
                }
            ]
        }
    ]
}