{
    "title": "Does religion affect mental health? - Quora",
    "tags": [
        "Mental Illness",
        "Mental Health",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alana Winner",
                "href": "/profile/Alana-Winner-1"
            },
            "answer_text": "I think that the correlation may have to do with the support system that belonging in a church can provide. Also some religions offers hope and can help with struggles in mental illness. Religion may be an important part in a believer's treatment plan, but it is not a magical cure for mental illness. It is part of a treatment plan made with a client which may include therapy and medications. I would like to let people know that expecting a person to be to “pull themselves up” to “fixed” purely by church or religion when the person is mentally ill does not believe so can make that person feel badly. They must agree on the treatment plan too. ",
            "date": "Answered February 12, 2017",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Merimar Ni Fiach",
                    "user_href": "/profile/Merimar-Ni-Fiach"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Religion effects it positively.  This is the core of the utilitarian argument for faith and Christianity. And a review of 498 studies published in peer-reviewed journals concluded that a large majority of them showed a positive correlation between religious commitment and higher levels of perceived well-being and self-esteem and lower levels of hypertension, depression, and clinical delinquency.  A meta-analysis of 34 recent studies published between 1990 and 2001 found that religiosity has a salutary relationship with psychological adjustment, being related to less psychological distress, more life satisfaction, and better self-actualization.  Finally, a recent systematic review of 850 research papers on the topic concluded that \"the majority of well-conducted studies found that higher levels of religious involvement are positively associated with indicators of psychological well-being (life satisfaction, happiness, positive affect, and higher morale) and with less depression, suicidal thoughts and behaviour, drug/alcohol use/abuse.\" Source: Happiness  ",
            "date": "Answered December 24, 2015",
            "views": "515",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ehsan Imani",
                    "user_href": "/profile/Ehsan-Imani"
                },
                {
                    "user_id": "Bruce Neben",
                    "user_href": "/profile/Bruce-Neben"
                },
                {
                    "user_id": "Rajiv Angrish",
                    "user_href": "/profile/Rajiv-Angrish"
                },
                {
                    "user_id": "Tindi Crosbie",
                    "user_href": "/profile/Tindi-Crosbie"
                },
                {
                    "user_id": "Monty Henderson",
                    "user_href": "/profile/Monty-Henderson"
                },
                {
                    "user_id": "Chris Yau",
                    "user_href": "/profile/Chris-Yau-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoffrey Widdison",
                "href": "/profile/Geoffrey-Widdison"
            },
            "answer_text": "Hard to say, honestly. The correlation between religion and mental health varies significantly by religion, as well as by region and culture. There are enough factors that go into mental health statistics that it’s frequently hard to pick out what effect religion has. For example, traditionally, being highly religious has meant being part of an organized, robust and involved community, leading to more social activity, public engagement, and both practical and personal support, which are all things that correlate highly with good mental health. On the other hand, if someone is so religiously extreme that they cut off contact with most people around them (for fear of being corrupted) and become isolated, that’s bad for mental health. Note that all of this is true long before you take any consideration of the personal and spiritual implications of belief, or your adherence to the principles of any religion, let alone any question of whether or not the religion is true. Reality is, humans are complex, mental health is complex, and figuring out what factors impact it is actually a really tough statistical puzzle, most of the time. ",
            "date": "Answered March 6, 2019",
            "views": "286",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Harris",
                    "user_href": "/profile/Richard-Harris-70"
                },
                {
                    "user_id": "David Sokoloff",
                    "user_href": "/profile/David-Sokoloff-1"
                },
                {
                    "user_id": "Axel Hanson",
                    "user_href": "/profile/Axel-Hanson-2"
                },
                {
                    "user_id": "Gage H. Leibman",
                    "user_href": "/profile/Gage-H-Leibman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajiv Angrish",
                "href": "/profile/Rajiv-Angrish"
            },
            "answer_text": "Yes it does. People moderately addicted/devoted to religious dogmas are better off than the non-believers, by and large.This is because they take refuge in the religious halo for much of their anxieties and fears.On the negative side excessive/wrong religious indoctrination can cause deleterious mental health. For example a person inclined to a religious order may ignores his day to day duties. Another example unacceptable religious constitution can be seen in the human suicide bombers/death squads of 'terrorists' so common in the world scenario these days.\"Religion is the opium of the masses\".",
            "date": "Updated May 2, 2019",
            "views": "366",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Davey",
                    "user_href": "/profile/Mark-Davey-35"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raxana"
                },
                {
                    "user_id": "Walter Crawford",
                    "user_href": "/profile/Walter-Crawford-1"
                },
                {
                    "user_id": "Vrinda",
                    "user_href": "/profile/Vrinda-26"
                },
                {
                    "user_id": "Tindi Crosbie",
                    "user_href": "/profile/Tindi-Crosbie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Legg",
                "href": "/profile/Jeremy-Legg-3"
            },
            "answer_text": "Is religion detrimental to mental health? Seems unlikely. Born-again, committed Christians, who worship regularly, enjoy better mental health than average, including less depression, stress and suicidal thoughts. They also enjoy happier and longer-lasting marriages and even better sex than average! This is not surprising. The Christian gospel includes: - forgiveness of sin - letting go of resentments and unhealthy ambitions - a sense of purpose - valuing things that are more important than money and status - developing beneficial traits such as kindness and compassion - building community (both in church and outward social efforts) All of these things benefit mental health. The flip side is that atheism can increase depression, as one believes that there is no purpose to life and that everything is meaningless, whilst cultivating tendencies that lead to increased alienation and isolation (support for divorce, reduced community spirit, lower barriers to infidelity, etc.). ",
            "date": "Answered October 23, 2018",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Logan Secrist",
                "href": "/profile/Logan-Secrist-1"
            },
            "answer_text": "Some people need structure and support to get through life. Religion works for some, and that includes some people who are imbalanced in one way or another. To simplify some of life's questions with the presence of a deity or parental archetype that knows and sees all, may help a person who lives in a chaotic place mentally find something to grip onto. Almost like AA can help some addicts find a group to relate to and find peers that have shared experiences, to assist them as they attempt to fight urges. Do I think that religion actually does help cure mental disorders? No. I think indoctrination into religion creates its own mental disorders and those who are imbalanced who join aren't being cured, they are joining more unbalanced people and feel at home. ",
            "date": "Answered February 12, 2017",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samira Daukoru",
                "href": "/profile/Samira-Daukoru"
            },
            "answer_text": "I can only speak from the standpoint of Christians since those are the people I grew up with, but when confronted with a problem that comes into conflict with the way they think God runs the universe and the specific types of hardships / judgments he inflicts upon people, the quickest way for them to resolve the resulting cognitive dissonance is to try and smother that problem with religion. It’s kind of like a “God can cure a broken leg, so if I pray on your leg and it’s still broken then that means something’s wrong with you spiritually and I now have indirect permission to ostracize you,” except replace ‘broken leg’ with ‘brain.’ ",
            "date": "Answered February 12, 2017",
            "views": "104",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naomi Himmelhoch Tiscione",
                    "user_href": "/profile/Naomi-Himmelhoch-Tiscione"
                },
                {
                    "user_id": "Peter Gee",
                    "user_href": "/profile/Peter-Gee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "Not always and not definitely, but it can, it can effect you in a positive way and negative depending on your mindset, predisposed mental or psychological issues and more so the teachings of what ever faith you choose. As far as I know, there has been more death and torture in the name of religion than any other single excuse. Not all of these I am sure we're done by those who truly believed their actions were just, many I am sure we're pressured or given no choice, but it happened none the less. Religion it self is not the problem, humans are not machines though, they all think, feel, and act differently for different reasons, so following any path no matter how well intended will differ from one person to the other. ",
            "date": "Answered July 8, 2016",
            "views": "95",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Davey",
                    "user_href": "/profile/Mark-Davey-35"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raxana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Zolan",
                "href": "/profile/Kim-Zolan"
            },
            "answer_text": "Christianity gives me alot of hope that I will be fully well one day nad I have had delivernace for schizophrenia a few times which really helped me.See on YouTube the deliverance minister Frank Hammond or read his fascinating book “Pigs in the http://Parlour”.So Christianity plays a big part in my life as God saved my life from suicide when I was very ill with schizophrenia in 1985 when I was 23. ",
            "date": "Answered July 7, 2020",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jhansen Chonn",
                "href": "/profile/Jhansen-Chonn"
            },
            "answer_text": "Just the same as they think there is a God. Delusions! Just how some religious people think that God only gives you what you can handle. Fuck that shit! Fuck that God! Just as religious folk think that God punishes those who left it out in the trash, so now they're being punished for it. Seriously? Go fuck yourself! Just as religious folks think they can convert a gay, lesbian, transgender to become straight. Shit, didn't know prayer could rearrange genetic sequences! I hear it takes a lot pain and suffering to believe 1+1=10. TL;DR: ignorance. ",
            "date": "Answered February 12, 2017",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Romeo Gurrero",
                    "user_href": "/profile/Romeo-Gurrero"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monty Henderson",
                "href": "/profile/Monty-Henderson"
            },
            "answer_text": "Yes. People who are brought up in a faith tradition are less likely to suffer from mental illness especially personally disorders. Not to say that people who are faithful are necessary better but they strive to live to a standard that they know is beyond their ability to achieve. ",
            "date": "Answered December 25, 2015",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajiv Angrish",
                    "user_href": "/profile/Rajiv-Angrish"
                },
                {
                    "user_id": "Tom Ramsay",
                    "user_href": "/profile/Tom-Ramsay-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brenton Crowhurst",
                "href": "/profile/Brenton-Crowhurst"
            },
            "answer_text": "In my dissertation research, I found a -.44 correlation between religiosity and depression. I’m certainly not the first to find this. How many treatments have such strong effects? In answer to your question, some people probably think it because they believe it is true based on faith. Other people believe it because of the obvious and persuasive evidence of their own experience. ",
            "date": "Answered February 12, 2017",
            "views": "125",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Manzo",
                    "user_href": "/profile/John-Manzo-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Broun",
                "href": "/profile/Tom-Broun"
            },
            "answer_text": "There are far more mental illnesses caused by religion than cured by it. Religious leaders establish particulars that serve, support and enforce their authority and those who accept the fundamentals are thereby unwittingly trapped and coerced into submission or may suffer traumatic guilt if refusing to obey. ",
            "date": "Answered February 12, 2017",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luis Olavo Dantas",
                "href": "/profile/Luis-Olavo-Dantas"
            },
            "answer_text": "“Religion” is hardly a well-consolidated word far as meaning goes. A case can and should be made that it must be helpful for mental health in order to qualify. That said, there are widespread movements that are commonly considered religions that are indeed detrimental to mental health, far as I can see. ",
            "date": "Answered October 23, 2018",
            "views": "14",
            "upvotes": " Answer requested by Sean Fuller",
            "upvoters": [
                {
                    "user_id": "Cathy O'Brien",
                    "user_href": "/profile/Cathy-OBrien-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Thomas",
                "href": "/profile/Alexander-Thomas-136"
            },
            "answer_text": "One of the criteria for psychosis is the presence of delusions. A delusion is the fixed belief in something for which there is no empirical evidence. ",
            "date": "Answered June 18, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Sokoloff",
                    "user_href": "/profile/David-Sokoloff-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karni Laputa",
                "href": "/profile/Karni-Laputa"
            },
            "answer_text": "Yes. I had just read some articles that many of atheist or non religion based country are tend to get more suicidal person. Once in awhile, people need to talk spiritually in means to lamented about their life, because talk to another people, sometimes couldn’t enlightened us. ",
            "date": "Answered March 6, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "John Gerard",
                "href": "/profile/John-Gerard-7"
            },
            "answer_text": "It's a role reversal that makes people feel more comfortable. It is easier to accept that rather than the truth . Religion gives the illnesses out. Then hard working professionals fix it with skill and diligence. ",
            "date": "Answered February 12, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pamela Nunya",
                "href": "/profile/Pamela-Nunya"
            },
            "answer_text": "Yes, if they don't understand this question or it's meaning especially…. ",
            "date": "Answered June 19, 2019",
            "views": "57",
            "upvotes": "0"
        }
    ]
}