{
    "title": "Does using an RCA Y-splitter degrade the audio signal? - Quora",
    "tags": [
        "Audio Signal Processing",
        "RCA Records",
        "Audio and Acoustical Engineering",
        "Digital Audio",
        "Digital Signal Processing",
        "Signal (communications)",
        "Signal Processing",
        "Audio",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence de Martin",
                "href": "/profile/Lawrence-de-Martin-1"
            },
            "answer_text": "In audio, everything matters - so the question is how much? In most cases an active line level RCA out will drive two inputs. If one is a high quality input and the other is low quality, you may notice difference in the good side of the chain. But do NOT split a phono cartridge! The impedance match is critical. I have proven that low quality RCA cables have measurable and audible distortion from non-linear dielectric absorbtion, and connecting a distorting cable one one side of the splitter will affect the other side too. It is also possible that the splitter cable itself can distort from the same affect of cheap wire and connectors, but the amount of distortion is proportional to the cable length so a typical short RCA splitter won’t be noticeable. The effect that bugs me - but maybe not you - is two live speakers with the same split signal. I hate this so much that I built a PA with no mixing, no panning and no monitors and I record the same way, just two mics for the left and right channel. This type of audio system was invented by Owsley Stanley with the help of Alembic engineers John Curl, Ron Wickersham and luthier Rick Turner. Look up “Grateful Dead Wall of Sound”. A typical use of RCA splitters is for subwoofers. I don’t recommend this, you should have an active high pass filter feeding the treble speakers. ",
            "date": "Answered July 13, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stefan Eriksson",
                    "user_href": "/profile/Stefan-Eriksson-2"
                },
                {
                    "user_id": "Keammy Fernandez",
                    "user_href": "/profile/Keammy-Fernandez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "Technically, probably not noticeably, depending on exactly what you mean by degrade and what the load is. Preamp level signals have low output impedance, typically less than 100 ohms and inputs are 10k and above so splitting a signal makes less than a percent amplitude difference. RCA plugs are often used for speakers in cheap stereo units. If you tee speakers it will drop the load resistance to half and depending on the amp it will probably still work ok. ",
            "date": "Answered July 12, 2019",
            "views": "909",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Holmes",
                    "user_href": "/profile/Matt-Holmes-50"
                },
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "Steve Noskowicz",
                    "user_href": "/profile/Steve-Noskowicz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hal Cooper",
                "href": "/profile/Hal-Cooper-2"
            },
            "answer_text": "It degrades a little bit; but, it’s not worth being concerned about. Find a way not to do it if you can; but, you can run like that for a long time and not notice much difference. Mixers are very cheap now. ",
            "date": "Answered April 25, 2020",
            "views": "367",
            "upvotes": "0"
        }
    ]
}