{
    "title": "Does the rapper, songwriter, television producer, actor, and entrepreneur 50 Cent endorse President Trump in 2020? - Quora",
    "tags": [
        "50 Cent (musician, business person)",
        "Hip Hop and Rap Artists",
        "2020 U.S. Presidential Campaign and Election",
        "Hip Hop Music",
        "2020 (year)",
        "US Presidential Elections",
        "Celebrities",
        "Actors and Actresses",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madison H Reyes",
                "href": "/profile/Madison-H-Reyes"
            },
            "answer_text": "I am gonna say it again: Nobody wants to pay 62% tax, nobody. Those that say they wanna pay it; a. Don’t have it and b. Are lying through their fake gold teeth. The media has people sucked in so bad that Joe Biden (who is the biggest racist going btw) is going to help everyone by taxing the shit out of everyone. And don’t even try that BS about it being only for those over 400k. Maybe the 62% is, but removing the cuts you already got and the larger EIC is gonna crush the middle and lower middle class. Yea, love your media enough to give up your money? And, a lot of these elite can and will get paid off shore and keep money off shore. So, can you? Can you, from your apt in BK set up a Corp in another country and get paid through another dummy Corp to that one? Nope, why because you get a paycheck here in the US, you don’t have that luxury. They do, so it’s easy for them to tell YOU to vote away your paper. And, to really make sure you do, they are gonna lay it on racism, because nobody is smart enough to look past that angle. So, for every dollar you are gonna have under 38 cents! Literally, WTF ",
            "date": "Answered October 21, 2020",
            "views": "65",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daniel Vermeychuk",
                    "user_href": "/profile/Daniel-Vermeychuk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Bluestein",
                "href": "/profile/Chuck-Bluestein"
            },
            "answer_text": "Here is an article that you can read by the New York Post that you can read that the above is true. The article is called 50 Cent backs Trump: ‘I don’t want to be 20cent’ under Biden! The article says on it this: Rapper 50 Cent on Tuesday confirmed that he’s backing President Trump for re-election, saying he could become “20 Cent” under Democrat Joe Biden’s plan for higher taxes. ",
            "date": "Answered October 21, 2020",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alison Lee",
                "href": "/profile/Alison-Lee-71"
            },
            "answer_text": "Yes, that has been reported - so he and kid rock are the only musicians that are available to trump - other musicians are irate that trump used their lyrics without their permission - but then again he had sticky hands in France - guess he can lie and steal ",
            "date": "Answered October 23, 2020",
            "views": "14",
            "upvotes": " Answer requested by Chuck Bluestein",
            "upvoters": [
                {
                    "user_id": "Robert Redline",
                    "user_href": "/profile/Robert-Redline"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen Graham",
                "href": "/profile/Glen-Graham-8"
            },
            "answer_text": "Personally, based on the character of the man they call 50 cent, he should support trump. He and Kanye are 2 messed up people!!!! ",
            "date": "Answered October 23, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Edwin Cox",
                "href": "/profile/Edwin-Cox-7"
            },
            "answer_text": "It seems so. Why are you doubting that? They even share the same kind of rotten personality filled with greed and pride. ",
            "date": "Answered October 25, 2020",
            "views": "7",
            "upvotes": " Answer requested by Chuck Bluestein"
        }
    ]
}