{
    "title": "Does changing the pitch of a song avoid copyright? - Quora",
    "tags": [
        "Copyright Infringement",
        "Copyright Law",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "No. If you could avoid copyright that simply, then you could do this: Change the pitch of the song down. You now have a new version of the song that is not under copyright.Change the pitch of your new song back up by the same amount you moved it down. Since the version you’re generating it from is not under copyright, your new version is not a copyright violation.Just like slowing down a song, speeding it up, or playing it backward does not avoid copyright, neither does this. Now, it may avoid automated detection of copyright infringement. That, however, is not the same thing as copyright: copyright is a set of laws, not a protection mechanism. While this may make it less likely that your infringement is noticed, it also will indicate that you know copyright exists and are trying to evade detection, which makes it more likely that a court would find that you knowingly and deliberately infringed, increasing the potential penalties, and possibly adding the offense of criminal copyright infringement, making it possible that you could be sent to prison. ",
            "date": "Updated October 28, 2020",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ananthu Suresh",
                    "user_href": "/profile/Ananthu-Suresh-23"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/Abhinav-Kumar-3046"
                },
                {
                    "user_id": "Ria Mazumder",
                    "user_href": "/profile/Ria-Mazumder-5"
                },
                {
                    "user_id": "Staffan Vilcans",
                    "user_href": "/profile/Staffan-Vilcans"
                },
                {
                    "user_id": "David Mullich",
                    "user_href": "/profile/David-Mullich"
                },
                {
                    "user_id": "Jarrod Scharvi",
                    "user_href": "/profile/Jarrod-Scharvi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Basko",
                "href": "/profile/Sue-Basko"
            },
            "answer_text": "No, but it might be a derivative work, which requires you to get permission from the copyright owner. However, if by “change the pitch,” you mean to sing it in a different key that suits your voice better, that is simply making a cover song version. To make a cover song version, you send a Notice of Intent to all the songwriters or their publishers, and prepay the mechanical royalties. You can also have a song licensing company do this for you, such as easysonglicening. ",
            "date": "Answered June 24, 2020",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/Abhinav-Kumar-3046"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}