{
    "title": "Does time really stop when we die? - Quora",
    "tags": [
        "Death and Dying",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranjal Srivastava",
                "href": "/profile/Pranjal-Srivastava-23"
            },
            "answer_text": "The wheel of time does not stop for anyone. It keeps on moving forward no matter what happens but yes many other things change when you die. Death is only truth of life, everything else is just temporary. Your life is basically controlled by time. You can't go back in time or go ahead of others. You can't even stop a moment and cherish it for some more time. Everything passes away time so you are basically bounded by time. You don't even have control on your own physical or mental growth. You mature as the time passes by. So consider death as a pathway which will lead you to your freedom. It makes you strings less and nothing will stop you after that not even time. You will be far away from the controlling hands of cruel time. You’ll be limitless and you will be the master of your own. You won't have this physical form to make you weak, you will feel powerful and invincible. Nature gives each of us an opportunity of death after living our life to be a part of something indestructible (suicide is not the way though because that's you going against the wish of nature). So don't be afraid of death , it’ll help in beating your strongest competitor of this life,time. ",
            "date": "Answered May 11, 2017",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranjal Srivastava",
                    "user_href": "/profile/Pranjal-Srivastava-148"
                },
                {
                    "user_id": "Joshua Petrikat",
                    "user_href": "/profile/Joshua-Petrikat-1"
                },
                {
                    "user_id": "Cain Walters",
                    "user_href": "/profile/Cain-Walters"
                },
                {
                    "user_id": "Sheetal Srivastava",
                    "user_href": "/profile/Sheetal-Srivastava-1"
                },
                {
                    "user_id": "Abhi Ceivea",
                    "user_href": "/profile/Abhi-Ceivea"
                },
                {
                    "user_id": "Urjit Kurulkar",
                    "user_href": "/profile/Urjit-Kurulkar"
                },
                {
                    "user_id": "Kartikeya Vats",
                    "user_href": "/profile/Kartikeya-Vats"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunitha Parapatla",
                "href": "/profile/Sunitha-Parapatla"
            },
            "answer_text": "No. Time is the only thing , which doesn't stop for anyone. When we die , nothing happens to the world ( time) or people, it just moves on !! World changes every second because, it is made of the 5 elements namely Earth, Water, Sky, Air and Fire. This Universe is called Prapanchamu in telugu , which means pra (very huge or majestic) + panchamu ( made of 5 elements ), so it changes every minute and never stops !! ",
            "date": "Answered May 10, 2017",
            "views": "632",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-4354"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/Akshay-Kumar-1210"
                },
                {
                    "user_id": "Dev Sharma",
                    "user_href": "/profile/Dev-Sharma-220"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-3860"
                }
            ]
        }
    ]
}