{
    "title": "Does everyone have the ability to sing well if they go to singing practice, or are my poor singing skills permanent? - Quora",
    "tags": [
        "Singing Tips",
        "Abilities",
        "Singing Voice",
        "Singers",
        "Voice",
        "Singing",
        "Skills",
        "Musicians",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ella Ray",
                "href": "/profile/Ella-Ray-1-1"
            },
            "answer_text": "Through all my research so far I believe that there is no such thing as talent. It is an old word used for centuries to describe something that people couldn´t explain. To this day they can´t explain what talent is. So let´s focus on things that we actually know and CAN explain. What I know is: Every human being is born with a voice. In 99% this voice is healthy. So humans are naturally BORN to sing and talk. Depending on your upbringing your parents managed to trigger/activate your singing abilities or they didn´t. If they didn´t activate them fully then you just have to do that kind of work with an amazing vocal coach/voice teacher/voice mentor. Your poor singing skills will ONLY be permanent if you don´t do anything to get better and GROW YOUR SKILLS. If singing is something that you are passionate about YOU WILL not only sing well, you WILL be AMAZING! 🎉🎉🎉 *eR ;) E L L A R A Y Soundstonez ",
            "date": "Answered July 3, 2020",
            "views": "749",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandra Goodman",
                    "user_href": "/profile/Sandra-Goodman"
                },
                {
                    "user_id": "Jim Gray",
                    "user_href": "/profile/Jim-Gray-43"
                },
                {
                    "user_id": "Amisha Srivastava",
                    "user_href": "/profile/Amisha-Srivastava-19"
                },
                {
                    "user_id": "Areeb Ahmed (اریب احمد)",
                    "user_href": "/profile/Areeb-Ahmed-اریب-احمد"
                },
                {
                    "user_id": "Sandra Jones",
                    "user_href": "/profile/Sandra-Jones-135"
                },
                {
                    "user_id": "EmHoh",
                    "user_href": "/profile/EmHoh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gemma Wilder",
                "href": "/profile/Gemma-Wilder"
            },
            "answer_text": "Yes they do but if you want to improve your singing, then some changes need to be made in your life. Most people think singing is just about the vocal chords and that’s it but I can say from experience in seeing my boyfriend, it’s about other things too. Looking after your voice. That means, hiring a professional singing coach. No more late nights, no more downing tea, smoking. Drink water so you hydrate your body and stay away from juice.Diet. You need to eat good diet. Your vocals are also connected to your body, nervous system, other muscles too. You need to eat good and have a balanced diet.You also need to have good sleep and take care of the way you live.Mental state of mind. In other words, belief, your self esteem, how you self talk to yourself. Also stay away from toxic people. I cannot stress this enough. Avoid toxic people like the plague.If you want to reach your potental then do away with picking bad habits that can harm your vocal hords by hiring a singing coach to learn the fundamentals, the basics, from how your vocal chords work, how to breathe, learning techniques to warm up before you start singing. Knowing also, when to rest your voice or you harm your potential. Start by getting help, coaching from a professional singing coach. ",
            "date": "Answered July 5, 2020",
            "views": "994",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rena Schlender",
                    "user_href": "/profile/Rena-Schlender"
                }
            ]
        }
    ]
}