{
    "title": "Does Mamamoo have a most popular member? - Quora",
    "tags": [
        "Mamamoo (K-pop Group)",
        "K-Pop",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amber T",
                "href": "/profile/Amber-T-63"
            },
            "answer_text": "As an international Moo Moo I cannot say what people think in South Korea but using sources and charting I have made some estimates. MAMAMOO is just one of those groups who’s member’s popularity changes often. I believe the most popular in Korea is probably Wheein or Hwasa right now. Wheein’s solo song “Goodbye” charted very high on Melon and in Korea. Wheein fits the Korean beauty standard well and I haven’t seen anyone, not even netizens say anything bad about her. If you read the Korean comments you see that they praise her beauty and her voice. Solar used to be the most popular because she was on WGM (a popular korean show) and fit the korean beauty standard. She’s not as high as Wheein since netizens tend to hate on her because she’s the oldest member. Another really popular member is Hwasa as many have mentioned. She might also be most popular now in Korea since she eats a lot and goes viral, has lots of deals etc. She’s confident, has a great and healthy body and her recent solo “Twit” was very popular! Someone else said that she’s the only one who gets to be controversial- it is true but they all are to some extent. Since Hwasa doesn’t fit the typical Korean beauty standard she fights back and that gains her more fans. Moonbyul is probably the least popular in Korea, (though as a Moonbyul stan I have no clue why) I think it is because the other members have now become more popular. Ever since Wheein got rid of her bangs she’s been more recognized for her looks. Moonbyul used to be more popular but now she’s more popular internationally. Overall, Mamamoo is a great group who have so much talent- they released their new song “Hip” that has a hard choreo and addresses their haters, they can sing very well (They recently won Queendom, a show against other girl groups) and can rap! I wish people would become true fans and love them for more than their looks. Internationally its Hwasa/Moonbyul, in Korea its Hwasa/Solar. They are all beautiful, inside and out! ",
            "date": "Updated October 11, 2020",
            "views": "122",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ysandra Declaro",
                    "user_href": "/profile/Ysandra-Declaro-1"
                },
                {
                    "user_id": "Rosa Didonato",
                    "user_href": "/profile/Rosa-Didonato"
                },
                {
                    "user_id": "Trishna Brahma",
                    "user_href": "/profile/Trishna-Brahma"
                },
                {
                    "user_id": "Srtsmyn",
                    "user_href": "/profile/Srtsmyn"
                },
                {
                    "user_id": "Damienne Mañago",
                    "user_href": "/profile/Damienne-Mañago"
                },
                {
                    "user_id": "Fardy Alam",
                    "user_href": "/profile/Fardy-Alam"
                },
                {
                    "user_id": "Amazing Animals",
                    "user_href": "/profile/Amazing-Animals-7"
                },
                {
                    "user_id": "Skylar Glen",
                    "user_href": "/profile/Skylar-Glen"
                },
                {
                    "user_id": "Linh Ngô",
                    "user_href": "/profile/Linh-Ngô-19"
                },
                {
                    "user_id": "Emma Rose",
                    "user_href": "/profile/Emma-Rose-394"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chai Ling",
                "href": "/profile/Chai-Ling-13"
            },
            "answer_text": "Who’s the most popular member of Mamamoo? Solar is known for her amazing pole dancing skills,  awesome vocals,  and her heavenly visuals.  Moonbyul is known for her rapping skills,  and she is the most biased member in Mamamoo. Wheein is known for her vocals,  and her illegal dimples  Hwasa is most known internationally, and for being the president of the kpop industry  Given all those info, my pick today is… The whole of Mamamoo.  Mamamoo is best known for their stable vocals, and no member is left out of that. Mamamoo forever! Thanks for reading and stream Hip pls! ",
            "date": "Updated December 5, 2019",
            "views": "47",
            "upvotes": " View 44 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carla Bernal",
                    "user_href": "/profile/Carla-Bernal-6"
                },
                {
                    "user_id": "Sonny Lim",
                    "user_href": "/profile/Sonny-Lim-13"
                },
                {
                    "user_id": "Anushree Suresh",
                    "user_href": "/profile/Anushree-Suresh-6"
                },
                {
                    "user_id": "Aneela Allahrakha",
                    "user_href": "/profile/Aneela-Allahrakha"
                },
                {
                    "user_id": "Salma Ponce",
                    "user_href": "/profile/Salma-Ponce-1"
                },
                {
                    "user_id": "Kalle Kaviar",
                    "user_href": "/profile/Kalle-Kaviar-2"
                },
                {
                    "user_id": "Keran Lu",
                    "user_href": "/profile/Keran-Lu"
                },
                {
                    "user_id": "Damienne Mañago",
                    "user_href": "/profile/Damienne-Mañago"
                },
                {
                    "user_id": "Amazing Animals",
                    "user_href": "/profile/Amazing-Animals-7"
                },
                {
                    "user_id": "Sneha Chhonkar",
                    "user_href": "/profile/Sneha-Chhonkar"
                }
            ]
        }
    ]
}