{
    "title": "Does BLACKPINK’s 'Pretty Savage' sound like a mix of BTS's Baepsae and MIC drop? - Quora",
    "tags": [
        "Mic Drop",
        "Lisa (Black Pink member)",
        "BTS Songs",
        "BLACKPINK",
        "Hip Hop Music",
        "K-Pop Idols",
        "BTS (K-pop group)",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carmen Lin",
                "href": "/profile/Carmen-Lin-29"
            },
            "answer_text": "I thought I was the only one who thought this. I thought that Pretty Savage, sounded similar to BTS’s Baepsae as well, and I think with the addition of Mic Drop, it only makes it even more clearer, because it does sound a bit of both intermixed. I am glad someone can relate to me on this sentiment, and I think that both the beats and rhythm are similar and give the same vibes as one another. I think that it is good that Blackpink is also trying out different vibes that may have been aligned a bit more with BTS songs, but I think despite how similar of sound they are, they are still different from one another and also stay true to their styles, while also changing it up in their albums, by offering variety in their music, so it can be gravitating and more moving for them and would give a more stimulating experience. While Pretty Savage opens up with off kilter piano, and quickly devolves into hip hop piece, with good solid beats, and melodies with a familiar beats, and interesting bridge from Rose’s vocals, which most fit the song, Baepsae contains unique beats, with a layer of complexity, and convey some experimentation, which only add depth into the sound, but also convey a playful and light hearted, vibe, yet a serious and complex topic which talks abut adults being the compasses and have the reins over children's lives, and building a path for them, that they might not want, representing the hierarchy, of silver spoon for the superior and the interior with the bronze spoon it also touches upon socioeconomic, inequality, and injustice, between ranks, in the social hierarchy, and the division, emerged from the hierarchal stereotypes of not only South Korean society but around the world and has been a newly coined word representing the younger generations. The word Baepsae, is translated to crow tit, which is the symbol of someone who is not privileged, which contradicts those with a silver spoon in their mouth. Although I am not familiar with the meaning behind Pretty Savage, I think both have complex and deep meanings, that may be contrary to the vibe of the song, that it conveys, but nonetheless, is still impactful, and holds a lot of significance to the issues this society, may have subject to across the world. ",
            "date": "Answered October 22, 2020",
            "views": "73",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Areez Atif",
                    "user_href": "/profile/Areez-Atif"
                },
                {
                    "user_id": "Hamedah Badmus",
                    "user_href": "/profile/Hamedah-Badmus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Willow Brasch",
                "href": "/profile/Willow-Brasch"
            },
            "answer_text": "I wouldn’t say it sounds like a remix. But they sound really good together. The mashups of Baepsae and Pretty Savage I’ve heard are all really good. Tbh, I don’t really hear the resemblance to Mic Drop. I can kind of understand that with the beat in the beginning but it’s not that similar in my ears. The chorus sounds totally different I think. ",
            "date": "Answered October 21, 2020",
            "views": "118",
            "upvotes": " Answer requested by Jasmeet Kaur",
            "upvoters": [
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                },
                {
                    "user_id": "Jasmeet Kaur",
                    "user_href": "/profile/Jasmeet-Kaur-1467"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Narvaez",
                "href": "/profile/Christina-Narvaez-4"
            },
            "answer_text": "I don’t think they sound “alike” but the style is the same like of music.yes they are somewhat alike but I hope no other kpop fan ships or asks for a collaboration because groups can’t collab. ",
            "date": "Answered October 22, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters "
        }
    ]
}