{
    "title": "Does my birth chart indicate strong artistic ability especially in music? Is there any sign of fame? - Quora",
    "tags": [
        "Birth Charts",
        "Radical Charts (astrology)",
        "Talent",
        "Jyotish (Vedic astrology)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Picco",
                "href": "/profile/Anthony-Picco-1"
            },
            "answer_text": "OK… The possibilities are definitely there… although you may have a very quiet and subtle exterior, you are likely very sure of yourself, and action-oriented. Having Sun, Mars & Moon all in Leo certainly make you fairly single-minded, with a good ability to focus. Pluto is trining, or in harmonious aspect to Mars, and that can indicate a powerful ability to get things done when you decide you want to do something. And the North Node is in the house of creative self-expression, so that is a healthy goal for you. But Saturn is in there too, and that usually means “earned success” and very “focused success.” So whatever creativity you pursue, overnight success at a young age is not likely. Any success you have will be from time spent honing your craft and perfecting your skills. When success comes it will not be a fluke. You will have earned it. And your output will be focused and limited. You are more likely to invent a handful of wonderful creations, instead of a prolific amount, but what you DO create will be on target. Be careful about being too impetuous or rash. You have a tendency to rush to implement an idea that might be a great idea, maybe not, but you don’t always think it through all the way. Neptune is opposite your Mars and that can indicate very creative action but it can also indicate idealistic, impatient action. Try to learn to work things out before you do them. It doesn’t mean you need to lock it in stone but plan enough in advance to have a rough idea of potential risks and benefits. Spontaneity works best when there is a solid foundation (this ties in with what I said above about honing your skills.) Saturn trines Uranus, indicating an ability to hold on to the traditional while inventing new ideas. That is useful for being unique and inventive, yet still remaining grounded. Venus (music, art, creativity, the arts) is sextile Jupiter and that is a blessing, helping you expand your artistic side. Venus & Saturn square each other and that CAN indicate resistance to getting close with others, but Venus IS in its rulership and does sextile Jupiter. With all that Leo (Jupiter, Sun, Mars, Moon) be careful to keep an eye on your ego. Leo can be a healthy confident sense of self, but it can go too far and start thinking it is the center of the universe. Try and keep that in check. A healthy Leo is a wonderful vibrant person… take it too far and people will flee because all you will do is talk about yourself. Even if you ARE fantastic, no one wants to hear that all the time. I tend to see more writing than musical ability, but they can blend together. Uranus is opposite your Mercury, indicating a very inventive mind, but it can be a rebellious mind, so be careful not to argue for the sake of arguing… A quick heads up… Saturn & Pluto will be crossing your Rising sign by transit late this year into next year. This is a time when you may find yourself redefining who you are, letting go of emotional baggage in your life, and kind of clearing out the deadwood in yourself. It can be a challenging time, but try and roll with it. Fighting it just makes it a lot worse. You may be leaving things behind that you thought were a permanent part of you. If they are coming loose and falling away, they weren’t. I hope this helps, and hope it all makes sense  ",
            "date": "Answered August 21, 2019",
            "views": "462",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bob Marley",
                    "user_href": "/profile/Bob-Marley-938"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ainsley Hellrud",
                "href": "/profile/Ainsley-Hellrud"
            },
            "answer_text": "It’s not as easy to tell what the aspects are between planets with your example but a couple of things stood out right away - Neptune on the ascendant - you see the world differently than others. You might feel stuck between reality and another dimension. Neptune rules mirrors, cameras, the stage and screen. Acting and music are ideal outlets for your style of creativity and great imagination.Mercury in 10th house - People who have Mercury in the 10th house can excel in careers connected with public expression.Sagittarius stellium - Sagittarius are born performers and you have Sun, Moon, Mercury, and Pluto in the sign. Examples are too plentiful to list but look it up!",
            "date": "Answered May 27, 2019",
            "views": "196",
            "upvotes": " Answer requested by Delorean Pimber",
            "upvoters": [
                {
                    "user_id": "Delorean Pimber",
                    "user_href": "/profile/Delorean-Pimber"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Crabtree",
                "href": "/profile/Neil-Crabtree"
            },
            "answer_text": "18 December 1998, 10:55 am Bourg-la-Reine, France Hi Aslo - There’s a lot of good arrangements for an artistic career in your birth chart and indications of a public life which is what ‘fame’ is all about - you just have to have lots of people recognising you in your public life. You are artistic and imaginative in an independent way (Neptune conjunct Uranian Ascendant) which means you can be original. Your originality then resonates with your whole being (Neptune parallel Asc. and MC and Mercury) and lights up your enthusiasm (fire dominant, Mars trine Ascendant ruler). You are very meticulous in what your do (Sun trine Saturn) and like to work with others within groups (Sun, Moon in 11th) even if you are an individual within the group and then your associations become a source of inspiration. You have something new to offer (Sagittarian Sun conjunct Moon, Uranus Ascendant, Venus ‘out of bounds’ in the 12th square Mars) and a good intellect to bring it all together in a public sphere (Pluto conjunct Mercury in the 10th). You may have to wait a little for ‘fame’ (Chiron progressed over MC, Sun progressing through the 12th) until your mid thirties (Sun progressed over Ascendant and Neptune) - real success needs a solid background and a lot of learning if it is to last. Good Luck, Neil ",
            "date": "Updated March 10, 2019",
            "views": "402",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mina Ziv",
                    "user_href": "/profile/Mina-Ziv"
                },
                {
                    "user_id": "Andrew Muller",
                    "user_href": "/profile/Andrew-Muller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marija Plakalovic",
                "href": "/profile/Marija-Plakalovic"
            },
            "answer_text": "Wow! This is one of those charts where I would jump from my heels and say: “Go for it!” You’re a perfect combination of combining classy/elegant with something completely new and progressive. Such a deep emotion, yet free-spirited, and yes you know how to spread that energy on masses! 1.) The ruler of the 1st house Aquarius-Uranus in a first house! Who can resist your uniqueness? Please use this Neptunian energy on Ascendant to write some poetry, or make your own music. 2.) The ruler of 10th in 10th house-Pluto in conjunction with Moon exact square to Jupiter in a 1st house! You’re born to influence! And you’re not aware of it cause your careless child-like energy simply enjoys how it goes, with lack of practical insight. You’re too idealistic, still too talented! Please PM me for more information, I would like to talk to you! Your chart is really unique, I haven’t seen something like this for a while. ",
            "date": "Answered February 17, 2019",
            "views": "459",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Beth Turnage",
                "href": "/profile/Beth-Turnage"
            },
            "answer_text": "The fame part is there (Neptune on the Ascendant) though I would expect more rock star than concert violinist. But, hey, I’m only an astrologer. Your insecurities come from yourScorpio sun in the tenth house, which propels you to control those around you. If you aren’t careful you’ll develop a reputation as difficult to work with. Also,keep your hands to yourself, as people are draw to those power, but once they realize your heart is only for your first love that broke your heart, they’ll feel used and vengeful. ",
            "date": "Answered March 4, 2019",
            "views": "168",
            "upvotes": " Answer requested by Delorean Pimber"
        }
    ]
}