{
    "title": "For professional musicians, what have been the most impressive live music performances? What made them so impressive? - Quora",
    "tags": [
        "Live Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "What a wonderful and difficult question — you've no idea the flood of memories it has brought down early this morning.  I stood shirtless in the early morning rain listening to blind old Doc Watson pick, sing, and tell stories, holding a drenched crowd absolutely spellbound with the folk ballads and bluegrass specials that once would've rocked my grandmother to sleep. There's a reason the man racked up seven Grammys. I saw Leonard Bernstein conduct the New York Philharmonic when I was a very young child, one of the first times I ever heard a symphony orchestra and truly a defining moment in my life.  One of the last occasions on which Ella Fitzgerald sang in public, I was there; she might have lost a bit of her sparkle by that time, but absolutely none of her soul and charm. It was a small room, and she sang at least one phrase directly to each individual present, it seemed. Many times I witnessed Regi Wooten, older brother, teacher, and mentor to the great bassist Victor Wooten, break out in the middle of a cool Motown cover and amply demonstrate why people in the 1950s thought the Fender Stratocaster was a gift from outer space. He can melt your psyche by channeling signals from Alpha Centauri with his instrument, and it is a wondrous thing to behold. People get crazy, the best sort of nuts, when he does this.  At the memorial service following a nationally publicized shooting at my university, I heard my piano professor give a performance of Schubert's rippling, melodious G-flat major Impromptu that, just for a few brief moments, transfixed the room in a bath of peace and understanding.  But I think the single greatest live performance I can recall happened when the organist Paul Jacobs, chairman of the organ faculty at Juilliard at age 27, played a French-Romantic transcription of J. S. Bach's Sinfonia to Wir danken dir, Gott, wir danken dir (\"We Thank Thee God, We Thank Thee\") as an encore to close a concert.  Even classical musicians and the most serious enthusiasts might not normally be enthralled at the prospect of a long program of solo organ music, but Jacobs is no mortal organist.  The man performed Bach's entire output for the organ from memory several times while still an undergraduate student.  At his hands and feet, a great pipe organ becomes an extension of his mind and body — not a mass of homogenous gray sound, but a vibrant kaleidoscope of colors, textures, and emotions that at one moment cause you to lean forward in piqued interest and at the next will rattle the foundations of the cathedral with overwhelming force, like the voice of God Almighty himself.  By the time he had come to the final cadence of his Bach transcription, most of the room was already on its feet. There were tears of joy rolling down my face before I had time to realize what was happening. The organ isn't an instrument that you just hear; you feel it in your body, every shift of harmony coming alive as vibrations within you as you listen. The entire room, and you within it, become part of the music — and it's all acoustic. There are no loudspeakers, no clipped frequencies or electronic compression. Here's a video of Jacobs performing this piece at California's Crystal Cathedral. The a/v quality isn't the best, and it's nothing like the real thing, but maybe will give you some idea of his abilities. Watch and listen to the way he interacts with the organ's stops, at times varying the registration with each passing measure of music:   (Thanks for the A2A!) ",
            "date": "Answered October 5, 2015",
            "views": "13",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Smith",
                    "user_href": "/profile/Thomas-Smith-193"
                },
                {
                    "user_id": "Walter Erickson",
                    "user_href": "/profile/Walter-Erickson-5"
                },
                {
                    "user_id": "Ethan Tay",
                    "user_href": "/profile/Ethan-Tay"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Roger Spalding",
                    "user_href": "/profile/Roger-Spalding"
                },
                {
                    "user_id": "Ben Shields",
                    "user_href": "/profile/Ben-Shields"
                },
                {
                    "user_id": "Alberto Oliveira",
                    "user_href": "/profile/Alberto-Oliveira"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                },
                {
                    "user_id": "Akian Decloitre",
                    "user_href": "/profile/Akian-Decloitre"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                },
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                },
                {
                    "user_id": "David Caune",
                    "user_href": "/profile/David-Caune"
                },
                {
                    "user_id": "Joachim Pense",
                    "user_href": "/profile/Joachim-Pense"
                },
                {
                    "user_id": "Hari K Raghavan",
                    "user_href": "/profile/Hari-K-Raghavan"
                },
                {
                    "user_id": "Scott Borden",
                    "user_href": "/profile/Scott-Borden-1"
                },
                {
                    "user_id": "Jim Davis",
                    "user_href": "/profile/Jim-Davis-56"
                },
                {
                    "user_id": "Andrés Parzanese",
                    "user_href": "/profile/Andrés-Parzanese"
                },
                {
                    "user_id": "Arjun Ravichandran",
                    "user_href": "/profile/Arjun-Ravichandran-1"
                },
                {
                    "user_id": "Joy Ang",
                    "user_href": "/profile/Joy-Ang"
                },
                {
                    "user_id": "Scott Lowe",
                    "user_href": "/profile/Scott-Lowe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Caune",
                "href": "/profile/David-Caune"
            },
            "answer_text": "A very difficult question and one I've tried to answer obliquely many times. Let me explain. In the 1980s, I was \"empire building.\" I worked all day, seven days a week, for over a decade. Afterwards, each night I'd hit the town around 11:00pm, party hard with live bands, wind down and then the next day, do it all again. Later, in the 1990s, I helped run an Indie Rock hotel. I had a formula: four international tourers per month, eight national tourers a month, local band promotions and any other event I could think of that'd keep 1500+ people rockin' back up to the pub on the big nights. I've worked as a stagehand, promoter, venue operator, theatrical mechanist and a roadie on and off all my life. The result is that conservatively, I've seen over 10,000 live acts. Rock 'n' Roll heaven or suicide? At times, a bit of both! A path deliberately chosen. You might say I'm drawn to live music? Thanks for the A2A, Scott - but I'm not a \"professional\" musician. I play well enough to seduce potential partners at parties. Give me input to a gig, though? Yeah, I have some experience. The next problem is given the scope of my adventure, there's no way I can narrow it down to one. If I must, the answer would be U2 360°? But let's break it down over the years.  2015 - Xavier Rudd and the United Nations This gig wins my recent and emotional vote: \"The power of love can defeat the love of power.\" Last night, Aussie musician, Xavier Rudd's performance at the Enmore Theatre, Sydney turned into an accidental spiritual journey in every way... Xavier Rudd was most definitely worth the effort! He spanned his greatest hits from his surf and roots music days, plus produced world class sophisticated Dub with his current touring project. A master of didgeridoo, blues harp and guitar, Xavier fronted his dub project, \"The United Nations\" - flute, percussion, plus powerful Papua New Guinean and Samoan singers, plus indigenous Aussie backup singers. The encore, Xavier's classic \"Spirit Bird\" had the entire theatre caught up in the call and response, \"Emana, yo, yo, yo, yo!\" I swear, there were people everywhere singing along, some with genuine tears of joy!  An uplifting, joyful and inspiring night from Xavier Rudd - the way activism for positive change and humanity should be! — from: David Caune's post in Postcards from a Roadie For my American cousins - as of September, 2015: Xavier has just completed the Australian leg of his world tour and is about to hit the States. Do yourself a favour and don't miss him.  2010 - U2 360° For sheer scale and spectacle, it's hard to go past \"the greatest tour ever mounted.\" This is probably the \"single example,\" production based answer to the question? By any technical measure, the U2 360° Tour (2009 - 2011) is to this day recognised as the most \"spectacular\" tour ever mounted. Regardless of what you think of the band musically, engineering and production-wise the statistics are unmatched: 400 ton, 11 storey high structure (151' at it's highest point)360° Stage independent of the structure with two rotating bridgesDaily crew and production overheads $750,000250 speaker cabinets - the loudest Concert P.A. system ever built$1,000,000 custom built 54 ton cylindrical video wall expandable to 14,000 sq. ft.130 core crew for 6 days of construction, plus 170 local crew for load-outs. (Transfer to 180 trucks transporting 40' shipping containers)Tour Gross Tix Sales $736,000,000 - 110 shows.How we did it... Time lapse (6 day build, 3 shows, 2½ day deconstruct):  I worked as Production Crew on the Sydney, Australia leg of the U2 360° tour. For the \"behind the scenes\" story of what it's like to work in the Concert and Production industry, here's my answer to: What is a bad job for someone who is accident prone?  * Image: U2 360° ANZ Stadium, Sydney, Australia. © David Caune (2010) — From: David Caune's answer to What's the most spectacular touring music act? Other lifetime highlights of that era would be: Metallica, \"In the Round\" Tour, 2010. Intimate and also a 360° presentation. * Image: Metallica, Acer Arena, Sydney, Australia. © David Caune (2010) Iron Maiden at Soundwaves '11. One of the most staggering displays of professionalism by any band I've ever seen—every move a money shot! Unfortunately, all my backstage photos of the night are absolutely horrible: * Image: Iron Maiden, Soundwaves 2011. © David Caune (2011) Rammstein, Big Day Out, 2010. Theatrical, flawlessly crafted, spectacular. So much pyro, blinders and movers, none of my shots came out at all!  1991 - The Screaming Jets, the Cambridge Hotel It's a subject for another post, how The Screaming Jets began in the front bar of The Cambridge, (before my time) as \"Aspect.\" Newcastle —a hardcore working man's town, where you applied to the BHP steelworks, Lysaghts steelworks and the abbatoirs for a job before you left high school. The Jets were the city's favourite sons. It's another story how they became one of Australia's legendary bands of the era, went to England and blew their shot at world fame. In a town where major music hotels would confer and conspire in order not to blow the locals' budgets, thereby ensuring most gigs were successful, The Jets filled the Cambridge to capacity, three nights in a row, no other band can make that claim in Newcastle.  Highlights of those years? Powderfinger, Ammonia and Pollyanna (in one gig!)Fugazi.Mr. Bungle.Tex Perkins and The Cruel Sea. Chocolate Starfish.Def FX.Ian Moss. 1980 - Andy Durant Memorial Concert. Andy Durant, one of Australia's most promising songwriters was taken by cancer at the age of 26. The Melbourne, Australia music scene pulled together and put on a memorial concert. The Sports, Broderick Smith, Richard Clapton, Jimmy Barnes, Ian Moss, Mal Eastick, Renee Geyer, Mick Peeling and the Ideals, plus so many others made an unforgettable evening, which in retrospect encapsulates the thriving Oz music scene of the time. One of the most moving moments of the night was this version of one of Andy's songs, \"Ocean Deep.\" He wrote the song knowing he was dying.   1977 - Lou Reed, The Civic Theatre, Newcastle, Australia. If you want to blame someone for this answer and by inference, a good deal of my life journey —here's the culprit, Lou Reed. The very first gig I ever saw live! Thus began a journey that I hope hasn't quite finished yet? In many ways, I've never recovered from that evening?  That'll teach you to A2A me? Never ask an old(ish) man a question unless you have the time to hear the answer? (Even \"How're you feelin'?\" can be risky!) Seriously? Thanks for making me relive the memories again! It's been a wild ride! ",
            "date": "Updated October 7, 2017",
            "views": "871",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Hammons Jr",
                    "user_href": "/profile/Thomas-Hammons-Jr"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "David Urquhart",
                    "user_href": "/profile/David-Urquhart"
                },
                {
                    "user_id": "Nathan Budden",
                    "user_href": "/profile/Nathan-Budden"
                },
                {
                    "user_id": "Andrés Parzanese",
                    "user_href": "/profile/Andrés-Parzanese"
                },
                {
                    "user_id": "Curtis Lindsay",
                    "user_href": "/profile/Curtis-Lindsay-1"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Scott Lowe",
                    "user_href": "/profile/Scott-Lowe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Erickson",
                "href": "/profile/Walter-Erickson-5"
            },
            "answer_text": "Leon Fleischer playing Ravel’s Concerto for the Left Hand, Flint Center, San Jose, 1974. Electrifying - goosebumps - ennoblement. Rolling Stones in 1971 with Tina Turner. best live band ever, best live female vocalist ever (Leontyne Price excepted). Messiaen Turangalila Symphony with Jeanne and Yvonne Loriod playing the Ondes Martinot and Piano,SF Symphony, Tilson Thomas, 2001 or 2002. Made even better when the Ondes Martinot malfunctioned and the Loriods were joking with the audience during the fixing process. TRANSCENDENTAL. Roy Hayes Jazz Band Village Vanguard 2000. His drum solo was so good, he took out a towel, waved it at his trap set as if it was on fire, and said something like: “Where did THAT come frommmmm???” Self-Explanatory. ",
            "date": "Answered March 8, 2019",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Albert Mora",
                "href": "/profile/Albert-Mora-5"
            },
            "answer_text": "That’s easy! Any Jimi Hendrix performance. James Marshall Hendrix was the greatest instrumentalist in all genres of all time. Miles Davis (trumpet) sits alone on the second rung of the ladder to Music Heaven. On the third rung: Franz Lizt (classical piano), Itzhak Perlman (violin), Art Tatum (jazz piano), Jimmy Smith (Hammond B3 organ), Tony Williams (jazz drums), John Coltrane (saxophone), Eric Clapton (rock & blues guitar), Carlos Santana (rock/blues/Latin guitar), Herbie Hancock (jazz piano), Chic Corea (jazz/Latin piano). ",
            "date": "Answered April 26, 2017",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Smith",
                    "user_href": "/profile/Thomas-Smith-193"
                }
            ]
        }
    ]
}