{
    "title": "Guitar: Is a Les Paul better than a Strat? - Quora",
    "tags": [
        "Les Paul",
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "I would almost always take the Strat over the Les Paul but have owned both. Over the years I have owned probably 4 Les Paul's but at least 20 Strats. I have found that the quality control on the Fenders has generally been better than with the Gibson. Truthfully I was a little let down when I got my first LP because it really didn’t live up to the hype and my Yamaha SGB 3000 was a much better guitar in every way. The LP was a good guitar and had good sound but it was heavy and the neck profile was a bit clunky for me as I prefer a thinner neck. The Strat is much lighter and comfortable for me to play. So personally just because of the weight and the neck I will always take a Strat over a LP. The good thing is you can get Strats with a lot of configurations like SSS, HSS and HH so you can buy one to get the sound you like. ",
            "date": "Answered August 16, 2019",
            "views": "66",
            "upvotes": " Answer requested by Ganesh Jagdeo",
            "upvoters": [
                {
                    "user_id": "Eric Garfinkel",
                    "user_href": "/profile/Eric-Garfinkel-2"
                },
                {
                    "user_id": "Jim Kloster",
                    "user_href": "/profile/Jim-Kloster"
                },
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Peter Adams",
                    "user_href": "/profile/Peter-Adams-204"
                },
                {
                    "user_id": "Keith Calhoun",
                    "user_href": "/profile/Keith-Calhoun-5"
                },
                {
                    "user_id": "Ganesh Jagdeo",
                    "user_href": "/profile/Ganesh-Jagdeo"
                },
                {
                    "user_id": "Jeremy D",
                    "user_href": "/profile/Jeremy-D-33"
                },
                {
                    "user_id": "Ritesh Thakur",
                    "user_href": "/profile/Ritesh-Thakur-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lewis",
                "href": "/profile/William-Lewis-193"
            },
            "answer_text": "Strat. Hands down. As for the why, there’s lots of why. Strats are sturdy guitars. I’ve knocked them over, had straps break, had one fall down the stairs out of a broken case, and every time I picked it up and it was good to go. Maybe needed a slight tuning adjustment. But that was it. Also maybe a new scar for the guitar. But that’s fine with me. Try any of those with a Les Paul and you’ve got a broken guitar. I’ve had LPs break in the case. So for me, knowing the guitar can withstand a lot more punishment allows me to play it full throttle. I can’t get that feeling from a Les Paul or any Gibson. Another thing was the clarity. I used primarily Gibson guitars early on. But once my ear got better, I started hearing mud. Like my riffs sounded muddy. I’d play them on the acoustic just fine, but on the LP through at the time a Orange Rockerverb, it wasn’t as clear as I’d like. Plus I’d had other issues with my Les Pauls aside from that. Tuning was one. And before you get on me about not knowing how, here’s what I tried to remedy it: New nut installed by a trusted luthier, not some Guitar Center idiot. I knew the inherent issues with a 3X3 headstock. You have to have a perfectly cut nut to keep it in tune. This is because at the angles the strings are traveling, the nut has to be perfect so they don’t bind up. Gibson hasn’t figured out how to do this themselves apparently, even though they make guitars noted for these kind of headstocks.Lubricated the nut. I used the nut sauce (actual name by the way)Installed locking tuning machines.Upgraded the bridge and tailpiece.Switched to .11-.49 strings. I used standard tuning.None of that fixed it. And yeah, I stretch the strings out. Next issue was the D string. My Custom didn’t have this problem but I experienced it on a Studio and two different Standards. It broke at the saddle. I sanded down the saddle and the issue repeated. I upgraded the bridge. Still had it happen twice. Luckily not at a show. But it was weird. No SG ever did that either. Exclusive to LPs. I’ve had a few others have a similar experience but it doesn’t seem to be one of the big issues. But I’m including it for thoroughness. I also never liked the switch position. Very easy to hit. But much like with the Strats, you can learn to avoid it if you play the guitar enough. So that’s a personal thing and not on the guitar. I actually didn’t like Strats at first. They weren’t hard hitting enough. But once my ears improved, I liked the clarity. And by then I realized that hard hitting is more in how and why you’re playing rather than the guitar. That clarity in the riffs and chords was a game changer. I guess for the stuff I play it just fits better. Speaking of fitting better, a Strat feels like a part of me. Not just like an instrument. The whole package is just perfect for me. LPs feel weird. And that was after playing one for years. I just feel at home on my Strat. It’s tough, it’s clear, it feels right, hell you can use them as an improvised weapon and play a show with it afterwards. ",
            "date": "Answered August 19, 2019",
            "views": "988",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg Trimble",
                    "user_href": "/profile/Greg-Trimble-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Ballard",
                "href": "/profile/Jonathan-Ballard-4"
            },
            "answer_text": "It’s not so much a question of “better,” than “different.” A nice American-made Gibson Les Paul usually costs significantly more than a nice American-made Fender Stratocaster. I own both. If you want a heavier sounding (and physically heavier) guitar that sounds great distorted for metal, rock, or blues, a Paul is a great choice. If you want a lighter sounding (and physically lighter) guitar, with an easily replacable neck that sounds great clean (and can sound great for rock, but less so for metal unless you install a humbucking pickup), get a Strat. Great guitarists have played both: Jimmy Page, Jeff Beck, Slash, and countless others have played Les Pauls. Jimi Hendrix, Eric Clapton and David Gilmour have played Strats. Play both and see which you personally think plays better and sounds better to your ear. That’s what matters most. Cheers! ",
            "date": "Answered March 31, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eugenya Davidov",
                "href": "/profile/Eugenya-Davidov"
            },
            "answer_text": "I prefer Les Paul without question. Its shape screams “comfort for the player’s both hands”, it is designed perfectly for playing any kinds of music. But aside of a great usability, this is the sound that defines an instrument. I’ve always found Stratocaster to be too clear and too loud, it takes a real pro like David Gilmour or Andreas Kisser to make it sound warm, when for LP this is a default setting. I’ve always found Strat’s sound too thin, while Les Paul is making a statement with every note it played on it. ",
            "date": "Answered August 16, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "Phil Cabrera",
                    "user_href": "/profile/Phil-Cabrera-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent St. Louis",
                "href": "/profile/Vincent-St-Louis-3"
            },
            "answer_text": "Yes, for my purposes. Playability, sustain, and output is superior, clean or overdriven, humbucker or single coil. I have two Strats. Four over the years. Cheaper. Lightweight. Like the whammy, and the tone selector is entertaining. But they feel like barbed wire on baseball bats, and don’t have the “oomph” for hard rock that I like. ",
            "date": "Answered June 15, 2019",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doc Rietman",
                "href": "/profile/Doc-Rietman"
            },
            "answer_text": "these are two completely different instruments and different tones…no matter what anybody tells you the one is not better than the other…what kind of music do you play?….are you looking for that single coil sound?…or a darker more robust humbucking sound….both instruments have been played by hundreds of well known musicians…does Jimmy Page sound better than jimi Hendrix? Depends on the amp set up, pedals you may be using…I have played both and my preference is single coil but I also played a goldtop les paul for many years before I went with G&L guitars….but the answer here is neither is better than the othe..just different tones. ",
            "date": "Answered June 15, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Derek Bonney",
                "href": "/profile/Derek-Bonney-1"
            },
            "answer_text": "If it's just between those two guitars, the Strat. For me, it's a more versatile instrument. More selections for clean tone, enough gain for rock tones. I've never really played a Gibson that inspired me. ",
            "date": "Answered August 15, 2019",
            "views": "21",
            "upvotes": "0"
        }
    ]
}