{
    "title": "Has the rock music genre declined because it has become too difficult to create an original sound? - Quora",
    "tags": [
        "Alternative Rock",
        "Classic Rock Music",
        "Rock and Roll Music",
        "Genres",
        "Music Genres",
        "Rock Music",
        "Sound",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darrell Spencer",
                "href": "/profile/Darrell-Spencer-5"
            },
            "answer_text": "Rock 'n' roll is around 70 years old, and inevitably by this time so many melodies, riffs and lyrical themes have already been explored. However, this does not mean that the genre is doomed to decline from here on out. There are an inexhaustible number of ways that artists can give their own twists to themes that have been visited before, perhaps mixing and matching. The roots of pizza, for example, go back hundreds, maybe thousands of years. Yet a pizza eaten today is just as delicious. Robert Plant has said that everyone borrows from everyone else. It's hard to disagree with him. Sometimes this borrowing is blatant (Creed from Pearl Jam; Greta Van Fleet from Led Zeppelin, etc.) and sometimes it's more subtle. The roots of rock music today can be traced back to several prominent ancestors: Chuck Berry, Elvis Presley, The Beatles, The Rolling Stones, Bob Dylan, The Who, Buddy Holly, The Beach Boys, The Byrds, Hank Williams (a country artist, but he had an outsized impact on rock), Bo Diddley, Little Richard, James Brown, Led Zeppelin and others. Their musical DNA, along with that of many more, has mingled to produce today's rock music. Going outside of rock music to the field of country for a second, the vast majority of the new acts of the last thirty years have been just as influenced by the Eagles and Lynyrd Skynyrd as by George Jones and Merle Haggard. So, later generations can change the course of a genre and influence it going forward. A hundred years from now, long after we're gone, someone will probably hear a Chuck Berry song and want to pick up a guitar. She or he will give the music their own spin and perhaps go on to inspire others. ",
            "date": "Answered October 20, 2020",
            "views": "170",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Cruz",
                    "user_href": "/profile/Jason-Cruz-36"
                },
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Prestwick",
                "href": "/profile/John-Prestwick"
            },
            "answer_text": "I think this is an important part of the reason, though not the only reason. Some previous movements in rock, such as 1970s punk and 2000s pop punk, were quite back-to-basics in their nature. And with the stagnation of music-making technology at the turn of the millennium, there’s plenty of retro-sounding music in the other genres. Look at how much disco-influenced pop we have had this year. As for other reasons, in the 1970s, dissatisfied working-class youth did not have access to sampling and drum machines. So the easiest way for them to create a musical outlet for their dissatisfaction was to form a rock band. Although it did not happen overnight, rapping has now become the easiest way to form an outlet. Computer production has become as easy and accessible as buying and learning to play a guitar, and has the added advantage in that you can do it on your own. There’s also the fact that any genre is likely to have a shelf life in terms of being popular. If rock is following the trajectory of jazz, then rock is in the same position jazz was in the mid-80s, about 65 years after it first became popular. By that time, jazz was quite clearly no longer part of the cultural zeitgeist. Furthermore, it had also stagnated artistically, a contrast to the first half of the 1970s. As one answer to another recent question put it, while we usually expect teenagers to rebel against the music of their parents, it’s actually when a genre becomes the music of their grandparents that it really loses its footing. ",
            "date": "Answered October 20, 2020",
            "views": "213",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                },
                {
                    "user_id": "Dan Johnson",
                    "user_href": "/profile/Dan-Johnson-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Todd",
                "href": "/profile/Jason-Todd-137"
            },
            "answer_text": "That is part of it yes. Think about it, we’ve had the original rock of the 50s (modified Rockabilly) followed by folk rock, British Rock, glam Rock, psychedelic rock, latin rock, funk rock, progressive rock, art rock, country rock, Album Oriented Rock, punk rock, pop rock, metal and all it’s strains, college rock, alternative rock, and then in the early 2000s you had bands going back to the basics of the original rockabilly. So yes, everythings’ basically a retread of earlier styles by now. Of course, if we’re honest, many people who call themselves “rock” fans don’t really want to hear anything “new” or bizarre. I mean…Greta Van Fleet. I’m not saying they’re bad; but they are stunningly un-original. Yet they’re one of the biggest selling rock bands out today. That does not bode well for bands that ARE trying something original if all people want is endless variations on the Stones, Zeppelin or Who. Of course, one of the problems is our brains are wired to respond in a certain way to the music we listened to during our teenage years. No really, it’s a fact, read this linked article! So that’s the other problem. You will NEVER respond to new music they way you do to the music you grew up with because it’s bonded to you, regardless of how many Greta Van Fleets, Struts, White Stripes, and Hives come out of the wood work. ",
            "date": "Answered October 23, 2020",
            "views": "246",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                },
                {
                    "user_id": "Dan Johnson",
                    "user_href": "/profile/Dan-Johnson-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew S Guthrie",
                "href": "/profile/Andrew-S-Guthrie"
            },
            "answer_text": "Let’s start off with the premise that “the rock music genre has declined”, as there are still vital regional markets and venues for so-called rock music, and so the “decline” is more in the market percentage rather than a complete wipe-out. One might even posit that the music has “gone underground”. One could also posit that the fundamental shift in “popular music” has to do with technology, as currently it’s the “one man/woman band”; the producer’s studio being housed in someone’s bedroom; the “band” being a mass of samples or computer generated loops. So . . . saying one genre is in decline or even “dead”, reverts to what people have been bemoaning about the state of jazz for quite a while. It’s more like DNA or the genes have been passed along, so you can say so-and-so looks like jazz but of course it’s not jazz’s grandpa (the exact same person). The grandpa might have gone to the great hereafter but the son/daughter live on in the specifics of their era. Listen closely! Clearly, rock has had an influence, simply in terms of “sonic energy” on that market juggernaut we call hip-hop, a genre which surely does NOT sound like it sounded in 1980-whatever. ",
            "date": "Answered October 25, 2020",
            "views": "194",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Johnson",
                    "user_href": "/profile/Dan-Johnson-102"
                },
                {
                    "user_id": "AJAY KUMAR SRIVASTAVA",
                    "user_href": "/profile/AJAY-KUMAR-SRIVASTAVA-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson Jenstad",
                "href": "/profile/Nelson-Jenstad"
            },
            "answer_text": "I dont that is the case. Have you ever brought your rock band to an a&r rep at a label? Now I'm not talking about indie labels which you may be able to get some kind of a signed deal (maybe not for big money but for producing an album.) But the major labels - it seems like for the last 25 or 30 years will turn away rock groups and say “we really like your stuff but you're not doing rap hip hop or r&b”. I suffered through that scene in Los Angeles through the late eighties - for me it was all right because I'm still an indie producer/creator anyways, and I wouldn't be able to stand having a record label tell me how to do it. Now there are resources for Indies and if you get creative and look around online for dream pop and shoegaze music you'll find it's actually quite a huge scene and there are tons and tons of really clever brilliant bands all over the world creating beautiful Rock music. There seems to be no end to the variety of songs and styles that can be created. ",
            "date": "Answered October 21, 2020",
            "views": "183",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                },
                {
                    "user_id": "Matt Borchard",
                    "user_href": "/profile/Matt-Borchard-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Toomey",
                "href": "/profile/David-Toomey"
            },
            "answer_text": "I think it declined because the genre moved in directions that aren't interesting. This doesn't mean nothing modern is good, but it's generally stuck in one of two places: 1- effectively a cover band, ie, originals that aren't original. 2- fireworks and complexity over substance. There is no doubt that musicians are equally as talented as musicians of the past; the sticking point is the they just aren't as creative or willing to take risks. There has also been a general death of original live music, at least on cities that aren't Los Angeles. When there is no local support, there is no ecosystem to test music and ideas. Look at any of the more popular music today. You can easily tell what decade rap, pop, EDM were created. You don't even have to be a fan of this stuff to make a good guess. In the past 10 years, you can easily confuse rock for some decade past. I truly doubt there is no ability to create something new. ",
            "date": "Answered October 21, 2020",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aloisio Ferreira",
                "href": "/profile/Aloisio-Ferreira-3"
            },
            "answer_text": "By no means, It´s rather a matter of choice. Presently, the newer generations prefer something else, mostly. And it has to do with aging. too. Rock n roll is a teenager in a body of a 70 year old. Still much better than everything else done in music in the last half century. But i don´t see it as an unhappy end fairy tale. Rock n roll backed off but is still there ready and willing, Everyday new bands surface making new songs. You can spot gazzillions of teens in “dinos” bands gigs. Rock n roll, the most outstanding way mankind invented to make music, is alive and well. And, if all the rebelious spirit and establishment questioning are gone, still can give us is a great time. And talking about an “original” sound, rap and hip hop are , both, boring apotheosis of the sameness. ",
            "date": "Answered October 30, 2020",
            "views": "44",
            "upvotes": " Answer requested by Ryan Craig Wallace",
            "upvoters": [
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Warburton",
                "href": "/profile/Chris-Warburton-4"
            },
            "answer_text": "I don't think so, I still hear plenty of original sounding rock music, but it is probably harder to find these days. Rock does, however have to compete in a changing media landscape which currently seems to favour other genres, some of which prioritise “fame” over originality. The other problem that's been around for years is that record companies are less inclined to nurture rising talent. They want a hit. NOW! And they want money for their shareholders. NOW! We no longer seem to have labels like Charisma, Island or the early Virgin records whose owners were just glad to take a punt on something interesting. I doubt that Tubular Bells would get a release these days. ",
            "date": "Answered October 20, 2020",
            "views": "208",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Heath",
                    "user_href": "/profile/David-Heath-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rolando Knaap",
                "href": "/profile/Rolando-Knaap"
            },
            "answer_text": "Rock is about danger, having an edge. The thing is that nowadays usually older people are into rock. There goes part of the edge. Also a lot of rock that used to be edgy is now mainstream or been there done that ( gretha, foo fighters ). You can get louder but then it becomes metal. You can experiment more but that will make it experimental music. The album Pink by Boris was the last time I thought; that is an interesting turn. And the last cool rock band with hits was kings of leon who quickly became less cool. Maybe the psych movement with thee oh shees, ty segall was also intetesting. It stayed small which is ok. Maybe some cyberpunk music willl be made. Return to roots I dont see that happening because all roots have already been returned to. So the future of rock n roll doesnt look good. Many people have trouble saying rock n roll is dead but I wonder why. ",
            "date": "Answered October 22, 2020",
            "views": "139",
            "upvotes": " Answer requested by Ryan Craig Wallace",
            "upvoters": [
                {
                    "user_id": "Tim Burgerfs",
                    "user_href": "/profile/Tim-Burgerfs"
                },
                {
                    "user_id": "Erica Perry",
                    "user_href": "/profile/Erica-Perry-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Walters",
                "href": "/profile/Chris-Walters-88"
            },
            "answer_text": "I think it's much more complicated than that, post grunge there were a lack of bands writing and playing quality songs, The rise of hip hop is another reason, kids rebel from there parents music so the they turned to hip hop, kids are always looking for the next great thing and rock and roll was there parents music which they reject I'm and acri rebellion. Another reason is that Rock is so disversified now into samu subgenres there is no mainstream rock and.roll. everything is so nice oriented anymore it seems, social media has caused the Rock stars to loose their mistique also. We will see if rock comes back I'm a different form or if hip hop ,and foreign pop acts will dominate the charts, I feel people will grow tired if this and start looking for music with more substance than my W.A.P ",
            "date": "Answered October 21, 2020",
            "views": "188",
            "upvotes": " Answer requested by Ryan Craig Wallace",
            "upvoters": [
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                },
                {
                    "user_id": "Ann Min",
                    "user_href": "/profile/Ann-Min-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Beowulf Pearce",
                "href": "/profile/John-Beowulf-Pearce"
            },
            "answer_text": "Since you asked, I’ll weigh in a little against the others who answered so far: No, originality has never been a crucial part of rock and roll; in fact there has always been more ancestor worship in rock than most popular genres. There certainly has been some originality, and those who brought it were sometimes rewarded — but not always. For every Peter Gabriel there have been a raft of Bruce Springsteens and Bryan Adamses and John Cougar Mellencamps. The big changes, that is, the big spikes of originality, have usually come from other genres — R&B, funk, even New Wave (though most of that wore off). The changes rock could claim for its own, like punk and grunge, are mainly reversions to rock’s own roots. ",
            "date": "Answered October 30, 2020",
            "views": "176",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mrak Damir",
                    "user_href": "/profile/Mrak-Damir"
                },
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                },
                {
                    "user_id": "Christopher Lester",
                    "user_href": "/profile/Christopher-Lester-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Hagelbarger",
                "href": "/profile/John-Hagelbarger"
            },
            "answer_text": "It has become too difficult to both create an original sound and get a hit. Otherwise, it hasn’t - just make the music that you think sounds good, and don’t worry about what’s getting played on the radio. If you like something you heard on the radio, go ahead and sound like that. If you like something from your uncle’s record collection that was never a hit, go ahead and sound like that. And, if you hear something in your head you’ve never heard before, or your fingers on your instrument lead you there, go ahead and sound like that. ",
            "date": "Answered October 20, 2020",
            "views": "172",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Helen Rupp",
                "href": "/profile/Helen-Rupp"
            },
            "answer_text": "Original sound has nothing to do with it. No matter what the genre, sounding like other artists within that genre is par for the course. There are a list of boxes that a song or artist has to tick to be rock, the decline has more to do with new genres fitting new sound better than rock could. Most modern music has roots in folk and classical, but we don’t call them by either of those words because there’s been whole new categories created to better suit what they’re creating. Making original sound is the easy part, calling it rock music is where it gets difficult. ",
            "date": "Answered October 28, 2020",
            "views": "308",
            "upvotes": " Answer requested by Ryan Craig Wallace"
        },
        {
            "author_info": {
                "name": "Dennis Jezek",
                "href": "/profile/Dennis-Jezek"
            },
            "answer_text": "Maybe. Rock music has been around for over 70 years (depending on when you date the first rock record). There have been myriad styles. But it’s still basically 3-chord blues progressions, sometimes with country, jazz or gospel elements. In over 70 years, most things have been done. This isn’t to say that some innovator won’t come along and break some new ground, but it’s definitely more difficult to be original with the back catalogue of the genre behind you. ",
            "date": "Answered October 20, 2020",
            "views": "175",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Daniel Passarelli",
                "href": "/profile/Daniel-Passarelli-4"
            },
            "answer_text": "Lots of good answers already… Amywau, I'll add my two cents here… The first reason for rock music's “decline” is the nature of show biz itself - EVERYTHING comes and goes. Rock dominated the scene for almost 40 years, I'd be surprised If It were still dominant. Second, rock was most popular when people could DANCE to It. Unfortunately that hasn't been the case for almost two decades now. Rock has become a music for white teenagers who can't dance. Rock definitely needs to find its “roll” again. ",
            "date": "Answered October 22, 2020",
            "views": "213",
            "upvotes": " Answer requested by Ryan Craig Wallace"
        },
        {
            "author_info": {
                "name": "Brian Mcpherson",
                "href": "/profile/Brian-Mcpherson-34"
            },
            "answer_text": "No though in fairness there's only so many notes however there's not enough young bands playing rock music hopefully somebody breaks big then it all comes round again. The current situation doesn't help and the talent shows producing cheap plastic music and performers who don't last ,rock music takes time and effort and groups need time to move forward and develop and of course tour it builds the audience and inspires creativity. ",
            "date": "Answered October 22, 2020",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-1408"
            },
            "answer_text": "No it’s declined because kids would rather listen to dogshit rap music & autotuned pretty people. ",
            "date": "Updated October 24, 2020",
            "views": "37",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Steve Hill",
                "href": "/profile/Steve-Hill-410"
            },
            "answer_text": "Possibly. But it is also possible that someone out there might come up with something new in a field where so much has been tried over the years, although as the years pass, I become more sceptical. But one never knows. Also the younger generation has Rap, Hip Hop, etc., and “Young Country” for lack of a better term, is very popular as well. There are just more genres and sub-genres to pick from than there were in the past. ",
            "date": "Answered October 22, 2020",
            "views": "119",
            "upvotes": " Answer requested by Ryan Craig Wallace"
        },
        {
            "author_info": {
                "name": "Geir Hongrø",
                "href": "/profile/Geir-Hongrø"
            },
            "answer_text": "This is probably one of the reasons. Other reasons are home studio technology favouring synths, decline in album sales and the importance of pre manufactured playlists giving less room for stylistic variation in mainstream pop. ",
            "date": "Answered October 21, 2020",
            "views": "191",
            "upvotes": " Answer requested by Ryan Craig Wallace"
        }
    ]
}