{
    "title": "Has Kanye West officially ended his career with his pro Donald Trump rant? - Quora",
    "tags": [
        "Kanye West (musician)",
        "Hip Hop and Rap Artists",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danielle Madison",
                "href": "/profile/Danielle-Madison"
            },
            "answer_text": "I don’t think he’s ended his career per se but I do know Black people are pretty angry with his remarks. When Kanye first came on the scene, he presented himself as someone for Black people and who didn’t want to see his people wronged. He spoke proudly of his Chicago roots and community and blackness. He also had a black fiancé at the time. His outburst during Katrina about Bush’s response to the hurricane made him gain a lot of respect in the black community by him saying what everyone was too scared to say. However, it seems now that Kanye is gone and replaced with a MAGA hat wearing, Trump supporter who thinks Black people chose to be enslaved for 400 years and is married to a seemingly narcissistic White woman. When Van Lathan told him about how his slavery comments affected the Black community on TMZ and left Kanye speechless that started his downfall among Blacks. Many want nothing to do with West’s music and apparel because he so easily supports a person who is a racist, blatantly doesn’t care about Black people, a misogynist and the list goes on. It’s really sad when you look at how far Kanye has fallen. Sometimes, I wonder if his mental health is contributing to his behaviors. I know he admitted he has bipolar disorder and I wonder if these moments are symptoms of manic behavior or if this is how he truly thinks. I’m not a psychiatrist so I don’t really know but I think it plays a part in everything. Particularly, his random thoughts, outbursts, saying he’s moving back to Chicago for good and leave his wife and kids behind only to then decide he’s going to stay in Cali with his wife and many other random statements and announcements. He’s just very all over the place and I don’t think he’s in the best mental state especially since it can take a while for bipolar disorder to be properly managed when diagnosed. As of right now, his career probably won’t end but he definitely alienated a good portion of his fan base. It would take a lot for POC to support him again and I just don’t see that happening right now. I’m sure White people listen to him but I don’t know to what extent but I do know his clothing and sneakers will keep him relevant and definitely make him money if his music career dies out. ",
            "date": "Updated October 2, 2018",
            "views": "16",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azeez Adewale",
                    "user_href": "/profile/Azeez-Adewale-2"
                },
                {
                    "user_id": "Deborah Garwood Voulgaris",
                    "user_href": "/profile/Deborah-Garwood-Voulgaris"
                },
                {
                    "user_id": "Darryl Austin",
                    "user_href": "/profile/Darryl-Austin"
                },
                {
                    "user_id": "Harvey Miller",
                    "user_href": "/profile/Harvey-Miller-10"
                },
                {
                    "user_id": "Daryl Washington",
                    "user_href": "/profile/Daryl-Washington-10"
                },
                {
                    "user_id": "Prabhakar Padole",
                    "user_href": "/profile/Prabhakar-Padole"
                },
                {
                    "user_id": "Raphael Broonland",
                    "user_href": "/profile/Raphael-Broonland"
                },
                {
                    "user_id": "Brendan O'Gorman",
                    "user_href": "/profile/Brendan-OGorman-3"
                },
                {
                    "user_id": "Jared Buck",
                    "user_href": "/profile/Jared-Buck-6"
                },
                {
                    "user_id": "Chandrakanth Reddy",
                    "user_href": "/profile/Chandrakanth-Reddy-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taylor Prescott",
                "href": "/profile/Taylor-Prescott-6"
            },
            "answer_text": "No. I’m no Trump supporter, but millions will continue to buy his music. Including myself. His lack of understanding when it comes to history and politics is embarrassing, but he’s still one of the greatest artists of our generation and a fashion icon. That said, he has alienated millions of fans (in particular many of his black fans). However, he’s also garnered some new ones. I’ve always admired Kanye’s courage to be himself and stand by his opinions and I still do. I just understand he’s ignorant of some of the issues he’s trying to address. But I’m still a fan of his music and always will be. ",
            "date": "Answered September 30, 2018",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norman Baltson",
                "href": "/profile/Norman-Baltson"
            },
            "answer_text": "It could be a turning point for him. The backers of the fantasy thriller book “Helga and Donald Trump,” soon to be a movie, are in a process of engaging Kanye West and Kim Kardashian into production, creative, and acting process of this yet to be blockbuster Hollywood movie. In the next five years, Kanye West’s reputation and wealth could skyrocket. ",
            "date": "Answered September 30, 2018",
            "views": "58",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jared Buck",
                    "user_href": "/profile/Jared-Buck-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Duane Gundrum",
                "href": "/profile/Duane-Gundrum"
            },
            "answer_text": "I’m not a personal fan of his music, but I know he’s innovative and he has a HUGE fan base. His political opinions aren’t really going to affect his music career in any way. If his music started to suck, that might, but I honestly don’t see that happening as all of the reviews of his latest work seems to be pointing upward, not downward. ",
            "date": "Answered September 30, 2018",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Iain Evans",
                "href": "/profile/Iain-Evans-7"
            },
            "answer_text": "There will be people more mad about that fake album yandhi, that never came out and loving him. What he says now will piss many of his fans and lose them, bit he will still have masses of people that love him in other countries and trump supporters to say much more. He will be fine for his career. Some white people don't care about what trump stands for. Some will and ignore his music but im sure he will be just fine. ",
            "date": "Answered October 2, 2018",
            "views": "23",
            "upvotes": " Answer requested by Ashanti Peterson"
        },
        {
            "author_info": {
                "name": "Cynthia Zaleska",
                "href": "/profile/Cynthia-Zaleska"
            },
            "answer_text": "No. He is outrageous and people like that. I understand he is a good musician so he has that going for him. As long as he makes music and a public spectacle of himself he will be fine. ",
            "date": "Answered October 7, 2018",
            "views": "3",
            "upvotes": " Answer requested by Ashanti Peterson"
        }
    ]
}