{
    "title": "Have you ever been to a BTS or BLACK PINK concert? - Quora",
    "tags": [
        "BLACKPINK",
        "Concerts",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebekah Mikaelson",
                "href": "/profile/Rebekah-Mikaelson-17"
            },
            "answer_text": "I went to a BTS concert last year (it was on their lys: speak yourself tour). Tickets were slightly pricey, but it was so worth the investment. The venue wasn’t that large compared to some of the other stadiums they’ve performed at, and I wasn’t seated too far from the stage so I got a decent view of them. It’s an unbelievable feeling, having your idol right there. The seats were completely full, and the energy there was great. We were doing fanchants for the MVs even before BTS came out. I swear, the anticipation and excitement- And when they finally came out, boy did they not disappoint. Their stage presence was so good. They hyped the crowd up so much. Their performances were *chef’s kiss* WOW. Their vocals, their raps, their dancing was all so damn perfect, idk how they kept it up for so long. I remember there was some problem with the translator so they had a bit of trouble interacting with the audience. But they handled it so professionally and didn’t freeze up. It was so cute and funny. (They tried to make us do the wave but we were so confused lol) And then they sang Jimin happy birthday and he was so happy im ??? Mikrokosmos was the last song they performed and I almost cried. Im never forgetting that day, ever in my entire life. So yes, based on my experience, BTS’ concert was amazing and I 10/10 highly recommend. The only bad thing was that it ended. (I’ve never been to a Blackpink concert so idk how it’d be like) ",
            "date": "Answered September 27, 2020",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raavee Shukla",
                    "user_href": "/profile/Raavee-Shukla"
                },
                {
                    "user_id": "Elena Hinggin",
                    "user_href": "/profile/Elena-Hinggin"
                },
                {
                    "user_id": "Safirta Fatmarianti",
                    "user_href": "/profile/Safirta-Fatmarianti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cali",
                "href": "/profile/Cali-177"
            },
            "answer_text": "I’ve been to a BLACKPINK concert and I loved it! I was and am still not a BLINK but I really enjoyed the show. Before the concert, I was a Rosé bias but after I became a Jennie bias. Not that I don’t appreciate Rosé any less, it’s just that Jennie’s performance and interaction on stage just captured me. Against some popular opinions, she seemed so lively on stage and happy. And all their songs are BOPS, too bad there are not a lot of them but what can I do. I would definitely attend another one of their concerts! ",
            "date": "Answered September 9, 2020",
            "views": "238",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Misa Artemis",
                    "user_href": "/profile/Misa-Artemis"
                },
                {
                    "user_id": "Babita Konwar",
                    "user_href": "/profile/Babita-Konwar-1"
                },
                {
                    "user_id": "Areez Atif",
                    "user_href": "/profile/Areez-Atif"
                },
                {
                    "user_id": "Lia Zappy",
                    "user_href": "/profile/Lia-Zappy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seoyeon Bebe",
                "href": "/profile/Seoyeon-Bebe"
            },
            "answer_text": "Nope ✌🏻 I'm not a Blink, just a casual fan. But, I am army. i started stanning them early 2019 so I was new to them (also I was a casual fan for a bit) so I didn’t bother with concerts. the second half of the year I really wanted to go and attend a concert of theirs but, I didn’t have the money… (still don’t ) now this whole virus thing has been happening and no one can go. i still really wanna go to a bts concert 😔😔😔  It looks like an incredible experience. 😭 now, blackpink? I’d love to go to one of their concerts, It seems fun.  ",
            "date": "Answered September 10, 2020",
            "views": "338",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhuvi Shrimali",
                    "user_href": "/profile/Bhuvi-Shrimali"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MONAL-CHAUHAN-3"
                },
                {
                    "user_id": "Lee Sookyung⁷",
                    "user_href": "/profile/Lee-Sookyung⁷"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meryl Fish",
                "href": "/profile/Meryl-Fish"
            },
            "answer_text": "I went to a BTS concert in 2018 but didn’t go to the BlackPink Concert that was in my country in 2019 bc I simply refused to pay over 90€ to see a group that bearly had 10 songs at that time. ",
            "date": "Answered September 13, 2020",
            "views": "472",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elena Hinggin",
                    "user_href": "/profile/Elena-Hinggin"
                }
            ]
        }
    ]
}