{
    "title": "How do musicians remember the lyrics of all their songs they sing in concert? - Quora",
    "tags": [
        "Song Lyrics",
        "Singing",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donya Lane",
                "href": "/profile/Donya-Lane"
            },
            "answer_text": "Here’s the real answer: Analysis and interpretation, combined with the correct placement of the perfect rhymes (usually at the end of each line, but sometimes placed internally in the middle of lines). A well-written lyric is extremely easy to memorize, because it makes sense, in terms of chronology of events, storyboarding or the development of sentiments, and because it will also have a very strong rhyme scheme, which makes it almost foolproof to perform. A poorly-written lyric might be more difficult to memorize, but you can always rely on the melody to remind you what the “sound” of the lyric is supposed to be in each verse. If a singer or singer/songwriter is taking their performance seriously, they will spend time analyzing and interpreting the lyrics, so that they can internalize the song’s meaning and “sell it” to their audience. For example, if the lyric is about being hurt, the singer should interpret the lyric through his own experiences of being hurt. Kinda like acting choices… Lastly, if you’re actually the songwriter and/or the recording artist of a song, recording it in the studio really helps plant it in your head. You might go for several takes, over and over. Or you might go for one verse, over and over, which results in memorization. THEN you’ll be at the mix session, where you hear the song, literally, HUNDREDS of times, before it’s finished! ",
            "date": "Answered November 4, 2017",
            "views": "36",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Billy Madigan",
                    "user_href": "/profile/Billy-Madigan-2"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Ellie Johansson",
                    "user_href": "/profile/Ellie-Johansson"
                },
                {
                    "user_id": "Vappor PD",
                    "user_href": "/profile/Vappor-PD"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                },
                {
                    "user_id": "Sean Skellett",
                    "user_href": "/profile/Sean-Skellett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viktoriya Koreneva",
                "href": "/profile/Viktoriya-Koreneva"
            },
            "answer_text": "If it’s your own song, remembering the lyrics is a bit easier and faster because when you write music or you wrote the lyrics yourself, you resonate with it from the get go. When you need to memorize lyrics for a song someone else wrote, the best approach is to give yourself time to learn not only the words, but to let the meaning sink in, then let it settle in you and only then, you’ll feel ready to perform the piece publicly without forgetting the words! Some of my singers’ friends use a notebook or cards and write down lyrics there. For opera singers it’s even harder because often we sing arias in Italian, French, German, Russian and other non-English languages. Then, they repeat the words over and over again as a phrase before even combining it with the melody itself. Others, translate an aria (if it’s not in their native language, for example) to get the meaning of each word and then, learn music along with the lyrics. So, you can select a method that works best for you to remember the lyrics. But the bottom line is everything should come from your heart. Lyrics are not just words, they compliment music, they are together, not separate, and approaching it like this could really help link the idea in the text with the melody in the music. This in turn, will make you easily remember what you want to say to your audience through words and music, what kind of mood you want them to be in when they hear you sing. Happy Singing! Vita, Mezzo-Soprano & Composer, www.viktoriyavitakoreneva.com ",
            "date": "Answered November 4, 2017",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guy Cavicchia",
                    "user_href": "/profile/Guy-Cavicchia"
                },
                {
                    "user_id": "Bianca Albinka",
                    "user_href": "/profile/Bianca-Albinka"
                },
                {
                    "user_id": "Marina D Samoylovich",
                    "user_href": "/profile/Marina-D-Samoylovich"
                },
                {
                    "user_id": "Howard Passel",
                    "user_href": "/profile/Howard-Passel"
                }
            ]
        }
    ]
}