{
    "title": "How does it feel to keep playing the same song again and again every live performances for musician? - Quora",
    "tags": [
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlie Imes",
                "href": "/profile/Charlie-Imes"
            },
            "answer_text": "How does it feel? Well… it can feel different every night, and a lot has to do with the crowd, the venue, the band, etc. Let’s look at it from a couple of different viewpoints. For the big time, famous musicians, a good crowd cures any boredom with a song. I recall hearing or reading an interview with James Taylor once where he was asked about playing Fire & Rain for the 10,000th time. I’m paraphrasing a bit here, but he basically said it was a challenge sometimes to tap into the emotion behind writing the song and put that into the performance, but the energy from the crowd feeds the performer and brings a renewed focus and fun to it every time. Also, with a band, the more you play a song, the tighter the band gets and if the band is on and playing tight, there’s no better feeling in the world… unless of course you’re doing that in front of thousands of appreciative fans. That pretty much cures any boredom. The energy between the musicians lifts you up and feels amazing. From the perspective of the average working musician, playing house concerts, bars, parties, coffee houses and restaurants, the crowd and atmosphere can make all the difference in the world. If the crowd is into it and paying attention, you feed off of that and the familiarity with the song works to your advantage. If the crowd is indifferent, talking and not paying attention, it’s easy to sleepwalk through a song. Of course, we’re talking about cover songs here and while the musician can always change up the setlist, there are still songs in your repertoire that are crowd pleasers so you wind up playing them all the time. Pretty much every musician has cover songs that they’re so sick of that they either refuse to play them or only do so for the tips. While that’s an individual choice, there are certain songs that lots of musicians complain about or refuse to play (i.e. Brown Eyed Girl, Wagon Wheel, Margaritaville, Hotel California, etc.) because they became ubiquitous and played to death. But a bad or indifferent crowd can make for a long gig, no matter what or where you’re playing. ",
            "date": "Answered July 4, 2017",
            "views": "851",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Pulkowski",
                    "user_href": "/profile/Christopher-Pulkowski"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Chris Roy",
                    "user_href": "/profile/Chris-Roy-87"
                },
                {
                    "user_id": "Jon Baldwin",
                    "user_href": "/profile/Jon-Baldwin-4"
                },
                {
                    "user_id": "Philip McKee",
                    "user_href": "/profile/Philip-McKee-1"
                },
                {
                    "user_id": "Jessica Foster",
                    "user_href": "/profile/Jessica-Foster-69"
                },
                {
                    "user_id": "Melvin Thakkar",
                    "user_href": "/profile/Melvin-Thakkar"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Spencer Manoppo",
                    "user_href": "/profile/Spencer-Manoppo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Anderson",
                "href": "/profile/Neil-Anderson-30"
            },
            "answer_text": "I’m 52 and have been playing in bands since I was 15. I used to play original music in bands in my 20s and played maybe 6 or so gigs a year, mainly concentrating on studio work. I never got bored. In my 30s and 40s I played in wedding bands and played a number of songs repeatedly. After playing Play that Funky Music, Disco Inferno, Mustang Sally, and One Way or Another (and many others) I started to really get bored with them. We used to drop these from some gigs to rest them and introduce them again later. We had a repertoire of around 150 songs so mixing it up wasn’t a problem. Several of the songs we played often got reworked, and as the line up of the band changed so the structures changed too. When the rhythm guitarist left and a keyboard player came in we changed several songs’ structure. I have guitar solos that I would completely change or improvise to keep them interesting. Of course our audience didn’t have expectations of us other than their requests. If I was Paul McCartney I may feel that I could do without playing Let It Be one more time. But that’s what people want and you play what your audiences wants you to - mainly. I still do occasional acoustic gigs and I play some of the originals I wrote in bands in my teens and 20s. I consider these my best songs, and enjoy doing them. Sometimes I change bits round for my own amusement. I don’t get bored, but I’m playing these hundreds of times, not thousands. It is easy to get bored playing songs repeatedly, but you can change them to avoid this, and always remember, being able to play songs at all is a privilege. ",
            "date": "Answered July 6, 2017",
            "views": "361",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Jeremy Bloch",
                    "user_href": "/profile/Jeremy-Bloch"
                },
                {
                    "user_id": "Neil Highnam",
                    "user_href": "/profile/Neil-Highnam"
                },
                {
                    "user_id": "Tim Knowles",
                    "user_href": "/profile/Tim-Knowles-11"
                },
                {
                    "user_id": "Spencer Manoppo",
                    "user_href": "/profile/Spencer-Manoppo"
                }
            ]
        }
    ]
}