{
    "title": "How to go about turning a song from major to minor scale - Quora",
    "tags": [
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ally Kim",
                "href": "/profile/Ally-Kim-5"
            },
            "answer_text": " The basics are simple. In every major key, there are related minor keys. In C major, the same key signature \"codes\" for A minor. If you keep the key signature the same but play a scale from A to A (no accidentals), it will produce A natural minor. A is the 6th degree (\"la\") of the C major scale -- and this format applies to all other scales. In all major scales, a scale starting on the 6th of the major scale with the major key signature will produce a minor scale (in G major, E minor; in D major, B minor, etc). To answer your question, you would use a G major key signature, which consists of F# as the only accidental. Thus, the natural minor scale would be: E, F#, G, A, B, C, D, E Yet you need to choose a mode of minor key. There are three modes: natural minor, harmonic minor, and melodic minor. The simplest of them are the natural minor since it simply utilizes different accidentals and sticks with those given accidentals. However, utilizing harmonic or melodic minor requires accidentals. Harmonic raises the 7th and melodic raises both the 6th and the 7th -- both key factors in providing a certain mood. For example, minor scales with no raised 7th (natural minor) has no 7th scale degree that \"leads\" into the tonic, leaving a separated mood in contrast to what would function as an anticipatory chord in both melodic and harmonic minor (and major) scales. Melodic minor is tricky in that in descending phrases, the 6th and 7th are not raised. This creates diversity in choice of notes which, in sophisticated pieces, would give an extra coating of \"sophisticated\" tonality (but the latter part is completely subjective). Natural minor would suffice, but in case you wanted some other exciting twists you could go about utilizing other modes of minor key too.  ",
            "date": "Answered January 20, 2016",
            "views": "7",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Fields",
                    "user_href": "/profile/Peter-Fields-6"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Kjeff Hansen",
                    "user_href": "/profile/Kjeff-Hansen"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Patrick Skov",
                    "user_href": "/profile/Patrick-Skov-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grahame Harris",
                "href": "/profile/Grahame-Harris"
            },
            "answer_text": "The easiest way is to replace the tonic Major (eg: A) key signature with the tonic minor (in this case A), hence immediate transformation. Assuming that you know your key signatures you will realise that this involves taking away three sharps (in keys with less than three sharps you will add flats for the sharps you cannot remove). So C Major - no accidentals, but C minor - 3 flats. Then leave the same notes as originally written but obviously with three of them altered by the new key signature. But be warned: some melodies and harmonic sequences will continue to work well after the transformation, albeit differently, but plenty will lose what they had. Those will just sound ‘wrong’ - like you ‘goofed’. You may be able to fix that in some cases by modulating or employing the harmonic or melodic minor scales but in some cases even that won’t correct the ‘loss’ - this just means that the original melody only works musically in the Major. Changing a melody from minor to Major is the reverse; change the minor key signature to its tonic Major (or if you don’t know your key signatures very well, add three sharps {remove flats}). Finally if your intent is to move a melody from a Major key to its relative minor just transpose all the notes down a third leaving the key signature untouched. YOU WILL NEED TO TRANSPOSE ALL THE HARMONY NOTES DOWN A THIRD ALSO. If changing a minor melody to its relative Major transpose everything up a third. Anything above that you are unsure of, just ask. ",
            "date": "Answered April 3, 2018",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Fields",
                    "user_href": "/profile/Peter-Fields-6"
                },
                {
                    "user_id": "Piano Lessons Sheppey",
                    "user_href": "/profile/Piano-Lessons-Sheppey"
                },
                {
                    "user_id": "Kjeff Hansen",
                    "user_href": "/profile/Kjeff-Hansen"
                },
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                }
            ]
        }
    ]
}