{
    "title": "How to find out whether my partner is using dating sites - Quora",
    "tags": [
        "Online Dating Advice",
        "Dating Sites",
        "Life Partner",
        "Dating Apps",
        "Online Dating",
        "Relationships",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daryl Smith",
                "href": "/profile/Daryl-Smith-49"
            },
            "answer_text": "Five Ways to Find out if your partner is using dating sites.  Find their email address and enter it in the “forgotten password” feature found on most websites and apps. This will not tell you if the individual is actively using the particular site or app however it will let you know they did at one point.Look them up by phone number. Most dating apps on Android and IOS are linked to the users phone number. Most people use Tinder and Bumble so I would start there. Try logging into the account using their phone number while you are hanging out and if they look at their phone then chances are they just receives a login verification code. Create an account in the same vicinity as theirs. This can be time consuming if there are many active users but you can certainly find them yourself. Start with the most popular sites and apps everyone uses. Keep in mind that if your partner also suspects you of using dating sites or apps this method could lead to some hard questions.Use a service such as albion-services or buzzhumble to do the searching for you. Sometimes a little professional help is worth a couple dollars. Take notes on how the individual uses their mobile phone. If there is a lock on their phone and they don’t receive notifications then chances are they are hiding something. Notifications being completely disabled is a huge red flag or if they always place their phone face down.I have a suggestion that may or may not work in your relationship. My policy is honesty and I set boundaries within the first month. I make it very clear that I want to be monogamous and that I don’t like secrets. Serious partners shouldn’t hide things. Some people go so far as to always keeping their social media accounts logged in on a mutual device and they share phone passwords. This may or may not work for you but if you show your partner you trust them completely they are much more likely to trust you back and there should be no excuses at that point. ",
            "date": "Answered September 27, 2019",
            "views": "1564",
            "upvotes": " View 118 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tonia Midnight",
                    "user_href": "/profile/Tonia-Midnight"
                },
                {
                    "user_id": "Nikki Frye",
                    "user_href": "/profile/Nikki-Frye-6"
                },
                {
                    "user_id": "Pete Olney",
                    "user_href": "/profile/Pete-Olney-1"
                },
                {
                    "user_id": "Gigi Carmichael",
                    "user_href": "/profile/Gigi-Carmichael-2"
                },
                {
                    "user_id": "Kristy Scott",
                    "user_href": "/profile/Kristy-Scott-44"
                },
                {
                    "user_id": "Colleen Yonkers",
                    "user_href": "/profile/Colleen-Yonkers"
                },
                {
                    "user_id": "Mikimito Maximo",
                    "user_href": "/profile/Mikimito-Maximo"
                },
                {
                    "user_id": "Brandytyak",
                    "user_href": "/profile/Brandytyak"
                },
                {
                    "user_id": "Jessica Ganga",
                    "user_href": "/profile/Jessica-Ganga"
                },
                {
                    "user_id": "Mike Smith",
                    "user_href": "/profile/Mike-Smith-1490"
                },
                {
                    "user_id": "Robyne Walter",
                    "user_href": "/profile/Robyne-Walter-8"
                },
                {
                    "user_id": "Darrick Fox",
                    "user_href": "/profile/Darrick-Fox"
                },
                {
                    "user_id": "Marinelly Rodriguez",
                    "user_href": "/profile/Marinelly-Rodriguez"
                },
                {
                    "user_id": "Rayvun Jarrell",
                    "user_href": "/profile/Rayvun-Jarrell-1"
                },
                {
                    "user_id": "Nadia Toffar",
                    "user_href": "/profile/Nadia-Toffar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/DT-173"
                },
                {
                    "user_id": "Selina Cellucci",
                    "user_href": "/profile/Selina-Cellucci"
                },
                {
                    "user_id": "Mer Fay",
                    "user_href": "/profile/Mer-Fay"
                },
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Shashank Rustagi",
                    "user_href": "/profile/Shashank-Rustagi-1"
                },
                {
                    "user_id": "Bree Kathleen Holliday",
                    "user_href": "/profile/Bree-Kathleen-Holliday"
                },
                {
                    "user_id": "Jack Meihoff",
                    "user_href": "/profile/Jack-Meihoff-2"
                },
                {
                    "user_id": "Michael Georgiades",
                    "user_href": "/profile/Michael-Georgiades-2"
                },
                {
                    "user_id": "Kelly Bruder",
                    "user_href": "/profile/Kelly-Bruder-1"
                },
                {
                    "user_id": "David Somerville",
                    "user_href": "/profile/David-Somerville-13"
                },
                {
                    "user_id": "Jenny Day",
                    "user_href": "/profile/Jenny-Day-9"
                },
                {
                    "user_id": "Rae Monserud",
                    "user_href": "/profile/Rae-Monserud"
                },
                {
                    "user_id": "Selena Jay",
                    "user_href": "/profile/Selena-Jay-1"
                },
                {
                    "user_id": "Aditya Mahardika",
                    "user_href": "/profile/Aditya-Mahardika"
                },
                {
                    "user_id": "Erin F Schulman",
                    "user_href": "/profile/Erin-F-Schulman"
                },
                {
                    "user_id": "Ashley Brown",
                    "user_href": "/profile/Ashley-Brown-1947"
                },
                {
                    "user_id": "Joanna Hamilton",
                    "user_href": "/profile/Joanna-Hamilton-32"
                },
                {
                    "user_id": "Gopalkrishna Tandle",
                    "user_href": "/profile/Gopalkrishna-Tandle"
                },
                {
                    "user_id": "Sandy Lewis",
                    "user_href": "/profile/Sandy-Lewis-10"
                },
                {
                    "user_id": "Amanda Jones",
                    "user_href": "/profile/Amanda-Jones-1696"
                },
                {
                    "user_id": "Make It a Good day Regardless",
                    "user_href": "/profile/Make-It-a-Good-day-Regardless"
                },
                {
                    "user_id": "JO KEating",
                    "user_href": "/profile/JO-KEating-6"
                },
                {
                    "user_id": "Ivana Jasak",
                    "user_href": "/profile/Ivana-Jasak"
                },
                {
                    "user_id": "Jeanette Dowell",
                    "user_href": "/profile/Jeanette-Dowell"
                },
                {
                    "user_id": "Adam Spencer",
                    "user_href": "/profile/Adam-Spencer-38"
                },
                {
                    "user_id": "Saifullah Syed",
                    "user_href": "/profile/Saifullah-Syed"
                },
                {
                    "user_id": "Catrina Bates",
                    "user_href": "/profile/Catrina-Bates-1"
                },
                {
                    "user_id": "Cheryl Terhune",
                    "user_href": "/profile/Cheryl-Terhune"
                },
                {
                    "user_id": "Misty Gee",
                    "user_href": "/profile/Misty-Gee-3"
                },
                {
                    "user_id": "Ananya Nagpal",
                    "user_href": "/profile/Ananya-Nagpal-10"
                },
                {
                    "user_id": "Monica Bejarano",
                    "user_href": "/profile/Monica-Bejarano-2"
                },
                {
                    "user_id": "Eddie Jones",
                    "user_href": "/profile/Eddie-Jones-329"
                },
                {
                    "user_id": "Amy Schneider",
                    "user_href": "/profile/Amy-Schneider-18"
                },
                {
                    "user_id": "Dallas Herrmann",
                    "user_href": "/profile/Dallas-Herrmann"
                },
                {
                    "user_id": "Racheal Rose",
                    "user_href": "/profile/Racheal-Rose-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pamela Harvey",
                "href": "/profile/Pamela-Harvey-6"
            },
            "answer_text": "I am not a professional researcher (but maybe I should be), so my data is anecdotal and subjective, from personal experience only, and can be an IRL supplement to the technical methods shared by other respondents to this question. This is simply what I’ve noticed. If you and your partner are living together, and in general cohabiting if you are married, your path to discovery is easier than if you are partners living separately, although there is always that occasion when you return home after an evening out with your partner and discover to your horror that you’ve left your phone at your partner’s house. Major alert, requiring immediate corrective action, requiring you to drive back to their house and get your phone. After dating many divorced men and after a few dates, increasing our mutual comfort level, I asked how/why they became divorced. This is a common conversation: Me: “So how did your divorce happen?” Them: “I cheated.” [or maybe a more informative variant] Me: “How did your wife/husband find out?” Them: “I couldn’t find my phone and my wife/husband/kid found it”. Me: “Oh. Right. Of course they did.” But here are some other methods of discovery: 1.) Yes, of course, the most frequent situation for learning about your parter’s use of dating apps is, when in a hurry, you pick up the wrong phone and see an image of an attractive woman/man occupying the home screen. This only works if you and your partner have identical phones with identical cases. If your partner’s phone case is red, and yours is black then you would be less likely to grab their phone by mistake. 2.) If you try a dating site, in order to find out if your SO is participating, then of course you have to use a trial and error method because you cannot ask directly “now, what dating sites to you use?” Frequent swiping left and right, performed frequently enough can eventually turn up your partner in your daily feed of match wannabes. You and your partner would need to be using the same dating sites, though. However, this does not usually yield immediate results and can be labor- and time-intensive. You might be able to speed things up a bit by narrowing your search requirements to your specific location, where both you and your partner live. If you and your partner are using the same location, roughly, then your results would be limited to a narrower list than if you checked a range of “5 miles” to “100 miles”. 3.) You are researching something, looking for a specific screen, but you are having issues, or your phone’s battery is low, or you can’t find it and you need your phone right now but you have to wait until it at least charges to 10%. Then your partner, temporarily blind to the extreme dangers of phone sharing, tries to be helpful by offering their phone as an expedient. This solution is “expedient”, but for what purpose? Besides being a temporary hack to fix your problem, it is also “expedient” in apprising you of their dalliance. Items 1.) to 3.) above are all highly circumstantial and need a specific set of variables in order to work for checking out your partner’s dating site status. 4.) Just ask them, if you dare. Possible answers: a.) “Of course not, I’m with you, we’re a thing.” This takes a highly-evolved person to respond in a factual non judgmental way, but of course…if the person is highly-evolved you would not be having this conversation. b.) “OMG how could you even think such a thing?!” This implies that you are very insecure just by asking the question, and you’ve lost a few points in their opinion of you as a partner. This is a case of “If you have to ask, there’s your answer.” c.) A variation on b.) “OMG how could you even think such a thing?!”, which turns the issue back to your SO if they are the anxious one. This demonstrates their insecurity as they wonder if their performance is adequate, if they are showing enough interest, commitment, general participation in the relationship, because why would their partner be asking, unless they have fallen off the bandwagon. d.) And, OMG, the terminally sarcastic response: “Yeah, I keep the apps to cover any possible breakup with you, so I’ll be always current in my dating search”. This is so offensive it’s almost worse than if they actually were hanging out on the sites. Who wants to even be in a relationship with someone who dismisses your questions with such cavalier bravado. e.) “Yes, I am keeping them for a friend, who has to hide their dating app matches because they are married and don’t want their spouse to find out.” WTF?? Well what about when you find out, hmmm? You are a partner/spouse and you have already “found out”. You know, it’s exactly like that old story from high school, when your mother discovers your cannabis stash and you say “Oh it’s not mine. I’m keeping it for a friend”. In the same way, they might say: “Oh that dating app isn’t mine, I’m just using it for my married friend who doesn’t want their spouse/partner to find out.” These “how to’s” are, as mentioned above, circumstantial, and in need of corroborating evidence in order to be trusted, and, of course there is the “do nothing” strategy of simply waiting; your partner’s dating app status will be revealed and confirmed. ",
            "date": "Updated October 24, 2020",
            "views": "65",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Elkins",
                    "user_href": "/profile/Anthony-Elkins-11"
                },
                {
                    "user_id": "Jessica Vogan",
                    "user_href": "/profile/Jessica-Vogan-3"
                },
                {
                    "user_id": "Jenn Jackson",
                    "user_href": "/profile/Jenn-Jackson-7"
                },
                {
                    "user_id": "KO",
                    "user_href": "/profile/KO-142"
                },
                {
                    "user_id": "Brandytyak",
                    "user_href": "/profile/Brandytyak"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Johnston",
                "href": "/profile/John-Johnston-269"
            },
            "answer_text": "Hi, so if you are in a relationship and you are worried about the other party cheating, What are the ways of investigating that or determining that? This is Johnson you can check my profile for more details- you've probably seen many lists of how to determine if somebody is cheating, if they buy new clothes, new cologne perfume. That is all well and good but here is a hidden indicator of cheating that most people are not aware of. First of all, a cheater when they are going to be undertaking this activity is going to make sure that they are not going to get caught. How do they do that? Some people make sure you aren't going to be around to catch them so they are going to be very keen on what your activity is and your location during that time so be aware when the other person in that relationship is checking your activity especially if they are not really jealous about it, sometimes a cheater will be happy that you are going out with your girlfriends or even with co-workers to make sure you are not around. It has been discovered long time in the investigative world when i am hired by a party to do surveillance on a spouse or domestic partner and clients never really had any reason to suspect cheating, so i have let's say a husband that calls up and say i want to do surveillance on my wife to make sure she is not cheating so i do my job and check everything out, not cheating and nothing is wrong and i call up the client and he's fine, no you know most of the normal response to it so what i do i do a little investigation and found out that about 20 percent of surveillance requests in a relationship scenario is what i call circle-back which means that the party that is hiring is actually not hiring to determine cheating and they actually hire to make sure that their spouse or other party is not circling back to catch them cheating so in this case the party will be so insistent on making sure they are not going to get caught, they want to keep tabs on their spouse to make sure they are not going to make sure they are not going to be discovered. So here's how you check that out, give a suspicious answer to questions on your whereabouts( i mean something that might trigger them normally) see if the other party is jealous because if the other party isn't it might be an indication that they don't really care about where you are, they are just glad that you have somewhere especially if they say what time will you be back or are you sure you gonna go. Those are the type of things that are indicators. Then watch their activities right after they ask these questions, if they ask you for example where you are going to be on a Thursday morning from 9 am to 12 pm, at 12:15 pm check them out to see where they are at, see if their back home, see if they are at work and maybe stop by at work to make sure they are there. Don't try to do surveillance during the period they are telling you about because they are going to be really suspicious of that, check them out right afterwards and if you want to if their hair's messed up, if they smell like perfume, if their car is parked in a different place that's the time to do it, don't try to do surveillance when the action is going on and see if they double check your location. Circle back is a cheater's worst nightmare, don't circle back and find them, find it out surreptitiously so you know the answer before they know you do and then you have more control over what happens because if they find out, they are going to be even more careful the next time and it is going to be even harder. Unfortunately, a lot of these situations are out of your control. Hire the service of a pro LIKE ME To save you the stress,dedication and frustration that comes with finding out if your significant other is an infidel. It is advised that when hiring a professional you should seek a profound and experienced one like myself to avoid any future issue. Hire the service of a pro LIKE ME to save you the stress,dedication and partial frustration that comes finding out if you are being cheated on. In summary, get the peace of mind you deserve! ",
            "date": "Answered April 25, 2019",
            "views": "226",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamie Cox",
                    "user_href": "/profile/Jamie-Cox-125"
                },
                {
                    "user_id": "Gina Bone",
                    "user_href": "/profile/Gina-Bone-1"
                },
                {
                    "user_id": "LianneMechelle",
                    "user_href": "/profile/LianneMechelle"
                },
                {
                    "user_id": "Jenn R Quinn",
                    "user_href": "/profile/Jenn-R-Quinn"
                },
                {
                    "user_id": "Breanna Rodriguez",
                    "user_href": "/profile/Breanna-Rodriguez-73"
                },
                {
                    "user_id": "Brittanny Curletto",
                    "user_href": "/profile/Brittanny-Curletto"
                },
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "The Coyles AJ",
                    "user_href": "/profile/The-Coyles-AJ"
                },
                {
                    "user_id": "Rudy Munoz",
                    "user_href": "/profile/Rudy-Munoz-26"
                },
                {
                    "user_id": "Elle Jensen",
                    "user_href": "/profile/Elle-Jensen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne Howes",
                "href": "/profile/Anne-Howes-1"
            },
            "answer_text": "Ask her and be upfront about why you're worried she might be. She's your wife, you should have open communication to talk about anything. It's wrong to go snooping. It can make you become obsessed with finding something even if there's nothing to find. I really don't recommend it unless you truly feel she's hiding infidelity from you. If you're really worried after speaking with her: You can check or ask to check her browser history and messages/emails. Ask your friends to keep an eye out if they're on dating sites. Look for signs; she hides her phone and gets angry if you try to look while she's on it, she goes out randomly and when you ask to go with, she insists you to stay home, she stops talking to you about issues or starts fights before leaving the house, she showers right away when she gets home. To fix things: If you're feeling insecure about the strength of your relationship, it's time to make some changes. You are married, you both deserve to feel appreciated, loved and respected. Don't hold onto what happened yesterday; each day is new and deserves a new opportunity to become close, not hold resentment with your partner. Try doing new things to bring intimacy, sex and romance into your relationship. Ideas: stay up all night listening to music (jazz, instrumental,etc), have a few drinks and laugh and talk. Really look at each other, lightly touch each other on and off throughout the night. Go to the beach, have a picnic, camping or find a great walking trail. Spending time outside with your partner is very important. Listen to the wind, water and animals and you'll find a sense of calmness and bliss. Enjoy the sun, the rain or the snow, give yourselves good memories of the seasons together. Really think about what makes your wife happy and excited. Give her a surprise. Make her laugh and smile. She wants to feel special, if you make her feel this way, she'll want to make you feel good too. Have a conversation about what your wants and needs are and come to a compromise. This conversation should come up at least once a year, since again we're always changing and so will the relationship. Really listen to and try new things with each other. It's important to be IN your relationship and not just on \"autopilot\" doing the same things and having the same conversations every day. ",
            "date": "Answered May 14, 2018",
            "views": "5",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susan Smith",
                    "user_href": "/profile/Susan-Smith-1910"
                },
                {
                    "user_id": "Jessica Vogan",
                    "user_href": "/profile/Jessica-Vogan-3"
                },
                {
                    "user_id": "Gigi Carmichael",
                    "user_href": "/profile/Gigi-Carmichael-2"
                },
                {
                    "user_id": "Suresh Govindarajan",
                    "user_href": "/profile/சுரேஷ்-கோவிந்தராஜன்-Suresh-Govindarajan"
                },
                {
                    "user_id": "David Ferguson, Jr.",
                    "user_href": "/profile/David-Ferguson-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marlon Dubery",
                "href": "/profile/Marlon-Dubery-2"
            },
            "answer_text": "There are three types of guys that may use an online dating app. Guy number 1 is looking for a life partner he will look for someone that fits his ideal profile and is most likely an introverted person just looking for true love . Guy number 2 is the player he finds easy targets to have quick uncomplicated sex. There are no shortage of girls available online that can be easily swept into the bed and this guy knows how to get them there. Hopefully and surley after being in a relationship with this guy you would know what type of character he is. This type of person will most likely be a player online and offline so the signs will be there. Guy number 3 uses online dating as a confidence boost. Each match for him is a sign he still has sex appeal. Rarely will this guy follow through unless the girl can totally break through to his inner desires. But this is your more genuine type of guy and not online to be a player. Now this is all a basic breakdown. If your current boyfriend has had many online hookups via the dating app previously you will always be wary of him. If he truly loves you and is happy with you he will delete all his dating apps. If he does it in front of you ,you know he cares for you. All those tinder matches will be lost its a very good test of his true intentions. You may need to check his phone again in a few days to see if he re installed the aps but if they there again it's pointless he will always go back again. You can always try catch him out by getting some friends from work or school that live close to his radius to see if he's online show them pics and tell them you think he's messing around. Overall there are major issues with the way we hook up these days. It's a very sad situation the way sex is now a few clicks away. However it's not always that simple but it's definitely an addiction for many and something that needs to change before society is tarnished by the negative effects. By the way for girls it's much easier they have like 30 matches at any time so you can always download your own app have a few sexy pics and watch the matches come in. I'm not condoning this type of thing but you can always fight fire with fire. It's very ugly. Show him your matches that will make him think twice and delete your apps together. Good luck you sound like a decent girl rather find someone who you trust unconditionally. Damn you smartphones :) ",
            "date": "Answered May 23, 2017",
            "views": "56",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gretchen Conley",
                    "user_href": "/profile/Gretchen-Conley-1"
                },
                {
                    "user_id": "Patti Edwards",
                    "user_href": "/profile/Patti-Edwards-3"
                },
                {
                    "user_id": "Taylor Davis",
                    "user_href": "/profile/Taylor-Davis-436"
                },
                {
                    "user_id": "Mer Fay",
                    "user_href": "/profile/Mer-Fay"
                },
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Karen Hall",
                    "user_href": "/profile/Karen-Hall-214"
                },
                {
                    "user_id": "Callie Heath",
                    "user_href": "/profile/Callie-Heath-9"
                },
                {
                    "user_id": "Annemarie Gillespie",
                    "user_href": "/profile/Annemarie-Gillespie-2"
                },
                {
                    "user_id": "Dawn Knight",
                    "user_href": "/profile/Dawn-Knight-28"
                },
                {
                    "user_id": "Divya Karke",
                    "user_href": "/profile/Divya-Karke-1"
                },
                {
                    "user_id": "Kelly Cox",
                    "user_href": "/profile/Kelly-Cox-196"
                },
                {
                    "user_id": "Daniel Klyne",
                    "user_href": "/profile/Daniel-Klyne"
                },
                {
                    "user_id": "Sandra Spencer",
                    "user_href": "/profile/Sandra-Spencer-51"
                },
                {
                    "user_id": "Make It a Good day Regardless",
                    "user_href": "/profile/Make-It-a-Good-day-Regardless"
                },
                {
                    "user_id": "Michele Craft",
                    "user_href": "/profile/Michele-Craft"
                },
                {
                    "user_id": "Julia Yang",
                    "user_href": "/profile/Julia-Yang-7"
                },
                {
                    "user_id": "Cynthia Michelle Hollis",
                    "user_href": "/profile/Cynthia-Michelle-Hollis"
                },
                {
                    "user_id": "Kareena Kapoor",
                    "user_href": "/profile/Kareena-Kapoor-34"
                },
                {
                    "user_id": "Cel Park",
                    "user_href": "/profile/Cel-Park"
                },
                {
                    "user_id": "Jess Rowles",
                    "user_href": "/profile/Jess-Rowles"
                },
                {
                    "user_id": "Robert Nace",
                    "user_href": "/profile/Robert-Nace-6"
                },
                {
                    "user_id": "Tony Dijak",
                    "user_href": "/profile/Tony-Dijak"
                },
                {
                    "user_id": "Theresa Shepard",
                    "user_href": "/profile/Theresa-Shepard-4"
                },
                {
                    "user_id": "Sandra Hicks",
                    "user_href": "/profile/Sandra-Hicks-25"
                },
                {
                    "user_id": "Bebe Bebe",
                    "user_href": "/profile/Bebe-Bebe-82"
                },
                {
                    "user_id": "Moira Swanson",
                    "user_href": "/profile/Moira-Swanson-1"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Chaty Baby",
                    "user_href": "/profile/Chaty-Baby"
                },
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                },
                {
                    "user_id": "Dixie Williams",
                    "user_href": "/profile/Dixie-Williams-22"
                },
                {
                    "user_id": "Molly M",
                    "user_href": "/profile/Molly-M-169"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/BARBARA-Buenger"
                },
                {
                    "user_id": "Karla Baričević",
                    "user_href": "/profile/Karla-Baričević-2"
                },
                {
                    "user_id": "John Byer",
                    "user_href": "/profile/John-Byer-14"
                },
                {
                    "user_id": "Jolaine Jasso",
                    "user_href": "/profile/Jolaine-Jasso"
                },
                {
                    "user_id": "Jennifer Carbonel (Figueroa)",
                    "user_href": "/profile/Jennifer-Carbonel-Figueroa"
                },
                {
                    "user_id": "Brittney Deines",
                    "user_href": "/profile/Brittney-Deines"
                },
                {
                    "user_id": "Leann Saunders",
                    "user_href": "/profile/Leann-Saunders-1"
                },
                {
                    "user_id": "Krazi Crystal is Me",
                    "user_href": "/profile/Krazi-Crystal-is-Me"
                },
                {
                    "user_id": "Melissa Bumann",
                    "user_href": "/profile/Melissa-Bumann"
                },
                {
                    "user_id": "John James Maher Iv",
                    "user_href": "/profile/John-James-Maher-Iv"
                },
                {
                    "user_id": "Kristen Chiumento",
                    "user_href": "/profile/Kristen-Chiumento"
                },
                {
                    "user_id": "Kemberly Ornopia",
                    "user_href": "/profile/Kemberly-Ornopia"
                },
                {
                    "user_id": "McKenzie Gagnon",
                    "user_href": "/profile/McKenzie-Gagnon"
                },
                {
                    "user_id": "Chelsea Johnston",
                    "user_href": "/profile/Chelsea-Johnston-22"
                },
                {
                    "user_id": "Saumya Ghildiyal",
                    "user_href": "/profile/Saumya-Ghildiyal"
                },
                {
                    "user_id": "Chauntelle Russell",
                    "user_href": "/profile/Chauntelle-Russell"
                },
                {
                    "user_id": "Deborah Frias",
                    "user_href": "/profile/Deborah-Frias-1"
                },
                {
                    "user_id": "Ashley Flores",
                    "user_href": "/profile/Ashley-Flores-205"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Yang",
                "href": "/profile/Anna-Yang-72"
            },
            "answer_text": "If your wife is on dating sites maybe that means she don’t love you any more. There are some signs.1. Gut instinct Your at this site for a reason. And unfortunately it's one of the signs that your wife is getting more distant from you 2. You have to clean up after yourself I know it's old fashioned but women tend to care more about cleanliness than men. So when she stops caring about that, it's a sign she's stopped caring about your marriage 3. She doesn't seem to really care that much You start to notice that any issues you are facing she's not interested in. For example; when you begin to feel under the weather, once she might have suggested you stay in bed and made you meals. Now she hasn't even asked you about it. 4. Physically distant – no kissing, hugging etc. If your wife is hesitant to hug or kiss you then this is a sign. To be honest this can be a little late as this is one of the latter things (in her mind) that she will withdraw from. 5. She doesn't initiate anything, ever If you find that she isn't organizing anything new in your family then she's losing interest 6. She stops telling about her day and her life Wive's love to use their husbands as a sounding board. To talk and get things off their chests… If she starts withholding this information then this is a sign 7. Lack of face time A loving wife loves face time because it shows her that you care about her. If she's seems not that interested in sharing time with you and would rather be on her phone/tablet, talking with friends or out doing something else then this is cause for concern 8. Guilt trips Do you feel guilty about going out, even to work? If when your leaving your wife and she is in an unhappy mood this can trigger things. This is a sign 9. Sketchy behavior Have you started to notice that your wife has a new ‘private life' that you don't have access too? This includes new email accounts, deleting history from devices, phone calls from numbers you don't know and even a second phone? 10. New wife Is your wife doing things she has never done before, or hasn't done in a while? I.e. joining the gym or buying a style of clothes that she hasn't worn in ages… maybe even new circles of friends? ",
            "date": "Answered May 15, 2017",
            "views": "175",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Avahan Masih",
                    "user_href": "/profile/Avahan-Masih-2"
                },
                {
                    "user_id": "Gretchen Conley",
                    "user_href": "/profile/Gretchen-Conley-1"
                },
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Gary Ornelas",
                    "user_href": "/profile/Gary-Ornelas-3"
                },
                {
                    "user_id": "Carolyn Rutherford",
                    "user_href": "/profile/Carolyn-Rutherford-10"
                },
                {
                    "user_id": "Annemarie Gillespie",
                    "user_href": "/profile/Annemarie-Gillespie-2"
                },
                {
                    "user_id": "Ashley Dodson",
                    "user_href": "/profile/Ashley-Dodson-32"
                },
                {
                    "user_id": "Chauntelle Russell",
                    "user_href": "/profile/Chauntelle-Russell"
                },
                {
                    "user_id": "Mary Blanchard",
                    "user_href": "/profile/Mary-Blanchard"
                },
                {
                    "user_id": "Deb Elwell",
                    "user_href": "/profile/Deb-Elwell"
                },
                {
                    "user_id": "Lily Haverlah",
                    "user_href": "/profile/Lily-Haverlah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ari Lion",
                "href": "/profile/Ari-Lion-1"
            },
            "answer_text": "If you were in a reasonably healthy relationship, the best way to find out anything about your husband would be asking him directly. Because you’re asking the internet instead, it seems like you don’t trust him and don’t feel like asking is going to result in a truthful or safe response. You could do all sorts of snooping to try to find out if your husband is using a secret email address and an assumed name on dating sites, but it won’t alleviate your pain or distrust. If you find nothing, will you believe he isn’t cheating or will you believe, instead, that you haven’t look hard enough? If snooping confirms your suspicions what will you do next? If you really think your husband is using a fake name and a secret email address to go on dating websites, why don’t you simply assume it’s true and take the next step, whatever that is? If you had proof, would you insist he stop cheating or would you file for divorce? Would you expose him to his family and yours? Would you set up your own secret dating profile as a weird way to even things up? If you believe he’s a duplicitous sneak, are you willing to be a duplicitous sneak to prove it to yourself? Implicit in your question is the insecurity you feel in your relationship. Don’t drive yourself crazy looking for evidence that your insecurity isn’t paranoia. Ask yourself instead if you’re willing to remain in a relationship in which you’re so deeply insecure, if you’re not just waiting around for him to leave you, or if you’re okay becoming the kind of person who feels the need to play detective and cop with her husband. ",
            "date": "Answered January 29, 2018",
            "views": "281",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shannon Adams Haynes",
                    "user_href": "/profile/Shannon-Adams-Haynes"
                },
                {
                    "user_id": "Gigi Carmichael",
                    "user_href": "/profile/Gigi-Carmichael-2"
                },
                {
                    "user_id": "Jennifer Odell",
                    "user_href": "/profile/Jennifer-Odell-31"
                },
                {
                    "user_id": "Paul King",
                    "user_href": "/profile/Paul-King-198"
                },
                {
                    "user_id": "Zombie Jerry",
                    "user_href": "/profile/Zombie-Jerry-1"
                },
                {
                    "user_id": "Teresa Lynn Smith",
                    "user_href": "/profile/Teresa-Lynn-Smith-1"
                },
                {
                    "user_id": "Yves Leroy",
                    "user_href": "/profile/Yves-Leroy-3"
                },
                {
                    "user_id": "Kay Priest",
                    "user_href": "/profile/Kay-Priest-2"
                },
                {
                    "user_id": "Veronica Greer",
                    "user_href": "/profile/Veronica-Greer-3"
                },
                {
                    "user_id": "Kathy Pierson",
                    "user_href": "/profile/Kathy-Pierson-6"
                },
                {
                    "user_id": "Cindy Dillinger Booth",
                    "user_href": "/profile/Cindy-Dillinger-Booth"
                },
                {
                    "user_id": "Allan Kearney",
                    "user_href": "/profile/Allan-Kearney"
                },
                {
                    "user_id": "Terrilee Bolton",
                    "user_href": "/profile/Terrilee-Bolton"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Destinee Russell",
                    "user_href": "/profile/Destinee-Russell"
                },
                {
                    "user_id": "Mohamed El Sharawy",
                    "user_href": "/profile/Mohamed-El-Sharawy"
                },
                {
                    "user_id": "Bryan Dehn",
                    "user_href": "/profile/Bryan-Dehn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teodor Stankovic",
                "href": "/profile/Teodor-Stankovic-1"
            },
            "answer_text": "I really haven’t been in that situation, so I had to google some things around and I can say that I’ve found pretty impressive stuff. How to find out if someone is on a dating site 1. Create an online dating profile “I did not have to do that in my case as I didn’t suspect anything and my friend had come across his profile by pure chance. Nevertheless, not everyone is going to be as lucky as me. If you feel like something is different in your partner’s behavior, you might want to create a fake online dating profile and see if you can spot them on there.” 2. Change your information  “Don’t use your own photo, age, appearance features, or any other information that might lead him to that it is you. Many online dating sites allow the users to know who viewed their profile. You don’t want them to find out that you have been checking up on him. Be creative and change your information as much as possible. Don’t forget to also change your profession, education, personality traits, goals and other.” 3. Check the browsing history  “Another way on how to find out if someone is registered on a dating site is to check the browsing history. If you and your partner share a computer or any other device, you can check the browsing history and see what comes up. While a lot of people tend to delete their browsing history when they are hiding something, there is a chance they could have forgotten to do so. It is not a very reliable method, as your partner most likely would delete the history after being on the online dating site. However, if they did not erase it, you will have all the proof you need right there. Don’t try to access the device that does not belong to you as this is an illegal activity. These things are enough to help you out. I think that I’ve been of help somehow. ",
            "date": "Answered June 28, 2018",
            "views": "191",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samantha Smith",
                    "user_href": "/profile/Samantha-Smith-1767"
                },
                {
                    "user_id": "Lori Keller",
                    "user_href": "/profile/Lori-Keller-11"
                },
                {
                    "user_id": "Kemberly Ornopia",
                    "user_href": "/profile/Kemberly-Ornopia"
                },
                {
                    "user_id": "Deb Davidson",
                    "user_href": "/profile/Deb-Davidson-5"
                },
                {
                    "user_id": "Revkah Kordel",
                    "user_href": "/profile/Revkah-Kordel"
                },
                {
                    "user_id": "Kalvin Bob",
                    "user_href": "/profile/Kalvin-Bob"
                },
                {
                    "user_id": "Wenda Manuel",
                    "user_href": "/profile/Wenda-Manuel"
                },
                {
                    "user_id": "Kathrine Almiron",
                    "user_href": "/profile/Kathrine-Almiron"
                },
                {
                    "user_id": "Deanna Mola",
                    "user_href": "/profile/Deanna-Mola"
                },
                {
                    "user_id": "Agosto Burden",
                    "user_href": "/profile/Agosto-Burden"
                },
                {
                    "user_id": "Valene Lehar",
                    "user_href": "/profile/Valene-Lehar"
                },
                {
                    "user_id": "Louella Feiler",
                    "user_href": "/profile/Louella-Feiler"
                },
                {
                    "user_id": "Hattie Mazzone",
                    "user_href": "/profile/Hattie-Mazzone"
                },
                {
                    "user_id": "Mauricio Canavan",
                    "user_href": "/profile/Mauricio-Canavan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debbie Leigh",
                "href": "/profile/Debbie-Leigh-16"
            },
            "answer_text": "I can only share with you from my personal experience and friends experiences they shared with me. Maybe this can help you. I noticed a lot of concealment. Whether it be on the phone, laptop etc.. - changing logins or passwords. When before it was never a issue. Too much time spent. Spending so much more time on the phone, hearing more than usual amount of text messages coming in. Walking away for more private conversations. On the computer messaging for long periods of time. Sound of voice. Arguing for no apparent reason and it not making sense. Blaming things more on me. Having an “I don’t care” attitude. Remembering. Can’t remember where they were at. Saying one thing, when they said another earlier. Lying all of a sudden. Making up stories. Final nail in coffin. Friends on dating site seeing their picture and profile. Creating a fake profile and interacting with them. A friend did this and went looking for him and found him. I hope and pray you don’t find out there is something going on. I am hoping it’s an issue with one self. Where your partner is struggling on who they are. For you to go through this, can be devastating, to say the least. You must feel there is something wrong, the best thing you can do is to ask the person, if they are not happy anymore. Maybe you can strike up a conversation and your worries can be out on the table. That would be the healthiest way for you both. See how he reacts. Maybe that will stop the person, before they do something wrong that they will regret. Another way is to pay for spy apps. Just be careful when choosing this way it can cost your relationship and /or may be illegal. Read all about the spy apps prior to purchase. Good Luck ",
            "date": "Answered January 16, 2019",
            "views": "106",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Gary Ornelas",
                    "user_href": "/profile/Gary-Ornelas-3"
                },
                {
                    "user_id": "Julie Elisa Varghese",
                    "user_href": "/profile/Julie-Elisa-Varghese"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Geerligs",
                "href": "/profile/Nathan-Geerligs"
            },
            "answer_text": "You can’t. At least, not without committing a federal crime. The only definitive way to determine whether she is on any dating site would be to get into her phone or computer, and check her internet browser history. However if you do this, especially without her knowledge or permission, and you get caught, you could be facing up to 20 years in prison and a fine $15 000 (in Canada). Therefore it is far better to just trust her, if she tells you she isn’t on a dating site, believe her. And if you don’t trust her, then the relationship is already over, because cannot work without trust. And even if she is on a dating site there is nothing you can do about it. Unless you have the time and money to constantly monitor her internet use (and even if you do, DON’T) she will find an opportunity to go on it. Therefore it is up to you to determine how you would want to deal with it. If you decide that you don’t like your girlfriend going on a dating site, then you break up with her. Or, you could you try to be secure in your relationship, know that going on a dating site doesn’t necessarily mean she’s cheating on you, that if she doesn’t want to be with you, then she would have already left the relationship, and that she does have the right to leave the relationship at any time she wishes, and there’s nothing you can do about it. Don’t worry about things you can’t control, all you should worry about is being the kind of guy she doesn’t want to leave, and build the kind of relationship she doesn’t want to leave, either. Good luck ",
            "date": "Answered December 1, 2017",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shannon Kelsay",
                    "user_href": "/profile/Shannon-Kelsay-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hayden Jiggins",
                "href": "/profile/Hayden-Jiggins"
            },
            "answer_text": "By using the phrase, “other dating sites”, are you implying that there exists a list of dating websites he is allowed to be on , or did you mean to say “How do I find out if my boyfriend is using dating websites?” If you did actually mean the former, then you may also want to consider the fact that your boyfriend may also be the boyfriend of others as well. If you are OK with this, then I am unsure why him being on other websites would be more bothersome than this fact. If you actually meant the latter, which makes more sense to me, then there is somethings you can do to discern if he is on other sites. But before you begin, ask yourself why you suspect that he is, and if you have any real reason for that assumption. Once you begin down the path of mistrust and suspecting cheating, it is an arduous, if not impossible task for the relationship to continue. Tread carefully. If curiosity does get the better of you, download some of the more common apps, set the search radius to <1km and swipe through, provided of course that he is within that search radius himself. It is common to use fake names in scenarios like these, so you’ll have to be paying attention. Not on any of these apps? Try other sites. Remember this: don’t let your insecurities ruin your relationship. Make sure you have good reason to suspect this is occurring before you proceed. The more you feed it, and the slower you act, the deeper the mistrust grows. Nip it before it ruins everything. ",
            "date": "Answered January 22, 2018",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Bradford",
                "href": "/profile/Mark-Bradford-25"
            },
            "answer_text": "This is one of those questions that has an obvious answer and generates an even more important question…  Answer: Ask them. Follow Up Question: Why don’t you ask them? Why did you think it was a better idea to ask a q&a forum vs. just asking them? Are they that hard to talk to? Would you not trust their answer? If not, why. My crystal ball says you will answer my questions with the following: “I have asked them, I brought it up because I suspect they are on dating sites. They just brushed it off and said “of course not” and if I try to bring it up again they get angry with me.” The bottom line: You don’t trust them. Short of them sharing all of their passwords on their computer and phone with you, and you searching dating sites you will never know. That’s what trust is all about. Why don’t you trust them? Two possible reasons: Because they are just untrustworthy, and have done things to betray your trust in the past. You already caught them with a rofile when they said they didn’t have one. Suggestion: Break up now. It doesn’t ever get any better, it just gets worse and you deserve the same level of trust/respect that you are giving.Because you see the world s you behave. You yourself are a bit paranoid and untrustworthy. You put yourself in their shoes and you see that you would cheat and be secretive. Suggestion: Break up now, get over these trust issues, love yourself and then give that new person to the next relationship and you won’t have to ask a forum about stuff like this again.",
            "date": "Answered May 16, 2017",
            "views": "102",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gigi Carmichael",
                    "user_href": "/profile/Gigi-Carmichael-2"
                },
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Jennifer Johnson",
                    "user_href": "/profile/Jennifer-Johnson-1154"
                },
                {
                    "user_id": "Carolyn Rutherford",
                    "user_href": "/profile/Carolyn-Rutherford-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Hillebrand",
                "href": "/profile/Julia-Hillebrand-1"
            },
            "answer_text": "Is he/ sheon the computer a lot, or on his smart phone a lot? Does it appear that he / she is gettin a lot of emails that he/ she is afraid that you might see? Is a bit different and distant and not paying attention to you as you are no longer the center of his/ her attention and affection? Does he / she sort of I directly make comments that may appears as he /she’s is comparing you to someone else? He / she would appear just as someone who is physically enamoured with another or other women physically and in person. Sort of like he/ she stands you up for something you two planned to do because he / she has something else to do or a business meeting. Is he / she more secretive and cautious when speaking than usually and distant with you. Always having to do something else. He / she hides his credit card statements as the bill for the dating site would appear on it Even careful about snail mail as if one of his / her “dates may have his / her physical address He / she may be chatting up one of his / her friends and when you come along he / she claims up. He / she “ spruces “ up more. Has more selfies with his /her very well groomed and well dressed appearance on his smart phone g that he / she hide ",
            "date": "Answered January 16, 2019",
            "views": "52",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Williams",
                    "user_href": "/profile/Kevin-Williams-1010"
                },
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul King",
                "href": "/profile/Paul-King-198"
            },
            "answer_text": "You don’t need to find out if they are using dating sites. If you are suspicious enough to be searching for ways to find out, the trust is dead. Either your partner is innocent and you don’t trust them, or they aren’t. Either way, the relationship is damaged. Either you catch them, or you continue to doubt. Conflict and suspicion are exciting and in their own way “fun”. You choose to keep participating in that cycle. You can do this drama, or you can have a trusting honest relationship. You can’t have both. And by the way, sometimes honesty is difficult. What if the truth is “sometimes I install tinder and look at people, then I feel guilty and delete the app”? That’s pretty common. It’s sad. It’s full of sadness and unmet needs and stuff they could spend hours talking to a therapist about. It’s also true and real, and something you could talk about and use to figure out how to be happier. If you can be honest and look past the surface reaction. ",
            "date": "Answered January 10, 2020",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Weliemsf Samkdt",
                    "user_href": "/profile/Weliemsf-Samkdt"
                },
                {
                    "user_id": "Tiphanie Brooke",
                    "user_href": "/profile/Tiphanie-Brooke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronin Eternales",
                "href": "/profile/Ronin-Eternales"
            },
            "answer_text": "You can find out what sites he is visiting without snooping around on your husband’s phone or computer, or trolling online dating sites. Turn on the logging of your cable modem or wireless router. The logs in the modem/router probably show an internet protocol address. It will look something like: “123.123.123.123”. You can take that address and paste it right in to your browser, and it will resolve to the site. Try this - 129.42.38.10 (That’s IBM.) This is likely to work even if he is using his phone, since most people use their wireless connection to connect their smartphones to the internet when at home (saves data charges). In some cases the IP might not resolve because there is more than one website at that particular address. That is common in small sites. However, a popular dating site will have its own address. ",
            "date": "Answered January 2, 2018",
            "views": "497",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "LEAH Hill",
                    "user_href": "/profile/LEAH-Hill-11"
                },
                {
                    "user_id": "Jessica Ganga",
                    "user_href": "/profile/Jessica-Ganga"
                },
                {
                    "user_id": "Vb Lowthorps",
                    "user_href": "/profile/Vb-Lowthorps"
                },
                {
                    "user_id": "Shelby McCarty",
                    "user_href": "/profile/Shelby-McCarty-6"
                },
                {
                    "user_id": "Kim Bremer",
                    "user_href": "/profile/Kim-Bremer-8"
                },
                {
                    "user_id": "Ivana Jasak",
                    "user_href": "/profile/Ivana-Jasak"
                },
                {
                    "user_id": "Kirsty",
                    "user_href": "/profile/Kirsty-107"
                },
                {
                    "user_id": "Shel McCarty",
                    "user_href": "/profile/Shel-McCarty"
                },
                {
                    "user_id": "Moira Swanson",
                    "user_href": "/profile/Moira-Swanson-1"
                },
                {
                    "user_id": "Julie Elisa Varghese",
                    "user_href": "/profile/Julie-Elisa-Varghese"
                },
                {
                    "user_id": "Melissa Pascall",
                    "user_href": "/profile/Melissa-Pascall"
                },
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                },
                {
                    "user_id": "Dixie Williams",
                    "user_href": "/profile/Dixie-Williams-22"
                },
                {
                    "user_id": "Jennifer Sewell",
                    "user_href": "/profile/Jennifer-Sewell-9"
                },
                {
                    "user_id": "Sadie Fletcher",
                    "user_href": "/profile/Sadie-Fletcher-7"
                },
                {
                    "user_id": "Brandy Watkins",
                    "user_href": "/profile/Brandy-Watkins-10"
                },
                {
                    "user_id": "KO",
                    "user_href": "/profile/KO-142"
                },
                {
                    "user_id": "Karen Sanders",
                    "user_href": "/profile/Karen-Sanders-127"
                },
                {
                    "user_id": "Megan Fox",
                    "user_href": "/profile/Megan-Fox-3"
                },
                {
                    "user_id": "Amy Connelly",
                    "user_href": "/profile/Amy-Connelly-5"
                },
                {
                    "user_id": "Samantha Taylor",
                    "user_href": "/profile/Samantha-Taylor-660"
                },
                {
                    "user_id": "Lisa Jordan",
                    "user_href": "/profile/Lisa-Jordan-225"
                },
                {
                    "user_id": "Traci A Cantwell",
                    "user_href": "/profile/Traci-A-Cantwell"
                },
                {
                    "user_id": "Kevin Rhinehart",
                    "user_href": "/profile/Kevin-Rhinehart"
                },
                {
                    "user_id": "Blevin Fox",
                    "user_href": "/profile/Blevin-Fox"
                },
                {
                    "user_id": "Angela Pyle",
                    "user_href": "/profile/Angela-Pyle-7"
                },
                {
                    "user_id": "Ee Whitey",
                    "user_href": "/profile/Ee-Whitey"
                },
                {
                    "user_id": "Chris Cooper",
                    "user_href": "/profile/Chris-Cooper-565"
                },
                {
                    "user_id": "S Black",
                    "user_href": "/profile/S-Black-28"
                },
                {
                    "user_id": "Kimberly L Magee",
                    "user_href": "/profile/Kimberly-L-Magee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seb Lo",
                "href": "/profile/Seb-Lo"
            },
            "answer_text": "Option 1: Ask her. If you have the kind of relationship where you are honest with each other,  this is the fastest and easiest.  The downside: Suppose you ask and she says \"no I don't have an account. No matter whether she's lying or not, you've made the relationship weaker because she knows you don't trust her. If she lied then you still don't know. Suppose she says, \"yes I do\",  depending on what she uses it for,  you may be going down the road of splitting up (which might not necessarily be a bad thing).  Option 2:Find the account. Either see the app on her phone or find the account using a fake account and putting in all her attributes. This can be a huge time sink and might make you seem paranoid/untrusting. If you find the account,  then you know,  but if you don't find the account,  either it doesn't exist or you didn't look hard enough.  Option 3: Don't do anything. If she's using tinder to hook up,  you'll find out after a little while anyway. She'll slip up, especially if you're looking out for odd behavior. ",
            "date": "Answered March 22, 2016",
            "views": "133",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Moira Swanson",
                    "user_href": "/profile/Moira-Swanson"
                },
                {
                    "user_id": "Kareena Kapoor",
                    "user_href": "/profile/Kareena-Kapoor-34"
                },
                {
                    "user_id": "Tiphanie Brooke",
                    "user_href": "/profile/Tiphanie-Brooke"
                },
                {
                    "user_id": "David Wells",
                    "user_href": "/profile/David-Wells-92"
                },
                {
                    "user_id": "Staci Allen",
                    "user_href": "/profile/Staci-Allen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Buster Smith",
                "href": "/profile/Buster-Ecks"
            },
            "answer_text": "The same way you find ANY profile…Start by Google Image searching some of his pictures. Often the profile picture used on social networking websites are used on dating sites as well, so start with that/those. Next, try searching his email address. The average person has 3 email addresses; 1 primary (Barbie_NaughtyPrincessXxX), one secondary for professional reasons (John_Smith), and one for spam (Tom_doe_spam123). So search his email address(es) on Google as well as other search platforms to see what pops up. Beyond that, you’d going to have to create an account and manually search through these sites to find him. If this is a mobile dating app, things can be a bit harder. Though you often have to link your the dating app to a social networking profile, these apps generally do not have a search or ‘find my friends’ feature. So you’ll have to toil through profile after profile to find him. Of course if he happens to see your profile first, this can be in vain if he blocks you before you have a chance to run into him. In short, there are methods, but at the same time there’s quite a bit of discouragement. There are a lot of dating sites and apps out there and this could turn into days or even weeks of searching and still you could come back with nothing. ",
            "date": "Answered May 23, 2016",
            "views": "385",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "LEAH Hill",
                    "user_href": "/profile/LEAH-Hill-11"
                },
                {
                    "user_id": "Maia Medena",
                    "user_href": "/profile/Maia-Medena"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Ajas Mohamed",
                    "user_href": "/profile/Ajas-Mohamed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Baffoe-Djan",
                "href": "/profile/Richard-Baffoe-Djan"
            },
            "answer_text": "First.  Just ask. If he is, discuss and if he is... work out new arrangements and boundaries.  If he's not, work harder in your relationship to ensure that there's no incentive to want to signup to a dating site. Job done...almost  Keyloggers and trackers can work to an extent use wisely. However it's a solution to a perceived problem.Typing an email address and random password into the login screen of some dating sites can produce false positives such as 'Your Password is incorrect' instead of 'Your username and password are invalid' This could give an indication that he may have possibly signed up.Check his email. Then use the forget password feature and reset the password.What I've found from experience, by being cheated on and being accused of cheating is that the best thing to do is assume he is on a dating site and don't get hung up about it.  Sometimes the effort of trying to find out outweighs the fact that you could just end the relationship and move on. ",
            "date": "Answered October 13, 2015",
            "views": "30",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "DANI HUTOMO",
                    "user_href": "/profile/DANI-HUTOMO"
                },
                {
                    "user_id": "Lisa Gorog",
                    "user_href": "/profile/Lisa-Gorog-1"
                },
                {
                    "user_id": "Amber Coffman",
                    "user_href": "/profile/Amber-Coffman-16"
                },
                {
                    "user_id": "Bebe Bebe",
                    "user_href": "/profile/Bebe-Bebe-82"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Natalie Moore",
                    "user_href": "/profile/Natalie-Moore-289"
                },
                {
                    "user_id": "Jolaine Jasso",
                    "user_href": "/profile/Jolaine-Jasso"
                },
                {
                    "user_id": "KO",
                    "user_href": "/profile/KO-142"
                },
                {
                    "user_id": "Evie Kekic",
                    "user_href": "/profile/Evie-Kekic-1"
                },
                {
                    "user_id": "Noah Goldsmith",
                    "user_href": "/profile/Noah-Goldsmith-7"
                },
                {
                    "user_id": "Krazi Crystal is Me",
                    "user_href": "/profile/Krazi-Crystal-is-Me"
                },
                {
                    "user_id": "Brandy Moore",
                    "user_href": "/profile/Brandy-Moore-11"
                },
                {
                    "user_id": "Melissa Priddle",
                    "user_href": "/profile/Melissa-Priddle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehran April",
                "href": "/profile/Mehran-April"
            },
            "answer_text": "There are 100 answers so this might be a duplicate. If you’re suspicious, then you might as well search too, just in case you're right. Right? So select a couple of major dating sites in your area start by your zip code or whatever More than likely the person is going to give the closest description, so try to narrow your partner’s description in the search box of the dating site; female, 28–38, tall, whatever The search results will not be that huge If you see a candidate but no photos, copy and paste the username in google If no results, try the image search If no results, try adding your city to the username If no answer try searching a free site like plentyOfFish and see if you can get the username You can always check browser history but you technically need permission from the person. ",
            "date": "Answered September 27, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reese Karns",
                "href": "/profile/Reese-Karns"
            },
            "answer_text": "You can go on every dating site you can think of and look for him. But then you're using dating sites. And if you find him, you can't know for sure what he's really doing there or even if it's really him, could be someone using his pictures for whatever reason. I say don't waste your time. The problem with trying to find evidence of cheating is that not finding evidence isn't going to make your distrust go away. It's just going to make you think that sneaky bastard is sneakier than you thought and you'll just keep wasting more of your time looking for the smoking gun and driving yourself insane. You're never going to know for sure so just assume you would have found something and do whatever you would do if you did. Sometimes you get a feeling and you're right. Sometimes you're wrong. But if you don't trust someone, you can't help it. And being in a relationship with someone you don't trust is awful. ",
            "date": "Answered February 14, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wylie Krenke",
                    "user_href": "/profile/Wylie-Krenke"
                },
                {
                    "user_id": "Erica Johnson",
                    "user_href": "/profile/Erica-Johnson-181"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Charlotte Freeman",
                    "user_href": "/profile/Charlotte-Freeman-12"
                },
                {
                    "user_id": "Courtney Romeo",
                    "user_href": "/profile/Courtney-Romeo-1"
                },
                {
                    "user_id": "Deb Elwell",
                    "user_href": "/profile/Deb-Elwell"
                },
                {
                    "user_id": "Aaron Lassig",
                    "user_href": "/profile/Aaron-Lassig"
                },
                {
                    "user_id": "Holly Curtis",
                    "user_href": "/profile/Holly-Curtis"
                },
                {
                    "user_id": "Andrew Korf",
                    "user_href": "/profile/Andrew-Korf"
                },
                {
                    "user_id": "Gene Zhang",
                    "user_href": "/profile/Gene-Zhang-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anas Maassarani",
                "href": "/profile/Anas-Maassarani"
            },
            "answer_text": "Ask him! If you can’t… That’s a red flag right there. But, since you did ask: If you have access to his computer, you could check browsing history.Ask to use his phone to call your “lost” phone and frantically search for dating apps. I mean… Since you can’t ask straight…Dating sites lead to… well… dates! Is he going out at random times for 2–3 hours to “hang out with buddies”. The more details he gives you, the more suspicious this is.Note if he is just having fun on dating sites without going further (as in out on dates), you got nothing to worry about. Even if he is, you actually have a GREAT reason to let him be; women on those sites are CRAZY! He will get rejected so many times for absolutely nothing that he will run back into your arms and never leave! I can’t get this question out of my head though: There is no trust in the relationship, so why are you in it? ",
            "date": "Answered June 1, 2017",
            "views": "108",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eaue Whitey",
                    "user_href": "/profile/Eaue-Whitey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cesar Windmill",
                "href": "/profile/Cesar-Windmill"
            },
            "answer_text": "Actually, if you just want to find out if he’s using it, you just need a trustworthy friend to subscribe for you on your phone. There’s no need to match, just swiping at close range is enough to find him. If you want to “set a trap” and interact with him like if you are a random girl, you need a fake profile. BUT. There is a great but. If he’s not completely stupid he’s not there with his real face and his real name. The picture can be sort of hidden (sunglasses, face half covered, etc.) or can be a generic picture (I rarely used my face on a profile pic and discovered that some women automatically assumed a I was a sneaky married guy - Because they found many!). Even age can be faked, if you know how. In this case, he might be in there but you actually can’t find him, unless you MATCH and decide to meet in real life and it’s really him. But what if you have matches to investigate and HE finds you on Tinder and he’s actually not? ",
            "date": "Answered January 18, 2019",
            "views": "57",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Simone Willan",
                    "user_href": "/profile/Simone-Willan"
                },
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                },
                {
                    "user_id": "A Perkins",
                    "user_href": "/profile/A-Perkins-10"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Staci Allen",
                    "user_href": "/profile/Staci-Allen-10"
                },
                {
                    "user_id": "Marija Mikaela",
                    "user_href": "/profile/Marija-Mikaela"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Lara Jonny",
                    "user_href": "/profile/Lara-Jonny"
                },
                {
                    "user_id": "Deb Elwell",
                    "user_href": "/profile/Deb-Elwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Heba Kerdany",
                "href": "/profile/Heba-Kerdany"
            },
            "answer_text": "I have been there once with an ex, I found him on all dating web. I felt stupid and ashamed to have searched him. I promised myself never to degrade myself this way again, I didn’t trust him and I was right. So I decided to trust my instinct instead of that sharade. A piece of advice, Never waste your mental and emotional energy stalking and spying on your husband. This is so degrading and self humiliating. If you're that uncomfortable with him; 1) Either you're right and he's cheating. or 2) You're wrong and your feelings comes from your insecurity issues. In case of 1; you don't need proof (it's just the inner voice of Gotcha I was right and I got proof). So if you can see the change then trust your instinct and leave. Save yourself a long path of self degrading just to for the sake of saying I'm right. In case of 2; get professional help to save yourself the self humiliation of spying on your husband. But women enjoy getting that proof to rub their husband's nose in his dirty act for other purposes like winning or bargaining or just putting him under the thumb. For me it's just dump the jerk who's consuming my energy with doubt and I'll be the winner. ",
            "date": "Updated June 27, 2019",
            "views": "76",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Weliemsf Samkdt",
                    "user_href": "/profile/Weliemsf-Samkdt"
                },
                {
                    "user_id": "Joany Sohayda",
                    "user_href": "/profile/Joany-Sohayda"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Webster Russell",
                "href": "/profile/Webster-Russell"
            },
            "answer_text": "Great question. There seems to be a hint of distrust there embedded. In your question. The easy answer is to look him straight in the eye and ask him. As a man I know we don't lie well. If when he answers he looks away from you and doesn't maintain eye contact, it's not good. He should be able to keep solid eye contact with you during his answer. Now take my answer with a grain of salt. I am old fashioned. If I am in a relationship I do not wander. I owe that to her if for no other reason than out of respect. After all we are both risking some thing very important. If the relationship is having problems let's talk it out without fluffing the problem. If it still doesn't seem to be fixable then we will agree to end it and both of us leave with honor. Notice I did not say without hurt. To keep this from occurring both men and women should figure out what they want, not need, and hold to those standards when looking for a relationship, I call them deal killers. If you find yourself smitten be sure to let him know your deal killers and that he understands them. He should also understand If they are violated its over. I am in a wonderful relationship with a terrific woman. We love and respect each other. We both have deal killers, I understand hers and she mine, and we both understand the consequences. ",
            "date": "Answered November 5, 2016",
            "views": "68",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anicole Resendez",
                    "user_href": "/profile/Anicole-Resendez"
                },
                {
                    "user_id": "Alex Beato",
                    "user_href": "/profile/Alex-Beato"
                },
                {
                    "user_id": "David Deyo",
                    "user_href": "/profile/David-Deyo-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Candice Alstar",
                "href": "/profile/Candice-Alstar"
            },
            "answer_text": "Well the short answer is ask him.  I think in relationships trust is very important, and if you have a feeling or if you think he might be on dating sites, you need to ask yourself why? Is this a \"you\" thing or a \"him\" thing.  If you've had bad experiences in past relationships regarding trust you need to look to the root of this problem and work on it yourself.  If your husband in the past has given you pause and you are considering this as an issue because it was in the past, then I think this is a bigger problem.  In either case this can be a serious issue if not taken care of, and this can corrode your relationship.  So instead of figuring out if he is on dating sites, once you've determined if the issue stems from you are him you can take appropriate action.  If it's your issues seek a certified therapist to discuss this with.  If it's him, you might want to have a dialogue with him and potentially you both should consider seeing a marriage counselor to help you settle this issue once and for all. Good Luck!  ",
            "date": "Answered February 9, 2016",
            "views": "54",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Weliemsf Samkdt",
                    "user_href": "/profile/Weliemsf-Samkdt"
                },
                {
                    "user_id": "Manish Anurag Nath",
                    "user_href": "/profile/Manish-Anurag-Nath"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Yanor",
                "href": "/profile/David-Yanor"
            },
            "answer_text": "For free, eh? Here’s what you can do with free sites like Plenty of Fish. First turn off your profile and make sure in the Settings section it’s adjusted so that when you look at a profile, the system won’t automatically add your photo to the rows of ladies who have Viewed Me. If you really want to do a little grey hat work, you can create a new, free profile, using photos found on someone’s profile in some faraway land. But strikingly beautiful, the kind of dream woman your boyfriend would flip over. It’s a test and a severe one, of trust and loyalty. If you’ve given your new profile his zip or postal code, you can do a search, with very narrow criteria, like his age and size and other criteria to pull up a small list of men who are within a few miles of him. There are other ways, more nefarious, to gain such intelligence about his online activities, but this one’s free and if it’s entrapment, he has no defence. ",
            "date": "Answered May 25, 2017",
            "views": "117",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Ann Adkins",
                    "user_href": "/profile/Melissa-Ann-Adkins-1"
                },
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                }
            ]
        },
        {
            "author_info": {
                "name": "E. Goco",
                "href": "/profile/E-Goco"
            },
            "answer_text": "There's a lot of ways , I will tell you how I found my ex boyfriend went back to the dating site we met. We have a long distance relationship and I know I can't see him all the time. But in truth he never tried to meet my family in nine months we know each other and be together when I get a chance to meet him . One day I travel all the way from New Jersey and as soon as we got together ate dinner and we are getting ready to sleep, accidentally he asked me to plug his cell phone and the next thing you know it pups in the screen of his phone you and beautiful lily silly agreed to meet each other. I took pictur of it and confront him about it, he lied and I SaI'd if you want to meet other women I would not stop you but you will never see my face again and sleep with you. So he said oh I called them I told th I'm discontinuing my subscription. I was never the same trust is extremely important to me that is the reason why I'm divorced two times. I walked away from my exhusband s because of cheating and lying. I lay down the riles on my boyfriend from the beginning. I made a decision after coming home from my dads funeral from the Philippines to walked away from him. ",
            "date": "Answered August 14, 2017",
            "views": "101",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sammy White",
                    "user_href": "/profile/Sammy-White-51"
                },
                {
                    "user_id": "Cheryl Latham",
                    "user_href": "/profile/Cheryl-Latham-5"
                },
                {
                    "user_id": "Nikki Frye",
                    "user_href": "/profile/Nikki-Frye-6"
                },
                {
                    "user_id": "Heather Hansen",
                    "user_href": "/profile/Heather-Hansen-176"
                },
                {
                    "user_id": "Daniel Hutcherson",
                    "user_href": "/profile/Daniel-Hutcherson-4"
                },
                {
                    "user_id": "SueAnn",
                    "user_href": "/profile/SueAnn"
                },
                {
                    "user_id": "Noah Goldsmith",
                    "user_href": "/profile/Noah-Goldsmith-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marie-Ella-14"
                },
                {
                    "user_id": "Isabel Castillo",
                    "user_href": "/profile/Isabel-Castillo-34"
                },
                {
                    "user_id": "Melissa Priddle",
                    "user_href": "/profile/Melissa-Priddle"
                },
                {
                    "user_id": "Kerry Goold",
                    "user_href": "/profile/Kerry-Goold"
                },
                {
                    "user_id": "Nacho Nomechinges",
                    "user_href": "/profile/Nacho-Nomechinges"
                },
                {
                    "user_id": "Rebecca Rives",
                    "user_href": "/profile/Rebecca-Rives"
                },
                {
                    "user_id": "Daisy",
                    "user_href": "/profile/Daisy-631"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helena Roman",
                "href": "/profile/Helena-Roman"
            },
            "answer_text": "Unless you’re a mind reader, she could be using many sites and it would be impossible to tell unless you broke the law and used an illegal spyware on her device(s.) If you trust yourself to make good decisions, which I’m sure you do, then you won’t have to worry about making the wrong decision about the partner you select. If you make good decisions, then you won’t have to worry about selecting someone who cheats. So, the 1st point is to trust yourself. Then ask yourself if you trust the girlfriend. If you do not trust the girlfriend, then you should end the relationship because you will never truly be happy. No spy app in the world will be able to quiet your concerns. Because when you’re looking for something, like cheating, you will surely find something; anything, that your mind will twist into cheating behavior due to lack of trust. This is called the Confirmation Bias. ",
            "date": "Answered June 2, 2017",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dagmara Dymczyk",
                    "user_href": "/profile/Dagmara-Dymczyk"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Holly Francis",
                    "user_href": "/profile/Holly-Francis-11"
                },
                {
                    "user_id": "Suzanne Lee",
                    "user_href": "/profile/Suzanne-Lee-33"
                },
                {
                    "user_id": "Ron Montney",
                    "user_href": "/profile/Ron-Montney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joyce Herron",
                "href": "/profile/Joyce-Herron"
            },
            "answer_text": "If he gives you full access to his phone, go and check. If you think he’ll understand and he’s open-minded, go ask him (although he might fake it and lie. But if he does admit he has - do NOT get mad, but be happy he is being honest with you. Just be casual and ask him why does he still have these profiles when he already has you. Trust me, things will get really bad the moment he knows your mad at him. Try to fake your anger as much as possible). If you think he’ll get mad for suspecting him, then you better not. Of course, you could do it manually, too. Get a fake profile and search for him! Or if you already have an existing profile, use that profile to check him - you’re just checking, anyways. Also, there’s a website here that lets you find out if your lover has any online dating accounts, go check it out: profilesearcher.com I have to say, this website is really advanced, and I hope it helps you. Good luck! ",
            "date": "Answered February 10, 2017",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kayee Tong",
                "href": "/profile/Kayee-Tong"
            },
            "answer_text": "Well just ask her if it's a problem. If there is no open communication the relationship isn't going to do the best in the long term. Simple. I wouldn't recommend snooping on her phone unless you want it to end badly. Women tend to attack you at your weakest point if you did something wrong to obtain the information. It's like oh you're not so good yourself, so I should be excused.  Keep yourself clean and document any physical evidence you can - through ethical means. If she is cheating, your efforts will not be wasted and she will eventually lose in the long run.  If you're really worried:1. Just look at the notification screen from your gf's phone more often.2. Just be wary of how she spends her time. If you have suspicion then:3. Ask your good friends who use Tinder to look out for her profile while they're Tindering. If she is cheating (assuming you're in a monogamous long term relationship), it'll eventually come out. Just have the mental preparation. ",
            "date": "Updated August 28, 2015",
            "views": "398",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Britney Kennedy",
                    "user_href": "/profile/Britney-Kennedy-7"
                },
                {
                    "user_id": "John Carney",
                    "user_href": "/profile/John-Carney-166"
                },
                {
                    "user_id": "Hettie Chambers",
                    "user_href": "/profile/Hettie-Chambers"
                },
                {
                    "user_id": "Julia Romero",
                    "user_href": "/profile/Julia-Romero-54"
                },
                {
                    "user_id": "Ruby Barrie",
                    "user_href": "/profile/Ruby-Barrie"
                },
                {
                    "user_id": "Liz Moonstar",
                    "user_href": "/profile/Liz-Moonstar"
                },
                {
                    "user_id": "Kawlin Dee",
                    "user_href": "/profile/Kawlin-Dee"
                },
                {
                    "user_id": "Cassandra Auerbach",
                    "user_href": "/profile/Cassandra-Auerbach"
                },
                {
                    "user_id": "Rebecca Davidson",
                    "user_href": "/profile/Rebecca-Davidson-94"
                },
                {
                    "user_id": "Sabra Khan",
                    "user_href": "/profile/Sabra-Khan-3"
                },
                {
                    "user_id": "Catrina Donham",
                    "user_href": "/profile/Catrina-Donham"
                },
                {
                    "user_id": "Paul King",
                    "user_href": "/profile/Paul-King-198"
                },
                {
                    "user_id": "KO",
                    "user_href": "/profile/KO-142"
                },
                {
                    "user_id": "Zombie Jerry",
                    "user_href": "/profile/Zombie-Jerry-1"
                },
                {
                    "user_id": "Mallory N",
                    "user_href": "/profile/Mallory-N-3"
                },
                {
                    "user_id": "Elizabeth Lowe",
                    "user_href": "/profile/Elizabeth-Lowe-77"
                },
                {
                    "user_id": "Ryan Newett",
                    "user_href": "/profile/Ryan-Newett"
                },
                {
                    "user_id": "Al Nall",
                    "user_href": "/profile/Al-Nall-1"
                },
                {
                    "user_id": "Krazi Crystal is Me",
                    "user_href": "/profile/Krazi-Crystal-is-Me"
                },
                {
                    "user_id": "Isabel Castillo",
                    "user_href": "/profile/Isabel-Castillo-34"
                },
                {
                    "user_id": "Tiffany Debusk",
                    "user_href": "/profile/Tiffany-Debusk"
                },
                {
                    "user_id": "Katie Green",
                    "user_href": "/profile/Katie-Green-128"
                },
                {
                    "user_id": "Gaielle Finn",
                    "user_href": "/profile/Gaielle-Finn"
                },
                {
                    "user_id": "Tracy Orick",
                    "user_href": "/profile/Tracy-Orick"
                },
                {
                    "user_id": "Daryl Smith",
                    "user_href": "/profile/Daryl-Smith-49"
                },
                {
                    "user_id": "Zoe Karran",
                    "user_href": "/profile/Zoe-Karran"
                },
                {
                    "user_id": "Stephany Muhad",
                    "user_href": "/profile/Stephany-Muhad-1"
                },
                {
                    "user_id": "Melissa Bumann",
                    "user_href": "/profile/Melissa-Bumann"
                },
                {
                    "user_id": "Colin Dowd",
                    "user_href": "/profile/Colin-Dowd-1"
                },
                {
                    "user_id": "Sarah",
                    "user_href": "/profile/Sarah-7776"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaby Dona",
                "href": "/profile/Gaby-Dona"
            },
            "answer_text": "You ask him. If you can't ask him seems to me a trust issue already developed and you have one foot out of the relationship. If he did something that makes you question that he might not be happy with you think if its you feeling insecure, I know I have to question myself often on this before ending up with cheating conclusion. After that assess what reason made you think he might be on one? Did you see his browser history or did someone tell you he is? Be mindful how easy it is to misinterpret information we find or given so it is always best to ask. If he refuses to answer its pretty negative and if he says no you'll have to consider how much you feel his is worthy of trust. Perhaps considering if he has before engaged in questionable behavior behind your back.  ",
            "date": "Answered March 14, 2016",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jandelyn Keiger",
                    "user_href": "/profile/Jandelyn-Keiger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Silva",
                "href": "/profile/Sandra-Silva-20"
            },
            "answer_text": "Do you have a reason to suspect he has?  I think the only way is by checking his browser history or phone. Which can be unethical because you're invading his privacy as you know.  Another way would be creating a fake profile in some dating app you may know he used to use  (put a hot women picture, fake details etc) and set the search details to something more specific to his area and his age. Be very careful about this one. If you get caught, he won't believe it was all just about checking you there. And you'll have the game turned upside down.  Do you have any close female friend who uses tinder to check that out for you? ",
            "date": "Answered May 27, 2016",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Walker",
                "href": "/profile/Jay-Walker-126"
            },
            "answer_text": "If you really want to do that do the following. GET the paid ver sion of Tinder (because you will see more people)Make a profile using a fake picture. One that your husband would like.Make sure you in your profile you search for the age you husband is.Stay close to your husband.Don't Swipe too much because the Tinder algorithm is such that when you swipe a lot you see less people. Especially when you Swipe to the right.Because It’s paid account you can anyone who liked you. And you will have chance of your husband showing up in your searches. Also be ready to be truthful to yourself if he you don't see him. And also be ready to answer a lot of rightful question if he sees that you are on Tinder. ",
            "date": "Answered January 27, 2019",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ross Jordan Gianfortune",
                "href": "/profile/Ross-Jordan-Gianfortune"
            },
            "answer_text": "Asking him is the most direct way, but I'm guessing that's not an option if you're coming to Quora.  A lot of online dating sites (Match, for example) are paid, so you could likely check his  financial documents to find out if there are any unknown or sketchy-looking  charges. You could join a bunch of dating sites anonymously and search for him. Depending on how elusive he (theoretically) is, this is a needle-in-a-haystack situation; there are dozens of sites and so many ways he can go incognito (lie about his age, etc.).  So, in conclusion: Ask him. ",
            "date": "Answered January 2, 2016",
            "views": "53",
            "upvotes": " Answer requested by Natasha Hickey",
            "upvoters": [
                {
                    "user_id": "Lisa Gorog",
                    "user_href": "/profile/Lisa-Gorog-1"
                },
                {
                    "user_id": "Rickey Palmer",
                    "user_href": "/profile/Rickey-Palmer-2"
                },
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                },
                {
                    "user_id": "Sudha Gauns",
                    "user_href": "/profile/Sudha-Gauns"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Shawna L. Sexton",
                    "user_href": "/profile/Shawna-L-Sexton"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Ana Kurowski",
                    "user_href": "/profile/Ana-Kurowski"
                },
                {
                    "user_id": "Adrian",
                    "user_href": "/profile/Adrian-346"
                },
                {
                    "user_id": "Gueorgiy Cherkásov",
                    "user_href": "/profile/Gueorgiy-Cherkásov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryn Grunwald",
                "href": "/profile/Bryn-Grunwald"
            },
            "answer_text": "…don’t. That's such an invasion of privacy. You'll get dumped, or she won't trust you. You can ask her, but people have a right to just do whatever on the internet. My boyfriend just found out about Quora like three days ago, and I didn't know he subscribes to a Nintendo game site until he showed me an article he liked about Breath of the Wild. These aren't even like, sketchy things, but I just have stuff I want to do without my boyfriend's explicit knowledge. Doesn't mean I don't love or trust him. It just means I'm independently and doing my own stuff online. He gets the same right. Leave your girl alone, or be willing to show everything you do in return. Thaaaaanks. ",
            "date": "Answered January 12, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Young",
                    "user_href": "/profile/Martin-Young-37"
                },
                {
                    "user_id": "Michael Lawrie",
                    "user_href": "/profile/Michael-Lawrie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shanna Hilton",
                "href": "/profile/Shanna-Hilton"
            },
            "answer_text": "Okay, first off . . . Why do you need to know these things? Do you not trust your partner to remain faithful? If you feel the need to snoop on dating sites to see if he is there, you do not trust him. If you are feeling insecure or worry if he is cheating, just ask him and tell him your concerns. He would probably be very hurt if he found out you were trying to find out if he were doing a terrible thing as cheat. He would probably question himself and wonder what he did wrong for you to question his character. However, I do not know your situation, but if I were you, I would just talk to him. ",
            "date": "Answered February 10, 2017",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Scott Rae",
                    "user_href": "/profile/Scott-Rae-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Kline",
                "href": "/profile/Susan-Kline-16"
            },
            "answer_text": "I don’t know but I’ll tell you what I do know instead. If you’re concerned that your boyfriend is cheating then you don’t need proof of it either way, because the only thing that matters is that this relationship does not make you feel comfortable which therefore indicates that it’s a bad relationship regardless of weather or not he’s cheating, because in a good relationship you have no such thoughts because a good relationship makes you feel happy and secure. If you can’t trust this person then have the guts to trust your instincts that you can’t trust this person and leave. ",
            "date": "Answered July 27, 2018",
            "views": "10",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse Edwards",
                    "user_href": "/profile/Jesse-Edwards-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Franklin Veaux",
                "href": "/profile/Franklin-Veaux"
            },
            "answer_text": "Ask her. If you don't trust her to answer truthfully, it doesn't matter if she is or not. Your relationship is finished. Stick a fork in it, it's done. You can't have a relationship without trust. ",
            "date": "Answered July 18, 2015",
            "views": "236",
            "upvotes": " View 71 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kareena Kapoor",
                    "user_href": "/profile/Kareena-Kapoor-34"
                },
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                },
                {
                    "user_id": "Paul King",
                    "user_href": "/profile/Paul-King-198"
                },
                {
                    "user_id": "Tapashi Das",
                    "user_href": "/profile/Tapashi-Das-2"
                },
                {
                    "user_id": "Clarisa Trevino",
                    "user_href": "/profile/Clarisa-Trevino-1"
                },
                {
                    "user_id": "Al Buchanan",
                    "user_href": "/profile/Al-Buchanan-1"
                },
                {
                    "user_id": "Zombie Jerry",
                    "user_href": "/profile/Zombie-Jerry-1"
                },
                {
                    "user_id": "Yvon DeRoos",
                    "user_href": "/profile/Yvon-DeRoos"
                },
                {
                    "user_id": "Richard Newcomer",
                    "user_href": "/profile/Richard-Newcomer-5"
                },
                {
                    "user_id": "Christina Powers",
                    "user_href": "/profile/Christina-Powers-7"
                },
                {
                    "user_id": "Teresa Lynn Smith",
                    "user_href": "/profile/Teresa-Lynn-Smith-1"
                },
                {
                    "user_id": "Natisha Williams",
                    "user_href": "/profile/Natisha-Williams-7"
                },
                {
                    "user_id": "Tom Keller",
                    "user_href": "/profile/Tom-Keller-13"
                },
                {
                    "user_id": "Jeni Martin",
                    "user_href": "/profile/Jeni-Martin-6"
                },
                {
                    "user_id": "Suzanne S. Bowers",
                    "user_href": "/profile/Suzanne-S-Bowers"
                },
                {
                    "user_id": "Drew Foster",
                    "user_href": "/profile/Drew-Foster-26"
                },
                {
                    "user_id": "Tina Schumacher",
                    "user_href": "/profile/Tina-Schumacher-1"
                },
                {
                    "user_id": "Shawna L. Sexton",
                    "user_href": "/profile/Shawna-L-Sexton"
                },
                {
                    "user_id": "Andrew Woodson",
                    "user_href": "/profile/Andrew-Woodson-2"
                },
                {
                    "user_id": "Becky Newcomb Tinsley",
                    "user_href": "/profile/Becky-Newcomb-Tinsley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katherine Phrantz",
                "href": "/profile/Katherine-Phrantz"
            },
            "answer_text": "You don't. You either trust him or don't. When you have to check up on someone to find the truth you're no longer in a healthy relationship. If you can't have open, honest communication in your relationship you shouldn't be in it. Now having said that you can't put boundaries on someone who hasn't agreed to those boundaries. If you and him have not agree on what your relationship is or is going to be, consist of, etc then what he does isn't open for debate. This is where people get mixed up in relationships and find out the person they're with isn't really the person they thought they were, etc. Clear communication of expectations is vital to a healthy functioning relationship. ",
            "date": "Answered February 27, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hugo Pienaar",
                "href": "/profile/Hugo-Pienaar-1"
            },
            "answer_text": "You ask him. If trust isn’t your thing: Look for the pictures of him which he likes the most and most often uses for social media.Send the picture(s) to your device.Use a reverse image search.Browse the sources the picture is found, and see if they are dating websites.Relationship is based on trust. The fact that you want to find out if he has any dating profiles already signifies that you don’t trust him. A relationship without trust is bound to fail. ",
            "date": "Answered February 11, 2017",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Krishna M",
                    "user_href": "/profile/Krishna-M-463"
                },
                {
                    "user_id": "Ng Tze Wei",
                    "user_href": "/profile/Ng-Tze-Wei"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Advait-Gureja-Shanker-ادویت-گریجا-شنکر"
                },
                {
                    "user_id": "Rebecca Christensen",
                    "user_href": "/profile/Rebecca-Christensen-3"
                },
                {
                    "user_id": "Erica Johnson",
                    "user_href": "/profile/Erica-Johnson-181"
                },
                {
                    "user_id": "Ann Texas",
                    "user_href": "/profile/Ann-Texas"
                },
                {
                    "user_id": "Anastasia Henesey",
                    "user_href": "/profile/Anastasia-Henesey"
                },
                {
                    "user_id": "Monica Powell",
                    "user_href": "/profile/Monica-Powell-12"
                },
                {
                    "user_id": "Vangie Brien",
                    "user_href": "/profile/Vangie-Brien"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Charlotte Freeman",
                    "user_href": "/profile/Charlotte-Freeman-12"
                },
                {
                    "user_id": "Leah Mack",
                    "user_href": "/profile/Leah-Mack-3"
                },
                {
                    "user_id": "Donna Laloux",
                    "user_href": "/profile/Donna-Laloux"
                },
                {
                    "user_id": "Elizabeth Smith",
                    "user_href": "/profile/Elizabeth-Smith-567"
                },
                {
                    "user_id": "Chris Vargas",
                    "user_href": "/profile/Chris-Vargas-43"
                },
                {
                    "user_id": "Rod Johnson",
                    "user_href": "/profile/Rod-Johnson-13"
                },
                {
                    "user_id": "Gitari Josphat",
                    "user_href": "/profile/Gitari-Josphat"
                },
                {
                    "user_id": "Angie Couch",
                    "user_href": "/profile/Angie-Couch"
                },
                {
                    "user_id": "Nina G. Vega",
                    "user_href": "/profile/Nina-G-Vega"
                },
                {
                    "user_id": "Will Schwable-Remarque",
                    "user_href": "/profile/Will-Schwable-Remarque"
                },
                {
                    "user_id": "Butch Frame",
                    "user_href": "/profile/Butch-Frame"
                },
                {
                    "user_id": "Vaishali Gupta",
                    "user_href": "/profile/Vaishali-Gupta-2"
                },
                {
                    "user_id": "Amy Allen",
                    "user_href": "/profile/Amy-Allen-28"
                },
                {
                    "user_id": "Thomas Rush",
                    "user_href": "/profile/Thomas-Rush-3"
                },
                {
                    "user_id": "Poojitha Prasad",
                    "user_href": "/profile/Poojitha-Prasad"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Rebecca Billy",
                    "user_href": "/profile/Rebecca-Billy"
                },
                {
                    "user_id": "Harish Kulkarni",
                    "user_href": "/profile/Harish-Kulkarni-13"
                },
                {
                    "user_id": "Johnny Zavala",
                    "user_href": "/profile/Johnny-Zavala"
                },
                {
                    "user_id": "Javier Lopez",
                    "user_href": "/profile/Javier-Lopez-42"
                },
                {
                    "user_id": "Edward Smith",
                    "user_href": "/profile/Edward-Smith-89"
                },
                {
                    "user_id": "Akshay Mahajan",
                    "user_href": "/profile/Akshay-Mahajan-37"
                },
                {
                    "user_id": "Sakshi Singh",
                    "user_href": "/profile/Sakshi-Singh-10"
                },
                {
                    "user_id": "Markus Schmaus",
                    "user_href": "/profile/Markus-Schmaus"
                },
                {
                    "user_id": "Gaurav Prabhu",
                    "user_href": "/profile/Gaurav-Prabhu-1"
                },
                {
                    "user_id": "Kavi Mathur",
                    "user_href": "/profile/Kavi-Mathur"
                },
                {
                    "user_id": "Andreas Kielland",
                    "user_href": "/profile/Andreas-Kielland"
                },
                {
                    "user_id": "Vicki Barnes",
                    "user_href": "/profile/Vicki-Barnes"
                },
                {
                    "user_id": "Naveen Pahade",
                    "user_href": "/profile/Naveen-Pahade"
                },
                {
                    "user_id": "Brendan Thompson",
                    "user_href": "/profile/Brendan-Thompson-6"
                },
                {
                    "user_id": "Pippi M. R. Groving",
                    "user_href": "/profile/Pippi-M-R-Groving"
                },
                {
                    "user_id": "Kent Fung",
                    "user_href": "/profile/Kent-Fung"
                },
                {
                    "user_id": "Michael Ormerod",
                    "user_href": "/profile/Michael-Ormerod"
                },
                {
                    "user_id": "Willie Boyd",
                    "user_href": "/profile/Willie-Boyd"
                },
                {
                    "user_id": "Rex Zhang",
                    "user_href": "/profile/Rex-Zhang-10"
                },
                {
                    "user_id": "Chris BeHanna",
                    "user_href": "/profile/Chris-BeHanna"
                },
                {
                    "user_id": "Ovidiu Vasilescu",
                    "user_href": "/profile/Ovidiu-Vasilescu"
                },
                {
                    "user_id": "Mark Lorenz",
                    "user_href": "/profile/Mark-Lorenz-1"
                },
                {
                    "user_id": "Mukesh Sharma",
                    "user_href": "/profile/Mukesh-Sharma-7"
                },
                {
                    "user_id": "Liu Hongtao（刘鸿韬）",
                    "user_href": "/profile/Liu-Hongtao（刘鸿韬）"
                },
                {
                    "user_id": "Eugene Yarovoi",
                    "user_href": "/profile/Eugene-Yarovoi"
                },
                {
                    "user_id": "Dorothy Hockenberry",
                    "user_href": "/profile/Dorothy-Hockenberry"
                },
                {
                    "user_id": "Tiffany Gordon",
                    "user_href": "/profile/Tiffany-Gordon-3"
                },
                {
                    "user_id": "Marius Miliunas",
                    "user_href": "/profile/Marius-Miliunas-1"
                },
                {
                    "user_id": "Doug Hoyer",
                    "user_href": "/profile/Doug-Hoyer"
                },
                {
                    "user_id": "Nicolas Zapata",
                    "user_href": "/profile/Nicolas-Zapata"
                },
                {
                    "user_id": "Judith Meyer",
                    "user_href": "/profile/Judith-Meyer"
                },
                {
                    "user_id": "Alex Bradford Cobb",
                    "user_href": "/profile/Alex-Bradford-Cobb"
                },
                {
                    "user_id": "Subhanshu Rajput",
                    "user_href": "/profile/Subhanshu-Rajput"
                },
                {
                    "user_id": "Zuzana Houšková",
                    "user_href": "/profile/Zuzana-Houšková-1"
                },
                {
                    "user_id": "Melissa Beebe",
                    "user_href": "/profile/Melissa-Beebe"
                },
                {
                    "user_id": "Lara l Lord",
                    "user_href": "/profile/Lara-l-Lord"
                },
                {
                    "user_id": "Chaitanya Angadala",
                    "user_href": "/profile/Chaitanya-Angadala"
                },
                {
                    "user_id": "Ordep Cifna",
                    "user_href": "/profile/Ordep-Cifna"
                },
                {
                    "user_id": "Rishabh Naresh Goel",
                    "user_href": "/profile/Rishabh-Naresh-Goel"
                },
                {
                    "user_id": "Heather Law",
                    "user_href": "/profile/Heather-Law-3"
                },
                {
                    "user_id": "Sagar Sags",
                    "user_href": "/profile/Sagar-Sags-1"
                },
                {
                    "user_id": "Anil Khanna",
                    "user_href": "/profile/Anil-Khanna-8"
                },
                {
                    "user_id": "Michael Vogel",
                    "user_href": "/profile/Michael-Vogel-5"
                },
                {
                    "user_id": "Daniel Taylor",
                    "user_href": "/profile/Daniel-Taylor-14"
                },
                {
                    "user_id": "Chase Quinton",
                    "user_href": "/profile/Chase-Quinton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terence Sybesma",
                "href": "/profile/Terence-Sybesma-1"
            },
            "answer_text": "First of all…WHY WOULD YOU WANT TO FIND OUT? Then the second questions is..IF you suspect her to be on a dating site why not simply ask?If she says NO, then that is what U need to accept.IF you do not believe her, you have a problem in your relationship. It’s called TRUST!IF you do not trust your GF then you have NO relationship. Relationships are based on Trust. If you still suspect she is on a dating site then time will tell and eventually you will find out. Just a matter of time. The thing is…without proof, you must give her the benefit of doubt. And do not make your live miserable and go search everywhere. It’s NOT worth it.Enjoy life..hope this can help a little, good luck ",
            "date": "Answered January 6, 2019",
            "views": "45",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anneke van Staden",
                    "user_href": "/profile/Anneke-van-Staden-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Talbot",
                "href": "/profile/Sharon-Talbot-3"
            },
            "answer_text": "There are various ways if you’re good with computers. I would say that asking her is better, if you really can’t trust her. One thing to think over: many women find it fun to “browse” dating sites or even porn sites, but with no intention of following through on a hook-up. It’s like a form of fantasy, but it usually gives you a clue that they are really dissatisfied in the relationship with you, on some level. It’s much better to have a sincere talk with her, ask if she’s happy, and how she feels about you. Tell her how you feel. Yes, I know guys often dislike sharing feelings or fears, but this better than spying on someone you care about. ",
            "date": "Answered November 9, 2017",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ericka Johns",
                "href": "/profile/Ericka-Johns-1"
            },
            "answer_text": "Ask themPay attention to what their friends say. They can reveal a lot more than you realize.Look for lies in their stories.If you look on Facebook, users that appear on their profile the most after refreshing are the ones who have either interacted with his profile or he’s interacted with theirs. That’s not a telltale sign.You could always join the sites yourself under a single friend’s picture (one that he doesn’t know and with the friend’s permission obviously) and search under your postal code to see if he shows up.",
            "date": "Answered January 4, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Weliemsf Samkdt",
                    "user_href": "/profile/Weliemsf-Samkdt"
                },
                {
                    "user_id": "Cheryl Latham",
                    "user_href": "/profile/Cheryl-Latham-5"
                },
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Anderson",
                "href": "/profile/Bob-Anderson-23"
            },
            "answer_text": "Go to www.spokeo.com and put in his name or email. It searches the whole internet, social media, public records, etc, and tells you if he was found out there. The search is free to see if he's out there. Then for the full report bearing details you must subscribe for at least a month and it probably auto-renews (recurring billing) unless you call them and cancel. (I personally don't trust them to cancel in a timely manner, so use a throwaway bank account if possible.) You can transfer all your money to your legit bank account so it has $0 in it. ",
            "date": "Updated May 9, 2017",
            "views": "3",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kerry Goold",
                    "user_href": "/profile/Kerry-Goold"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Kennedy",
                "href": "/profile/Michael-Kennedy-280"
            },
            "answer_text": "Internet browser history (regularly, since you’re trying to catch a slip-up from someone who’s probably covering her tracks). In that vein, there being nothing from the prior two hours despite the person spending two hours on the internet. If she has a picture she’s particularly happy about (the one that she thinks she’s hottest in) do a reverse google search and see if it shows up on any sites. I’ve never had cause to do these things in a relationship, but have spent years working in divorce litigation and those will usually do the trick. ",
            "date": "Answered February 21, 2018",
            "views": "12",
            "upvotes": " Answer requested by Bruce Williams",
            "upvoters": [
                {
                    "user_id": "Jody Joe",
                    "user_href": "/profile/Jody-Joe-10"
                },
                {
                    "user_id": "Maria Martin",
                    "user_href": "/profile/Maria-Martin-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paige Donham",
                "href": "/profile/Paige-Donham-1"
            },
            "answer_text": "If you are already so sure she’s cheating on you, why waste your time in finding her accounts? Just confront her and tell her you already know she has private accounts and she’s cheating! But if you’re really determine to find her accounts, just open a new profile on these social medias (use a new email, it’s very easy to do even if you do not use Gmail). Just like Felicia said, do a little research and try finding her profiles. If that doesn’t work, try checking her phone for info. I know it’s a very nasty thing to do, but considering she’s cheating - well, that’s not that bad. Good luck, and hopefully things work out for you :) ",
            "date": "Answered August 7, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dan Rasdall",
                    "user_href": "/profile/Dan-Rasdall-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Crazy Krush",
                "href": "/profile/Crazy-Krush"
            },
            "answer_text": "This is probably one of the most difficult questions in the world, Is Your Significant Other Using a Dating Site? 5 Ways to Find Out Check Browsing History on Shared Devices.Search For Their Profile Pictures and Email Address.Create Test Profiles on Likely Sites.Avoid Hacking or Electronic Surveillance.Use a Licensed Private Investigator.Read Article About Online Dating App: Crazy Krush app easy to use for more info.  ",
            "date": "Answered April 1, 2019",
            "views": "736",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jatta Jatti",
                    "user_href": "/profile/Jatta-Jatti"
                },
                {
                    "user_id": "Prince Singh Chandel",
                    "user_href": "/profile/Prince-Singh-Chandel"
                },
                {
                    "user_id": "Prem Sharma",
                    "user_href": "/profile/Prem-Sharma-819"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Thomas Bryant",
                "href": "/profile/Alexander-Thomas-Bryant"
            },
            "answer_text": "I’ve got a fool-proof plan… One that couldn’t go wrong… Actually, I’ve got two… Here it is… . . . . . …ask him. That really wasn’t the plan, but I’m sure most of the time he will say no, even if he is but if you find out in the end that he was, then you can bring up him lying about it too. But my real plan was to just search his name on these websites. Unless he was willing to use a fake name for his next relationship then if he’s on a website then you’ll find him. Warm Wishes (whatever that means) -Alex ",
            "date": "Answered May 16, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cheryl Latham",
                    "user_href": "/profile/Cheryl-Latham-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoffrey Bunting",
                "href": "/profile/Geoffrey-Bunting"
            },
            "answer_text": "You don't. If you're so concerned with whether your girlfriend has dating site accounts (accounts that may well be from before you got together anyway) then clearly have trust issues that need to be addressed. Either you need to work them through with a professional or break up with her, as she doesn't deserve someone who would be willing to go as far as stalking her internet profiles to satiate their own jealousy. If you don't trust her and she is untrustworthy, why are you with her? If you don't trust her and she's given you no reason to question her trustworthiness, why are you here rather than seeking help for your trust issues? ",
            "date": "Answered May 18, 2017",
            "views": "6",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Ginger Goodrich",
                    "user_href": "/profile/Ginger-Goodrich"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Steffen Häuser",
                    "user_href": "/profile/Steffen-Häuser"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Mark Poles",
                    "user_href": "/profile/Mark-Poles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dann Belamy",
                "href": "/profile/Dann-Belamy"
            },
            "answer_text": "If your wife locked and used a PIN for her mobile, this is an early sign of something hidden from you. No way to find out if she kept secret the mobile content to you. Normally the couple will let each other to access mobile phone since there are no other things to hide. This is a perfect trust relationship. But my knowledge today almost a majority women using PIN and locked but do not judge the cheating happen sometimes only security reason. Unless you are actively try opening and reading what happen inside her mobile, you are blind it can be for years until you are luckily knowing her activities out side your house. ",
            "date": "Answered May 29, 2018",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Don Crandel",
                "href": "/profile/Don-Crandel"
            },
            "answer_text": "First you must start being more aware of your partners expressions when you are talking to them, ask casual questions about nothing of any real importance. Look at their facial reactions to your questions, study their face. Then after you are able to read their face dig deeper, you want to frame a question with an open ended question, people will give out a lot more information when the question is open ended. Hey honey would you ever use a dating app?……why or why not? During their answer to the why or why not phase look at their face. You’ll find your answer pretty fast. ",
            "date": "Answered October 27, 2017",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Willmott",
                "href": "/profile/Martin-Willmott-2"
            },
            "answer_text": "You either trust her or you don't, apps are irrelevant, try talking to her about your relationship, ask her if she's happy, is there anything she'd like to change? If she's happy and secure and not dreaming of a threesome, then stop worrying, if she's bored try suggesting a weekend away together or a holiday, maybe spice things up with some roll play, maybe she has kinks in mind she doesnt want to ask you because she's worried about your reaction so she's considering trying stuff elsewhere on the basis of what you don't know won't hurt you, it sounds to me if there's mistrust in your marriage then it's your relationship you need to sort out. ",
            "date": "Answered January 6, 2018",
            "views": "776",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rudy Jones",
                    "user_href": "/profile/Rudy-Jones-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Hilton",
                "href": "/profile/Gary-Hilton-11"
            },
            "answer_text": "If he is using a computer, the easiest way to find out is to check the history. You can also check e-mails, even if he has deleted them, you can check what has been deleted and restore them if you wish to. The search engine also as a history. It uses cookies so that when you start to type in the search bar it will come up with sites that have been visited. There are some other things you can do, like linking e-mail notifications to your smart phone or messaging services, but it all depends on what equipement you use. ",
            "date": "Answered September 28, 2017",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wade Sansing",
                "href": "/profile/Wade-Sansing-1"
            },
            "answer_text": "Ask him? Look for the app on his phone? Check his email for the registration email? Fact is it doesn't matter if he is, that's not your problem. Your problem is trust. If don't trust him why are you married? Has he earned your distrust? If so why are you wastiy your time with an untrustworthy man? If it's unfounded what's wrong with you? Are you projecting your own untrustworthiness on him? Someone else's? It doesn't matter how he's cheating if he is. What matters is either that he is cheating or that you don't trust him. BOTH are trust issues, fix the trust or move on to someone you do trust. ",
            "date": "Answered January 24, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Vogel",
                "href": "/profile/Michael-Vogel-5"
            },
            "answer_text": "If you don't trust your girlfriend the relationship is already over; whether she is cheating or not (or on Tinder) is irrelevant.  If you're worried about her being on Tinder, ask her. If she says that she isn't and you don't trust her, then break up with her. If you trust her but are so insecure that you want to control your girlfriend then you should work on your insecurity. Insecurity and trying to control your partner is likely to make what you fear most happen: you will lose them.  Keep in mind that snooping on someone's phone is illegal. ",
            "date": "Answered August 21, 2015",
            "views": "149",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Quora-User-6851"
                },
                {
                    "user_id": "Peter Nierop",
                    "user_href": "/profile/Peter-Nierop"
                },
                {
                    "user_id": "Sina Taghva",
                    "user_href": "/profile/Sina-Taghva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nurl Clampit",
                "href": "/profile/Nurl-Clampit"
            },
            "answer_text": "Create a fake account with a fake pic. Then when you are in her proximity log in and swipe until you find her. Keep in mind it will update her location when she last opened the app. You will only he able to see profiles within the proximity of your location. If you live together then this is very easy. If not, well do it next time you are over at her house while you are in the bathroom. Just dont let her see you doing it. And whatever you do, do not resort to stalking behavior. However if your trust in her is such that you even have to wonder, then it might be time to reconsider that relationship. ",
            "date": "Answered April 22, 2019",
            "views": "909",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexis Chateau",
                "href": "/profile/Alexis-Chateau"
            },
            "answer_text": "The best way is to join the dating sites and check for yourself, since this gives you the option to do so without telling anyone else and then feeling silly when you find nothing. The other option is to ask your friends to do it, or borrow their logins. Tinder might be tricky since you can’t search for an individual person. Some people will check their partners phones and emails themselves. To me, that’s invasion of privacy, but to each their own. You can also just ask. This comes with the obvious risks, but if you know your man or woman well enough, you can tell if he or she is lying. All the best on your quest! ",
            "date": "Answered January 2, 2017",
            "views": "37",
            "upvotes": " Answer requested by Bhanu Prakash Raju",
            "upvoters": [
                {
                    "user_id": "Rose Luvell",
                    "user_href": "/profile/Rose-Luvell"
                },
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                },
                {
                    "user_id": "Gaby Dona",
                    "user_href": "/profile/Gaby-Dona"
                },
                {
                    "user_id": "Svetlana Smith",
                    "user_href": "/profile/Svetlana-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catarina Moniz",
                "href": "/profile/Catarina-Moniz"
            },
            "answer_text": "You asking this here means you don't trust him. Did something happened? Did he do something to deserve your suspicion? If not, why then are you  worried with this?Trusting someone is one of the first basic rule for a healthy relationship. If you don't trust him when he never gave you a reason for that, this is your problem. Not his. Breakup with him. Find someone else you actually trust. If by any chance, he gave you any reason for this then communication is the key, ask him. But don't point fingers, talk camly about it. Men hate to be put against the wall especially if they haven't done anything wrong or even if they do. They close down or even lie without even meaning to.Just be thoughtful, don't jump to conclusions before you talked to him. If he really likes you, he will answer you. ",
            "date": "Answered September 7, 2015",
            "views": "95",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Burch Jewell",
                    "user_href": "/profile/Ashley-Burch-Jewell"
                },
                {
                    "user_id": "James Play'z",
                    "user_href": "/profile/James-Playz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Bradley",
                "href": "/profile/Tony-Bradley-5"
            },
            "answer_text": "You probably don't find out! And if trust is an issue (or insecurity on your part), then I can only see problems ahead in your relationship. Try not to worry about such matters as dating sites etc. Focus on being the best boyfriend you can be. And if this means that you are a kind, genuine, trusting, secure man, then your girlfriend will never feel the need to look at other options. Whether that be on a dating site or elsewhere. Lighten up, and enjoy your relationship. Take care of your girlfriend and yourself! ",
            "date": "Answered December 1, 2017",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Geno Zarcone",
                    "user_href": "/profile/Geno-Zarcone-1"
                },
                {
                    "user_id": "Grace Ma",
                    "user_href": "/profile/Grace-Ma-67"
                },
                {
                    "user_id": "Chen Jiahao",
                    "user_href": "/profile/Chen-Jiahao-11"
                },
                {
                    "user_id": "Cindy Thomen Payne",
                    "user_href": "/profile/Cindy-Thomen-Payne"
                },
                {
                    "user_id": "E. Goco",
                    "user_href": "/profile/E-Goco"
                },
                {
                    "user_id": "Askar Khan",
                    "user_href": "/profile/Askar-Khan-6"
                },
                {
                    "user_id": "Nicholas Spaulding",
                    "user_href": "/profile/Nicholas-Spaulding"
                },
                {
                    "user_id": "David Hamaoui",
                    "user_href": "/profile/David-Hamaoui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandra Glasure",
                "href": "/profile/Alexandra-Glasure"
            },
            "answer_text": "You ask him. Before you do that, though, I recommend taking some time to think about why you don’t trust him. Have his actions backed up this distrust or is it possible you have insecurities about yourself and/or the relationship? Distrust in your partner is not a proper foundation for any relationship. Unless you address these issues head on, it’ll eventually crumble. Take a hard look at this situation and evaluate why you feel this way. Then discuss with your partner. As a side note, if your boyfriend had a profile at any point, unless he completely deleted the profile (most people just delete the app) he’ll most likely still show up in searches. ",
            "date": "Answered May 16, 2018",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sayed Shahnur",
                "href": "/profile/Sayed-Shahnur"
            },
            "answer_text": "Hi, further to Bob Anderson answer bellow, i agree that spokeo is one of the sites by which it possible to pull out one online presence. However, some other options are- 1 – Intelius 2 – Wink 3 – Zabasearch 4 – PeekYou 5 – pipl 6 – People Finder 7 – yoName 8 – 123people 9 – KGB People Moreover, there are tools which you may use. There is list here in this link 7 Tools to Find Someone Online Please be aware, to use all the features of these tools listed above you may need have a paid account. Be careful about that. Not all the sites or tools are trust worthy.   ",
            "date": "Answered September 7, 2015",
            "views": "105",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Priddle",
                    "user_href": "/profile/Melissa-Priddle"
                },
                {
                    "user_id": "Kristen Downey",
                    "user_href": "/profile/Kristen-Downey-4"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Renate Dietrch",
                    "user_href": "/profile/Renate-Dietrch"
                },
                {
                    "user_id": "Shawna L. Sexton",
                    "user_href": "/profile/Shawna-L-Sexton"
                },
                {
                    "user_id": "Samanttha Rosee",
                    "user_href": "/profile/Samanttha-Rosee"
                },
                {
                    "user_id": "Sharks Barber Shop",
                    "user_href": "/profile/Sharks-Barber-Shop"
                }
            ]
        },
        {
            "author_info": {
                "name": "Precious Lee",
                "href": "/profile/Precious-Lee-40"
            },
            "answer_text": "I find out my bf using dating sites when we are in restaurant. That day is also a coincidence. He suddenly feel stomach ache and rush to washroom without bring his phone. Maybe his stomach is too painful and he doesn't have time to think more. Previously, his phone will never leave him, I guess, maybe this is the only exceptional time. And , I see a Sugarbook message ping says there is a perfect match. i fell angry and quarrel with him. At that night also, we break up. ",
            "date": "Answered July 31, 2020",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rtist Gaurav Umrao",
                "href": "/profile/Rtist-Gaurav-Umrao"
            },
            "answer_text": "Just ask her. She'll definitely tell you something about it…. This is first step. This depends on your understanding and trust. Becz your relationship is about trust. If you both can't share everything with each other then there's some problem. You just have to keep in mind that your parter should be first informed about what you are doing or not doing. Maybe she don't want to share. Just take her phone or login to her Facebook. Check the connected devices on recognise device section. As most of the dating sites are connected to Facebook. This is the other way. RtistGaurv ",
            "date": "Answered December 1, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamie Estep",
                "href": "/profile/Jamie-Estep"
            },
            "answer_text": "What makes you think they are on dating sites at all? Just the concept that you’re about to get married and you’re concerned your fiance is trying to date other people, is a huge red flag. Either you are immature and completely insecure or you’re right and there’s legitimate reason to think that he is. Both would suggest you need to get into couples counseling right now! It’s a hell of a lot easier to fix problems before you’re married. ",
            "date": "Answered May 3, 2018",
            "views": "841",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Lush",
                    "user_href": "/profile/Michael-Lush-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Strachan",
                "href": "/profile/Jay-Strachan-1"
            },
            "answer_text": "You mean besides asking her?  I am not sure how else you could do it for free but I think you can ask her indirectly by fabricating a story about a coworker or someone telling somebody else about some dating website their brother is always on, and say you cant recall the names but you only know of Match.com then ask her the ones she knows and start from there. if she knows way more than you do then maybe just maybe she may be visiting a few. ",
            "date": "Answered May 29, 2015",
            "views": "35",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cheryl Latham",
                    "user_href": "/profile/Cheryl-Latham-5"
                },
                {
                    "user_id": "Sean Head",
                    "user_href": "/profile/Sean-Head-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madeleine Gallay",
                "href": "/profile/Madeleine-Gallay"
            },
            "answer_text": "Consider whether you should trust her. If you do, it totally doesn't matter if she is. Sometimes people have subscriptions that haven't expired or simply feel good deleting people on those sites who have contacted them. It can be a habit as innocuous as collecting Pokemon cards or \"friends\" on Facebook - or it can mean she has one foot out the door. By itself it means nothing. But it is time for you to wonder if you have realistic suspicions. ",
            "date": "Answered May 17, 2015",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Noob-Noob-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patty Newbold",
                "href": "/profile/Patty-Newbold"
            },
            "answer_text": "(1) Join a lot of dating sites and look for men with all the best qualities that attracted you to him. Expect him to be hurt by your betrayal if he actually loves you, whether he's on those sites or not. OR (2) Rebuild the trust in your marriage through marriage education, date nights, maybe a retreat, maybe counseling, trying new things together, and when you feel the trust restored, ask him (if you still feel any need to). The only way back to love is through love. ",
            "date": "Answered January 2, 2016",
            "views": "143",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Spruilje",
                    "user_href": "/profile/John-Spruilje"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Serchic",
                    "user_href": "/profile/Serchic"
                },
                {
                    "user_id": "Regina England",
                    "user_href": "/profile/Regina-England"
                },
                {
                    "user_id": "Lizzy Brock",
                    "user_href": "/profile/Lizzy-Brock"
                },
                {
                    "user_id": "Karen Rezza",
                    "user_href": "/profile/Karen-Rezza"
                },
                {
                    "user_id": "Pooja Baradia",
                    "user_href": "/profile/पूजा-बराडिया-Pooja-Baradia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexis Chateau",
                "href": "/profile/Alexis-Chateau"
            },
            "answer_text": "Snpachat and KiK weren’t dating profiles, last I checked. But if you want to know, ask one of your friends with profiles to check or keep an eye out for him. If you create one, and one of his friends finds you, then you’ll have a hard time explaining your way out of that one. Searching his phone is also a no-no. It’s never a good idea to invade someone’s privacy, unless you think you’re in physical danger or something. ",
            "date": "Answered March 2, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "M Yang",
                "href": "/profile/M-Yang-2"
            },
            "answer_text": "The most direct approach is to ask. Be mentally prepared for the answer either way. I'm feeling as though a deeper question should be asked. Are you more concerned with the AP or rather to possibility of infidelity? When I embark on a journey with another person, there are things that I consider deal breakers for me. My partner is aware. I don't dance around the subject. And if violated, I am willing to move on. Yes, I understand life is complicated. Despite the advice, do what is right for you. Peace and Love. M. ",
            "date": "Answered July 25, 2017",
            "views": "14",
            "upvotes": " Answer requested by Ana Kurowski",
            "upvoters": [
                {
                    "user_id": "Harry Zitzelberger",
                    "user_href": "/profile/Harry-Zitzelberger"
                },
                {
                    "user_id": "Stephen McInerney",
                    "user_href": "/profile/Stephen-McInerney-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ingrid Halvorsen",
                "href": "/profile/Ingrid-Halvorsen"
            },
            "answer_text": "You can’t be certain. If he visits a site using his smart phone but doesn’t log off, it will appear that he is still online—even if it’s been weeks since he’s been there. BTW, cruising the sites is addictive even if one is not looking for matches. It’s hard to quit just browsing. Don’t judge. Your insecurity is more likely to break up the relationship than any online browsing he might be doing. ",
            "date": "Answered November 1, 2016",
            "views": "6",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhallan Singh",
                    "user_href": "/profile/Bhallan-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sevan Khatcheressian",
                "href": "/profile/Sevan-Khatcheressian-1"
            },
            "answer_text": "You don’t. The fact that you ask such a question tells me that you’re unsure of your present partner. Here’s what I suggest you do: Have a conversation with him/her about your respective motives of being in a relationship with one another(And you’re gonna hate me for that one, but in time you’ll see I’m spot on) Put an end to this relationship. Why? Because it’s either not working really well, or clouded by your mind (see above question).Upvote this answer if you so wishPay me a visit if you ever come to France. I’ll fetch you some tea.",
            "date": "Answered August 30, 2019",
            "views": "541",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ronda Estridge",
                    "user_href": "/profile/Ronda-Estridge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Fergerson",
                "href": "/profile/Mark-Fergerson"
            },
            "answer_text": "Please, this is the 21st century. I’ve been married for more than twenty years, have never cheated on my wife and sure haven’t been on any dating sites, and every day I find three or four spams about girls’ profiles. They’re no doubt not really girls and probably aren’t really people at all, but I still get them. Hell, my wife gets them. Everyone does. If you don’t it’s only because the spammers haven’t gotten hold of your email address yet. ",
            "date": "Answered June 12, 2017",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Paynter",
                    "user_href": "/profile/Jack-Paynter-2"
                },
                {
                    "user_id": "Abbie Rowland",
                    "user_href": "/profile/Abbie-Rowland-4"
                },
                {
                    "user_id": "Alejandra DeMoss",
                    "user_href": "/profile/Alejandra-DeMoss"
                },
                {
                    "user_id": "Nikki Frye",
                    "user_href": "/profile/Nikki-Frye-6"
                },
                {
                    "user_id": "Tiphanie Brooke",
                    "user_href": "/profile/Tiphanie-Brooke"
                },
                {
                    "user_id": "Jaye Kreston",
                    "user_href": "/profile/Jaye-Kreston"
                },
                {
                    "user_id": "Teresa Lynn Smith",
                    "user_href": "/profile/Teresa-Lynn-Smith-1"
                },
                {
                    "user_id": "Chevy Loggins",
                    "user_href": "/profile/Chevy-Loggins"
                },
                {
                    "user_id": "Heidi Chambers",
                    "user_href": "/profile/Heidi-Chambers-22"
                },
                {
                    "user_id": "Melissa Bumann",
                    "user_href": "/profile/Melissa-Bumann"
                },
                {
                    "user_id": "Shelley Shortnacy",
                    "user_href": "/profile/Shelley-Shortnacy-2"
                },
                {
                    "user_id": "Cyndy Ruzich",
                    "user_href": "/profile/Cyndy-Ruzich"
                },
                {
                    "user_id": "Imran Khan",
                    "user_href": "/profile/Imran-Khan-7101"
                },
                {
                    "user_id": "Sioirse O'Toole",
                    "user_href": "/profile/Sioirse-OToole"
                },
                {
                    "user_id": "Rãvên Lee",
                    "user_href": "/profile/Rãvên-Lee"
                },
                {
                    "user_id": "Stewart Sloke",
                    "user_href": "/profile/Stewart-Sloke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Sander",
                "href": "/profile/Donna-Sander-1"
            },
            "answer_text": "Try to register using his email address. if it lets you, he doesn’t, if it blocks you because the email is already registered…well then… ",
            "date": "Answered August 5, 2018",
            "views": "42",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Todd Forsythe",
                    "user_href": "/profile/Todd-Forsythe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Love",
                "href": "/profile/Jennifer-Love-225"
            },
            "answer_text": "I think you have enough answers about playing private investigator. The real question is why do you think he’s on dating apps and why you don’t trust him. You need to have a conversation, not play detective. Even if you go through all that hassle, then what? You still need to have a conversation! Trust and honesty are the cornerstones of a relationship. You aren’t being trustworthy either by snooping around behind his back so just try to be loving and tell him how you feel. ",
            "date": "Answered December 31, 2018",
            "views": "520",
            "upvotes": " Answer requested by Anthony Bissell",
            "upvoters": [
                {
                    "user_id": "Stefan Mcclanahan",
                    "user_href": "/profile/Stefan-Mcclanahan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Puneet Kaur",
                "href": "/profile/Puneet-Kaur-11"
            },
            "answer_text": "Honestly, I’d suggest ask her upfront and make it seem like a casual conversation and not a confrontation , but if you want to dodge it a bit, you could try doing something like this, you : Hey my friend xyz’s gf is on this dating site…idk he’s flipping out…should he ? And you can kind of guess from her expression, what her opinion on the same would be…. and then say .. Idk is it normal …i mean ..are you ..maybe I’m new to all this… so that way you dont come across as suspicious and you get to hear her point of view. ",
            "date": "Answered July 23, 2017",
            "views": "793",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deana Rector",
                    "user_href": "/profile/Deana-Rector"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Lara Jonny",
                    "user_href": "/profile/Lara-Jonny"
                },
                {
                    "user_id": "Peter Taylor",
                    "user_href": "/profile/Peter-Taylor-203"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                },
                {
                    "user_id": "Aaron Cotter",
                    "user_href": "/profile/Aaron-Cotter-3"
                },
                {
                    "user_id": "Stephanie Reneé",
                    "user_href": "/profile/Stephanie-Reneé"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juliet Dillinger",
                "href": "/profile/Juliet-Dillinger-2"
            },
            "answer_text": "My best friend just went through this. She signed up on the popular sites and apps and searched for his profile. She found it. She forgave him. That was a year ago. Last weekend i sat up all night helping her google phone numbers from his cell phone log from the phone company. He had been texting back and forth over weeks to at least ten escorts. Their ads popped right up when we googled the phone number. He is still denying he did it. Now she has proof for divorce proceedings. ",
            "date": "Answered July 18, 2020",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tracie R. Roark",
                    "user_href": "/profile/Tracie-R-Roark"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tatiana Kada",
                "href": "/profile/Tatiana-Kada"
            },
            "answer_text": "You can also make search with help of search engine TinEye. It can tell you where on the web it found the photo. The page the image came from might be able to tell you more. But even if you find him there, don’t rush to conclusions and don’t worry in vain: perhaps he is there just out of boredom to experience some excitement. Сalmly and without offense discuss it with your husband. ",
            "date": "Answered January 28, 2019",
            "views": "938",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrian Marshall",
                "href": "/profile/Adrian-Marshall-5"
            },
            "answer_text": "I hate to tell you this, but yes.  She told me so herself since she and I are such good friends and know each other so well.  In fact, I feel bad telling you because I'm betraying her trust.  Also, she buried drug money in the backyard of your parents' home.  She's a member of the CIA and was abducted by aliens at the age of four.  They brought her back because she snored too loudly.  Whew, I feel better getting this off my chest.  Let me know if you'd like to know something else from a Quora member about YOUR girlfriend. ",
            "date": "Answered September 20, 2015",
            "views": "86",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Boettjer",
                "href": "/profile/Geoff-Boettjer"
            },
            "answer_text": "Man if its come to that either you already know the answer so fire her and move on…or you dont trust her because of some issue from a previous relationship you carried with you and/or you have your own issues and she isnt cheating.which means you will probably wind up pushing her away because of those things..nobody has a remote for other people that controls what they want or do. Its futile trying to acquire one believe me. Its only natural for them to do the opposite of what you want when they feel like you are trying to force them to do what YOU want them to do. You cant win..the only way to be happy is to realize this accept it and trust them..because if they want to cheat they will anyway and obviously it wasnt meant to be.and if they want only you then it was..but thinking and worrying about that stuff wastes time and energy that you could be applying to more important things in life.. ",
            "date": "Answered September 24, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Cooney",
                "href": "/profile/Martin-Cooney"
            },
            "answer_text": "You won’t because that’s an invasion of privacy. What you should be doing is asking him about why you think he’s looking on dating sites and go from there. If he’s a good guy and not doing anything wrong then you both are having an honest and truthful conversation that should strengthen your relationship. If he’s a sleezebag then drop him and go find someone better and start again. ",
            "date": "Answered June 12, 2016",
            "views": "758",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Moore",
                    "user_href": "/profile/Angela-Moore-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Camila Mila",
                "href": "/profile/Camila-Mila-11"
            },
            "answer_text": "The way dating sites are these days, it more like going to a bar or restaurant and netting different people at different hour, so it has really changed the idea of picking up a relationship partner. The ideal pattern mentioned of bars and restaurants, you can easily catch them if you keep a tab on their movement and follow them around but now that it is based on the internet, gurusLike hackbybernardATgmaIId•tc:m canHelp you FindOut withoutMovingAnInch. ",
            "date": "Answered September 26, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gretchen Thompson",
                    "user_href": "/profile/Gretchen-Thompson-12"
                },
                {
                    "user_id": "Cynthia Rodgers",
                    "user_href": "/profile/Cynthia-Rodgers"
                },
                {
                    "user_id": "Mathus M. McGregor",
                    "user_href": "/profile/Mathus-M-McGregor"
                },
                {
                    "user_id": "Rana Zarar",
                    "user_href": "/profile/Rana-Zarar"
                },
                {
                    "user_id": "Cindy Dillinger Booth",
                    "user_href": "/profile/Cindy-Dillinger-Booth"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Shawna L. Sexton",
                    "user_href": "/profile/Shawna-L-Sexton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriella Alesi",
                "href": "/profile/Gabriella-Alesi"
            },
            "answer_text": "Look up a common screenname or email he uses on Google, without the @____.com. Men often use that. Also, look for single males within 50 miles of your residence or his workplace. Do not leave out the “dating” or “casual encounters” pages as an option either. ",
            "date": "Answered December 28, 2017",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mari Smith",
                    "user_href": "/profile/Mari-Smith-70"
                },
                {
                    "user_id": "Kelley Broussard",
                    "user_href": "/profile/Kelley-Broussard"
                },
                {
                    "user_id": "Tara Dyer",
                    "user_href": "/profile/Tara-Dyer-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vry-1"
                },
                {
                    "user_id": "Tyson Sturgeon",
                    "user_href": "/profile/Tyson-Sturgeon"
                },
                {
                    "user_id": "Bradley Jay",
                    "user_href": "/profile/Bradley-Jay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Morrison",
                "href": "/profile/Ian-Morrison-19"
            },
            "answer_text": "The simplest way is to borrow his phone. I don’t however recommend you do this. Do you know the surest way to bring a relationship to it’s knees. Lack of trust. It sounds to me like the trust has been lost on your side and you suspect he’s cheating. If you go through his phone and discover that he is indeed cheating on you and then confront him with the evidence that you obtained through your own act of betrayal (betraying his privacy). I think you two will probably be done. ",
            "date": "Answered October 3, 2016",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Marting",
                "href": "/profile/James-Marting"
            },
            "answer_text": "2 I haven’t stopped thinking about you since last night/this morning. This is good for if the relationship is new or if you’ve been together for years. Whether you had a date last night or left her place this morning, letting her know she is on your mind is always nice to hear. #3 This made me think of you… Sending a funny meme, a random magazine you saw in the store, or even a cute dog on the subway shows that you were not just thinking of her, but that you wanted to send her something that would put a smile on her face. Think back to the last time she tagged you in a funny meme. It is nice to know someone knows you and gets you. #4 I can’t wait to be with you again. Whether you are seeing your girlfriend tonight or in a week, letting her know how much you are looking forward to it will make her glad. I’m sure she is anxious to see you as well. ",
            "date": "Answered January 29, 2019",
            "views": "662",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Or Margalit",
                "href": "/profile/Or-Margalit"
            },
            "answer_text": "Why?Scenario 1:You find such a site and find out he is.You break up, feeling aweful and so does he.Scenario 2: you find such a site and find out he is not.Still suspicious - you look for the next reason to check if he is cheating, maybe another site? Maybe that smile to that waitress? You don't trust him. Figure out why and change that, stay without trust (bad idea) or break up. ",
            "date": "Answered February 15, 2016",
            "views": "417",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Henshaw",
                "href": "/profile/Sarah-Henshaw-12"
            },
            "answer_text": "There is no way you can know that when you don’t use the same phone or computer the best thing to do is hire a hacker who can help you hack into their phone and get you all the information you need you can reach this number if you every need one {seven zero four two five five five two one zero} ",
            "date": "Answered November 21, 2019",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Taylor Smith",
                "href": "/profile/Alexander-Taylor-Smith"
            },
            "answer_text": "Dating sites are easily opened these days just like a quota account because all you require is an email address and it’s simple. At most, you download them on your phone. But discrete use of it would have been what your partner has been unto but it seems you are suspecting them already so why not take a look at alexandrasmart001atgmalLd0tcome and see it all for yourself because I don’t think you can do it BYyourself without having their phone in hand. ",
            "date": "Answered September 6, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikolay Pokrovsky",
                "href": "/profile/Nikolay-Pokrovsky"
            },
            "answer_text": "Yes, you can, but it will not make things better.  Trust is the most important, even more than a sexual loyalty, which is vital for the most people too. Does your husband lock his laptop, smartphone or other network devices? Does he keep his passwords in secret? If yes, try to discuss it with him. Ask him straightforward, has he something to hide?  Sometimes, being on a dating site does not mean an intention to cheat. I even know a pretty happy couples  (well, one couple) who do it together, just for fun and thrills. If you can't initiate such a dialogue, this is not a good news for your relationship, and you probably need a family psychologist. ",
            "date": "Answered February 9, 2016",
            "views": "13",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cory Hall",
                    "user_href": "/profile/Cory-Hall-36"
                },
                {
                    "user_id": "David Wright",
                    "user_href": "/profile/David-Wright-1111"
                },
                {
                    "user_id": "Chantell Du Toit",
                    "user_href": "/profile/Chantell-Du-Toit-1"
                },
                {
                    "user_id": "Marianne Napper",
                    "user_href": "/profile/Marianne-Napper"
                },
                {
                    "user_id": "Melissa Priddle",
                    "user_href": "/profile/Melissa-Priddle"
                },
                {
                    "user_id": "Braden Maccioli",
                    "user_href": "/profile/Braden-Maccioli"
                },
                {
                    "user_id": "Jessica Austin",
                    "user_href": "/profile/Jessica-Austin-103"
                },
                {
                    "user_id": "Donna Stubblefield",
                    "user_href": "/profile/Donna-Stubblefield"
                },
                {
                    "user_id": "Alfred Thompson",
                    "user_href": "/profile/Alfred-Thompson-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Smith",
                "href": "/profile/Tom-Smith-657"
            },
            "answer_text": "The easiest way is create a fake profile (female) and do a local search for men on your area with your husbands criteria. Roughly his age range, smoker, height, hair colour etc Then look through the results. If his face pops up. Message him. Ask about his current relationship status. Ask to meet him for dirty sex in a park Go and meet him. Then your relationship is over. ",
            "date": "Answered April 6, 2018",
            "views": "496",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Selander",
                "href": "/profile/Brian-Selander-2"
            },
            "answer_text": "by getting into the mess I put myself years ago, you sign up just like you suspect they did, then you look for her, or him, but women are smarter and more deviously crafty, she'll use a fake profile , linger. wait for you to hit on her to bur you even though you were there to but her red handed , there you are with nothing to say for yourself but think how dumb you're looking now ",
            "date": "Answered February 27, 2018",
            "views": "284",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julie Nashawaty",
                "href": "/profile/Julie-Nashawaty"
            },
            "answer_text": "I wrote a blog post on how I found my boyfriend on Tinder after I had a sinking feeling he might be on there. The post is: How To Find Someone’s Tinder Profile. Unfortunately I found him on there and he legit broke my heart. So, mostly, trust your gut feeling and be prepared for some awful news :( ",
            "date": "Answered May 18, 2018",
            "views": "131",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikolay Pokrovsky",
                    "user_href": "/profile/Nikolay-Pokrovsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Green",
                "href": "/profile/Karen-Green-22"
            },
            "answer_text": "The best way to find out is to ask him/her. But if you want to do it secretly then you can check his phone to see if you can find any dating apps. Or you can check his email for mails from dating sites. If he has registered on a dating site, it is likely they will send him matches and updates through email. ",
            "date": "Answered July 19, 2017",
            "views": "406",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chase Curfman",
                "href": "/profile/Chase-Curfman"
            },
            "answer_text": "“How can I find out if my boyfriend is on any dating sites?” Research - no offense, the thing you could have done before asking this question. Search his name into Google, scroll through the pages to a realistic number, until unrelated results start coming up. If you find nothing, you can safely assume that he is not on any dating sites. BUT, if you still don’t trust it, you could go to dating sites and search his name. Best of luck! ",
            "date": "Answered May 13, 2017",
            "views": "142",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Rai",
                    "user_href": "/profile/Aditya-Rai-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Bond",
                "href": "/profile/Evan-Bond"
            },
            "answer_text": "You don't. This behavior is unacceptable between a married couple, and if you think she's so untrustworthy as to be dating other people, you shouldn't have gotten married to begin with. You need to be the better person. Unless you catch her in the act, don't do anything that may sacrifice her trust in you. It's better to make her guilty for doing that sort of thing than to make her mad at you for snooping in her stuff. ",
            "date": "Answered June 19, 2015",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sullivan Wenger",
                    "user_href": "/profile/Sullivan-Wenger"
                },
                {
                    "user_id": "Nora Gruzdyte",
                    "user_href": "/profile/Nora-Gruzdyte"
                },
                {
                    "user_id": "Nigel Furness",
                    "user_href": "/profile/Nigel-Furness"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Prakoso",
                "href": "/profile/Chris-Prakoso"
            },
            "answer_text": "Without having access to his email there is no way you can know for sure. If you want you can try to register yourself to these dating sites and search for him there. In anyway, your question tells me that there is some trust issue between the two of you and I suggest that you talk about it and try to solve it as a couple. ",
            "date": "Answered August 27, 2016",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dorothy Uhlman",
                    "user_href": "/profile/Dorothy-Uhlman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rinku Gala",
                "href": "/profile/Rinku-Gala"
            },
            "answer_text": "If there is no trust in a relationship there 8s no meaning to it. The only way to know is to have an honest conversation. Coz even if you do try to sign up on dating sites to find him he may never show up as your match or may be he is on those sites with a different username and profile picture. If you are willing to spend then you could hire a detective but all in your gonna end up feeling depressed. It's best have a word with ur man & find out what's going on. ",
            "date": "Answered July 18, 2017",
            "views": "843",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick Reed",
                    "user_href": "/profile/Nick-Reed-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Venetz",
                "href": "/profile/Leslie-Venetz"
            },
            "answer_text": "Ask her..... If you think she's lying there might be so more significant trust issues going on. Why do you think she's using dating sites? Have you seen her go on dates? Have other people told you that they've seen her on dating website or dates? OR are you just being jealous and insecure? ",
            "date": "Answered May 17, 2015",
            "views": "256",
            "upvotes": " Answer requested by Barry Clark New",
            "upvoters": [
                {
                    "user_id": "Sara Brandt",
                    "user_href": "/profile/Sara-Brandt-2"
                },
                {
                    "user_id": "Cassie Walker",
                    "user_href": "/profile/Cassie-Walker-60"
                },
                {
                    "user_id": "Holly Curtis",
                    "user_href": "/profile/Holly-Curtis"
                },
                {
                    "user_id": "Emily Bowman",
                    "user_href": "/profile/Emily-Bowman-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "D. Edwards",
                "href": "/profile/D-Edwards-10"
            },
            "answer_text": "Sign up for the most popular dating sites and spend endless hours looking for your boyfriends picture and profile. Or you can ask your boyfriend if he is on dating sites. Healthy relationships are based on trust and honesty. If you do not feel you have this with your boyfriend, you might cinsider breaking up with him and moving on. If you cannot trust him now, how can you trust him in the future? And marriage does not make things better. Good luck. ",
            "date": "Answered July 19, 2017",
            "views": "846",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christophe Paquin Clouatre",
                "href": "/profile/Christophe-Paquin-Clouatre-1"
            },
            "answer_text": "Do a Google Search with each picture that she has. Look if she has a dating app on her phone. And think to solve your problem and her too, it's not healthy to think of that.  The Emotion Code / The Body Code  EFT ",
            "date": "Answered December 18, 2015",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Didi Giumarra",
                "href": "/profile/Didi-Giumarra"
            },
            "answer_text": "my recommendation? if he is your boyfriend….flush that question and thought right down the toilet asap. if he is you will figure it out soon enough. try trust! borrowing trouble and worry are never ever ever EVER productive or good in any way. if he says good things to you….believe him. ",
            "date": "Answered February 27, 2017",
            "views": "618",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darci Young",
                    "user_href": "/profile/Darci-Young"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pragyanshree Mohanty",
                "href": "/profile/Pragyanshree-Mohanty"
            },
            "answer_text": "Just ask or act if you are using one. Nothing spills the beans more efficiently than jealousy. If he or she is not jealous then there is no connection between you two . How does it matter then . Or you can use the very good other answers given here of how to find out if your partner is using dating sites or not. ",
            "date": "Answered September 29, 2017",
            "views": "23",
            "upvotes": " Answer requested by Amanda Dennen and Ryan West",
            "upvoters": [
                {
                    "user_id": "Michele Thistle",
                    "user_href": "/profile/Michele-Thistle-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Serena De Maio",
                "href": "/profile/Serena-De-Maio-1"
            },
            "answer_text": "'How do you find' in the sense if I find them more / less handsome or how do I specifically find people around me? If the first meaning: people are always more beautiful on dating sites pictures than in reality, me included. If the second meaning: often your app or site can select people close to you by xx km, just select the minimum km you can and you will see people most likely you know (going to the same school, living close to you, etc). Finally if you look for people living far from you that you know, you might want to play with the filters on the dating site, but the likelihood you will find the person is slim. Serena ",
            "date": "Answered January 7, 2016",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Sila",
                "href": "/profile/Sarah-Sila-1"
            },
            "answer_text": "If he/she has a laptop or computer, which you can access, you can go through his/her browsing history. If it’s cleared, the next place to check is the phone’s browsing history or any dating apps installed. PS: This is invasion of his/her privacy but if you need to know, there you go. ",
            "date": "Answered July 5, 2018",
            "views": "375",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Josh Manson",
                    "user_href": "/profile/Josh-Manson"
                },
                {
                    "user_id": "John Cheerhart",
                    "user_href": "/profile/John-Cheerhart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keyvan D. Thomas",
                "href": "/profile/Keyvan-D-Thomas"
            },
            "answer_text": "Your ex-girlfriend IS most likely using dating sites. She’s single now, and there’s a good chance that she wants to meet people. Tracking her down on dating sites is the very definition of stalking. ",
            "date": "Answered June 12, 2016",
            "views": "108",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jasmine Phipps",
                    "user_href": "/profile/Jasmine-Phipps-2"
                },
                {
                    "user_id": "Michael McGrinder",
                    "user_href": "/profile/Michael-McGrinder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Donovan",
                "href": "/profile/Chris-Donovan-30"
            },
            "answer_text": "If you have to ask the question you are with the wrong guy. Either you are insecure or he has given you a reason not to trust him. Either way the minute you have to start asking questions like that the realtionship is done. You just haven't figured it out yet. ",
            "date": "Answered July 27, 2018",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mel Burslan",
                "href": "/profile/Mel-Burslan"
            },
            "answer_text": "You know what your husband likes as far as physical traits go and how he likes his woman to act, like things etc. Set up an enticing profile which will get his attention. If he is dumb enough to go on dating sites while married, he will find your profile. Opposite way, i.e. you searching for his profile, is looking for the needle in the haystack. ",
            "date": "Answered December 28, 2017",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Cato",
                "href": "/profile/Tim-Cato"
            },
            "answer_text": "Chances are he has a picture of himself. When you do a search they ask for an age range of the people you want, your zip code and how many miles you would travel. Just put in his age, zip and maybe 10 miles. It should list all the guys I that age and area. If he is there you'll find him. ",
            "date": "Answered December 29, 2016",
            "views": "231",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Persons",
                "href": "/profile/Robert-Persons-2"
            },
            "answer_text": "The best way would be to get a friend that your spouse doesn’t know to go on the site and find out. Otherwise, you could always make a fake account as well. Ultimately though, you have got to address the trust issue and see if your spouse is deserving of trust or not. Once you know, you can figure out next steps. ",
            "date": "Answered September 25, 2019",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kelly Logan",
                    "user_href": "/profile/Kelly-Logan-10"
                },
                {
                    "user_id": "Peter Nierop",
                    "user_href": "/profile/Peter-Nierop"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esperanza Solano",
                "href": "/profile/Esperanza-Solano"
            },
            "answer_text": "Get a phone that is like his and get his Sims card out put a new one in his,and bam… just know you might find stuff that will hurt you. Or just look at the apps on his phone then get the same apps on your phone and when the apps download it will tell you what the app is for like my hidden numbers coculator. AND so on . ",
            "date": "Answered July 28, 2018",
            "views": "606",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jade Worthington",
                "href": "/profile/Jade-Worthington-1"
            },
            "answer_text": "Tell her you aren't feeling that all is well in your marriage and ask her what reasons she would stay together IF she was dissatisfied rather than her ending the marriage and moving on. You might get some insights as to why she doesn’t start over IF she's unhappy. If you are armed with what she may be unhappy about and why she may stay regardless, it might help her to come clean about what she may looking for outside of the marriage, (if she were to look). You hopefully should learn far more by looking into your wife’s heart than what you would by looking into her phone. Hopefully you can reach her and she doesn't bullshit you. ",
            "date": "Answered May 29, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeni Martin",
                    "user_href": "/profile/Jeni-Martin-6"
                },
                {
                    "user_id": "Suzanne S. Bowers",
                    "user_href": "/profile/Suzanne-S-Bowers"
                },
                {
                    "user_id": "Drew Foster",
                    "user_href": "/profile/Drew-Foster-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Yau",
                "href": "/profile/Chris-Yau-3"
            },
            "answer_text": "You don't. Instead look up a local therapist online. You would need to work through issues of codependency, if the thought that your girlfriend is cheating cripples you so much psychologically that you would need to violate her autonomy by monitoring her online. ",
            "date": "Answered August 5, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Dominski",
                    "user_href": "/profile/John-Dominski-4"
                },
                {
                    "user_id": "LaTanya Randle",
                    "user_href": "/profile/LaTanya-Randle-1"
                },
                {
                    "user_id": "James Johnson",
                    "user_href": "/profile/James-Johnson-682"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Kline",
                "href": "/profile/Susan-Kline-16"
            },
            "answer_text": "I don’t think it matters if he is, because the only thing that does matter is that you don’t feel safe in this relationship. A good relationship is one in which both people feel secure, otherwise it’s not a good relationship, and therefore you either need marriage counseling to save it or you need to break up. ",
            "date": "Answered April 7, 2018",
            "views": "592",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Rose",
                "href": "/profile/Steve-Rose-75"
            },
            "answer_text": "Ask your partner directly and gauge their reaction. Or, hire someone to check this out. Or, go on such sites yourself and see if your partner is there and responds to you. However, watch out. This could appear as you being on such sites for other reasons! ",
            "date": "Answered October 14, 2018",
            "views": "210",
            "upvotes": " Answer requested by Priscilla Nti and Ashtant Dahat",
            "upvoters": [
                {
                    "user_id": "Shqipe Ahmetoglu",
                    "user_href": "/profile/Shqipe-Ahmetoglu"
                },
                {
                    "user_id": "Tammy Bush Stuckey",
                    "user_href": "/profile/Tammy-Bush-Stuckey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tonya Jenson",
                "href": "/profile/Tonya-Jenson"
            },
            "answer_text": "One of the most difficult things to do is catch a cheating partner. It’s easier for a camel to pass through the eye of a needle. And i speak from experience. You have to outsmart your partner to catch him/her. A cheat is almost always conscious of whatever might sell him/her out. But not to worry a private investigator of repute i know could be of help if you need one. You could hit him up with the addy in my bio. hope that makes you smile cheers ",
            "date": "Answered August 9, 2018",
            "views": "594",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Ronald Moore",
                "href": "/profile/Peter-Ronald-Moore"
            },
            "answer_text": "Ignore any silly school-girl advice about ‘virtual stalking’ him and trying to track him by social media. If you don’t trust him, then walk away from contact with him. Either you trust him or you don’t. If you do catch him window-shopping or ‘playing away’. what next, confrontation, drama, hysteria? Give us a break - and get a life. ",
            "date": "Answered December 6, 2018",
            "views": "366",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Fink",
                "href": "/profile/Michael-Fink-60"
            },
            "answer_text": "Get over it this isnt the 1950s and dating around is normal. She isnt married she can do whatever she wants still. Seriously some of you all are so old fashioned amd live in a world that no longer exists. Dating isnt commitment grow the fuck up. And no way are u gonna keep a girlfriend if your that paranoid and distrusting that u go looking and stalking her online use. That paranoid kinda bullshit is what scares women away from you controlling asshole. ",
            "date": "Answered August 27, 2018",
            "views": "255",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raum Bances",
                "href": "/profile/Raum-Bances"
            },
            "answer_text": "You have 2 choices. Ask him if he is still maintaining his account on any dating sites.Join as many dating sites as you can and look for him as a match. The downside to this is that your lack of faith in him will have led you to become the person you are accusing him of being.",
            "date": "Answered August 2, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sara Kidane",
                    "user_href": "/profile/Sara-Kidane"
                },
                {
                    "user_id": "Ashton Bailey",
                    "user_href": "/profile/Ashton-Bailey-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucy Turner",
                "href": "/profile/Lucy-Turner-124"
            },
            "answer_text": "I once was dating this guy and he said that if I didn't trust him then he would get sad and gave me his email, social media, usernames and passwords so I could check them and once I was feeling uneasy and eventually checked his Gmail and he had notifications from a dating site ",
            "date": "Answered April 6, 2020",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Layak Singh",
                "href": "/profile/Layak-Singh-2"
            },
            "answer_text": "This is very worthless question. If you can be on the dating site why cant’t your partner be on the dating site? There is nothing wrong in it. Being on dating site does not mean that your partner is having affair. If you are not trustworthy to your partner than no point of expect the same from your partners. Don’t judge people based on dating app usages. ",
            "date": "Answered July 1, 2017",
            "views": "858",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tori Miller",
                "href": "/profile/Tori-Miller-18"
            },
            "answer_text": "If you have him as a friend on facebook you should be able to see if he’s on simply when you try to add him to an hangout group! If you can invite him, it means that he’s on! ",
            "date": "Answered May 23, 2018",
            "views": "651",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arunabh Majumdar",
                "href": "/profile/Arunabh-Majumdar"
            },
            "answer_text": "Asking her would solve 2 problems. 1) It will save you the time and effort in launching a full-scale spy operation on your girl. 2)That time would be better spent on asking her reasons for being on Tinder (if she is at all) and having a sensible discussion to figure out any problems you might be facing in your relationship. ",
            "date": "Answered September 8, 2015",
            "views": "99",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "LaTanya Randle",
                    "user_href": "/profile/LaTanya-Randle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Bennett",
                "href": "/profile/Jay-Bennett-5"
            },
            "answer_text": "If you want to end the relationship you can try Tinder, Bumble and OKC those are the free sites whereas one can message without paying initially. If you want to work on your relationship then don’t worry about that right now and find out what you two are missing an fix it. If you guys can’t or are unwilling to put the effort into the relationship and are not doing the things each other wants then worrying about what dating site he’s on is pointless. It’s on its last legs and over. ",
            "date": "Answered September 4, 2018",
            "views": "13",
            "upvotes": " Answer requested by Michelle Byler",
            "upvoters": [
                {
                    "user_id": "Aye Chan",
                    "user_href": "/profile/Aye-Chan-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicki Thomas",
                "href": "/profile/Vicki-Thomas-33"
            },
            "answer_text": "If you feel that you need to spy on your BF then it's not the right relationship for you. Clearly there are trust issues. He may not have done a thing to warrant your mistrust, however that feeling is already there. For his sake please let him go. Nobody should have a partner that doesn't fully trust them. ",
            "date": "Answered July 28, 2018",
            "views": "800",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evan Toder",
                "href": "/profile/Evan-Toder-2"
            },
            "answer_text": "Try doing a username search on google or partial username. Quite often people use the same or similar username for all online stuff.If there are images of him online anywhere, do a google reverse image search on the images and see if they show up on any dating sites.",
            "date": "Answered May 23, 2017",
            "views": "505",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Skye Alexis",
                "href": "/profile/Skye-Alexis-6"
            },
            "answer_text": "Ask. If they say no, but you feel they’re lying. Maybe wait for something odd to happen. If you can’t (like me) ask them to show you their phone to prove it. If there is really no dating apps, you will need to say sorry and how you had a thought of them wanting other women or men that took over you. ",
            "date": "Answered September 25, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wei Shen",
                "href": "/profile/Wei-Shen-5"
            },
            "answer_text": "You are stating that you do not trust your BF. does he trust you? Do you have evidence e that he is a cheater? If no then why do you think he cheats just because he is a male? Or did you cheat and that is why you don’t trust him? lots of questions that you need to be asking yourself before you start pointing fingers. ",
            "date": "Answered July 27, 2018",
            "views": "720",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wayne Straughn",
                    "user_href": "/profile/Wayne-Straughn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charyl Truax",
                "href": "/profile/Charyl-Truax"
            },
            "answer_text": "Ask your friend to look him up on dating sites and if he pops up then there you go he’s using those dating site now break up with him before you get your heart broken into pieces. ",
            "date": "Answered January 18, 2019",
            "views": "162",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Klaus Odinson",
                    "user_href": "/profile/Klaus-Odinson"
                },
                {
                    "user_id": "Akash Deep",
                    "user_href": "/profile/Akash-Deep-1163"
                },
                {
                    "user_id": "Shubham Pratap",
                    "user_href": "/profile/Shubham-Pratap-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam",
                "href": "/profile/Adam-697"
            },
            "answer_text": "Your boyfriend? So you are gay? It's fine…. just edit settings and enable both men and women option in app and set proper area distance setting and use the app. You may see your friend, there is no such option to search directly unless you go for paid version. ",
            "date": "Answered January 25, 2019",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen Ann",
                "href": "/profile/Karen-Ann-51"
            },
            "answer_text": "You can ask your partner. Sneaky is grabbing her cell and go through it. If you have a feeling your partner is on a dating site and you both were in a committed relationship, then it is a deal breaker. Confront your partner SOON. ",
            "date": "Answered July 16, 2018",
            "views": "385",
            "upvotes": " Answer requested by Matheus Cayres",
            "upvoters": [
                {
                    "user_id": "Scott Rae",
                    "user_href": "/profile/Scott-Rae-3"
                },
                {
                    "user_id": "Bryn Grunwald",
                    "user_href": "/profile/Bryn-Grunwald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Casa",
                "href": "/profile/Michael-Casa-1"
            },
            "answer_text": "Very hard, due to 2 reasons: there is many dating site so where to start searching?if your partner has profile on dating site, he probably using some fake name not hi real name",
            "date": "Answered July 1, 2017",
            "views": "294",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hack Nations Worldwide",
                    "user_href": "/profile/Hack-Nations-Worldwide"
                }
            ]
        },
        {
            "author_info": {
                "name": "JJ Tang",
                "href": "/profile/JJ-Tang-3"
            },
            "answer_text": "Of course you can, but its whether or not you should.  Not that I condone this but here's a way of doing so.  1. Open a new facebook account and maybe use a relatively attractive profile pic (not too attractive so its believable); 2. Set your tinder preference to the age and location that matches her; 3. Within the bio write something that obviously will get your gf's attention and her liking; 4. Avoid saying that your job / university is the same as she may avoid swiping right as she would think it might be someone that you know. ",
            "date": "Answered February 1, 2016",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Smith",
                "href": "/profile/Steve-Smith-2538"
            },
            "answer_text": "I know they have one called next plus. It’s not a dating site but it gives you a text only “fake” phone number. His phone would never ring. It would be like a Snapchat etc….. my sister in laws boyfriend told me about. Wondering if I should tell her?? ",
            "date": "Answered December 16, 2018",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eunice Alonso",
                "href": "/profile/Eunice-Alonso"
            },
            "answer_text": "Hi, If you’re having issues with your boyfriend it is best to always start with dialogue. establishing a direct line of communication is key to having a successful relationship. You could always relate your insecurities with him as well as issues that give you certain concerns. For an issue like this you don’t have to spend a dime, not even an MB of your mobile data scouring the internet for answers that could either break or affect your relationship. Sit him down and get him to be open to you, that way there is bliss in the relationship. ",
            "date": "Answered September 4, 2018",
            "views": "493",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Surekha Sharma",
                "href": "/profile/Surekha-Sharma-16"
            },
            "answer_text": "Hello some privacy here . Relationship is all about trust, if u don't have better to skip the relationship . And,if your partner isn't trust worthy then too skip . Bothways it's time to look for new relationship . By the way you can anytime check your partner's mobile or laptop or desktop .  ",
            "date": "Answered February 27, 2018",
            "views": "388",
            "upvotes": " Answer requested by Robert Shirley",
            "upvoters": [
                {
                    "user_id": "Joseph Farrar",
                    "user_href": "/profile/Joseph-Farrar-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabrina King",
                "href": "/profile/Sabrina-King-55"
            },
            "answer_text": "Watch your body language. Be aware of what you are communicating through your body. For example, watch yourself if you’re crossing your arms or legs, looking down, avoiding eye contact, or facing away from your date. This can show that you are embarrassed, ashamed, uncomfortable, or avoidant. Try to appear open and available without closing out your partner. Pay attention to the nonverbal communication you are sending. ",
            "date": "Answered February 5, 2019",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jake Forrester",
                "href": "/profile/Jake-Forrester"
            },
            "answer_text": "No, you cannot. If you feel the need to do this, your relationship is in trouble whether your partner is cheating or not. Without a foundation of trust, all relationships crumble. ",
            "date": "Answered May 8, 2015",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaden Thomas",
                    "user_href": "/profile/Jaden-Thomas-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alison Cox",
                "href": "/profile/Alison-Cox-1"
            },
            "answer_text": "If you even need to ask this question, there is a problem with your relationship. You don't need to know how to find your GF on Tinder. You need to ask yourself why you don't trust her. If there are valid reasons, then end the relationship. If you are a jealous person who is imagining signs of cheating, get some help. ",
            "date": "Answered September 6, 2015",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Seth Sanchez",
                "href": "/profile/Seth-Sanchez-1"
            },
            "answer_text": "The best way is either to 1. dump her if you can't trust her or 2. trust her and quit spying on her. If you have to spy on her then there is something very wrong with your relationship. Either she is untrustworthy or you are insanely jealous. Either way, this situation is not going to work. It will cause both of you undue stress and heart break. ",
            "date": "Answered July 7, 2017",
            "views": "294",
            "upvotes": " Answer requested by Mark Mink"
        },
        {
            "author_info": {
                "name": "Ammar Rakha",
                "href": "/profile/Ammar-Rakha"
            },
            "answer_text": "Most of girls are manipulative and lie sometimes but we didn't take this as basic stuff for all situations, as this can be varied from one girl to another, if she has an apology to do something serious so there's no problem to check this or you can help her ;but if not you have firstly make sure that she lied and cheated on you then without any thinking face her with the truth and if this did not do anything leave her AYR ",
            "date": "Answered August 13, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robby Jarvis",
                "href": "/profile/Robby-Jarvis"
            },
            "answer_text": "See the issue is you can get Tinder and look for him but if you are wrong and he isn't on it you are the one who looks bad.. Try having a conversation with him about it.. Why do you believe he is?! ",
            "date": "Answered January 24, 2019",
            "views": "173",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mary Jones",
                "href": "/profile/Mary-Jones-1191"
            },
            "answer_text": "Hey Lisa - having a boyfriend means that you guys are friends first. To be a couple you should be with your best friend, right? I'm really concerned that you are aligning yourself with someone you don't trust. It's up to you … the type of life that you want to live. And the world can be hard enough without adding a partner who is untrustworthy. I think it's time for you to end your relationship. It sounds like you don't trust him and possibly he is an untrustworthy person. Having a partner is all about somebody that you can trust with your life. It's sad, but it sounds like it's time for you to MoveOn. The reality is that most relationships are not in a place where they don't trust their partners. If you're with someone you can't trust, it's a very unhealthy relationship. Choosing someone you trust to be your partner is about loving yourself. Good luck- Mary ",
            "date": "Answered August 2, 2016",
            "views": "35",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Hakim Nuraldin",
                "href": "/profile/Hakim-Nuraldin"
            },
            "answer_text": "Sounds like you don’t trust him. Instead of doing that, just break up with him and move on. Because all the time and energy you spend playing detective, could be spent moving on with your life and not worrying about one individual out of billions. And that’s my 9 cents . ",
            "date": "Answered August 18, 2017",
            "views": "386",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sara Knick",
                "href": "/profile/Sara-Knick"
            },
            "answer_text": "My question to that question is, “What is making you not trust him/her and think that your partner is pursuing someone else?” Trust is a huge factor in a relationship. If that doesn’t exist, you do not have a basis or solid foundation to build from. ",
            "date": "Answered May 27, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kamal Nayan",
                "href": "/profile/कमल-नयन-Kamal-Nayan"
            },
            "answer_text": "Ask him. I assume your boyfriend doesn't charge anything for asking questions. ;-) ",
            "date": "Answered May 25, 2017",
            "views": "204",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Joy Smith",
                "href": "/profile/Joy-Smith-28"
            },
            "answer_text": "If your girlfriend active on Tinder, you ask her:  How her loyalty to youWhat purpose she joined to TinderIf possible, you try to ask her to remove herself from Tinder. Because Tinder is especially as dating site and different to other social media sites. If not, she seem to try to cheat you. ",
            "date": "Answered August 30, 2015",
            "views": "359",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ann Sims",
                "href": "/profile/Ann-Sims-10"
            },
            "answer_text": "Only way I know: upload your husband picture to Google image search Google Images and use option “search by image”, Google will find his picture if he posted to Internet. It is not very precise method but that is only thing that you can try and it costs you nothing. ",
            "date": "Answered June 14, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jo Farrall",
                "href": "/profile/Jo-Farrall"
            },
            "answer_text": "You don’t. Your respect her personal privacy and give her space. If you can’t do that, you don’t respect her and you should break up with her. ",
            "date": "Answered January 12, 2018",
            "views": "138",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Angelina White",
                "href": "/profile/Angelina-White-35"
            },
            "answer_text": "What not to do Don’t come across like a desperate horny male -- there are enough of them in the world. She wants someone who knows what he wants, is sure of himself and knows his way around the female body. Having a nice personality is very important too, especially if you are going to frequently wake up next to each other. You can’t kick her out before breakfast. It has to be clear that you have a reasonable grasp of sexual and social etiquette and are going to treat her like an equal, not like a piece of meat. You also have to impress her just like you would any other woman, but you have to impress her in different ways, and on a whole, a lot less than normal. ",
            "date": "Answered February 13, 2019",
            "views": "639",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robbie Goodwin",
                "href": "/profile/Robbie-Goodwin-2"
            },
            "answer_text": "If you can’t just sneak up behind him while he’s at it, you might have to post a fake profile or three which you know would float his boat and see whether he bites the bait… ",
            "date": "Answered May 22, 2017",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Rose",
                "href": "/profile/Steve-Rose-75"
            },
            "answer_text": "How about going with your gut feeling, namely that he is. Or, you could just ask him point blank in person and see what his reaction is. That may tell you all that you need to know! I get the sense that you don’t quite trust him. ",
            "date": "Answered September 13, 2018",
            "views": "210",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jessica Vose",
                "href": "/profile/Jessica-Vose-1"
            },
            "answer_text": "Google up his name….drag along his photo from the file on to google images something might pop up that way….good luck with your search… ",
            "date": "Answered May 23, 2018",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Savanna",
                "href": "/profile/Savanna-4"
            },
            "answer_text": "You don't. You keep a close eye on what he's doing in real life. If you don't trust him. Leave him. ( pssst…. a usually normal boyfriend will let you in on every detail of his life, is open, honest and values what you value) Good luck with you and your relationship. You will need it. ",
            "date": "Answered December 9, 2016",
            "views": "684",
            "upvotes": " Answer requested by Hidin Buhind"
        },
        {
            "author_info": {
                "name": "Han Liang",
                "href": "/profile/Han-Liang-23"
            },
            "answer_text": "Simple, check her phone when she is bathing. But that would be a privacy issue for her, depending on whether you give a shit about her feelings or not at this point of time. ",
            "date": "Answered December 6, 2017",
            "views": "323",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Tisdale",
                "href": "/profile/Mike-Tisdale"
            },
            "answer_text": "How do you know he is using online dating sites? As others have said, try posting a fake profile and see if he bites on it. Make the girl sound like you, or the kind of girl he likes, but post photos of a woman who is physically his “type” and see if he responds. ",
            "date": "Answered May 22, 2017",
            "views": "349",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lucy Ian",
                "href": "/profile/Lucy-Ian-6"
            },
            "answer_text": "the river is everywhere at once, at the source and at the mouth, at the waterfall, at the ferry, at the rapids, in the sea, in the mountains, everywhere at once, and that there is only the present time for it, not the shadow of the past, not the shadow of the future. A while ago?” Anaxantis asked. “Yes, he raped me a while ago. Exactly nine months and two days ago. What's that? Nine months or nine minutes. It's the same. And it is in the past, you say? Then why is it still happening, every day, every time I close my eyes? Every time I hear someone behind me, and I don't know who it is? How is it that I get an almost irresistible urge to kill anyone who happens to touch me unexpectedly? Tell me, Hemarchidas, how do I forgive, let alone forget, something that is still happening, that keeps happening over and over? How? How do I do that. ",
            "date": "Answered April 9, 2020",
            "views": "492",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Minda Claroline",
                "href": "/profile/Minda-Claroline"
            },
            "answer_text": "You can easily do that trough the help of hackers. I can recommend hacknations has one of the best perfect hacker. He will hack anything you wanna hack. Follow this link to meet him. http/decisive hacking worldwide/they hack and unhack they also track locations for more information just follow the link.. They are damn good ",
            "date": "Answered April 11, 2019",
            "views": "240",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Dom Jones",
                "href": "/profile/Dom-Jones-1"
            },
            "answer_text": "Trust your instincts buddy.. your gut is always right. The Pantsless Bear ",
            "date": "Answered October 12, 2015",
            "views": "663",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Erika Lopez",
                "href": "/profile/Erika-Lopez-156"
            },
            "answer_text": "Not sure how long you have been married but ask the question directly … body language, looking at the eyes and your intuition will give the answer. Please, be prepared emotionally and surround yourself with a plan or people that can help whatever the news are… ",
            "date": "Answered June 11, 2018",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Bennett",
                "href": "/profile/Jay-Bennett-5"
            },
            "answer_text": "You are so wonderfully brilliant because you already know the answer. You are asking the wrong question. How do I prove to my partner that he DOESNT NEED to be online at all. Start by asking him and don’t judge; what would be his fantasy of all fantasies. Or what can you/we do to turn the heat up on our relationship? Role play? Risqué locations? Burlesque show? See the #1 root cause for failure in all relationships is routine. Routine stunts communication and lack of communication leads to failure. ",
            "date": "Answered September 2, 2018",
            "views": "407",
            "upvotes": " Answer requested by Angela Roland, Heather Gerlich and 1 more"
        },
        {
            "author_info": {
                "name": "John William LeMasney",
                "href": "/profile/John-William-LeMasney"
            },
            "answer_text": "Go sign up for the app and look for her. Then, dig deep and understand that this is more about what you can’t offer than what you can enforce. ",
            "date": "Answered September 28, 2016",
            "views": "549",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashutosh Thakur",
                "href": "/profile/Ashutosh-Thakur-114"
            },
            "answer_text": "Hello friend. Recently I found the easiest and best way to not only open but find and uninstall hidden apps without passing any security. Here is the blog which I have written anthemd made a video on it. It will definitely be very helpful for you. Go and visit this. How to Open hidden apps passing all securities in new android Phones [HOT!!!] (https://askashutosh.blogspot.com/2019/06/box-sizingborder-box-hidden-apps.html?m=1) Not feel ashamed of sharing your experience and queries. Also share it to your friends after tricking them. ",
            "date": "Answered June 14, 2019",
            "views": "468",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Corey Kroger",
                "href": "/profile/Corey-Kroger"
            },
            "answer_text": "Upload his picture to Google image search sometimes it'll find sits the face matches, make a fake profile and join some to search for him….but best off if you trust him that little might as well kick his ass to the curb….. ",
            "date": "Answered September 26, 2017",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pedram Moallemian",
                "href": "/profile/Pedram-Moallemian"
            },
            "answer_text": "Most look for a date first, hoping for it to turn into a relationship, and some of those will become husband and wife. To look for your husband is asking for a big disappointment. ",
            "date": "Answered May 14, 2018",
            "views": "196",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Magon White",
                "href": "/profile/Magon-White-114"
            },
            "answer_text": "I found out about MMO a few months ago and have been having trouble reaching it. I've been trying using kegels and breathing exercises, but for some reason, its not working too well after three months. I tried a while ago and started feeling a pins and needles sensation all over my body. I'm not sure if that’s a good or bad sign, but do you have any advice to help me out? Thank you, Kevin When I first read this question, I thought to myself, \"What does Mixed Martial Arts (MMA) have to to do with kegels?\" But a glass of wine and a light bulb going off in my head pointed me to what you really meant, which was male multiple orgasm. ",
            "date": "Answered July 15, 2019",
            "views": "811",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tabitha Acron",
                "href": "/profile/Tabitha-Acron"
            },
            "answer_text": "You could try creating a dummy profile with some hot pics on some of the better known sites and seeing if you can lure him in… if you really don’t trust him enough to just ask. ",
            "date": "Answered September 13, 2017",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Kundra",
                "href": "/profile/Nikhil-Kundra-1"
            },
            "answer_text": "Simple ask her, if she admits respect her for the decision. If not, then assume her to be truthful and shun away this thought of spying her. If you are going to be good with her, she won't be going anywhere. Trust her and your relationship. Cheers! ",
            "date": "Answered July 23, 2017",
            "views": "446",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kirstjen Lorenz",
                "href": "/profile/Kirstjen-Lorenz"
            },
            "answer_text": "I’d ask, first. If I still doubted, I’d ask to see his phone. After that, since I clearly didn’t trust him, I’d break up, for his sake as much as my own. Once trust is gone, the relationship is over, in my opinion. ",
            "date": "Answered March 2, 2018",
            "views": "236",
            "upvotes": " Answer requested by Christina Farino"
        },
        {
            "author_info": {
                "name": "Danny Barrand",
                "href": "/profile/Danny-Barrand"
            },
            "answer_text": "If she has it under a Different Name unless you can Figure out what that Is you wont be able to find it If she does not have it under a Different Name you could find it just by typing her Name into the Search Box ",
            "date": "Answered June 19, 2019",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry nerrty",
                "href": "/profile/Harry-nerrty"
            },
            "answer_text": "Well the best way is to check her phone or computers. There' really no out her way. Check her emails also. And last you can ask her but I don' think she will tell you. Hence dating sites ",
            "date": "Answered April 27, 2018",
            "views": "562",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeni Martin",
                "href": "/profile/Jeni-Martin-6"
            },
            "answer_text": "You ask him. If this is a relationship that you want to work, then honesty is the only way to go. Relationships need trust to blossom. If you don’t have trust then why are you in this relationship? ",
            "date": "Answered July 28, 2018",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evan Cummings",
                "href": "/profile/Evan-Cummings-8"
            },
            "answer_text": "If you suspect it, your marriage may as well be over. Obviously you don't trust him, and since mutual trust is the foundation of a healthy marriage, I don't hold out much hope for you. If you want to fix what is broken, you both are going to have to get honest. Have a sit down and the sooner the better. ",
            "date": "Answered April 7, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luka Marinović",
                "href": "/profile/Luka-Marinović"
            },
            "answer_text": "You either make a false profile, which is hard on Tinder. & for a snapchat & KIK you need some extra smartphones. Or you just send some girl or boy to surf it for you?! ;) ",
            "date": "Answered March 1, 2017",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Burke",
                "href": "/profile/Christopher-Burke-3"
            },
            "answer_text": "If you trust her to tell the truth, the best way is to ask her. If you do not trust her to tell the truth, you should not be with her - there's a lot of emotional pain in your future. ",
            "date": "Answered February 15, 2016",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Sullivan",
                "href": "/profile/Jack-Sullivan-44"
            },
            "answer_text": "If he's using a photo of himself, you could take a photo of you have of him and upload it to Google Images or Tin Eye and see if you get any hits. ",
            "date": "Answered January 23, 2018",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colby Dawson",
                "href": "/profile/Colby-Dawson-2"
            },
            "answer_text": "Facebook. You can message her and ask her, “hey just wondering, but do you have any accounts on any dating sites?”. Bam. No weird cyber stalking necessary ",
            "date": "Answered June 2, 2017",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chanel Gruver",
                "href": "/profile/Chanel-Gruver"
            },
            "answer_text": "Google his name with specifics, state, birthdate etc. a lot of times it will show all of the social media sites that person belongs to. ",
            "date": "Answered April 9, 2016",
            "views": "874",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carla Lillie",
                "href": "/profile/Carla-Lillie"
            },
            "answer_text": "How do I pay her or get her to teach me how to hack my own stuff nothing more there was a similar referral who wanted money and info i asked how he could gaurenter that I would be safe from losing money and private info and hecwas scared off ",
            "date": "Answered August 3, 2017",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evelyn Green",
                "href": "/profile/Evelyn-Green-24"
            },
            "answer_text": "If you are already considering snooping on your partner it shows that there is a lack of trust on the relationship and you might as well end it now instead of creating drama. ",
            "date": "Answered July 11, 2018",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Sparsi",
                "href": "/profile/Andrew-Sparsi-1"
            },
            "answer_text": "Find out what “dating site” and then look for his profile. As a gf to do some spying for you! ",
            "date": "Answered July 27, 2018",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cerys Webb",
                "href": "/profile/Cerys-Webb-1"
            },
            "answer_text": "Ask your partner frankly, your partner will tell you if he/she loves you. Ok you can check your partners phone sms and email i hope there are some notification. ",
            "date": "Answered December 11, 2019",
            "views": "265",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Steeger",
                "href": "/profile/Robert-Steeger"
            },
            "answer_text": "There are hundreds and thousands of Online Dating Sites so if you have no clue which one he may eventually use, it is almost impossible. ",
            "date": "Answered October 4, 2017",
            "views": "555",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Hogg",
                "href": "/profile/Alexander-Hogg-1"
            },
            "answer_text": "Split up with him. Do you have a *reason* to think such a negative thought? Why don’t you trust him? And if you don’t trust him why are you dating him at all?  “A relationship without trust is doomed.” - Liston Sativa. ",
            "date": "Answered August 13, 2018",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Okie Cavies",
                "href": "/profile/Tamara-Cornelsen-2"
            },
            "answer_text": "Ask them. But first think about why you feel like they are visiting dating sites even though they are in a committed relationship. ",
            "date": "Answered September 28, 2017",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Qian",
                "href": "/profile/Qian-38"
            },
            "answer_text": "You ask him first rather than asking us here. Talk to him first if you have problems with what he did. ",
            "date": "Answered January 24, 2017",
            "views": "61",
            "upvotes": " Answer requested by Tracy Besson"
        },
        {
            "author_info": {
                "name": "Charles Ovatasarn",
                "href": "/profile/Charles-Ovatasarn"
            },
            "answer_text": "You can either be realistic and assume she is on it or be optimistic and trust in her. The less you know the happier you will be or be smart , find out ugly truth and feel painful all the time. Depends on you. ",
            "date": "Answered July 4, 2017",
            "views": "213",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Maloney",
                "href": "/profile/Dan-Maloney"
            },
            "answer_text": "You have reached a position of being in a bind. If he is guilty, he doesn’t deserve you. If he is innocent you don’t deserve him. So do the innocent party a favor and dissolve the “partnership”. ",
            "date": "Answered May 10, 2018",
            "views": "455",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manik Ahuja",
                "href": "/profile/Manik-Ahuja-11"
            },
            "answer_text": "Hahaha….if you can't keep a guy happy you might find him on Tinder  ",
            "date": "Answered April 26, 2018",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edith Gaspar",
                "href": "/profile/Edith-Gaspar"
            },
            "answer_text": "Why not just confront her? Etter yet if she is a cheater kick her to the curb. What is her Facebook going to do for you? ",
            "date": "Answered August 7, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fatema Hajiwala",
                "href": "/profile/Fatema-Hajiwala"
            },
            "answer_text": "Check out his phone. Look for hidden apps. Or simply ask him. ",
            "date": "Answered May 25, 2018",
            "views": "182",
            "upvotes": " Answer requested by Mustafa Sadek Ali"
        },
        {
            "author_info": {
                "name": "Eddie Hernandez",
                "href": "/profile/Eddie-Hernandez-183"
            },
            "answer_text": "Gmail From there you can email your husband and ask him directly! ",
            "date": "Answered January 22, 2019",
            "views": "973",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diamond Tiara",
                "href": "/profile/Diamond-Tiara-7"
            },
            "answer_text": "That's easy you just access the browsing history of your computer and if you find there is nothing go to system restore by accessing the start menu and search for it and it should recover deleted browsing history. ",
            "date": "Answered April 18, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "TIM WRIGHT",
                "href": "/profile/TIM-WRIGHT-167"
            },
            "answer_text": "is she using a dating is she using a dating website ",
            "date": "Answered May 24, 2018",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Larsen RN",
                "href": "/profile/Christopher-Larsen-RN"
            },
            "answer_text": "The real question is HOW TO WORK ON YOUR TRUST ISSUES WITH YOUR SPOUSE. ",
            "date": "Answered February 12, 2018",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naome Matlali",
                "href": "/profile/Naome-Matlali"
            },
            "answer_text": "Hi my husband is kenne I need to find out about him ",
            "date": "Answered February 27, 2018",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dusty Shackelford",
                "href": "/profile/Dusty-Shackelford"
            },
            "answer_text": "How do I find how do I find-out ",
            "date": "Answered June 7, 2019",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maria Kjelstad",
                "href": "/profile/Maria-Kjelstad"
            },
            "answer_text": "Why not ask her straight out? ",
            "date": "Answered May 14, 2018",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Willem Oosthuizen",
                "href": "/profile/Willem-Oosthuizen-5"
            },
            "answer_text": "Yes i one two find out ",
            "date": "Answered May 20, 2017",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry Coleman",
                "href": "/profile/Barry-Coleman-23"
            },
            "answer_text": "Join up .soon find out ",
            "date": "Answered May 18, 2018",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Cox",
                "href": "/profile/Jim-Cox-95"
            },
            "answer_text": "How can you tell ",
            "date": "Answered February 14, 2018",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Syed Asad Uddin",
                "href": "/profile/Syed-Asad-Uddin-1"
            },
            "answer_text": "can u date with me ",
            "date": "Answered August 27, 2018",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Wallace",
                "href": "/profile/Larry-Wallace-15"
            },
            "answer_text": "I ask them ",
            "date": "Answered April 28, 2017",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Horst Engels",
                "href": "/profile/Horst-Engels"
            },
            "answer_text": "Don’t. ",
            "date": "Answered May 23, 2016",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brenda Chapman",
                "href": "/profile/Brenda-Chapman-59"
            },
            "answer_text": "Is he ",
            "date": "Answered June 24, 2019",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Katty Jackson",
                "href": "/profile/Katty-Jackson"
            },
            "answer_text": "search is name ",
            "date": "Answered December 28, 2017",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emeka Onyenro",
                "href": "/profile/Emeka-Onyenro"
            },
            "answer_text": "I'm here ",
            "date": "Answered December 28, 2017",
            "views": "161",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin Sullivan",
                "href": "/profile/Justin-Sullivan-2"
            },
            "answer_text": "Ask. ",
            "date": "Answered June 11, 2018",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marco Porta",
                "href": "/profile/Marco-Porta"
            },
            "answer_text": "Stop it. ",
            "date": "Answered November 5, 2016",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shane Wells",
                "href": "/profile/Shane-Wells-25"
            },
            "answer_text": "Yes you can ",
            "date": "Answered July 29, 2018",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Hunt",
                "href": "/profile/Adam-Hunt-39"
            },
            "answer_text": "Answer  ",
            "date": "Answered April 11, 2016",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Foxton",
                "href": "/profile/Joshua-Foxton-1"
            },
            "answer_text": " ",
            "date": "Answered April 5, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Heeter",
                "href": "/profile/Joe-Heeter-1"
            },
            "answer_text": "W ",
            "date": "Answered June 2, 2019",
            "views": "36",
            "upvotes": "0"
        }
    ]
}