{
    "title": "How to write your own song - Quora",
    "tags": [
        "Songwriting",
        "Song Lyrics",
        "Songs",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Rasicci",
                "href": "/profile/Mike-Rasicci"
            },
            "answer_text": "The songwriting process can take many forms. I had people come to me when I first arrived in Nashville and they called themselves songwriters. They barely had a melody for a verse let alone a hook and a chorus. Forget about chord changes, at least any that made sense. Anyway, they essentially had an idea for a song. Just because a person writes limericks or poems, that is not a song. In that case, you are a lyricist. After all, Bernie Taupin needed Elton John to come up with the music. The songwriting team often comes up with song ideas separately or together, but the song actually gets written when the chords and the melody get put down on paper or, more often, recorded. When a song starts with lyrics, a musical idea gets tailored to fit the iambic pentameter or lyric phrasing. Sitting down with a guitar or piano and trying singing different melodies over chords is a way to start. I myself write tunes in my head and then figure out what chords support them. Sometimes the tune is suggested by the lyric. I get the lyric idea first about half the time. Other times, I have a melody and have to come up with a lyric that fits the melody so it flows. Paul McCartney wrote around the words, “Scrambled Eggs” while developing the song, “Yesterday”. I sometimes sit down with staff paper and jot down ideas to try working on later, but it always starts with my idea. The idea can be triggered by a book title, a news event, or something someone says during a normal day. Each individual has to develop their workflow. Start by learning an instrument and taking some music theory. I took piano lessons starting when I was around 7 years old and music theory in high school, which helped me become a better composer and musician. ",
            "date": "Answered August 4, 2020",
            "views": "232",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sergey Retsya",
                    "user_href": "/profile/Sergey-Retsya"
                },
                {
                    "user_id": "Kyle Kitchens",
                    "user_href": "/profile/Kyle-Kitchens-2"
                },
                {
                    "user_id": "Alazeah Fisher",
                    "user_href": "/profile/Alazeah-Fisher-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Q.Y. See",
                "href": "/profile/Ryan-Q-Y-See"
            },
            "answer_text": "Thanks for the A2A. Warning: sarcasm ahead. You sit down, scribble out some words that don’t necessarily fit together, and set them to music. Voila. You have now started writing a song. Now you sing that out loud to yourself, or get your nearest friend who doesn’t mind (and/or loves to sing in the shower) to sing it back to you. Once you have stopped cringing, and/or if a part of the song has gotten stuck in your head, ask if it’s gotten stuck in your friend’s. If it has, rejig the song around said part. Keep in mind, this could either be a lyric, a bit of the melody, or like a bit of the ending. It could also be a bunch of words that don’t fit together. Or something horrifically depressing.  More seriously: Every songwriter’s process is different. This sounds terribly unhelpful, because what works for person A doesn’t work for person B. And, frankly, the question itself is a little open-ended because it could refer to: the process for writing a song,the tips and tricks to start writing a songhow to get inspiration for a song (idea, lyrics, melody)how to streamline an existing processhow can I turn my existential ruminations into a song where other people can learn how awesome I amI have a songwriting homework assignment due tomorrow helpI’ve been procrastinating for weeks and I’d like to write a song that makes me famoushow do you write a song O great songwriter teach me your tricksand/or so on.For asking such a generalized question, you’re going to get an equally generalized answer. Your actual question’s answer will be somewhere in here. Forgive me, because it’s going to be long. A song - depending on the genre - generally is split into three categories: lyrics,melody,accompaniment.Note that in some genres, accompaniment can be:harmony, counter-melody, fugue, counter-fugue, throwing tomatoes at the performer, echo/response, white noise, improvisation, going off on a planned solo for an extended period of time, or basic and repetitive chord structures.Normally, songwriters - depending on their level of musical training, lyrical bent, delusions of grandeur, and how much they’re being paid, or whether they think visually, auditorily, or kinaesthetically, will tend to either create words, a scrap of melody, a chorus line that won’t go away in their head, an accompaniment idea (e.g. basic pop chord structure, I-IV-V-I, in the key of G minor), or go off a general concept for a song. (e.g. our rhythm guitarist has gotten really pissy unless we give him a solo but he can only play these two chords, what can I do to make him sound good?) From that starting point, they then can do a number of things to expand the song out further: Spend a bit of time with pen, ink, and a few sheets of paper, to write and rewrite choruses, verses, bridges, intros, outtros, prechoruses, postchoruses, second bridges, repeating verses, ABA ternary format, arc words, drones, chants, Gregorian whispers, stuff that keeps you awake at night, unintelligble noisesIt’s usually helpful to use an organizational template from a song in the genre you’re working in. In pop, for example, a typical format is: Verse 1, Chorus, Verse 2, Chorus, Bridge, Chorus, Chorus.In jazz (combos), it might be: Verse 1, Chorus(/Hook), Sax Solo, Bass Solo, Drum Solo, Trumpet Solo, Interfering Pianist Solo, Chorus/Hook, Extended Interfering Pianist Solo, Chorus/Hook, Chorus/Hook, etc.Spend a bit of time with pen, ink, a few sheets of paper, and a piano, guitar, flugelhorn, or whatever instrument you feel comfortable with. This can give voice to your melody idea, and allow you to realize that what you’ve been humming, convinced that it will be the next Baby, Baby, Baby, is actually just Twinkle Twinkle Little Star, except pitched a little faster and two keys up. I’m not speaking from personal experience or anything.Note that you don’t have to write this in musical notation; a lot of songwriters use either jazz notation (basic chords + basic melody), or their own system (mine involves lots of directional arrows), as long as you’re able to recreate the scrap of music on your instrument a week after you lose it behind your bed.Spend a bit of time with a recording device; get the idea down first, then figure out how to expand it later. Lyrics Regarding lyrics, one of the things which makes a song unique is a combination of a relatable message with some unique metaphors. I’m not advocating you to start singing about purple alligators puking very quickly in a hot sticky swamp, but songs about teenage angst have been beating the dead horse for so long that your intended listening audience will feel like purple alligators if they like it. That is, your melody and accompaniment will have to be spectacular to make up for terrible or cliche lyrics. That said, everything under the sun’s been done, so use a metaphor, an image, a sound/noise, a feeling or sensation, etc, which is familiar and personal to you. Every songwriter is the product of a unique upbringing, so this can be helpful. Rhymes, especially lame rhymes like Moon/June, are for high school losers. High school losers, on the other hand, get a 50:50 chance of either being massively rich and famous (compared to where they came from), or dying completely forgotten in the middle of BUMF, Nowhere. Generally speaking, it’s hard to go wrong with couplets (AABB), because listeners react well to rhymes that are combined with music. Only force the rhymes around your hook - i.e., the piece of music that got stuck in your/ your friend’s head - though of course it’s better not to force anything at all. Otherwise, if the rhyme doesn’t work, rejig the content. Melody Simple is good. Usually, hooks are sequences of notes that produce a particular reaction in the listener. A good test of a hook (because hooks can grow on a listener over time, though of course the best hooks are the ones that hit instantly) is to sing it to yourself before sleeping. If it’s still bouncing around in your head come morning, you’ve got a good one. If it’s not…welp. Best record it anyway, it can go in your odds-and-ends bin, which can be helpful if you’re stuck down the road. From that point, once you have the hook, expand outward. Either come up with more hooks, or re-arrange the notes of your hook by moving it up and down, changing the tempo, resolving the chord, etc. Note that hooks in the ‘melody’ don’t need to be purely pitch based. It could be a change in timbre, rhythm, tempo, and/or so on. Accompaniment Chords are your best friend. White noise is lots of chords stuck together. Echo/responses…are chords which are echoes and responses. If you cover yourself with cords, tomatoes have a hard time getting through. If you can’t play chords, find somebody who can, or play clips off Youtube. You want to get a basic skeleton of what your song might sound like from this point, and either marry the melody to the accompaniment, or the lyrics to the accompaniment. From there, usually a baby will form, a baby called “Melody Jr.” Alternatively, you’ll get a proof of concept, and can shape words around it. (e.g. upwards sequence + major resolution) could be a happy turn or phrase or an uber-depressing one just to screw with your listener.  TL;DR. The process generally goes: Get an instrument and a vocalist. Throw random things at a wall - recorded if you’d like - until something gets stuck in your head. Once that’s there, expand on the theme of the thing that gets stuck in your head, whether that’s through lyrics, melody, or accompaniment. Then refine it until the entire song gets stuck in your head. Make sure you write it down somewhere along the way so you can revisit and recreate it another time, or in the morning, after you’ve escaped from the purple alligators you threw tomatoes at. ",
            "date": "Answered December 24, 2016",
            "views": "35",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sergey Retsya",
                    "user_href": "/profile/Sergey-Retsya"
                },
                {
                    "user_id": "Darren",
                    "user_href": "/profile/Darren-71"
                },
                {
                    "user_id": "Andy Russell",
                    "user_href": "/profile/Andy-Russell-99"
                },
                {
                    "user_id": "Dan Carroll",
                    "user_href": "/profile/Dan-Carroll-109"
                },
                {
                    "user_id": "Jamie Roxanne",
                    "user_href": "/profile/Jamie-Roxanne"
                },
                {
                    "user_id": "Connie Casella",
                    "user_href": "/profile/Connie-Casella"
                },
                {
                    "user_id": "Lucia Wallace",
                    "user_href": "/profile/Lucia-Wallace-4"
                },
                {
                    "user_id": "Eric Alexander",
                    "user_href": "/profile/Eric-Alexander-149"
                },
                {
                    "user_id": "Jerry Whalen",
                    "user_href": "/profile/Jerry-Whalen-1"
                },
                {
                    "user_id": "Timi Dare",
                    "user_href": "/profile/Timi-Dare"
                }
            ]
        }
    ]
}