{
    "title": "How to make a dialogue louder than background music on Netflix - Quora",
    "tags": [
        "Background Music",
        "Dialogue",
        "Netflix User FAQs",
        "Netflix (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Machi",
                "href": "/profile/Alessandro-Machi"
            },
            "answer_text": "There are some tricky set ups on either your cable box or your TV that can ruin the audio experience, and, sometimes the names given to the audio settings don’t necessarily make sense. For instance, on an older TV I see VARI and FIX in the audio menu options. What does that mean? I think VARI means the audio is allowed to vary based on how it was mixed for the show, whereas FIX means all the sounds are compressed / amplified to one overall loudness setting which can wreak havoc with overall fidelity of the sound and can cause certain audio frequencies to sound louder than others. If the music is louder than the sound, verify that this same thing is happening on other channels. If it is, then see how the audio is set on your TV or Cable Box or both. This can get really tricky if there are two different units hooked together such as a TV and a cable box, each with their own sound parameters. Perhaps snap a digital still of how the menu settings are right now just in case changes are made that make things worse, at least you can refer to your photos to get back to square one. I would keep your bass / treble settings in the middle and probably use the mono setting while trying to get better overall audio. If you have bucks, it maybe worth spending 50 or a 100 dollars to have someone come over and make the correct audio menu adjustments for the existing set up and take a picture of the menu settings. If an audio person has to do more than make audio menu adjustments, the price may skyrocket since suddenly there could be actual cables and inputs and routing issues that have to be dealt with. That is why I bolded correct audio menu adjustments up above as that is theoretically a more time friendly and therefore cost friendly adjustment to make, but there is no guarantee that will solve what is making the sound not seem correctly mixed. Again, make sure the audio is bad on more than one channel. If a person has NETFLIX, but hopefully also has local television channels, compare the two to see if they both have the same issue of music louder than audio. I had that same problem on my TV and I think I had had the cable box to FIX. I had mistakenly thought FIX meant it would leave the sound as is, but I think FIX means it compresses all the audio into the same volume, thus music may suddenly become too loud when compared to the audio. I think I recently changed the audio setting from FIX to VARI. That seemed to solve the audio issue. i am assuming VARI means the audio will not be compressed to an overall loudness and thus the volume of hte music will have more dynamic range so it will actually go low when it is supposed to go low and go high when it is supposed to go high. ",
            "date": "Updated April 5, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bret Yeilding",
                    "user_href": "/profile/Bret-Yeilding"
                }
            ]
        }
    ]
}