{
    "title": "How to develop great listening skills - Quora",
    "tags": [
        "Listening",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alvin Rodriguez",
                "href": "/profile/Alvin-Rodriguez-3"
            },
            "answer_text": "By learning to shut up really . Because when we actually shut up we tend to actually…listen. Here's a list. When someone wants to speak to you you should remove all distractions. Put your phone away, turn off the the tv, close the book you're reading, etc. Why? Because this shows you're actually going to give them your full undivided attention and that's the first big step of listening. Those who are decent observers will even take notice of this and appreciate it as it shows real effort on your part to actually listen.Fix your body language. What I mean here is certain body language looks bad because it's indicative typically of feelings of apathy and boredom with what the speaker is saying. So you first of all, turn your entire body towards them, not just your upper body, your whole body, this shows even more so you're giving full attention. Next you show open body language. This means you show body language that shows you're friendly, approachable etc. This is done by not crossing your arms or legs, moving in closer to the speaker especially when they're telling you something very important. Keeping eye contact and blinking so it looks like you're “home”, and slightly tilting your head to either side as it shows deeper fascination with what the speaker is saying. Nodding at the right times is also important.Don’t you ever interrupt when it's not your turn to speak unless it's an emergency or you have to go. The emergency will rarely come so you will have to use this principal a lot. Nothing turns off people more when they're cut off or have their sentences finished. Even I have trouble sometimes not finishing people sentences even though I'm right most of the time. Here's a rule, wait 2–3 seconds after the last thing they said to finally know it's your turn to speak. First no one will really notice the few seconds you were quite so trust me you'll be fine t won't be weird. Also some great listeners say to use the 2–3 seconds to give a facial reaction to what tehy just said expressing a mood when their last sentence. It's really up to you but I follow the facial expression followed by what I'm going to say back.Ask to clarify what they just said and follow it up by good feedback. So this is where it's a tad harder for people because it requires a bit more than just sitting there and thinking a bit and actually demonstrating you've listen. So for example let's say your friend Carl has been telling you about his dogs and his new tricks he's teaching him sonit goes like this. Carl- yeah I'm so excited tomorrow I'm gonna teach him to finally catch. You- from what you've been telling me he seems kkke a smart dog he’ll probably learn it in no time. Carl- I know! I wonder what else I could teach him besides the basics. Me- You should look it up if you really are curious and what other basics have you taught him? Cause he could be so good he's could enter competitions. Carl-You're so right I think my dog would be top 3. But I've taught him how to sit and bark when taking orders. You see how I was saying made sense as it pertained to what was coming out his mouth what's even better is when you ask questions to show how active you're in the listening.Make the entire conversation about them, ask questions of who, what, where, when, how. This is done to make the person really talk so then you can do the listening. People love talking about themselves and the person who asks the questions has the power in the conversation. Asking who, what where etc can't be answered with a simple yes or no which is why they're better for conversations and listening.Just because people want you to listen doesn't mean they want your advice. I learn this one the hard way due. Point is, lots of people simply want to be heard, they want to feel like someone cares about their problems enough to listen to them but this doesn't always mean they want to hear you advice if what they're speaking about sounds like a topic they need advice in. Why? Many consider it condescending or annoying because they never ask for it. That's what's key here, don't ever offer advice unless it's understood tacitly to or they explicitly ask you. More so the latter. Being explicitly asked is always the best sign to give advice otherwise you probably shouldn't whem actually trying to listen to others. Some would appreciate the advice even if they didn't ask but those who really want it will more likely ask for it explicitly.Don’t judge or criticize them. Seriously this a big no no. The better you apply the rules the more people will open up faster and they'll tell you many times deep, personal stuff. I've been told about miscarriages, rape, really juicy gossip, insecurities etc. When people tell you this stuff, feel lucky because odds are you're one of the few who know this about them even if you don't agree with it or you think it's nit as bad (their situation) just listen to them. If you attack people while you're listening it's a quick way to get them to get resentful and stop talking even if you do everything else right, it's just no one likes to be judged especially if they're revealing a lot because they've lowered their guard and are being vulnerable so please dont criticize in any way unless asked for some constructive criticism.Other things include use good time and reassure others that their secrets are safe with you or that you enjoyed listening (even if you didn't).  I know it sounds like a lot but trust me it becomes second nature to do all this the more you practice. being a good listener is a good skill to have as you can open people up and connect on a deeper level and those will find you more charming and charismatic as well. ",
            "date": "Answered August 1, 2017",
            "views": "769",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sol Itude",
                    "user_href": "/profile/Sol-Itude-1"
                },
                {
                    "user_id": "Maureen Mcnamara",
                    "user_href": "/profile/Maureen-Mcnamara-4"
                },
                {
                    "user_id": "Delaina Lourigan",
                    "user_href": "/profile/Delaina-Lourigan"
                },
                {
                    "user_id": "Caroline Zeller",
                    "user_href": "/profile/Caroline-Zeller-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Bobby",
                "href": "/profile/Jacob-Bobby"
            },
            "answer_text": "I read somewhere that Listening is ‘ Wanting to hear’ . I thought it to be the most succinct definition of listening. So focus on finding a reason to ‘want to hear’ and you will automatically become a good listener. Notice how crowds throng to hear preachers, motivational speakers and stand up comedians. The motivation the audience has is ‘wanting to hear’. To enhance your listening experience and to get the most out of what you hear, form the following habits: Where ever possible, when listening make jottings of a sentence, an example, a thought that captures your imagination. You can always review it later and capture the essence of what you listened to. Be careful not to make elaborate notes or you will miss out on important points being made by the speaker.Mentally summarize the key point that a speaker is making. Paying attention to the example or joke made by the speaker would be easier to recall and based on that you can often recall the point being illustrated.Suspend judgment when listening. Do not let our bias, our prejudices and/ or our differences with the speaker clutter our listening. If we listen with intent only to rebutt, we would possibly miss out on listening to some valid arguments of the speaker. It is also possible that we hear only what we want to hear and not listen to the speaker from his/ her perspective.Responding to the speaker is a motivator to listen more. Response comes in the form of eye contact (not staring), smiles (not smirk), non verbal clues (like a nod, clapping, thumbs up ). Remember that even if the speaker may be biased in his / her viewpoint being expressed, very rarely are they completely wrong.Attend with a mindset of an explorer not that of a prisoner. If you attend a lecture because you need the attendance, you are prisoner of the lecture. However, if you tell yourself that with no choice left, let me explore what the lecture has to offer, you will definitely find something meaningful and relevant in the lecture.Focus on ‘wanting to hear’ and then adopt the above habits and you will become a very good listener. ",
            "date": "Answered December 3, 2016",
            "views": "17",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amardeep Singh",
                    "user_href": "/profile/Amardeep-Singh-577"
                },
                {
                    "user_id": "Santosujit Mohanty",
                    "user_href": "/profile/Santosujit-Mohanty"
                },
                {
                    "user_id": "Aron Proll",
                    "user_href": "/profile/Aron-Proll"
                },
                {
                    "user_id": "Shayla Butler",
                    "user_href": "/profile/Shayla-Butler-10"
                },
                {
                    "user_id": "Shyam Suresh",
                    "user_href": "/profile/Shyam-Suresh-7"
                },
                {
                    "user_id": "Sukanya Potnur",
                    "user_href": "/profile/Sukanya-Potnur"
                },
                {
                    "user_id": "Harinath Shankar",
                    "user_href": "/profile/Harinath-Shankar"
                },
                {
                    "user_id": "Aashik Ajit",
                    "user_href": "/profile/Aashik-Ajit"
                },
                {
                    "user_id": "Rupesh Chaurasia",
                    "user_href": "/profile/Rupesh-Chaurasia-2"
                },
                {
                    "user_id": "Mohan Kumar",
                    "user_href": "/profile/Mohan-Kumar-444"
                },
                {
                    "user_id": "Vara Kumar Jagarapu",
                    "user_href": "/profile/Vara-Kumar-Jagarapu"
                },
                {
                    "user_id": "Vishwajeet Bandi",
                    "user_href": "/profile/Vishwajeet-Bandi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Idderf Salem",
                "href": "/profile/Idderf-Salem"
            },
            "answer_text": "Practical Steps For More Effective Listening 1. Talk less  One of my students used to say that when she facilitated classes she always told her students that God gave you one mouth and two ears – that should tell you something. 2. Get rid of distractions  If it is important for you to listen, do everything you can to eliminate internal and external noise and distractions that interfere with careful listening. 3. Don’t judge prematurely  All of us are guilty of forming snap judgements and evaluating others before hearing them out especially when the speaker’s ideas conflict with our own. 4. Look for key ideas  We think much faster than people speak. To help focus attention (rather then drift off in boredom) extract the central idea. 5. Ask sincere questions  ‘Devil’s advocate’ questions are really statements or criticisms in disguise. Sincere questions are requests for new information that clarifies a speaker’s thoughts or feelings. 6. Paraphrase  Reword the speaker’s thoughts in your own words to make sure your interpretation as a listener is accurate. 7. Suspend your own agenda  In other words, while you are listening, concentrate on what the speaker is saying not what you think. 8. Empathic listening  Empathic listening is knowing that given the same set of circumstances you might have done the same thing. It is the ability to experience the world from the other’s point of view. It doesn’t necessarily mean that you agree, but that you understand. 9. Open your heart with love  Often we listen to score points and make ourselves right and the other person wrong. When we open our hearts to each other, we do so with the belief that we are all the same. We have the same feelings, fears, and hurts: doing the best we can with what we know. Image Source - Google ",
            "date": "Answered October 17, 2020",
            "views": "92",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Vishnu Dhas",
                    "user_href": "/profile/Vishnu-Dhas-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devesh Srivastava",
                "href": "/profile/Devesh-Srivastava-3"
            },
            "answer_text": "I believe, it is more of a Trait and less of a Skill which develops being with people of similar traits and you get to see the positive sides of the same. But still you can try these: Try to have a lot of patience.. A lot means a lot.Relax and control your thought to peep-in the moment anybody says anything. People who have a habbit of interrupting are generally the ones who don’t have listening skills. They want to stop others and want themselves to be the center of attention as quickly as possible and which is where they fall off.If you don’t have a habbit of giving equal importance to the other person, then listening skill might not come to you easily. So, think about it!Collect your thoughts, don’t be impatient and wait for your chance to speak.",
            "date": "Answered September 4, 2016",
            "views": "252",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "KANA GOLICHA DUBA",
                    "user_href": "/profile/KANA-GOLICHA-DUBA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Esser",
                "href": "/profile/Walter-Esser"
            },
            "answer_text": "May I presume that your question relates to listening as part of your interpersonal skills? As in any form of auditory participation it is important that your input channel is undisturbed. Beyond the mere absence of external noise it requires to silence your internal dialogue (or chatter). Furthermore it is paramount that your intention to really listen is pure. That means you are fully committed to fully grasp what the other person is expressing. Sometimes people pay only limited attention whilst they are already thinking of their next sentence. A good way to practise is “controlled dialogue” where you paraphrase the other person’s message until he or she is fully satisfied that you perceived the message without mixing it with your own intentions. Keep practising and good luck ! ",
            "date": "Answered December 21, 2017",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Leonard",
                    "user_href": "/profile/Mike-Leonard-85"
                },
                {
                    "user_id": "Karthigayani Thayappan",
                    "user_href": "/profile/Karthigayani-Thayappan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Samuel - FitnessDoctor",
                "href": "/profile/Paul-Samuel-FitnessDoctor"
            },
            "answer_text": "One of the keys to improve your listening is patience, be patient enough to allow him/her to completely finish speaking before you chip in, (maybe you have something really important to say that you don’t want to forget, but still listen) and also accepting the other persons opinions even if they are wrong.. (I came to understand that when someone is saying something wrong, we feel the urge to interrupt and correct him/her, but that can wait till he/her has finished talking).. Also, instead of just sitting and staring at the person, or into open space while he/she talks on, you can give nods or sighs, this will help to let the person know that you are actually listening and also help you to listen more and be interested.. Stay Healthy, Stay Wise ",
            "date": "Answered September 16, 2016",
            "views": "497",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vara Kumar Jagarapu",
                    "user_href": "/profile/Vara-Kumar-Jagarapu"
                },
                {
                    "user_id": "Krati Maheshwari",
                    "user_href": "/profile/Krati-Maheshwari-8"
                },
                {
                    "user_id": "Vishwajeet Bandi",
                    "user_href": "/profile/Vishwajeet-Bandi"
                },
                {
                    "user_id": "Babli Kumari",
                    "user_href": "/profile/Babli-Kumari-4"
                },
                {
                    "user_id": "Omprakash Chandra",
                    "user_href": "/profile/Omprakash-Chandra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keyur Kumbhare",
                "href": "/profile/Keyur-Kumbhare"
            },
            "answer_text": "Listening skills play an important role in today’s life. Here’s how you can develop them. (1) Face the speaker The speaker will be more interested in talking to you if you face to them instead of wandering in your thoughts. Listen to them attentively. Keep your phone in your pocket. (2) Do not interrupt When the speaker is telling something, Listen to them carefully. When they are done speaking, put forth your views about the subject. Interrupting the conversation is rude and disrespectful. (3) Appreciate the speaker When the conversation ends, take a few minutes to appreciate them. This shows that you enjoyed speaking to him/her. Keeping the above points in mind, you can be a great listener. I’ve tried them all.  In case you like my answer, please do visit my profile here. ",
            "date": "Answered December 4, 2016",
            "views": "486",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Özhan Efe Meral",
                    "user_href": "/profile/Özhan-Efe-Meral"
                },
                {
                    "user_id": "Mike Leonard",
                    "user_href": "/profile/Mike-Leonard-85"
                },
                {
                    "user_id": "Karthigayani Thayappan",
                    "user_href": "/profile/Karthigayani-Thayappan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Binyam Kassahun",
                "href": "/profile/Binyam-Kassahun-2"
            },
            "answer_text": "Listen news and podcasts over and over again, make sure that you understand the theme of the message. Talk to someone what you have been listening and share knowledge and gossips with your families and friends. Ask them their feedback. They will tell you what you did listen right or wrong. Read newspaper and magazine because it can assist your listening capacity. Try to improve your focus while listening. There are a lot of methods and techniques on how to do it. Just browse the internet. ",
            "date": "Answered October 17, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niraalee Shah",
                "href": "/profile/Niraalee-Shah-1"
            },
            "answer_text": "Here are tips to help you develop effective listening skills Step 1: Face the speaker and maintain eye contact.Step 2: Be attentive, but relaxed.Step 3: Keep an open mind.Step 4: Listen to the words and try to picture what the speaker is saying.Step 5: Don't interrupt and don't impose your \"solutions.\"Hope that was helpful ! Regards, Niraalee Shah ",
            "date": "Answered October 17, 2020",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Palm",
                "href": "/profile/Andrew-Palm-3"
            },
            "answer_text": "The ability to accurately receive as well as interpret messages during a process of communication is known as listening. Listening skills holds the key for effective communication. Effective Listening Skills: Maintaining eye contactRemove distractions, be attentive and relaxedKeep an open mindPractice active listening and listen to the words of the speakerTry to feel what the speaker is feelingFor more information follow the link given below :- Did You Know 10 Effective Listening Skills ? (Helpful) Hope this helps you :) ",
            "date": "Answered October 3, 2016",
            "views": "204",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robin Shen",
                "href": "/profile/Robin-Shen-6"
            },
            "answer_text": "Poor listening skills is not a problem, it is a symptom of you not really caring about people. You might not think this applies to you, but it does. When you really start caring about people, instead of caring what they think relative to you, then your listening skills will appear naturally. But if you don’t care, then all the solutions to the symptoms will be temporary. ",
            "date": "Answered September 17, 2016",
            "views": "292",
            "upvotes": " View 3 Upvoters"
        }
    ]
}