{
    "title": "How hard is marching band? - Quora",
    "tags": [
        "Marching Band (activity)",
        "Marching Bands",
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Crompton",
                "href": "/profile/Dave-Crompton"
            },
            "answer_text": "I've only ever seen a marching band up close once. There was a New Year's Day parade in London and a whole load of school marching bands had been invited over from the US (great way to see in the New Year). I'll be honest - I wasn't expecting to be but I was really impressed. In the UK, the uniforms particularly look a bit tacky(?) and I was expecting some really corny music, well played but sort of trite predictable. Wow, some of the stuff was amazing. I can't remember all of the selections, but there was stuff from YES, splashes of Deep Purple, I think there was a Prince song in there too. Not what I was expecting. Ah, the question. Yes, I'm not sure how hard the job was but the job we all laughed at was the one done by the person who was the human music stand. This person (there was more than one of them) held the music for the musician to be able to see whilst playing. To do so meant facing to walk backwards but in step and time. I know it sounds unkind but my wife and I just kept laughing at a conversation we imagined somebody having “What are you doing over the New Year?” “I'm going to London.” “Wonderful. Any idea what you'll be doing?” “Yeah, walking backwards.” This was not helped by the memory of quite a well known comedy song released in the UK many years before called “I'm walking backwards to Christmas.” by The Goons. No idea if it's available online. ",
            "date": "Answered July 27, 2020",
            "views": "519",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Lithefry",
                "href": "/profile/Jay-Lithefry"
            },
            "answer_text": "Marching band is hard. Insanely hard. Even if you’re in the pit (front ensemble), you still need to lug around keyboards, carts, and things like that all the time. Depending on your school, you have to memorize tons of music and go to very frequent practices which are almost always outside. Even in the rain. Even when it’s 25 degrees Fahrenheit. If you’re not in the pit you also need to memorize charts and field positions and things like that. Prepare to work out because marchung technique is very exact. Late nights will be often. Band camp during the summer is the worst of it. You won’t have time for many after school activities depending on how often your school holds rehearsal. But despite that it’s also insanely rewarding! The band is basically a second family. Finally getting something right is so rewarding. Competing is super fun. It’s quite the experience. You learn a lot of responsibility. I recommend it even if you’re SLIGHTLY considering it. Go through one season and if you want to quit after that (NEVER in the middle of one), sure. But just try it. ",
            "date": "Answered January 1, 2019",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "ABBIE KUYKENDALL",
                    "user_href": "/profile/ABBIE-KUYKENDALL"
                },
                {
                    "user_id": "Brooke Clayton",
                    "user_href": "/profile/Brooke-Clayton-15"
                },
                {
                    "user_id": "Aurora Vora",
                    "user_href": "/profile/Aurora-Vora"
                },
                {
                    "user_id": "Alabaster Young",
                    "user_href": "/profile/Alabaster-Young"
                },
                {
                    "user_id": "Olivia Kennedy",
                    "user_href": "/profile/Olivia-Kennedy-101"
                },
                {
                    "user_id": "Chris Peralez",
                    "user_href": "/profile/Chris-Peralez"
                },
                {
                    "user_id": "Dani Alexis",
                    "user_href": "/profile/Dani-Alexis-2"
                }
            ]
        }
    ]
}