{
    "title": "How does this video make you feel? (watch below) - Quora",
    "tags": [
        "Inspirational Videos",
        "Motivation",
        "Inspiration",
        "Startup Founders and Entrepreneurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hunter McCord",
                "href": "/profile/Hunter-McCord"
            },
            "answer_text": "I feel a few emotions -Inspired: It's inspiring watching someone in extremely tough circumstances pursuing their dream despite harsh hardships. If they can do it, hey shouldn't I be pumped up to seize the day -Appreciative: I am appreciative of the chances the guy in the video got and in return I am appreciative of the opportunities I have received in my own life -Admiration:Many people in this world are not dealt the best situations in life and though they could complain, instead they go for their passion with their life. I can't help but admire people like that. I can never hear enough of those stories ",
            "date": "Answered September 17, 2013",
            "views": "581",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vibhor Shrivastava",
                    "user_href": "/profile/Vibhor-Shrivastava"
                },
                {
                    "user_id": "Andrew Medal",
                    "user_href": "/profile/Andrew-Medal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Gallardo",
                "href": "/profile/Juan-Gallardo"
            },
            "answer_text": "Wow... It takes a lot to get emotion like that out of me. But yeah this made me almost tear up a bit.  Reminded me a bit about being more appreciative. I forget that I almost ended up homeless a few years ago. I won't go into details. But yeah this video definitely hit a lot of points.  I admire this person in the video because rather than just \"escape\" as many homeless people do on drugs and alcohol, he made the choice to follow the most logical route. In his case, it was fighting. And he worked his ass off even taking hard labor jobs.  What I admire about the execution of this video is that it was not filled with the \"dream big\" bullshit. But in focusing on the next logical step. With enough of those steps THEN you accomplish big. ",
            "date": "Answered September 18, 2013",
            "views": "554",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hunter McCord",
                    "user_href": "/profile/Hunter-McCord"
                },
                {
                    "user_id": "Andrew Medal",
                    "user_href": "/profile/Andrew-Medal"
                }
            ]
        }
    ]
}