{
    "title": "How much money do normal Broadway stars make? - Quora",
    "tags": [
        "Broadway Productions",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Joachim",
                "href": "/profile/Matt-Joachim"
            },
            "answer_text": "This varies by production and what you mean by \"star.\"  An actor in a Broadway show produced under a League contract (this includes a majority of commercial productions) has a base salary of $1703 per week under current Actors Equity contracts.  There is no guarantee above this for any \"starring\" role, but usually contracts are negotiated to be significantly higher.  In fact, many stars not only negotiate a higher base salary but can negotiate to get a percentage of the gross of the production, similar to what you might see in Hollywood.  Perhaps the highest publicly known base salary for Broadway stars were for Nathan Lane and Matthew Broderick in the Producers, where their salaries were over $100,000 per week.  Hugh Jackman and Daniel Craig made over $50,000 a week plus a percentage of the production grosses while in the play A Steady Rain on Broadway.   However, these are \"big name\" stars and they command higher salaries than a lot of actors who are in lead roles but don't necessarily have a drive at the box office.  In fact, it's very possible that a star can make significantly less than a chorus member.  For an example, if we assume an actor in a lead role is getting the base rate of $1,703 a week compare that to a member of the chorus who is also a swing.  That person would get $1,703 + $85.15 for their work as a swing.  Further, dance captains, understudies, actors who move the set, actors who take unusual physical risks and actors with riders/extensions can make incremental amounts above the base salary. ",
            "date": "Answered October 5, 2012",
            "views": "292",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katy Samba",
                    "user_href": "/profile/Katy-Samba-1"
                },
                {
                    "user_id": "Randy Masters",
                    "user_href": "/profile/Randy-Masters-2"
                },
                {
                    "user_id": "Rosendo Cazares",
                    "user_href": "/profile/Rosendo-Cazares"
                },
                {
                    "user_id": "Jordan Rivero",
                    "user_href": "/profile/Jordan-Rivero-1"
                },
                {
                    "user_id": "Dom Albanese",
                    "user_href": "/profile/Dom-Albanese"
                },
                {
                    "user_id": "Dusty McGarry",
                    "user_href": "/profile/Dusty-McGarry"
                },
                {
                    "user_id": "Marier Villarreal",
                    "user_href": "/profile/Marier-Villarreal"
                },
                {
                    "user_id": "Marcus Perera",
                    "user_href": "/profile/Marcus-Perera"
                },
                {
                    "user_id": "Anthony Smith",
                    "user_href": "/profile/Anthony-Smith-212"
                },
                {
                    "user_id": "Cameron Lesure",
                    "user_href": "/profile/Cameron-Lesure"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tristan Robin Blakeman",
                "href": "/profile/Tristan-Robin-Blakeman"
            },
            "answer_text": "Equity (the actors’ union) requires a minimum of approx $2054 weekly pay for an ensemble role in a musical. There are increases for a role which has a few lines, if a role has a particular ‘risk,’ if the performer understudies another role, if they are the dance captain, and if they sign a one year rider (agree to stay with the show if it’s successful for one year). The base minimum role for a performer in a straight play is $2034 weekly. All of this is part of the Standard Equity Contract. An agent (or performer) can, of course, negotiate to have this raised if the producer is willing - usually happens when a performer has a ticket-selling ‘name.’ Don’t be misled by the appearance of the $100k yearly salary. Very few Broadway performers work full time. Few Broadway shows run for a full year - the U.S. Bureau of Labor Statistics reports that acting jobs that employ an individual for longer than three months are extremely rare. Some Broadway acting jobs may last a week or less. And, the competition for roles in a Broadway show is extremely demanding. This is the performance rate. There are different rates for rehearsal periods. ",
            "date": "Answered July 5, 2018",
            "views": "903",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Vilkin",
                    "user_href": "/profile/Peter-Vilkin"
                },
                {
                    "user_id": "Randy Masters",
                    "user_href": "/profile/Randy-Masters-2"
                },
                {
                    "user_id": "Cyrilla Baer",
                    "user_href": "/profile/Cyrilla-Baer"
                }
            ]
        }
    ]
}