{
    "title": "How to get a producer for my music - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Shepard",
                "href": "/profile/Thomas-Shepard-8"
            },
            "answer_text": "Pay. The kind of producer that can really help a song costs money. Beware that not all producers are the same and even some expensive ones will not necessarily take your song where you want it to go. Consider that there are song writing producers, engineering producers, vocal producers, beat makers, mixing producers and many more - you'll first need to know what you need help with. Notable producers can cost anywhere from 2k to 20k+ a song if you're prepared to spend that kind of money I would recommend calling the most popular recording studio in your area. Let them know what you're looking to do and be upfront about your budget. There are also management companies that represent producers (and will list them by skill i.e. Mixing, song writing, etc) but these tend to be closer to the 20k per song range. And yes - that's $20,000 dollars. If you wanna spend less than $500 just facebook some local band you like and ask if someone will help. ",
            "date": "Answered October 25, 2016",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Strauss",
                "href": "/profile/Jay-Strauss-5"
            },
            "answer_text": "The days of being just a composer are long gone unless you are a classical or multimedia composer who uses primarily live instruments or are independently wealthy. You must learn how to produce yourself and the production quality of commercial releases is much more important than the musical content. If you are looking for a high end professional producer than you've got to begin with a great quality demo that you've produced yourself. There are a lot of schools, online courses and free YouTube videos that cover everything you need to know. ",
            "date": "Answered October 20, 2016",
            "views": "295",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rob Kleiner",
                "href": "/profile/Rob-Kleiner"
            },
            "answer_text": "Find a producer you think would be right for your sound - then contact them via their website, twitter, facebook - wherever. Most producers (even “A” listers) will do works for hire like this. The 2 factors are: do they like what you're doing, and can you afford to hire them. ",
            "date": "Answered October 26, 2016",
            "views": "272",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jahmai Newell",
                "href": "/profile/Jahmai-Newell"
            },
            "answer_text": "I am right here! ",
            "date": "Answered November 3, 2016",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "J.T",
                "href": "/profile/J-T-702"
            },
            "answer_text": "Anywhere. Mainly SoundCloud, band camp, etc. Some are free, some are not free. The best thing to do is be your own producer, if you can, but if not, I would recommend running around SoundCloud listening to various people that you feel you can work with. ",
            "date": "Answered November 16, 2016",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rane Fisher",
                "href": "/profile/Rane-Fisher"
            },
            "answer_text": "I'm always available. ",
            "date": "Answered October 18, 2016",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        }
    ]
}