{
    "title": "How to learn to shuffle dance as a beginner - Quora",
    "tags": [
        "Shuffle (dancing)",
        "Learn to Dance",
        "Social Dance",
        "Dance (activity)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Namratha Dikkala",
                "href": "/profile/Namratha-Dikkala"
            },
            "answer_text": "As a beginner, shuffling is quite hard (at least to me). It takes a bit of practice and it’s one of these things that will come to you, if you stick around. Some of the tutorials I’ve seen initially did not help and seemed too tricky to get the technique. One of the first videos that actually was very clear, simple and got me the confidence that someone like me can also learn the dance, is this one:  Different tutorials teach the running man in different ways, but this one was the easiest to understand, I thought she is a good teacher and not a lot of tutorials teach this way (step by step at a slow pace). After I learnt the running man, I tried T-step:  Then V-step:  Then, mix running man and T-step:  Then, I went to cutting shapes (title says for beginners, but I would say this is intermediate level):  and this one (was very useful to me):  Then, I went on to variations in running man:  and some advanced steps (i still cant do all the moves in this one):  and then learnt this choreography:  Some more cutting shapes (she is a very good shuffle dancer):  and some advanced ones:  After all this, right now, I’m struggling with getting the speed and accuracy, sometimes balance. Being lean and fit helps, as it’s heavy cardio. I also find it hard to put all the moves I learnt together and come up with random choreography. There’s not a lot of tutorials out there that teach choreography, they only teach the individual moves. Transitioning smoothly from one move to another is quite challenging to me, requires a lot of practice and motivation. Good luck with your learning and if you find better teachers, please do share! ",
            "date": "Answered November 22, 2018",
            "views": "331",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Srishti Singh",
                    "user_href": "/profile/Srishti-Singh-415"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jessica-K-272"
                },
                {
                    "user_id": "Shiwanshi Upadhyay",
                    "user_href": "/profile/Shiwanshi-Upadhyay"
                },
                {
                    "user_id": "Nishi Singh Sengar",
                    "user_href": "/profile/Nishi-Singh-Sengar"
                },
                {
                    "user_id": "Rajshree Somani",
                    "user_href": "/profile/Rajshree-Somani-1"
                },
                {
                    "user_id": "Santosh Ganti",
                    "user_href": "/profile/Santosh-Ganti-2"
                },
                {
                    "user_id": "Museum Closet",
                    "user_href": "/profile/Museum-Closet"
                },
                {
                    "user_id": "Sneha",
                    "user_href": "/profile/Sneha-574"
                },
                {
                    "user_id": "David Collin",
                    "user_href": "/profile/David-Collin-7"
                },
                {
                    "user_id": "Bianca Snyman",
                    "user_href": "/profile/Bianca-Snyman-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Pattis",
                "href": "/profile/Robert-Pattis"
            },
            "answer_text": "There are tons of tutorials out there, which will definitely help you. However, the most difficult part is to keep practicing, even if it does not feel good. At the begining you will probably feel stupid (at least I did) and that makes it pretty hard to continue. Also you have to start slow, practice the T-Step and the Running Man slow. Don’t go faster until you feel safe. If you go fast to soon you might learn a bad style and it is pretty hard to correct it, once you are used to it. Basically it’s always the same, first you need to concentrate on what you do and therefore it looks cramped. As soon as you get used to the moves, you can dance without thinking and therefore it looks more relaxed and starts to feel good. ",
            "date": "Answered December 21, 2017",
            "views": "211",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shravan Vemula",
                    "user_href": "/profile/Shravan-Vemula-3"
                },
                {
                    "user_id": "Ishan Srivastava",
                    "user_href": "/profile/Ishan-Srivastava-119"
                },
                {
                    "user_id": "Pranav Kachhwaha",
                    "user_href": "/profile/Pranav-Kachhwaha"
                },
                {
                    "user_id": "Victoria Avery",
                    "user_href": "/profile/Victoria-Avery-9"
                },
                {
                    "user_id": "PaoWolf",
                    "user_href": "/profile/PaoWolf"
                },
                {
                    "user_id": "Maybel Khoo",
                    "user_href": "/profile/Maybel-Khoo"
                },
                {
                    "user_id": "CaterbellaGacha",
                    "user_href": "/profile/CaterbellaGacha"
                },
                {
                    "user_id": "Valentina Pasjaqa",
                    "user_href": "/profile/Valentina-Pasjaqa"
                },
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-131"
                },
                {
                    "user_id": "Denny Macho",
                    "user_href": "/profile/Denny-Macho"
                }
            ]
        }
    ]
}