{
    "title": "How does one ask Ellen DeGeneres for help? - Quora",
    "tags": [
        "Ellen DeGeneres (actor)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Whitmer",
                "href": "/profile/Elizabeth-Whitmer-1"
            },
            "answer_text": "ICD-10 App for Healthcare Coders Hello Ellen: I am an educator in the healthcare field. I teach healthcare coding and billing at a two year college in Florida. I recently was awarded the Triumph Award in Innovation from AHIMA (American Health Information Management Association). I earned my success by creating an app for cell phones called ROAR, (Root Operation App Rescue) for my students as well as coding professionals. This app helps coders to learn the many difficult root operations in coding hospital procedures. It is view-able on my website at ICD-10 App for Healthcare Coders. I have a video on the site to watch and learn how to use it. I have kept it very reasonable so that students can afford it. The reason I am writing you is to ask if you could help me by bringing into the limelight, via one of your shows, my latest creation. I have now invented a keyboard (just for coding). It is amazing how no-one ever thought about this before. I have spend years on this and have literally gone broke due to my determination to create prototypes and also obtain a patent pending on it. I do not know how to obtain further funding to keep going forward with this new innovative idea. I took it to 3M representative this month; however, as interested and surprised as they were, they sent me home to do further studies of its use for them. They are numbers people. I am just an out of the box thinker, educator and innovator. No, I do not want to go on Shark Tank. That is not on my calendar. My students are way too important to me than to spend senseless time appearing as a game show prop. Perhaps you might provide me with a direction or a philanthropist that might be interested in joining me in this wonderful adventure to compliment the healthcare world in their revenue department. I am desperate and will listen to anything you tell me. I want every healthcare coder/student/physicians office/outsourced coding companies/insurance companies/Medicare/Medicaid- to be able to afford one and increase their coding volume production. I have many steps to take to get there and I am funding-exhausted. Please advise if you can. I have been approved for Patent Pending on my prototype. ",
            "date": "Answered November 8, 2017",
            "views": "7",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brenda Ussery",
                    "user_href": "/profile/Brenda-Ussery-2"
                },
                {
                    "user_id": "Lana Stanberry",
                    "user_href": "/profile/Lana-Stanberry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gertrude Woods",
                "href": "/profile/Gertrude-Woods-2"
            },
            "answer_text": "Dear Ellen While watching your show and writing a letter to American airlines about the way their airplane caused me,my husband, niece and her husband, her daughter, another nefew and his wife miss our cruise due to first bad weather that detoured us to Ft Meyers Florida. Upon arrival, during inspection of the plane, they discovered that one of the tires had a knot in the tire which had to be fixed before we would be able to continue to our next destination. They made the announcement and told us that it would take up to two hours,.At this point, we were good with this because the trip from Ft Meyers to Miami would only take thirty minutes which still gave us thre6 hours to get to our cruise ship. During this time the first tire they bought out was bad, then they didn't have a jack. After borrowing a jack from Jet Blue and finally getting a tire and a contractor to fix the tire we patiently watched as he struggled to get the tire on. After about a couple of hours our group and others on this flight asked if we could get our luggage off the plane so that we could make other arrangements to get to Miami so we could get to our cruise ship, they told us no.We missed our cruise because it took the contractor so long that our pilot couldn't fly out because his time was up. We ended up having them sending us in two taxis to Miami ,in which they put us up in the most rundown Holiday Inn that I have ever been in with twelve dollar meal vouchers for two days. The food that they served was lukewarm and tasted old. They were going to fly us to Kingston ,from there we were going to have to get a ride to Ochos Rio to catch our cruise ship. After researching we found out that it was hard to find a taxi service that would take you and that it was a very bumpy and mountainous ride. American airlines told us that they couldn't guarantee our safety, so we decided not to go. We missed on our Anniversary trip which we saved for and paid in installments because we wanted balcony suites and they were pricey. We did things like eating out less ,we cut back on spending, less date nights just to be able to have the money to really enjoy our Anniversary. We didn't take out the insurance because we made sure that we caught a flight early enough to get to the port in time ,thinking that it was more money saved that way. American airlines told us that they would not reimburse us for our cruise. We all spent about twenty seven hundred dollars a couple and my niece spent more because her friend pulled out at the last minute which made her have to pay more. We are blessed but we have to work hard and save to afford things like this. I wish that American airlines had more things in place for situations like this. I have questions like how did Atlanta airlines not catch upon inspection the knot in the tire? Did they put everyone that was on the plane life in danger? Why couldn't they give us our luggage when we asked? Why didn't they after so many hours couldn't they put us on another plane? Please can you get answers to these questions for us! Thanks Gertrude Woods ",
            "date": "Answered July 2, 2019",
            "views": "12",
            "upvotes": "0"
        }
    ]
}