{
    "title": "How to get paid for my songs - Quora",
    "tags": [
        "Getting Paid",
        "Salaries for Specific Jobs and Careers",
        "Making Money Online",
        "How-to Question",
        "Songs",
        "Salaries and Wages",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arthur Crime",
                "href": "/profile/Arthur-Crime"
            },
            "answer_text": "Good question, sometimes the promoter will hand either the band leader or your manager cash after the gig. If you have a manager, make sure he/she is honest. It is mostly the managers job to make sure you are paid for your work, he/she will then disburse the money to each member of the band & to any crew you may have. The manager will also take care of pa hire etc. Occasionally you will come across some Muppet that will attempt to short change you. This happened to me once, we were playing at a Christmas party for the local footy team, some team members didn't like our particular brand of rock n roll, I think they wanted Christmas carols or something, they should have hired the local church choir. Anyway the gig was mentioned on a local radio station, about the time these whingers were having their say, a couple of bus loads of guys from a couple of motorcycle clubs turned up. Soon the publican was too busy serving drinks to his new enthusiastic clients. After the gig was over the publican refused to pay us saying that some in the football club were unhappy. Our singer pointed out that he had just had the best bar take in the joints history, He then went outside to his 4 wheel drive ex firetruck, and proceeded to chain the front of the pub to his truck. He said mate. If you don't pay us we will pull yer damn pub down. We got paid with a bonus. And that is how a musician gets paid. ",
            "date": "Answered May 5, 2019",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Baldassarre",
                "href": "/profile/Joseph-Baldassarre-1"
            },
            "answer_text": "Only approach venues that pay and have an amount in mind. You might want to put together a Promo Pac including repertoire, equipnent, contact info, website including examples of performances, and your fee. ",
            "date": "Answered May 21, 2020",
            "views": "25",
            "upvotes": " Answer requested by Marrior Kenneth"
        },
        {
            "author_info": {
                "name": "Lucero De'Lucero",
                "href": "/profile/Lucero-DeLucero"
            },
            "answer_text": "For their recordings companies like BMI or ASCAP collect fees every time the song is played anywhere in the entire world. Those monies are then paid to the artist. For concerts it's either their personal manager or the production company that negotiates a fee for a concert and makes the arrangements for the artist to receive that fee. ",
            "date": "Answered May 5, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vijay Dalal",
                "href": "/profile/Vijay-Dalal"
            },
            "answer_text": "Get connected with some film industry directors/short film directors/bands. You might have to go through auditions to get selected. ",
            "date": "Answered May 29, 2016",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Mileti",
                "href": "/profile/Frank-Mileti-1"
            },
            "answer_text": "Be the best that you can be and the rest will follow. Learning music theory is your key to success. ",
            "date": "Answered May 21, 2020",
            "views": "5",
            "upvotes": " Answer requested by Marrior Kenneth"
        }
    ]
}