{
    "title": "How much money do the musicians in Elton John's band make? - Quora",
    "tags": [
        "Elton John",
        "Musicians",
        "Wanting and Making Money",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Larry Cain",
                "href": "/profile/Larry-Cain-13"
            },
            "answer_text": "I don’t know if anyone really knows other that the band themselves. But Elton has always been known to be very generous. In 1970 with the 3 piece band the pay went like this. The pay from concerts, less expenses, were divided so Elton got 50% of the take and the band split the other 50%. That means Dee and Nigel got 25%. Unheard of for sidemen. As Elton’s popularity grew management restructured that bands pay as management felt they were making way too much money. So with all the touring they did, they made damn good money. Right now his farewell touring band has 6 members and the tour is grossing millions. No matter what the percentage they make, they are well paid. Also, back in the 70’s, Elton was so happy with their input on recordings that he saw to it that Dee, Davey and Nigel also got royalties from sales of albums on which they played. I never heard of any other artist that paid his band album royalties. It was a long time ago, like maybe 1974, that Nigel Olsson once said “People tend to think of us as hired sidemen instead of contributing musicians.” Apparently Elton saw their true value. ",
            "date": "Updated August 12, 2020",
            "views": "22",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Maples",
                    "user_href": "/profile/Daniel-Maples-1"
                },
                {
                    "user_id": "Lewis Bellamywells",
                    "user_href": "/profile/Lewis-Bellamywells"
                },
                {
                    "user_id": "B J Van Camp",
                    "user_href": "/profile/B-J-Van-Camp"
                },
                {
                    "user_id": "Philip David Williams",
                    "user_href": "/profile/Philip-David-Williams"
                },
                {
                    "user_id": "Sjaak Blaauw",
                    "user_href": "/profile/Sjaak-Blaauw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Isaac",
                "href": "/profile/Martin-Isaac-1"
            },
            "answer_text": "No idea though I am sure the likes of Davey Johnson, Nigel Olsson and Ray Cooper are doing very well (deservedly).  Partial songwriting credits on the odd track (eg Johnson is credited on I Guess That's Why They Call It the Blues), wider involvement (Johnson again was at one point Elton's musical director as well as a band player, not sure if he still is), and their importance to core fans (on some gigs Cooper has even shared in the billing, ie \"Elton John and Ray Cooper in concert\") must mean they are earning well above what an average backup musician would. ",
            "date": "Answered December 31, 2015",
            "views": "42",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                },
                {
                    "user_id": "Sophie Osrev Ol",
                    "user_href": "/profile/Sophie-Osrev-Ol"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                }
            ]
        }
    ]
}