{
    "title": "How to get a deeper, more powerful singing voice - Quora",
    "tags": [
        "Singing Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Skip",
                "href": "/profile/John-Skip-1"
            },
            "answer_text": "Confidence is the key. I’ve read a lot of your other questions and strongly believe that they have the best intention behind them but are misguided. You don’t “need” anything to be an extraordinary woman, or to sing “deeper”, or to be less nervous, or look a certain way. What you “need” is self love and acceptance of who you are. Don’t mistake looking a certain way with being a certain person. A good example of this is the psychologist Carl Jung. He was a great psychologist because he experimented on himself and reflected on his own feelings and thoughts. He didn’t need anything to do that apart from himself and a belief in something greater than himself. He also had to explore things that he didn’t like in order to know he didn’t like them (obviously not extreme things like murder etc.) but analysing the choices you are making and being nervous all stem from a lack of confidence. Say no to the voice inside your head that tells you “you aren’t good enough” or you aren’t this or that. Start by doing what you think will better yourself THEN analyse whether it worked. Don’t start by thinking of every outcome and situation and then trying to figure out whether it’s the best one (I wouldn’t be very confident either if I could undermine everything I did before I did it). Paralysis by analysis! Take a deep breath and commit to try something. Do it to the best of your ability. Then look at the consequences and accept that it was your doing. Take responsibility for your actions. Don’t blame anyone else. Love who you are and learn to accept that no one will ever be perfect. Don’t be so harsh on yourself. Just keep moving forward with a critical loving eye. If you want to sing deeper then start by getting a good teacher who can teach you about tight sternocleidomastoid muscles and dropping your larynx. But I think the problem stems from a different place. :) Lots of Love and best wishes ",
            "date": "Answered January 22, 2019",
            "views": "440",
            "upvotes": " Answer requested by Victoria Robinson",
            "upvoters": [
                {
                    "user_id": "Deepankar Dhariwal",
                    "user_href": "/profile/Deepankar-Dhariwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Williams",
                "href": "/profile/Jonathan-Williams-919"
            },
            "answer_text": "Relax your throat when you try to speak lower than normal you voice is less likely to crack. Aim to relax your throat as much as possible, so that you do not tighten your vocal chords. Also moisten your voice box and keep it sounding clear by working up a little extra saliva occasionally and swallowing. Perform reading exercises, choose a passage from one of your favorite books or articles. Practice reading the passage slowly and with a low voice. If you find yourself reading too quickly, you may notice your voice will lose its timbre. Keep your chin up, breathe through your belly and read the passage. Keep practicing this until you’re able to read it fluently while still maintaining the deeper voice. ",
            "date": "Answered December 12, 2019",
            "views": "570",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sohil Shah",
                    "user_href": "/profile/Sohil-Shah-14"
                },
                {
                    "user_id": "Ed Ireland",
                    "user_href": "/profile/Ed-Ireland-1"
                },
                {
                    "user_id": "Kevin McCarthy",
                    "user_href": "/profile/Kevin-McCarthy-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaguar Terry",
                "href": "/profile/Jaguar-Terry"
            },
            "answer_text": "Our vocal chords are individually, uniquely designed. Think of it like ones height, some are tall, some average, some short. This principle applies to our vocal chords as well, so just as there’s no way to alter our height, there’s not much we can do to alter our vocal ranges. It’s a genetic trait. Remember to always project from the belly, not the throat of that helps any. SN: I used to want a beautiful sounding falsetto to exit my mouth, but I had to settle with my tenor-baritone. Sopranos probably wish they had what I had, but this is my secondary point. No voice is perfect and you’ll never be fully satisfied until you become fascinated with what you have. Don’t strain your vocal chords reaching for those lows, that can cause permanent damage. Appreciate your ranges, someone wishes they had yours. ",
            "date": "Updated July 1, 2018",
            "views": "361",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victoria Robinson",
                    "user_href": "/profile/Victoria-Robinson-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noah Pikes",
                "href": "/profile/Noah-Pikes"
            },
            "answer_text": "In my own experience there is no simple or single answer. But work has to be done on a physical level, which simultaneously engages the imagination. Images such as giants, large trees, whales, gorillas, monsters, double basses, fog horns, and their voices or sounds can be an inspiration for research. Giving oneself permission to explore such unconventional sounds is a fundamental prerequisite. That is because you will often not succeed in reaching something you are hoping for, or even already hearing in your imagination. Repeating many times is really important, so that gradually mind and body start to collaborate in new ways and new voices. But Rome was not built in a day, return every week to that frame of research and practice, even every day for 20 or 30 minutes. Best wishes. Noah Pikes ",
            "date": "Answered May 6, 2018",
            "views": "311",
            "upvotes": " Not for Reproduction "
        },
        {
            "author_info": {
                "name": "Cheyenne Hoopkins",
                "href": "/profile/Cheyenne-Hoopkins"
            },
            "answer_text": "Sing along to songs with deep, slow, loud voices like Adele (but only if you have the vocal range to match her, otherwise choose someone else) and sing along trying to control your breathing and matching pitch, basically just following the song exactly and learning as you go. If you can eventually sing along to a lot of their songs well, I’d say your voice has improved quite a bit. ",
            "date": "Answered May 4, 2018",
            "views": "213",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ty Roberts",
                "href": "/profile/Ty-Roberts-19"
            },
            "answer_text": "Sulfur hexafluoride ",
            "date": "Answered May 7, 2018",
            "views": "124",
            "upvotes": "0"
        }
    ]
}