{
    "title": "How many times did Jimi Hendrix light his guitar on fire? - Quora",
    "tags": [
        "Jimi Hendrix (musician)",
        "Guitarists",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Onam Kiazi Emmet",
                "href": "/profile/Onam-Kiazi-Emmet"
            },
            "answer_text": "I believe only once. Monterey Pop I think? Sorry; not an expert, but I only recall that one well-known case. And it should be noted that he destroyed his real guitar, not like these buffoons who came after, who made a point of switching to cheap knock-off guitars before smashing up their instrument. I remember Ritchie Blackmore made a guitar-smash part of his regular routine, so he toured with a truck full of throwaway fake Strats. Every night, at the appointed time, he’d slip behind his amp, trade his white Fender for a fake white Strat, play a few chords, then proceed to destroy it. Really silly. ",
            "date": "Answered June 5, 2017",
            "views": "11",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Van Overveld",
                    "user_href": "/profile/Jan-Van-Overveld"
                },
                {
                    "user_id": "Ian Stobie",
                    "user_href": "/profile/Ian-Stobie-2"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Sean O'Flynn",
                    "user_href": "/profile/Sean-OFlynn-1"
                },
                {
                    "user_id": "Aubrey Rumore",
                    "user_href": "/profile/Aubrey-Rumore"
                },
                {
                    "user_id": "Kabir Singh",
                    "user_href": "/profile/Kabir-Singh-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Denning",
                "href": "/profile/Erik-Denning"
            },
            "answer_text": "More than just at the Monterey Pop festival, but not too many times, if he could help it. For some context Jimi knew it was just a silly gimmick from the beginning and he hated being known for guitar burning and smashing instead of his music.Jimi also knew The Who were already smashing instruments and he didn’t want to be perceived as a follower.Jimi didn’t like the idea of “the wild black man, out of control” as a stage show.The guitar burning just didn’t come naturally to him. It was a contrivance from the beginning, used to get press coverage. ",
            "date": "Answered July 14, 2017",
            "views": "624",
            "upvotes": "0"
        }
    ]
}