{
    "title": "How do bands make money? - Quora",
    "tags": [
        "Independent Music",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "Wanting and Making Money",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Indie Panda",
                "href": "/profile/Indie-Panda"
            },
            "answer_text": "It’s a well-known fact that the traditional music business has more or less flip flopped on itself following the turn of the century. Record sales were once the primary driver of the industry, with bands touring and selling merch in order to promote an album. Now, a recorded album is often a loss-leader for touring and merch, which now drives the industry. Consequently, the way bands make money has drastically changed over the last few decades. Here are three main revenue streams for bands today: Touring/Live ShowsMerchMusic PublishingKeep reading to find out how each of these revenue streams work, as well as gaining a few pointers on how your own band can take advantage of them. 1. Touring/Live Shows Touring/live performance ticket sales serve as the primary source of income for most bands today. Tickets are often sold on a tiered system, with each succeeding tier featuring more preferable seating and/or VIP add-ons. VIP add-ons may include a meet-and-greet with the band, album signing, soundcheck attendance or an acoustic session earlier in the day. How you can earn money from touring/live shows: Once you’ve honed your skills in a live environment and began building a solid fanbase, you can either start charging for your own shows or support more established bands. Tickets for an unsigned show generally range from $5-$15. If you’re booking your own show, you will most likely have to place a deposit with the venue. Therefore, it’s highly recommended that you shop around to find the best deal and start promoting the show well in advance to ensure you break even. If you’re dealing with support slots (either playing one or featuring a band as part of your own show), you’ll have to come to an agreement on how to split the income. 2. Merch Merch is often the second main income source for bands. Whilst clothing is often the go-to product for merch, many bands feature an entire product range. This can include coasters, bottle openers, tote bags, mugs, posters and more. Merch is often designed by a graphic designer and then manufactured by a supplier, before being sold at a marked-up price by the band. How you can earn money from merch: I firmly believe that you should invest in merch as soon as you start playing live. When you’re first starting out, your main priorities will be honing your live skills and building up your following. As you will most likely be playing free or low-paid gigs, merch is a great way to recoup travel expenses or even make an overall profit. In addition, those who buy your merch are essentially paying to become walking billboards for your band. People will think nothing of spending a small amount of money on a shirt or a bottle opener, especially if they liked your set. Most merch is cheap to manufacture and you can get started with as little as $100. Profits can also be re-invested in order to scale up your product range. When scaling up your product range, it’s worth including both low-priced and high-priced items in order to appeal to as many people as possible. Additionally, make sure your clothing is seasonally appropriate; hoodies might be a great investment in October, but a poor investment in May. If you’re looking to get started, I’d highly recommend Printful as a supplier. They feature a wide range of products at extremely affordable prices and also offer dropshipping services. 3. Music Publishing Music publishing is a significant, yet often-misunderstood income source for bands. Like all intellectual property, songs and recordings come with a set of rights. When a song or recording is used by others, the owner(s) of the property are entitled to various royalties. Organizations that use intellectual property (such as radio stations, streaming sites and venues) are required to pay a license each year, from which those royalties are distributed. Royalty collection and management is a somewhat complicated and time-consuming process, which is why most bands sign with a publishing company to do it for them. Publishing companies make money through commission and also provide other services, such as pitching music for sync deals. How you can earn money from music publishing: If you’re writing original music, making recordings and and having your assets used by others, you’re entitled to royalties. I’d strongly recommend signing to a music publisher as soon as you start releasing new music; this will ensure you receive all royalties you’re owed from each live performance, radio play etc. Additionally, most music publishers will actively pitch your music for sync deals, which can be very lucrative. If you’re looking for an effective and fair music publishing deal, I’d highly recommend Sentric Music. They effectively collect and manage royalties as well as actively pitching music for sync deals. They take a flat 20% commission on royalties and 25% on sync deals with no initial setup fee. Hope this was helpful! The above answer is actually a brief excerpt from a detailed article called How Do Bands Make Money Today? | Indie Panda - feel free to check it out if you’d like a few more pointers on how a band can make money ",
            "date": "Answered February 26, 2019",
            "views": "445",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jake Haslam",
                    "user_href": "/profile/Jake-Haslam-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurt Schaffner",
                "href": "/profile/Kurt-Schaffner-1"
            },
            "answer_text": "I was in a band for 12 years and although we did alright financially, it was no cake walk earning the money. Playing clubs is hard, really hard because many (if not all) of the patrons don’t even acknowledge you. Basically, you’re just background noise, like a glorified suped-up jukebox. Anyway, there are two ways you normally get paid at clubs; a set amount, or whatever is taken in at the door (that’s why most clubs have cover-charges). You can make more money by going out on local tours but that doesn’t always work in your favor because many times you wind up spending more than you make. If you get to be good enough and get “signed,” to a major label, and/or an indie label you can make a good chunk of change. However, you have to be real careful to read the entire contract (including the small print) before you sign, or you might get screwed over. The last thing I can think of to make money is going to the “crossroads” and make a deal with a demon…lol (just kidding). ",
            "date": "Answered May 1, 2019",
            "views": "721",
            "upvotes": " Answer requested by Paul Barker"
        }
    ]
}