{
    "title": "How to make a really good song with lyrics - Quora",
    "tags": [
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom McLintock",
                "href": "/profile/Tom-McLintock"
            },
            "answer_text": "I apologize up front for this answer, because you aren’t going to like it. You make a really good song with lyrics the same way you get to Carnegie Hall: practice, practice, practice. Or, be born with a natural gift for it. But since you asked the question, the only answer for you is the first one. I can really only address the first part of your question, anyway (how to make a really good song) - my attempts at lyrics have been laughable. I’d say, first decide whether the music or the lyrics is more important to you, and work on that. It’s probably easier to fit a melody to words than the other way around, but that’s just my experience. Words suggest rhythm and melodic contour; melody only vaguely suggests a mood, rarely actual lyrics. Writing a good melody is a mysterious process; ask anyone who has tried it, even those who are good at it. You can try either playing chords and humming along with them, or playing (or humming) a tune - with or without chords, depending on your skill level. It’s important to be patient with yourself and to go with your instincts. If you have some sort of recording device, record everything you try. I have a degree in music theory but I haven’t mentioned anything about using it to help you write music. Whether or not you know any theory, I’d advise you not to rely on it; instead, rely on your ear completely. If you can’t trust your ear, you shouldn’t be writing music. The only tricky thing about your ear is the problem of unconsciously writing something you’ve heard before. That bugs me all the time and I’m always on the lookout to try to avoid using someone else’s tune. Back to the initial point I made, make lots of songs, write lots of lyrics. Most of them will be, uh, disappointing, but with practice (practice practice) - and some fine “tuning” - more and more will be something you’ll want to share. ",
            "date": "Answered October 6, 2020",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Shea",
                    "user_href": "/profile/Darren-Shea-1"
                },
                {
                    "user_id": "Diana Smith",
                    "user_href": "/profile/Diana-Smith-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Kronis",
                "href": "/profile/Aaron-Kronis-1"
            },
            "answer_text": "Stop trying. just write. a lot. eventually you will get what you need. the producer’s role (if you self produce, this is you) is to sift thru that and ‘find the good songs’ to record… which may end up golden only when finished! it’s like ANYTHING else.. skiing, skateboarding, baseball, hockey… you have to do it a LOT to be really good. it’s not gonna likely happen on the first few records… just make a lot of records. here’s the FIRST RECORD I’VE DONE WHERE I DON’T FEEL THAT ANYTHING WAS COMPROMISED KRONIS[spotify] KRONIS[youtube] - Aaron ",
            "date": "Answered October 11, 2020",
            "views": "246",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shayna Lta",
                    "user_href": "/profile/Shayna-Lta"
                }
            ]
        }
    ]
}