{
    "title": "How to get my song to a music producer - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Moreno",
                "href": "/profile/Jacob-Moreno-63"
            },
            "answer_text": "Allow me to share with you My role as best defined by the recording Academy: The person who has overall creative and technical control of the entire recording project, and the individual recording sessions that are part of that project. He or she is present in the recording studio or at the location recording and works directly with the artist and engineer. The producer makes creative and aesthetic decisions that realize both the artist's and label's goals in the creation of musical content. Other duties include, but are not limited to; keeping budgets and schedules, adhering to deadlines, hiring musicians, singers, studios and engineers, overseeing other staffing needs Now, on occasion I come across street performer's who would fit well into a project that I'm already working on as a supporting studio musician. Grooming new talent and bringing them into the fold takes an immense commitment by a dedicated team of other various coaches. In terms of talent acquisition/discovery I may consult copyright lawyers, Talent A&R's and artist manager's. All of which spend countless hours listening to unsolicited material searching for the next big act. All of this having been said- if you “got your songs to a music producer....what would you want said producer to really do with them? Ask yourself the question “am I seeking validation that I'm a good songwriter?” Or “ Am I truly prepaired to have my works and/or talent completely picked apart and critiqued.” If you need validation- try out a local open mic night. If you know that what you've got is a diamond in the rough and that as a musician you're undeniably great at what you do- than it is your duty to know how to navigate the industry at all costs. ",
            "date": "Answered October 30, 2019",
            "views": "266",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antonio Navarro Ros",
                "href": "/profile/Antonio-Navarro-Ros"
            },
            "answer_text": "The first thing that I would do is to know who’s the producer of the tracks or albums that I like very much. And call or send an e-mail asking them how they work and how many money it will cost. Then, according to their response, you can decide if send them your song. If they don’t like your song you can try with another producer and so on until you make good relationship with only one. ",
            "date": "Answered March 27, 2018",
            "views": "269",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vidya Dean",
                    "user_href": "/profile/Vidya-Dean"
                },
                {
                    "user_id": "Nikhil Sharma",
                    "user_href": "/profile/Nikhil-Sharma-253"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darrell Ellis",
                "href": "/profile/Darrell-Ellis-3"
            },
            "answer_text": "Vidya, some producers have representatives and you'll need to find out who those representatives are before you submitting unsolicited material. Some producers may be independent and you may be able to contact them directly. Sometimes you can get their information through what they have set up through BMI or ASCAP. You will have to search them out depending on which producer you're trying to contact. That would be the best advice that I can provide you, there may be others that may have a different opinion than my own. Best Wishes, D ",
            "date": "Answered March 9, 2018",
            "views": "225",
            "upvotes": " Answer requested by Vidya Dean",
            "upvoters": [
                {
                    "user_id": "Aman Shukla",
                    "user_href": "/profile/Aman-Shukla-106"
                },
                {
                    "user_id": "Jamal Wilkins",
                    "user_href": "/profile/Jamal-Wilkins-1"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Vidya Dean",
                    "user_href": "/profile/Vidya-Dean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fresh Produce",
                "href": "/profile/Fresh-Produce-4"
            },
            "answer_text": "Google music producers in your area Setup an appointment with them. Show them your song and see if they can help you ",
            "date": "Answered March 20, 2018",
            "views": "225",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Alexis",
                    "user_href": "/profile/Tom-Alexis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sava Milivojevic",
                "href": "/profile/Sava-Milivojevic"
            },
            "answer_text": "Send him an email or a private message including a link of your track. ",
            "date": "Answered March 4, 2018",
            "views": "108",
            "upvotes": " View 1 Upvoter "
        }
    ]
}