{
    "title": "How to improve my singing voice gradually - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaitsiri Mongkolsmai Lin",
                "href": "/profile/Gaitsiri-Mongkolsmai-Lin"
            },
            "answer_text": "Find a really good teacher and go for lessons. Without them, it will be hard to gain the consistent performance that you want. That consistency only comes with regular correct practice, a building of muscle memory and synapses in your brain, associated with the sensations of singing in a healthy way. If you are mimicking others, find some to mimic that have proper technique. Depending on what genre(s) you like to sing, you may have trouble finding someone with excellent technique. I would recommend that you look for other answers in Quora, there are a number of trained singers and some aspiring singing students that have responded about methods for learning to sing, either online or without a teacher, what you can do before you can afford a teacher, what other resources there are, and things to try, tips on what to avoid, vocal health, and much more. Check out the FAQ for the Singing topic. The good thing is that you want to do so gradually. Carefully, one technique at a time, then a few techniques to be maintained at a time, is the way to go. In case you have any poor vocal habits you’ll need to unlearn, you don’t want to push further without the guidance of trained ears. If you find yourself being inconsistent, look first to your general health. Sleep enough on a regular schedule, drink enough water, avoid mucus generating and irritating foods such as dairy and spicy or acidic things. Heartburn doesn’t feel too good on the vocal cords. Start with breathing exercises and trills, learn how to keep your breath even, do visualizations about removing tension, and put your hands on your head and neck to feel where you are creating tension. Learn about tongue placement, soft palate and nasality, diction and vowel tuning, consonant softening, things like this. To some extent you can train your own voice, but there is a risk if you don’t have trained ears. If you can’t afford regular lessons, I highly recommend at least saving up for a few starter ones with a really excellent teacher. Some teachers will do a free or reduced fee trial lesson, to see if you mesh with each other. Those can give you tips or starting points and a recording to go off of. If you’re patient, it will never be too late to start lessons. I started when I was 39 and it’s been worth it. Sure, it would have been nice to take them in my 20’s, but it was a big investment and I held off for almost two decades. I don’t know if the teachers I took the two trial lessons from would have taught me what I know now, either. I did research to really pick a teacher I could trust, and it has paid off for me. Hopefully you will figure out what you can do to be happier when you sing, more consistent, and sounding like you, and not copying someone else. Finding your own voice is a long process, but a very joyful one. ",
            "date": "Answered March 12, 2017",
            "views": "196",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mukul Yadav",
                    "user_href": "/profile/Mukul-Yadav-57"
                },
                {
                    "user_id": "Riddhi Mahaldar",
                    "user_href": "/profile/Riddhi-Mahaldar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hunter Button",
                "href": "/profile/Hunter-Button-1"
            },
            "answer_text": "Lessons will serve you so much better than any advice we can give you; many techniques need to be taught differently to different people. Lip trills are kind of boring but probably the single best exercise in my opinion. Lip-trill the first 5 notes of a song, spending 3 seconds on each note. Then lip trill the 3rd through 8th note of that song, doing the same thing. Continue like this and repeat the whole process a time or two. Then start expanding to lip trill the 1st through 15th note, but this time lip trilling on tempo instead of just doing 3 seconds each. Then when you feel like you’ve got it totally down, lip trill through the whole song. Then try it with words, 1st through 5th, 3rd through 8th etc.. By now you’ll likely already be singing the song noticeably better. It’s a kind of long process per song but that’s one thing I find helps nearly everyone. Still go get lessons if you want more personalized advice though. ",
            "date": "Answered March 11, 2017",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcelo Soares",
                "href": "/profile/Marcelo-Soares-1"
            },
            "answer_text": "Take singing classes to learn some exercises. ",
            "date": "Answered February 10, 2019",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brianna Mullen",
                    "user_href": "/profile/Brianna-Mullen-6"
                },
                {
                    "user_id": "Seb Bagley",
                    "user_href": "/profile/Seb-Bagley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marijana Maric",
                "href": "/profile/Marijana-Maric"
            },
            "answer_text": "You need to control your body and voices you make,there is big amount of videos on the youtube where voice coaches explained how to improve singing and show easy practices for singing. ",
            "date": "Answered February 11, 2019",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brianna Mullen",
                    "user_href": "/profile/Brianna-Mullen-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Martin",
                "href": "/profile/Fred-Martin-33"
            },
            "answer_text": "Yes, you will improve, with improved technique and more practice. If you have some training this won.t be so much of a problem. If I sing now the sound will not vary that much on the next, day when I sing- If I sing for a friend I have confidence that I will be on the note, that is what being taught will do you for, You will be consistent. If you like ask me another question about singing. ",
            "date": "Answered March 11, 2017",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cal White",
                "href": "/profile/Cal-White"
            },
            "answer_text": "This is exactly how I was for most of my life. I'm still not a great singer, but I improved by getting two pieces of advice. The first was to make sure I was singing the song in the correct key for my voice (which may or may not match the recording). The second was this: the only way to get better at singing is by singing. Keep practicing. ",
            "date": "Answered March 11, 2017",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prachi Chaurasia",
                "href": "/profile/Prachi-Chaurasia"
            },
            "answer_text": "Try karaoke …there are many apps on Google store ..download em.and start singing . ",
            "date": "Answered March 11, 2017",
            "views": "62",
            "upvotes": "0"
        }
    ]
}