{
    "title": "How to fix my guitar's input jack - Quora",
    "tags": [
        "Gibson ES-335 (electric guitar)",
        "Hollowbody Guitars",
        "Guitar Repairs",
        "Gibson Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lesak",
                "href": "/profile/David-Lesak"
            },
            "answer_text": "Thanks for the A2A. It depends what is wrong with the input jack. But unless it is an active circuit or stereo, there are only two wires to worry about, and chances are that one or both of the wires has/have become loose, or has/have a bad solder connection. It is really very easy to fix, possibly a little more difficult with some types of guitar, but once you have managed to actually get to the inside of the jack you will quickly be able to see which wires are faulty. Typically there will be one longer lug and a shorter one. One will be positive and the other negative. The negative cable will always go to ground (earth). All you really need to do is unsolder each of the wires in turn, cut off the remaining bit of wire at the tip, then strip the wire back so that a fresh section is revealed. Then you need to tin the copper wire with solder using a hot soldering iron and solder the cable back to the lug on the input jack. Do the same with the other wire and you should be good to go. If I were you I would make sure that all the nuts are securely tightened in the socket of the output jack in order to prevent them coming loose and causing the input jack to rotate inside the socket, as this is probably what caused the wire or wires to become loose in the first place. Do a search on Youtube for instructional videos on guitar maintenance, and you should be able to find a video which shows you how to do this repair, in case you are unable to follow my instructions. ",
            "date": "Answered October 14, 2018",
            "views": "180",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Krohne",
                    "user_href": "/profile/Martin-Krohne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Cianfanelli",
                "href": "/profile/Nicholas-Cianfanelli"
            },
            "answer_text": "Hi, You either have a bad solder joint or, more likely, the tip leg of the jack has bent too far backwards. The problem for you now is that hollow and semi-hollow body (the ES335 is technically a semi-hollow) guitars are tricky to work on. If you don't know a few essential tricks beforehand they can and will drive you crazy. Anybody who had to fish out a jack or even worse a potentiometer that dropped into the body and put it back in place knows what I'm talking about. So research the job ahead thoroughly, find some high gauge fishing line, an old high E string, long needle-nose pliers, a set of screwdrivers and the right socket wrench for the nut on the jack. Our friends at Amberdrag Records made this video that guides you through the whole process, but if you don't feel really comfortable doing it yourself please visit your local guitar tech. Cheers.  ",
            "date": "Answered June 29, 2019",
            "views": "163",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Carl Garthwaite",
                    "user_href": "/profile/Carl-Garthwaite"
                }
            ]
        }
    ]
}