{
    "title": "How to play + notes on piano - Quora",
    "tags": [
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anne Chen",
                "href": "/profile/Anne-Chen-41"
            },
            "answer_text": "It is not clear what is the context of this “+”. Does it have something to do with a music interval or a chord? If it is an interval or a chord, then it means the interval or chord is augmented. For interval, it is one half step higher than a major or perfect interval. For example a “+4 “ can be from C to F#. An Augmented chord has the 5th of the chord half a step higher than a major chord; e.g. C,E, G# for C augmented chord, abbreviated as C+ It is also possible this sign has to do with a Baroque ornamentation. A trill or a passing tone is sometimes indicated by a “+” sign. If it is ornamentation, then the fragment of music that includes this sign needs to be seen in order to know what notes might be played. ",
            "date": "Answered February 23, 2019",
            "views": "583",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathy Bridges",
                "href": "/profile/Kathy-Bridges-21"
            },
            "answer_text": "The piano notes are named using the first 7 letters of the alphabet: A, B, C, D, E, F, and G. This pattern then repeats over and over across the keyboard. We will think of the note C as our starting point, since it's the first note of each 12-note pattern. Most modern pianos have a row of 88 black and white keys, 52 white keys for the notes of the C major scale (C, D, E, F, G, A and B) and 36 shorter black keys, which are raised above the white keys, and set further back on the keyboard. Go to my Profile and you can find all about Learn Piano material there... ",
            "date": "Answered August 29, 2020",
            "views": "130",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leah Barker",
                    "user_href": "/profile/Leah-Barker-33"
                },
                {
                    "user_id": "Marilyn Crawford",
                    "user_href": "/profile/Marilyn-Crawford-21"
                },
                {
                    "user_id": "Tabitha Hansen",
                    "user_href": "/profile/Tabitha-Hansen-10"
                },
                {
                    "user_id": "Robin Warren",
                    "user_href": "/profile/Robin-Warren-47"
                },
                {
                    "user_id": "Irene Murphy",
                    "user_href": "/profile/Irene-Murphy-36"
                },
                {
                    "user_id": "Pat Franklin",
                    "user_href": "/profile/Pat-Franklin-18"
                },
                {
                    "user_id": "Jana King",
                    "user_href": "/profile/Jana-King-27"
                }
            ]
        }
    ]
}