{
    "title": "How to record a song at home - Quora",
    "tags": [
        "Music Recording",
        "Audio Recording",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Arter",
                "href": "/profile/Justin-Arter"
            },
            "answer_text": "Well, there are endless answers to that. It depends on your budget. I’ll give you a brief rundown of what I had when I was kinda serious about recording as a hobby. Prices are very rough estimates. Lower end Eurorack Mixing Board. I think it was 24 tracks. $300 Roland Boss BR-532 4 Track Digital Recorder (Digital had just come out so it was a lot…) $500 Regular Shure Microphones. 2 for vocals, 2 for the guitars. $300 Cheap Drum Mic kit from eBay. Superlux 3 reg, 1 kick (4 total) $200 A lot of Cords. Mic and Instrument. I just went with the cheap sale ones at GC. (We’ll just say 10 at $15 each) $150 Editing Software, mine was Free, and I can’t recall the prices. Add an extra $500 for misc stuff that pops up here and there. Of course you need your instruments. So in total we have around $1950 in 2003 prices. If you want to go with pro quality multiply that by like 10. With that budget setup I know for sure that radio ready music could have been made. I just found a demo my old band made on it before we went into a big studio, and it sounded amazingly similar to the pro recorded album that did make the radio (college and mainstream). I just started messing around recording again and I think it’s awesome how much stuff is free on our phones now. If you go into the app store and type in “recorder”, “music studio”, “drum machine”, “vocal effects” (I just wanted to play with auto tune…) you’ll be amazed. I was! There’s like a million dollars in 2003 money there for free! And for home recording, or just making a demo, you can find it. You’d just want little mixer board and a couple good mics. I just got one on my phone and my Chromebook called BandLab. It’s got everything you need to mess around. It’s like social media too. I’m not into it, but I could see people having fun with it. You can post your recordings, and I’m assuming you have to have your settings on “open” or something, but other people can add tracks to your music. So it’s like open source. Not for me, but kinda cool. But BandLab has everything else on it for free, and the drum machine is easy to use. I’m a real drummer, but I play guitar mostly now, so I just whip up simple beats and loop them. There are probably over 100 drum kits/effects. Keyboards, other instruments, etc…. Anyway, it’s free, and you can record stuff easily. And it’s on the computer and the phone. Phone is great when you come up with little riffs at work and stuff. So, definitely check out the app store. You can start recording in minutes, and then upgrade your mics and stuff as you go. Good luck and have fun. ***Oh yeah, I should mention, I’m pretty much only talking demo level stuff here. You could make a real album with all of the mentioned above stuff. But, when making a real album, you’ll probably want a bunch of cool stuff like reel to reel tape machines, and wacky good mics and stuff. That’s a whole different scenario. Best to find your local starving engineer/producer. There are a lot of them out there that have crazy talent, awesome ideas, access to studios, and they need the work! Maybe you can make the record that puts them on the map. My old Starving Producer runs sound and manages big touring acts for Capitol Records now. We didn’t make him famous though.. But we helped :) ",
            "date": "Answered May 18, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Hughes",
                    "user_href": "/profile/Richard-Hughes-234"
                },
                {
                    "user_id": "Brian Farr",
                    "user_href": "/profile/Brian-Farr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chernobyl Studios",
                "href": "/profile/Chernobyl-Studios"
            },
            "answer_text": "Big question, lots of answers. You have a lot of things to consider: What are you recording?Acoustic guitar, electric guitars, vocals, drums?What are your needs?Full band recording? Just want to record basic ideas? Looking to start producing your own material?What are your goals?What kind of quality are you after? Do you want to get into the world of mixing and producing, or do you just want to record your ideas down as rough drafts and tweak them here and there for fun?After answering these questions, you can search for the software and hardware that you’d need. In general, to record music at home with any kind of decent quality, you’ll need, at the very least: a dedicated audio interface such as a Focusrite 2i2 or PreSonus Audiobox;The reason for this is because your internal hardware audio device is not set up to handle the amount of audio date you’ll be asking your computer to stream and process all at the same time;You’ll need an interface to properly connect your microphone - do not use USB microphones;a Digital Audio Workstation (DAW);These range from absurdly expensive for no reason like Pro Tools, to completely free like Cakewalk by Bandlab;I would recommend Cakewalk by Bandlab because it is essentially Cakewalk SONAR Platinum, a DAW that used to cost $500. It was recently purchased from Gibson and made into a free alternative, but does not have crippling restrictions like other free DAW software.a relatively decent computer or laptop;Most importantly, a good CPU and lots of RAM, at least 16GB. You’ll need more if you plan to do any extensive work with software libraries.a decent pair of closed-back headphones for tracking;You’ll want to monitor what you’re doing and use a metronome, and closed-back headphones will help reduce outside noise.So, first, I’d recommend that you completely understand what you, yourself, want to do and what exactly you want to accomplish, and then seek out what you need to meet those needs. Good luck! ",
            "date": "Answered May 18, 2018",
            "views": "397",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Hughes",
                    "user_href": "/profile/Richard-Hughes-234"
                },
                {
                    "user_id": "Samrat",
                    "user_href": "/profile/Samrat-79"
                },
                {
                    "user_id": "Om Raizada",
                    "user_href": "/profile/Om-Raizada"
                }
            ]
        }
    ]
}