{
    "title": "How similar is the saxophone to the clarinet? - Quora",
    "tags": [
        "Clarinets",
        "Saxophones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jordan Johnson",
                "href": "/profile/Jordan-Johnson-19"
            },
            "answer_text": "Quite similar: Both are single-reed instruments: they produce sound by the vibration of a single piece of cane attached to the underside of a hard mouthpiece.The fingering of a saxophone is identical to the fingering of the clarinet’s middle (“clarion”) register.The instrument is held the same way, left hand over right.Both have fairly similar embouchure — the way the mouth holds the mouthpiece is similar, at least to the extent that both use a lot of the same muscles in similar ways.Notable differences: The embouchure is different enough to take some practice to get used to when switching instruments. This is largely because of the angle at which the mouthpiece enters the mouth: more horizontal for sax, more vertical for clarinet. (However, many big-band and Dixieland clarinetists hold the clarinet farther out than classical players, and their sound is a bit more sax-like as a result.)The clarinet’s lower (“chalumeau”) and higher (“altissimo”) registers have different fingerings (because the clarinet’s registers are not an octave apart like the saxophone’s, as I’ve described in my answer to What are some interesting facts about the clarinet?)Being a metal instrument, the sax tends to have a more piercing sound.The sax has the fingers closing holes via pads, while the clarinet mostly requires the fingers to cover holes themselves.Sax reeds are bigger (and pricier, when last I was in the market).",
            "date": "Updated May 9, 2018",
            "views": "31",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Tomczyk",
                    "user_href": "/profile/John-Tomczyk-5"
                },
                {
                    "user_id": "Huw Peterson",
                    "user_href": "/profile/Huw-Peterson"
                },
                {
                    "user_id": "Benjamin Maybury",
                    "user_href": "/profile/Benjamin-Maybury"
                },
                {
                    "user_id": "Kaushik Mane",
                    "user_href": "/profile/Kaushik-Mane-1"
                },
                {
                    "user_id": "Ron Bauer",
                    "user_href": "/profile/Ron-Bauer-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Berke",
                "href": "/profile/Brandon-Berke"
            },
            "answer_text": "The other answers sorely lack the information of the various clarinet and saxophone sizes. The two instruments have single reeds. Both instruments have very similar key layouts. There are minor variations in key work. The larger clarinets such as the bass clarinet were actually invented by Adolph Sax, which is they they have a neck like a saxophone and a metal bell pointing up/down. Some clarinets have been made out of metal, typically today only a few brands make metal horns for the Contra Alto and Contra Bass Clarinets. Many of the refinements in the bass clarinet design explain similarities in with the saxophone. For example Alto Clarinet and Alto Saxophone reeds can be interchanged, and their mouthpieces are close in size. The Bass Clarinet and Tenor Saxophone Reeds are similar in size too, though the bass clarinet mouthpiece is much larger. The Soprano Clarinet reed is much narrower and longer than the Soprano Saxophone though. The differences are more so in the body style of the instrument where the clarinet is a more cylindrical and instead of over blowing like most wind instruments it over blows an octave and a half. This interval creates a gap and thus there are keys that bridge this issue. Smaller clarinets have open holes and rings instead of keys for all of the buttons. Saxophones and German Clarinets have roller keys which are similar but the Boehm system clarinet has redundant pinky keys for alternating between those keys instead of sliding across. ",
            "date": "Answered May 22, 2018",
            "views": "867",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shlomo Kut",
                    "user_href": "/profile/Shlomo-Kut"
                }
            ]
        }
    ]
}