{
    "title": "How would a guitar sound if you use bass pickups and a bass amp on it? - Quora",
    "tags": [
        "Bass (sound)",
        "Bass Guitar",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew McGregor",
                "href": "/profile/Andrew-McGregor-12"
            },
            "answer_text": "It’s easy enough to answer the amp question: great if you like a super clean sound, because bass amps are designed like PAs not to colour the sound very much. There are quite a few amps that are commonly used for guitar clean sounds that were designed for bass. Famously that includes the Fender Bassman, but some metal guitarists are starting to use Darkglass and EBS amps, and even some jazz players use EBS. The Darkglass distortion, in particular, is epic with guitar (and the blend knob is really useful, despite nearly all guitar setups lacking it). Many basses have active preamps onboard; they will work just fine, although the tone controls will sound a little odd as they have frequency ranges chosen for bass (this is just the same as most of the amps actually). The other way around, bass just sounds bad through a guitar amp; dull, lifeless, and boring. That’s if you don’t break the speaker with the much higher dynamic range thumps that come out of a bass. The pickups… well, firstly they won’t fit very well in a guitar body, but if you solve the mechanical issues and use a blade pickup so you don’t have a pole piece problem, you will find you have another: the magnets are much, much too strong. What that means is the magnets will put the brakes on the strings, and it will sound much like it is partially muted all the time, and not in a good way. You can find out what this sounds like without damaging a guitar by adjusting the pickup height all the way up close to the strings (just before it either touches or the magnet sticks the string to the polepiece). It sounds pretty bad, actually. The thing is, you can fix this with a guitar pickup just by backing it away from the strings, but with a bass pickup the field is going to be too strong to do that. Fortunately, you don’t really have to use actual bass pickups, because there are guitar pickups with the same kinds of designs. So if you want to try this and see what it is like in a music store some time, get an active guitar (say, Ibanez Iron Label) and plug it in to a Darkglass, EBS or Gallien-Kruger amp, and see what happens. It’ll work, and it sounds pretty cool. ",
            "date": "Answered October 11, 2017",
            "views": "43",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will DeMilio",
                    "user_href": "/profile/Will-DeMilio-1"
                },
                {
                    "user_id": "Mark Jordan",
                    "user_href": "/profile/Mark-Jordan-90"
                },
                {
                    "user_id": "Subhankar Das",
                    "user_href": "/profile/Subhankar-Das-12"
                },
                {
                    "user_id": "Wayne Knazek",
                    "user_href": "/profile/Wayne-Knazek-1"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                },
                {
                    "user_id": "Joe Lambin",
                    "user_href": "/profile/Joe-Lambin"
                },
                {
                    "user_id": "Jack Keable",
                    "user_href": "/profile/Jack-Keable-1"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Kirk A. Janowiak",
                    "user_href": "/profile/Kirk-A-Janowiak"
                },
                {
                    "user_id": "Bob Simard",
                    "user_href": "/profile/Bob-Simard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Yarritu",
                "href": "/profile/Daniel-Yarritu"
            },
            "answer_text": "You've got some good answers already so I'll just comment that you can search YouTube and find people using bass pickups on guitars with bass amps. Steve Lucas came up under a search and he has an interesting setup.  There's also the \"A Little Thunder\" pickup that looks interesting, which has a separate pickup for E and A built in. If I understood the literature correctly, it's not so much that it's a \"bass\" pickup for the low E and A but that there's an octave processor built in. This is interesting since the treble strings can stay unprocessed while the low strings sound an octave or two lower.  I understand Lucas also uses an octaver for his pickup so I'm not so sure that a \"bass\" pickup is really necessary. You can get plenty of low end from an octave pedal paired with a regular guitar pickup.  Sending that though a bass rig would be even better.  I use an octaver (an Electro Harmonix Pitch Fork) with my acoustic rig when I'm playing solo gigs or gigs where I only have a percussionist. I use it through a full range system so the low end is pretty good but I suspect the effect would be better going through a splitter into a separate channel since I usually have my acoustic pickup EQ'd a certain way that might not be ideal for the best bass tone.  Since pickups are basically magnets and copper wire I don't really see what's special about a bass pickup other than its made to fit the dimensions of a bass guitar and its string spacing etc. It might sound a little different if it's a large pickup with a longer coil but it probably won't be massively different. It seems like a lot of work to retrofit a guitar with a bass pickup when you might get the result you're looking for with a regular pickup and an amp/octaver. Keep in mind that your guitar will never sound exactly like a bass since the string gauges and scale length are so different.  Since the pole piece spacing is a problem I'd rather look for a split pickup system (I came across one guy making a split pickup for this purpose). You could also get a MIDI system which is also expensive and requires a good processor like the old Axon but works pretty well.  Also, a 7 string guitar puts out plenty of low end on that low B string. When I play mine it really doesn't feel like a \"guitar\" but really a guitar mixed with a bass.  Lastly, keep in mind that a guitar extends quite a bit into the bass range- our low E is down at the bottom of the bass clef in actual pitch. That's why we have to be careful with EQ when playing with a bass player or keys.       ",
            "date": "Answered March 14, 2016",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wayne Knazek",
                    "user_href": "/profile/Wayne-Knazek-1"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Bob Simard",
                    "user_href": "/profile/Bob-Simard"
                },
                {
                    "user_id": "Michael Vaughan",
                    "user_href": "/profile/Michael-Vaughan-21"
                },
                {
                    "user_id": "Wiish",
                    "user_href": "/profile/Wiish"
                },
                {
                    "user_id": "Christopher Kirk",
                    "user_href": "/profile/Christopher-Kirk-10"
                },
                {
                    "user_id": "Andrés Parzanese",
                    "user_href": "/profile/Andrés-Parzanese"
                }
            ]
        }
    ]
}