{
    "title": "How to rank Loona members from their voice - Quora",
    "tags": [
        "Loona (K-pop group)",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Junghwa' 'Maindo",
                "href": "/profile/Junghwa-Maindo"
            },
            "answer_text": "For Vocal Ranking StabilityTechniqueRangeBreath SupportVocal ProjectionTones1.Chuu - She already begin Main Vocalist. 2.Jinsoul - She looks began for Main Vocalist, I feel for her voice is tomboy style and she can hit high notes when Chorus has coming. 3.Haseul - She is Main Vocalist with soothing voice and she can hit high notes higher than Chuu and Jinsoul with opera voice but sadly she looks fitted only Ballad and Soul (Some songs can't fit exectly Girl Crush and Badass) and less lines. 4.Yves - She looks very strong for Lead Vocalist, Her voice so richy and very calm for listening. 5.Heejin - Same as Jinsoul but her voice so pretty unique and Jazzy voice but some songs its weird when this songs is Cute. 6.Kim Lip - She already begin Lead Vocalist, her voice looks very unique with distinguishable voice so she very calms when takes different vibes. 7.Choerry - I thinks she is the underrated Lead Vocalist. 8.Olivia Hye - She looks good for Vocalist, she strong for hit lower notes. 9.Hyunjin - Same as Olivia Hye but her voice very airy, she fitted as Sub Vocalist. 10.Go Won - She has Crunchy voice made hard for Vocalist. 11.Yeojin - Her voice so sweet and rarely cute, she can take different vibe when change concept but she looks hard for Vocalist. 12. Vivi - I loved her soft voice and easily for when someone beginning practics a song but she looks pretty weak for Vocalist. My Vocal Ranking !!WARNING!! *The Personal ranking have depending only personal preference.* Vocal ConceptsOverall Line DistributionsComfortable levelsTones1.Yves - I love her voice so pretty richy and take different concepts, Her overall line was fair. Exectly she can take lower notes C3. 2.Chuu - Her vocal so calm, She can take different concepts pretty good but i will need lower line. 3.Heejin - Same as Chuu Her Vocal pretty unique and comfortable but she was center and face of the group make no fair Line Distributions. 4.Choerry - Her vocal so very clam and can take different concepts, her overall line was fair but her Tone was little lacks when take high notes. 5.Jinsoul - She looks strong for her tones and calm. her overall line was average but some concept was uncompatible and weird exectly Retro and Cute make something weird. 6.Haseul - Her vocal so sweet, very comfortable, But she looks pretty unfairs line exectly her concept hard to fitted. 7.Kim Lip - Her voice very calm and unique, But her overall lines was unfairs and some songs she takes ballad make quite uncompatible and weird when chorus. 8.Vivi - Her voice looks easily for when someone beginning practics a song and soft when after sang made chillin good. But her weakness is Line Distributions and Tones. 9.Yeojin - She looks strongs for take different concepts and calm. But overall lines was unfairs and her Tone was lacks. 10.Olivia Hye - She can takes low notes and take different concepts pretty good. But overall lines was quite unfairs and uncomfortable. 11.Go Won - She can takes low notes or high notes. But her overall lines was pretty unfairs,hard to take different concepts and uncomfortable. 12.Hyunjin - She can take different concepts only one. Her vocal too airy, unfair lines and hard to control her Tones. ",
            "date": "Answered September 5, 2020",
            "views": "652",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Grakitty Xiao",
                    "user_href": "/profile/Grakitty-Xiao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brooke Liu",
                "href": "/profile/Brooke-Liu-3"
            },
            "answer_text": "I love all of them equally ugh, but here we go again. This is not by vocal ability but just my preference of each voice. I love all members and I think they’re equally talented. Heejin - her voice is so pretty, soothing and versatile. I’m a sucker for Heejins voice.Chuu - shes pretty main vocal material, her voice is so sweet and pretty. Pretty sure everyone loves Chuu’s voice.Olivia Hye - her voice is so smooth and silky and unique. I love it a lot.Hyunjin - not typical but I LOVE soft voices! Hyunjin’s is so pretty and airy.Haseul - sorry Haseul fans, I love our leader as much as anyone but I’m not that big of a fan of her voice. She is an amazing singer but I’m just not that into her nasally, opera voice.Choerry - Choerry’s voice is so cute, energetic and versatile as well.Kim Lip - very vocal capable but I’m not too big of a fan. She’s a good singer but her voice isn’t that special.Go Won - not something you’d typical listen to, but I LOVE Go Won’s crunchy vocals! They're so cute and pure!Yves - again very vocal capable her voice just isn’t that unique. If this was dance though…Jinsoul - Jinsoul has strong vocals and a unique voice but I don’t dig them too much.Yeojin - Ugh sorry I couldn’t put our lentil bean higher, I LOVE your voice as much as the rest of the girls, but BBC won’t let us hear too much vocals from you right!! and the vocals from My Melody and Kiss Later weren’t my favorite. Can’t wait to hear how it sounds now.Vivi - I love Vivi! But compared to the rest of the girls I have to put her last :( I love everyone’s voice, but Vivi’s is pretty weak compared to the rest, she’s improving so much though! I love her and can’t wait to hear from her!",
            "date": "Answered September 15, 2019",
            "views": "2",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlie Wass",
                    "user_href": "/profile/Charlie-Wass-1"
                },
                {
                    "user_id": "Chuu Luv",
                    "user_href": "/profile/Chuu-Luv"
                },
                {
                    "user_id": "Abigail Kang",
                    "user_href": "/profile/Abigail-Kang-6"
                },
                {
                    "user_id": "Olivia Ned",
                    "user_href": "/profile/Olivia-Ned"
                },
                {
                    "user_id": "James Chang",
                    "user_href": "/profile/James-Chang-38"
                },
                {
                    "user_id": "Steven Powers",
                    "user_href": "/profile/Steven-Powers-38"
                },
                {
                    "user_id": "Gabriella Isburg",
                    "user_href": "/profile/Gabriella-Isburg"
                },
                {
                    "user_id": "Lucy K",
                    "user_href": "/profile/Lucy-K-51"
                },
                {
                    "user_id": "Fauna Cliff",
                    "user_href": "/profile/Fauna-Cliff"
                },
                {
                    "user_id": "Asnita Novi",
                    "user_href": "/profile/Asnita-Novi"
                }
            ]
        }
    ]
}