{
    "title": "How to learn an instrument on my own - Quora",
    "tags": [
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Yao",
                "href": "/profile/Andrew-Yao-4"
            },
            "answer_text": "Depends on what level you'd like to achieve.1) Beginner:—You can make notes on instruments played by blowing (you can buzz on woodwind or brass instruments)—You can play basic songs, tackle basic rhythms—Sheet music is highly recommended to learn. Here, you can sight read basic songs, and anything that's a big harder, you can get right after a bit of practice—you learn your first scale. Typically, concert Bb —you’re uncertain about committing too much money into this hobby —you rent an instrument, borrow one (like from a public place), or find a cheap one (only few hundred dollars) 2) Between Beginner and intermediate—on blown instruments, you can more consistently play notes and sustain them. Imp—Your sheet music sight reading improves to incorporate more complex rhythms harmonies, and melodies—keyboard and percussion, play more complex notes 3) Intermediate—on blown instruments your tone improves, as well as your range. Articulation and dynamics are also better—your endurance is higher. You can play longer pieces with shorter breaks —keyboard instruments… you can play even more complex chords, and your fingers are quick enough to play 16th and even 32nd notes (although actual speed varies by tempo) —you’re familiar with some of the famous names in music, like Mozart, Beethoven, and John Phillip Sousa to name a very few —you’re willing to sink in more money for an instrument. Not bank breaking, but far from “impulse buy” —You’ve done research into what brands and models would suit your needs 4) Advanced —It takes you much fewer practices to get a piece ready for concerts and showing off (e.g. 8 rehearsals vs. 13) —you can sight read a majority of the sheet music correctly the first time —Much of the rhythms, patterns, notes, and expressions are a sort of “muscle memory” that you don’t even need to really think about them to play them. 5) Expert/Professional —you can participate in competitions and probably expect to do very good, if not win —You can actually make money off your talent —in the quote: Amateurs Practice Until They Get It Right Professionals Practice Until They Can’t Get It Wrong … you’re in the latter camp . Amongst those 5 stages above (mind you, something I came up with, and not anything of “musical scientific method” nor official), on average, I’d say many should seek instruction around step # 1.5. Yes, it’s possible that someone needs instruction from the get-go, while someone gifted can achieve reach the end on their own. However, I’d recommend going with an instructor for several reasons: They have knowledge that they can share, which takes the guesswork out of many thingsIf you’re really not cut out for it, they can provide you that unbiased opinionHaving another set of ears, one that’s experience listen to your tone, pitch, rhythm, dynamics, etc. is invaluable. Even if you record yourself playing, you’re still not “getting another set of ears on it”They can help motivate you. For example, one piano teacher of mine suggested that after this class, I completely stop playing “piece X”. She felt I’ve been doing it to death, it’d be good to put it on hibernate, and I’ve got other pieces and exercises to work on anyways. I resumed “piece X” a week later, and gotta say, it worked out pretty well!If you’re paying for it, you’ll hopefully be motivated to practice, and make a better effort. For you, since you’re sinking money and time. For the instructor since they may drop you if they feel you’re not doing your due diligence.If there’s an ensemble involved, you can have the experience of playing with others, and helping each other out.",
            "date": "Answered April 5, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gustavo Scheiffer",
                    "user_href": "/profile/Gustavo-Scheiffer"
                },
                {
                    "user_id": "Chelsea Mayol",
                    "user_href": "/profile/Chelsea-Mayol"
                },
                {
                    "user_id": "Alex Biosa",
                    "user_href": "/profile/Alex-Biosa"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Gordon",
                "href": "/profile/James-Gordon-171"
            },
            "answer_text": "The simple answer is yes; in theory you can teach yourself almost anything through books (and other resources) and intuition - but consider the value of mentors and teachers, even for those who are very talented and able to self-educate. Eventually you may outgrow your teacher, but they can help put you on the fast track to getting up to their level (and beyond). We all start as beginners, and beginners can always benefit from some basic direction and teaching (though the teacher must be very good in proportion to the student’s innate talent, otherwise there can be counter-productive effects). I play two instruments fairly well, piano I took lessons for many years, guitar I never had a single lesson. However, I did have a friend kind of mentor and guide me on guitar. We never sat down for more than a few minutes at a time to really do any “lessons”, but we would play together (jam, etc) and he definitely inspired me to become an advanced guitarist. I put a lot of things together by using other resources and my own creativity, but he made a huge difference in helping me out with good habits and technique from the very start. ",
            "date": "Answered May 13, 2020",
            "views": "235",
            "upvotes": "0"
        }
    ]
}