{
    "title": "How to sing without my voice cracking - Quora",
    "tags": [
        "Singing Tips",
        "Singing Voice",
        "Voice",
        "Singing",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Meers",
                "href": "/profile/Paul-Meers"
            },
            "answer_text": "That “crack” comes from an unintentional shift in register (chest/speaking/heavy vs. head/higher/light). The way to get rid of it is to practice daily - it will take time to develop and unify BOTH registers and the passaggio between them. To really get this right, you will need to study privately. Get an experienced teacher who has academic credentials. Until then, see the practice ideas below. Good luck! ~~~~~~~~~~~~~~~~~~~~~~~~~~ ABCs of Singing There’s an easy way to think about voice culture: the ABCs of Singing. The same things apply to the speaking voice. A is for Alignment. For singing, stand with feet a few cm. apart, NOT exactly parallel, with weight slightly forward on the balls of the feet. Feel a sense of energy in your feet and legs. Keep knees flexible, not tight. Raise your hands far, far above your head, and then allow them to descend and rest easily at your sides. Let your back be straight. Imagine there is a silver thread from the base of your spine out the top of your head that allows your body to float up, up, up. Allow the ribs to expand like an opening umbrella. It is never static or tight, but flexible and dynamic. As you practice, come back to these points, and refresh your alignment/posture. B is for Breathing. Exercise: “Breathe through a straw,” inhale through puckered lips. Immediately hiss out LOUDLY, with great energy from the middle of the body (abdominal area). Feel how this increases energy in the breath. Maintain alignment - don’t allow the upper body to collapse as you exhale. Return to this exercise a few times as you practice. As you sing, breathe LOW in the body, and imagine you have a tire inner tube around your middle; fill it up and lean into it. Always think “up.” C is for Coordination. Importantly, as you go higher, let the voice get lighter and brighter - don’t use a lot of pressure. But, allow the ribs to rise a little, and allow the energy from the middle of the body to increase a little. Don’t yell or scream - instead, slightly increase breath energy and expand your posture to make the sound a little higher or louder. Exercise: easily repeat one note with a breath between then sustain and crescendo diminuendo - get louder and softer [ a, a, a, a———- ] . Repeat the exercise on different vowels and higher note, several times. As you go higher, let the voice feel lighter and brighter.This is a very basic start. To really improve your singing voice, get a teacher with academic credentials in voice teaching. ",
            "date": "Answered July 11, 2019",
            "views": "252",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tara Polen",
                    "user_href": "/profile/Tara-Polen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Miller",
                "href": "/profile/Jeffrey-Miller-113"
            },
            "answer_text": "I have another answer that I wrote on Quora that you should read that can explain the issues that you might be having at the ends of your range, but here are some things you can do to take care of those issues. If you have allergies or acid reflux, be sure to treat those as soon as you can. Seasonal allergies can turn into year-round allergies if they go untreated (look into SCIT and SLIT{might work better}). Anytime you feel an itch, tickle, scratch, or urge to cough/throat clear(while singing or speaking) you have experienced phonotrauma. Phonotrauma is injury to your true vocal folds {TVFs} (A.K.A. your vocal cords).* Phonotrauma can be prevented by keeping well-hydrated, and preventing things from coming in contact with your TVFs, like acid reflux, post-nasal drip (allergies/colds), and other things.** *Voice rest can help encourage potential scarring/enable further tension build-up. Instead, briefly hum through one nostril on a low pitch with your mouth closed (wash, rinse, repeat). If you can, a better technique is producing a short even tone over a rolled “r” or lip trill. If you’re having issues maintaining a consistent buzz, exhale first because you’re probably using too much air. This technique can massage out tension and reduce swelling quite significantly, getting you back to your original voice (or maybe even better than you started). ;) **When phonating (the process behind the tone production in singing), we sometimes work harder than we need to (i.e. straining). This leads to something called false vocal fold constriction (the action behind the grunt, cough, and wheeze). The false vocal folds are right above the true vocal folds, and when we bring them together they can touch the surface of the true vocal folds and make it harder for them to vibrate effectively. To counteract that resistance, we tend to start increasing air pressure to keep them vibrating. This compensatory technique is essentially road-hauling your true vocal folds (this is bad). To counteract this, learn how to breath in without making any noise while you’re singing (false vocal folds create audible turbulence when they are not retracted and out of the way). If you’re having difficulty, drop your jaw and force yourself to yawn (very good at retracting your false vocal folds). Also, the most effective remedy for a dry throat is inhaling through the nose. It moisturizes, filters, and warms the air coming into your body. So, don’t be a mouth breather! :p Remember, singing should be comfortable. Yes, there is effort involved, but as an experienced and versatile vocalist, I personally do not subscribe to the “no pain, no gain” ideology. Hope this helps. OH! Also, find a teacher who is familiar with the Estill Voice Model. It’s a model for voice production that can help you gain incredible control of your voice no matter which genre you are singing in. ",
            "date": "Answered September 21, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Am",
                    "user_href": "/profile/Am-128"
                },
                {
                    "user_id": "Aryan Dara",
                    "user_href": "/profile/Aryan-Dara-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "Some tips I got through experience that have helped me crack less when I practice singing include as follows: Make sure that you are hydrated. A dry voice is very prone to cracking even in your lower and low-middle notes. A sip of honey lemon tea or a glass of warm water should be good enough to keep yourself from dehydrated before singing. Warm up and vocalise before you sing. When you do so, make sure that you are doing it properly in a healthy manner without adding unnecessary strain in your throat. Otherwise you will be setting yourself for trouble even before you start singing since you will not be having a voice afterwards. Do not sing with extremely high intensities right from the start. You are adding unnecessary weight to your vocal folds that will only build up and become even worse as the song continues by doing so, which can ultimately lead to cracking - do not be like the reckless driver that steps on the gas too much right from the start and eventually end up losing control and crashing. Learn to sing in your mix for high notes that require more solidity and power. Pushing your chest register too high can lead to cracking besides obviously hurting yourself by straining, but sometimes you would not want to go into falsetto to sing those notes either due to the nature of the songs you are dealing with. Grab yourself a vocal lesson if you have trouble finding your mix voice. ",
            "date": "Answered January 24, 2018",
            "views": "437",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Newman",
                    "user_href": "/profile/Daniel-Newman-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danelle Harvey, LL.M, LL.B. (Hons), M.L.S",
                "href": "/profile/Danelle-Harvey-LL-M-LL-B-Hons-M-L-S"
            },
            "answer_text": "I’m not sure why you have voice cracks but, regarding the voice cracks that I am aware of, sometimes just practising on scales, sirens, and slides can help to make the transitions between notes, reduce the cracking, and even smooth out the voice again. I work on this with my vocal training students and it does the trick over time and when done properly. There may also be a hydration issue. If your throat is excessively dry make sure to regularly hydrate with water and perhaps specialist lozenges for vocalists. There are many more things that you can consume but, to keep my answer brief, I would suggest that a good vocal coach should be able to help you with any of these tips and perhaps more. Unless there is something drastically wrong health wise, generally tons of effective practice should do the trick. ",
            "date": "Answered June 13, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anchitha Padmakumar",
                    "user_href": "/profile/Anchitha-Padmakumar"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Damon Avoza",
                    "user_href": "/profile/Damon-Avoza-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Wagner",
                "href": "/profile/Tim-Wagner-35"
            },
            "answer_text": "I’m not a singer, but from my experience, practicing scales an holding out the notes you can play, allows you to have more controls with those notes. By every week going one note out of your comfort zone, you can develop a larger range and develop less cracks in your voice. Make sure to check with your vocal teacher if you have one to see if it another problem with whether your singing correctly, not about your range. Plus, if you’re going through any vocal changes, (puberty or the such), then this will be commonplace for a short while. Always make sure to practice your scales and range, check that you are singing correctly, and always warm-up before singing. ",
            "date": "Answered August 21, 2017",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katrine Roberts",
                    "user_href": "/profile/Katrine-Roberts-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Crystal Oliviel",
                "href": "/profile/Crystal-Oliviel"
            },
            "answer_text": "If your voice is cracking, you're either: Straining (using your throat rather than your diaphragm)You are singing a song that is out of your voice range. Meaning you can't hit the notes at the exact pitch the singer is singing.To stop that you actually have a few options. You can train your voice by practicing vocal exercises and challenge yourself slowly, working up to that pitch. You also can find a song that fits your voice and change the key so it fits in your range. You then can sing from your diaphragm which results in a stronger, more confident sound, and less doubt in your ablility. I HOPE I HELPED!!! Good Luck with your singing!! ",
            "date": "Answered April 29, 2017",
            "views": "499",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Dixit",
                    "user_href": "/profile/Rohan-Dixit-14"
                },
                {
                    "user_id": "Sreyashi Mukherjee",
                    "user_href": "/profile/Sreyashi-Mukherjee-1"
                },
                {
                    "user_id": "Azwa Safrina",
                    "user_href": "/profile/Azwa-Safrina-1"
                },
                {
                    "user_id": "Neha Singh Thakur",
                    "user_href": "/profile/Neha-Singh-Thakur-7"
                },
                {
                    "user_id": "MinamiShota",
                    "user_href": "/profile/MinamiShota"
                },
                {
                    "user_id": "Damon Avoza",
                    "user_href": "/profile/Damon-Avoza-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gina Bowman",
                "href": "/profile/Gina-Bowman-5"
            },
            "answer_text": "Make sure you are very hydrated. You might consider that you have gunk in your throat from this time of year and perhaps use a little bit of Sudafed or Tussin to loosen it up. When my voice is suffering it’s almost always because I need to drink water. Sometimes a warm/hot drink with loosen gunk and get it gone too. One lady I knew would eat some fresh lemon about half an hour before she sang. I thought that was harsh on her throat and voice though. But maybe it wasn’t, I don’t know. She always had a clear lovely voice. ",
            "date": "Answered January 24, 2018",
            "views": "134",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Newman",
                    "user_href": "/profile/Daniel-Newman-30"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Rimmer",
                "href": "/profile/Will-Rimmer-3"
            },
            "answer_text": "I think one thing to help with that is this video. It explains how you can prevent it every time you sing high OR low. I mention low in addition to high because that’s always been the place my voice would crack the most.  ",
            "date": "Answered July 3, 2020",
            "views": "518",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akash Sharma",
                    "user_href": "/profile/Akash-Sharma-3467"
                },
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                },
                {
                    "user_id": "Mariz Que",
                    "user_href": "/profile/Mariz-Que"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhargav Joshi",
                "href": "/profile/Bhargav-Joshi-71"
            },
            "answer_text": "If you are a pubescent, it is normal for the voice to crack. It will go away itself. Till them, focus on pitch correction and range expansion. If this is not the case, then it may be a problem with voice registration switches. Try sirens and lip trills, tongue trills, etc.( Try such exercises after proper vocal warmup) ",
            "date": "Answered July 2, 2020",
            "views": "29",
            "upvotes": " Answer requested by Faruque Hossain Piyada",
            "upvoters": [
                {
                    "user_id": "Madison Zilk",
                    "user_href": "/profile/Madison-Zilk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlo Velenosi",
                "href": "/profile/Carlo-Velenosi"
            },
            "answer_text": "The question doesn't make sense. Singing is a long and tiring study like any other musical instrument. Study singing and you will see that over the years you will be able to keep your voice in good shape. ",
            "date": "Answered May 21, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chanchalika Das",
                    "user_href": "/profile/Chanchalika-Das"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dadaji Maharaj",
                "href": "/profile/Dadaji-Maharaj"
            },
            "answer_text": "It is not written in your question what is the actual problem in your vocal cord. First of all, you have to visit a doctor to take advice if there is any problem in your vocal cord. If there is no problem then try to practice very perfectly and scientifically, to get back your singing power and you shall be able sing one day, there is no doubt in that. ",
            "date": "Answered January 13, 2019",
            "views": "78",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ana Genie Let G. Gerardo",
                "href": "/profile/Ana-Genie-Let-G-Gerardo"
            },
            "answer_text": "Download singing apps and watch youtube videos that teaches how to sing properly or how to start singing, by practicing and having vocal lessons, you’ll bring it back, but, you can also check with your doctor if you have a condition in your throat like nodules or lumps that gives you hindrances in singing. ",
            "date": "Answered July 6, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharon Frinces",
                "href": "/profile/Sharon-Frinces-1"
            },
            "answer_text": "From personal experience, only drink warm water, avoid sugar and foods that is spicy and has acid in it. Also, i used to drink galangal water or just eat em straight. Hope this helps! ",
            "date": "Answered May 12, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Rice",
                "href": "/profile/Philip-Rice"
            },
            "answer_text": "Take lessons in person, with a good teacher. ",
            "date": "Answered July 2, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gio Sacedi",
                "href": "/profile/Gio-Sacedi"
            },
            "answer_text": "Phonation. And not with a straw ",
            "date": "Answered May 7, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}