{
    "title": "How does orchestral music make you feel? - Quora",
    "tags": [
        "Classical Music",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam Jacob",
                "href": "/profile/Liam-Jacob"
            },
            "answer_text": "Great orchestral music is one of the most amazing forms of art in my opinion. The complexity of myriad instruments joining into a well woven story amazes me every time I hear it. This type of music makes me feel differently depending on the piece. To use of few examples, Jupiter, Bringer of Jollity by Gustav Holst is a piece of music that has a very light and cheerful opening, making me feel glad and hopeful. Then, it burst into a triumphant yet elegant line that empowers me and gives me the sense of superiority as I listen. But, this piece also has a much mellower, dark theme. With a low, legato melody, this portion makes me think about serious problems sometimes, it brings more poignant or bittersweet memories to the forefront of my mind, like eerie, provoking silence right after the big showy burst of a firework. This type of contras in a piece gives me the feeling that I, and music, and the world have two sides and we can choose to cultivate and nurture one but still respect and recall the other. Another example, from the same suite is Mars, the Bringer of War. This piece’s opening is so ominous and tense, the short staccato beating out a marching force. It makes me feel poised and expectant, ready for what comes next. Then when the brass blares out the short them that's echoed by more of the orchestra it makes me feel as though I am in command. It's like a general shouting his orders and the rest of the army following. Also, the pulsing chord changes of this piece give me the feeling of purpose and definition in the chaos of a warlike situation. It's bold and strong, a underlying aim or goal that is simple yet profound, something to grasp onto in a sea of confusion. Overall, orchestral music is so versatile, that it does not make me feel any one way or another. It is beautiful, frightening, haunting, uplifting, and many other things besides. ",
            "date": "Answered May 13, 2016",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajesh Rathod",
                    "user_href": "/profile/Rajesh-Rathod-359"
                },
                {
                    "user_id": "Cameron Peck",
                    "user_href": "/profile/Cameron-Peck-3"
                },
                {
                    "user_id": "Anina",
                    "user_href": "/profile/Anina-1"
                },
                {
                    "user_id": "Avitaj Mitra",
                    "user_href": "/profile/Avitaj-Mitra"
                },
                {
                    "user_id": "Patrick Woo Ker Yang",
                    "user_href": "/profile/Patrick-Woo-Ker-Yang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "Depending on the form and format of the composition there are many things I listen for and to.  However, considering an orchestra compared to other instruments or styles of music created by other groups using different instruments such as guitars, piano or percussion, I get a different \"feel.\"   Band music, whether, rock, pop, jazz or rap, is more rhythmic using guitars, drums, keyboards, etcetera.   Once you play a sound on any of these instruments the sound immediately begins to decay, necessitating more fills and chords.  But orchestral music using strings and wind instruments  don’t work this way.  The orchestra’s sound lifts and sustains the phrase and breath, guiding the listener through the character of the song, through its wide range of voices and colors.  The orchestra fills a room naturally making it possible to fill any space. An amplified band gives you a directional, electronic copy of the instruments while the orchestra needs no amplification.  Its sound spills into the nooks and crannies of the room where other instruments sound from speakers which can leave dead space.  Humans, when we sing, we breath, take breaths and sustain notes.  Go ahead, hum something, I'll wait . . .  . . . the instruments of the orchestra do the same and are much more guttural and organic to the human experience of making music.  Though, the other aforementioned groups are easier to dance to.  ",
            "date": "Answered May 9, 2016",
            "views": "759",
            "upvotes": "0"
        }
    ]
}