{
    "title": "How to start a music company - Quora",
    "tags": [
        "Independent Music",
        "Music Industry",
        "Entrepreneurship",
        "Companies",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudarshan Nambiar",
                "href": "/profile/Sudarshan-Nambiar"
            },
            "answer_text": "Here are 10 essential things to consider when setting up a music label. 1. Choose The Music This may seem obvious but choosing the music you are going to sell is a pretty fundamental decision. It’s often better for new labels to have a relatively narrow focus in what genres they are intending to sell. This also corresponds to the format/s, take some time and really think about whether you are going to sell physical or just be a download label. Be realistic about physical products, they cost a lot to produce and you don’t want to be left with rooms full of CD’s and Vinyl’s that you’re struggling to sell. Listen to your friends and people around you, getting the product right is the key to success. 2. Choose The Name The next step is to create an identity for your record label. Research into your competitors and how they are branded. Creating the right kind of identity for your label is incredibly important, given that in the international digital age this will be your shop window. Put together a list of names and test them out with friends, remember to listen and not get to caught up one idea. If you want a website then it will make sense to include your record label in it, so register your chosen name and make sure it’s available. You can do this via the National Business Register or if you’re setting up a Limited Company, you can do it online via Companies House. 3. Establish A Brand Look Similar to the importance of your record label name, you will also need to produce logo’s and a brand identity. Keep it simple and easy to read, even at small sizes because the likely hood is that your logo will change in size to fit in banners and website posts. Take some time over your logo, there is nothing stopping you doing this yourself, but I would recommend getting someone professional to help with the design. You need to remember this is the first thing people will see, and if you want to be taken seriously, your brand needs to look professional. 4. Build A Website/Register The Name With the growing popularity of social media and Facebook Fan Pages etc, some people believe websites are becoming less important. In my opinion, this is rubbish! Websites give you a base for your customers to go and find out everything they need to know about you, your releases, gigs, videos, and most importantly a shop to sell your music. You can always set up social media pages and have links through to them on your website. Now, you have a couple of options when it comes to building a website. 1. There are a number of design agencies that will sit down with you and turn your thought process into a well designed, well delivered entity and, if this costs a bit of money but leads to a worthwhile, pleasing user experience, it could be the best money you spend at this point, in the start up of your label. 2. Use a free service like WordPress that runs more like a blog. WordPress enables you to sign in, update and is a very easy functioning site. It also looks really professional all you need is a hosting service with at least one PHP database included. If you are on a budget, I would recommend WordPress and for the ease of updating. 5. Get Your Tracks Sounding Good/Mastered This is the product you’re going to be selling so it is important to get your tracks sounding professional. There are two things that can let down a track, one being the arrangement and the other being the mix. Tweaking either one of these things could make a difference between a hit and a flop. Compare your tracks against your competitors on different speakers and listening back devices. I always find listening to my tracks in my car gives me a good perspective, and asking my friends. Friends will tend to like anything you do, so really try and get some constructive criticism out of them, you don’t want your label to be known as an outlet for poorly mixed tracks. Mastering – nowadays a lot of bedroom producers aren’t getting their tracks mastered properly, do you want your record label to be seen this way? Mastering can cost money but will always be worth it, want to look professional, you need to sound professional. Forget using your mate with a cracked copy of Logic and mastering plug-ins that crash their computer every hour. Invest some money and get your tracks mastered to a professional standard, this is especially important if you are thinking of pressing to vinyl. 6. Promotion Now it’s time to get some interest building around your new tracks, logo and website. Advertising is expensive but you can do loads of self publicity online, and there are even artists that now use social media for the majority of their marketing. Create Facebook, Soundcloud, Youtube, Twitter and even Myspace accounts, and try and be active on them. Don’t swamp your audience with pointless information, like how much you hate the neighbours dog, but keep it fairly personal, you don’t want to come across to corporate and lifeless online and try and reply to everyone that messages, personal touches go a long way. Start building a database of email addresses and start a newsletter with updates and free give a ways, people like free stuff! 7. Know The Contract By now you’ve done lots of hard work, so why not start making some money off your artists. If your label is releasing music made by other artists then make sure your agreement with them is fair and binding. And this doesn’t mean bringing in high powered lawyers. So long as the terms you have agreed are clearly set out in a document, printed and signed by you and the artist in question, then you’re up and running. It’s up to you to negotiate the terms and agreements and remember everything is better in writing, so if something were to happen you have a legally binding letter to fall back on. 8. Get Your Artists Playing Live Although record sales are starting to steadily increase, the amount that we go out and watch our favourite artists has shot right up. Playing live is the most effective form of publicity and will lead to direct to selling units. Be sure to plug your site and even get a mate to set up a stall with your merchandise, CD’s, T-Shirts etc. This is a great way of getting your brand out there. 9. Collect Royalties Collecting royalties takes time, and there is often a time lag of at least 6 months, so you need to consider this when planning releases. Sign up with the PRS and MCPS and research into what they offer in form of registering your tracks and collecting publishing money. Also remember as a label owner you are in control of sampling issues, think twice before releasing that track with Nina Simone’s vocal on! Check out this site on the problems and solutions to sampling http://old.britishhiphop.co.uk/copyright/part3.htm 10. Accounts/Income Tax When the money starts rolling in, and your tracks are going platinum you’ll need to pay a percentage to the Inland Revenue as Income Tax. That’s the law, so be sure you have every pound and penny accounted for. Set up a spreadsheet with income and expenditure columns, as expenses which relate to the running of your business can be claimed back against tax, for example you don’t pay tax on business phone calls, driving artist to gigs, running the website etc. If your label is releasing other peoples music , you’ll also need to pay them, this ofcourse is subject to your agreement. Keep on top of this, it’s important, you do not want a visit from the tax man!! Source : https://www.loopmasters.com/articles/2720-10-Steps-To-Setting-Up-Your-Own-Record-Label ",
            "date": "Answered January 24, 2019",
            "views": "315",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratik Chaudhari",
                    "user_href": "/profile/Pratik-Chaudhari-202"
                },
                {
                    "user_id": "Devansh Sheth",
                    "user_href": "/profile/Devansh-Sheth-6"
                }
            ]
        }
    ]
}