{
    "title": "How do Native Americans feel about black people? - Quora",
    "tags": [
        "Native Americans",
        "Black People",
        "American Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jane Hunstad",
                "href": "/profile/Jane-Hunstad"
            },
            "answer_text": "Well let’s start with the good and the ugly : USA During the 18th and 19th centuries, thousands of run away slaves found sanctuary in Native American tribes in the US. Many adopted the culture and way of life and intermarried with Native Americans. Black/ Native Americans         A negative aspect of history is that Native Americans (mainly Cherokees, Creeks, Choctaws, and Chickasaws ) were coerced into owning black slaves under the direction of British colonists, in efforts to secure the Transatlantic Slave trade. The colonists felt native Americans who accepted slavery would not harbor fleeing runaway slaves. However, the concept of slavery varied tremendously from what was seen in white-owned plantations. Because bondage was seen as a violation of the human spirit and will to be free, many observers noticed the chains were placed loosely upon slaves which upset white slaveowners. Only the Chickasaw upheld the reputation of treating slaves as poorly as white slaveowners. Native Americans in the south and eastern US were encouraged to hunt down and return run-away slaves. (Note: not all natives owned slaves. Only the prominent ones did.) The western tribes did not own black slaves. When whites argued about the right of private property in owning people and insisted Africans were inferior beings, most tribes shrugged, “no.” In the end, Native Americans were betrayed by the white colonists that they tried to emulate and driven from their lands. -Native ownership of black slaves is a part of American history that has been almost forgotten, although this history has caused some tensions between African Americans and Native Americans in the eastern US. How Native American Slaveholders Complicate the Trail of Tears Narrative -Blacks were also recruited into the Calvary after the civil war to hunt down and destroy Native Americans. They were promised big rewards, but ended up segregated and treated like animals. Buffalo Soldiers A very complicated history indeed with broken promises on both sides. Canada Native Americans are called ‘First Nations’ in Canada. This is to recognize their individual sovereignty. First Nations did not own black slaves, although there has been some reports Of Mohawks owning black slaves). The relationship between blacks and First Nations is of course different in Canada than in the US. Even today, many First Nations people in Canada have not had many chances to interact with black people. The areas where there are high First Nations populations generally have lower black populations, unless they live near large cities. When black people and First Nations people do come together, generally they get on just fine. I do know that many First Nations and Native American people empathize with the struggles of black people as-far as racism and being treated as second class citizens. I have never heard derogatory comments about black people from First Nations when I lived on the reservation (reserve). -In fact First Nations/Native Americans (and Inuit) youth all over Canada and the US, have embraced aspects of black culture such as hip-hop, and African American style clothing. Hip hop is now being used as a rallying cry for native youth. Native American/First Nations Rappers   Frank Waln - Sioux Native American Rapper - Music Video Native American rapper looks to break stereotypes   Above -Video By Drezus A Native American/First Nations Rapper from Canada. 8 Songs by Native American Rappers That Deserve to Be Heard I myself am part black and met and fell in love with a full blooded First Nations man. The fact that I was part black was never an issue. In fact my brown skin allowed us to have a lot in common. We got married and had 2 beautiful mixed race children. They are both Status Indians. ( I am also a Status Indian through my husband) I know others who have married black women or black men. I have met black people in the US who are Native American and members of a tribe so mixing definitely happens. I think there is an assumption that Native Americans hate blacks because of the negative stereotypes about black people in the US when this simply is not the case. Some Native Americans may buy into negative stereotypes like the some of the population, but in my experience this is generally not true as First Nations/Native Americans have much in common as oppressed peoples. *UPDATE* A few commentators have challenged my qualifications to answer this question because I identify as mixed race, and don’t want to have to chose just one. 🙁I think this is unfortunate, but here is my mini profile: I would hope that my answer has at least some value because: 1. I married a full blooded Indian ( My husband was the grandson of the Chief) 2. I have traceable Native American Ancestry. (Ojibwe) My children are Status Indians 3. Some of my in-laws are Native American 4. I have Indian Status here in Canada 5. I am a full member of a Native American/First Nations tribe 6. I have lived on 5 Native American/First Nations Reservations over a 20 year span 7. I have worked as a consultant for the Federal governments of Canada and the USA for many years on projects involving : 1. Indigenous Land Claims 2. Native American/First Nations treaty rights 3. Indigenous women’s issues 4. Oil and Gas management on Native American/First Nations reserves 5. Environmental Management on Native owned lands 8. I have volunteered regularly in an organization that helps Native American women and girls escape abusive relationships on and off the reserve. 9. I am active in local, provincial(state), federal grassroots movements in the US and Canada that support Native American causes. 10. I used to (and still do whenever possible) spend summers with the family traveling back and forth across the Canada/US border attending powwows. My children are competitive dancers. I help them make their costumes. 11. I know how to smoke moose and caribou hide using traditional methods, to make handmade moccasins and other Native Arts and Crafts. 12. I know how to set up a teepee. Sometimes we would spend a month with the husband’s Grandparents living off the land, to pass the traditional lifestyle and knowledge down to my children. 13. I learned to speak my husband’s traditional language, and my children grew up speaking it as well. ( My children are much more fluent than I) Not that it really matters at all, but I am the same shade of brown as my husband, and am regularly mistaken as having half or even full Native American heritage.( I do have some actual Native American ancestry that has been verified (Ojibwe), but I have always considered myself mixed race my whole life. I refuse to check that race box) Therefore, with me being publicly, racially identifiable as Native American by non-natives ( and by Native Americans themselves), I too have suffered the same racial and social discrimination that Native Americans and First Nations people have had to deal with for centuries, and currently still deal with in the USA and Canada. Yes, I understand their pain **intimately**. 👊🏼 More Native/Black History: https://www.africanamerica.org/topic/the-historic-relationship-between-blacks-and-native-americans-betcom Native American - Native American history Native Americans/First Nations Embracing Black Culture: Using Hip Hop to Heal Trauma (Beat Nation - Hip Hop as Indigenous Culture) Rhyming Out the Future: Reclaiming Identity Through Indigenous Hip Hop) Inuit giving hip hop cultural twist - APTN News ",
            "date": "Updated August 30, 2020",
            "views": "251",
            "upvotes": " View 170 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles Lee Ray",
                    "user_href": "/profile/Charles-Lee-Ray-39"
                },
                {
                    "user_id": "Jessy Fontenot",
                    "user_href": "/profile/Jessy-Fontenot"
                },
                {
                    "user_id": "Lettie Hill",
                    "user_href": "/profile/Lettie-Hill"
                },
                {
                    "user_id": "Amita Carta",
                    "user_href": "/profile/Amita-Carta"
                },
                {
                    "user_id": "Lori Bunch",
                    "user_href": "/profile/Lori-Bunch-1"
                },
                {
                    "user_id": "Matt Glaskin Glowaski",
                    "user_href": "/profile/Matt-Glaskin-Glowaski"
                },
                {
                    "user_id": "Martha Browne",
                    "user_href": "/profile/Martha-Browne"
                },
                {
                    "user_id": "Michaela Quinones",
                    "user_href": "/profile/Michaela-Quinones"
                },
                {
                    "user_id": "Benn Jackson",
                    "user_href": "/profile/Benn-Jackson"
                },
                {
                    "user_id": "Andrew Solis",
                    "user_href": "/profile/Andrew-Solis-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terri Cam",
                "href": "/profile/Terri-Cam-1"
            },
            "answer_text": "they are actually ok with black people and they as well as Asians are currently standing in support of black people. 'Not just a black and white issue:' Montana tribal members react to death of George Floyd also native americans did marry descendants of slaves and black freedmen and women. and native americans fought beside African americans to protect florida in the Gullah wars. https://glc.yale.edu/sites/default/files/files/Black%20Seminoles%20.pdf so while some native americans sent back escaped slaves to white owners others actually fought with them. the black Seminoles and gullah/geechee nation are living proof of that. the fact is that the native americans were never racist and never had that intent. they only fought ignorance and hatred from whites. they never had anything against black people and the only reason they ever had black slaves was because the person was born a slave. they never held innocent children as slaves and thought that a tribe member who married a slave had to bear the burden of slavery with them so often these tribe members who married slaves were looked down on but it also set the slave free. they treated slaves like family, servants or prisoners of war, similar to how Africans treated their slaves. at some point, some slaves were given freedom and allowed to be a honorary part of the tribe as well. ",
            "date": "Answered July 5, 2020",
            "views": "38",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles Lee Ray",
                    "user_href": "/profile/Charles-Lee-Ray-39"
                },
                {
                    "user_id": "Max Preston",
                    "user_href": "/profile/Max-Preston-2"
                },
                {
                    "user_id": "Georgine Perino",
                    "user_href": "/profile/Georgine-Perino"
                },
                {
                    "user_id": "Shayla Elem",
                    "user_href": "/profile/Shayla-Elem"
                },
                {
                    "user_id": "Rich Avery",
                    "user_href": "/profile/Rich-Avery-3"
                },
                {
                    "user_id": "Bbcc Ccbb",
                    "user_href": "/profile/Bbcc-Ccbb"
                },
                {
                    "user_id": "Adrienne Troup",
                    "user_href": "/profile/Adrienne-Troup"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-98"
                },
                {
                    "user_id": "Christine Schubert",
                    "user_href": "/profile/Christine-Schubert-6"
                },
                {
                    "user_id": "Graham Scadden",
                    "user_href": "/profile/Graham-Scadden"
                }
            ]
        }
    ]
}