{
    "title": "How to get a girl to like you - Quora",
    "tags": [
        "Using Psychology in Relationships",
        "Relationships and Dating of Young People",
        "How-to Question",
        "Relationship Advice",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Lynn Johnson",
                "href": "/profile/Sarah-Lynn-Johnson"
            },
            "answer_text": "Imagine the type of girl that you want to be with. Imagine your dream girl. Don’t picture what she looks like, picture what she’s like on the inside. What are her goals? Is education important to her?Is a family important to her?Is a career important to her?When does she want to settle down? Does she want to settle down?Does she want kids? How many?Does she want a nice house in the suburbs?Does she want a little beach bungalow?Does she want an upscale flat in the center of downtown?Does she dream of varied experiences and travel and adventure?Does she dream of wealth and luxury and the finer things?Does she dream of a quiet life that’s safe and secure, with as few unexpected surprises as possible?Does she dream of closeness and togetherness, and holidays spent with all the extended family, and a home filled with friends, family, and laughter.What are her values? Is she more old fashioned, or more modern?Is she more liberal or more conservative?Does she value honesty and integrity?Does she value hard work and self reliance?Does she value individual thought and uniqueness, or does she place a preference on conformity and fitting in?Does she value openness and expressing feelings, or does she feel that people she remain reserved and hold back certain things out of politeness?Is she politically active?Is she religiously active?How does she treat people who are socially inferior?How important are good manners to her?Does she refrain from any activities because she believes they are immoral? (Premarital sex, drinking, drugs, gambling, eating meat, getting a tattoo, cursing, owning a gun, etc.)What is her lifestyle? Is she up for lots of travel? Does she crave adventure?Is she a hard worker?Does she take risks or is she risk adverse?Does she enjoy a good philosophical discussion? Or is she more concerned with practical things?Is she the type of person who needs to be taken care of? Is she the type of person who takes care of others?Is she a member of a particular religion?Does she have pets or want to have pets?Is health and fitness important to her? Is that a big part of her lifestyle?Is she a vegetarian? Does she bake cookies?Does she enjoy going to BDSM sex clubs? Does she think that the mere thought of such a thing is morally repugnant?What aspects are most important to you? What would you be willing to give up? What are you willing to compromise on as long as everything else is met? Maybe you’re hoping that your future partner is a good cook, is that something you want, or is that something you need?Maybe you’re hoping that your future partner is very clean and tidy, is that something you want, or is that something you need?Maybe you’re hoping that your future partner is ok with a polyamorous lifestyle, is that something you want, or is that something you need?Don’t worry so much about superficial things. Try to avoid thinking about her looks to much, although you’ll want her to be someone that you are physically attracted to. Also, don’t worry too much about having similar interests. While it’s great if you guys have some things in common and some hobbies that you share, it’s much more important that you share compatible lifestyles, values, and goals, than compatible tastes in movies and music. Once you’ve really gotten an idea of what your dream women is like, and you’ve evaluated what is important to you, what things you need, and what you’re ok with compromising on, it’s time to go and find her. Think about where such a woman would be. If education is important to her, she’ll likely be at a university or some other place of learning. If she’s up for fun and adventure, then go on fun adventures and try to meet fellow adventurers. If she’s ad avid church-goer than attend churches and bible studies and try to meet people that way, or ask them to introduce you to a friend. Think about your dream girl and where she can be found. Then go there and make friends and meet people. Hopefully you’ll find her there. It’s not enough to just find your dream girl, you also have to win her over. Think about the type of girl that you want to be with. What is important to her? Does she value honesty and integrity? Does she want an adventurous guy or one with a stable and steady job? If you’re looking for a future housewife, then she’s going to want a man who can support her and their future children. If you’re looking for a career woman, then she’s going to want someone who will be a supportive partner. Be the kind of man that your dream girl would want. Don’t lie, don’t pretend. Be yourself, but be the best version of yourself that you can. If you need to improve your communication skills, then do that. If you need to organize your life a little, then do that. If you need to build up your confidence, do it. But don’t wait until you’re perfect. You’ll never be perfect. And if the girl that you’re dreaming of, wants you to change who you are fundamentally in order to be with her, then it’s not the right girl for you. You shouldn’t need to change who you are in order to be with someone. However, you might need to learn to clean your apartment. ",
            "date": "Answered April 3, 2017",
            "views": "29",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gregory Sargent",
                    "user_href": "/profile/Gregory-Sargent-6"
                },
                {
                    "user_id": "Fang Donghai",
                    "user_href": "/profile/Fang-Donghai"
                },
                {
                    "user_id": "Mekhi Countee",
                    "user_href": "/profile/Mekhi-Countee"
                },
                {
                    "user_id": "Bobby McGee",
                    "user_href": "/profile/Bobby-McGee-33"
                },
                {
                    "user_id": "Patrik Drahňák",
                    "user_href": "/profile/Patrik-Drahňák-1"
                },
                {
                    "user_id": "Kanu Ezemonye",
                    "user_href": "/profile/Kanu-Ezemonye"
                },
                {
                    "user_id": "Jonathan Kolber",
                    "user_href": "/profile/Jonathan-Kolber"
                },
                {
                    "user_id": "Manikantateja Kothuri",
                    "user_href": "/profile/Manikantateja-Kothuri"
                },
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                },
                {
                    "user_id": "Yena Azul",
                    "user_href": "/profile/Yena-Azul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alden Tan",
                "href": "/profile/Alden-Tan-1"
            },
            "answer_text": "Let's just fucking get to it so you can attract the shit out of the girl you like! My pointers are things that mostly have to do with working on your inner-self rather than a bunch of tactics you can carry out. Tactics will never work if you don't have what it takes to pull it off. That is why most advice out there is bullshit. E.g. You may have the best pickup line in the world, but if you're a little boy who mumbles a lot, can't dress well at all and generally has no charisma, the words will simply fumble. So work the other way around. If you can master yourself inside first and foremost, you can master anything outside. The journey would at least, be a lot easier. 1) Understand how attraction works Basically, attraction is not a choice. Yes it's not a damn choice. You feel what you feel and sometimes, you wouldn't be able to understand it.  Why do you think you end up liking girls that don't seem to be a right fit for you? Why do you see couples that don't seem compatible or have nothing in common end up together, and happy at that? So get this in your head: Attraction is not a choice.  You now need to start using this fact to your advantage. Like the supposed \"Bad Boy.\" 2) Understand why women date assholes Or the \"bad boy.\" I talk about this in greater detail in my article, Why Women Date Assholes, but here's the gist of it: - The Asshole is somebody who LOOKS like they have many attractive qualities, but inside, they've nothing going on for them. In other words, they know how to lie, deceive and cheat women into thinking that they make good boyfriends. - Subsequently, The Asshole is so good at being showy that they're shameless and overly confident to the point that they know what it takes to attract the girl. Remember, attraction is not a choice. The girl, at the point of attraction does not know shit about whether a guy is a good or bad person. All she can see is whatever that is appearing outside. She is not a mind reader after all. Makes sense? - Once The Asshole has snagged the girl, she will then realize he's a useless piece of shit after a while.  But because she felt that initial attraction (again, not by choice) and remember that feeling, she clings on to the slim hope that he would change for the better. This is the part she is whining to you, the guy who is in love with her and does not have what it takes to attract women properly yet, about why her boyfriend is an asshole. This is the part you wonder why women date assholes and why nice guys like you never get the girl. Which brings me to my next point. 3) Being nice is never enough to get what you want in life This is the folly of people. No, you do not deserve to get what you want in life just because you're a nice person. You do not automatically experience good shit just because of \"karma points\" or whatever. You'll not get the girl if you think that being nice is enough when all the while you're sitting on your ass, feeling shy and shit and not daring to even talk to her. Time and time again, I always hear from my lonely, single friends who whine about how the girl they like are dating bad boy assholes and they're saying shit like, \"I give to the poor! I do volunteer work! Why doesn't she like me?!\" What could I say to my friend when they aren't doing any practical shit to attract her? I repeat: You will not get the girl, much less anything you want in life if you think being nice is enough. If you want something in life, you go all out for it! At the very least, you must make yourself known to her. And you do that by attracting her. 4) Do what it takes to attract her so you're at least on her radar Let me present two perfect stereotypes: Bad Boy- Looks like a complete asshole. Wears Ed Hardy. Has his hair dyed and spiked. Works out a lot. Talks loudly. Cracks stupid, sexy jokes. Eventually approaches the girl because he doesn't give a shit about consequences. Good boy who's super innocent and shy- Does not dare to talk to the girl. Sits in one corner at the bar. Laments the fact that he can't get girls for shit, but takes solace in the idea that he does charity work. Eventually does nothing. Which person will the girl remember? Heck, which person will ANYONE else remember? The answer is obvious. So do you want to attract a girl? Then do what it takes to get her attention. - Wash up. Trim your hair. Get rid of unnecessary facial hair. Tweeze your nostril hair sticking out. Shave your head if you're balding. Fucking shower! Yes. Looks matter. Get over it. The people who say looks don't matter and that people who care about looks are superficial people are lonely fucks who don't do anything to improve themselves. A girl will not notice you, much less want to talk to you if you look like shit or worse, smell like shit. - Dress nicely, keep up with trends and look presentable Looks matter and thus people are judgmental as hell.  I am not saying you need to wear a suit everywhere you go, but if you're still wearing baggy jeans with running shoes, people are honestly just going to laugh at you. Go buy some nice shit. You'll be happy you did. - Learn to speak properly You can't hear yourself, so you may be coming off as a total loser or even rude, especially if you lack confidence in the first place (hence why I said pickup lines won't work.) So learn. Don't mumble. Enunciate your words.  - Eventually, you're going to have to talk to her This is how you make yourself known. You need to get out of your comfort zone and approach her. I won't go into detail here, but just do what it takes.  Learn pickup online. Read books on approaching women. Use a bunch of tactics even (Yes! Finally! When tactics actually make sense.) 5) How to get the girl to like you Notice I've been talking about how to get a girl attracted to you, and not to like you. This is what I always believed in:  A girl will come to you when you attract her. Whether she stays or not, is all in your character and whether you make a nice boyfriend. That is why bad boys attract the girl, but mostly make her unhappy after that.  Good, nice guys got it the other way around, which does not work because they can't get her to come in the first place. Hence, if you want her to like you, it's entirely in your power. Some little tips: - Be honest. Don't lie to her. Don't deceive her. Tell her your expectations from the start. - Don't be clingy. That's annoying. - LISTEN to her, give her your time and don't dismiss her with logical solutions. Women talk to you because they want to be heard and know that you're there for them. Don't just dismiss her with obvious solutions e.g. \"Babe, just go to the doctor if you're feeling unwell. Excuse me, I am in the middle of this video game.\" I talk about this more in my article, How To Finally Understand Women. - Stand up for yourself and don't always give in. A woman will not be attracted to somebody she does not respect. - Be yourself. This is the only time you get to be yourself. Be yourself is shit advice if you don't even know yourself or lack total confidence. But yeah... you need to attract her first. Do what it takes. Then, do what it takes to get her to like you. Bonus point 6) Ask yourself if you really want her to like you Guys who lack confidence jump at every opportunity to want to get a girl because they feel lonely. They don't even know themselves. They don't even know how to go about it. They don't even know if they really like her. Sometimes, the best thing to do is to walk away. You simply can't force shit. If it's meant to be, then it's meant to be whether you like it or not. Know that there's a difference between love and obsession. As much as your attraction is not a choice, it may also be a delusion. You need to start being brutally honest with yourself on whether you really like her in the first place or not.  You can save yourself a lot of headache there. That's it! This is just a small guide. I hope it makes sense. Do what it takes to attract her. Being nice is not enough. Being yourself is not going to help if you don't know yourself. Get out of your comfort zone and talk to her. If you manage to attract her, cool! Then play it cool, be yourself, be honest and hope things work out.  Peace. Please help me share this!  For more honest-as-fuck advice, go to my blog: Alden-tan.com  To stay in touch with me, get my free book 12 things happy people don't give a fuck about! ",
            "date": "Updated February 19, 2016",
            "views": "464",
            "upvotes": " View 548 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Just Some Guy Without a Mustache",
                    "user_href": "/profile/Just-Some-Guy-Without-a-Mustache-4"
                },
                {
                    "user_id": "BishoyRomani",
                    "user_href": "/profile/BishoyRomani"
                },
                {
                    "user_id": "Mauro Contu",
                    "user_href": "/profile/Mauro-Contu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AnimeVibesツ"
                },
                {
                    "user_id": "Dark lord 😈",
                    "user_href": "/profile/Dark-lord-308"
                },
                {
                    "user_id": "Kuuku Acquah",
                    "user_href": "/profile/Kuuku-Acquah"
                },
                {
                    "user_id": "Josh Adams",
                    "user_href": "/profile/Josh-Adams-391"
                },
                {
                    "user_id": "Abdullah Yaqoobi",
                    "user_href": "/profile/Abdullah-Yaqoobi"
                },
                {
                    "user_id": "Dipanshu Kumar",
                    "user_href": "/profile/Dipanshu-Kumar-222"
                },
                {
                    "user_id": "General Skywalker",
                    "user_href": "/profile/General-Skywalker-4"
                }
            ]
        }
    ]
}