{
    "title": "How many songs did the Beatles record? - Quora",
    "tags": [
        "The Beatles (band)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Boulter",
                "href": "/profile/Robert-Boulter-5"
            },
            "answer_text": "This is a chronological list of songs The Beatles have released officially, starting with The Quarrymen. Found on The Beatles Anthologies. Sound effects, Snippets, Reprises etc. I will not include, just the songs. That’ll Be The Day; In Spite Of All The Danger; Hallelujah, I Love Her So; You’ll Be Mine; Cayenne: 5 songs With Tony Sheridan, 8 songs recorded all in all, with only 2 solely by The Beatles. Ain’t She Sweet; Cry For A Shadow: 2 songs ~ +5 = 7 15 songs were recorded at the Decca studios of which only 5 were released on the Anthologies: 5 + 7 = 12 Now The Beatles at EMI Studios. Their first two singles appeared on their first LP Please Please Me. With the inclusion of ‘How Do You Do It’ on the Anthologies, would add up to 15. The One After 909 was recorded around this time, but I will include that later on the Let It Be album. 12 + 15 = 27 From Me To You single, 2 songs, and With The Beatles LP, 14 songs, She Loves You single, 2 songs, I Want To Hold You Hand single and 2 previous songs sung in German, (not counted) makes 20: 27 + 20 = 47 A Hard Day’s Night LP had 13 songs. With ‘You Know What To Do’; ‘If You’ve Got Trouble’; ‘That Means A Lot’; on Anthology 1 makes 16. Beatles For Sale had 14, with Leave My Kitten Alone on Anthology 1 making 15: 47 + 16 + 15 = 78 Long Tall Sally EP had 4 songs not put on any LP. Help! LP had again 14 songs. ‘Bad Boy’ was recorded too ending on Oldies But Goldies. 78 + 19 = 97 The single ‘Day Tripper’ 2 songs; Rubber Soul LP 14 songs, makes 16. ‘12-Bar Original’ wasn’t a song, more like sound effects. Together with Revolver and the Paperback Writer single, and 16 songs: 97 + 32 = 129 The first phase of The Beatles over, we move onto the 2nd phase, starting with the Sgt Pepper LP and Penny Lane single. Penny Lane single, 2 songs; Sgt Pepper LP 12 songs. Sgt. Pepper reprise and the ending snippets not included. 14 songs. I will include George Harrison’s songs later on Yellow Submarine LP. 129 + 14 = 143 All You Need Is Love single, 2 songs; Magical Mystery Tour EP, 6 songs, ‘Jessie’s Dream’ and ‘Shirley’s Wild Harmonica’ are not The Beatles, even though they wrote them. 8 songs: 143 + 8 = 151 Lady Madonna single, 2 songs; Hey Jude single, 2 songs; ‘Christmastime Is Here Again’ (on flexi disc), released on the Anthologies: 151 + 5 = 156 The White Double has 31 numbers all in all. ‘Revolution 1’ is a different mix to the B side of Hey Jude. ‘Revolution 9’ is just sound effects, and ‘Take Me Back’ is just a snippet. So I will cut down to just 28: 156 + 28 = 184 There are a small number of Esher Demos which have been included on two or three albums in the 1990’s till the present day. These will include ‘Sour Milk Sea’; ‘Junk’; ‘Child Of Nature’; ‘Circles’; ‘Not Guilty’; ‘What’s The New Mary Jane’; ‘Los Paranoias’; ‘Teddy Boy’; ‘Rock ’n’ Roll Medley’; ‘Mailman Bring Me No More Blues’; ‘Come And Get It’ ‘Goodbye’. I will include 12 of these: 184 + 12 = 196 Yellow Submarine LP includes, ‘Hey Bulldog’; ‘All Together Now’; ‘Only A Northern Song’; ‘It’s All Too Much’. 4 Songs. Let It Be LP has 11 songs on it with the inclusion of the ‘Fly On The Wall’ snippet single. I will just include the 11 songs: 196 + 15 = 211 And finally ‘Abbey Road’ with 17 songs: 211 + 17 = 228 So there you have it - 228 songs. Then there are the two double albums of the BBC recordings and the Love album. Choose what you want from there. P.S. I almost forgot to mention the Ballad Of John & Yoko single, 2 songs, and The Anthologies 2 new Lennon songs that made 2 seperate singles. That is four more added to my editing. Making it 232. If you see more that I forgot, let me know ",
            "date": "Answered July 8, 2019",
            "views": "44",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sherman O",
                    "user_href": "/profile/Sherman-O"
                },
                {
                    "user_id": "Sandi Carello",
                    "user_href": "/profile/Sandi-Carello"
                },
                {
                    "user_id": "John Lewis",
                    "user_href": "/profile/John-Lewis-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amy Anderson",
                "href": "/profile/Amy-Anderson-637"
            },
            "answer_text": "201. This is the official song release number including: With The Beatles: 14(includes their versions of other songs)Meet The Beatles: 12Beatles For Sale: 14Please Please Me: 14A Hard Days Night: 12Help: 14Rubber Soul: 11Revolver: 14Sgt. Peppers Lonely Hearts Club Band: 13Magical Mystery Tour: 11The White Album: 30Yellow Submarine: 13Abbey Road: 17Let it Be:12Like other answers have said, they have many unreleased songs, demos, and songs they did multiple versions of. Mostly all of their songs were produced by George Martin, excluding “Let it Be\" which was produced by Phil Spector as a stripped down live & bare concept album. They each had successful solo careers and this number isnt including their solo career songs. ",
            "date": "Answered July 8, 2019",
            "views": "93",
            "upvotes": " View 263 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Deckman",
                    "user_href": "/profile/Faith-Deckman"
                },
                {
                    "user_id": "David Gaines",
                    "user_href": "/profile/David-Gaines-72"
                },
                {
                    "user_id": "Rebecca Gregory",
                    "user_href": "/profile/Rebecca-Gregory-75"
                },
                {
                    "user_id": "Danielle Richards",
                    "user_href": "/profile/Danielle-Richards-102"
                },
                {
                    "user_id": "Brandon George",
                    "user_href": "/profile/Brandon-George-96"
                },
                {
                    "user_id": "Elizibeth Richards",
                    "user_href": "/profile/Elizibeth-Richards-1"
                },
                {
                    "user_id": "Chelsea Vicks",
                    "user_href": "/profile/Chelsea-Vicks-2"
                },
                {
                    "user_id": "Jamie Lewis",
                    "user_href": "/profile/Jamie-Lewis-356"
                },
                {
                    "user_id": "Rebecca Fonda",
                    "user_href": "/profile/Rebecca-Fonda-2"
                },
                {
                    "user_id": "Kaitlyn Osman",
                    "user_href": "/profile/Kaitlyn-Osman-4"
                }
            ]
        }
    ]
}