{
    "title": "How to lower the sound quality in Audacity - Quora",
    "tags": [
        "Audacity",
        "Sound Quality",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Gillham",
                "href": "/profile/Andrew-Gillham"
            },
            "answer_text": "Interesting question. Lots of options. It depends what you mean by audio quality. You could start by setting a low pass filter at 10khz or even 5khz. This will cut off the high frequency harmonics and take a lot of character out of voices or instruments (think FM radio compared to CD quality). You could reduce the bit rate from 16 to 8 or even lower. This will massively affect the dynamic range removing detail from the sound. Think early 90s computer game sound track. You could mix in some white noise (or other arbitrary waveform) to increase the noise floor. Think 80′s cassette tape copied too many times. You could compress the audio using e.g. mp3 codec at a very low bit rate (64kbps or lower) introducing strange sounding artefacts especially to the higher frequency sounds. Or you could just download and import some modern pop music. (The point I’m trying to make there is that everything to do with audio quality is subjective). Btw Audacity is a great tool but I’ve not used it for a long time so I don’t have any tips on how to implement any of these suggestions. I’m sure there is good documentation on-line. If you experiment with some combination of the above you can achieve the affect you want. ",
            "date": "Answered May 14, 2016",
            "views": "143",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Romario Garces",
                    "user_href": "/profile/Romario-Garces"
                },
                {
                    "user_id": "Anthony Amaro",
                    "user_href": "/profile/Anthony-Amaro-16"
                },
                {
                    "user_id": "Gabriel Norte",
                    "user_href": "/profile/Gabriel-Norte"
                },
                {
                    "user_id": "Rishi Pillai",
                    "user_href": "/profile/Rishi-Pillai-10"
                },
                {
                    "user_id": "Brian Yu",
                    "user_href": "/profile/Brian-Yu-80"
                },
                {
                    "user_id": "Ken Creten",
                    "user_href": "/profile/Ken-Creten"
                },
                {
                    "user_id": "John Longcross",
                    "user_href": "/profile/John-Longcross"
                },
                {
                    "user_id": "Ian Lythgoe",
                    "user_href": "/profile/Ian-Lythgoe-2"
                },
                {
                    "user_id": "Ammon Guinn",
                    "user_href": "/profile/Ammon-Guinn"
                },
                {
                    "user_id": "Dave Cripton",
                    "user_href": "/profile/Dave-Cripton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Murphy",
                "href": "/profile/Stephen-Murphy-59"
            },
            "answer_text": "You could go to the head of the track and up the gain (marked + on the slider) making the sound overdrive and scruff up nicely. this raises the volume so you would then need to de-amplify using the effects toolbar “amplify” and turning it past zero for that track or section of track. Alternately use shlubby equipment - split your leads with a splitter, use a 3.5 mm jack instead of a 6.5 or usb, all of which will squash the signal and make worse sound, even record using the built in mic on a laptop - phew, that’s rough. you could use a low mic setting on audacity and a high volume input, or swap these round, whichever gets you the roughest sounds good luck slumming ",
            "date": "Answered June 28, 2016",
            "views": "64",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ken Creten",
                    "user_href": "/profile/Ken-Creten"
                },
                {
                    "user_id": "Ammon Guinn",
                    "user_href": "/profile/Ammon-Guinn"
                },
                {
                    "user_id": "Simon Tablazon",
                    "user_href": "/profile/Simon-Tablazon-1"
                }
            ]
        }
    ]
}