{
    "title": "How much time would it take to learn guitar? - Quora",
    "tags": [
        "Guitar Lessons",
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shawn Bailey",
                "href": "/profile/Shawn-Bailey-16"
            },
            "answer_text": "You asked a really interesting question… So I’m going to give a somewhat “interesting” answer. I hope you’ll read it to the end. How long does it take to master ‘a’ guitar? Not ‘the’ guitar in general. I started out as a drummer, but as circumstances would have it, a good friend of mine was a drumming prodigy… so I decided to move to (what I thought was the second best instrument in a rock band) guitar. I play a Les Paul mainly, an electric guitar made by Gibson. I bought it 2nd hand when I was 16 with every cent I ever earned. In my world, a new skill is something to be conquered, a quest, a challenge. The guitar was a huge challenge. I badly wanted to be in a rock band with my friends so I set about putting all my spare time into mastering ‘the’ guitar… literally. If I wasn't doing schoolwork or class, I was playing the guitar or practicing. Playing meant jamming on songs with my drummer friend. This was important because I learned the value of playing guitar in an ensemble (I was also a percussionist in the high school orchestra). Practice meant learning the techniques and theory as applied to guitar… chords, scales, picking exercises, learning songs, developing a vibrato, playing along to songs on tape, recording myself playing to hear how awful I was and what I had to work on. 10 hours a day would be spent practicing. There were so many things to know! Things outside of plain old theory…things that make a guitar player sound good. This was during the late 80’s and early 90’s when being a guitar player meant you had to ‘shred’. I was learning the most challenging songs of the day… It was constantly pushing myself beyond the normal limits of learning that made me advance quickly as a guitar player. I didn't take lessons because I just figured they would slow me down. By the time I was 19, our band was playing paying gigs in bars. Playing classic and modern rock songs… and we were pretty good. Had I mastered the guitar by that point? Nope, all of that practice and playing had me at a pretty advanced level of playing a certain genre of music on ‘a’ guitar…The Les Paul. This guitar, mind you, is a powerful beast of a guitar, but a simple beast… 6 strings, two humbucker pick ups and a lot of heavy wood. By the time I hit 21 years old… I had mastered ‘a’ guitar in 1 style of music. I was a pretty decent shredder/blues player… I could play almost anything I wanted to and imitate the popular players of the day. If you put a steel string flat top in my hand… I’d be lost. I can’t entertain anyone on an acoustic guitar. If you played country chicken pickin’ style, I’d be lost…. if you wanted me to play Jazz… I’d be lost! I was a 1 dimensional player. I could be exciting on one stage with ‘a’ guitar… a simple Les Paul. 29 years later, I still play the same guitar and I have branched out into other musical genres; somehow though, I don’t feel like I have mastered ‘a’ guitar like the Les Paul, there are always secrets to uncover. Jazz is my new love and I feel like the time is right to try and conquer ‘a’ simple acoustic guitar. Not a classical or flamenco, which appear to be the same thing to the uninitiated… A simple small bodied, steel string Gibson L-00. Joe Pass said, “Guitarists should be able to pick up the guitar and play music on it for an hour, without a rhythm section or anything.’ I hope the next 25 years is enough time… ",
            "date": "Answered April 1, 2017",
            "views": "222",
            "upvotes": " View 72 Upvoters",
            "upvoters": [
                {
                    "user_id": "Garrett Fleming",
                    "user_href": "/profile/Garrett-Fleming-5"
                },
                {
                    "user_id": "Chase Dunn",
                    "user_href": "/profile/Chase-Dunn-28"
                },
                {
                    "user_id": "Abres Siddique",
                    "user_href": "/profile/Abres-Siddique"
                },
                {
                    "user_id": "Nevia Choudhary",
                    "user_href": "/profile/Nevia-Choudhary-1"
                },
                {
                    "user_id": "Jamie Hata",
                    "user_href": "/profile/Jamie-Hata"
                },
                {
                    "user_id": "Walker Mens Legis",
                    "user_href": "/profile/Walker-Mens-Legis"
                },
                {
                    "user_id": "Jerome Terry",
                    "user_href": "/profile/Jerome-Terry-1"
                },
                {
                    "user_id": "Lambo Plato",
                    "user_href": "/profile/Lambo-Plato"
                },
                {
                    "user_id": "Tom Attoe",
                    "user_href": "/profile/Tom-Attoe"
                },
                {
                    "user_id": "Minh Tuan",
                    "user_href": "/profile/Minh-Tuan-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Lickiss",
                "href": "/profile/Samuel-Lickiss"
            },
            "answer_text": "A lifetime. I’ve been playing for fifteen years now, but I still feel like a beginner when I watch and listen to the performances of guitar players I admire. However, if I were to go back to the days when I first begun learning guitar and happened to stumble across my future self jamming away with my band I’d have been awestruck. This guy can play the opening to Paschendale by Iron Maiden - he’s incredible, I might think to myself. Oh man, he can play barre chords and make them sound good. There was a time when playing a barre chord seemed flipping impossible; fingerpicking was akin to witchcraft. I remember the first song my first-ever band played was Wake Me Up When September Ends by Green Day. (Also the song with the longest intro ever - skip to 1:40.)  I felt so damn cool at that point in the song when it switches from a clean tone to full on power chords. And that guitar solo? Man - I was awesome. Just wish I could play those bloody barre chords properly. I’ve continued to improve and practise my guitar playing - I work hard at it. I’m pleased to say that I can indeed play barre chords now, but there are plenty of things on the guitar I can’t do and would like to. I look at the guitar work of players like Guthrie Govan, Andy McKee, Paco de Lucía and other great players and think man, wish I could play like them. So I’ll keep practising and learning, and I’ll continue to improve. My skills weren’t especially spectacular back in those days of playing lots of Green Day songs with my band, but it was a helluva lot of fun. I truly loved playing with my band - we had a lot of laughs, played some great pub gigs and entered our local battle of the bands competitions. A couple of those guys remain good friends and we continue to enjoy talking about the time we played in a band together. I still love playing now. I really enjoy practising and getting together with other musicians for a jam or band practice. I like writing my own stuff, and I especially love it when I finally manage to play a complicated piece all the way through without a mistake - it’s a great feeling. I hope I’ll still love playing in another fifteen years’ time, and another fifty years after that. (Although, just adding up those numbers another sixty-five years into the future is probably pushing my luck; but, you never know - science and medicine are advancing rapidly, so I may be fortunate.) Don’t think of it as trying to play the guitar ‘completely’ - you can’t, and you won’t. Enjoy learning and exploring the instrument every step of the way. Aspiring to the lofty heights of the greats is good, but don’t think of yourself as failing all the while you can’t perfectly replicate Jimmy Paige’s solos. Enjoy :-). Samuel LickissWriter and editorwww.samuellickiss.com ",
            "date": "Answered April 6, 2017",
            "views": "36",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chase Dunn",
                    "user_href": "/profile/Chase-Dunn-28"
                },
                {
                    "user_id": "Lesley Diane Guitar",
                    "user_href": "/profile/Lesley-Diane-Guitar"
                },
                {
                    "user_id": "Pawani Maduwanthi",
                    "user_href": "/profile/Pawani-Maduwanthi"
                },
                {
                    "user_id": "Ashwin Sekar",
                    "user_href": "/profile/Ashwin-Sekar-4"
                },
                {
                    "user_id": "Keaton Staggemeier",
                    "user_href": "/profile/Keaton-Staggemeier"
                }
            ]
        }
    ]
}