{
    "title": "How do people appreciate contemporary music? - Quora",
    "tags": [
        "Music Appreciation",
        "Contemporary Classical Music",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Barendrecht",
                "href": "/profile/Eric-Barendrecht"
            },
            "answer_text": "It may sound weird, but you might need to practice listening to it. You probably have people mention that you have to develop certain tastes in food. Well, that's not different for sounds. The vast majority of people that would hear a death metal song like cryptopsy’s phobophile, would only hear noise. Literally. They would not be able to hear any details. The same goes for when I let people hear experimental jazz fusion. Without “training” it will sound like random notes without any structure. The truth is that we need to learn to discern the structures, to recognize patterns, feelings, emotions. And there are different reasons why music can entice us: I love Atari Teenage Riot for it's intensity, Sinead O'Connor for her emotion, dream Theater for their virtuosity, massive attack for its beauty. So, be open and develop your taste. It won't be a short quick journey, but it will be all the more fulfilling in the end ",
            "date": "Answered April 10, 2017",
            "views": "135",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Strayer",
                    "user_href": "/profile/Dan-Strayer"
                },
                {
                    "user_id": "Qixiao Ma",
                    "user_href": "/profile/Qixiao-Ma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eliot Layton",
                "href": "/profile/Eliot-Layton"
            },
            "answer_text": "Essentially you need to think about what the composer is trying to do and what you are getting from the piece. Throughout the Romantic Era, the “goals” of composers were fairly straightforward. They wanted to express themselves or their values, or paint a picture, or something like that. The story of classical music in the nineteenth century is essentially a single narrative. That splintered into many narratives at the start of the twentieth century. Much classical music from the mid-twentieth century on is very experimental. In the case of the piece you mention, I think it would be best to think of it as an exploration in sound. Sit there not doing anything else and let the music take you on some kind of strange journey. Ultimately, you might not discover any underlying aesthetic unity or anything you like about the music. That’s okay, though. The experience can still be interesting, and for some of us, that’s a major reason we listen to music. ",
            "date": "Answered April 5, 2017",
            "views": "479",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tobias Shklover",
                    "user_href": "/profile/Tobias-Shklover-1"
                }
            ]
        }
    ]
}