{
    "title": "How to connect my acoustic guitar to my computer - Quora",
    "tags": [
        "Acoustic Guitars",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Caleb Liaw",
                "href": "/profile/Caleb-Liaw"
            },
            "answer_text": "As per Kenneth’s answer, you’ll want a USB recording interface, and either a 1/4″ cable (for a pickup-equipped guitar) or a microphone and XLR cable (for a non-pickup-equipped guitar). Next, you’ll need a DAW of some kind to record into - no, Audacity won’t cut it. REAPER and Tracktion Waveform are inexpensive DAWs that you might actually like. Alternatively, there are the heavyweights like Ableton, Cubase, Reason, Pro Tools, and the Mac-exclusive Logic Pro. The heavyweights usually have a cheaper license for people who only need certain features (e.g. if you’re going to record 1 guitar, 1 voice, 1 kick pedal, then you can get away with Ableton Lite which allows only 4 tracks). Next, recording technique. Once you’ve set your tempo and metronome to play along to, you’ll want to set your input volume. On a pickup-equipped guitar, it’s as simple as Max your guitar output volume, set tone controls to neutralPlay the hardest you would during the songSet your interface input gain such that your DAW is showing -6 ~ -0dBFS during peaksDo a trial run-through, then re-adjust input gainIf you’re using a mic, then you’ll also have to fiddle with mic placement. Congratulations, you’re ready to record your song! ",
            "date": "Answered August 26, 2018",
            "views": "16",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Danielle Edwards",
                    "user_href": "/profile/Danielle-Edwards-55"
                },
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Dipak Kulhari",
                    "user_href": "/profile/Dipak-Kulhari"
                },
                {
                    "user_id": "Flávio Sobral",
                    "user_href": "/profile/Flávio-Sobral"
                },
                {
                    "user_id": "Sally Nicholson",
                    "user_href": "/profile/Sally-Nicholson-6"
                },
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Emma-1809"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Nolt",
                "href": "/profile/John-Nolt"
            },
            "answer_text": "This question doesn’t include a lot of context, so we’re all having to make some assumptions in our answers. If you just want to record something quick without high fidelity, you can probably use the built-in microphone in your computer (assuming it has one). For example, every Macbook has a built-in microphone, and every Macbook comes with Garageband. For Windows there is a free “Sound Recorder” app you can download. If you are trying to make a *good* recording, it gets a bit more complicated. To make a good recording of an acoustic guitar, you should use a microphone in a quiet room, and record into a USB interface. Or get something like an Apogee MiC, which is a good microphone that plugs right into a USB port. You can, of course, get a pickup put into your acoustic guitar, and plug that directly into a USB audio interface. But the sound you’ll get will not include the lovely harmonics of your acoustic. I would only recommend doing so if you’re going to use some kind of computer amp emulator. But your question is pretty basic so I doubt you’re going to do that. ",
            "date": "Answered August 27, 2018",
            "views": "896",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sally Nicholson",
                    "user_href": "/profile/Sally-Nicholson-6"
                },
                {
                    "user_id": "Jacob Fischer",
                    "user_href": "/profile/Jacob-Fischer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Toomey",
                "href": "/profile/David-Toomey"
            },
            "answer_text": "The best way, in your case, would probably be an acoustic pickup. You can plug this directly into your computer, but you will probably need an 1/4″ to 1/8″ or 1/4″ to USB adapter for this. Audacity is just fine for now. You aren't going to be running a professional rig yet, and you've got to learn somehow. I’ve also heard great recordings on Audacity. I personally prefer to use Ardour as a free DAW. It’s plenty powerful and comes with ample pre- and post-mixing options. At some point, you’ll want to buy a Scarlet 2i2, which is a great beginner-level Digital Audio Interface (DAI). I’m telling you to go with 2i2 because it comes with 2 channels in and 2 channels out. Some guitarists plug directly into the DAI and have one extra microphone sitting in front of the guitar to get that more natural sound. Some use one microphone. A Scarlet DAI is good because it can take 1/4″ and XLR inputs. The Scarlet also comes with a free version of ProTools and Ableton Live, which is plenty for learning on. ",
            "date": "Answered August 26, 2018",
            "views": "684",
            "upvotes": " Answer requested by Quora User",
            "upvoters": [
                {
                    "user_id": "Gianni",
                    "user_href": "/profile/Gianni-94"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Emma-1809"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristiano Sadun",
                "href": "/profile/Cristiano-Sadun"
            },
            "answer_text": "In a studio like situation (that’ll be your bedroom for example :-)) the best thing to do is to use a microphone to record the sound (for which, of course, you need the usual trappings to get a microphone signal into the computer: an audio interface or an USB mic). As a fun note, if you have a relatively recent smartphone, you can actually use its built-in microphone and, while I wouldn’t use the method for a commercial record, for demos or other purposes the results aren’t too shabby at all :) ",
            "date": "Answered September 1, 2018",
            "views": "311",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "Kenneth McLaughlin",
                "href": "/profile/Kenneth-McLaughlin-3"
            },
            "answer_text": "That depends on your guitar. Regardless you’ll need some kind of audio interface, like a Scarlett Solo. If your guitar has a pickup, you then just need an instrument cable which you can plug into the interface and you’re up and ready to go. If your guitar doesn’t have a pickup, you’ll need a microphone and a mic cable to go into the interface. ",
            "date": "Answered August 26, 2018",
            "views": "347",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Steve Pointer",
                "href": "/profile/Steve-Pointer-1"
            },
            "answer_text": "Try an iRig. Great interface between your guitar and your computer. You can plug your headphones into it too. It comes with free software rather records an has many different effects for you guitar including different amps, etc.. You can even design your own stomp pedal pad virtually. ",
            "date": "Answered July 27, 2020",
            "views": "136",
            "upvotes": "0"
        }
    ]
}