{
    "title": "How does streaming work? - Quora",
    "tags": [
        "How Things Work",
        "Streaming Music",
        "Social and Online Music",
        "Streaming Content",
        "Streaming Video Content"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maxim Novikov",
                "href": "/profile/Maxim-Novikov-3"
            },
            "answer_text": "There are two different things that people call “streaming” these days. Online radio (which is the actual “streaming”). On the remote machine a special software (e.g., Icecast, SHOUTcast, ffserver) continuously generates what you can think of as an “infinite .mp3 file”. You, as a listener, can access that “file” (= “stream”) using a URL. E.g., this URL – http://ice1.somafm.com/thetrip-128-mp3 – gives you a stream of SomaFM’s The Trip channel. So, for you it’s essentially an .mp3 file which is located somewhere remotely, and which you have no control of – you cannot rewind it back or forward, you can just click “play” and listen to whatever it is currently playing there. All the listeners who open the same URL will listen to the same music as it’s generated per URL, not per listener.Online streaming service (which we call that way, but what technically might not be 100% correct). This is how Pandora, Spotify, Google Music and all the other similar services work. The remote software sends you (to your client app or a web browser) a URL t a song (an .mp3 file). Your client app downloads and plays that .mp3 file for you, then asks the remote software to provide a link to the next file to download and play. And so forth. Every time when the remote program receives a request for the next song, it can decide which one to provide (taking into account tons of parameters – user’s location, genre preferences, trending songs, user’s age, etc.) and in most cases it will differ for different users. For example, if you open Tuneself Radio (which is actually not a radio) and click “next” button a few times, you will get some music, but the songs will be most likely different from those which I get if I do the same at the same time. From the given example, you can also see that in the case of a “streaming service”, you may have some control of what is playing and how (typically, you can rewind across the currently playing song – as it’s basically “an .mp3 file in your player” – and advance to the next song).PS I used “.mp3 file” term for simplicity, the actual audio format may be different for both online radio streams and streaming services (not necessarily MP3 per se). ",
            "date": "Answered August 13, 2016",
            "views": "448",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Rapartiwar",
                    "user_href": "/profile/Shubham-Rapartiwar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Targett",
                "href": "/profile/Sam-Targett"
            },
            "answer_text": "Live streaming has turned into a catchphrase that has gotten on over the world. However, what does it truly mean? How about we separate it to comprehend it better. Streaming infers the continuous transmission of substance over the web. Live streaming empowers supporters and watchers to impart progressively, with a communicate being gotten by a client very quickly after it has been made. A supporter may stream an assortment of substance, extending from design shows and way of life presentations to sports matches and love administrations.  If you somehow happened to request that us how live broadcast on the web, we would reveal to you that you just need a fundamental camera and a strong web association, in any case. What's more, it's valid. With simply these two set up, you can assemble a strong establishment for your live stream. You'll require a couple of more things to guarantee that your stream is smooth, however. Abandon it to us to walk you through some simple strides that typify how to live stream a video. You can do your own live streaming by doing the following : Obviously, a viable web association can change the nature of a live stream. It's dependably a smart thought to keep up two web lines to arrangement for repetition. While your essential association could be remote, we propose that you select a wireline benefit as a reinforcement. Settled line associations quite often offer a more steady data transfer capacity, guaranteeing that a live stream stays smooth and undisturbed. Select an association that components a data transfer capacity north of 1 Mbps.Since you have your web sorted, concentrate on procuring a PC that components a compelling processor. Additionally, ensure that your framework houses no less than 10 GB of RAM. Despite the fact that you'll discover a large group of PCs in the market that may coordinate your criteria, a hefty portion of these may overheat, keeping you from live streaming for long stretches. You can communicate similarly too from a tablet or a cell phone, yet along these lines, your gadget will deplete sooner, and a PC will demonstrate significantly more valuable.When you live stream, you might need to add a critique to your communicate thus it is basic that your amplifier is high caliber. To the extent your visual telecom goes, put resources into a section level proficient camcorder. You should match this with a catch card and you'll be good to go to stream. An encoder is a clever tool that transforms content from your camera into consumable, palatable nuggets that can be live streamed to users. Flash Media Live Encoder is a top encoder favored by many budding broadcasters.When you have your stream mix in place, you have one final step to go before you cross the threshold of creating a live stream. At this stage, you need to procure a live streaming platform. StreamNow is a multi-faceted, sophisticated live streaming framework that allows you to customize your stream, monetise it through sponsorships and subscription plans, and create live streams on the go. A streaming platform is an interface between you and your viewers, and with a versatile framework like StreamNow, you can reach a plethora of viewers across a range of devices.",
            "date": "Answered January 6, 2020",
            "views": "59",
            "upvotes": "0"
        }
    ]
}