{
    "title": "How do rappers come up with their names? - Quora",
    "tags": [
        "Names and Naming",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saul Friend",
                "href": "/profile/Saul-Friend-1"
            },
            "answer_text": "In most cases, people’s ‘rap names’ don’t represent some deeper meaning within the artist’s life. I’d say each rapper looks for a name that is: Memorable(Fairly) ShortOriginal (to some degree)The example that springs to mind is Post Malone, best known for the mellow hip-hop hit ‘White Iverson’:  In an interview with the hip-hop radio station The Breakfast Club, when asked about his name, Post Malone (whose real name is Austin Richard Post), says something along lines of: ‘Post is my last name, and I liked the way Malone sounded at the end’. Obviously there are rappers whose names hold deeper significance, but for the most part, I’d say that anything catchy and ‘cool’ does the job. Some more examples: Tupac Amaru Shakur - 2PacKendrick Lamar Duckworth - Kendrick Lamar (Kendrick is blessed with a memorable name, as is Kanye (Omari) West - sometimes real names are just as effective as ‘created’ ones)Quincy Matthew Hanley - ScHoolboy QTyler Gregory Okonma - Tyler, The CreatorDwayne Michael Carter Jr. - Lil Wayne",
            "date": "Answered October 13, 2016",
            "views": "62",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "EpicDuckBros",
                    "user_href": "/profile/EpicDuckBros"
                },
                {
                    "user_id": "Jordan Sanon",
                    "user_href": "/profile/Jordan-Sanon-1"
                },
                {
                    "user_id": "Mikko Korhonen",
                    "user_href": "/profile/Mikko-Korhonen-15"
                },
                {
                    "user_id": "Jesús Zazueta",
                    "user_href": "/profile/Jesús-Zazueta"
                },
                {
                    "user_id": "Autumn Smith",
                    "user_href": "/profile/Autumn-Smith-143"
                },
                {
                    "user_id": "Joe Glick",
                    "user_href": "/profile/Joe-Glick-1"
                },
                {
                    "user_id": "Ini",
                    "user_href": "/profile/Ini-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Boon",
                "href": "/profile/Sarah-Boon-1"
            },
            "answer_text": "Are you asking out of curiosity or out of inspiration? Because I can't tell you what ‘everyone’ does because ‘everyone’ is different and therefore have completely varying inspirations for ideas of what to name their outfit. I think people draw from everything including family, experiences with members within the group, in the case of some rap groups; but it's not possible to give you every reason or way to name themselves. Brainstorm and draw inspiration from experiences. Then think of what kind of genre and whether it relates to the image you want to bring forth. Some artists (obviously branching further out of the hip hop genre because I haven't got a great example on hand) aren't given the luxury of choice in naming themselves, even writing their own songs! Think of the Backstreet Boys, or NSync. So I hope I've answered your question even slightly, but it isn't really a question one person can give quantified answers too, in my opinion! ",
            "date": "Answered February 2, 2017",
            "views": "3",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad-Melhan Naz",
                    "user_href": "/profile/Muhammad-Melhan-Naz"
                }
            ]
        }
    ]
}