{
    "title": "How much of my time should I dedicate to God? - Quora",
    "tags": [
        "Orthodox Christianity",
        "Catholicism",
        "Time Management",
        "Theology",
        "God",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Grace Frost",
                "href": "/profile/Emily-Grace-Frost-1"
            },
            "answer_text": "I’ve been in a similar position to yours. The advice I would give you - and this is only advice, I’m not commanding you to do it - is this. Yes, we absolutely should glorify the Lord in everything we do. But as you’re finding now, it’s very hard to consciously think about God all day, every day. What a sister told me when I had pretty much the same problem as you was ‘Don’t worry. Just enjoy God as much as you can, and the expression and the glory will take care of itself.’ It so did. You see, glorifying God is basically expressing His Nature. His Nature is His Personality, and thus, He expresses it effortlessly, just like you or I express our personalities without ever having to think about it. For example, if you check my profile, you’ll see that I might have Asperger Syndrome, which is basically autism’s mild cousin. When I get up in the mornings, I don’t write myself a to-do list that says ‘Don’t like surprises and unpredictability, get more alone time than is probably healthy, dream about fantasy worlds, rant about history to those poor unsuspecting folks who ask about it, and refuse to wear anything polyester’. It just happens that way anyway, because that’s all the manifestation of the Asperger-ish aspects of my personality. When you’re one with the Lord (1 Cor 6:17), the glorification and the expression will happen by itself, because the Divine Nature will be working in you. Now, I’ll tell you a Bible story. When Moses came down from Mount Sinai after spending forty days and nights with God, the skin of his face was shining because of the glory of God, even though Moses didn’t realize what was happening until he came down and met Aaron and the elders. This shining eventually faded, but it is referenced in the New Testament in 2 Corinthians 3. We can all behold and reflect the glory of the Lord like a mirror (a mirror of the ancient world, so still not perfectly) until we are transformed into the same image. The way to behold the glory of the Lord so that we can reflect it is to turn our hearts to Him, to worship Him in sincerity and truth. And it does sound as though you’re trying to do that. Kudos to you. It’s good to have a set time to spend with God. Do it honestly, and to the best of your ability - He knows your concentration and all is limited, and that’s OK. And of course, talking to Him and thinking of Him all through the day whenever you can is great to. Peace. ",
            "date": "Answered July 8, 2017",
            "views": "618",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kori Ellis",
                    "user_href": "/profile/Kori-Ellis-7"
                },
                {
                    "user_id": "Marking Literature",
                    "user_href": "/profile/Marking-Literature"
                },
                {
                    "user_id": "Hayley More",
                    "user_href": "/profile/Hayley-More"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Skaggs",
                "href": "/profile/Stan-Skaggs"
            },
            "answer_text": "the short answer is “all your time”. God lives in your heart if you are a Christian. You do not need to actually make a conscience effort to “live for God”, because if you are saved, it comes naturally. For a proper Christian, it is an effort to NOT live for God, because he becomes an actual basis for your internal self-culture in your life. If you are trying to be in church all the time or impress someone with your piety, maybe you need to review your “life-song” as Casting Crowns says it quite well. Being a Christian is not how much you attend church nor the face you show. If your life is but a facade, then I can see how it would be draining for sure. When someone lives of life of lies, it wears deeply on them. You have to have the love and fortitude to just “live” for him. Too many times those who claim to be Christian are the facade style ones and will wither or loose their way eventually. Maybe you should speak to your pastor for advice or for introspection so you can discover the right path to make God the basis for your essence of life.. That should be your goal after all. ",
            "date": "Answered June 29, 2017",
            "views": "118",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Missy Lita",
                    "user_href": "/profile/Missy-Lita"
                }
            ]
        }
    ]
}