{
    "title": "How to know if you sing well without singing to someone else - Quora",
    "tags": [
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurie Carpenter",
                "href": "/profile/Laurie-Carpenter-3"
            },
            "answer_text": "Never let “someone else” tell you if you can sing well. If you don’t know that you sing well because that’s what your ears tell you, why do you sing at all? Either you doubt your own ears…which is very possible, or you just want someone else to think you sing well, too…and that’s normal. So, what you need then is an objective opinion on your voice. So record yourself, (download a tuning app to check to see if your pitches are correct) and let someone hear the recording who doesn’t know you, or doesn’t know that it is you singing. They will give you their honest opinion. If it is negative, don’t take it personally, ask them what exactly they didn’t like and let them tell you what you need to work on. ",
            "date": "Answered March 2, 2018",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wendy Sheridan",
                    "user_href": "/profile/Wendy-Sheridan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Phadnis",
                "href": "/profile/Anand-Phadnis-2"
            },
            "answer_text": "One way is to pick a song you know well or have at least heard a dozen times. Then sing along with the song as it plays on a “good” music system. Try to listen to yourself as you sing along. If you sing well, there will be a sort of synchronous and melodious … over all outcome. If you are out of synch with the singer, try and synchronize as much as you can. Are you able to match the peaks and the troughs of the singer well? In spite of your best efforts if you find yourself straining to match the highs and the lows, you are not a good singer. ",
            "date": "Answered March 2, 2018",
            "views": "147",
            "upvotes": "0"
        }
    ]
}