{
    "title": "How to sing from your diaphragm - Quora",
    "tags": [
        "Diaphragm (human body)",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Austin Coates",
                "href": "/profile/Austin-Coates-2"
            },
            "answer_text": "There is a little misconception of how the diaphragm works that's been spreading for years. The diaphragm doesnt actually move when you breath by your control. It's an involuntary muscle for hiccups, coughs while choking, and not much else. You have muscles between your ribs and your entire abdominal muscle group for breathing. When you breath for music, be it an instrument or singing, you do not want to breath with the musces between your ribs. Two reasons for this: one, breathing with your ribs gives way less volume than you get by pushing out your gut; and two, you can apply much more force of air by pushing with your gut than your chest. First, lets talk about breathing in. When you take in air, you literally want to expand your belly so it looks like you're a couple weeks pregnant. It should expand on all sides, even on your back a little, but it will mostly push your abs out and forward. Keep sucking in until you feel your muscles taugh in your lower torso (you don't need to painfully stretch them as a singer). Now just exhale, relax, and do it again, breathing in slowly until “breathing with your diaphragm” doesn’t feel weird anymore. Now, before you breath in, strudy chair to sit in, put your elbows on your knees, close your hands together, and put your head under your hands. Breath in just like you did before. Even if you didn't feel any stretching before, you should now (again, don't make it painful, just enough that you can feel yourself fighting to pull more air in). Now hold that air for 10 seconds, and relax. Repeat comfortably for about five minutes. You've just learned the most basic technique for expanding your lung capacity. Now we need to know how to use our air forcefully and how to control it. If you know what a plank is, the go ahead and skip to the next paragraph, but if not, allow me to explain. Lie down on the floor with your arms to your side, now push your self up to the push up position, now instead of holding yourself up by your hands, hold yourself up by your elbows (get a some bedsheets if you have itchy carpet or tile/hardwood). Make sure your butt isn't raised so that you have a straight line for your torso and legs and hold it. Feel that tightness in your stomach. That's your core muscles being flexed. When you have built up air in your gut, and you flex the muscles, it forces the air out really fast, which is what you want, but now we need to control the air stream. Pretend you have a straw tightly held inbetween your lips and force the air out. Notice how it doesn't all go away nearly as fast as when you are just pushing out an exhale. You want to recreate this effect with your vocal folds when you sing. You build up pressure by contracting your stomach and create fast air by having a small opening in your voice box where the sound is made. Obviously this will take fine tuning to become and operatic master, but that's what practice is for. Disclaimer: You are not actually sucking air into your gut, stomach, or intestines. When you push out the walls of your abdominal cavity, you make the intestines in that cavity flatter, why in turn pulls the diaphragm down, which in turn expands the lungs downwards to suck in air. Vice versa when you exhale. ",
            "date": "Answered May 4, 2017",
            "views": "34",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caioice Howard",
                    "user_href": "/profile/Caioice-Howard"
                },
                {
                    "user_id": "Octavius Robinson",
                    "user_href": "/profile/Octavius-Robinson-1"
                },
                {
                    "user_id": "Barbara Ro",
                    "user_href": "/profile/Barbara-Ro"
                },
                {
                    "user_id": "Alan Edmonson",
                    "user_href": "/profile/Alan-Edmonson"
                },
                {
                    "user_id": "Braelyn Cheer",
                    "user_href": "/profile/Braelyn-Cheer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "It is so easy, a baby can do it. Ironically, most adults (when they sing) don’t breath properly. Even many trained singers haven’t fully connected their training with their brains and their diaphragm. So, it first and foremost starts from the brain and your desire to communicate. Let's start by lying on the floor. Bend your knees if you like. Breath naturally. Feel that your breathing comes from the stomach area. That's it. Simple. Now let's try a few things with your voice. Cough. Notice from where it emanated from. Pretend you are a fire engine making siren sounds and get louder and higher each time you sound the siren. Yell \"HEY\" like you just caught someone stealing. Yell \"Bad\" as if your dog just messed on the floor. Yell \"GIT\" to a cat in your trash. Call for help three times with increasing volume as if no one can hear you. Say \"BOO\" like you are jumping out from behind a door to scare someone. Now, playfully say \"Woof!\" as if you are a puppy trying to entice its owner to play. Sing something. Now get on all fours and pant like a dog. Where does it all come from? Sing something. Do you see how easy and effortless all that was? Just for fun, while you are still on the floor, try not to breath from the stomach and only breath from the upper chest. After five minutes of breathing properly and effortlessly, can you now feel how wrong it is to breath from the chest and shoulders? Proper movement always makes improper movement to feel bad. The challenge now is to stand up and continue to breath that way after years of allowing your body to accept misuse as normal. ",
            "date": "Answered June 15, 2017",
            "views": "41",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vicky Styles",
                    "user_href": "/profile/Vicky-Styles-9"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Brandon Bedoya",
                    "user_href": "/profile/Brandon-Bedoya"
                },
                {
                    "user_id": "Kyle Hill",
                    "user_href": "/profile/Kyle-Hill-40"
                },
                {
                    "user_id": "Tilda Leigh",
                    "user_href": "/profile/Tilda-Leigh"
                },
                {
                    "user_id": "Michaele Hannemann",
                    "user_href": "/profile/Michaele-Hannemann"
                },
                {
                    "user_id": "Mary Niewola",
                    "user_href": "/profile/Mary-Niewola"
                },
                {
                    "user_id": "Jonathan Fong",
                    "user_href": "/profile/Jonathan-Fong-17"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        }
    ]
}