{
    "title": "How would you rank the IZ*ONE members in terms of musicality, dance, rap, vocals, and visuals? - Quora",
    "tags": [
        "IZ*ONE",
        "YG Entertainment",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Dance (activity)",
        "Hip Hop Music",
        "K-Pop Idols",
        "Music Industry",
        "K-Pop",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rae Subaih",
                "href": "/profile/Rae-Subaih"
            },
            "answer_text": "In terms of visuals, they all are very photogenic and no one stands out too much or too little just perfect I would say 9.5/10. ( By the way, I’m ranking by Korean beauty standards.) 12. Chaeyeon  11. Hitomi  10. Yuri  9. Yena  8. Nako  7. Yujin  6. Chaewon  5. Wonyoung  4. Eunbi  3. Sakura  2. Hyewon  Minju Vocal ranking: 12. Hyewon 11. Sakura 10. Minju 9. Hitomi 8. Nako 7. Wonyoung 6. Yujin 5. Yena 4. Chaeyeon 3. Chaewon 2. Eunbi YuriRap Ranking: 12. Nako 11. Hitomi 10. Chaewon 9. Yujin 8. Eunbi 7. Wonyoung 6. Sakura 5. Yuri 4. Hyewon 3. Chaeyeon 2. Minju YenaFor dancing, none of them seem to lack but sometimes the Non- Dancers seem to under dance a little bit I would say 12th Place. Hyewon lacks a lot in performance which is totally fine since she isn’t a dancer but her movements tend to be awkward she is an inexperienced dancer but she should improve over time. Her weakness seems to be her placements she lacks also flexibility, rhythm, and stage presence she seems to look bored. 11. Sakura she has great facial expression and is good with charisma. She seems to be weak in her versatility when she tries different dance styles she isn’t used to. She lacks Isolations, consistency, flow, and rhythm. 10. Minju is a decent dancer for an idol in some movements she tends to look stiff she sometimes under dances she has ok isolations. She sometimes lacks facial expressions. 9. Nako has great isolations which we can easily see especially since she was in ballet. She has great Facials, agility, and flow. Her weaknesses are when it comes to versatility and different dance styles. Her height also makes it look like she is lacking in power because of that she tends to over dance. 8. Yuri has improved so much since 48, Yuri has a great technique she never tends to under dance her movements are well balanced because of her long limbs. She can easily try new types of dance to showcase but seems to lack flow and versatility when doing so. 7. Wonyoung for being so young she is doing a very good job as a center but to be a lead dancer no she is below average for the lead. She has long limbs compared to her members making it look as if she is over dancing. She has low versatility which is a disadvantage. 6. Hitomi is slightly low for a lead but is an above-average idol dancer. She has great flexibility, isolation, agility, and balance with great charisma. I noticed when the choreography becomes harder she seems to get tense and her facial expression darken but other than that she is a great dancer. 5. Yujin a pretty average lead dancer she has great flexibility, isolation, agility, balance, consistency, and clean placements. When it comes to the technique she is underdeveloped and seems stiff she doesn’t show enough facial expressions. 4. Yena I believe she is above average for a lead dancer. She has great isolation balance, flexibility, facials, placements, and consistency. Sometimes she comes off as stiff she is slightly underdeveloped. 3. Chaewon like Yena she is also an above-average lead dancer if in another group she could be the main dancer. Chaewon has great isolation balance, flexibility, facials, placements, consistency, technique, flow. power, and versatility. 2. Eunbi she is a very well trained dancer. She has great isolation, consistency, facials, power, flexibility, balance, agility, flow, technique, and versatility. Chaeyeon has great isolation, consistency, facials, power, flexibility, balance, agility, flow, technique, versatility, stamina, and placements! She is a great idol dancer and a great dancer overall.This to me HOURS to complete every upvote I get I will add a meme :) follow me bye! ",
            "date": "Answered October 20, 2020",
            "views": "338",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Camila Lugo Alvarez",
                    "user_href": "/profile/Camila-Lugo-Alvarez"
                },
                {
                    "user_id": "Hannah Banana",
                    "user_href": "/profile/Hannah-Banana-157"
                },
                {
                    "user_id": "Amir Aviv",
                    "user_href": "/profile/Amir-Aviv"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yeona Kim",
                "href": "/profile/Yeona-Kim-5"
            },
            "answer_text": "I’m actually not a Wiz*One, so I’ll only be doing visuals- 1)  She’s so pretty- 2)  Also so pretty- And don’t take any of my rating too seriously, they’re all beautiful! 3)  Weow, I think I recognize her from ‘S.Story of the Swan’- 4)  She just gives me queen vibes- 5)  Gorgeous! 6)  Are those cheeks I see- So cute! 7)  Also so pretty! 8)  Poof, why’s it so tiny- 9)  Weow, that’s a lot of members- We’re on number 9, but they’re still so pretty- 10)  *smug smirks back* We know something you don’t. 11)  I know you from somewhere >.> 12)  Remember! No offense, this is my opinion. ",
            "date": "Answered October 20, 2020",
            "views": "58",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lali Jordan",
                    "user_href": "/profile/Lali-Jordan"
                },
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                }
            ]
        }
    ]
}