{
    "title": "How good of a guitar player is The Dooo? - Quora",
    "tags": [
        "Guitarists",
        "Playing Guitar",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricio Vasquez",
                "href": "/profile/Patricio-Vasquez-3"
            },
            "answer_text": "If you are asking in terms of other YouTube guitar players, he is definitely at the top. It's not just because he knows RIFFS, as one guy comments, and he should not be compared in terms of Eric Clapton or Jimi Hendrix, as one other dooood comments. The Doooo is much better than other YouTube guitarist such as Jared Dines or Rob Scallon because he had a very good musical ear. He actually doesn't know RIFFS like people think. What he can do is hear a song or melody, and interpret it relatively well. Like understanding a language, when someone says something and you can repeat it back. That's why it seems like he knows so many RIFFS (very stupid statement by someone). He rocks a fucking Fender Squire for fucks sake! It doesn't even have 21 frets, let alone 24 and more strings. As far as ranking goes, it's hard to say, because guys like 331Erock have a BA from Berkeley in classical music, and Sarah Longfield is diverse in that she can sing and her technique is so, well, unique. Hope this helps :) ",
            "date": "Answered May 4, 2018",
            "views": "452",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Saini",
                    "user_href": "/profile/Ravi-Saini-35"
                },
                {
                    "user_id": "Zach Hodges",
                    "user_href": "/profile/Zach-Hodges-4"
                },
                {
                    "user_id": "Zack Jandali",
                    "user_href": "/profile/Zack-Jandali"
                },
                {
                    "user_id": "Aung Guita",
                    "user_href": "/profile/Aung-Guita"
                },
                {
                    "user_id": "Jaemz Graciano",
                    "user_href": "/profile/Jaemz-Graciano"
                },
                {
                    "user_id": "Dipen Ganguly",
                    "user_href": "/profile/Dipen-Ganguly-1"
                },
                {
                    "user_id": "Kim Bahir Andersen",
                    "user_href": "/profile/Kim-Bahir-Andersen"
                },
                {
                    "user_id": "Seb Bagley",
                    "user_href": "/profile/Seb-Bagley"
                },
                {
                    "user_id": "Grant Pierce",
                    "user_href": "/profile/Grant-Pierce-18"
                },
                {
                    "user_id": "James Smede",
                    "user_href": "/profile/James-Smede"
                }
            ]
        }
    ]
}