{
    "title": "How many kinds of music are there? What are they? - Quora",
    "tags": [
        "Music Genres",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-176"
            },
            "answer_text": "Seems to me there’s only two types of music: good and bad. Regardless of genre, music must appeal to the senses and the emotions in some way. If it doesn’t succeed, then for you it is bad. However, and it’s a big ‘however’, we are not all made the same way in terms of our emotional responses (I know, I’m stating the obvious) so what appeals to one person may not appeal to another. For myself, popular music must possess a good melody or at least have words that express feeling*. There have been masters of this kind of thing over the last century, for a few examples Rodgers and Hart, Rodgers and Hammerstein, Irving Berlin, George and Ira Gershwin, Cole porter, Burt Bacharach and Hal David. Then there’s the performer who can lift what might with the average singer become a mediocre song and turn it into a classic. An example of this is ‘That’s All’, as sung by Frank Sinatra. I’ve read somewhere or other that this song was considered to be one of the finest ever written, yet if you ignore the singer’s performance and listen to the melody, there’s very little of that other than a simple repeated phrase. Yet I’d agree - with the right singer, it is a great song. Performance can sometimes be all. Whether you like brass bands, country music, all and any form of classical music from string quartet to full orchestra, from soprano to choir, from jazz ensemble to big band, from rock to ballad, you will know when you hear something you like and for you, that will be good. I like some of all these genres. *Even if sung in a language you do not understand, like ‘In Trutina’ with words of ancient Latin. Pure magic. ",
            "date": "Answered January 8, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua A. Pfeiffer",
                "href": "/profile/Joshua-A-Pfeiffer"
            },
            "answer_text": "There are literally about ten million genres of music (ok I exaggerate a little), but no joke… there are a lot of genres of music. Listing them all would take a week. So let me use someone else’ list Alternative Rock College Rock Crossover Thrash Crust Punk Experimental Rock Folk Punk Goth / Gothic Rock Darkwave Deathrock Grunge Hardcore Punk Hard Rock Indie Rock Lo-fi New Wave Synthwave Freestyle Progressive Rock Punk Shoegaze Steampunk Blues Acoustic Blues Chicago Blues Classic Blues Contemporary Blues Country Blues Delta Blues Electric Blues Ragtime Blues Children’s Music Lullabies Sing-Along Stories Classical Avant-Garde Baroque Chamber Music Chant Choral Classical Crossover Contemporary Classical Early Music Expressionist High Classical Impressionist Medieval Minimalism Modern Composition Opera Orchestral Renaissance Romantic (early period) Romantic (later period) Wedding Music Comedy Novelty Vaudeville Country Alternative Country Americana Bluegrass Contemporary Bluegrass Contemporary Country Country Gospel Country Pop Honky Tonk Outlaw Country Traditional Bluegrass Traditional Country Urban Cowboy Club / Club Dance Breakcore Breakbeat / Breakstep Brostep Chillstep Deep House Dubstep Electro House Electroswing Future Garage Garage Glitch Hop Glitch Pop Grime Hardcore Hard Dance Hi-NRG / Eurodance Horrorcore House Jackin House Jungle / Drum’n’bass Liquid Dub( Regstep Speedcore Techno Trance Trap Easy Listening Bop Lounge Swing Electronica 2-Step Chiptune Ambient Bassline Chillwave Crunk Downtempo Drum & Bass Electro Electronic Rock Hardstyle Techno Detroit Techno Minimal Techno IDM Industrial Trip Hop Enka French Pop German Folk German Pop Fitness & Workout Hip-Hop/Rap Alternative Rap Bounce Dirty South East Coast Rap Gangsta Rap Hardcore Rap Hip-Hop Latin Rap Rap Turntablism Underground Rap West Coast Rap Holiday Chanukah Christmas Halloween Indie Pop Industrial Christian & Gospel CCM Christian Metal Christian Pop Christian Rap Christian Rock Classic Christian Gospel Instrumental March (Marching Band) J-Pop J-Rock J-Synth J-Ska J-Punk Jazz Acid Jazz Avant-Garde Jazz Bebop Big Band Blue Note Contemporary Jazz Cool Jazz Crossover Jazz Dixieland Ethio-jazz Fusion Gypsy Jazz Hard Bop Latin Jazz Smooth Jazz K-Pop Kayokyoku Latin Tango Baladas y Boleros Bossa Nova Brazilian Cumbia Flamenco Latin Jazz Nuevo Flamenco Fado Raíces Reggaeton Salsa New Age Opera Adult Contemporary Britpop Bubblegum Pop Chamber Pop Dance Pop Dream Pop Electro Pop Orchestral Pop Pop/Rock Pop Punk Power Pop Soft Rock Synthpop R&B/Soul Disco Doo Wop Funk Motown Neo-Soul Northern Soul Psychedelic Soul Quiet Storm Soul Blues Southern Soul Reggae 2-Tone Dancehall Dub Roots Reggae Ska Rock Acid Rock Afro Punk Adult Alternative Alternative Rock American Traditional Rock Anatolian Rock Arena Rock Art Rock Blues-Rock British Invasion Cock Rock Death Metal / Black Metal Doom Metal Glam Rock Gothic Metal Grind Core Hair Metal Hard Rock Math Metal Math Rock Metal Metal Core Noise Rock Jam Bands Post Punk Prog-Rock Progressive Metal Psychedelic Rockabilly Roots Rock Singer/Songwriter Southern Rock Stoner Metal Surf Technical Death Metal Tex-Mex Time Lord Rock ( Trash Metal Alternative Folk Contemporary Folk Indie Folk Folk-Rock Love Song Traditional Folk Soundtrack Spoken Word Chicano Classic Conjunto Traditional Pop Vocal Jazz Vocal Pop World Africa Afro-Beat Afro-Pop Calypso Caribbean Carnatic Celtic Celtic Folk Contemporary Celtic Coupé-décalé Dangdut Drone Hawaiin Guitar Indian Ghazal Indian Pop Klezmer Polka Soca Worldbeat Zydeco ~ I guarantee there are more missing from this list too! ",
            "date": "Answered April 28, 2017",
            "views": "103",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tonny Muthuri",
                    "user_href": "/profile/Tonny-Muthuri"
                },
                {
                    "user_id": "Yashab Masih",
                    "user_href": "/profile/Yashab-Masih"
                },
                {
                    "user_id": "Rachitha Naidu",
                    "user_href": "/profile/Rachitha-Naidu"
                },
                {
                    "user_id": "Anurag Agarwal",
                    "user_href": "/profile/Anurag-Agarwal-103"
                }
            ]
        }
    ]
}