{
    "title": "How can one correct the low E string buzzing in guitar? - Quora",
    "tags": [
        "Strings (data type)",
        "Acoustic Guitars",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Riju Chatterjee",
                "href": "/profile/Riju-Chatterjee-4"
            },
            "answer_text": "Well I'm no luthier, but from what I understand, there's actually a few things that could cause string buzz. In your case, I think the problem is probably a warped neck or fretboard. Could be the weather, if it's been unusually dry or humid recently that probably explains it. Something quite similar happened to my guitar during a very dry spell, but actually more severe. Took it to a guitar store, the guy just said to wait it out, and my guitar became playable soon after the rains started. You might be able to get your fretboard planed or your neck straightened. Low action in and of itself could cause buzz when the strings are played hard, especially on an acoustic guitar. A faulty bridge could cause different action on different strings, so to speak, and cause buzzing on some strings that way. If the frets aren't all flush with the fingerboard, or are not uniform, that might cause buzz. The low E on my guitar buzzes across the 13th fret when I fret it at the 12th because the 13th fret isn't quite flush. Buzzing might happen in the nut if the string sits loose in it, though this probably only effects stuff when you play the string open. There's a powder and superglue hack you can use to fix this. Incorrect truss rod adjustment will of course cause buzz, but it would probably then do so uniformly across strings. ",
            "date": "Answered March 25, 2017",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike O'Connor",
                "href": "/profile/Mike-OConnor-20"
            },
            "answer_text": "Sounds like the nut could be a millimetre too low for the E string. Both bridge and nut should be notched or angled so they allow for the different string diameter between top and bottom strings. But before you do any more woodwork have a look here! What causes Fret Buzz? ... and How to Fix it! ",
            "date": "Answered March 25, 2017",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arjun Gooptu",
                "href": "/profile/Arjun-Gooptu"
            },
            "answer_text": "Experienced similar problems. Sometimes it's as simple as tightening a small component such as a screw in the headstock, the strap lock or the bridge. It's probably resonance causing the issue at higher frets. Check the bridge and the headstock. ",
            "date": "Answered July 29, 2014",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sooraj Sadanandan",
                "href": "/profile/Sooraj-Sadanandan"
            },
            "answer_text": "Slide a wax match through the groove for the string at the neck before the first fret. And the let yoir e string sit on the groove. Your grooves wouldve worn out. Or replace the whole bit. ",
            "date": "Answered July 29, 2014",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rohan Parab",
                    "user_href": "/profile/Rohan-Parab-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandre Morgand",
                "href": "/profile/Alexandre-Morgand"
            },
            "answer_text": "There is a very detailed article about it : How to Fix Electric Guitar String Buzzing Hope this help. ",
            "date": "Answered July 31, 2014",
            "views": "47",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laurent Senta",
                    "user_href": "/profile/Laurent-Senta"
                },
                {
                    "user_id": "Ashutosh Sharma",
                    "user_href": "/profile/Ashutosh-Sharma-30"
                },
                {
                    "user_id": "Shrikant Tyagi",
                    "user_href": "/profile/Shrikant-Tyagi"
                }
            ]
        }
    ]
}