{
    "title": "How to write original music without stealing other songs - Quora",
    "tags": [
        "Music Composition",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "There's a good reason why your ideas all morph into songs you're familiar with. Where else could your ideas have come from? I believe firmly that there is no true originality in music. There's just the adaptation and hybridization of existing musical ideas. Occasionally, someone will try a combination of sounds that's genuinely unique, but most of those experiments fail. Just about every good idea has been used before, probably many times. So what does this mean for songwriters and composers? It means that you shouldn't run away from your influences. You can't escape them, and you just weaken your music by trying. Instead, you need to run toward your influences. Embrace them, absorb them, make them your own. If your \"original\" idea turns into a  Radiohead song, that's your brain telling you to study that Radiohead song. Go ahead and work out a cover of it. Try different arrangements. Write a new intro and ending. Write a new bridge. Write some new lyrics. Record it with strange instrumentation. Eventually you can drop the most recognizable parts of the Radiohead song, and you'll probably be left with the coolest track you've ever made. ",
            "date": "Answered January 24, 2013",
            "views": "54",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oren Webster",
                    "user_href": "/profile/Oren-Webster"
                },
                {
                    "user_id": "Sean Chase",
                    "user_href": "/profile/Sean-Chase-5"
                },
                {
                    "user_id": "April Squid",
                    "user_href": "/profile/April-Squid"
                },
                {
                    "user_id": "Shyam Mehta",
                    "user_href": "/profile/Shyam-Mehta"
                },
                {
                    "user_id": "Mateo Morales - Nome",
                    "user_href": "/profile/Mateo-Morales-Nome"
                },
                {
                    "user_id": "Rebecca Young",
                    "user_href": "/profile/Rebecca-Young-281"
                },
                {
                    "user_id": "William Burgess",
                    "user_href": "/profile/William-Burgess-13"
                },
                {
                    "user_id": "Luzbel DoNotPanic",
                    "user_href": "/profile/Luzbel-DoNotPanic"
                },
                {
                    "user_id": "Russell Spear",
                    "user_href": "/profile/Russell-Spear"
                },
                {
                    "user_id": "Mujthaba CH",
                    "user_href": "/profile/Mujthaba-CH"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam Lohia",
                "href": "/profile/Shivam-Lohia-13"
            },
            "answer_text": "Creating ‘good’ original music requires a will to speak your heart out about your real life experiences. In fact, every art which deeply connects with the audience is crafted out of real experiences undergone by the artist. You cannot force yourself to write, it just does not work that way and even if it does, you’ll end up creating something mediocre or copying someone you admire depending upon the level of your musicality which is what a lot of people are doing today. I know someone who got so frustrated because he was unable to write a song that he ended up writing a song called “Write” which was about the emotion to not be able to write. You see what I mean? Also, compared to all his previous drafts when he forced himself to write, the last one undoubtedly turned out to be the best. It’s okay to be inspired by other artists and have a desire to write songs like them but you need to understand and accept that every person lives a different, unique life and you cannot put someone else’s experience into your art unless you deeply connect with their emotion. With your emotion in the song, you won’t have to worry about stealing someone else’s melody because you’ll always have your own connect with the song. To write, to create is to re-live the emotions which shape you for who you are. Be original. ",
            "date": "Answered June 26, 2019",
            "views": "13",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sini Siren",
                    "user_href": "/profile/Sini-Siren"
                },
                {
                    "user_id": "Priyanshi Lohia",
                    "user_href": "/profile/Priyanshi-Lohia-2"
                },
                {
                    "user_id": "Harshish Kaur",
                    "user_href": "/profile/Harshish-Kaur-2"
                },
                {
                    "user_id": "Rahul Manik",
                    "user_href": "/profile/Rahul-Manik-10"
                },
                {
                    "user_id": "Subhranil Ghoshal",
                    "user_href": "/profile/Subhranil-Ghoshal-1"
                },
                {
                    "user_id": "Pragati Sharma",
                    "user_href": "/profile/Pragati-Sharma-460"
                },
                {
                    "user_id": "Seerat",
                    "user_href": "/profile/Seerat"
                },
                {
                    "user_id": "Shubham Lohia",
                    "user_href": "/profile/Shubham-Lohia-21"
                },
                {
                    "user_id": "Archita Sharma",
                    "user_href": "/profile/Archita-Sharma-13"
                },
                {
                    "user_id": "Anoushka Alang",
                    "user_href": "/profile/Anoushka-Alang"
                }
            ]
        }
    ]
}