{
    "title": "How to learn to sing with a good voice on my own - Quora",
    "tags": [
        "Learn to Sing",
        "Tone",
        "Vocal Music",
        "Learning Music",
        "Singing Voice",
        "Voice",
        "Singing",
        "Advice",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Graves",
                "href": "/profile/Michael-Graves-14"
            },
            "answer_text": "Don't worry so much about your vocal tone, timbre, blah blah blah.  Some of the most famous singers in the world have weird vocal qualities i.e. Willie Nelson, Bob Dylan, Michael Jackson (Yes I said Michael Jackson.  Albeit he was phenomenal, men don't usually sound that way). Focus on developing your ability to sing relatively in tune or on pitch.  If a crow can sing in tune and perform an interesting song, then that crow has a very good chance of developing a following of Crow song lovers.  Notice I capitalized 'Crow'. Point is, quality is subjective.  You can't please all the people all the time.  Simply get to singing in tune and shaping your tones.  Let the quality of your tone be your signature, not your deterrent.  To many people sound the same.  Stand out, but stand out in tune.  Become The Crow instead of a crow. The key is not to try to sing like (insert famous name here), but to sing AS GOOD AS (insert same famous name here).  And that simply comes from establish solid basics to build on. You can start with a vocal coach, like myself you wanted to, but it's not really necessary to start off with.  Going to YouTube can be good, but it can also be confusing and deflating as you are rolling the dice as to who you are listening to. Start simple.  Pick a path and a method and stick with it.  I of course am going to suggest my method.  But that is what it is, a suggestion.  Utlimately it is up to you.  But I have made things pretty simple and straightforward without any pretentious added fluff and flourish in my book. Singing From Scratch: How To Sing Like A Pro - Kindle edition by Michael Graves. Arts & Photography Kindle eBooks @ Amazon.com. You can also find more info on my site: Singing From Scratch And the is me and some of my students so you know I have an idea of what I am talking about.   Peace and happy singing. P.S.  Drink 'Singers Tea' for your throat. Cup of hot waterHalf a squeezed lemonTablespoon of Honey1/4 teaspoon of cayenne pepper. You can sing if you have a sore throat.  But you don't want to sing if you have swollen glands.  That is how you can damage your throat. ",
            "date": "Answered April 2, 2015",
            "views": "72",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roma May",
                    "user_href": "/profile/Roma-May-2"
                },
                {
                    "user_id": "Ramneek Handa",
                    "user_href": "/profile/Ramneek-Handa-2"
                },
                {
                    "user_id": "Katrina Miranda",
                    "user_href": "/profile/Katrina-Miranda-3"
                },
                {
                    "user_id": "A. Myhrer",
                    "user_href": "/profile/A-Myhrer"
                },
                {
                    "user_id": "Marco Solis",
                    "user_href": "/profile/Marco-Solis-7"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Erick Vinicius",
                    "user_href": "/profile/Erick-Vinicius"
                },
                {
                    "user_id": "Nivedita Naidu",
                    "user_href": "/profile/Nivedita-Naidu-3"
                },
                {
                    "user_id": "Meera Venkat",
                    "user_href": "/profile/Meera-Venkat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luis García Pimentel",
                "href": "/profile/Luis-García-Pimentel"
            },
            "answer_text": "I have been singing semi-professionaly for almost 20 years, so here is my view on this. Singing is like learning to play any other musical instrument, but in this case the instrument is your own body and you don't get to choose it.  Within the limits of your body capacity and your innate musical ability, you can always learn how to use your voice and sing to your best potential. But this as on any other instrument almost always require mentoring and training by a capable teacher, it is very hard to do it on your own. There is always the talk about self made artists but these are a) very few b) very capable musically  c) prone to have medical problems with their voices later on. You don't say what your interest in music is, but i would say consult a singing teacher and sign up for some formal training. He/she will help you identify what your range is, teach you how to breath properly, how to use your vocal chords and resonators to discover your timbre without damaging your voice and ultimately you will be able to sing to your capacity with enough work, rehearsal and excercises. Is it worth it? for me it is, singing is something I enjoy very much and people is always apreciative of my singing, and makes me money on the side.  Being a full time pro singer is something I decided not to be long ago, but only because of the sacrifices required to make a living out of it in my own country. Good luck ",
            "date": "Answered January 26, 2015",
            "views": "35",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Irvan Tjen",
                    "user_href": "/profile/Irvan-Tjen"
                },
                {
                    "user_id": "Katrina Miranda",
                    "user_href": "/profile/Katrina-Miranda-3"
                },
                {
                    "user_id": "A. Myhrer",
                    "user_href": "/profile/A-Myhrer"
                },
                {
                    "user_id": "Marja Kari",
                    "user_href": "/profile/Marja-Kari"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                },
                {
                    "user_id": "Chaitanya Sri Krishna",
                    "user_href": "/profile/Chaitanya-Sri-Krishna-1"
                },
                {
                    "user_id": "Erick Vinicius",
                    "user_href": "/profile/Erick-Vinicius"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                }
            ]
        }
    ]
}