{
    "title": "How would you rank your K-pop biases in terms of vocals? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jay M. Short",
                "href": "/profile/Jay-M-Short"
            },
            "answer_text": "This is based off my opinion and which voice I like better. Don’t get salty in the comments plzz!! im just going to do my boy groups b/c i stan like 27 groups. Taehyung, BTS Xiumin, EXO JB, GOT7 Jonghyun, SHINee BX, CIX Hyungwon, Monsta x Jongho, ATEEZ Felix, Stray Kids Jungwoo, NCT 127 Chenle, NCT Dream Kun, wayv/nct Minghao and Joshua, Seventeen Leetuck, SJ Rocky, Astro Youngmin, AB6IX Young K, DAY6 Wow, A.C.E BIC, MCND Kino, Pentagon Xion, ONEUS Jay, iKON Hwiyoung, SF9 Ayno, VAV Nine, OoF like hav of these men r rappers 😬 sooooooooooooooooooooooooooooooooooo ye i guess time to rate #1 Jongho ATEEZ  He is a very good singer, but compared to the other idols i am putting him at the top. If you don’t know what this heavenly male songs like bro :’(. #2 Jonghyun SHINee  his voice is very very smooth and very good. His high notes were amazing and just what every song needed. we love u man!!! #3 Young K Day6  his voice is very unique. you can’t compare his voice to many other idols. You can hear how much power that goes into each and every line of the songs. #4 Kino Pentagon  this boy is a god at singing. The thing above is him singing Spring Day by BTS and dude! 10/10 vocals. His deep voice and high voice combined his eye watering. #5 Kun WayV/NCT  his voice is like young k’s. unique, and in it’s own way. I can’t really explain how good his voice is. Like fam…. GIVE ME YOUR VOCAL GENES!! and his visuals make his voice even more…like…. unique?! idk man it is great tho. #6 Taehyung BTS  his deep ass thick singing voice is GOLDEN!! he was my very first bias in kpop. and that was when DNA came out so i was fucked, u know?! (that era i think was hella fine for all of the members!) #7 Jungwoo NCT  his vocals in Make Your Day is fucking PHENOMENAL!!! his voice is a high pitched vocal that i usually would dis abt but i loved his voice since BOSS came out.  #8 JB GOT7  oh. my. god. YAS. His vocals are very strong, but not as stronger as Youngjae’s vocals. But, JB’s vocals are very loud and that’s a good thing for his display in the group. #9 Chenle NCT  Chenle has that kinda of vocal noise that has a whine to it. Which a super cool way to sing b/c it gives a flare to his singing. #10 Rocky Astro  his voice is good, but i like his voice as a rapper. ik he is a rapper but i wouldn’t mind if he sneaked a vocal thingy into a song like…. yes please sirrr!! #11 Joshua Seventeen  H O N E Y, this bitches voice is S i c K iN iNG!!!! anyway his voice is nice and smooth 👌. #12 Minghao/The8 Seventeen  His voice is good but not as good as like Jongho’s u know?! it is a kinda of voice that is nice and smooth but then you are like “WOAH!!! you can do that?! sick dude 😎👏” #13 Nine OOF  His voice is more on the deep side which i dont mind, but i get i confused with Rie which is pretty sad b/c i can tell if something is different, but with them two i just can’t bro. #14 Jay iKON   10/10. period. #15 Wow A.C.E  #16 Hyungwon Monsta X  (i lowkey forgot abt the idols at 16–19) His voice is good but sometimes im like “hun where is da flavor?!” (not really tho) #17 Xiumin EXO  i do like his voice but it isnt very wowing like Baekhyun or Chen. His vocals aren’t bad but they are not as good as Jongho’s or Kino’s. #18 Xion Oneus  His voice compared to Chenle’s and Young k’s it is ok, but good at the same time. so like 50/50 kinda… idk man this shit is hard 😭 #19 Felix Stray Kids  *inhales* *exhales* bro idk what to say man. His voice is nice, but it is kinda weird b/c his voice is so deep idk if he is rapping or singing. (from he to the end i am just done with this answer) #20 Anyo VAV  #21 Youngmin AB6IX  #22 Leeteuk SJ  #23 Hwiyoung, SF9  #24 BIC, MCND  (the last one is BX but i dont think his voice is awful. He is an amazing rapper!) #25 BX CIX  :D ok damn that took 5 fucking hrs to complete….. my hands are fucked so yeah im done for the day maybe. love y’all and peace out lettuce heads ;p stay fresh 🌱 ~maDDi 💕✌ ",
            "date": "Answered June 25, 2020",
            "views": "528",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Smith",
                    "user_href": "/profile/Emily-Smith-3666"
                },
                {
                    "user_id": "Josie Bradsby",
                    "user_href": "/profile/Josie-Bradsby-1"
                },
                {
                    "user_id": "Chou Tzuyu¹²⁷",
                    "user_href": "/profile/Chou-Tzuyu¹²⁷"
                },
                {
                    "user_id": "Xeritz Notomi",
                    "user_href": "/profile/Xeritz-Notomi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Yuqi-Wong-៹༢"
                },
                {
                    "user_id": "Murthida Salaou",
                    "user_href": "/profile/Murthida-Salaou"
                },
                {
                    "user_id": "Susan Miller",
                    "user_href": "/profile/Susan-Miller-927"
                },
                {
                    "user_id": "Keerthi Rao",
                    "user_href": "/profile/Keerthi-Rao-79"
                },
                {
                    "user_id": "Isha R",
                    "user_href": "/profile/Isha-R-13"
                },
                {
                    "user_id": "Jordan Foley",
                    "user_href": "/profile/Jordan-Foley-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emilee Resendez",
                "href": "/profile/Emilee-Resendez"
            },
            "answer_text": "I will first state the group and my bias in alphabetical order cuz why not. Then after I state all of them I will rank them also I am a multi stan so sorry if it’s long. (/Sorry if I don’t stan enough groups to be called a multi) Ateez: Song Mingi and Jung Wooyoung   BlackPink: Lisa  BTS: Tae and Kook   Got7: BamBam and Jinyoung   NCT 127: Yuta and Jaehyun   NCT Dream: Jeno  WayV: Yukhei and Ten   Stray Kids: I’m an OT9 but I kinda have been getting into Bin sooo  Twice: Jeongyeon  TXT: Soobin and Taehyun   Verivery: Yeonho and MinChan   Okay so now that you know all my bias’ and you have a visual representation and won’t confuse them I can get onto the question. Yeonhofollowed really closely by JungkookTenTaehyungjeongyeonWooyoungJaehyunJinyoungYutaJenoLisaSoobinTaehyunBamBamBinnieLucasMinchanMingiGuys I’m being honest this is based on what I have heard. If you disagree, Be polite about it. Comment evidence you have then I could change my list if I agree with you, I will also credit you. If you do choose to be rude I won’t acknowledge you. ~Emilee♡ ",
            "date": "Answered June 25, 2020",
            "views": "80",
            "upvotes": "0"
        }
    ]
}