{
    "title": "How to glue brass fitting onto a PVC pipe - Quora",
    "tags": [
        "PVC Pipes",
        "Polyvinyl Chloride (PVC)",
        "Brass (material)",
        "PVC and Plastic Piping",
        "Superglue",
        "Glue and Adhesives",
        "Pipes (construction material)",
        "Plumbing",
        "Do It Yourself (DIY)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Farrow",
                "href": "/profile/Jack-Farrow"
            },
            "answer_text": "Yes, but not with the glue used for PVC pipe; that glue doesn’t stick to brass. You need an epoxy glue that sticks to both the PCV and the brass. Before gluing, both the PVC pipe an brass fitting should be clean and free from oil. The PVC pipe should go into the brass fitting, not the brass fitting into the PVC pipe as you describe. For a durable, leak-free joint, the softer material (PVC) should go inside, the harder material (brass) on the outside. But, if you need to transition from PVC to brass, why don’t you use a fitting designed for that purpose? There are many! One example: SharkBite Push-Fit Fittings ",
            "date": "Answered November 13, 2019",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Robertson",
                "href": "/profile/Frank-Robertson-3"
            },
            "answer_text": "So long as the fittings fit together reasonably well, I suppose you can glue them anyway you like. They probably won’t meet any building plumbing code, and may or may not hold water,but one could still certainly glue them together. Instead of gluing the PVC to the brass, though, I would glue a threaded PVC adapter to the plastic pipe, then solder/braze/sweat a threaded fitting to the brass pipe with the same size and opposite thread as the PVC, put some pipe dope on the threads and screw them together. ",
            "date": "Answered November 13, 2019",
            "views": "65",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stuart Lew",
                    "user_href": "/profile/Stuart-Lew"
                },
                {
                    "user_id": "Gary Brooks",
                    "user_href": "/profile/Gary-Brooks-85"
                },
                {
                    "user_id": "Fordy Zeloff",
                    "user_href": "/profile/Fordy-Zeloff"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Richardson",
                "href": "/profile/Mike-Richardson-78"
            },
            "answer_text": "Get a male pvc and a brass female fitting to do it properly. There is nothing on the market that will provide you a good connection. If it is a open air drain, pure silicone will seal the two together. It will not last forever though. ",
            "date": "Answered November 13, 2019",
            "views": "20",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Don Kemmerer",
                    "user_href": "/profile/Don-Kemmerer"
                }
            ]
        }
    ]
}