{
    "title": "How to get someone to stop forcing you to listen to their music - Quora",
    "tags": [
        "Listening to Music",
        "Listening",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Meegan Parker",
                "href": "/profile/Meegan-Parker"
            },
            "answer_text": "Politely but firmly (and possibly at great length) tell them that you don't care for that type of music at all, and you wouldn't force them to listen to REO Speedwagon or Dan Fogelberg. Tell them that if they want to be your friend or even be in your presence you must not hear one more note of that music. Play REO Speedwagon or Dan Fogelberg every time they play their music. Play yours louder. As loud as necessary. Tell their mom. Tell them you think that you both need some time apart. Unless they can guarantee that they won't force you to listen to ----- ever again. If they agree, produce a contract. They need to sign in blood. House arrest. Destroy their phone/iPod/speakers/etc Explain politely that their music is against your religion. Say you're a vegan and to you their music, like meat, is murder. Tell them that Morrisey said so before he turned into George Bush. Note: if by “their\" music, you meant they created/composed/wrote it, you're screwed. You *have* to listen to it or end the relationship. Sorry dude. p.s. I was not implying that RS and DF are your music; just trying to think of music about which there might be a general consensus of distaste, as well as ammo for suggestions that involved retribution music--mp ",
            "date": "Answered January 8, 2020",
            "views": "84",
            "upvotes": " Answer requested by Benjamin Woods"
        },
        {
            "author_info": {
                "name": "Ramona Owens",
                "href": "/profile/Ramona-Owens-10"
            },
            "answer_text": "I have the same problems. My husband thinks when he plays music that the whole neighborhood hears, no matter what time of day. And it keeps getting louder.. the best way to get away from it is find something else to do, somewhere else, or simply go switch the breaker in the electric panel. Eventually he'll get the point, especially when you just randomly turn it down on your way through the room ",
            "date": "Answered January 11, 2020",
            "views": "33",
            "upvotes": "0"
        }
    ]
}