{
    "title": "How to make money by making beats - Quora",
    "tags": [
        "How-to Question",
        "Wanting and Making Money",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gino Sorcinelli",
                "href": "/profile/Gino-Sorcinelli-1"
            },
            "answer_text": "To sell beats, most producers use a heavy social media presence. They also share/give away knowledge/tips and specifics about their process . If you are at the point where you feel confident selling your work, there are several things you can do. Create a Bandcamp page and upload an album of your work. You can give it away for free, sell it at a specific price, or have people name their price.Create a Instagram account and post pictures of your gear, records, work area, etc. Post video snippets of you working on beats or samples of your beats. Have a link in the bio to your most recent Bandcamp/iTunes album or a place where people can purchase tracks from you.Create a Soundcloud  page and post snippets or full versions of your best work.If you are confident enough in your technical skills, many producers create drum and sample packs. Some give them away and some sell them. This is another way to expand your audience and gain exposure. Post videos on YouTube explaining how to do a specific aspect of production. While you may not make any money from this, it will help you grow your audience and get more views, which can translate to money down the road. DJ Pain 1  is a great person to study if you choose to take this path. He posts a ton of instructional videos/tutorials. He also posts videos breaking down the music business. Here is a video of him explaining how he made a beat for Lil' Bibby/Kevin Gates. Shoot a video of yourself making a beat in a unique way. Some producers have uploaded videos of them making beats on their iPads in a car. Check the one of Howard B. Knoxz below. Do something crazy or unusual that will grab peoples attention. Then, in the description of the video, link to some of your beats for sale.  Another great example of a musician doing something unique/unusual while making music is Mac Lethal's pancake rap video that helped him get millions of views and new exposure.  Write a review of a DAW or piece of gear that you use. The bottom line is you need to use a variety of platforms to get noticed. It is hard to get people's attention, so you will need to experiment and try a different methods to figure out what works best for you. Also, selling a bunch of beats with little or no recognition will be difficult, so try to give people as many reasons as possible to pay you for your music. Giving them multiple examples of quality music will help you do this. ",
            "date": "Answered March 16, 2016",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "King Pride",
                    "user_href": "/profile/King-Pride"
                },
                {
                    "user_id": "Pedro Chamorra",
                    "user_href": "/profile/Pedro-Chamorra"
                },
                {
                    "user_id": "Bryan Rossnagel",
                    "user_href": "/profile/Bryan-Rossnagel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Porter Olson",
                "href": "/profile/Porter-Olson-1"
            },
            "answer_text": "If you’re feeling like a nice person and feeling appreciative about this long answer and all this research I did and how I took time out of my english class to write this. You should follow me on soundcloud Porter Olson. It would be greatly appreciated. Sorry this is a long answer… I answer two different questions kinda How to get your music on Spotify and apple music and stuff: Well, I got you bro. So I was wonderin the same thing. So I am very new to making music and was uploadin on soundclound. I had a friend tell me that I should put my music on spotify. So I looked into it, To get on spotify you need to go through a record label, or 3rd party like cdbaby or routenote. So I was doing my research and most 3rd party labels to get your music on spotify and all other stores you need to pay like 40 Dollars per single and then you keep the rest of the money you make by plays. And me being a poor boi was like nah, I dont wanna do that, so I kept doing more research and found this great 3rd party label, routenote, they don’t charge a fee for uploadin your music onto spotify. But instead of charging a flat fee, they just take 15% of the money you make. If your like me and you don’t except to make more than a dime, this is the way to go. The website to get your music on spotify and stuff is https://routenote.com/. How to make money off your music on spotify and stuff: So now that you have your music on spotify and apple music and all that good stuff, how do you make money. The simple way is by people listening to your music because you own the royalties on it. So I have been using routenote for about 2 months now I have made a whopping total of 5 cents in one month. So basically you just wait for people to listen to your music, and if you get any money off of it, it will show up later(about 3 months). So once all of this good stuff happens you get money. ",
            "date": "Answered May 3, 2019",
            "views": "254",
            "upvotes": "0"
        }
    ]
}