{
    "title": "How to say thank you in Punjabi - Quora",
    "tags": [
        "Punjabi (language)",
        "Gratitude",
        "Punjabi Ethnicity and People",
        "Manners and Etiquette"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parminder Singh",
                "href": "/profile/Parminder-Singh-81"
            },
            "answer_text": "‘Thanks’ can be translated into Punjabi in various ways. Punjabi has words inherited from various languages. Dhannvaad is the Sanskritized Punjabi translation of the word and is close to Sanskrit word Dhanyavaad. This is a formal gesture of thanking. Saying Shukriya is another way of paying our gratitude. The word has roots in the Persian Shukar and is a refined way of thanking. Poets from stage will say Shukriya to thank the audience. Another way of thanking is by saying Meharbani. The word has again Persian-Urdu origins and is spoken by commoners more than the above two variants. ",
            "date": "Answered January 23, 2018",
            "views": "417",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jee Jaty",
                    "user_href": "/profile/Jee-Jaty"
                },
                {
                    "user_id": "Zahid Aslam",
                    "user_href": "/profile/Zahid-Aslam-34"
                },
                {
                    "user_id": "Beena Khan",
                    "user_href": "/profile/Beena-Khan-10"
                },
                {
                    "user_id": "Yadwinder Gill",
                    "user_href": "/profile/Yadwinder-Gill-5"
                },
                {
                    "user_id": "Punjabi Pandhi",
                    "user_href": "/profile/Punjabi-Pandhi"
                },
                {
                    "user_id": "Hamza",
                    "user_href": "/profile/Hamza-198"
                },
                {
                    "user_id": "Aishwarya",
                    "user_href": "/profile/Aishwarya-846"
                },
                {
                    "user_id": "Mayukha Vallabhaneni",
                    "user_href": "/profile/Mayukha-Vallabhaneni"
                },
                {
                    "user_id": "Akanksha",
                    "user_href": "/profile/Akanksha-552"
                },
                {
                    "user_id": "Reshpal Bilkhu",
                    "user_href": "/profile/Reshpal-Bilkhu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Arora",
                "href": "/profile/Sam-Arora-19"
            },
            "answer_text": "Punjabi people are very innovative in developing their language, be it Punjab/Pakistan or Punjab/India. First I like to share a joke: There was a world competition of languages, which language is very concise and to the point. The test question was: How would you say/ask before coming into the room? First comes an English man: May I come in, Sir. Then comes an Indian from pure Hindi speaking belt: Kripiya ma Bhiter Aa Sakta hu? Now comes Punjabi: Varhha, Punjabi wins the competition. Therefore Punjabi in rural Punjab is different from the urban Punjabi. And we have invented a lot of our own words and vocabulary. When we Punjabi are drunk, we speak English, therefore, Thank you will be acceptable.When we have a bit too much, then, Okay Okay Okay will be fine.When we cannot walk home, then, we say: You alright, I alright.Well, jokes aside, other authors have given very good answers. I like to add one more if you like: To express sometimes, someone will say: Rab, tuhano, bohut deve. Translates: May God gives you plenty. ( I say this, to express my internal thanks). ",
            "date": "Answered April 26, 2020",
            "views": "46",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gurjodh Dhillon",
                    "user_href": "/profile/Gurjodh-Dhillon"
                },
                {
                    "user_id": "Manusankar",
                    "user_href": "/profile/Manusankar"
                },
                {
                    "user_id": "Lam Yau-king (林友敬)",
                    "user_href": "/profile/Lam-Yau-king-林友敬"
                }
            ]
        }
    ]
}