{
    "title": "How would you rate Stray kids, BTS and EXO in terms of rap, dancing, visuals, and vocals? - Quora",
    "tags": [
        "Stray Kids",
        "EXO (K-pop group)",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Jones",
                "href": "/profile/Elizabeth-Jones-1252"
            },
            "answer_text": "This is purely my opinion!! When I’m doing it member by member I’m only going to do my top 10 if that makes sense. RAP It automatically comes down to BTS or Stray Kids. I’m going to go with BTS though for a couple of reasons. You have to include the entire rap line when taking this into consideration. I’m aware the entire BTS rap line, Jisung and Changbin all write lyrics. Felix and Hyunjin do not though. Not writing lyrics doesn’t make you any less of a rapper but writing your own lyrics just goes to show how much more advanced someone is (People used to consider rappers who did write their own lyrics as true rappers) Felix and Hyunjin are amazing rappers and could definitely be Main rappers in another group but they aren’t as good as BTS’s rap line in my personal opinion. Felix relies on his deep voice a lot and Hyunjin is actually really good in every area but I think Jhope, Suga, and RM shine a bit more. Jungkook and V can rap as well. Chan can also rap and Minho can kind of rap. (Edit: Chanyeol is a good rapper! He’s not bad at all but I think he should stay where he is on this placement. He almost always has the same flow and his raps kind of sound similar. It’s fine considering he’s so multitalented though. If you disagree that’s fine but make sure to watch rap videos about the people above him before disagreeing!) Here’s how I would rank them separately. Only official rap line. Changbin/RMJisung/SugaJhopeHyunjinFelixJungkookChanyeolChanVSehunChangbin is a speedy rapper but RM probably has one of the best flows in the industry. This is really hard to be honest. I’d lowkey say they’re on equal footing if I didn’t have to choose one. I think it really comes down to personal preference. Ranking: BTSSTRAY KIDSEXODANCING Stray Kids! If we were only taking the dance lines into consideration then I think it would be BTS or EXO. Taking the entire group into consideration then Stray Kids for sure. Stray Kids come from JYP which is a company known for dancing. Minho is probably my favorite dancer in kpop along with Ten but I promise I’m not being biased. I’m pretty sure their weakest dancer is I.N but he really isn’t that bad. He’s average in my opinion. In EXO, Chen and Chanyeol are the weakest dancers and in BTS the weakest dancers are RM and Jin. Stray Kids also probably have the most difficult choreographies. Separate rankings (from what I’ve seen): Lay/Jhope/Kai (They all have different styles)JiminMinho (I haven’t seen his full capabilities)JungkookHyunjinSehunFelixVChanJisungRanking: STRAY KIDSBTSEXOVISUALS I think they’re all very good looking but if I had to pick it’d be EXO!   The official visual line is below  Since it’s a ranking, here it is (PERSONAL) EXOBTSSTRAY KIDSVOCALS EXO! There was no competition here, sorry! They come from SM and they probably have the best vocals in the industry. Evidence: Chen! Baekhyun! D.O! Suho! Xiumin! Lay! Chanyeol! Sehun! Their rap line can sing. Separate Rankings: ChenBaekhyunD.OSuhoLayChanyeolJungkook/Suengmin (I couldn’t pick ok?)ChanMinhoRanking: EXOSTRAY KIDSBTSAnyways yeah! That’s it. Remember this is all my personal opinion!! The hardest part was definitely the Rap part. I’m pretty sure the “weakest” (he’s still better than most rappers) rapper in Bts is Jhope and I think he’s better than Hyunjin/Felix. That’s how I sort of chose that one. But yeah! Thanks for reading!! ~Liz ",
            "date": "Updated October 16, 2020",
            "views": "19",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devyani◆●◆Singhᴸ",
                    "user_href": "/profile/Devyani-Singhᴸ"
                },
                {
                    "user_id": "Khushi Wewhare",
                    "user_href": "/profile/Khushi-Wewhare"
                },
                {
                    "user_id": "Noa Driel",
                    "user_href": "/profile/Noa-Driel"
                },
                {
                    "user_id": "Nata",
                    "user_href": "/profile/Nata-108"
                },
                {
                    "user_id": "Jazzy Smith",
                    "user_href": "/profile/Jazzy-Smith-56"
                },
                {
                    "user_id": "Jay M. Short",
                    "user_href": "/profile/Jay-M-Short"
                },
                {
                    "user_id": "Ma. Tezza Keizel Futalan",
                    "user_href": "/profile/Ma-Tezza-Keizel-Futalan"
                },
                {
                    "user_id": "Winter Tae",
                    "user_href": "/profile/Winter-Tae-1"
                },
                {
                    "user_id": "Esrat Jahan Akhi",
                    "user_href": "/profile/Esrat-Jahan-Akhi"
                },
                {
                    "user_id": "Amrita Sen",
                    "user_href": "/profile/Amrita-Sen-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "India Copeland",
                "href": "/profile/India-Copeland-3"
            },
            "answer_text": "Disclaimer: This is my opinion!!! Rap: Overall, BTS hands down I mean you have NamJoon, Yoongi, and Ho-Seok. Don’t get me wrong, Jisung, Changbin, and Hyunjin of Stray Kids are also impeccable when it comes to rap but I mean in my opinion they are more like idol rappers and BTS’s rap line are more like actual rappers. Sorry, if anyone’s feelings were hurt on this one but BTS wins this one.  Dancing: Now this is a hard one because you have Jimin and Ho-Seok from BTS, Kai and LAY from EXO…… I think I’m going to give this one to Stray Kids because in my opinion, they dance the best as a group. BTS and EXO didn’t win this category only because some of their members dance better individually and not as good as stray kids when it comes to the cohesiveness that it takes to dance as a group. I’m not saying that EXO and BTS are bad it’s just I prefer Stray Kids when it comes to the dancing.  Visuals: This is a little hard but in my opinion the most visually appealing group would have to be EXO. I mean just look at them    I mean don’t get me wrong Stray Kids and BTS also have some visually stunning group members but I think EXO takes this one as a whole. Vocals: You already know who bout to win this one. Yes junkook and jimin are good vocalist and Chan and Seungmin are also talented vocalist, but nobody and I mean nobody can battle the real Kings of Vocals. EXO hands down wins this round and it really isn’t up for discussion either. You would literally have to be deaf to say that BTS or Stray Kids have better vocalist………I’m kidding but nonetheless EXO wins this round.   ",
            "date": "Answered September 23, 2020",
            "views": "73",
            "upvotes": " View 156 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cherry Blossom",
                    "user_href": "/profile/Cherry-Blossom-638"
                },
                {
                    "user_id": "Suparna Mukherjee",
                    "user_href": "/profile/Suparna-Mukherjee-38"
                },
                {
                    "user_id": "Desrina Waruwu",
                    "user_href": "/profile/Desrina-Waruwu"
                },
                {
                    "user_id": "Candela Karlsson",
                    "user_href": "/profile/Candela-Karlsson"
                },
                {
                    "user_id": "Lia Lee",
                    "user_href": "/profile/Lia-Lee-90"
                },
                {
                    "user_id": "Jazzy Smith",
                    "user_href": "/profile/Jazzy-Smith-56"
                },
                {
                    "user_id": "Autumn Her",
                    "user_href": "/profile/Autumn-Her-1"
                },
                {
                    "user_id": "Aliya Washington",
                    "user_href": "/profile/Aliya-Washington-5"
                },
                {
                    "user_id": "Lia Perez",
                    "user_href": "/profile/Lia-Perez-32"
                },
                {
                    "user_id": "Swapnil Sharma",
                    "user_href": "/profile/Swapnil-Sharma-212"
                }
            ]
        }
    ]
}