{
    "title": "How would you describe your favorite music? - Quora",
    "tags": [
        "Favorite Music",
        "Descriptions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sava Milivojevic",
                "href": "/profile/Sava-Milivojevic"
            },
            "answer_text": "I like when it gives me goosebumps, when it reminds me of something beautiful, when it’s very emotional, motivating, when it’s positive, full of summer vibes. I don’t listen to pop, opera or similar. I listen to hip hop and house. Two totally different genres but I can’t describe how much those two mean to me. Favorite house songs: Alesso - Take My Breath AwayHelvetic Nerds - You & The MusicTruth x Lies - City LightsSyn Cole - Miami 82Avicii - Stay With YouKaskade - A Little MoreKaskade - Summer NightsLana Del Rey - Young & Beautiful (Myon & Shane 54 Remix)DubVision - Turn It AroundMartin Garrix - Waiting For Tomorrow [UNRELEASED]Favorite hip hop songs: The whole J. Cole - 4 Your Eyez Only albumThe whole J. Cole - 2014 Forest Hills Drive albumThe whole Nas - Illmatic albumThe whole DJ Drama - Quality Street Music 2 albumThe whole Lloyd Banks - All Or Nothing: Live It Up album(I usually listen to albums only) ",
            "date": "Answered September 21, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Parker Ferguson",
                "href": "/profile/Parker-Ferguson-6"
            },
            "answer_text": "Generally speaking heavy, loud to some, and unafraid to contain sensitive topics in the lyrics. Favorites are: Ride the Lightning by MetallicaNightmare by Avenged SevenfoldIron Man by Black SabbethThe Dope Show by Marilyn MansonWait and Bleed by SlipknotDown with the Sickness by DisturbedChop Suey by System of a DownKilling in the Name by Rage Against the Machine.And people wonder how I can fall asleep to this. Simple, metal is awesome. ",
            "date": "Answered September 23, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Abraham",
                    "user_href": "/profile/Brian-Abraham-45"
                }
            ]
        }
    ]
}