{
    "title": "How to rap without a beat - Quora",
    "tags": [
        "Rap Music",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mordela Morana",
                "href": "/profile/Mordela-Morana"
            },
            "answer_text": "This is an interesting question, and certainly not one easily answered. The thing about rapping is that it has it is essentially speaking really fast, but with more expression and with rhythm and tempo. The thing that a beat does, is it provides that tempo. The expression, words and rhythm are up to you, but you still need a tempo. My suggestion is to rap with a metronome ticking, try at around 140-160 BPM, and try to keep in time as much as possible. Then, try rapping without the metronome, but using a mental metronome to keep in time. Sooner or later, you'll be in beatless rapping territory. Enjoy. ",
            "date": "Answered May 6, 2016",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David DePriest",
                    "user_href": "/profile/David-DePriest"
                },
                {
                    "user_id": "Jenny Ashy",
                    "user_href": "/profile/Jenny-Ashy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Greif",
                "href": "/profile/Michael-Greif-1"
            },
            "answer_text": "You have to follow your inner beat to wrap your way of rapping around. You have to be content of the flow of your spiritual being to make the rap flow along your intentions. And finally people have to realize your inner self in your lyrical content. That is why most rappers of today are neither heart felt nor serious into Hip Hop. It can be difficult at first but once you know yourself better you may do it with ease. ",
            "date": "Answered May 8, 2016",
            "views": "854",
            "upvotes": "0"
        }
    ]
}