{
    "title": "How do guys and girls make the first move? - Quora",
    "tags": [
        "First Move",
        "Using Psychology in Relationships",
        "Relationships and Dating of Young People",
        "Love",
        "Relationship Advice",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenny Jones",
                "href": "/profile/Kenny-Jones-261"
            },
            "answer_text": "Here is how it usually goes. Assuming the boy has some confidence: He says hi to the girl he likes. And tries to be more present to her at school.He asks for her number which she usually gives ( this is about high school).He tries to appear cool to draw her attention.Now, let’s talk about how the girl does it. She sends a friend to test the guy she likes. The message is usually designed as a hint or a test. For example: her friend goes up to John and asks him what he thinks of Angela.She smiles at him often.She does little cute things for him, like tie his shoeless.Adult men He greets the young lady with a smile and asks about her day.He appears in her view often so she gets comfortable with who he is. This usually takes weeks to a month.He convinces her to give him his number.Adult women. She talks to him a lot and asks about his day.She touches his shoulder or arms from time to time, all the while acting innocent as if she’s not aware.She asks him for personal advice.Old man He tells the lady about stuff he enjoyed in 1958He shows her his bald spot and tells her he invented Reese’s.He expresses his love for woman’s rights and refers himself as a feminist.Old lady She tells him she feels like she’s 16 again.She tells him she wants someone to save her like the titanic.She shows him she still can dance.",
            "date": "Answered August 31, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Young",
                "href": "/profile/Patrick-Young-145"
            },
            "answer_text": "I presume you mean first physical move. That being said, I have rarely encountered a woman under the age of 35 making the first move. When they do, it’s usually unmistakable although chances are she’s been sending out ‘signals’ that I wasn’t able to read, so she just got frustrated and went for it herself. (When women get older, they’re much less inclined to play games.) When I was a young teen, I’d do things like if I was sitting with a girl, I’d ask a girl if I could see her ring. She’d hold out her hand. I’d then take her hand, look at the ring, and then I just wouldn’t let go. If we were parked in a car or at the movie theater, I’d stretch out both arms and yawn. When I brought my arms back down, I’d just put one around her. In my 20s/early 30s, I was a lot more confident and when the moment was right (usually a pause in the conversation) I’d just reach in and go for a kiss. Once in a while I’d misread the situation and she’d pull back, but most of the time she didn’t and kissed me back. By my late 30s and beyond, I was married. No first moves at all. ",
            "date": "Answered September 3, 2020",
            "views": "84",
            "upvotes": "0"
        }
    ]
}