{
    "title": "How does music come out of a vinyl record? - Quora",
    "tags": [
        "Audio and Acoustical Engineering",
        "Vinyl",
        "Vinyl Records",
        "Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Graham Cox",
                "href": "/profile/Graham-Cox-18"
            },
            "answer_text": "This is what the surface of a record looks like really close up, with the needle in the groove:  All those little undulations in the walls of the ‘valley’ are the imprint of the sound signal. The needle follows all the undulations and this tiny movement causes a small magnet to move between the ends of some coils. The coils create a tiny voltage in sympathy with the vibration of the magnet.  The voltage is amplified and equalised (the frequencies are balanced) and that drives the speakers to reproduce the sound. You may notice that each wall of the ‘valley’ has a slightly different pattern of undulations. Those are the left and right channels of the stereo signal encoded separately into the left and right walls of the groove. The arrangement of the coils in the cartridge keeps these signals reasonably separated, so they can be amplified by a stereo amplifier. ",
            "date": "Answered February 6, 2017",
            "views": "735",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "VE",
                    "user_href": "/profile/VE-41"
                },
                {
                    "user_id": "Neeraj Mathur",
                    "user_href": "/profile/Neeraj-Mathur-13"
                },
                {
                    "user_id": "Graham Orchard",
                    "user_href": "/profile/Graham-Orchard-1"
                },
                {
                    "user_id": "Wayne Chesser",
                    "user_href": "/profile/Wayne-Chesser"
                },
                {
                    "user_id": "Carl Lambie",
                    "user_href": "/profile/Carl-Lambie"
                },
                {
                    "user_id": "Steven Merz",
                    "user_href": "/profile/Steven-Merz"
                },
                {
                    "user_id": "Ivey Fidelibus",
                    "user_href": "/profile/Ivey-Fidelibus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Takahashi Obed",
                "href": "/profile/Takahashi-Obed"
            },
            "answer_text": "The record surface is actually one continuous spiral line from the edge to the middle. The line's cross section is shaped like a vee - the valley formed by the sides of two mountains. This surface is rough. The needle shakes as the record spins. This shaking is connected to two magnets which produce electricity. The rough surface is encoded with the music. ",
            "date": "Answered April 23, 2020",
            "views": "291",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Lanzi",
                    "user_href": "/profile/Steve-Lanzi"
                },
                {
                    "user_id": "Bill Hall",
                    "user_href": "/profile/Bill-Hall-23"
                }
            ]
        }
    ]
}