{
    "title": "How can a band start a song live on a computer but have perfect timing with the backing track? - Quora",
    "tags": [
        "Live Music",
        "Bands (music)",
        "Songs",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rocci Disopa",
                "href": "/profile/Rocci-Disopa"
            },
            "answer_text": "Can you say “Click Track” or Digital Metronome? You need to know the amount of BPM (beats per minute) or speed you are going to write the song in. Are you using a ‘Live’ drummer, or a drum machine? With a Live drummer you can either ‘print’ the click track on an empty track, or have the drummer monitor the ‘clicks’ while you are laying down your basic tracks. Whatever works for your team, but just an FYI, most local Rock drummers don’t have good meter, so ‘forcing’ them to play with a click track is going to do one of two things: either improves it big time, or results in an uninspired performance. So don’t forget, the click track goes on first or concurrently. Once it’s on, you’ll always have that point of reference. Another FYI, if the drummer monitors the click track while recording, he will eventually go off the track and speed up. But if the drum track is good and has “feel”, once the drums are on the tracks you can erase the click track. Good luck. ",
            "date": "Answered September 19, 2018",
            "views": "139",
            "upvotes": " Answer requested by David Gyulai",
            "upvoters": [
                {
                    "user_id": "Rich Coogan",
                    "user_href": "/profile/Rich-Coogan"
                },
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                },
                {
                    "user_id": "Noura Baabbad",
                    "user_href": "/profile/Noura-Baabbad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bennett",
                "href": "/profile/Matthew-Bennett-36"
            },
            "answer_text": "If the band has a live drummer it’s his job to keep the band together with the track. Possibly a click track (metronome) in his ear that’s in sync with the backing track. Then the band needs to play with the drummer. If the drummer is on the track and not live, then it’s easier - the band still needs to listen to the drummer. Having a four count click (at tempo!) before the songs starts will also help everyone stay together. ",
            "date": "Answered September 17, 2018",
            "views": "160",
            "upvotes": " View 3 Upvoters"
        }
    ]
}