{
    "title": "How much of the world's recorded music is in Spotify? - Quora",
    "tags": [
        "Spotify (company)",
        "Independent Music",
        "Streaming Music",
        "Social and Online Music",
        "Spotify (product)",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Piazza",
                "href": "/profile/James-Piazza-2"
            },
            "answer_text": "The vast majority of the world's music is not available in a digital format, CD or otherwise, and an even smaller percentage is available on Spotify. To cite one example - The Library of Congress conducted a study of Paul Mawhinney's archive - the world's largest record collection.  It consists of ~1 million albums and ~1.5 million singles. The LoC found that from 1948-1966 only 17% of his collection had been produced on CD.  That means that 83% of his Archive isn't available at any price anywhere. Additionally, I gave Spotify a try on two different occasions.  For each attempt, I entered the names of several of my favorite artists.  My personal library of ~13,000 albums contained between 60 and 350 albums and singles for each of the artists I submitted to Spotify.  The service returned only a handful of tracks for each.  It quickly became apparent that Spotify is highly limited in their musical selection. ",
            "date": "Answered June 21, 2014",
            "views": "505",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Antal",
                    "user_href": "/profile/Daniel-Antal-2"
                },
                {
                    "user_id": "Nick Moyne",
                    "user_href": "/profile/Nick-Moyne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mircea Dima",
                "href": "/profile/Mircea-Dima"
            },
            "answer_text": "Gracenote Database has about 97 million songs, which is in the low end of the total number of songs including underground or local. Spotify has around 20 million songs, so just based on these numbers you would get about 20% of songs found on Spotify. I'm pretty convinced this is a very big percentage. ",
            "date": "Answered November 2, 2014",
            "views": "508",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jasper Shahn",
                    "user_href": "/profile/Jasper-Shahn-1"
                }
            ]
        }
    ]
}