{
    "title": "How to find the key of a chord progression - Quora",
    "tags": [
        "Chord Progressions",
        "Guitar Chords",
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Smith",
                "href": "/profile/Christopher-Smith-170"
            },
            "answer_text": "This is a bit of a tough question. Some chord progressions are clearly in an obvious key, while others are difficult to work out, or might not be in one key, or just defy conventional analysis. The best way to find the key is to look for cadences. If you are unsure about what a cadence is, you have to not be unsure, because this is an important point. Generally, the melody and the chord progression will cadence in the same place (but not always), so look for a comma or period (implied) in the lyric if there is one. A common cadence is the closed cadence or full cadence (ends on the I chord, which indicates the key) and may be preceded by the V chord (authentic cadence), the IV chord (plagal cadence), or possibly some other chord that leads strongly back to the I chord (could possibly be a modal cadence). You might get to a half-cadence, which ends on the chord BEFORE the I chord would show up. To identify that, you would need to know what kind of cadence it was trying to be if it was closed. There are also deceptive cadences and evaded (or interrupted) cadences, which can obscure a phrase. A lot of pop and rock tunes (not to mention jazz tunes) use chords from parallel modes (like a piece in C major could use a chord from C Mixolydian, or C Aeolian, etc.) or could even modulate in the middle of the phrase. This muddies the waters somewhat. Some looping progressions are hard to pin down, for example “Get Lucky” by Daft Punk and “Sweet Home Alabama” are two that cause a lot of arguments. Then there is the approach taken by a large proportion of composers, which is just write what you like the sound of, and don’t worry too much about the analysis. As a composer and theory teacher myself, I encourage people to try to understand what they are doing, but even I write things sometimes that I can’t analyze, and that’s okay. ",
            "date": "Answered September 10, 2018",
            "views": "279",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Rapaport",
                    "user_href": "/profile/Steve-Rapaport"
                },
                {
                    "user_id": "Jason Weiesnbach",
                    "user_href": "/profile/Jason-Weiesnbach"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ariane Cap",
                "href": "/profile/Ariane-Cap"
            },
            "answer_text": "Great question (important question because then you can communicate clearly with your fellow musicians!) and in 90% of cases a very easy answer: look at the very last chord of the tune - that’s your key. More often than not a tune will “come back home” in the end. Many people think the first chord is the key - not necessarily so. But in the end, when it feels like it is ending here, a resting point, that is your key. The melody note likely returns to the tonic. The chords, likely as well. IOW: your last melody note and your last chord are likely the key the tune is in. There are of course a few exceptions why the “last chord” pr “last melody note” strategy might not work either. For example, there might be a “turn around” in the end (which is used when circling back to the top. Sometimes it is in parentheses in the chart, sometimes not)there might be a surprise chord in the end (ballads do that a lot to create interest and not do the obvious)it is a pop song which contains modal elementsthe chords are such that they never go to the “one” chordthere is a coda that takes the tune somewhere else (again, in order to not do the obvious, this can be very effective, but in this case, check what the “obvious” would have been)there might be a fade out…Other important aspects to keep in mind: Keys may change within a tune a few times,Sometimes the key is not a tonic chord (for example in the case of the blues, where you often have dominant seventh chords taking the function of the tonic)When you look at a chart and see a key signature, don’t automatically assume the key is major. One flat could mean F major or D minor. Check the last chord or the last melody note - if it is an D, D minor is a very safe bet. If it is an F, F major!I write more about this important topic including how to say the key in such a way that there will never be any confusion: What Key is this Piece of Music in? | Ari's Bass Blog Thanks for the A2A! ",
            "date": "Answered September 22, 2018",
            "views": "490",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Triton Sullivan",
                    "user_href": "/profile/Triton-Sullivan"
                },
                {
                    "user_id": "Steve Rapaport",
                    "user_href": "/profile/Steve-Rapaport"
                },
                {
                    "user_id": "Victor Mburu",
                    "user_href": "/profile/Victor-Mburu-5"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Tom Huguelet",
                    "user_href": "/profile/Tom-Huguelet"
                },
                {
                    "user_id": "Paul Newman",
                    "user_href": "/profile/Paul-Newman-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "It used to be that you could listen or look for the final cadence, as pointed out by other answers, but there are quite a lot of songs now which end on something else, and quite a lot of music provided as chord sheets where it’s not clear where the song ends, unless you happen to know. For a short chord progression you can find the tonal centre, but for a whole song, you should be able to work out the key. Often, you want this information when you get a chord sheet, before you’ve actually heard the song. You can generally work it out by the following process for a song, which is made out of multiple chord progressions. Establish the key signature. A song may modulate, and it may contain altered chords, but there will generally be a set of chords which keep returning which fit into a particular key. They will either be from I-ii-iii-IV-V-vi or i-III-iv-V-VI. The song may modulate, and it may contain altered chords, so look for repeating patterns, especially which are present at the start and finish.Establish whether the song is diatonic major, minor, or modal. There is a strong draw in Western music toward the diatonic major, so an obvious giveaway is when what would normally be the tonic chord is missing, or when the focus keeps falling on an unexpected chord. For example, in Sweet Home Alabama, the chords are D-C-G, but the emphasis is on the D, and so we deduce Mixolydian mode of D, rather than diatonic major of G.Account for altered chords and modulations. Do a sanity check by understanding the function of ‘foreign’ chords. For example, the chord progression I-III-vi-IV-II-V contains the foreign chords III instead of iii, and II instead of ii. However, this represents implicit modulation to the relative minor (established by its harmonic minor dominant III) and to the Dominant (established by its dominant, II). This particular chord progression begins in the tonic major, but it is still in the modulation of the Dominant when it finishes. In the context of a whole song, C-E-Am-F-D-G could in fact be a modulation to the sub-dominant which is now returning to the tonic with D-G. In that case, the chords would in fact be IV-VI-ii-VII♭-V-I, not I-III-vi-IV-II-V as first imagined. If you have the sheet music, check the key signature, look through to see what accidentals there are, and figure it out from step 2. ",
            "date": "Answered July 27, 2019",
            "views": "452",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Ezell",
                "href": "/profile/David-Ezell-9"
            },
            "answer_text": "The question is hard to understand. If you mean, how can you find the key to a chord progression, that is a question that can be answered. A normal chord progression usually ends with what a classical musician would call “V-I”. These Roman numerals indicate chords whose roots are 5 notes apart. So if a progression ends with a G chord going to a C chord, the G is the 5th note of the C scale and therefore the V. In Nashville numbers this is called the “5.” If this conclusion to the progression is not there it can be harder to figure out. Sometimes a progression ends with IV-I, but is so there will usually be a V-I before that. ",
            "date": "Answered September 9, 2018",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lee Barry",
                "href": "/profile/Lee-Barry"
            },
            "answer_text": "I have always been able to hear key centers. It is a combination of ear training and understanding of functional harmony. In jazz, a key center can be established by an ending cadence, and less by perception of a key center. What genre are you working with? ",
            "date": "Answered September 16, 2018",
            "views": "30",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bruno Neureiter",
                    "user_href": "/profile/Bruno-Neureiter"
                }
            ]
        }
    ]
}