{
    "title": "How to write melodies - Quora",
    "tags": [
        "Melodies",
        "Songwriting",
        "Music Composition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Abildgaard",
                "href": "/profile/Andrew-Abildgaard"
            },
            "answer_text": "Alright let’s start with the VERY basics, okay? I absolutely demand that you understand though, that these ARE NOT RULES, and are only some ideas on how to begin out of many legitimate techniques. Let’s start with a chord progression method - I think I can safely say MOST songwriters start this way - and for ease of understanding keep it in C Major, you will know how use this in other keys of you’re ready to song write. So in C, using the Nashville numbering system you have available… I ii iii IV V vi viiC dm em F G am Bm (should really be B dim, but don’t worry about this for now) Start with an easy progression (again this is a crutch, break this mold as soon as you can) Let’s go with four bars B1 - I (In this case C) B 2 - Any (Save for the IV or V, we’ll come back to these later) B 3 - Any Bar 4 - IV or V (In this case F or G) SO start with C chord, then pick any chord, for bar 2 or 3 then in bar 4 use F or G.Go ahead and mess with this later. For now, find the notes in each chord and write them out. So for ours I’m choosing a chord progression of C G Am G. C Chord = C, E, G G = G, B, DAm = A, C, E That looks like a lot of the same notes doesn’t it? The fun part about song writing is how to first understand this, then utilize it, then MESS IT UP. A complete beginner would probably sing a melody that pretty much follows the tonic (first not) of each chord. C - G - A So let’s try and be at least a little bit creative. Let’s start with G note from the C chord and sing it into the G. Then Sing a D not which will bleed over and cause some tension on the Am as the 4th. Switch to a C not in the second G which is again the 4th and let it resolve back into C Chords With our Melody C chord G chord Am chord G ChordGGGGGGG->DDDDDD->CCCCCCCCC Sounds about right, right?Now what if I told you, you could sing ANY not you wanted in any order over top of these chords? “He’s a madman!” Try it. C chord G chord Am chord G ChordGGE->GGE-AAA-FFGC Experiment this way until it’s no longer fun. Then either get yourself a book on harmony or start trolling youtube for more complicated stuff. Other easy fun stuff to try. Write the melody this way, THEN change the chordsWrite an entire melody with notes not in the chordsStart on the 4th of whatever chord you begin with (this is my favourite easy trick for a melody that sounds more accomplished)Change the amount of notes sung, and vary the length of them per chordSing a melody you know fits your progression in reverse (if you can get your brain to believe in this enough it’s possible and awesome)Why are you still reading this? Get on your piano/guitar/didgerdoo and WRITE SOMETHING. Welcome to the world of song writing. You’ll never be bored again.With love, Andrew “and the right four chords could make me crywhen I’m with you I feel like I could die and that would be alright” - Third Eye Blind ",
            "date": "Answered December 29, 2018",
            "views": "178",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kadheer Max",
                    "user_href": "/profile/Kadheer-Max-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trudy Newell",
                "href": "/profile/Trudy-Newell"
            },
            "answer_text": "Develop a great repertoire of music. You've already got a head start.. expand it. Simple and repetitive melodies, ostinatos.. coupled with shnappy rhythm and a fair bit of poetic license.. but not something so hooky as to become vague and wash out the meaning or story or main feature of your lyrics. ",
            "date": "Answered January 31, 2017",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Hyman",
                    "user_href": "/profile/Daniel-Hyman-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Pock",
                "href": "/profile/Jack-Pock"
            },
            "answer_text": "Just have a go at putting a bunch of notes together! If you have some sort of chord sequence somewhere… even better! There are an infinite amount of melodies that are yet to be written, and yours will be one of them. All the great composers started somewhere. For some things, you don't even need a melody. Just slap notes together is what I do and eventually you end up with something not half bad. ",
            "date": "Answered January 29, 2017",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tinka Dott",
                "href": "/profile/Tinka-Dott"
            },
            "answer_text": "If a person has a desire to compose a melody, then he, at least, is not indifferent to music and has a certain creative streak. The question is how “at you” is he with musical literacy and whether he has the ability to compose. As the saying goes, \"not the gods burn the pots,\" and it is not necessary to be born Mozart to write your own music. ",
            "date": "Answered April 8, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Friedemann Findeisen",
                "href": "/profile/Friedemann-Findeisen"
            },
            "answer_text": "This video should help you out:  Let me know if you have any questions, I’'d be happy to answer them. ",
            "date": "Answered January 25, 2017",
            "views": "716",
            "upvotes": "0"
        }
    ]
}