{
    "title": "How many songs did Eminem make? - Quora",
    "tags": [
        "Eminem (musician)",
        "Rap Music",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew J Wooster",
                "href": "/profile/Andrew-J-Wooster"
            },
            "answer_text": "To further drill down on the answer provided by Jordan McBride, Jordan McBride's answer to How many songs did Eminem make? And Lucas Martin Lucas Martins's answer to How many songs did Eminem make? Not only does Eminem and in fact most rappers (see footnote 1) write all their own songs, but there are more albums to ad to the list. Eminem released the Slim Shady EP without a record deal as well as a full length album titled Infinite. He also released an EP as a duo with Royce Da 5’9 under the moniker “Bad Meets Evil” and then later a full length album, called Bad Meets Evil: The Sequel. Eminem fronted the rap group “D12” and released another two label backed major release albums. That’s all I can think of, that was missing from the previous posts in terms of officially released songs. There are however some awesome “unreleased” (meaning the songs were never made commercially available) songs written by Eminem they are easy to find on YouTube and off the top of my head would probably increase his total number of released songs by about eight or so. (If you would like some of the titles so you can look them up let me know) I’m not going to bother to do the math on everything mentioned above for one reason, we’ll never really know how many songs Eminem has written because for everything that we can tally up there would be 100 songs in a notebook or trashcan somewhere that will never see the light of day. Eminem is a prolific lyricist I encourage you to delve deep into his catalog and enjoy everything it has to offer it has to offer. FOOTNOTE It’s a big deal in hip-hop that all (most) rappers write their own lyrics. With other genres of music It’s far more common for someone else to write a song and sell it to another artist to perform. Since the entire point of hip-hop is not so much the music but the message or at least at its roots that’s what it was there’s a different mindset when it comes to the lyrics of the songs.",
            "date": "Answered January 26, 2018",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Realis Schaffer",
                    "user_href": "/profile/Realis-Schaffer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Howe",
                "href": "/profile/Ian-Howe-8"
            },
            "answer_text": "As of September 8, 2018, Eminem had 344 songs, according to Ethan James's answer to How many songs did Eminem make?. Since then, Em has released “Music To Be Murdered By”, “Homicide”, “Remember the Name”, and “The Adventures of Moon Man & Slim Shady”- not in this order, so don’t attack me in the comments; this is just the order I just remembered them in. If Eminem had 344 songs in September 2018, the rap god has three more songs now because of “Homicide”, “Remember the Name”, and “The Adventures of Moon Man & Shady” being single. That’s 347. Now, “Music to be Murdered By”, possibly Eminem’s biggest release since 2018’s “Kamikaze”, was released. The album, which was based off of Alfred Hitchcock’s 1958 eponymous album, has 20 songs. Premonition - IntroUnaccommodatingYou Gon’ LearnAlfred - InterludeThose Kinda NightsIn Too DeepGodzillaDarknessLeaving HeavenYah YahStepdad - IntroStepdadMarshNever Love AgainLittle EngineLock It UpFarewellNo RegretsI WillAlfred - Outro [math]347 + 20 = 367[/math] As of 20 October, 2020, Eminem has released 367 songs. ",
            "date": "Answered October 20, 2020",
            "views": "830",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alyssa Chatley",
                    "user_href": "/profile/Alyssa-Chatley"
                },
                {
                    "user_id": "Alexis Burke",
                    "user_href": "/profile/Alexis-Burke-52"
                },
                {
                    "user_id": "Ethan Higgins",
                    "user_href": "/profile/Ethan-Higgins-32"
                },
                {
                    "user_id": "Izzy Lynn",
                    "user_href": "/profile/Izzy-Lynn-11"
                },
                {
                    "user_id": "Ezra Fabrick",
                    "user_href": "/profile/Ezra-Fabrick-6"
                },
                {
                    "user_id": "Elijah Krause",
                    "user_href": "/profile/Elijah-Krause"
                },
                {
                    "user_id": "Robbie Yates",
                    "user_href": "/profile/Robbie-Yates-9"
                },
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                },
                {
                    "user_id": "Kristen Griessmann",
                    "user_href": "/profile/Kristen-Griessmann"
                },
                {
                    "user_id": "Jamie Chase",
                    "user_href": "/profile/Jamie-Chase-17"
                }
            ]
        }
    ]
}