{
    "title": "How much do radio stations pay for the music they play, and where do they get the music? - Quora",
    "tags": [
        "Public Radio",
        "FM Radio",
        "Internet Radio",
        "Streaming Music",
        "Radio Stations",
        "Radio",
        "Music Industry",
        "Songs",
        "Salaries and Wages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Driscoll",
                "href": "/profile/Steven-Driscoll-9"
            },
            "answer_text": "Radio Stations do not pay for music. We consider it advertising. How they get their music depends on the association they are with. Some stations get their play list from the parent company. Some still have the wall of LP’s and the DJ make all the choices. (this is becoming rare) Some up-and-coming artists do interviews at stations to get their songs played. Most of the time it is a major label like Sony that says what can and cannot be played from their music catalog. It is a mess. Most stations get the music digitally and setup play lists on a computer in studio. You can check with a station and see if they accept material directly from bands. If they do get them that CD. Hope it helps Steve ",
            "date": "Answered February 25, 2020",
            "views": "64",
            "upvotes": " Answer requested by Logan Moore"
        },
        {
            "author_info": {
                "name": "Peter Naughton",
                "href": "/profile/Peter-Naughton-5"
            },
            "answer_text": "How much do radio stations pay for the music they play, and where do they get the music? Radio stations don’t usually “buy” music, as it’s provided for free from the various record labels. However, they do have to pay royalties to ASCAP and BMI, and perhaps other organizations. The amount paid in royalties depends mostly on the potential audience size — a station in New York City or Los Angeles is going to be paying ASCAP and BMI much more than a station in, say, Pocatello, Idaho or Juneau, Alaska. In some cases — such as a station launching a new format that might not be entirely comprised of “new” music — a station might purchase a “library” of music to get things started. But now that so many radio stations are corporately-owned, chances are pretty good that they already have every song they would ever possibly need, somewhere within the corporation, and can simply transfer the files within their internal networks. ",
            "date": "Answered February 26, 2020",
            "views": "107",
            "upvotes": " Answer requested by Logan Moore"
        }
    ]
}