{
    "title": "How are all radio broadcasts the same volume? What prevents having to turn volume up and down when you go from channel to channel? - Quora",
    "tags": [
        "FM Radio",
        "Broadcast Media",
        "Volume (mathematics)",
        "Radio Stations",
        "Radio"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Richards",
                "href": "/profile/Mike-Richards-187"
            },
            "answer_text": "It should be the fact they they all adhere to the 0dB standard and on a digital system this will be the same across all stations. However, it is not actually true with FM as the power of the station and its distance from you will also come into play. Then you have the situation where the Ads are all at a higher level than the programme. It could be that they use a different “standard” or are deliberately suppressing the level of the tone in their technical 10 seconds prior to the ad itself so that the ad is then played out at a slightly higher level. (As if anyone would ever do that ☺) Sliding off piste a little, TV is even worse for this.Watching a film on TV and having to turn the volume up by 25% to maintain the sound and then dropping it by 50% when the announcer / ads come on in the breaks!You’d think that they would possibly have at least a semi-competent (possibly even conscious) sound engineer monitoring the output and doing the necessary with the master levels. But perhaps the whole thing is run by a pre-programmed 24 hour computer system and there’s not actually anyone left in the building apart from one person on continuity and a single security guard on the main door! ",
            "date": "Answered January 8, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kevin McCarthy",
                    "user_href": "/profile/Kevin-McCarthy-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Lawson",
                "href": "/profile/Robert-Lawson-80"
            },
            "answer_text": "I don’t find that to be true of ether radio (FM) or television, or when switching from watching television to listening to a radio programme via a digital television receiver. The radio broadcast is always louder. ",
            "date": "Answered January 8, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}