{
    "title": "How to make the ukulele sound lonely - Quora",
    "tags": [
        "Ukuleles",
        "Loneliness",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Boucher",
                "href": "/profile/Ted-Boucher"
            },
            "answer_text": "It’s not the instrument, it’s not the chord progression, or even the song. It’s the way you play it. You can make a sad song funny, or a funny song sad. After you’ve learned your material, you have to reach inside yourself and find the right feelings, then you have to show them in a way that brings them out in your audience. I can’t really tell you how to this, except to say that it helps a lot to listen to other performers who do it well. Some people will tell you Ukulele is a happy instrument, and a lot of times, it can be. But they forget about Iz.  ",
            "date": "Answered May 21, 2018",
            "views": "295",
            "upvotes": " Answer requested by Trisha Denise Cedeño",
            "upvoters": [
                {
                    "user_id": "Ryan Po",
                    "user_href": "/profile/Ryan-Po"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pj Dm",
                "href": "/profile/Pj-Dm"
            },
            "answer_text": "Hello... Thanks for the A2A... I'm not a pro, i'll just share my thoughts on this, no fancy music theories hehehe.... For me it depends on the style how you play the ukulele. Play a song with smooth slow strums and plucks in minor key and you get a sad song. Sad songs are usually in minor keys. But i've listened to a lot of covers songs that are originally upbeat and in major keys turned into sad sounding songs by just simply playing it slowly. So i must say that playing style is really a big factor. Just to share an experience, I was just noodling on the ukulele when i accidentally mashed some songs up... The first song was stay with me by sam smith played with Em C G, then went to hello by adele Em C G D and last is coldplay's the scientist Em C G Gsus2 on verse then C G Gsus2 on refrain and add D at the end of refrain. I played it with slow strums and plucks. I felt the loneliness doing that because of the lyrics. I hope you like what i shared and try it as well... Cheer up (just in case you are feeling lonely that's why you asked this question) and enjoy playing the ukulele. The ukulele is known for its happy sound. Have a great day! =p ",
            "date": "Answered May 16, 2018",
            "views": "553",
            "upvotes": " View 1 Upvoter "
        }
    ]
}