{
    "title": "How to remove tuning pegs from an acoustic guitar - Quora",
    "tags": [
        "Acoustic Guitars",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Scratchley",
                "href": "/profile/Glen-Scratchley"
            },
            "answer_text": "This is one of those questions where I have to assume there is something more to the question than it appears. I have changed tuning pegs on two of my guitars. In one case, I was replacing the machines that came with the instrument to new ones of a different manufacture. In that case, I had to (very carefully) make the holes larger because the ‘bolt’ part was larger diameter than the originals. Each machine is actually threaded and is held on with a nut. The new machines included the nuts. In the other case, the guitar has a slotted head, and I replaced the six individual machines (three on each side) with a style that has three machines in one bracket, one set on each side. In that case, the new machines were from the company that made the guitar so the holes fit correctly, but I had to make tiny pilot holes in the new places for the screws that hold on the new brackets. I could have had either operation done by a luthier, but I was careful and able to do them myself ",
            "date": "Answered October 22, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Kuschel",
                "href": "/profile/Richard-Kuschel"
            },
            "answer_text": "Unless you are playing a Flamenco instrument which has violin type tuners, the tuning machines are held in with screws and the better ones may be individual with a single screw and a hollow bolt screwed into the machine head from the top through which the tuning post protrudes. ",
            "date": "Answered October 19, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Grossman",
                    "user_href": "/profile/Joseph-Grossman-7"
                }
            ]
        }
    ]
}