{
    "title": "How to make kpop edits - Quora",
    "tags": [
        "Kpop Edits"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Bendeck",
                "href": "/profile/Emily-Bendeck"
            },
            "answer_text": "Do it online at iPiccy! (edit: I couldn’t add some tips before because I was on mobile, but here they are:) I have no idea how much experience you have with these, but ipiccy is very easy to use and basic.  You want to work with .png pictures always. This is because they allow for transparency, so you can get photos of your idols without the backgrounds, and overlay graphics such as flower crowns or designs over and under without covering others. You can tell if an image you search on google has a transparent background if it is checkered like so: Transparent:  Not Transparent:   If you have a normal image like the last two, whose background you want to erase: Click “upload photo”, upload it and double click it once its done. Then scroll down and start erasing the BG. (You can also do this by applying a Mask in the Layers Tab). When you’re done click the save button and MAKE SURE YOU SAVE IT AS A PNG, NOT A JPG!   When you have all the Transparents you need, you can start layering the on top of each other to make the cool edits you see everywhere.  Select Make a Design. Select the BG color and dimensions of your canvas.  You can now layer your images, vector stickers, text, or make your own vector shapes to layer on top of each other. All your layers are visible in the tab to the left. Be creative! Save when you’re done! Have fun! iPiccy is one of the best free photo editing tools out there, and it’s really fun once you get the hang of it. Don’t be afraid to explore. Here’s a couple edits that I’ve done using iPiccy (Sorry for showing off, but I love sharing them with people, lol):  Source  Source  Source Even more B.A.P edits ",
            "date": "Answered November 12, 2016",
            "views": "48",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ally Ascarruz",
                    "user_href": "/profile/Ally-Ascarruz"
                },
                {
                    "user_id": "Ami Lovelace",
                    "user_href": "/profile/Ami-Lovelace"
                },
                {
                    "user_id": "Kinjal Patel",
                    "user_href": "/profile/Kinjal-Patel-209"
                },
                {
                    "user_id": "Alida Chumappatt",
                    "user_href": "/profile/Alida-Chumappatt"
                },
                {
                    "user_id": "Mariana Ferreira Albuquerque",
                    "user_href": "/profile/Mariana-Ferreira-Albuquerque"
                },
                {
                    "user_id": "Wiam Park",
                    "user_href": "/profile/Wiam-Park"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mariana Ferreira Albuquerque",
                "href": "/profile/Mariana-Ferreira-Albuquerque"
            },
            "answer_text": "That’s because they’re done in a computer. Phones have a quite limited ability to produce edits, and you most likely can’t do that in a cellphone (yet). That edit has probably been done with Photoshop. Photoshop however is a paid software. The free and most similar alternative I can now think of is Pixlr[1]. It’s online. I’ve made several edits using that program, including this:   You also have GIMP[2], which you have to download (also for free). Footnotes[1] Photo editor online - Pixlr.com[2] GIMP",
            "date": "Answered November 12, 2016",
            "views": "32",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Min",
                    "user_href": "/profile/Diana-Min-10"
                },
                {
                    "user_id": "Gabriele Kembuan",
                    "user_href": "/profile/Gabriele-Kembuan"
                },
                {
                    "user_id": "Jasmine Wistaria",
                    "user_href": "/profile/Jasmine-Wistaria"
                },
                {
                    "user_id": "Wiam Park",
                    "user_href": "/profile/Wiam-Park"
                }
            ]
        }
    ]
}