{
    "title": "How to make my vocabulary more influential - Quora",
    "tags": [
        "Influential",
        "English Language Vocabulary Development",
        "Influential People",
        "Vocabulary Development",
        "Influence",
        "Learning English",
        "Vocabulary of the English Language",
        "Linguistics",
        "Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diana Benzo",
                "href": "/profile/Diana-Benzo"
            },
            "answer_text": "Jus try to be more original and authentic when you do speak or write. That is possible only when you employ yourself in some productive action. The language for which you're supposed to build your vocab must decide your choices of novels and podcasts.Movies or even series of that language will help you get better. Try watching with subtitles if you're not familiar with the words.Spend some time on YouTube to watch videos based on that language.Write a dairy elucidating about your daily and personal experiences.Speak with a native but if you can't find one, try speaking to yourself sans halt by setting a timer.Think and process everything in that language.Try learning new words from the dictionary or even play some quizzes related to new words.Keep a notepad for jotting down all the new words you've learnt and try using them in your daily conversation.Hope it helps! ",
            "date": "Answered May 23, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nitin Sharma",
                    "user_href": "/profile/Nitin-Sharma-486"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soumili Bishi",
                "href": "/profile/Soumili-Bishi"
            },
            "answer_text": "When we talk about expanding our vocabulary or making it more influential, the age old techniques go a long way.For example you need to mark the difficult words you come across while reading. Also look up the synonyms and antonyms of these words. Most importantly look up the usage of these synonym and antonyms too so that you understand when a particular synonym should be used. However, I would also like to remind you that it is not at all necessary to go out of the way to use an uncommon word. It is very important that you communicate well with others and for that you seldom need a stellar vocabulary. However, developing a good vocabulary is definitely a worthy use of your time. Hope this helped! ",
            "date": "Answered May 24, 2020",
            "views": "5",
            "upvotes": " Answer requested by Nitin Sharma"
        }
    ]
}