{
    "title": "How intelligent is Lil Wayne? - Quora",
    "tags": [
        "Lil Wayne (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregor Shleruh",
                "href": "/profile/Gregor-Shleruh"
            },
            "answer_text": "Lil' Wayne, in my opinion, is one of the worst rappers of all time! Ok, he sold a million in one week...do I really think he did or do I think he had some help from the label or Baby or he bought that stuff himself? Who knows? BUT I do know there was money to be made after making a song \"A Milli\"...a little fishy...almost like the Patriots winning the Super Bowl the same year 9/11 happened Anyways, catchy songs are fine but when you aren't saying anything, that doesn't give you any type of worth. He is smart in the sense he is cashing in on people's obsession with him, but as far as lyrics go...one of the worst ever. To be honest, most rappers that are coming out (brand new) now a days aren't really saying anything. He does have times where he will rap a pretty decent verse, then he does stupid sh*t...like 85% of the time. He is on a lot of people's songs which I think is a good marketing strategy but I don't want to hear Lil' Wayne all the f'ing time! You have two types of people that listen to rap in today's society...for the most part. 1) The people who listen to this bastardized version of rap/pop music (ex. Lil' Wayne, Soulja Boy, Hurricane Chris) 2) The people who listen to hip-hop/rap music...mostly from the early 90s...listen to a little bit of today's music, but usually the stuff from older artists (ex. Jay Z, Busta Rhymes, Boot Camp, De La Soul, Nas, Krs-One, Redman, Wu-Tang, etc...) I am the second option and usually people that are the 1st one love Lil' Wayne so we just bump heads. I guess it's a sign of changing times but what a sh*tty way for the times to go. If you want to listen to some good rappers, in my opinion, go back to early 90s hip-hop/rap and check out anyone. Almost all the CDs back then were worth buying...even the ones not as popular now (ex. MC Eiht, Geto Boys, Spice 1, Brotha Lynch, etc...) ",
            "date": "Answered November 18, 2016",
            "views": "39",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noel Fourier",
                    "user_href": "/profile/Noel-Fourier"
                },
                {
                    "user_id": "Andrius Sološenko",
                    "user_href": "/profile/Andrius-Sološenko"
                },
                {
                    "user_id": "Frank Johnson",
                    "user_href": "/profile/Frank-Johnson-412"
                },
                {
                    "user_id": "Click Noice",
                    "user_href": "/profile/Click-Noice"
                },
                {
                    "user_id": "Adriel Devanza",
                    "user_href": "/profile/Adriel-Devanza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alasdair Ioan",
                "href": "/profile/Alasdair-Ioan"
            },
            "answer_text": "He is VERY intelligent. And I am not talking about his lyrical content The fact that he has made you ask the question is intelligent. The fact that myself and others have bothered replying to your question about his intelligence makes him intelligent. You know why this makes him intelligent? Because at the end of the day, he wants as many people to be saying his name as possible, because that creates buzz. And you know what buzz creates? More interest in the artist. And you know what more interest in the artist makes? It makes the artist more money Therefore when asking this question, you are also answering it. For the foreseeable future, I will be thinking about what people thought about my Lil Wayne answer. I will be thinking: “Am I wrong?”, I will be going off to check out his songs, to see if I am wrong. I find this song of his, which I really like, great flow, great mix, great lyrics. I really like it! You know what? I might just buy this song… You were probably asking about lyrics. The intelligence of his lyrics is subjective. If you took an Average Joe off the street and gave him some mildly witty play on the words written by Lil Wayne, he might say: “Yeah that’s pretty intelligent”. But if I gave his best lyrics, his best metaphors, and similes and play on words, to a Doctor of English? You think he is gonna be impressed if I tell him that this man is making millions of dollars, more than this Doctor, who has spent nearly a decade of his life, working hard on his subject to the position he is today, If I tell him that this rapper, Lil Wayne, has made more money than his family ever will do by rapping lyrics such as: \"It's like the beat was screaming murder me...And I'm a murderer...So I murdered it\". Is he gonna be impressed? Will he think Lil Wayne’s Lyrics to be intelligent? It’s also hard to tell how many of Lil Wayne's lyrics are actually written by Lil Wayne. He will have loads of Ghostwriters and producers and assistants who will help him to write the best songs that Lil Wayne could possibly rap. Because in the end, all Lil Wayne cares about is money and one of the fundamental points of capitalism, is that the best product sells the most. Simple as that. And considering his sales figures, yeah, you could say he was just slightly intelligent to become a multi-millionaire. ",
            "date": "Answered November 17, 2016",
            "views": "99",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Filip Radojkovic",
                    "user_href": "/profile/Filip-Radojkovic-1"
                },
                {
                    "user_id": "Anthony Veerayen",
                    "user_href": "/profile/Anthony-Veerayen"
                },
                {
                    "user_id": "Akash Ramchand",
                    "user_href": "/profile/Akash-Ramchand"
                },
                {
                    "user_id": "Ashli Nicole",
                    "user_href": "/profile/Ashli-Nicole"
                },
                {
                    "user_id": "Nishant Sharma",
                    "user_href": "/profile/Nishant-Sharma-1437"
                },
                {
                    "user_id": "Andrew Hartley",
                    "user_href": "/profile/Andrew-Hartley-23"
                },
                {
                    "user_id": "Yu Yo",
                    "user_href": "/profile/Yu-Yo-8"
                },
                {
                    "user_id": "Nader Hatter",
                    "user_href": "/profile/Nader-Hatter"
                },
                {
                    "user_id": "Brandon Gaggini",
                    "user_href": "/profile/Brandon-Gaggini"
                },
                {
                    "user_id": "Al Hur",
                    "user_href": "/profile/Al-Hur"
                }
            ]
        }
    ]
}