{
    "title": "How can one convert sorrows to happiness? - Quora",
    "tags": [
        "Sorrow",
        "Religious Conversion",
        "Sources of Happiness",
        "Developing and Maintaining Happiness",
        "Happiness",
        "Emotions",
        "Religion",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Talkings",
                "href": "/profile/Krishna-Talkings"
            },
            "answer_text": "It is important to know what happiness really is .  According to Bhagvat Gita there are three types of happiness Sattwik happiness (Happiness in mode of goodness)  When we try to take the name of God or follow his orders, initially it is full of struggle but when we attach to God then it is like nectar. Sattwik happiness is achieved when we gain Knowledge of the divine. Rajasic happiness (Happiness in mode of passion)  When we attach to material things , initially it gives us pleasure like nectar but end is like poison cuz everything gets separated from us in the end. If you want to get rid of this type of sorrow that arise from Rajasik happiness then stop getting attached to material things slowly and steadily . Tamasic happiness (Happiness in mode of ignorance) “That happiness which both in the beginning and afterwards deludes the self, arising from sleep, indolence, and negligence, is declared to be tamasic” (18:39). Krishna describes tamasic happiness –deluding, addicting, and confusing–arising from sleep, idleness and outright laziness , negligence and confusion .  Krishna says ,“First reach to sattwik guna by keep remembering me and eventually you will cross satvik guna too , just by thinking of me, you will reach transcendental stage which is above three guṇas.” ",
            "date": "Updated October 14, 2020",
            "views": "528",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nandini Singh",
                    "user_href": "/profile/Nandini-Singh-166"
                },
                {
                    "user_id": "Vanshika Sharma",
                    "user_href": "/profile/Vanshika-Sharma-570"
                },
                {
                    "user_id": "Akhil Nair",
                    "user_href": "/profile/Akhil-Nair-51"
                },
                {
                    "user_id": "Vinay Kulkarni",
                    "user_href": "/profile/Vinay-Kulkarni-29"
                },
                {
                    "user_id": "Neelanarayana Moorthi",
                    "user_href": "/profile/Neelanarayana-Moorthi"
                },
                {
                    "user_id": "Anandi",
                    "user_href": "/profile/Anandi-21"
                },
                {
                    "user_id": "Krishna Sakhi",
                    "user_href": "/profile/Krishna-Sakhi-5"
                },
                {
                    "user_id": "Ashirbad Behera",
                    "user_href": "/profile/Ashirbad-Behera-27"
                },
                {
                    "user_id": "Nitish Negi",
                    "user_href": "/profile/Nitish-Negi-34"
                },
                {
                    "user_id": "Krishnasevika",
                    "user_href": "/profile/Krishnasevika"
                },
                {
                    "user_id": "Durga P",
                    "user_href": "/profile/Durga-P-29"
                },
                {
                    "user_id": "Titania Smerald",
                    "user_href": "/profile/Titania-Smerald"
                },
                {
                    "user_id": "Priya Sharma",
                    "user_href": "/profile/Priya-Sharma-1483"
                },
                {
                    "user_id": "Vaishnava Charana Dasa",
                    "user_href": "/profile/Vaishnava-Charana-Dasa"
                },
                {
                    "user_id": "HariDasa",
                    "user_href": "/profile/HariDasa-1"
                },
                {
                    "user_id": "Keshav",
                    "user_href": "/profile/Keshav-319"
                },
                {
                    "user_id": "Chirag",
                    "user_href": "/profile/Chirag-278"
                },
                {
                    "user_id": "Tripti Lakshminarayanan",
                    "user_href": "/profile/Tripti-Lakshminarayanan"
                },
                {
                    "user_id": "Radha Madhav",
                    "user_href": "/profile/Radha-Madhav-46"
                },
                {
                    "user_id": "Akshay Kadam",
                    "user_href": "/profile/Akshay-Kadam-189"
                }
            ]
        },
        {
            "author_info": {
                "name": "AiR Institute of Realization",
                "href": "/profile/AiR-Institute-of-Realization"
            },
            "answer_text": "One can convert sorrows to happiness through the realization of the Truth. When you realize the Truth, that you are the manifestation of the Divine, there is no sorrow. Sorrow disappears, the triple suffering, physical suffering of the body, misery of the mind and agony of the ego, it all just disappears, because you realize that all this is transitory, this is not the reality, the reality is something else. Suffering is the projection, and because we live as the body, as the Mind and Ego, the ME, we suffer. The moment we realize we are not this, we are that, we are the Divine Soul, all suffering is converted to bliss, eternal joy and everlasting peace. But as long as we don't realize the Truth, as long as we aren’t enlightened with the Truth, we will continue to suffer. ",
            "date": "Answered October 14, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Webicoun India",
                "href": "/profile/Webicoun-India"
            },
            "answer_text": "\"Blessed are they that mourn: for they shall be comforted\" (Matt. 5:4). Jesus said the initial step toward happiness is humility-being \"poor in spirit.\"Thus happiness and sorrow go side by side. Success comes to those who put in extra efforts to make their dreams come true. Tragic and happy moments combine together to make human life meaningful. In order to convert sorrow into happiness, few tips can be followed 1)Disappointments Lead to Accomplishment Those who get all the pleasures of life without struggling to remain weak emotionally and weakness leads to failure. Bliss comes who have witnessed failures in life. 2)Accept Failures Billionaires' process for success relies on no great secret or magic. Rather, it relies on their ability and willingness to humbly accept defeat, improve on their weaknesses, and try, try again. 3)Share Your Feelings  By sharing your feelings with your dearest ones, it is so much easier for you to bring it up in the first place. By expressing your feelings, you can make situations better. 4)Be Confident Confidence is one of the best mindtools to overcome any failures. Trust yourself to face any situation in your life and be brave to face any situations in your life. 5)Change your approach There would be some mistakes which would have made you. By avoiding the same mistakes, and creating a solid back-up plan, the mistakes could be rectified! By following these five steps, one can convert sorrow into happiness Don’t forget to upvote! Follow Webicoun India for more directions!. ",
            "date": "Answered October 14, 2020",
            "views": "54",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chetna Sharma",
                    "user_href": "/profile/Chetna-Sharma-706"
                },
                {
                    "user_id": "Tanya Sharma",
                    "user_href": "/profile/Tanya-Sharma-1203"
                },
                {
                    "user_id": "Saksham Kapahi",
                    "user_href": "/profile/Saksham-Kapahi"
                },
                {
                    "user_id": "Arjun Raj",
                    "user_href": "/profile/Arjun-Raj-347"
                },
                {
                    "user_id": "Kenil Donda",
                    "user_href": "/profile/Kenil-Donda"
                },
                {
                    "user_id": "Teena Thakur",
                    "user_href": "/profile/Teena-Thakur-30"
                },
                {
                    "user_id": "Mansi Shah",
                    "user_href": "/profile/Mansi-Shah-437"
                },
                {
                    "user_id": "Harsh Kumar Jangir",
                    "user_href": "/profile/Harsh-Kumar-Jangir"
                },
                {
                    "user_id": "Kiran Shibag",
                    "user_href": "/profile/Kiran-Shibag"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priya",
                "href": "/profile/Priya-3691"
            },
            "answer_text": "To convert sorrows to happiness one must learn to move on with the current situation and be optimistic. Learn to convert threats into opportunities… Thanks If you like my answer then follow me ",
            "date": "Answered October 14, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}