{
    "title": "How much do artists get paid from iTunes or Spotify? - Quora",
    "tags": [
        "Streaming Music",
        "iTunes",
        "Spotify (product)",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mattias Petter Johansson",
                "href": "/profile/Mattias-Petter-Johansson"
            },
            "answer_text": "Note: The text below is excerpts from http://www.spotifyartists.com/spotify-explained/ which is a mini-site that we (Spotify) created to explain how our payouts work. So go there for even more juicy info!    Royalties: in detail Contrary to popular belief, Spotify doesn't pay a fixed price per stream. Instead, it works like this:  1. Spotify Monthly RevenueThe total revenue Spotify makes in a given month from advertising and subscriptions as explained above. This varies from country to country depending on a range of factors including how many users we have in that country, how many of them are premium subscribers and how much advertising we sell in that country. 2. Artist’s Spotify streams divided by total Spotify streamsThis calculates an artist’s popularity on the service, their “market share.” Dividing an artist’s streams by the total streams on Spotify determines the percentage of our total pay-outs that should be paid for that artist’s rights. 3. Royalties paid to master and publishing ownersSpotify negotiates our royalty economics with labels and publishers in each territory where we operate. Our current payment agreements lead us to distribute (~)approximately 70% of our gross revenues to master recording and publishing rights (both mechanical reproduction and performance) holders. The precise division between these types of rights holders varies by territory in accordance with local laws and negotiated agreements. In the United States, for example, statutes dictate that publishers receive ~21% the amount that master recording owners receive. 4. Artist’s royalty rateOnce Spotify has paid a rights owner the total royalties due for their accumulated streams, that label or publisher pays each artist according to that artist’s contractual royalty rates. This will likely also take into account other factors including recoupment status, which is one reason that different artists in different deals might ultimately receive different royalties from their respective labels and publishers. Independent artists can retain up to 100% of their royalty payouts from Spotify by using one of our aggregator partners such as Tunecore (a small fee may apply). Click here for a list of these partners. 5. Artist Pay OutThe end royalty paid out to the artist after the rights holder royalty split and any other deductions have been applied. Specific payment figures How does all of this work out in practice? The chart below shows actual royalty payments for a range of albums for the month of July 2013. We have replaced the names of the artists with descriptions to illustrate their scale.   Spotify relative to other services Spotify is one of the most effective ways to monetize access to music. In addition to encouraging consumers to pay for music again, our rates are higher than many alternative services. The chart below shows the royalties Spotify pay to rights holders for every 1 million listens of an artist’s music:   There is lots more here, if you want to get into it: Spotify Explained. ",
            "date": "Updated December 10, 2013",
            "views": "423",
            "upvotes": " View 280 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manaswi Vartak",
                    "user_href": "/profile/Manaswi-Vartak"
                },
                {
                    "user_id": "Avi Ghanshani",
                    "user_href": "/profile/Avi-Ghanshani"
                },
                {
                    "user_id": "Lily Stomp",
                    "user_href": "/profile/Lily-Stomp"
                },
                {
                    "user_id": "Mark Francis Igancio Laurente",
                    "user_href": "/profile/Mark-Francis-Igancio-Laurente"
                },
                {
                    "user_id": "Nicholas Pysklywec",
                    "user_href": "/profile/Nicholas-Pysklywec"
                },
                {
                    "user_id": "John Alacce",
                    "user_href": "/profile/John-Alacce"
                },
                {
                    "user_id": "Gael Bwelesi",
                    "user_href": "/profile/Gael-Bwelesi-1"
                },
                {
                    "user_id": "Vince Gray",
                    "user_href": "/profile/Vince-Gray-1"
                },
                {
                    "user_id": "Jessica James",
                    "user_href": "/profile/Jessica-James-103"
                },
                {
                    "user_id": "Stevenson Ohene-Gyan Ankomah",
                    "user_href": "/profile/Stevenson-Ohene-Gyan-Ankomah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sophia Cumberbatch",
                "href": "/profile/Sophia-Cumberbatch-1"
            },
            "answer_text": "We know that just like Youtubers, Spotify artists can earn a certain amount through advertising. According to CNBC, artists can expect to earn between $0.006 to $0.0084 per stream to the holder of music rights. However, according to some data from Information is Beautiful, it puts that number even lower at $0.00437 per play. So doing the math, a 1000 streams would translate to roughly $4.37. But not everyone can get paid from Spotify, How can you do that? You could consider some steps here: Get Spotify verification Come up with a new, catchy melody that will stick in people’s heads and start uploading them or an attention-grabbing topic for a podcast. Send your tracks to other popular music blogs too. Not only is it more exposure if they select your music but you might also reach more curators. Create a personal website to brand yourself. Through your website, you can send emails to reach people, so grow your fan mailing list…This will probably turn out to be more fruitful than focussing on social media. We all know easier said than done but no pressure no diamond. I hope you can get paid on Spotify soon ",
            "date": "Answered May 26, 2020",
            "views": "186",
            "upvotes": "0"
        }
    ]
}