{
    "title": "How to put lyrics to music - Quora",
    "tags": [
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Shivdasani",
                "href": "/profile/Ryan-Shivdasani"
            },
            "answer_text": "Both just take getting after it and trying your best for a while.. Sometimes years, even after you can play and understand song structures very well. It took me many years.. and thankfully I had a terrible voice which kept me discarding and reworking and writing new ones again and again for a lot longer than most people do so I developed it a little more before rolling with it, as well as focus heavily on other aspects of it to make up for my lackluster vocals, like the melodies, harmonies, forms, chords, rhythm, musicianship, parts, and arrangements. A lot of really good songwriters- Burt Bacharach, Bob Dylan, Kurt Cobaine, Neil Diamond, Chris Christopherson, and many others- seem to have gone through a similar process (even if from a very young age) But I write songs pretty easily now and have a lot more than what’s on this: CD REVIEW: Act 3 by The Merrymaker’s Orchestrina - And I do know it pretty well at this point. My guess is you should deeply familiarize yourself with a lot of really great music, as well as develop your basic musicianship skills (tonal training and basic theoretical analysis). -Can’t go wrong by getting to know the sixties really well in terms of knowing good songs and good song form. All genres. And you’re better off working up to them from the 40s than venturing beyond into the 80s. 90s-present you should be aware of and find what you like. That is my opinion. You should of course focus on music you like whatever that is, but also be open and experimental and know that as you listen to more your tastes expand. You want to have very broad and good taste. And in terms of skill development: -maybe get an undergrad tonal skills and theory undergrad textbook, and download ear training apps. -and try writing songs as much as you can. Doing it more often is more important than developing a catalogue. You want to experiment and do it almost distantly. Don’t worry about being special or awesome or true to yourself at all. Be shameless. Let it be fun and not a big deal. Just write basic songs and try to make them complete. Doesn’t matter if the lyrics or ideas fit your initial idea or accurately represent you as a person. Just be flexible and adaptive. Don’t listen to the hype, just learn how to write. They will actually end up representing you in ways you didnt realize. Song writing is a process of discovery. Michaelangelo looked at the rocks and chipped away till they were what he felt was there already. He adjusted to them rather than trying to make them fit his vision. ",
            "date": "Answered May 25, 2018",
            "views": "848",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Best-2offers"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Yiyi Chan",
                    "user_href": "/profile/Yiyi-Chan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Fulton",
                "href": "/profile/Emmanuel-Fulton-1"
            },
            "answer_text": "You can collaborate with a another Songwriter such as a Composer that does the music side that will then make it a full song. I acutally have a Song Collaboration Agreement when I collaborate with other Lyricists and Composer's that is by copyright law as “Joint Works”. I compose the insturmental compositions but I don't acutally write the musical score like a Traditional Music Composer as I use midi to compose the notes on a Computer DAW or a Synthesizer Workstation keyboard such as the Motif or Fantom. You can also find some one to license an instrumental Compostion or hire a Record Producer to turn your song concept into reality. You can also learn how to compose your own music as all you need is a midi controller, an Audio interface, a DAW such as Protools, Cubase or Studio One and some soft synths. I would pick up some basic music theory and learn your majors and minors scales. YouTube is your best friend as a resource of online tutorials. ",
            "date": "Answered April 8, 2019",
            "views": "481",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jason Bulsa",
                    "user_href": "/profile/Jason-Bulsa-2"
                }
            ]
        }
    ]
}