{
    "title": "How many octaves should a beginner's piano have? - Quora",
    "tags": [
        "GNU Octave",
        "Piano Lessons",
        "Playing Piano",
        "Piano Music",
        "Music Theory",
        "Learning Piano",
        "Pianos",
        "Learning to Play Musical Instruments",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gatotkaca Pambudi",
                "href": "/profile/Gatotkaca-Pambudi"
            },
            "answer_text": "Depending on your wallet. Can you afford an 88 keys acoustic, like a grand piano or an upright?It would be better but if you aren't planning to be into piano seriously then it's just a waste of money. If you have more money but don’t want to be serious on piano, just buy a digital one with 88 keys. Or you can buy the 62 keys one, most of them have plastic keys without the standard graded hammer, but with the right choice it can be good and useful for music producing, etc. and most of them got some friendly price. But beside of that use, if you want to play some classical music or jazz (the more complex one) than its definitely bad because it would destroy your technique. In conclusion, if you want to be serious at the instrument and you can afford the price, just buy the 88 one, the acoustic is definitely better most of the time but the digital one can be very good (I have one with a price under 1000$ and it comes with some good speakers!). But if you can't afford it, just buy the 62 keys one, learn the basic first and if you're getting good at it you will definitely have to upgrade to a better one with 88 keys. ",
            "date": "Answered January 14, 2020",
            "views": "111",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Fleming",
                    "user_href": "/profile/John-Fleming-86"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristina Anderson",
                "href": "/profile/Cristina-Anderson-25"
            },
            "answer_text": "A standard modern upright, grand or digital piano has seven and a quarter octaves; seven full octaves, and three extra treble notes; B-flat, B and C. There are variations, mainly in digital instruments, which we'll discuss in this article. Look at the number of keys on the keyboard. The more keys, the greater the instrument's range. A 25-key keyboard has only a 2-octave range, while a 49-key keyboard has a range of 4 octaves, a 61-key keyboard has a range of 5, a 76-key keyboard covers 6 octaves, and an 88-key keyboard spans 7. Go to my Profile and you can find all about Learn Piano material there... ",
            "date": "Answered August 28, 2020",
            "views": "53",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shelley Lee",
                    "user_href": "/profile/Shelley-Lee-79"
                },
                {
                    "user_id": "Opal Nelson",
                    "user_href": "/profile/Opal-Nelson"
                }
            ]
        }
    ]
}