{
    "title": "How to make my song sound more realistic and less MIDI-ish on FL Studio - Quora",
    "tags": [
        "Computer Music",
        "Digital Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sameer",
                "href": "/profile/Sameer-465"
            },
            "answer_text": "I can summarize it in just one word “ Automation”  Automation is the key to get the analog sounds from midi synths, now what do you automate? There are many parameters, you can start with pitch modulation. Then explore things like filter modulation and many more, a great thing about FL is that almost everything in it can be automated. So almost all the knobs that you see in a vst in that DAW can be automated to create the rising, evolving, Falling effects of analog sounds. You can create a volume automation to create a crescendo or diminuendo effect. You can sweep cut of filter a bit to get the consordino effect. You can modulate the pitch to do bends. Now as I am talking of bends, you look for the legato/Portamento  knob is the vsts. That is helpful in creating a fluid note transition, legato means tied notes, very helpful in basslines, 808s and almost every monophonic sound. Many VSTs will have some thing called an LFO - low frequency oscillator, which simply an automation but has a cyclic nature.   If you've serum you may have notice these LFOs. Now midi is not jus note on and off. It has 127 other control change parameters which are called the midi CC values. Each CC parameter's value can change from 0 to 127. These CC values can be assigned to any parameter in of a VST and you can draw the values in the piano roll just like you have your velocity plotted on the bottom of piano roll.   Many of the times CC values are preassigned in the VSTs and it can recorded along with the midi, the same way you do it for the note. It can be changed later in the piano roll. To see all the pre assigned CC values. Jus click the arrow on top left corner and click on browse parameters, it will show up all the parameters preassigned and number of other cc parameters. You can right click them and then click edit parameters in piano roll and directly plot your parameters in the piano roll. This is highly useful when you are using sample based instruments. This can be used to cross-fade between different velocity layers, to cross-fade between different dynamics, articulations and many more. Jus look it up YouTube how to do it. Lastly use deeply sampled instrument the one with huge number of Velocity and dynamic layers and articulations or modeled instruments. I know this is not a cheap option but. It is the best way to get close to the real sound. A bonus tip - if you are using a piano don't align the start of every note of the chord to the same line on the grid. Displace the starting position from jus few Mili seconds. But make sure you do in a way that lower notes sound first then higher notes. That is how right works and higher notes first then lower for left hand. That gives the feel of strum too. That replicate the real time behaviour of a piano player. Also don't always put the notes on the grid lines leave few of for humanisation. I don't have to explain to the velocity randomisation. Also there is a randomiser option in the piano roll. Go on and explore more about it jus turn off the pattern mode first. ",
            "date": "Answered August 10, 2020",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Little",
                "href": "/profile/Bob-Little-4"
            },
            "answer_text": "I came across this by accident. In case anyone is interested, you could consider using Garageband - if you have a Mac it comes with the computer. There are programs that work in a similar way for Windows but so far, for the price, Garageband seems to be the best for Programmed Tracks and “live” recorded tracks and one of the easiest Apps to use. A low cost version is also available for the iPad. Garageband has some more realistic sounding samples that you can use with your midi music. I suggest that you pick the ‘Key’ you want to use in a Midi App (like Q-midi or other). Here you select the Key and Tempo before opening it in Garageband. Open a New file in Garageband and pre-select the Tempo and Key for your Song.Count the number of instruments that are in the Midi file of your Song & add the number of tracks in the Song to Garageband (you can relabel each instrument after you import the Midi file).Place the Midi file of your Song on the right side of your screen and adjust the Garageband window so you can see the right side of your screen and your Song.The track at the top of the Garageband window will remain BLANK. The other tracks will match the number of tracks in your Song midi file.Now you just drag the Midi file of your Song ‘Over the Garageband window’ and drop it in the bar that IS TRACK 2 - Release the file. When you release it all of the tracks will automatically populate the tracks you have already opened with the tracks in the Midi file of your Song…….Now you can check each instrument and then pick the Sounds you want to use for each of the tracks of your Song that are now in Garageband. You can pick the best sound for the piano, guitar, etc.All instruments will sound better that those in the Midi player but there are still limits to Midi and the original input will also still be as it was in the Midi file. So if there are some wrong notes, they will just sound better now. The good news is that you can FIX those notes in the Midi format IN Garageband. Even all parts of a drum kit can be adjusted if the timing is off or a ‘beat’ is out of place……Good Luck!",
            "date": "Answered August 8, 2016",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Makenzie Harrison",
                    "user_href": "/profile/Makenzie-Harrison-3"
                }
            ]
        }
    ]
}