{
    "title": "How to prepare myself for when BTS disbands and not get emotional whenever I think about it - Quora",
    "tags": [
        "BTS (K-pop group)",
        "K-Pop",
        "Understanding Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yoon Minji",
                "href": "/profile/Yoon-Minji-3"
            },
            "answer_text": "oh…Well, sorry, but I’m afraid that’s not possible, not feeling emotional about BTS disbandment just NO. But always remember, that every good thing comes to an end ( you got no idea how much i’m internally crying writing thing no joke ). And also, you don’t need to prepare! Knowing BTS, I’m sure, they will make their own SNS accounts, keep streaming live, or at the very least, a YT channel. Whether they start a family or whether they go solo, I only ask you to support every decision they take with a smile. It’ll help them a lot. Even if they disband, I hope you’ll still always be an A.R.M.Y, I’d hate their disbandment to make you forget about their existence and how much they helped you. Girl, I relate. Every second of my life, I ask myself a question. ‘Why tf am I not jumping out of that window? I got no reason to be here!” ( Before you all say “Think about your parents” and shit like that, my mom was the one who was like “Girl, why aren’t you dying? All the nice people in this world are suiciding, when is your turn coming?) but then I remember BTS. I am well aware of the fact that they’ll never be mine but they’ll forever hold a special place in my heart. It’s going to be darn tough to continue living after they disband, but I swear to god, if Serendipity doesn’t play on my wedding, I am going to murder my husband ( who definitely has to wear a Jimin face mask on our wedding lol ) Lots of love <3 [ P.S : Don’t cry!! Any issues DM me priv on sanalytical for instagram ] ",
            "date": "Answered June 25, 2020",
            "views": "169",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cami❁",
                    "user_href": "/profile/Cami-164"
                },
                {
                    "user_id": "Zoey Jones",
                    "user_href": "/profile/Zoey-Jones-68"
                },
                {
                    "user_id": "Amy Mendoza",
                    "user_href": "/profile/Amy-Mendoza-67"
                },
                {
                    "user_id": "Sweet Kookie",
                    "user_href": "/profile/Sweet-Kookie-3"
                },
                {
                    "user_id": "Enejda Qama",
                    "user_href": "/profile/Enejda-Qama-1"
                },
                {
                    "user_id": "Ayanda Ngwenya",
                    "user_href": "/profile/Ayanda-Ngwenya-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Enejda Qama",
                "href": "/profile/Enejda-Qama-1"
            },
            "answer_text": "Well to be honest whatever you do you won't be able to escape from being emotional thinking about BTS disbanding. I'm an only one month ARMY, yet don't know much of them and still can guarantee you this, sorry. Now about preparing: The best thing you can do is to put in action what they teach us. That's the way true love is shown. When you have done it you will feel ready to let them go, eventhough it will hurt. To explain a bit: BTS says in many songs to love yourself, to do what you love and work hard not being obsessed on others (fake love, dope, epiphany, piped paper, etc) these were just a few..basically every song of them spreads this messages. It might sounds heartless but lets try to stop depending on them, little by little every day lets not just watch what they do but put them in action. Don't miss understand me, I'm not telling you to stop following them, supporting and things like that..no way. But why not to give our lives more colors, more meanings, lets live as BTS seems to do, as they make us feel, as they want us to feel. So find yourself, love yourself and then speak yourself Only this way you will live BTS inside of you and they will never go way. Remember they will always be by your side no matter were they are, what they do ..we purple them and they purple us back. Hope I helped a bit. Couldn't write better and longer cause my phone started to slow done due to my endless downloaded BTS stuff >_< 💜 You ",
            "date": "Answered June 25, 2020",
            "views": "45",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michelle Tan",
                    "user_href": "/profile/Michelle-Tan-446"
                },
                {
                    "user_id": "Amy Mendoza",
                    "user_href": "/profile/Amy-Mendoza-67"
                },
                {
                    "user_id": "Sweet Kookie",
                    "user_href": "/profile/Sweet-Kookie-3"
                }
            ]
        }
    ]
}