{
    "title": "How to increase my breathing power while singing - Quora",
    "tags": [
        "Breathing",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaitsiri Mongkolsmai Lin",
                "href": "/profile/Gaitsiri-Mongkolsmai-Lin"
            },
            "answer_text": "Power in singing is a combination of proper breath management, support, and control. What you want is to be able to have efficient use of the breath, free from unnecessary tension in the voice, that is resonant and projects. In terms of volume, it comes from getting more air out. Singing is not about breathing in as deeply as possible, because then the pressure to release that air will be too great for you to control the expulsion of the air while shaping it. With breath management, you do exercises that increase the control over your intercostal muscles that hold your ribcage open, so that you can control the airflow. Proper vocal training is preferred. If you can’t afford it, look for ways to get feedback from trained singers, in the hopes that they can help you pinpoint areas of tension or other things to work on. If you have a teacher, the progression might look something like the following, keeping in mind that working on your singing voice is an investment in ear training and awareness of your body, so that you can help your voice to do what it would do most naturally, had you not become accustomed to doing other things with it: Learn basic breathing for singing. These are low breaths where your shoulders stay down. There are other answers in the Singing FAQ in Quora that have been tagged that I would recommend you read.Learn how to support the breath, and when and how to take breaths when singing, and begin to control the output. Train to sing evenly, with the dynamics completely stable at low volumes. You don’t need to take huge, deep breaths when your singing is efficient. Knowing how to let the air in without sucking it in hard will lead to silent intake so you can get just enough for the next line.Learn how to not impede the breath. This is a big deal in taking singing lessons - tension is common even in trained singers, and it shortens the life of your voice. Tension generally refers to physical, i.e. jaw, tongue, neck, head, posture, etc, but there can also be mental blocks that stop you from learning and progressing. All of these take time, to break poor vocal habits and build muscle memory, as well as developing confidence in your singing capability to be able to release your voice.Learn breath control. In classical training, messa di voce is a technique used to adjust your output to create volume. The volume change comes from increased, efficient airflow. Most untrained singers will “push” and create tension, effectively yelling instead of a safe, resonant volume change. As you learn to let your voice relax, you will be able to feel your singing, and be able to sing by feel rather than listening to yourself.When you’re beginning, you may feel like you don’t have enough air. This is really common. Except for medical conditions, it’s not an issue of lung capacity. It’s really just control of the airflow and other vocal technique. There are so many things that affect the amount of output - things like vowel and consonant choices - varying the voicing, tuning vowels to match the frequency of the pitch to suit your voice, are quite intricate and take time to get the hang of. Regular practice is also required. You are still training muscles, even though you can’t see them easily, and without maintenance, you can lose your vocal technique. If you are training, an appropriate amount of power will come naturally with the ability to produce resonance and place your voice, as well as the occasional safe belting and use of styling to accent your performance. Some voices are also meant to be bigger than others’ due to the size of resonant spaces inside the body. You can’t change your voice type, but you can learn to sing well within the physical limits of your bone structure, vocal tract, and size and length of vocal folds. Instead of wanting more breath power, you need to fine tune the efficiency of what you have, and with time control will increase if you can keep your ribcage open enough that it doesn’t want to collapse and push the air out faster than you want it to, and relaxes faster to let in the air when you are done expelling what you need. In terms of exercise, aerobic fitness is a good thing. You don’t absolutely need it, but it will help with stamina and can increase your efficient lung capacity. ",
            "date": "Updated July 22, 2017",
            "views": "263",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Minyu Yang",
                    "user_href": "/profile/Minyu-Yang-2"
                },
                {
                    "user_id": "Zuhair",
                    "user_href": "/profile/Zuhair-5"
                },
                {
                    "user_id": "Tony Mongkolsmai",
                    "user_href": "/profile/Tony-Mongkolsmai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priya Chander",
                "href": "/profile/Priya-Chander-9"
            },
            "answer_text": "Do a lot of breathing exercises (inhaling and exhaling slowly through your nose).Drink only warm or hot water. Avoid cold items.Stuff your ears with cotton before going to bed so that when you wake up, you don't have any irritation or itch feeling between your ears and throat.Once you wake up in the morning, brush, have a glass of warm water and practise singing songs with dynamics. Singing is best when you are in an empty stomach.Listen to a lot of songs and practise singing along with the singers whose songs you want to sing.Above all this, consistency is extremely important. Keep practising till you get the right voice, note and the pitch.",
            "date": "Answered October 13, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melat Gebru",
                    "user_href": "/profile/Melat-Gebru-1"
                }
            ]
        }
    ]
}