{
    "title": "How would I know if I'm singing from my diaphragm and not my throat? - Quora",
    "tags": [
        "Diaphragm (human body)",
        "Human Throat",
        "Otolaryngology (medical speciality)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "Excellent question because most people, even many trained singers, don’t know. Let's do a few exercises to show you how effortless, natural and efficient breathing from the diaphragm can be. Start by lying on the floor. Bend your knees if you like. Breath naturally. Feel that your breathing comes from the stomach area. That's it. Simple. That’ll be $75. While still on the floor, let's try a few things with your voice. You MUST do these with your “heart and soul.” Like EVERYTHING in life, f you do them halfheartedly, it won’t work. Cough. Notice from where it emanated from. Pretend you are a fire engine making siren sounds and get louder and higher each time you sound the siren. Yell \"HEY\" like you just caught someone stealing. Yell \"Bad\" as if your dog just messed on the floor. Yell \"GIT\" to a cat in your trash. Call for help three times with increasing volume as if no one can hear you. Say \"BOO\" like you are jumping out from behind a door to scare someone. Now, playfully say \"Woof!\" as if you are a puppy trying to entice its owner to play. Now (this is the best one) get on all fours and pant like a dog. Where does it all come from? Of course, your diaphragm. Why? Because it is real. Do you see how easy and effortless all that was? The challenge now is to stand up and continue to breath that way after years of training your body to accept ignorance, misuse and abuse as normal. Your singing must be real. Are you singing from “heart and soul” or just singing? While you are still on the floor, try not to breath from the stomach and only breath from the upper chest. After five minutes of breathing properly and effortlessly, can you now feel how wrong it is to breath from the chest and shoulders? Proper movement always makes improper movement to feel bad, like it really is. A lot of singers get caught up with trying to sound perfect rather than making music. They become self conscious and back off. Any time you don’t give 100% of your “heart and soul” you risk backing off which leaves an artistic void. That is the secret to being the best you you can be: If you allow insecurity into your craft, you back off and that allows mediocrity to creep in, then you do it halfheartedly and it won’t work. That’ll be $100. If you find that you are running out of breath at times, that is because you are not using all the air that is already in your lungs, or, you are not breathing from the diaphragm. When you breath from the chest, you only use a quarter of your air, your feel like you are running out of air so you gasp for another breath but your lungs are already full. It is like trying to force water into a gallon jug when it is already full. Most artistic failings are the result of humans being self conscious, relying on too much training, 300 years of errant pedagogy or not having anything to SING about. Have you ever sung HAPPY BIRTHDAY full throated and lustily at a birthday party without fear or inhibition? Would you sing it as well if you performed it on a stage? Probably not. That is because on the stage you turn of being “real” and then rely on training which is hampered by self consciousness. That’ll be $2.25 (I need coffee). Just sing, sing a song, sing it loud, sing it strong . . .  ",
            "date": "Answered March 21, 2018",
            "views": "14",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tinay Lanchanco",
                    "user_href": "/profile/Tinay-Lanchanco"
                },
                {
                    "user_id": "Danny Tad",
                    "user_href": "/profile/Danny-Tad"
                },
                {
                    "user_id": "Sophia Marie Herrick Scott",
                    "user_href": "/profile/Sophia-Marie-Herrick-Scott"
                },
                {
                    "user_id": "Omari Harebin",
                    "user_href": "/profile/Omari-Harebin"
                },
                {
                    "user_id": "Niko Ochoa",
                    "user_href": "/profile/Niko-Ochoa"
                },
                {
                    "user_id": "에레's Kpop Vines",
                    "user_href": "/profile/에레s-Kpop-Vines"
                },
                {
                    "user_id": "Olabode Odunniga",
                    "user_href": "/profile/Olabode-Odunniga"
                },
                {
                    "user_id": "Grace Lillian",
                    "user_href": "/profile/Grace-Lillian-1"
                },
                {
                    "user_id": "Martin Maciejewski",
                    "user_href": "/profile/Martin-Maciejewski-1"
                },
                {
                    "user_id": "Azell Rodriguez",
                    "user_href": "/profile/Azell-Rodriguez-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Welland",
                "href": "/profile/Rick-Welland"
            },
            "answer_text": "It is physically impossible to sing from your diaphragm. Take if from me. I’ve taught anatomy and physiology of speech production for over 20 years, and before that, I used my knowledge of anatomy and physiology to help people speak and use their voices more effectively &/or efficiently. The diaphragm is the main muscle of inhalation (breathing in). It consists of a flattened tendon (in the centre) that at rest takes on a dome shape, and muscle attachments (on the edges) that connect it to the ribcage and spine. When the muscle attachments contract, they flatten or pull down the tendon to increase the amount of space in the chest cavity. That creates a “vacuum effect” that allows air to move into the lungs and airways, causing the lungs (and chest wall) to expand. The process of breathing in is largely automatic. So is the process of exhalation (breathing out) when we are at rest. When we speak or sing, however, we change the way we use our breathing structures. First, we normally speak and sing only when breathing out. We use the air from our lungs and airways to set the vocal folds into vibration, which is what gives us our voice. Without this air, there can be no voice. Second, we typically use the muscles of the abdomen (belly) during speaking and singing to control the rate at which air leaves our lungs and airways. Essentially, we “support” the voice so that we don’t run out of air too quickly. Research has shown that most singers do this by tucking in their belly slightly. This is likely what most people mean when they say, “sing from the diaphragm”; it would be just as easy (and more accurate) for them to say, “tuck in your belly when you sing”. ",
            "date": "Answered August 19, 2020",
            "views": "658",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Niko Ochoa",
                    "user_href": "/profile/Niko-Ochoa"
                }
            ]
        }
    ]
}