{
    "title": "How does “Helter Skelter” (the song by the Beatles) relate to “helter skelter,” the lyrics mentioned in Don McLean's “American Pie”? - Quora",
    "tags": [
        "Bye Bye Miss American Pie",
        "The Beatles (band)",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Frost",
                "href": "/profile/Robert-Frost-1"
            },
            "answer_text": "Paul McCartney's song Helter Skelter compares a relationship to a ride, popular at English fairs, called the Helter Skelter.  A Helter Skelter is essentially a slide that wraps around a tower, such as in the below picture.   The first verse is pretty overt about the comparison:  When I get to the bottomI go back to the top of the slideWhere I stop and I turn in and I go for a ride'Til I get to the bottom and I see you again That song was recorded on The Beatles (AKA The White Album), which was released in November of 1968. In California, there was a nutjob named Charles Manson.  He become obsessed with The White Album (called so because the cover was white) and convinced that the Beatles were warning of an upcoming race war called Helter Skelter.  The term became important to him and his cult-like circle of followers. On August 9 and 10 of 1969, Manson's followers committed murders at the homes of pregnant actress Sharon Tate and grocery store executive Leno La Bianca, killing eight people.  They scrawled words like \"Pig\" \"War\" and \"Helter Skelter\" at the crime scenes. The words \"Helter Skelter\" were also found on a door at the ranch where Manson and his followers lived.   In 1971, Don McLean wrote the song American Pie and included the line:  Helter skelter in a summer swelter The line is a reference to those horrible murders in the summer of 1969. ",
            "date": "Answered November 20, 2015",
            "views": "213",
            "upvotes": " View 153 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Teddy Turner",
                    "user_href": "/profile/Teddy-Turner-1"
                },
                {
                    "user_id": "Caleb Kim",
                    "user_href": "/profile/Caleb-Kim-18"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Christine Roberts",
                    "user_href": "/profile/Christine-Roberts-693"
                },
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                },
                {
                    "user_id": "Doug Promisel",
                    "user_href": "/profile/Doug-Promisel"
                },
                {
                    "user_id": "Hugo Jiménez",
                    "user_href": "/profile/Hugo-Jiménez"
                },
                {
                    "user_id": "Brian Hiatt",
                    "user_href": "/profile/Brian-Hiatt-4"
                },
                {
                    "user_id": "Joyce Rickle Deed",
                    "user_href": "/profile/Joyce-Rickle-Deed"
                },
                {
                    "user_id": "Angel Acosta",
                    "user_href": "/profile/Angel-Acosta-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anton Van Niekerk",
                "href": "/profile/Anton-Van-Niekerk-5"
            },
            "answer_text": "Don McCleans track has been dissected to death by those wishing to put all the pieces together, and I am reminded of an answer he once gave when asked by a journalist what the song meant…..he replied it meant he had enough royalties to retire on. An amusing anecdote, but back to dissecting the song vis-a-vis the addition of Helter Skelter…..the songs lyrics relate not to a specific person, but to an amalgamation of personalities and events from a specific period in history. So its not about the plane crash that killed Buddy Holly, while simultaneously that event forms the foundation stone for a very well crafted summery of notable events, good and bad, that took place during that time, and throwing in the words *Helter Skelter* into the mix is a reference that brings the Charles Mason murders into this summery very nicely. Those two words open up an entire chapter of events and add a whole new topic to be debated upon when searching for the true meaning of the song, when in fact there really isn’t one, its just a poetic way to sum up important milestones that occurred during the most culturally influencial decade of our time. This is probably the most debated track of all time, and its a great piece of writing because every time the listener figures out what which line is about, it makes them feel kinda smarter, so well done Don McClean, and second prize goes to Carly Simon (and no, its not Warren Beatty……or at least not entirely…..) ",
            "date": "Answered June 14, 2020",
            "views": "239",
            "upvotes": "0"
        }
    ]
}