{
    "title": "How to know which member is who in BTS - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Samantha",
                "href": "/profile/Samantha-588"
            },
            "answer_text": "For me, when I first started out, every member looked the same to me. Now, as a loyal ARMY, I can tell each of them as easily as knowing my name. Once you know what they look like, it’s easier to figure it out. First of all, there is a video labeling all of their names in every MV made by them, so if you want to spend the time, here you go:  But if you don’t want to waste 1 hour of your life with no guarantee that you’ll know by the end of the 1 hour, than here are some tips. Watch Videos Only Dedicated To Them Such as “cute” compilations or “funny” compilations that are dedicated to them specifically. It gives you a good impression of who they are as a person and helps give you a look at how they look with different hairstyles and hair colors, since they change every so often. Look At Pictures Of Them Looking at pictures of a specific person also gives you a great impression of their different hair colors and hairstyles. It can also make you recognize them easier if you see them in different videos with the exact same hair color/style as you saw in the picture. Now I will demonstrate with different pictures and descriptions. An important note is: Know their real name too. If you’re watching a video or looking at a picture, there’s a good chance they’ll use their real name and not their stage name, so it’ll be confusing and harder for you to grasp the situation. I’ll only be using descriptions of what they look like instead of jokes/personality because you’ll learn that later. Warning: I’m bad at describing so bare with me. Suga aka Min Yoongi   Suga has what they call a “gummy smile”, which by definition would mean when he smiles, his gums and teeth show. He has a slightly rounder face than others and in most photos are either serious or show him pouting. I don’t really know how to explain how he looks, but I’ll use more pics of him to compare him to others and vise versa. — Rap Monster (RM) aka Kim Namjoon   Now for Rap Mon, he’s considerably the easiest to identify in the group, just because he looks extremely different from the others. People would describe him as having huge dimples, and for me that didn’t really help since they all pretty much have huge dimples. He definitely has more of a pointed chin, but I’d suspect that you don’t really pay attention to those details when they’re all moving around. — J-Hope aka Jung Hoseok   J-Hope definitely has one of the slimmest faces in BTS and has a really precious smile. His cheeks usually upturn when he smiles and you can definitely tell he has cheekbones. Don’t let this picture frighten you, he’s the most extra of them all and can look scary if he wants to. Usually one would describe him as the “one with bags under his eyes” — These might be a little lax because I legitimately can’t describe them well. Please forgive me stans of these people.   Jimin aka Park Jimin Easy to remember his name because it’s his stage name. Jimin can be easily identified as having a cute mochi face (basically the nice way of saying it’s the chubbiest, but it’s not meant as hate. He’s still cute af) and a round face. Jimin is actually very toned and has.. well.. abs. You can find PLENTY of videos on those. —   V aka Kim Taehyung When V smiles, it’s very unique and usually looks like a “box smile” as some point out. The corners of his mouth don’t really go all the way up, making it the way people describe it as: a box —   Jungkook aka Jeon Jungkook Easy to remember his name because it’s his stage name. Jungkook is the youngest and is depicted as having a baby face, though they all look very young. Jungkook has a “bunny smile” because of the arrangement of his teeth and the little bigger size of his two front teeth. Not very noticable but very easy to identify if it’s just their teeth being depicted. —   Jin aka Kim Seokjin Last but certainly not least is Jin. I don’t have much information on Jin, which is kind of ironic because he’s known for having the least lines (I’m so sorry child), but for the fact that he does have somewhat big lips and “big shoulders” as some say. His laugh is the most unique I’d say because of the “Windshield wiper” sound. — Comparison Break:  (V) —  (Suga) —  (Jimin) —  (Jungkook) —  (J-Hope) —  (Rap Monster) —  (Jin) Good Luck! ",
            "date": "Answered February 24, 2018",
            "views": "96",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muzzy Behning",
                    "user_href": "/profile/Muzzy-Behning"
                },
                {
                    "user_id": "Angle Loita",
                    "user_href": "/profile/Angle-Loita"
                },
                {
                    "user_id": "Sylvia Eglah",
                    "user_href": "/profile/Sylvia-Eglah"
                },
                {
                    "user_id": "Patrick Nast",
                    "user_href": "/profile/Patrick-Nast"
                },
                {
                    "user_id": "Samiha Narnaware",
                    "user_href": "/profile/Samiha-Narnaware"
                },
                {
                    "user_id": "Ammerie Sullivan",
                    "user_href": "/profile/Ammerie-Sullivan"
                },
                {
                    "user_id": "Lina Mekonnen",
                    "user_href": "/profile/Lina-Mekonnen-1"
                },
                {
                    "user_id": "Selena Suarez",
                    "user_href": "/profile/Selena-Suarez-4"
                },
                {
                    "user_id": "Gabriela Reypet",
                    "user_href": "/profile/Gabriela-Reypet"
                },
                {
                    "user_id": "Zachery",
                    "user_href": "/profile/Zachery-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scooby Doo",
                "href": "/profile/Scooby-Doo-125"
            },
            "answer_text": "I'd love to help! I'm an expert. So, let's start with Jin aka the maknae. Let's just say, he's probably the least attractive member, you can recognize him by his lack of shoulders. Although, he has a lot of downsides, he is the best dancer of the group so at least he has something. Next, we'll talk about Suga aka lead vocalist. He is the one with the most energy and he's always positive. Mostly, you can tell him apart because he always has a smile on his face, he's pretty tall, and he usually keeps his hair a dark colour. Then, of course, there is Rap Monster aka the lazy one. This guy does almost nothing for the group to be honest. He doesn't write any songs, and he can't rap. His name is Rap Monster because he sounds like a monster when rapping. Scary. The only thing he can even slightly do is sing and he's not even the best at it. Namjoon is definetly the dumbest in the group. However, you can tell him apart because he is short af. So, J Hope… he's quite an individual. To be honest, I'm worried for him. He looks like he's out of hope. He's never smiling and he's always a bit grumpy. You can tell if he's around because he just ruins everyone else's day. He's also really bad at dancing. He can't dance for shit, Jin has to spend hours teaching him. You can tell who J Hope is because his face is short and he has no eyebrows. Jimin aka The bitter carrot. I know, a weird name, I didn't come up with it though so don't blame me. He's named the carrot cuz he has no cheeks, his face almost slants inwards, it's weird. He's also far from sweet hence the bitter. He's kinda an evil boy but he's probably the funniest in terms of humor in the group so it's okay. Again, you can recognize him from his unique face shape and the fact that he's literally a giant. This boy is at least 10 feet I swear. Taehyung is the most normal member of Bts, he has nothing that really sticks out. He's kinda ugly but not as unattractive as Jin so it's okay. He's just kinda average. His voice is pretty high so he's decent at singing. But, overall, Taehyung is the main rapper in the group so that's what he's mainly known for it. All the members look up to Taehyung and they all love him as he's the least annoying in the group. Jungkook aka the clumsy dad of the group is my bias in bts. He is the oldest member and he's hilarious as he can't do anything for shit. I don't know how he got in the group to be honest, his luck is horrible. He'll be walking around and trip over nothing, so stupid. Anyway, he's very mature but it's just so funny how he fails at literally everything he tries. ",
            "date": "Updated February 26, 2018",
            "views": "34",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zachery",
                    "user_href": "/profile/Zachery-16"
                },
                {
                    "user_id": "Ashwathi D",
                    "user_href": "/profile/Ashwathi-D-2"
                },
                {
                    "user_id": "Janice McCarty",
                    "user_href": "/profile/Janice-McCarty-6"
                },
                {
                    "user_id": "Asia Kelly",
                    "user_href": "/profile/Asia-Kelly-11"
                },
                {
                    "user_id": "Jenny Kim",
                    "user_href": "/profile/Jenny-Kim-641"
                },
                {
                    "user_id": "Lara Allison",
                    "user_href": "/profile/Lara-Allison-7"
                },
                {
                    "user_id": "Swastika Sengupta",
                    "user_href": "/profile/Swastika-Sengupta-5"
                },
                {
                    "user_id": "Kriss Lee",
                    "user_href": "/profile/Kriss-Lee-9"
                },
                {
                    "user_id": "May Army",
                    "user_href": "/profile/May-Army"
                },
                {
                    "user_id": "Stefanie Baker",
                    "user_href": "/profile/Stefanie-Baker-4"
                }
            ]
        }
    ]
}