{
    "title": "How would you rank EXO, Red Velvet, and NCT based on vocals, dance, rap, and stage presence? - Quora",
    "tags": [
        "Red Velvet (K-pop group)",
        "NCT (KPop)",
        "EXO (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfee James",
                "href": "/profile/Alfee-James"
            },
            "answer_text": "Whew chile I thought you meant rank each members and whatnot and I was like pass but then it just hit me. SO if you know anything about me you know that I’m a huge SM stan and questions like this excites me so what else can I do except answer it ok the intro is already long. How would I rank EXO, Red Velvet, and NCT based on vocals, dance, rap, and stage presence? I’ll be answering this purely based on their talents so here’s the real deal. Note : I thought putting in the whole NCT members would be unfair so I just picked their Main Group NCT 127 if that’s okay :) I’m also doing ot9 EXO. Due to Red Velvet being outnumbered I’m counting it ratio wise (is that the word?) to make it a fair fight. VOCALS  EXORed VelvetNCT 127Now this is a fair vocal fight, SM is famously known for it’s vocals and these groups prove that the attention is well deserved. Overall I think EXO wins this fair and square, Wendy & Taeil are amazing but EXO has Chen up their sleeve not to mention Baekhyun & D.O which ultimately gives them the first rank. In general RV’s vocalists are still better than NCT’s but then again this is SM were talking about so losing in a vocal battle is nothing to be ashamed about (again I didn’t just count all the NCT vocalists as one power but more so with their levels like : Wendy-Taeil (Main), Seulgi-Jaehyun(Lead), Joy-Yuta(Vocalist) to make it fair) DANCE  EXONCT 127Red VelvetMy babies Red Velvet are still talented dancers! 🥺😡 It’s just the competition is just way too damn high. Lay & Kai really saved this round for EXO, for the non-main dancers I think I can say that NCT wins by a hair and also because their weakest dancer is still better than EXO’s weakest dancer but on the other hand EXO’s Main Dancers has more experience and such therefore they are more polished so they add extra hair and with that they win yet again. It’s really close tho. Just by a hair. RAP  NCT 127EXORed VelvetMark’s pretty much known as SM’s best rapper up to date and they also have Taeyong up their sleeve with Jaehyun as a nice backup so the award passes to them. EXO’s rapline is actually pretty good, I mean Chanyeol can rap well and Sehun has improved too, I’ve also heard some raps from Xiumin & Kai and they’re also pretty good. And last I actually think- well idol wise Red Velvet’s rapline isn’t that weak, I think they just lack a strong Main Rapper but Irene, Yeri, Joy & Wendy overall make a pretty good team. VISUAL  Red VelvetEXONCT 127Aside from vocals SM is also widely known for their visuals cause boy look at them,,,,Ugh this is a very hard for me to choose but I think Red Velvet has the best visuals out of the three, well in my opinion at least. But don’t let that fool you cause the boys are gorgeous! I also like that SM primarily focuses on scouting visuals but because of their motto “Talent can be taught” in the end they prove that their trainees aren’t just pretty faces and can be considered one of the most talented idols in the industry. STAGE PRESENCE  NCT 127EXORed VelvetI hate seeing Red Velvet keep being placed like this but still their rank doesn’t mean they have bad stage presence,,, yeah thats right! They dont! They get a lot of flack for it when eversince RBB they really improved into better performers so y’all should just stop with that. I think NCT 127 overall has the best stage presence, all the members give their best on stage and I admire them for that. Their facial expressions are also no joke and I still wonder to this day how they manage to keep being energetic until the end of the performance with a choreo like THAT. PERSONAL FAVORITISM Red Velvet NCT 127 EXO Dab adios ",
            "date": "Answered April 30, 2020",
            "views": "51",
            "upvotes": " View 110 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shoshanah Curiel-Alessi",
                    "user_href": "/profile/Shoshanah-Curiel-Alessi"
                },
                {
                    "user_id": "Deepthi Palaniyandi",
                    "user_href": "/profile/Deepthi-Palaniyandi"
                },
                {
                    "user_id": "Joy Myelin",
                    "user_href": "/profile/Joy-Myelin"
                },
                {
                    "user_id": "India Copeland",
                    "user_href": "/profile/India-Copeland-3"
                },
                {
                    "user_id": "Esrat Jahan Akhi",
                    "user_href": "/profile/Esrat-Jahan-Akhi"
                },
                {
                    "user_id": "Shalmali",
                    "user_href": "/profile/Shalmali-9"
                },
                {
                    "user_id": "Song Ci Yong",
                    "user_href": "/profile/Song-Ci-Yong-1"
                },
                {
                    "user_id": "Rhe Dy",
                    "user_href": "/profile/Rhe-Dy"
                },
                {
                    "user_id": "Maridee Dimagna-Ong",
                    "user_href": "/profile/Maridee-Dimagna-Ong"
                },
                {
                    "user_id": "Naina Prashayna",
                    "user_href": "/profile/Naina-Prashayna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paris Richardson",
                "href": "/profile/Paris-Richardson-12"
            },
            "answer_text": "Vocal: All the same level, nct definately least appreciated but taeil, doyoung, kun, xiao jun, renjun, chenle, haechan. Are all amazing main vocals and my ult is exo but honeslty nct and red velvet vocals are just as good as exo. I dont know red velvet voclas as well but from what i have seen they are amazing. Rap: Nct: taeyong, mark, jeno, lucas. These are the four i would say stand out most and could beat exo rap line. Exo: chanyeol and sehun are obviously the two who mainly stand out and thier tones work so well together it should honeslty be a crime. Definately an underrated rap line, they sound so good together exo sc low key my favourite sub unit. Red velvet: i mean i dont really think its fair to put an sm gg against the boy groups becasue i feel an excellent rap line is exoected more in boy groups. But dont get me wrong red velvet can hold their own to other girl groups and like truck id ever wanna be in a rap battle with them godddd noooo. Irene and joy oooof no thanks. Dance: Nct: ive seen people put exo first but honeslty with the amount of members in nct it is kind of predictable for them to be good at everything. Taeyong, ten, win win, jisung, yuta, mark, jeno, yang yang, lucas. They are the ones that stand out to me. Exo: kai and lay. Like skilllllls. Also sehun, he just has an aura when dancing. Sometimes even xuimin (remeber the eve - damnnnnn). I feel kai and lay are better than the nct members but honestly not by much. taeyong, ten, jisung, winwin, mark, these 5 i would say are basically the same level kai does have an aura to his dance that feels extra special and thats because of his ballet experience. But still with nct ten, taeyong and jisung provide their own personal aura and dance just as well in their style. Red velvet: same as what i said about rap, girl group dances are not meant to be sharp and detailed so therefore i really cannot judge fairly on this. Performance: Nct: they have so many concepts and unique choreo and unique sounding music that they pack quite a show. Exo: i mean when you get given sehuns go and kais confession and suhos been through. I am a straight woman how am i meant to react to this fairly against red velvet - i cant. Red velvet: i am straight and exo and nct are hot af, im sorry their performances are obviously more memorable to me :/ lol. ",
            "date": "Answered May 13, 2020",
            "views": "619",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shoshanah Curiel-Alessi",
                    "user_href": "/profile/Shoshanah-Curiel-Alessi"
                },
                {
                    "user_id": "Ft Louie",
                    "user_href": "/profile/Ft-Louie-1"
                },
                {
                    "user_id": "Aleyna-Rose Eiline",
                    "user_href": "/profile/Aleyna-Rose-Eiline"
                },
                {
                    "user_id": "Kevin Michaelis",
                    "user_href": "/profile/Kevin-Michaelis-4"
                },
                {
                    "user_id": "Zizi",
                    "user_href": "/profile/Zizi-6-1"
                },
                {
                    "user_id": "Alexa Chan",
                    "user_href": "/profile/Alexa-Chan-21"
                },
                {
                    "user_id": "Reece Graham",
                    "user_href": "/profile/Reece-Graham-14"
                },
                {
                    "user_id": "Felicia Korsah",
                    "user_href": "/profile/Felicia-Korsah"
                },
                {
                    "user_id": "Charissa Cheah",
                    "user_href": "/profile/Charissa-Cheah-3"
                }
            ]
        }
    ]
}