{
    "title": "How to dedicate myself towards my goal - Quora",
    "tags": [
        "Dedication",
        "Personal Goal Setting",
        "Personal Goal Setting Advice",
        "Setting Goals",
        "Goals",
        "Personal Goals",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Melinda Aimee Roth",
                "href": "/profile/Melinda-Aimee-Roth"
            },
            "answer_text": "My first friend worked like mad, took college courses in science, participated in a science fair project, and got into Harvard as a second year student, another I knew studied every word that was learned from a novel and wrote this with the etymology and the source where he learned the word on a three by five card and kept the note cards alphabetically. He got a perfect score on the SATs supposedly. Another who I admire was a voracious reader and was poor but read newspapers like mad and he spied on an group meeting who excluded particular ethnic groups and did the story in the college newspaper at Pennsylvania State University and got into “The Philadelphia Inquirer” right after college. He built his own car and raced it and did a story on it, and he sewed his own jacket, and he cared for and encouraged his siblings, and he how works at “The New York Times.” How do you dedicate your life to a specific goal is a very good question. Most people have other avocations which fit into their goal like exercise and reading. But the question also is what causes this motivation. With men sometimes they fall in love and would like to impress, others want to impress their parents and often ethnic community or other community, or maybe others are heartbroken and want to impress and find as a result their newfound talent or work to be a catharsis. But the most important thing about the reason for the person working so hard is that whatever his or her motivation or drive, he or she becomes absorbed and enjoys for himself or herself that talent and work and no longer serendipitously wants to impress people so much. So what is your dream? I look forward to hearing about this, and who motivated you or why you were motivated you in the first place. ",
            "date": "Answered August 14, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Feenstra",
                "href": "/profile/Richard-Feenstra"
            },
            "answer_text": "One way to dedicate yourself is by taking the time to invest in the goal. This is more than writing down the goal as you might write down, “Buy milk,” on a to-do-list. That is not a deep investment, only taking a few seconds of your time to write, “I want to be healthy” or “I want to finish a marathon”. Instead, invest the time to formally structure the goal. One way to do this is by using the S.M.A.R.T. model. Using the model requires you invest some effort in your goal, providing a structure that includes actions you need to take, how success will be measured, etc. When you dedicate some time structuring the goal, it will help you become more invested as well as provide clarity. Below is one version of the model. It is geared towards developing multiple structured goals verses some formats of S.M.A.R.T. or in some versions S.M.A.R.T.E.R., that tend to focus on a single goal. Find a version that works for you.  ",
            "date": "Answered November 6, 2017",
            "views": "676",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryant Hill",
                    "user_href": "/profile/Bryant-Hill-21"
                },
                {
                    "user_id": "Manish Gore",
                    "user_href": "/profile/Manish-Gore-14"
                },
                {
                    "user_id": "Karan Kakkar",
                    "user_href": "/profile/Karan-Kakkar-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Moritko",
                "href": "/profile/Andrew-Moritko"
            },
            "answer_text": "Make sure it is clearly defined. If your goal is not clear or not specific enough to fit your goals it will make it much more difficult to accomplish those goals.Make sure it is realistic. If your goals is outlandish and unrealistic, that will also certainly hinder your chances of achieving that goal. Make sure your goal is realistic. You can surely elaborate on it or make a bigger goal later, but make sure your goal is attainable.Make sure you have what you need. So many time I make big goals that really challenge myself but I don’t even have what is necessary to complete those goals. Make sure you have the tools (i.e., the money, the time, the space, etc) or whatever is necessary for you to achieve it.Make sure it is a challenge. If your goal is too small or boring chasing the goal for you will become just a boring exercise. You need to make sure you push your limits.",
            "date": "Answered September 25, 2018",
            "views": "793",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Debidutta Pradhan",
                    "user_href": "/profile/Debidutta-Pradhan"
                },
                {
                    "user_id": "Manish Gore",
                    "user_href": "/profile/Manish-Gore-14"
                },
                {
                    "user_id": "Abhishek Shakley",
                    "user_href": "/profile/Abhishek-Shakley"
                },
                {
                    "user_id": "AltodA",
                    "user_href": "/profile/AltodA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gladice Gong",
                "href": "/profile/Gladice-Gong"
            },
            "answer_text": "In his book \" The Success Principles: How to Get from Where You Are to Where You Want to Be \", Jack Canfield tells a compelling story. As the story goes, Bruce Jenner, famed U.S. Decathlete and Olympic gold medalist, was speaking to a roomful of Olympic hopefuls. He asked the group if they had made a list of their goals, and all hands went up. This isn't surprising considering the fact that Olympians are always focused, dedicated and ambitious overachievers. Then, came Bruce's follow-up question: “How many of you have your list of goals with you right now?” Only one hand went up. Of all the top athletes in that room, only Dan O'Brien carried his goals with him. So, he could always read them and stay focused on them. Not surprisingly, Dan O'Brien went on to achieve a huge goal when he won gold in the decathlon at the 1996 Olympics. In short, set goals, write it down and then carry it with you everywhere you go. ",
            "date": "Answered July 15, 2017",
            "views": "523",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepika",
                    "user_href": "/profile/Deepika-582"
                },
                {
                    "user_id": "Manish Gore",
                    "user_href": "/profile/Manish-Gore-14"
                },
                {
                    "user_id": "RainbowArtz HD",
                    "user_href": "/profile/RainbowArtz-HD"
                },
                {
                    "user_id": "Annalie Piodena",
                    "user_href": "/profile/Annalie-Piodena"
                },
                {
                    "user_id": "Sudha N",
                    "user_href": "/profile/Sudha-N-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravindra Negi",
                "href": "/profile/Ravindra-Negi-2"
            },
            "answer_text": "Goals are of two types. Long term and short term. Long term goal is on but short term goals are more than one. Short term goals should be realistic, specific and attainable. They should be line up based on what is the first priority. Once you know your target visualize achieving that goal. Feel it with emotion. Make vivid images. Put some sound in it. Put some color in it. make it impressionable. This turns into an experience. We are what we think. Our thinking is based on our experiences. How will we achieve when we have no experience of achievement. Visualization will create that experience. The mind will believe because it knows that the goal was attainable. So then it will become reality. Our belief systems built up with what we have been told has flaws. Use common sense. If you make a goal with all the effort you will be committed to it. If the time comes for hard work then you will do it. These are actionable things to do not talk about. The Power Of Creative Visualization: Unleash The Power Within You ",
            "date": "Answered December 17, 2018",
            "views": "241",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Best Planet",
                    "user_href": "/profile/Best-Planet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fawaz Sullia",
                "href": "/profile/Fawaz-Sullia"
            },
            "answer_text": "How to achieve a goal? Simple. Work towards it consistently. I have a confession. I'm fat. And it is my goal since years to be fit and muscular. I have tried diets and exercises for the same. But did it work? No. I'm still fat. Why? Because I wasn't consistent. I would stop excercising when I felt bored or over ate at a party. So the problem was not that I didn't have a goal. It wasn't that I didn't write down the goals, but the lack of consistency. So how do you achieve your goal? By working towards it consistently. Not a day, not a week, but always. Always. Success isn't an end point, but the joint result of consistent small actions ",
            "date": "Answered November 6, 2017",
            "views": "324",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manish Gore",
                    "user_href": "/profile/Manish-Gore-14"
                },
                {
                    "user_id": "Smita Rai",
                    "user_href": "/profile/Smita-Rai-10"
                },
                {
                    "user_id": "Ashay Kumar",
                    "user_href": "/profile/Ashay-Kumar-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Richard Levine",
                "href": "/profile/Stephen-Richard-Levine"
            },
            "answer_text": "Forget goals and develop habits that will move you toward your real goal -- a healthy body, peace of mind, and a career that allows you the freedom of action to avoid the unpleasantness of living paycheck-to-paycheck or making decisions based on need rather than want. ",
            "date": "Answered November 6, 2017",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arsh Aryan",
                "href": "/profile/Arsh-Aryan-3"
            },
            "answer_text": "What I have noticed in my life as a student is that even a small distraction can be detrimental for your goal. Try to avoid smallest of those career destroyers because they are like alternate pleasure that you want to try on and on once experienced. See,listen,feel,smell,touch only the things that are related to your goal.Don’t allow other things to corrupt you. ",
            "date": "Answered November 7, 2017",
            "views": "155",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda Holman",
                "href": "/profile/Linda-Holman-1"
            },
            "answer_text": "It’s easy to dedicate yourself to a specific goal if it’s following your dream. Define the goal. Research the requirements to achieve it. Make a step by step plan for accomplishing it. Take the first step, it’s the hardest. Take the next step. Make sure the goal is something you love, otherwise it can become a shackle. ",
            "date": "Answered August 14, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Masayo Hanyuda",
                "href": "/profile/Masayo-Hanyuda"
            },
            "answer_text": "First, what is your goal in your life? Then research about your interest and learn from others and all other resources and study well. Make a contact with one who is in your desired goal and try it best you can and keep going with your desired goal and do not quit. Remember, everything has its price to pay means you have to be ready to sacrifice for what you want. Keep this in your mind and accept it. You’ll reach your goal one day. Patience is another key to success. ",
            "date": "Answered January 17, 2019",
            "views": "122",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mukul Dawar",
                    "user_href": "/profile/Mukul-Dawar-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Kinzer",
                "href": "/profile/Bill-Kinzer-1"
            },
            "answer_text": "Instead of 20 things, do three or four that you can really dive into -- actions that you can truly sell yourself on. Voogd advises to have a series of questions or criteria for the things you do to make sure they have a purpose and are worth your time. \"An immature mind works from task to task without finishing,\" he says. To learn more, click here and play the video:How to Stop Procrastinating and Achieve Your Goals ",
            "date": "Answered November 6, 2017",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manya Sharma",
                "href": "/profile/Manya-Sharma-50"
            },
            "answer_text": "having a goal is a must in life to overcome your difficulties. you have to be focused and set your mind in such a way that you stick to your plan and goal . paste more and more quotes and information related to ur goal in your room and read them everyday this will help you a lot. take print outs of motivational quotes by great leaders loike a.p.j abdul kalam and stick it on your room wall and read them evrytime when you feel you need to be pushed. thats all hope this will help. ",
            "date": "Answered July 15, 2017",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "João Ferreira",
                "href": "/profile/João-Ferreira-39"
            },
            "answer_text": "How do I dedicate my life to a specific goal? There is an overall goal of everything existing which is for humans to be the best possible happy. To know more take a look at my post here (in essence, “Creation is God action to be, Him and us, the best possibe happy”) and about true happiness see Abstract 4 mentioned and linked therein ",
            "date": "Answered August 14, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nic Fernandez",
                "href": "/profile/Nic-Fernandez"
            },
            "answer_text": "Learn 1 thing everyday (according to your own capacity for new information) that you need to know how to do to get better. ",
            "date": "Answered September 25, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Cartney",
                "href": "/profile/Tom-Cartney"
            },
            "answer_text": "Know that you will accomplish it with all your heart and soul. Never doubt yourself. Don’t get easily influenced by outsiders that aren’t helping you get to your goal. Stay focused. ",
            "date": "Answered August 14, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}