{
    "title": "How does one get into the music industry as a singer? - Quora",
    "tags": [
        "Jobs and Careers in Music",
        "Music Production",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tatiana Vaz Pereira",
                "href": "/profile/Tatiana-Vaz-Pereira"
            },
            "answer_text": "Through contact with other artists and entrepreneurs I have learned that even though it can be a bit frustrating to keep working without being signed, all your effort must go into making the music you want to make. Record labels and listeners are looking for authenticity. The Justin Biebers and Britney Spears of this world actually allow record companies to record and distribute other artists. The incomes and popularity levels are, of course, out of balance, but if you look at people's playlists today you will see that diversity is key and the real consumers – the people who will go to a concert or buy a CD they liked to offer someone – choose their own music nowadays. Airplay matters little and those big companies know that if someone can awaken even a small group of followers by himself, that's probably a keeper. I am still in the beginning of my musical journey, but I believe there is no reason why I shouldn't be able to be heard or signed one day, if I keep pouring out the music that lives within me. If your goal is to be signed, fair enough, but I'd say don't expect much without some level of deliverance. Find like-minded musicians and form a band, play in as many places as you can and use the money you get to pay for a studio session. Record a few songs and put them on YouTube, BandCamp or SoundCloud. Create a Facebook page for your music where you give it away for free. Some people will fall in love and want to pay for it. When a record label sees that, it appreciates it, because half of the work has been done.  You will be signed for your unique qualities as a musician, and not because you want to – so many artist suck these days, there's no reason a good one wouldn't be given an opportunity! ",
            "date": "Answered July 13, 2014",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kalle Enkelmann",
                    "user_href": "/profile/Kalle-Enkelmann"
                },
                {
                    "user_id": "David Caune",
                    "user_href": "/profile/David-Caune"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kalle Enkelmann",
                "href": "/profile/Kalle-Enkelmann"
            },
            "answer_text": "If you are a singer and you believe you have the talent to be a professional, go record some demos and send them out to producers and labels and see if you can find someone who wants to work with you. Its a long way from a talented singer to a marketable product, and there are professionals who do just that. I happen to be one of them, and when people send me their demos, I always listen. And sometimes I hear something that I like, and if I also find the personality and attitude of that person to be right, I can make things happen for them.Most people underestimate what a hard business it is they are getting into, and that it takes more than a good voice to succeed. Making a demo is super easy and dirt cheap nowadays, its the first step and nobody in the industry is going to take you seriously before you have that. When you do, feel free to send them to me and I'll give you honest feedback. ",
            "date": "Answered May 26, 2015",
            "views": "484",
            "upvotes": "0"
        }
    ]
}