{
    "title": "How is a melody possible with one note? - Quora",
    "tags": [
        "Melodies",
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Dixon",
                "href": "/profile/Michael-Dixon-29"
            },
            "answer_text": "That one note can be surrounded by harmonic changes that alter the way it is perceived leading to the auditory illusion that the one note has changed its pitch. Here’s a striking example. On Cinnamon Girl Neil Young unabashedly plays a blazing one note guitar solo coming out of the bridge at 2:05 in the song.  You can often hear this in East Indian music as well. One note will drone on constantly while harmony. rhythm and other melodies change around it. Is the one note a melody? George Harrison accompanied by a group of traditional Indian musicians:  Melody goes hand in hand with harmony. The harmony defines the melody as much as the melody defines the harmony. ",
            "date": "Answered May 9, 2019",
            "views": "636",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Micheal Anthony",
                    "user_href": "/profile/Micheal-Anthony-10"
                },
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Dixie Golden",
                    "user_href": "/profile/Dixie-Guill-Golden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gustavo Woltmann",
                "href": "/profile/Gustavo-Woltmann-3"
            },
            "answer_text": "A nice melodic Shape is easy to remember for audience. The purpose of choosing notes is to make sound contour good for listeners. One note also makes sound brilliant. Many hit songs are also revolving around one pitch. top 10 of the Billboard Hot 100 is Carly Rae Jepsen’s “Call me Maybe“, as well as “Turn Me On” (David Guetta Featuring Nicki Minaj). Both these songs has one note melody. Out of Woods and Style by Taylor Swift also has one note. one note music is also a key to learn music. ",
            "date": "Answered September 29, 2020",
            "views": "48",
            "upvotes": "0"
        }
    ]
}