{
    "title": "How hard is it to become a music producer and start making money from it? - Quora",
    "tags": [
        "Music Producers",
        "Electronic Music",
        "Music Production",
        "Music Industry",
        "Making Money Online",
        "Musicians",
        "Wanting and Making Money",
        "Music",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Oehler",
                "href": "/profile/Eric-Oehler"
            },
            "answer_text": "I’m going out on a limb and say by “producer” you mean the sort of common-usage “the person who makes beats and music that other performers use” definition, and not the more industry-specific variations. Although, either way, it’s pretty damn hard. It’s not hard to become a producer. Fire up Garageband or FLStudio or whatever and start churning stuff out and you can accurately call yourself a producer in minutes. It’s hard to become a good producer. I’ve been writing, producing and engineering music for myself and others for 20 years and I still think I’ve got a lot to learn. Nonetheless, some people are talented. Maybe you can get there quickly. Then comes the proverbial lightning strike. Somebody has to hear it and buy your services. So you need to be good at marketing yourself. Maybe that somebody is an up and coming local rapper. Maybe it’s a local car dealership that wants a new jingle. Who knows. It’s a start. Do it. Be as goddamned professional as possible. Get everything done, meet your deadlines, don’t get cocky. Then aggressively market your experience. So great, after all that you’re an experienced musician-producer. Now you want to make a living off of it. That’s the hard part. The industry is over-saturated right now, and the amount clients are willing to pay is dropping quickly. If you’re lucky, you can get a steady job doing something like game audio or as an in-house composer/producer for a marketing firm. Those are rare positions, but they’re more secure. It’s a game that requires a lot of hustle on top of skill and practice and talent. ",
            "date": "Answered December 5, 2019",
            "views": "317",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Staffan Vilcans",
                    "user_href": "/profile/Staffan-Vilcans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Val Del Prete",
                "href": "/profile/Val-Del-Prete"
            },
            "answer_text": "Well, you don’t define what you mean by “money” so it’s hard to reply. In general, it is an extremely competitive game where it’s difficult and It takes a few years to get even one first small placement. Making a living from it is even harder. To give you some statistics, according to PRS for music, less than 10% of their registered songwriters and producers earn more than £5,000 a year. Bear in mind that to register with PRS you must have had at least one commercial release. personally it took me 3 years since I started writing commercially to get my first placement. 5 years to get my first platinum placement. Even now, after three platinum placements and 1.8 million records sold, I am in an “unstable” situation where if the placements don’t continue steadily royalties from old placements will not be enough to earn a living regularly. My first platinum placement came for a girl group where the record label had received about a thousand professional demos, from established writers signed to publishers or with a track record, and my song was among the 6 chosen for the mini-album. In summary, you have to be totally committed and insanely driven to make it in the music industry as a producer. Most people are driven by their unconditional passion regardless of the hardship. Without this kind of commitment you are unlikely to make it. Edit: I looked at the other answers.. I assumed you already know your craft, else it takes much longer, probably ten years at least, like in any high level professional setting. I also assumed you meant producer in the sense of someone who either makes tracks or produces songs written piano and voice by artists/writers. Roles blur a lot nowadays and producers are often considered as writers in their own right, as well as writers can be vocal producers or also track producers. The more skills you have, the higher the chance to make it. ",
            "date": "Answered December 3, 2019",
            "views": "671",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruno Veiga",
                    "user_href": "/profile/Bruno-Veiga-21"
                },
                {
                    "user_id": "Jo Sosna",
                    "user_href": "/profile/Jo-Sosna"
                },
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                }
            ]
        }
    ]
}