{
    "title": "How to make a proper song in 3 weeks - Quora",
    "tags": [
        "Music Composition",
        "Music Production",
        "Skills",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ethan Watts",
                "href": "/profile/Ethan-Watts-14"
            },
            "answer_text": "3 weeks is plenty of time to write a song, so regardless of your current skill/experience level, you have plenty of time to learn, prepare, and write :) The first step is to research how to write songs. Honestly just googling “how to write a song” is how I first got started, and I’ll give you the gist of what I learned. Think of a title, mood, or what you want the song to say. This is the most important part because without an idea in mind, you won’t get anywhere. It can be about anything, from falling in love, to regretting the past, having your heart broken, or maybe even just eating a chicken sandwich. The most effective songs have meanings that are relatable to most listeners, while not being too vague. So no overly specific song ideas, like say going on a date to watch albatross in Australia. Not many people can relate to that. Also stray from vague ideas, for example just about love. Instead, think about a unique take on it. For example, for a title, something like “At First Sight”, “Out of My League”, or “Love’s a Bitch” would be much better than a more generic title like “I’m in Love”, “I Love You”, or “Cheater”. From there, with a meaning and title, you can move on to writing the lyrics.Write the lyrics. From here, you’ll want to think about song structure. There are a few common ones which you should look up, like Verse-Chorus-Verse-Chorus-Bridge-Chorus or Verse-Verse-Chorus-Verse-Chorus. In general, you’ll want your chorus to sum up the overall idea of the song, and the verses to go into detail. The first verse should introduce the topic with the second verse (and third if present) adding more information to the story. Keep things concise, and don’t worry too much about rhyming. I’ve found that, while it helps a song, it isn’t always necessary.Get a melody, or a chord progression. If you have experience with music, the best way to go further is to come up with a melody first and harmonize after. The best way to come up with melodies is just to sing or hum in a certain key or just any notes. It doesn’t matter if you’re a good singer, just that you can understand the notes in your head and transfer them to a written medium with an instrument to figure the exact notes. If you don’t have musical experience, the best way is to Google common chord progressions, and just listen to them and pick one that sounds good to you and fits the mood of the song. From there, just play that progression on repeat through your computer and sing/hum your lyrics over it until you find a melody you like. Even professionals just sing to find melodies. Sting, the lead singer and songwriter for The Police, does it for everything he writes. It may seem awkward, but it’s the best way to do it! :)Write it down. This doesn’t mean literally write your song on a sheet of paper. You can do this a variety of ways. The best is to record your parts into a DAW (Digital Audio Workstation), such as Garage Band, FL Studio, or Ableton. If you don’t have one of those, you can use LMMS, a 100% free DAW to sequence for now. If you have an iPhone/Mac, Garage Band comes preinstalled and free, and it is an amazing DAW so use that if you can. Just record your voice parts, then you can use either synthesizers or recorded instruments for the instrumental. When it comes to writing the instrumental, if you did the chord progression, just put the chords down in one instrument and choose notes that sound good with it. That’s really all there is to it. If you have more musical experience and chose to harmonize a premade melody, I shouldn’t need to explain how to write the instrumentals. But keep in mind most songs have an instrumental intro, generally 4 or 8 bars long. Sometimes 16, but that can make things too long sometimes. If you don’t have/don’t want to use a DAW, then you can just record parts into your phone. For example, if you’re writing for a band or for just you and your guitar, you don’t need to properly write anything down, just as long as you/your bandmates know how to play and sing it. Still record it though, so you don’t forget.Don’t stress! Seriously. If you try too hard on a song, it ceases to be art and your body just sorta shits out notes with no meaning. Don’t get caught up on trying to get the perfect melody or the perfect harmony, the perfect drum beat, the perfect anything. Just write until it sounds good somehow, and go on. As the creator, you are your biggest critic, and will notice flaws a listener never would as well as sometimes making up flaws that aren’t even there. Just relax, and remember that writing music is all about just expressing how you feel. It doesn’t always have to be pretty; some of the best music of all time is very intense and jarring. As long as what you write fits the mood you’re going for, that’s all you need. Being perfectionist and obsessing is like climbing a mountain with no summit, because no music will EVER be perfect. When you relax, the whole process becomes so much easier, relaxing, and honestly fun! Music is a beautiful art form and you don’t need hardly any training to write a song, just an idea and some dedication.With all that info, you should be able to write your first song in well under 3 weeks. Don’t be afraid of writing a song quickly; I often find myself getting the bulk of my writing on a song done in under a day or two, with the rest of my time being mixing, mastering, and a lot of other advanced (slightly unnecessary) stuff. Especially while you’re learning, just don’t obsess over things and you’re good to go! If you take the time to learn the basics, you can write a song in a day with no problem. Just take however much time you think you need and remember that it will just take some time finding your songwriting process. Music is an amazing art form and don’t be afraid to give it all you’ve got and put your soul on display for your music! :) ",
            "date": "Answered May 6, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Mondong",
                    "user_href": "/profile/Ryan-Mondong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Cox",
                "href": "/profile/Patrick-Cox-119"
            },
            "answer_text": "You just do you. If you have something or someone that you want to make the song about then thats where you start. It all starts with an idea or inspiration. Three weeks is also plenty of time considering I generally crank one out in about three hours. I can spend days perfecting it though. ",
            "date": "Answered May 6, 2020",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Agust Martinez",
                    "user_href": "/profile/Agust-Martinez"
                }
            ]
        }
    ]
}