{
    "title": "How fast is Eminem's rap? - Quora",
    "tags": [
        "Eminem (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Johnson",
                "href": "/profile/Ken-Johnson-90"
            },
            "answer_text": "The fastest according to the Guinness Book of World Records.. Eminem’s Rap God is the holder of this record, with Marshall Mathers working his way through 1,560 words in 6’04”, at an average of 4.28 words per second. Rap God, which was released in October 2013, comes from Eminem’s eighth album, The Marshall Mathers LP2. The song features a verse about the Columbine High School massacre that had been written for the song I’m Back from the first Marshall Mathers LP, but which was censored from the original release. One section of the song features 97 words in 15 seconds, for an average of 6.5 words per second. ",
            "date": "Answered October 18, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremiah Kebede",
                    "user_href": "/profile/Jeremiah-Kebede-4"
                },
                {
                    "user_id": "Matt Dowling",
                    "user_href": "/profile/Matt-Dowling-30"
                },
                {
                    "user_id": "Ryan Sheppard",
                    "user_href": "/profile/Ryan-Sheppard-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isaiah Lizano",
                "href": "/profile/Isaiah-Lizano"
            },
            "answer_text": "Eminem has broken his Rap God syllable count record. Geez, he sounds like a broken record every time he breaks a record. (those of you that got that, good job). In January 2020 he released ‘Music To Be Murdered By’, and on it was a very impressive song called ‘Godzilla’, which featured Juice WRLD. In the final thirty seconds of the third verse, Eminem rapped 224 words (328 syllables) at 7.46 words per second (10.93 syllables per second). In Rap God (2013) Slim spits 97 words (6.46 words per second), which is incredible, but the speed has now been topped. ",
            "date": "Answered February 3, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harvey Dame",
                    "user_href": "/profile/Harvey-Dame"
                },
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                }
            ]
        }
    ]
}