{
    "title": "How long would it take for someone with zero experience in music to learn how to play (decently) a simple piece from Bach or Liszt on a keyboard or piano? - Quora",
    "tags": [
        "Keyboards (instrument)",
        "Learning Piano"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Buckley",
                "href": "/profile/Bob-Buckley-18"
            },
            "answer_text": "Ahhh! I actually blogged about this a while back- true story. The Tip of The Iceberg A good friend of mine is a pianist extraordinaire, with a brilliantly flamboyant style reminiscent of the late Liberace just without the sequins and penchant for Cuban pool boys. He was approached by a man with such an unusual request that he decided to take him on as a student. It seems the guy wanted to learn to play the extremely difficult classical piece “Piano Concerto #3” by Rachmaninoff. Not that unusual except for the fact that he had never before played a single note on the piano. Not one. Stranger than that, he only wanted to learn to play the first 128 bars of the piece- a mere minute and 45 seconds of an otherwise complicated, lengthy piece. Eighteen months later he could play those 128 bars better than Rachmaninoff himself- it was truly astounding….while it lasted.  Here’s what he’d do with his newly acquired skill. While attending a high-profile dinner party, with drink in hand he’d reach out and play a simple one handed chord on the grand as if curiously testing it’s sound. Inevitably someone would question whether he played or not and his answer was always the same. “Very little…..a few lessons here and there.” Once sufficiently pressed, he’d set off into this gut wrenching, jaw-dropping piece and then abruptly stop at measure 128, jumping away from the keyboard. Literally. Amidst the protests of the crowd to continue, he’d insist it was all he knew. Everyone of course laughed, believing it to be a display of self-deprecating humor. Not only a musical genius, funny too. One time when really pressured to finish the piece he avoided exposure by quietly “confiding” in a guest that the $45,000.00 instrument was slightly out of tune and simply didn’t want to risk embarrassing the host. Add considerate to his ever-increasing list of admirable qualities. Lesson drawn from this? Provide people just enough evidence of the tip and their assumptions will draw in the rest of the mass they’re convinced lies just below the surface- and there will be no moving them off that notion. Just ask any of the guests in attendance that night. ",
            "date": "Answered October 11, 2017",
            "views": "41",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul van Buren",
                    "user_href": "/profile/Paul-van-Buren"
                },
                {
                    "user_id": "Jayla Bryant",
                    "user_href": "/profile/Jayla-Bryant-9"
                },
                {
                    "user_id": "Jack Karisch",
                    "user_href": "/profile/Jack-Karisch-1"
                },
                {
                    "user_id": "Gösta Lars-Henrik Sträng",
                    "user_href": "/profile/Gösta-Lars-Henrik-Sträng"
                },
                {
                    "user_id": "Wendell Hurst",
                    "user_href": "/profile/Wendell-Hurst"
                },
                {
                    "user_id": "Alexandra Dahlem",
                    "user_href": "/profile/Alexandra-Dahlem"
                },
                {
                    "user_id": "Wayne T Pickett",
                    "user_href": "/profile/Wayne-T-Pickett"
                },
                {
                    "user_id": "Vidhyashankar A S",
                    "user_href": "/profile/Vidhyashankar-A-S"
                },
                {
                    "user_id": "Uri Maimon",
                    "user_href": "/profile/Uri-Maimon"
                },
                {
                    "user_id": "Amlan Naskar",
                    "user_href": "/profile/अमलान-नसकर-Amlan-Naskar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Garrick Saito",
                "href": "/profile/Garrick-Saito"
            },
            "answer_text": "It is really an impossible question to answer (and the reason you may be receiving seemingly flippant/sarcastic answers here). I realize this is not the answer you were seeking and this answer tells you nothing, but I wanted to plant a concept in your mind, one which most beginning piano students cannot fully understand. Each person progresses at different rates, based on their piano education, abilities, desire, talent and technical capabilities.  As you can imagine, with so many variables at play, progress from student to student can vary widely from virtually stagnant to virtuoso.  What one obsessively dedicated and talented student can accomplish in a few short months may take a near lifetime for another (less serious student). The word 'decently' is also a slippery slope.  That call is very subjective, depending upon one's experience and appreciation for musicality.  What may sound totally awesome to a one-year student will no-doubt sound like garbage to a ten-year student.  As you advance in your studies, one's ears become progressively more sophisticated in appreciating the nuances in music.  Certain of these nuances go unnoticed by the untrained ear. Music is not just a matter of hitting the right notes at the right time.  Most piano students with a few years under their belt would call that 'robotic' playing, music that lacks any emotional depth and musicality.  Musicality is achieved through interpretation, a note held for a split second longer than usual, a tempo which varies very slightly off the norm, the feeling of building a crescendo.  These are just a few examples of the nuances I'm talking about. Personally, I don't play Bach or Liszt, but based on the sheet music in the other post (Liszt's Transcendental Etudes), I wouldn't even attempt it even after five years of study (and 1,500 hours of practice).  It is far too complex, at this juncture.  Maybe in another five years, it'll be a different story. No offense, but your ideas about learning Bach and Liszt from day one are not realistic.  Learning the piano must start off with a good foundation, otherwise you have nothing but bad habits to build upon.  That means starting off with the basics, using the time-honored traditional methods that have been working for the past 300 years. Maybe your question was a fun, hypothetical one, but if not, please consider the above advice. Good luck with your studies. ",
            "date": "Updated August 26, 2013",
            "views": "82",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Holly Nguyen",
                    "user_href": "/profile/Holly-Nguyen-49"
                },
                {
                    "user_id": "Relentless Frost",
                    "user_href": "/profile/Relentless-Frost"
                },
                {
                    "user_id": "Jamie Van Etten",
                    "user_href": "/profile/Jamie-Van-Etten-2"
                },
                {
                    "user_id": "Irina Nenartovich",
                    "user_href": "/profile/Irina-Nenartovich"
                },
                {
                    "user_id": "Tronos .",
                    "user_href": "/profile/Tronos"
                },
                {
                    "user_id": "James Mojica",
                    "user_href": "/profile/James-Mojica-7"
                },
                {
                    "user_id": "Vidhyashankar A S",
                    "user_href": "/profile/Vidhyashankar-A-S"
                },
                {
                    "user_id": "Uri Maimon",
                    "user_href": "/profile/Uri-Maimon"
                },
                {
                    "user_id": "Divyansh Gupta",
                    "user_href": "/profile/Divyansh-Gupta-82"
                },
                {
                    "user_id": "Gurvinder Singh",
                    "user_href": "/profile/Gurvinder-Singh-58"
                }
            ]
        }
    ]
}