{
    "title": "How to teach piano to my 3 year old son - Quora",
    "tags": [
        "Teaching Piano",
        "Teaching Children",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cindy King",
                "href": "/profile/Cindy-King-116"
            },
            "answer_text": "If you can afford it, I’d get a good teacher who takes small children as students. Make sure this person has references, experience, and above all a great kind friendly vibe. You can also get a simple simple piano book at a music shop and tape with removeable tape (like blue painters tape) the names of the notes to the keys for a while (I’m pretty sure we used masking tape). Don’t pressure the child. Don’t turn it into homework. I started taking piano lessons when I was four. My teacher was very very good with children. Everything was fun and not about being perfect. I learned all the notes, the treble and clef staff, and could play very basic two handed songs after (I’m not sure how long…one or two years?) Then she had to change careers and I had a different teacher who was also great but, as the years went on, had a bit of a temper and I was already sensitive. When I started high school I just didn’t see why I should keep going if this was going to be an appointment every week when I might feel a bit on edge and wonder if she was going to snap about something. In other words, keep communication open with your kid about what’s happening with the teacher. Make sure you know why you’re having them take piano. Is it because they want to? Or because you have a particular idea about it? After ten years of piano, I have a very good ear and can type fast and I know a lot of classical music. It’s been 30 years but if I worked at it, I know I could be good at piano again because I practiced every day for about 10–30 minutes. No one ever EVER nagged me. Sometimes my dad said, “hey how about some piano?” and also, he played piano too and that was probably more motivating than anything (we were close). He did say multiple times, “Now we put in all that lesson money and you don’t play.” There’s that too. ",
            "date": "Answered July 1, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "DeBorah Kirkpatrick",
                    "user_href": "/profile/DeBorah-Kirkpatrick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzan Stroud",
                "href": "/profile/Suzan-Stroud"
            },
            "answer_text": "Most kids are not ready to start learning piano at age three but there are some things you can do to start building good habits and encouraging interest. Occasionally I teach three year olds that are ready but most of the time it is my feeling that starting before they have hit some developmental milestones may make it a negative or unsuccessful experience that makes them less likely to want to do it later. Progress is usually slow with real little ones so unless they are really interested, there is nothing lost by waiting. Things three year olds struggle with: Attention span! Three year olds usually have a very short attention span for concentrating on one thing. This makes it hard to get traction. I attack this by doing a lot of different activities that reinforce the same concepts. Draw notes, find them on the piano, say them out loud, play them.Fine motor skills. It can be very hard for them to play the keys with one finger at a time. Start with trying to get them to use one finger at a time to play consecutive keys without tucking fingers under. It’s okay to let them stick up in the air at first until they develop the coordination to relax them a little. Then you can play simple patterns and have them play them back. Don’t let them play with just one finger or fingers that don’t stay in one-finger-per-key position.Understanding certain concepts. Reading music can happen at this stage but you’ll need to work on some things first that to help ease the way and just introduce three notes. Make sure they know at least A through G of their alphabet. Help them understand the difference between a line and space. Identify lines and spaces by whether they are top (closest to the ceiling), bottom (closest to the floor) , middle etc.I would really recommend starting with sitting down for only five minutes at a time of structured time and then let them play around. For that part, I would try to give them just a few rules and then add a little more at a time as they get the hang of each thing. For instance: they must play one key at a time first not just smash groups of keys. Most importantly try to keep it a positive experience. It can be hard to work with your own child (even for teachers!) so make it your challenge to stay patient and make realistic goals for their age. Making a check list of what you’ll do is a great way to keep it structured, build routine and give them the ability to know what will happen next. Put something at the end of the list that they enjoy that you can remind them of to keep them motivated to finish the list. Feel free to check out my getting started videos and other free resources on my website. What is suzanstroud.com? Good luck and free to reach out with questions! ",
            "date": "Answered December 6, 2018",
            "views": "169",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rob Brown",
                    "user_href": "/profile/Rob-Brown-13"
                }
            ]
        }
    ]
}