{
    "title": "How will One Piece end? - Quora",
    "tags": [
        "One Piece (manga series)",
        "One Piece (anime series)",
        "One Piece (creative franchise)",
        "Anime Series",
        "Anime and Manga",
        "Manga"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olga Rubio Jimenez",
                "href": "/profile/Olga-Rubio-Jimenez"
            },
            "answer_text": "Luffy (the protagonist) reaches the island of Raftel at the end of the Grand Line sea route, and he finds there the treasure “One Piece” left behind by previous Pirate King, “Gol D Roger”. He gains immense world fame, political power and money wealth. He goes on to be known as the new Pirate King. He asks his crew to let him go alone to a certain place for a while, making it clear it’s a dangerous endeavor and that he might not return alive. They however, understand and trust their captain to no end, so they don’t pose resistance. He arrives in Emerald City, on the left side of the Reverse Mountain, south of the West Blue sea, on the opposite side of the Red Line continent to the starting point of every voyage through the Grand Line. Luffy: “We finally meet, Teach”. Marshall D. Teach (Blackbeard): “Zehahaha! I knew you couldn’t ignore my message. You won’t be the Pirate King for long. As I told you, I have your brother and father as captives here. Moria from my crew gave their shadows to me, so now I can use the power of the Weather changing devil fruit. Defeat me and they’ll be free, lose to me and the three of you will die as a family”. Story note: after the Revolutionary Army’s base was destroyed by Blackbeard, its top-commanders (Monkey D Dragon and Sabo) were understandably upset, and they happen to be Luffy’s biological father and adoptive brother. However he has much more ties to his brother since he’s spent way more time with him. They went to Blackbeard’s place to get revenge but didn’t account for old man Moria to have joined him and so they lost. Luffy: “Sounds fair to me. Now that I’ve realized my dream I wouldn’t care if I died, but I won’t let you lay a finger on Sabo. Also, I want to meet my father properly after all of this time. I’m really curious about my family’s past. “ Teach: “It’s official then! Come at me with all you’ve got! “ Luffy activates Ryuo Gouken (dragon scale-piercing punch) which is a golden colored haki [body hardening] that allows you to send people flying and blow them up from the inside, without touching them, but the farther you are from your target the less effective the attack is. This is the only way to hurt Blackbeard in his awakened form of his Darkness logia devil fruit. Luffy: “Gear 5th: Monkman” (kanji reads “monkey king man” Teach: “I know I’ve seen that colour of haki somewhere before… did that red-haired bastard train you again? I’ll teach him a lesson the next time I see him!“ Luffy, preparing his attack: “you won’t see him again!” *he flies towards teach in godspeed* Teach: “black wall!” (creates a wall in front of him with his element) Luffy “this time you won’t get me with that! *wraps his arm in golden haki and retracts it* “gomu gomu no… KONG NAGANT!” (kanji reads: “monkey king’s armor-piercing caliber”) *the attack catches Teach by surprise as he topples his wall and hits his huge belly directly, sending him to the nearby floor and causing him so much pain he wiggles his legs like a dirty cockroach while screaming ungodly* Teach: “you will regret that, Straw Hat!” *he says as he raises his gaze* but Luffy wasn’t there anymore, as the combination of using a recently-learned haki technique which he doesn’t quite master yet and so puts a strain on his haki stamina heavily, and having touched Teach which we all know temporarily disables your Devil Fruit powers, has made him to realize it’s better to rush to untie his family and flee from there ASAP, as Teach came there without his crew too as part of the promise. Next thing Teach sees is Luffy, Dragon and Sabo running towards the exit of the cave and jumping into Luffy’s Mini Merry boat. Luffy: “I’m so glad I was able to save you guys! “ *hugs Sabo passionately while smiling ear-to-ear”. “I wouldn’t have forgiven myself after letting another family member die.” “especially not after my first crewmate, Zoro, died in front of me too”. *his expression turns sad for a second as he remembers but cheers back up again to continue his family reunion* *looks at Dragon, who stands more than 3 meters tall, with serious expression* “So you’re my father”. Dragon: “yes! I was so eager to meet you too, after I learned about your serious accomplishments. “ “I’m sorry I left you with your grandfather when you were a baby. I thought it wouldn’t be right to involve a child in my dangerous daily life”. “on the other hand, I saved you from being executed before even reaching the Grand Line, so I guess we’re even! ha, ha, ha. “ Luffy: “yeah! I hope we can come to live as a normal family from now on, now that the Governmenr has been thrown off, the Revolutionary Army disbanded and world peace restored”. “Sabo! Dad! I want you to come meet my crew.” Both: “look at each other and nod* Sabo: “sure, why not” THE END note: this is after everything else has been settled, including every Straw Hat member fulfilling their dreams, meeting with those who awaited them, and Akainu dying at the hands of a more skilled Sabo, in revenge for Ace’s death. ",
            "date": "Answered May 6, 2019",
            "views": "313",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian Li",
                    "user_href": "/profile/Ian-Li-77"
                },
                {
                    "user_id": "Jarvis",
                    "user_href": "/profile/Jarvis-169"
                },
                {
                    "user_id": "Jalakandeshwaran R(Jalax)",
                    "user_href": "/profile/Jalakandeshwaran-R-Jalax"
                },
                {
                    "user_id": "Abed Adnan Saadi",
                    "user_href": "/profile/Abed-Adnan-Saadi"
                },
                {
                    "user_id": "Connor O'Malley",
                    "user_href": "/profile/Connor-OMalley-32"
                },
                {
                    "user_id": "Jamie Danter",
                    "user_href": "/profile/Jamie-Danter"
                },
                {
                    "user_id": "One Piece Đại Chiến",
                    "user_href": "/profile/One-Piece-Đại-Chiến-1"
                },
                {
                    "user_id": "Armaan Newaskar",
                    "user_href": "/profile/Armaan-Newaskar"
                },
                {
                    "user_id": "Mystic Mac",
                    "user_href": "/profile/Mystic-Mac-17"
                },
                {
                    "user_id": "Kumar Priyanshu",
                    "user_href": "/profile/Kumar-Priyanshu-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Declan Smith",
                "href": "/profile/Declan-Smith-23"
            },
            "answer_text": "All speculation at this point, but here are my thoughts. The Liberation of Wano I think that the arc focusing on Wano will play a massive part in the lead up to the final confrontation. It seems that many of the Eleven Supernovas are coming closer together for perhaps an all out war against the Beast King. Zoro and Law already on their way, Luffy and Capone currently in Totland, Kidd (and possibly Killer) having been captured, Hawkins and Apoo seemingly allied with Kaido, Urouge present at Kaido’s leap from the Sky Island, X-Drake already on the side of Kaido, and Bonney in hiding supposedly tracking the whereabouts of her fellow generation. On top of this, there will be the reintroduction of Marco and the remaining Whitebeard pirates, which is an interesting development to say the least. The Inevitable War There will be a large-scale war arc, much, much bigger than the confrontation at Marineford that involves all the prevalent characters in the story. I have a feeling it will be more clear cut in terms of good vs. evil as opposed the slight ambiguity of morality during the war at Marineford. The best thing I think that will happen during this battle will be the resurgence of many if not all allies the Strawhats have made on their journey: Galley-LA, the Giants, Kyros, Vivi, Bon Clay and the Newkama, the Franky Family, the Kuja, Dalton and Kureha, Gan Fall and the Sky Islanders (Shandians and Skypeians) etc. As well as the return of many enemies of the Strawhats: Eneru, CP-9/CP-0, the Warlords, perhaps Big Mom or Kaido (undecided on this but I think the Yonko will have separate arcs to close their part in the story), the Blackbeard Pirates, and most prominently the entire naval force of Marines. I do think the war will center primarily around two separate conflicts: the battle between the Revolutionaries and the Government, and the race between Luffy and Blackbeard to find the One Piece. These two incidences will be intertwined somehow, with many characters rearing their heads to help or hinder. We know that the destruction of Fishman island by Luffy’s hand was prophesised and perhaps it is a result of this war. In Luffy’s bid to strike Mariejois, the Red Line crumbles, signalling the end of segregation and oppression all over the world. Fishman Island is in peril, but Poseidon summons the Sea Kings one last time and Noah can finally be called to action. The ship safely carries all the residents off the island, sheltering them from the debris and decimation around them. Personally I can see some major internal conflict for Luffy as well. I can imagine Blackbeard posing such a large threat to all sides that the Marines will be forced to work together with several of their enemies. Imagine Sakazuki wrestling with his urge put down the Revolutionaries, but also opposed to the whims of the Celestial Dragons and the Gorosei. Imagine Luffy swallowing his grief and rage to have to share the same side with the man that killed his brother for the sake of his nakama and friends. I can see a moment of clarity for both of them after a massive one-on-one battle where they temporarily put aside their differences to take on a common enemy (probably the World Government). The One Piece Now obviously we know Luffy will become the Pirate King, but never the one to play to expectation I think Oda will make it much harder for Luffy. Blackbeard will find the legendary treasure first and become the Pirate King. This immediately creates a roadblock for Luffy and one final showdown for his shot at the title of the most free man on the sea. I’m hoping the final scenes will be less grandiose and more confined. Less about armies and more about the clash of two. Luffy and Teach stand solitary on Raftel, opposing each other in both mind and body. A storm rages on in the distance as Blackbeard has one final epic monologue before the clash of conquerors and Luffy’s iconic “I’M GONNA KICK YOUR ASS”. The End for the Strawhats Luffy will become the Pirate King and be revered across the globe, his allies and friends will spread his story and the world will begin anew. He won’t take on leadership, but it will be thrust upon him. Pirates all over will look to him as their saviour and hero. It will come at a cost. I think Luffy will suffer from the same illness as Roger and inevitably cut short his fantastic adventure. But he wont care, after all, he went on an amazing adventure with his crew - that’s all he ever cared about - it was never about the title. Zoro will achieve the rank of Greatest Swordsman in the World. Again, he won’t care for the glory, instead he will reflect upon his amazing adventure. He will most probably be responsible for seeing Luffy off and eventually disbanding the crew. Zoro will open up his own dojo when he gets old enough, maybe taking over his master’s old one in East Blue. I can see him with Tashigi, not necessarily romantically (maybe, but I can’t see Zoro as a family man), but as companions as they seek to find and restore the sacred blades and spread their wisdom of the sword. Who knows, he even might eventually be able to pay Nami off one day. Nami will chart her map and see the world. I can see her regularly going on whacked adventures, sometimes taking other nakama with her, sometimes with her sister, regularly studying on Weatheria for new meteorology techniques. Oh and she’ll have lots and lots of money to spend in doing so. I don’t think she’ll ever relent her thieving ways. There may even be a resolution for Nami with Sanji in the end. We know there’s chemistry, but I feel like if we saw them together it would be in some form of epilogue. Usopp will conquer all his fears. He will truly become the bravest warrior on the seas. He will inevitably go home to Kaya, but not before he spends years on Elbaf training with his comrades, the giants. Many kingdoms will have some legend associated with Usopp written in their history and he will become as renowned as Montblanc Noland, maybe even for being as much of a liar. Sanji will find the All Blue. He will spend many years researching and cooking new recipes, able to great new super foods. Sanji will want to settle down, he will start a family, but one day he’ll get a call. One that tells him it’s time to come home. Vinsmoke Judge on his deathbed will relent his grief about Sora and proclaim Sanji as the true Germa King. Unwillingness will drive him away but responsibility and his love for family will draw him back. He may well marry Pudding, or maybe end up with Nami, or maybe no one if he’s that unlucky. Sanji will be accepted as the ruler of the North Blue, but he will be a fair and just king, perhaps even critical in shaping the new government. Chopper will become the world’s greatest doctor, able to cure all illnesses. I can see him living out his life on either Zou or going back to Drum Island. He won’t advertise his skills, but I feel as though his presence will be more of a rumour, whisperings of the great doctor who traveled with the Pirate King. His greatest shame is not being able to save Luffy, the one illness he could not fix. He and Carrot will probably travel together (provided she isn’t going to join the crew, or she isn’t the spy from Wano). Robin will finally be able to learn and record the true history of the world. It will be her life’s work and she will want to spread the information across the world. I have a feeling that Robin will be instrumental is reconstructing the government from the ground up, possibly becoming one of the key governors maybe with Kuzan as her Fleet Admiral. Towards the end of her tenure I can see her trying to restore the library of Ohara, slowly rediscovering the old texts and finding new ones to add to it. Franky will become a world-renowned shipwright, most likely will join Iceburg into propelling Galley-LA forward with both working to become the best. Franky will probably pick up all of Vegapunk’s old projects, maybe becoming his protegee. He will probably seek to get an official pardon for his old master Tom even in death, and maybe they will bring the sea train all the way across the world, repairing Water 7’s flood issue in the process. Brook will finally return to Laboon. It will be his final adventure and for the rest of his days he spends writing songs about the Strawhats, ones that will last for all time. Bunking down in the Twin Capes, the Soul King will herald all new adventurers as they enter the Grand Line. The final panel of the manga revealing Brook singing along to his violin as he laments about the end of their journey with Luffy, but how the story has just begun. Like I said this is all just speculation and some of my hopes for the story, but I look forward to what everyone else had to say! ",
            "date": "Answered January 8, 2018",
            "views": "238",
            "upvotes": " View 104 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Syalinna Naurah",
                    "user_href": "/profile/Syalinna-Naurah"
                },
                {
                    "user_id": "Tasmeem Reza",
                    "user_href": "/profile/Tasmeem-Reza"
                },
                {
                    "user_id": "Kapil Pantha",
                    "user_href": "/profile/Kapil-Pantha-4"
                },
                {
                    "user_id": "Dream Power",
                    "user_href": "/profile/Dream-Power-3"
                },
                {
                    "user_id": "Himanshu Kunwar",
                    "user_href": "/profile/Himanshu-Kunwar-14"
                },
                {
                    "user_id": "Patrick Robertson",
                    "user_href": "/profile/Patrick-Robertson-70"
                },
                {
                    "user_id": "Ryan Jeong",
                    "user_href": "/profile/Ryan-Jeong-14"
                },
                {
                    "user_id": "Flynn Travassos",
                    "user_href": "/profile/Flynn-Travassos"
                },
                {
                    "user_id": "Guillaume Lacoste",
                    "user_href": "/profile/Guillaume-Lacoste-2"
                },
                {
                    "user_id": "Jaiden Giles",
                    "user_href": "/profile/Jaiden-Giles"
                }
            ]
        }
    ]
}