{
    "title": "How to make good music videos in YouTube for beginners - Quora",
    "tags": [
        "Music Videos",
        "Videos",
        "YouTube Videos",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dean Swift",
                "href": "/profile/Dean-Swift-3"
            },
            "answer_text": "There are plenty of ways to make a music video on a budget. First, you’ll need a camera. Any iPhone would work just fine, but if you have a DSLR, mirrorless, or even better camera than those that will work as well. Get creative. Not every music video has to be glamorous with mansions, nice cars, etc. Tell the story of your music. It could be shots of you singing/rapping/playing (whatever you/your band does), it could be B-Roll of a scene that portrays the mood of your video. To make it look like a “real” music video, take it into a software like Adobe Premiere Pro (industry standard editing software, final cut pro works too), color correct the shots you took (to your liking), and use the “crop” effect to add black bars to the bottom and top of your music video to appear widescreen, when it’s really not. You can stabilize shots that are shaky with the warp stabilizer effect, just make sure to plan what shots you want stabilized, and film them as stable as possible during the shoot. Keep your audience in mind. It’s not as much about what scene you’re in, or the budget of the video, it’s about the artist. If the artist has a personality that the public enjoys watching, you will succeed. Too many times I see people fall flat of the persona/uniqueness but still shell out the budget, and it results in an aesthetically pleasing, yet disappointing turnout. Be original, be yourself, and take shots at angles nobody has came up with before. Then, you will catch attention. ",
            "date": "Answered May 20, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lewis Bennett",
                "href": "/profile/Lewis-Bennett-44"
            },
            "answer_text": "YouTube has more than 1.9 billion active monthly users, and every day they view a billion hours of video. To put that in perspective, it has absorbed EVERY DAY over 114,000 years of footage. Top YouTube content creators can make hundreds of dollars a day, if not thousands, but interestingly, being popular and making money on YouTube has little to do with making a video in reality. YouTube's value to indie musicians finding an audience. Nevertheless, with the platform's growing popularity, the video quality that users expect will also improve. Seeing the videos released by professional YouTubers and more established artists can be overwhelming for many indie artists, but it doesn't require to be. Now here are the techniques for YouTube For Beginners Create a YouTube video strategyMake sure your video found on YouTubeKnow YouTube equipmentLearn the first YouTube video you should makeSetup your video recording and edit your videoUpload your video on YouTubeOptimize your video for YouTube",
            "date": "Answered December 29, 2019",
            "views": "39",
            "upvotes": "0"
        }
    ]
}