{
    "title": "How does a mouth organ work? - Quora",
    "tags": [
        "Mouth Organ",
        "Harmonicas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diganth R Murthy",
                "href": "/profile/Diganth-R-Murthy"
            },
            "answer_text": "Basics of reed based instruments. Origin of sound. In our childhood we used to take a sheet of paper and hold it parallel to mouth and blow. Paper flutters and makes some fluttering noise because of the vibrating paper.So, if there is a thin metal instead of paper, it will make different sound of higher pitch. Construction of mouth organ. Thin pieces of metals called “reeds” are arrange like below in sorted order of their lengths.Frequency of the sound is inversely proportional to the sound. Longer the reed, lower is the frequency. This arrangement is made in such a way that they exactly produce predetermined frequencies which are nothing but musical notes ( A, A#, B, C, C#... etc.). Finally I will have a metallic plate which contains the reed which looks like below. Optimisation: Now we have learnt that, blowing produces sound. It is also true that if I place the reed other way round and draw air inwards I can produce same sound. So now I can produce more types of sound with two metallic plates. One for blowing one for drawing.Fitting things together: Next level is to make it handy and wonderful. Two metal plates now called as “draw reed plate” to generate sound when air is sucked in by mouth and “blow reed plate” to generate sound when wind is blown from mouth.Then these is a wooden or plastic “comb” which separates the reed plates.Finally all these three things (two reed plates and comb) are packed together. Final piece would look like below:  Misc: Some mouth-organs have a a switch kind of thing, which changes the pitch by covering slots of the comb like below. See the right hand side protruding metal.  ",
            "date": "Answered October 3, 2016",
            "views": "15",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amit (अमित)",
                    "user_href": "/profile/Amit-अमित"
                },
                {
                    "user_id": "Emiliano Abedini",
                    "user_href": "/profile/Emiliano-Abedini"
                },
                {
                    "user_id": "Mohit Gupta",
                    "user_href": "/profile/Mohit-Gupta-955"
                },
                {
                    "user_id": "Ajit Moharana",
                    "user_href": "/profile/Ajit-Moharana"
                },
                {
                    "user_id": "Sangan Patil",
                    "user_href": "/profile/Sangan-Patil"
                },
                {
                    "user_id": "Arun Patel",
                    "user_href": "/profile/Arun-Patel-16"
                },
                {
                    "user_id": "Christina Sanchita Shah",
                    "user_href": "/profile/Christina-Sanchita-Shah"
                },
                {
                    "user_id": "Jay Choudhary",
                    "user_href": "/profile/जय-चौधरी-Jay-Choudhary"
                },
                {
                    "user_id": "Bhavik Bhatt",
                    "user_href": "/profile/Bhavik-Bhatt"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bineeth Benny",
                "href": "/profile/Bineeth-Benny-1"
            },
            "answer_text": "  Although it is impossible to pinpoint the exact day that the hannonica was invented, the first patent was issued to the teenaged Christian Friedrich Buschmann of Thuringer (now Germany) for his aura, a 4 in (10 cm) mouth organ that featured 21 blow notes arranged chromatically. It was quickly imitated throughout Europe and went by many names, such as mundharmonika, mundaeoline, psallmelodikon and symphonium. In 1826, Joseph Richter, a Bohemian instrument maker created a variation that was to become the standard. Richter's version featured 10 holes with 20 reeds on two separate plates that allowed both blow notes and draw notes. The plates were mounted on either side of a cedar comb. He tuned it to a diatonic, or seven-note, scale. Read more: http://www.madehow.com/Volume-3/Harmonica.html#ixzz4M0vZ1F5e  The sound of the harmonica comes from groups of reeds mounted on reed plates (image of reed plate)  inside the instrument. Reeds are usually made of brass, but steel, aluminum, and plastic can also be used. Reeds located inside the comb’s air chamber respond to blowing and those on the outside respond to drawing (inhaling). The length of the reeds affects the pitch of the notes, with the longest (lowest) reeds to the left. The part of the harmonica that houses the reed-plates is called the cover plate. Because the cover plate projects sound, variances in material—including metal, wood, or plastic—can determine the tonal quality of the instrument.How a Harmonica Works | Making Music Magazine   Sourced from Google.com ",
            "date": "Answered October 3, 2016",
            "views": "676",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Bilimagga",
                    "user_href": "/profile/Abhishek-Bilimagga"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                }
            ]
        }
    ]
}