{
    "title": "How to play music from my phone in a car that does not have Bluetooth or aux - Quora",
    "tags": [
        "Playing Music",
        "Car Audio",
        "Bluetooth Speakers",
        "Bluetooth Devices",
        "Bluetooth",
        "Audio Equipment",
        "Smartphones",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Evans",
                "href": "/profile/Tom-Evans-155"
            },
            "answer_text": "There are two methods. A Bluetooth transmitter can take your phone’s Bluetooth output and convert it into an FM frequency that you can tune with your radio. A second method for those with cassette transports is a fake cassette tape with contacts on it to transmit the headphone signal from your phone to your cassette deck’s playback heads. Both methods absolutely SUCK and are not worth the money, imo. However the Bluetooth transmitter concept could be acceptable if manufacturers would build an acceptable product. So far, everything I’ve tried or read about is junk. Part of the problem is that it would be expensive to do this properly and there is concern that consumers would not like the pricetag. The dummy cassette method shall remain eternally horrible and should always be avoided. Easy answer? Have a new radio installed. Keep your old one for when you sell your car. The radio doesn’t have to be much but it must have an aux jack and/or superior Bluetooth or WiFi capabilities so that your phone works well in the car. ",
            "date": "Answered June 23, 2020",
            "views": "189",
            "upvotes": " Answer requested by Potr Skoda",
            "upvoters": [
                {
                    "user_id": "Carl Griffiths",
                    "user_href": "/profile/Carl-Griffiths-5"
                },
                {
                    "user_id": "Martin Cohen",
                    "user_href": "/profile/Martin-Cohen-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Lammas",
                "href": "/profile/Mark-Lammas-2"
            },
            "answer_text": "Use a radio transmitter interface. They are inexpensive. Plug your phone into it; set it playing; tune your car radio into the transmitted signal and enjoy. Most of these devices transmit on the FM band. Some use the AM band. Not surprisingly, ones on AM will not transmit in stereo. I find that placing the device closer to your car aerial may he necessary for good reception; they are low power devices. In such a case, use a long cable so that the phone is within reach for control when you park to change your music… most car aerials nowadays seem to be at the back of the car… ",
            "date": "Answered July 5, 2020",
            "views": "132",
            "upvotes": " Answer requested by Potr Skoda"
        },
        {
            "author_info": {
                "name": "Chris Chovanek",
                "href": "/profile/Chris-Chovanek"
            },
            "answer_text": "There is an fm transmitter gadget you can add to your phone, plug it into the headphone socket choose a frequency from it's display then refine your car radio to that frequency and your phone music wiL now play through your radio so long as the transmitter is plugged in and powered up ",
            "date": "Answered June 24, 2020",
            "views": "98",
            "upvotes": " Answer requested by Potr Skoda"
        },
        {
            "author_info": {
                "name": "Mike Spector",
                "href": "/profile/Mike-Spector-1"
            },
            "answer_text": "In my car I use a Bluetooth FM transmitter so that I can play my phone using the radio in the car.  ",
            "date": "Answered June 23, 2020",
            "views": "124",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-44"
            },
            "answer_text": "I’d suggest getting yourself a small Bluetooth speaker, which you could also use at home or at work. I have a Kew K1 which I use to check mixes from my studio and enjoy the quality for the price and size. ",
            "date": "Answered June 24, 2020",
            "views": "79",
            "upvotes": " Answer requested by Potr Skoda"
        },
        {
            "author_info": {
                "name": "Dean Strand",
                "href": "/profile/Dean-Strand-1"
            },
            "answer_text": "With a small FM transmitter that connects to your phone's headphone jack. The transmitter then “broadcasts\" the music to your car FM radio. ",
            "date": "Answered June 23, 2020",
            "views": "38",
            "upvotes": " Answer requested by Potr Skoda"
        }
    ]
}