{
    "title": "How often should you take your electric-guitar for setup? - Quora",
    "tags": [
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ioannis Anastassakis",
                "href": "/profile/Ioannis-Anastassakis"
            },
            "answer_text": "Great question! How often should you take your guitar to be set up really depends on several factors. My “one-size-fits-all” suggestion for Electric guitar set up frequency is to take your guitar for a complete setup twice per year: Once after the weather temperature gets relatively cold where you are and once again a few weeks after gets relatively warm. Where I live (SE Europe), that is usually sometime around the month of November and then again around May. Τhis setup schedule takes into account the contraction and expansion of the guitar’s materials (mostly the wood), and makes sure my guitar has the maximum chances to stay in tune throughout the rest of the year. This schedule of twice per year is also what I suggest to the majority of my electric guitar coaching students. Once again your mileage may vary depending on: If you have changed or customized your string gauge,how much you play the specific instrument,if you vary its temperature/humidity conditions oftenIf you carrying it in the car and if you play live with it, and alsodepending on your actual playing style - eg if you have a hard-hitting playing style, chances are you need to setup your guitar more often than someone that plays with a very light touch.Here’s a Youtube video from my “Ask the Guitar Coach” podcast that answers this specific question in more detail. If you found this answer useful, you may want to check out my “Ask the Guitar Coach” iTunes podcast, where i answer listener/viewer questions about learning to play the guitar - available also as a Youtube Playlist ",
            "date": "Answered November 29, 2017",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wayne White",
                    "user_href": "/profile/Wayne-White-8"
                },
                {
                    "user_id": "Alexandros Fatsis",
                    "user_href": "/profile/Alexandros-Fatsis-2"
                },
                {
                    "user_id": "Harris Romanos, MD",
                    "user_href": "/profile/Harris-Romanos-MD"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew McGregor",
                "href": "/profile/Andrew-McGregor-12"
            },
            "answer_text": "When you need to, or every couple of years. More if you play a lot, because you’re trying to catch fret wear and have the tech relevel them. Learn to do the simple things yourself (string changes, neck relief, intonation… normally you’ll have to do a little of both the neck relief and intonation on every string change). But every now and again you’ll want an expert to look at the instrument, they will find things you don’t notice consciously but will make it both last longer and nicer to play. If you’re really keen on workshop skills, learn to level frets… but you’re probably going to destroy a guitar neck learning that skill, and there are lots of tools involved, so it’s a pretty big investment. Better give that one to a pro, who will often have much better tools than you can possibly afford. ",
            "date": "Answered October 31, 2017",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Kentish",
                    "user_href": "/profile/Michael-Kentish-1"
                },
                {
                    "user_id": "Edward Sherry",
                    "user_href": "/profile/Edward-Sherry"
                },
                {
                    "user_id": "Matt Sproule",
                    "user_href": "/profile/Matt-Sproule-2"
                }
            ]
        }
    ]
}