{
    "title": "How are music and dance related? - Quora",
    "tags": [
        "Dance Music",
        "Social Dance",
        "Dance (activity)",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamout.co",
                "href": "/profile/Jamout-co"
            },
            "answer_text": "Music and dance are related because music is what people dance to. Dancing without music is sometimes just moves. They can enhance each other if the dancer applies the right moves at the right time for the music. Music gives dancers energy and feelings inside or sometimes gives them a way out of people to express themselves. Jamout - making musicians' lives easier P.S. Get your free account at Jamout ",
            "date": "Answered March 10, 2017",
            "views": "897",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Fuj147"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihail Ghiga",
                "href": "/profile/Mihail-Ghiga"
            },
            "answer_text": "Music activates the motion center in the brain, instantly. Without passing through reason. As soon you hear something, your instinct is to move. So, as long it’s not a grizzly in a forest and you need to run, you’ll dance. Try to observe yourself in a mall, where’s allways music, you’ll see that you naturally move on it. So music and dance are inherently related. ",
            "date": "Answered January 31, 2017",
            "views": "880",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-176"
            },
            "answer_text": "I think the connection is rhythm. A simple beat, such as a regular heartbeat, is the rhythm of life. Hear the sound of that beat and you instinctively, automatically start to tap your foot. Dance music in whatever form has a prominent rhythm, the number of beats (heartbeats?) in the bar, the tempo. Marching rhythm spaces the beats evenly, swing music, dance music, reggae and others place emphasis on certain beats within the bar but it is the regular pulse of the music that creates the compulsion to dance. The music itself - the melody - embellishes this feeling and brings purpose and meaning to what would otherwise become just a mechanical response. ",
            "date": "Answered February 28, 2020",
            "views": "246",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Uma Shankari",
                    "user_href": "/profile/Uma-Shankari-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorraine Person",
                "href": "/profile/Lorraine-Person"
            },
            "answer_text": "They are the same thing. They have only been separated by an accident of linguistics in Western civilization and by the influence of religion. In this century, technology (particularly music recording) has firmly separated the two. But in most other traditions they are necessary to each other. Great dancers embody music and great musicians are “moved” to play. Separating the two traditions as we do in western universities has weakened both arts. ",
            "date": "Answered May 5, 2017",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dilip Shrestha",
                    "user_href": "/profile/Dilip-Shrestha-40"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Peter Renzland (任子澜)",
                    "user_href": "/profile/Peter-Renzland-任子澜"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Sheridan",
                "href": "/profile/Wendy-Sheridan-2"
            },
            "answer_text": "I thought and thought but can’t really find something unusual connecting dance and music because they surely go together, since the dawn of time. Perhaps I could include trance dancing, raving or something like that- a celebration that brings people outside themselves….that’s unusual. I guess! not really though. Cheers. ",
            "date": "Answered December 2, 2017",
            "views": "314",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandra Smith",
                "href": "/profile/Alexandra-Smith-417"
            },
            "answer_text": "Music and dance are considered “inseparable,” because the whole idea of dancing was based upon the music it is paired with. Dance, originally, was meant to be a method of visualizing music, telling stories, and of course, an art form. ",
            "date": "Answered May 4, 2020",
            "views": "86",
            "upvotes": "0"
        }
    ]
}