{
    "title": "How to know if you're good to audition for a K-pop group - Quora",
    "tags": [
        "Auditions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Visa Vachirawich",
                "href": "/profile/Visa-Vachirawich"
            },
            "answer_text": "VISUALS. Ok everyone knows that there are ‘ugly’ idols and ‘gorgeous’ idols. But at the end of the day, the ‘ugly’ ones are still really, really good looking. Yeah so make sure that you’re more or less visually appealing and you’re 10% safe.ASIAN BLOOD. Yes. I mean it. If you’re full white/black/hispanic/european (no racism pls don't attack) then I really think the idol life isn’t cut out for you. There have been 3 (known) non-Asian idols and they didn't really make it that far into their career. One of the 3 (a male idol) didn’t even get to debut. Another one was only put in the group because the company wanted to show their racial diversity, and she barely got center chreography (or lines), and not to mention she wasn’t treated very pleasantly either. The group was (more or less) a flop. If you wish to know the group, it’s RANIA (previously BP RANIA, but they were renamed after the non-Asian girl left). So if you’re non-Asian and wish to be a k-idol, do be prepared to face racism and discrimination in DPRK S.TALENT. This too. But of course the musical aspect is pretty vague as anyone can speak a little quickly in a ‘nice’ accent, get their company to autotune it, and their fans will call it ‘fire’. That ^ is for rapping only. For singing, well it would be awesome if you're not tone deaf, or just really off tune 24/7. You just need to be able to sing a song decently enough. Then again it’s also very generic as both vocals depend on what company you want to join and what they focus on (talent, visuals etc.).A little extra for you: NO KOREABOOS. Yeet. Don’t go into the audition going like “annyeonghaseyo, _______ imnida.” or “kamsahamnida”. jeez. Just no. The company won't appreciate it, and whoever is monitoring the audition may think you’re just a wannabe, or even worse, a disrespectful person. Just speak in your native language. Don't worry! Nobody’s going to judge you, just give it your all!ETIQUETTE. Need I emphasise?",
            "date": "Answered September 6, 2018",
            "views": "262",
            "upvotes": " View 142 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rayssa Souza",
                    "user_href": "/profile/Rayssa-Souza-2"
                },
                {
                    "user_id": "JASHIBEN RATHOD",
                    "user_href": "/profile/JASHIBEN-RATHOD"
                },
                {
                    "user_id": "Aksh Aksh",
                    "user_href": "/profile/Aksh-Aksh-31"
                },
                {
                    "user_id": "Catherine Wanja",
                    "user_href": "/profile/Catherine-Wanja-2"
                },
                {
                    "user_id": "Shujing Prado Learreta",
                    "user_href": "/profile/Shujing-Prado-Learreta"
                },
                {
                    "user_id": "M Leeladharan",
                    "user_href": "/profile/M-Leeladharan"
                },
                {
                    "user_id": "Lawmi Ralte",
                    "user_href": "/profile/Lawmi-Ralte-4"
                },
                {
                    "user_id": "Ri Rin",
                    "user_href": "/profile/Ri-Rin-6"
                },
                {
                    "user_id": "Christine Murray",
                    "user_href": "/profile/Christine-Murray-4"
                },
                {
                    "user_id": "Venessa Ebbi",
                    "user_href": "/profile/Venessa-Ebbi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashlyn Ross",
                "href": "/profile/Ashlyn-Ross-12"
            },
            "answer_text": "First off you need to have confidence in yourself that you will do good. Next make sure you’ve got the look of a idol (try to make yourself noticeable). Practice ur singing and dancing if that’s what ur passion is. Overall be yourself don’t try and fake who you are just to be apart of a kpop company ",
            "date": "Answered November 12, 2019",
            "views": "864",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diveen Lee",
                    "user_href": "/profile/Diveen-Lee"
                },
                {
                    "user_id": "Daniela Teodor",
                    "user_href": "/profile/Daniela-Teodor-1"
                },
                {
                    "user_id": "Ur Cutie",
                    "user_href": "/profile/Ur-Cutie"
                },
                {
                    "user_id": "Shevaun Krans",
                    "user_href": "/profile/Shevaun-Krans-1"
                },
                {
                    "user_id": "Ljaneue Adibac",
                    "user_href": "/profile/Ljaneue-Adibac"
                },
                {
                    "user_id": "Melody McCabe",
                    "user_href": "/profile/Melody-McCabe-1"
                },
                {
                    "user_id": "Elizabeth Flohr",
                    "user_href": "/profile/Elizabeth-Flohr"
                }
            ]
        }
    ]
}