{
    "title": "How has technology changed our lives? - Quora",
    "tags": [
        "Change and Changing",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hope Mogale",
                "href": "/profile/Hope-Mogale-1"
            },
            "answer_text": "Technology is very powerful and nothing is as good as technology at improving life. Even though this is both good on paper and on the surface there are drawbacks to this. Technology can affect life both positively and negatively. New technology always changes our life very much and takes it to a new level. It is like the new way of thinking or doing the normal things differently, better and much more faster with less hassle and at a much affordable rate. Imagine life before Electricity, Life before the Automobile, life before the Telephone, life before the Computer, life before the iPhone. Before those technologies life was much less complex but it was at the same time very difficult to get many things done with just the twelve hours of visible light that we are given with each day.  As illustrated in the figure, Technology evolves, as as it evolves there more we find more convenient ways to get many things done in a day without too much hassle and this is one of the great benefits of having new technology. To fully answer your question i shall state an answer with both pros and cons that are backed by evidence of existing facts of how new technology affects our life both positively and negatively. New Technology Improves quality of life for human beings and as a side effect it makes it complex and have a negative effects on the environment.PROS: Without technology life would be very difficult and behind. Technology has brought many great things such as the ability to have light during night by using what we call Electricity. Let us use electricity as an example, Electricity alone has taken life on earth for human beings to another dimension. Imagine how bad your day can be and how your life gets stuck if there is no electricity just for four hours. Electricity is the most versatile energy source on the planet, even though we’ve only depended on it for about 100 years now. Its been only hundred years and look how improved life is as compared to 5 centuries ago. So imagine if we had been depended on it from the very start, Life would have been very very much better... People like Newton, Galelio, Maxwell, Gauss, Kepler and others would have developed far more better tools that make life better for all human beings. Imagine a 1000 years with electricity? Life would really be in a different dimension… I wish i could live to witness that. Technologies such as computers, laptops, tablets and smartphones make it easy for human beings of today to exchange information, make faster decisions, interact socially, get entertainment, process financial transactions efficiently, buy online, manage homes and other existing technologies. This has made it much more efficient to travel because cheap air tickets can be purchased at a press of a button, an Uber cab can come collect you at your own time no more waiting. There is a cheap way of connecting with friends and family through social media and now you don’t have to remember people’s birthday because social media can always remind you. Technology unlocks life that was unimaginable. Life that only existed in people’s dreams. As Einstein once put it imagination alone is too powerful. Technology is the reflection of people’s imagination on solving existing problems. These problems pushes human beings to transform their imagined ideas to solving these problems into technological innovations which as a result improve life. For more on this see my answer to this question - Have we reached the limit of technology? CONS: However, as much as electricity has brought too much convenience to the lives of human beings on earth it has also complicated it in a way. There is too much dependency on electricity and as a result there is overuse of electricity and since most of electricity is generated through natural gas. Too much use of natural gas has a net effect on the earth’s climate system. This is really bad because it means the next generation of human beings may not find the earth as green as it is today.  Also electricity has led to complexity of many tasks. Today the average human being does not want to do laundry with hands but wants a machine to do that, same goes for warming food with a microwave oven, exercising on a treadmill, using a dishwasher to wash dishes. Walking around the city on foot is no longer easy one has to obey robot signs and etc. These things were made to make life easy for human beings however, if you do not have them or afford them life can be difficult and very complex for you as a human being because things are longer done the manual way. Lastly, new technologies such as the Smartphones, Laptops, Tablets have negative effects on the environment and on the balance of life though they are meant to make life great. If you can’t afford these technologies your life becomes very backward. Technology also give too many options to choose from which can sometimes make life of a person very difficult.  Also most of computer technologies of today have a bad footprint on the environment because they expire after some time creating hazardous electronic waste or e-waste. Also the net energy required to create these technologies and also to transport them across the world also increases and contributes to the total pollution of the earth. In summary: New technology brings new qualities to the lives of human beings but also has a side effect. What i have noticed is that usually human beings tolerate this side effect for as long as it takes until that current new technology becomes irrelevant and again new technology has to be invented. I once read something that once said, Make something that will make people believe they are thinking and they will love you forever, but if you make something that will make people think then they will hate you. So in simple words, New technology can improve life both positively and negatively. STATISTICS:TOTAL TIME SPAN BY AUTHOR - 3.5HRSTOTAL TIME TO READ - ~5MinTOTAL NUMBER OF WORDS - 1,025TOTAL NUMBER OF SYLLABLES - 1,492MEAN CHARACTERS PER WORD - 4.68VOCABOLARY STRENGTH - JUNIOR HIGH Sunshine all the time makes a desert - Arabic Proverb ***All images are intend for illustration purposes only. No copyright infringement intended. —Hope Mogale ",
            "date": "Updated December 29, 2017",
            "views": "2418",
            "upvotes": " View 178 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Meriba Shadap",
                    "user_href": "/profile/Meriba-Shadap"
                },
                {
                    "user_id": "Ashley Judd Beran",
                    "user_href": "/profile/Ashley-Judd-Beran"
                },
                {
                    "user_id": "Artmesia Art",
                    "user_href": "/profile/Artmesia-Art"
                },
                {
                    "user_id": "Kangyu Zhao",
                    "user_href": "/profile/Kangyu-Zhao-1"
                },
                {
                    "user_id": "Zaire YT",
                    "user_href": "/profile/Zaire-YT"
                },
                {
                    "user_id": "Nathan Pimentel",
                    "user_href": "/profile/Nathan-Pimentel-7"
                },
                {
                    "user_id": "Gamingtech 1",
                    "user_href": "/profile/Gamingtech-1-1"
                },
                {
                    "user_id": "Rachel Kiaora Santos 0939022",
                    "user_href": "/profile/Rachel-Kiaora-Santos-0939022"
                },
                {
                    "user_id": "Jeza Macairap",
                    "user_href": "/profile/Jeza-Macairap"
                },
                {
                    "user_id": "Mariden Lorezo",
                    "user_href": "/profile/Mariden-Lorezo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stjepan Marku",
                "href": "/profile/Stjepan-Marku"
            },
            "answer_text": "In my opinion, some of the ways that technology is changing the way we live is by reducing the TIME we spend to create articles or even letters that we have to hand write or use a typewriter to type up and send via envelope (mail). These options take days for one party to send and for another party to receive. It is much easier and more time effective to send an email or a text message in order to notify a party of your choice For any reason. Instead of going to a library to read through as many books as they have available to find information on a certain matter may take a couple days. It is much easier to grab your smart phone pull up the Internet browser and search your question and find the answer. Simply just like this opinion based article. Once it again, this technology is a TIME saver. The information that we can pour is incredible we could be anything from private information all the way to public information. We can share with the world what we see at a particular moment instantly & we can keep the world around us updated no matter what we do, see or hear. We can receive feedback from our peers within a blink of an eye. We can also shop for everything and anything we want with click of a button. Better vehicles are created each and every year that are safer and generate more miles per gallon which is better for the environment. Also it helps reduce gasoline consumption and oil consumption so that I can last longer. We are also creating electric vehicles that can run on one charge just as a vehicle can that is gas powered. The GPS that the vehicles & smart phones have today are amazing. Farming equipment has also become a lot more up to date in order to help at farmers know when to plant their crops and also help them harvest their crops.The machine are used today is incredible it has GPS is only out of their field and your property lines which they can work late hours gathering everything up without having to exert too much energy. This means more crops faster delivery and more products to reach more people around the world. Technology has given us more time and has provided us with more options on educating oneself much faster and more efficiently than without the piece of technology. Convenience is also a very big product that we are all trying to utilize today, which convenience also turns into time management and time management turns into higher profits if one person is a businessman or an entrepreneur. ",
            "date": "Answered March 19, 2019",
            "views": "74",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arjie Pollescas",
                    "user_href": "/profile/Arjie-Pollescas"
                },
                {
                    "user_id": "Furqan Tarique",
                    "user_href": "/profile/Furqan-Tarique-1"
                },
                {
                    "user_id": "Ryan Dad",
                    "user_href": "/profile/Ryan-Dad"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}