{
    "title": "How do singers come up with their stage names? - Quora",
    "tags": [
        "USVP Companies",
        "Startup Names",
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arjun Asthana",
                "href": "/profile/Arjun-Asthana"
            },
            "answer_text": "Coming up with a stage name should not be that difficult. Its often based on some name you were associated with as a child, a nick name or something based on your personality. These are some common ways to help you come up with your stage name: An altered version of your real name. Eg: Edrisa Musuuza->Eddy KenzoOmitting the middle name. Eg: Taylor Alison Swift -> Taylor SwiftCommon noun: Example: Passenger, The Weeknd2 Common nouns put together: Eg: Knife Party, Flying Lotus1 Unique word. For example: Avicii, Skrillex, Stromae1 word + Number/Sp Character: For example: 50 Cent, 2 Pac, 2 Chainz, Ke$ha",
            "date": "Answered August 29, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdeali Motarwala",
                    "user_href": "/profile/Abdeali-Motarwala-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlo Mazzini",
                "href": "/profile/Carlo-Mazzini"
            },
            "answer_text": "I have one, which I barely use, but I love it and I’d love to use it more often: Pedro Cucaracha I love the name, hahaha! Nothing can be more latino than “Pedro”, and “Cucaracha” is because I tell people my power animal is not the wolf, or the dolphin or the eagle, but the cockroach: The mighty survivior of the urban jungle. So, combine both and you have a name that doesn’t match at all with my stile of music (hard rock/heavy metal). But it sounds funny as hell, and I love funny! By the way, I’m not a singer, just a humble bassist. But here are some stories I’ve heard (to be confirmed):  “Sting” got his nickname from a shirt he used to wear which was of clack and yellow striped, and people told him he looked like a wasp.  “Bono” adopted his nickname from a microphone brand, “Bono Vox”. He loved it and adopted it as his stage name.  That’s as far as I know. ",
            "date": "Answered May 9, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mert-Han Harry",
                    "user_href": "/profile/Mert-Han-Harry"
                }
            ]
        }
    ]
}