{
    "title": "How to make music, and how do I write lyrics - Quora",
    "tags": [
        "Songwriting",
        "Music Composition",
        "Music Production",
        "Song Lyrics",
        "Music Industry",
        "Writing Advice",
        "Musicians",
        "Songs",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yoofy Byney",
                "href": "/profile/Yoofy-Byney"
            },
            "answer_text": "Give me a few minutes of your time and I'll teach you. At age 12, I did something: I put new words on old melodies from someone's music and sang it to my friends. No instrumental accompaniment but they loved it. Made me happy. And confident too. So I tried doing the same thing with other songs but I couldn't. And when I could, they didn't sound as amazing as the first one I had “composed”, “arranged”😅😅. A year later, I “discovered” how rap worked. My 13 year old brain realised that all I had to do was to put words that sounded the same at the end of each sentence. That at least two to four sentences had to have words that sounded similar. I'll later find out that they were called “rhymes”. Growing up, music was one of those things I liked to do. I listened to lots of songs by different artistes. Different genres. Country music, Ghanaian highlife, Blues, some Jazz, Hip-hop, Ghanaian hiplife, Gospel music, Reggae, etc. I'd learn to sing my favourites too. Cassette tapes were the thing so I had to rewind tapes in order to write the song lyrics down and get the melody right. But I never thought I'd become a musician or learn to play a musical instrument. I completed my secondary school education in 2004. That allowed me to have a lot of time to write lots of rap. My curiosity made me ask the same question you're asking “how do I make music?” I thought I had the lyrics figured out at least. Lol. So I enrolled in a mediocre music school. They taught me some basic music theory. And although I didn't have a saxophone, the school had one that all the students who didn't have their own instruments used. I started learning how to play the alto saxophone. Sadly, after five months I left the music school. Why? I was sent out to run errands all the time, I wasn't being taught the music I'd come to learn. I used the school fees my mum had given me to buy a guitar. No I didn't buy a saxophone. The guitar cost $4 (20ghs) at the time. Unbelievable, right? My school fees was four dollars too. Lol. The guitar was very bad. It had the biggest string to fretboard action in the world but at the time, without any knowledge about guitars, I loved my $4 guitar. I quit learning saxophone because the instrument was so expensive my mum couldn't have afforded it. Long story short, I taught myself how to play guitar by using what was available online, learning music theory online and practising everything I learnt by writing a song with it. For example, if I learnt about minor chords I wrote a song with at least one minor song in it. I'm sure there might have been YouTube back then but sadly I didn't watch any videos on how to play guitar. I listened to songs and tried playing accompaniment, found the key of the song and came up with a solo or improvise on the chord progression. Believe me, I failed so many times I still don't know what kept me going. Maybe the guitar killed off the boredom or maybe I just wouldn't give up. I would eventually go off to the university to study music and although I didn't like some of the courses I had to take, I believe they influenced how I understood music, songwriting and overall musicality/musicianship. I'm still on the journey to master how music works and perfect my lyric writing skills. I think it takes a lifetime. And it's worth it. It may seem like I haven't answered your question, right? I'm going to show you that indeed I have. You see, an online search can give you innumerable websites that will show you how to make music and how to write lyrics however, I hope my story tells you something everyone or most learning resources out there may forget to add. Learning how to make music and how to write lyrics is a journey. It's not like learning how to install Quora on your new phone. You can't get better in a day. There will still be a lot more to learn even after 10 years. And it will be worth it. So yeah: Listen to the songs others have written. Ask yourself why you like it or why you don't. You may download the sheet music for the song and find out what they're really made of.Learn a musical instrument. Preferably piano or guitar.Learn music theory and music notation. Music has elements: pitch (melody and harmony), rhythm ( tempo, meter, and articulation) timbre, texture, text and dynamics. Review what others have done since the medieval times. It's a whole universe. Music theory is a map and you decide where to go. Remember that there was music before music theory. You don't have to be able to read music fluently to appreciate music. But you need to at least be able to understand which elements the writer is manipulating when you see the sheet music.Write songs. They may be awful in the beginning but write anyway. Sing them to friends and family. They may be kind or they may be truthful. I hope they're truthful. Record yourself performing your songs. Keep on writing new songs. Don't stop.Music is never created in a vacuum. Learn to put your values, beliefs, life lessons, advice, sexuality, etc in your music. Never be afraid that people won't like your songs. Some people don't even like themselves. Music is personal. It's a gift of your amazing self that you offer others don't hold back. Your music should be an extension of your personality.Share your songs, lyrics with the world every once in a while.All the above work only if you persevere. You're going to find out how to make beautiful music and how to write amazing lyrics only if you keep at it even when it feels like giving up. Determination. Perseverance. Tenacity. Practice, practice, practice. ",
            "date": "Answered April 6, 2020",
            "views": "133",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krystyna Black",
                    "user_href": "/profile/Krystyna-Black-1"
                },
                {
                    "user_id": "Sankaran CB",
                    "user_href": "/profile/Sankaran-CB"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milan Purohit",
                "href": "/profile/Milan-Purohit-2"
            },
            "answer_text": "There Are Many Many Answers To This One… But The Most Important one is That You Can Learn To Make Music. You can learn How To Make Beats and Write Lyrics but to do that YOU NEED TO BE REALLY HONEST TO YOURSELF. YOU NEED TO DO IT WITH ALL YOUR HEART IN IT. PUT YOURSELF IN AN ENVIRONMENT WHERE THERE'S NO DISTURBANCE AND YOU CAN THINK OF EACH AND EVERYTHING RELATED TO WORLD, NATURE AND THINGS WHICH HAD HAPPENED WITH YOU, THEN ONLY YOU CAN WRITE MEANINGFUL LYRICS AND MAKE AMAZING HEART TOUCHING MUSIC. USE GOOD QUALITY CONDESNER MICs RECORDING SOFTWARES, MUSIC INSTRUMENTS AND A QUIET PLACE TO RECORD YOUR MUSIC. PLAY IT AGAIN AND AGAIN. LISTEN TO IT CAREFULLY, FIND YOUR MISTAKES AND DO THE CORRECTIONS. MAKE IT AWESOME THAT IT REACHES AND RELATES TO EACH N EVERYONE WHO LISTENS TO IT. PEACE ✌️❤️ ",
            "date": "Answered April 6, 2020",
            "views": "21",
            "upvotes": " Answer requested by Amogh K"
        }
    ]
}