{
    "title": "How much does licensing a song for a sampling cost? - Quora",
    "tags": [
        "Music Licensing",
        "Sampling (music)",
        "Licensing",
        "Costs",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mika Busch",
                "href": "/profile/Mika-Busch"
            },
            "answer_text": "I would ask yourself a few questions. **** Disclaimer: I am not a lawyer. A) Do you honestly expect yourself to profit from this sampling? B) Do you really think the artist in question will even notice you? C) Do you think they will care? D) Are you trying to steal their work? Have you ever watched Youtube videos of remixes of songs by pop stars like Britney Spears and Justin Timberlake? Some DJs have made a name for themselves this way. The artists don’t care… it’s free promotion and helps reach an audience they might not normally reach. It makes them seem cool. I believe Lady Gaga has even released a compilation of unsolicited remixes of her songs. Some people are cool like that. Even arseholes like Metallica, who used to brag about how ‘tape sharing’ built their fan base but then, when they became pop stars, started suing bootleggers… if you aren’t making money off the song, the most they can do is have their lawyers send you a ‘cease and desist’ letter. They can’t sue you for money they lost if you didn’t make any money. **** Again: Not a lawyer. But there’s the common sense rules. Is your sample a tribute or an attempt to fool people into thinking you came up with a certain guitar riff? Are you trying to get rich off someone else’s artistic work? If not, I imagine you’ll be good. But for more information… How Long Can a Sample Be Before You Need Copyright Permission? Just remember to credit them in the liner notes. 8 ) ",
            "date": "Answered November 8, 2019",
            "views": "187",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dev Ven",
                    "user_href": "/profile/Dev-Ven"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "Sample licenses cost anywhere from nothing to $100,000 or more. It depends on the sample source, how well known it is, what your planned usage is, and a million other factors. Unfortunately, there is no standardized pricing scheme or public listing of past license deals. Every sample license gets negotiated in private from scratch. The best thing to do is consult a sample clearance service or entertainment lawyer and try to get an estimate. Or you can try sending an email to the record label and ask. ",
            "date": "Answered November 9, 2019",
            "views": "227",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mark S. Dunn",
                    "user_href": "/profile/Mark-S-Dunn"
                }
            ]
        }
    ]
}