{
    "title": "How is the K-pop industry so good at marketing? - Quora",
    "tags": [
        "K-Pop Companies",
        "Pop Music",
        "K-Pop Idols",
        "Music Industry",
        "Digital Marketing",
        "K-Pop",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kazumi Hatake",
                "href": "/profile/Kazumi-Hatake"
            },
            "answer_text": "Mostly because they know what fans want and take a lot of input from them and do lots of research. Examples of how it’s better (marketing wise). K-pop industry v.s Western pop music industry. In K-pop there’s Music VideosThe music videos are produced of very high quality and are also very beautiful.AlbumsAlbums come with photocards of a member, random so some fans might buy more albums to get their favorite members’ photocard. Albums have a photobook, CD, and sometimes stickers and/or posters.Idols’ AppearanceApart from how good-looking they’re made out to be, they aren’t as “real” for lack of a better term, as Western artists. The company controls every interaction they have with fans/other people and how/where they appear, on which shows, when they can do lives, etc. And they know there is a code that they have to follow on how to act. No cursing, no talking about controversial topics, etc. (Of course, some idols may do these things anyway)No datingThis actually in a way sort of encourages saesangs (obsessive fans) and toxicity. By enforcing a no-dating rule for idols, it makes them more marketable towards fans. (kinda messed up)Light Sticks (or is it lightsticks?)K-pop groups have lightsticks, literally these sort of sticks that light up that they can buy (at rather expensive prices *cough*) to take to the groups’ concert and use to show their support. Lightsticks are unique to each group.Official fandom namesNot sure about in Western industry, but each group’s fans have their own unique and official fandom name as announced by the group’s company/management.And yeah! That’s the reason as well as some examples. Here are some pictures of lightsticks, to clarify. EX: BigBang’s Light Stick  Ex: BLACKPINK’s Light Stick (cool feature: it squeaks when you hit it)   Ex: BTS’ Light Stick (cool feature: you can get the app on your phone and it syncs to your lighstick. you input your seat number/info for concerts and they can control the lighsticks during the concert, see 2nd pic)   [Yes, that’s right, all those lights are from army bbyongs (lightsticks)] ",
            "date": "Answered May 13, 2020",
            "views": "196",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Denzie Bautista",
                    "user_href": "/profile/Denzie-Bautista"
                },
                {
                    "user_id": "Lilly James",
                    "user_href": "/profile/Lilly-James-96"
                },
                {
                    "user_id": "Eni Kati",
                    "user_href": "/profile/Eni-Kati"
                },
                {
                    "user_id": "Karen M. Robinson",
                    "user_href": "/profile/Karen-M-Robinson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ava Maddock",
                "href": "/profile/Ava-Maddock-3"
            },
            "answer_text": "Well it’s not just a one year thing, kpop companies map out everything, their a huge factory. It starts off with the auditions, kpop companies chose the most good looking talented person! Companies like Sm, BIGHIT, YG and JYP have an admission rate of 1/1000 because of these strict auditions. These idols are then forced into contracts to keep them with the company, however companies can cut the idol off at any time. Ok let’s say these said idols make it through the training period, these trainees are ready for debut congratulations, these idols are plastered on every magazine and every wall, letting everyone know of their debut. Some idols will do busking on the streets of Korea to let people know of them more. Once the idol has debuted they are sent to variety shows (a lot) given tours and shows, fan meets and fan signs, go to award shows, go to red carpet events, model, act you name it they do it all. Then they have light sticks and fan merchandise a money making powerhouse as they are considered an “essential” to any kpop fan So these are a few things that make kpop so successful ",
            "date": "Answered May 12, 2020",
            "views": "81",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denzie Bautista",
                    "user_href": "/profile/Denzie-Bautista"
                },
                {
                    "user_id": "Lucas Senares",
                    "user_href": "/profile/Lucas-Senares"
                },
                {
                    "user_id": "Karen M. Robinson",
                    "user_href": "/profile/Karen-M-Robinson"
                },
                {
                    "user_id": "Kris Hwang",
                    "user_href": "/profile/Kris-Hwang-4"
                }
            ]
        }
    ]
}