{
    "title": "How do music royalties work? - Quora",
    "tags": [
        "Music Royalties",
        "Royalties",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jace Johnson",
                "href": "/profile/Jace-Johnson-79"
            },
            "answer_text": "A very basic explanation: Song is created. Whoever wrote the song and created the melody owns the composition rights.Song is professionally recorded in a studio. The final recording is known as the master version. Whoever owns the recording owns the master rights. Usually it's the music label, not the artist.To play a song publicly or commercially, you need a music license. If you've ever heard music playing in a store, in a commercial or on the radio, the company that played it had to pay a music licensing fee. They pay it to a middle-man company who collect all the fees. Or, in the case of big companies like Apple or McDonald's using songs in their commercials, they probably request the song from the label and pay them directly.The 3rd party company collects all the money it received and gives it to the music label (or whoever owns the master rights).Music label sends a check to the artist. How much that check will be depends on their contract. Could be anything from 1% of the royalties to 100%.Example: Mariah Carey's “All I want for Christmas Is You\" is one of the most played songs around the Christmas holiday. It's played all over the radio, in stores, on TV, on streaming services, etc. In the UK alone, it was reported that she makes $500,000 a year in royalties. So all over the world she must be recieving a check for millions of dollars every year. It's estimated that she's made $60 million from the song since its release. ",
            "date": "Answered October 7, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glen Sears",
                "href": "/profile/Glen-Sears"
            },
            "answer_text": "Short answer: Depending on how a song is used, certain licenses are required by law that in turn demand royalty payments for the use. Some of these amounts are set by the government, some are set via direct arrangements between companies. Long answer: For our purposes here, when a song is used there are four major licenses that might be required (in various combinations) for that use: Master recording licenses for the actual recorded version of the songMechanical (composition) licenses for the underlying melody, arrangement, and lyrics of the songPublic performance licenses for the non-personal “performance” of the songSynchronization licenses for the use of a song attached to moving picture (ie., in a commercial, movie, or game)As a for-instance, on-demand streaming (like Spotify) requires a master license, mechanical license, and performance license. Spotify, Apple Music, or any on-demand service needs to acquire these licenses in order to deliver a song to their users. Whatever the use, these licenses are always required. There are a few very specifically-enshrined exceptions in the Fair Use clause (education and news reporting, for instance), but if you are using someone’s intellectual property — you need a license. Royalties are merely the name for the payments associated with that licensing contract. ",
            "date": "Answered September 21, 2016",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danel Fentone",
                    "user_href": "/profile/Danel-Fentone"
                },
                {
                    "user_id": "Etan Yravas",
                    "user_href": "/profile/Etan-Yravas"
                },
                {
                    "user_id": "Ashok Basnet",
                    "user_href": "/profile/Ashok-Basnet"
                },
                {
                    "user_id": "Jade Adamenti",
                    "user_href": "/profile/Jade-Adamenti"
                }
            ]
        }
    ]
}