{
    "title": "How popular is noise music? - Quora",
    "tags": [
        "Merzbow",
        "Noise (music)",
        "Experimental Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Leigh",
                "href": "/profile/Adam-Leigh-1"
            },
            "answer_text": "This is a difficult question to answer precisely as a bewildering number of factors come into play. Firstly, of course, pure Noise music isn’t all that popular or widely listened-to. But so much music has elements of noise, in one way or another. And many people may have encountered noise in passing, on compilation albums, out of random curiosity and so on - in other words they have heard Noise music without wanting to repeat the experience. That being said, looking at the Noise tag page on last.fm (Noise music — Listen free at Last.fm ) shows the most relevant artist, Merzbow, has over 84,300 listeners - ie 84,300 individual users of that site have listened to at least one Merzbow track. However the next listed artist, Sonic Youth, have nearly 1.6 million listeners. I’d argue that much, much less of Sonic Youth’s musical output is ‘noise’ compared to Merzbow. Indeed in the list of ‘Top Artists tagged as noise’ on last.fm, most seem to be noisy rock or electronic music as opposed to pure Noise. So Noise itself is an obscure corner of music, explored only by the obsessives, the curious and the odd accidental interloper. But noise as a compositional element is incredibly widespread in many different kinds of music, to a greater or lesser degree. ",
            "date": "Answered January 16, 2018",
            "views": "389",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Parada",
                    "user_href": "/profile/Steven-Parada-1"
                },
                {
                    "user_id": "Chris Pierce",
                    "user_href": "/profile/Chris-Pierce-40"
                },
                {
                    "user_id": "Vincenzo Joseph Frosolone",
                    "user_href": "/profile/Vincenzo-Joseph-Frosolone"
                }
            ]
        }
    ]
}