{
    "title": "How to get background music without vocals for any song - Quora",
    "tags": [
        "Background Music",
        "Soundtracks",
        "Music Production",
        "Music Recommendations",
        "How-to Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Kumar",
                "href": "/profile/Sandeep-Kumar-953"
            },
            "answer_text": "How to remove vocals from a song. Well here are a few ways: If u want absolutely no vocals, its best to download the instrumental versions of the song. The instrumental versions will be mostly recreations of the original song and played and recorded by a musician and then uploaded for sharing/ sellingIf u already have audio files(mp3 ,wav, wma etc) you can use various softwares to pass the song through their filters and remove the vocals and separate the instrumental music. Word of caution: It will not remove the vocals 100%. A shade of the vocal will still remain. Having said that if u want to play karaoke in a party situation the remaining vocals are very faint and nobody will notice. How to do this:Remove The Vocals From A Song Free Software to Remove Voice From Songs VLC PLAYER : I found it easiest to remove vocals from a song using VLC media player which is already a popular player and most people have it on their computer so no need to download any extra software (I use VLC 2.0.2 Twoflower, Get it here VideoLAN - VLC 2.0.2 Twoflower ) Steps: 1.Open vlc player 2.Press Ctrl+P .Preferences window will open up 3. In left lower corner select Show Settings >All 4.Select Audio >Filters 5. On the right side tick the box saying Simple Karaoke Filter Click Save and you are done. Now play any Music and it will remove the vocal from the song Caution: If u want to play everything normally again follow the same steps, untick the option and Save.  You can even have lyrics come on the screen just like on a Karaoke machine. You just need to have a subtitle file (.srt) of the song If u have a subtitle file of the song, well and good. But subtitles cannot be played with audio files normally. To do this, go to Audio > Visualizations >Scope. Now if your subtitle is named same as the audio file, it will automatically start displaying the lyrics. Otherwise Right click> Subtitles> Open file , then select the subtitle file wherever it is locatedIf you dont have it, you can create it if you want it that badly. Download DivXLand Media Subtitler . Google the lyrics for you song and simply copy the text. Open the software ,load the song from your computer, paste the lyrics you copied from the internet. Match the music and the text. You will take around 10 min for the first subtitles then it becomes easy. Once subtitle file is created save it in the same folder as your song. Its very easyHope that was helpful ",
            "date": "Answered January 23, 2017",
            "views": "1398",
            "upvotes": " View 58 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devyn Thomas",
                    "user_href": "/profile/Devyn-Thomas-5"
                },
                {
                    "user_id": "Harun Hajo",
                    "user_href": "/profile/Harun-Hajo"
                },
                {
                    "user_id": "Rahul Choudhary",
                    "user_href": "/profile/Rahul-Choudhary-1492"
                },
                {
                    "user_id": "Idiot Guy",
                    "user_href": "/profile/Idiot-Guy-3"
                },
                {
                    "user_id": "Lekha Poojary",
                    "user_href": "/profile/Lekha-Poojary"
                },
                {
                    "user_id": "Soumya Sri",
                    "user_href": "/profile/Soumya-Sri-10"
                },
                {
                    "user_id": "Praddyumna Durge",
                    "user_href": "/profile/Praddyumna-Durge"
                },
                {
                    "user_id": "Ayyappa Sabbisetty",
                    "user_href": "/profile/Ayyappa-Sabbisetty"
                },
                {
                    "user_id": "Ram Arjun",
                    "user_href": "/profile/Ram-Arjun-14"
                },
                {
                    "user_id": "Jamie McCants",
                    "user_href": "/profile/Jamie-McCants"
                },
                {
                    "user_id": "Shreeya Saravanan",
                    "user_href": "/profile/Shreeya-Saravanan"
                },
                {
                    "user_id": "Geethanjali MohitePoul",
                    "user_href": "/profile/Geethanjali-MohitePoul"
                },
                {
                    "user_id": "Fernando DC Alagoa",
                    "user_href": "/profile/Fernando-DC-Alagoa"
                },
                {
                    "user_id": "Muchintala Sushmith",
                    "user_href": "/profile/Muchintala-Sushmith"
                },
                {
                    "user_id": "Bhavesh Kumar",
                    "user_href": "/profile/Bhavesh-Kumar-196"
                },
                {
                    "user_id": "Rameshwar Narayan Mathur",
                    "user_href": "/profile/Rameshwar-Narayan-Mathur"
                },
                {
                    "user_id": "Alankrit Verma",
                    "user_href": "/profile/Alankrit-Verma-1"
                },
                {
                    "user_id": "Nagaraj Yalakar",
                    "user_href": "/profile/Nagaraj-Yalakar"
                },
                {
                    "user_id": "Arpit Jangoo",
                    "user_href": "/profile/Arpit-Jangoo"
                },
                {
                    "user_id": "Pavan Kasat",
                    "user_href": "/profile/Pavan-Kasat"
                },
                {
                    "user_id": "Samir Mishra",
                    "user_href": "/profile/Samir-Mishra-26"
                },
                {
                    "user_id": "Joseph San Nicolas Sr.",
                    "user_href": "/profile/Joseph-San-Nicolas-Sr"
                },
                {
                    "user_id": "Rubel Mahmud",
                    "user_href": "/profile/Rubel-Mahmud-25"
                },
                {
                    "user_id": "Ritesh Malviya",
                    "user_href": "/profile/Ritesh-Malviya-5"
                },
                {
                    "user_id": "Dinesh KR",
                    "user_href": "/profile/Dinesh-KR-25"
                },
                {
                    "user_id": "Harshit Kaushik",
                    "user_href": "/profile/Harshit-Kaushik-26"
                },
                {
                    "user_id": "Abdul Sumra",
                    "user_href": "/profile/Abdul-Sumra-3"
                },
                {
                    "user_id": "Nitin Kumar",
                    "user_href": "/profile/Nitin-Kumar-525"
                },
                {
                    "user_id": "Fiberhome Cqm",
                    "user_href": "/profile/Fiberhome-Cqm"
                },
                {
                    "user_id": "Sushmit Soni",
                    "user_href": "/profile/सुष्मित-सोनी-Sushmit-Soni"
                },
                {
                    "user_id": "Er. Gurpreet Singh Osahan",
                    "user_href": "/profile/Er-Gurpreet-Singh-Osahan"
                },
                {
                    "user_id": "Jerry Zaky",
                    "user_href": "/profile/Jerry-Zaky"
                },
                {
                    "user_id": "Chan Chan",
                    "user_href": "/profile/Chan-Chan-51"
                },
                {
                    "user_id": "Yashvi Makwana",
                    "user_href": "/profile/Yashvi-Makwana-3"
                },
                {
                    "user_id": "Amit Kumar",
                    "user_href": "/profile/Amit-Kumar-7710"
                },
                {
                    "user_id": "Ravi sai Manohar",
                    "user_href": "/profile/Ravi-sai-Manohar"
                },
                {
                    "user_id": "Peter Reum",
                    "user_href": "/profile/Peter-Reum"
                },
                {
                    "user_id": "Greg Raines",
                    "user_href": "/profile/Greg-Raines-3"
                },
                {
                    "user_id": "Vishnu Ch",
                    "user_href": "/profile/Vishnu-Ch-3"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Sung Anchana",
                    "user_href": "/profile/Sung-Anchana-1"
                },
                {
                    "user_id": "Jason Gordon",
                    "user_href": "/profile/Jason-Gordon-93"
                },
                {
                    "user_id": "Bill Floor",
                    "user_href": "/profile/Bill-Floor"
                },
                {
                    "user_id": "Amy Middleton",
                    "user_href": "/profile/Amy-Middleton-52"
                },
                {
                    "user_id": "Karen Willard",
                    "user_href": "/profile/Karen-Willard-10"
                },
                {
                    "user_id": "Syam Prasad",
                    "user_href": "/profile/Syam-Prasad-61"
                },
                {
                    "user_id": "Aditi S",
                    "user_href": "/profile/Aditi-S-8"
                },
                {
                    "user_id": "Moritz Engelbrecht",
                    "user_href": "/profile/Moritz-Engelbrecht"
                },
                {
                    "user_id": "Sutanu Sankha Ghosh",
                    "user_href": "/profile/Sutanu-Sankha-Ghosh-1"
                },
                {
                    "user_id": "Daniel Popescu",
                    "user_href": "/profile/Daniel-Popescu-18"
                },
                {
                    "user_id": "Saurabh Sinha",
                    "user_href": "/profile/Saurabh-Sinha-63"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Neelam Kewlani",
                    "user_href": "/profile/Neelam-Kewlani-2"
                },
                {
                    "user_id": "Vasisht Raghvendra",
                    "user_href": "/profile/Vasisht-Raghvendra"
                },
                {
                    "user_id": "Prasikshya Mohanty",
                    "user_href": "/profile/Prasikshya-Mohanty"
                },
                {
                    "user_id": "Bhargav Kanjarla",
                    "user_href": "/profile/Bhargav-Kanjarla"
                },
                {
                    "user_id": "Soma Banik",
                    "user_href": "/profile/Soma-Banik-2"
                },
                {
                    "user_id": "Jyothiprakash Sajjan",
                    "user_href": "/profile/Jyothiprakash-Sajjan"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Steer",
                "href": "/profile/James-Steer-2"
            },
            "answer_text": "There are some programs out there that claim to be able to remove elements from a mixed track and isolate them, but in practice they don't tend to work to well. What you wish to do is not yet fully achievable, but there may be some ways to get close depending on the source material. The most common trick to achieve this effect is to remove all information from the track that only exists in the stereo domain, using a trick called phase cancellation. Vocals tend to be placed in the centre of a mix, with instruments panned around the outside. By processing the track so that we can only hear what remains in the centre, we may get a result that consists mainly of vocals. Of course there are limitations to this. Other elements can be left in the centre too. It is fairly common for some of the drums, and bass lines to be in the centre of a mix. After you've removed a lot of the side information though, you may find that using an EQ gets you a lot closer to what you want. In my opinion a far easier way to get the result you want is to play a keyboard (or use a virtual one) along to the singer's melody, and work out what the notes are. This will require a little ear training, but not a great deal. Anyway, back to the phase cancellation trick. How you do it in practice depends on the software you are using. Here is an example of the technique used in logic express:  To find the correct method for your own software, type 'Isolate vocal phase cancellation (name of software)' into YouTube, and you should find a helpful video. ",
            "date": "Answered December 4, 2015",
            "views": "571",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Citevo Karkantoua",
                    "user_href": "/profile/Citevo-Karkantoua"
                },
                {
                    "user_id": "Gurudutt Mallapur",
                    "user_href": "/profile/Gurudutt-Mallapur"
                },
                {
                    "user_id": "Patel Bunty",
                    "user_href": "/profile/Patel-Bunty"
                },
                {
                    "user_id": "Pavan Kumar Nagubadi",
                    "user_href": "/profile/Pavan-Kumar-Nagubadi"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohd Naved Khan",
                "href": "/profile/Mohd-Naved-Khan"
            },
            "answer_text": "The following online sites are the best places to download background music for free. You will not be charged anything so never fall for the tricks of fraudsters out to make commercial gains. You will get the best background music regardless of where you plan to use it. #1. YouTube Audio Library This is the best place that provides access to over 150+ free background music grouped by mood, genre duration and instrument that can be downloaded as 320 Kbps MP3s. You can get it for your YouTube videos and elsewhere. #2. Audiojungle This is another place that you will get background music for free. Most of the musicians who have their music in this site offer it as royalty-free and you can get that from a section of the site labeled \"free files\". They also have monthly offers for top music tracks downloaded for free and you can capitalize on that. #3. Free Play Music As the name suggests, this website charges no fee for music downloaded and it is one that you can visit for all your background music. All the audio files are in the MP3 format but are generally compatible with several other formats. The positive side of this site is that you can search for all files you want to download easily. #4. Brainy Betty This is the right site to get background music specifically if you have PowerPoint presentations to make. That is the main category but there are several others that will open wide your considerations. You might not like it if you want files in any other format other than MIDI since that is the only one recognized here. However, they offer for an opportunity to convert to WAV or MP3 formats. #5. Audionautix You will get all genres of background music to download for free from this site. That is their biggest advantage because your options will not be limited to any genre. Unfortunately, you might get them bothering because they demand that for any music used from the site for whatever reason, you should give them credit which is all about protecting their copyrights. #6. Partners in Rhyme All the music downloadable from this site is free of charge even though they prohibit reselling, posting it for secondary downloading or remix it to distribute again. The only thing they ask in return after downloading the music freely is credits in terms of having the link posted in whatever place you use the music. WAV is the popular format used by the site since most of their songs are loops thus MP3 is totally incompatible. #7. RoyaltyFreeKings This is a great place from where background music is available to download at no cost. Most of their songs are well compatible with a big number of file formats and the site will only seek for credits once you use their tracks. #8. ildebe Even though this site does not offer satisfactory music tracks to download as background music, you will have a good option to consider. They have free music loops for a variety of genres and their formats are fully compatible. #9. GRSites This is the place where you will get any animal sound effect you want for free to use as background music. It is heavily loaded and you will be more than privileged to seek downloads from here. #10. Background Band You will get hundreds of background music from this website and only charge a lifestyle membership fee of $10. You will not be asked to pay for any track that you download from the site. You can use the music for commercial purposes with no restrictions which are the biggest advantage to enjoy for downloading music from this site. Those files are compatible with a wide variety of file formats. #11. TemplatesWise All the music offered at this site is downloaded for free and comes already converted into the MP3 format. That is an initiative they have taken to satisfy customers in advance. The only thing you will do is select the correct music genre, go for a music track under that and download. ",
            "date": "Answered August 7, 2016",
            "views": "362",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Nawal",
                    "user_href": "/profile/Aditya-Nawal-2"
                },
                {
                    "user_id": "Radhika Reddy Kandanelly",
                    "user_href": "/profile/Radhika-Reddy-Kandanelly"
                },
                {
                    "user_id": "Jose Pacheco da Silva",
                    "user_href": "/profile/Jose-Pacheco-da-Silva"
                },
                {
                    "user_id": "Parth Gupta",
                    "user_href": "/profile/Parth-Gupta-369"
                },
                {
                    "user_id": "Pankaj",
                    "user_href": "/profile/Pankaj-877"
                },
                {
                    "user_id": "Purushotham Reddy",
                    "user_href": "/profile/Purushotham-Reddy-148"
                },
                {
                    "user_id": "Rafiya Khan",
                    "user_href": "/profile/Rafiya-Khan-37"
                },
                {
                    "user_id": "Vatsal Chauhan",
                    "user_href": "/profile/Vatsal-Chauhan-28"
                },
                {
                    "user_id": "Shadow Master",
                    "user_href": "/profile/Shadow-Master-91"
                },
                {
                    "user_id": "Anza Shahid",
                    "user_href": "/profile/Anza-Shahid"
                },
                {
                    "user_id": "Smita Kumari",
                    "user_href": "/profile/Smita-Kumari-17"
                },
                {
                    "user_id": "Kirti Negi",
                    "user_href": "/profile/Kirti-Negi"
                },
                {
                    "user_id": "Manish Surana",
                    "user_href": "/profile/Manish-Surana-19"
                },
                {
                    "user_id": "Tony Sam",
                    "user_href": "/profile/Tony-Sam-23"
                },
                {
                    "user_id": "Kanak Manna",
                    "user_href": "/profile/Kanak-Manna-3"
                },
                {
                    "user_id": "Arpita Priya Sanyal",
                    "user_href": "/profile/Arpita-Priya-Sanyal"
                },
                {
                    "user_id": "Rahul Jena",
                    "user_href": "/profile/Rahul-Jena-14"
                },
                {
                    "user_id": "Jeeva Kumar",
                    "user_href": "/profile/Jeeva-Kumar-46"
                },
                {
                    "user_id": "Angela Clayton",
                    "user_href": "/profile/Angela-Clayton-5"
                },
                {
                    "user_id": "Ian Nozza",
                    "user_href": "/profile/Jamie-Nozza"
                },
                {
                    "user_id": "Sohildubey",
                    "user_href": "/profile/Sohildubey"
                },
                {
                    "user_id": "Inga MacLaine",
                    "user_href": "/profile/Inga-MacLaine"
                },
                {
                    "user_id": "Swapnadip Chandra",
                    "user_href": "/profile/Swapnadip-Chandra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edo Amin",
                "href": "/profile/Edo-Amin"
            },
            "answer_text": "As of 2017, an online service called Artificial Intelligence for Sound! can remove vocals for you automatically. I don’t know who these guys are but it sounds to me like it’s a quick route. If you’re interested in DIY, keep on reading my answer. For voice removal (in random order): Combine L with phase-reversed R to monoApply fine-tuned, decisive EQ (e.g., mouse-drawn EQ / notch filter, with lots of DBs)Use Audacity's sampled noise filter (or Reaper’s Reafir VST in substract mode) to remove specific soundsFor voice isolation, the best results I got involved: Resample to a lower frequency, for example 22KHzApply fine-tuned, decisive EQ (e.g., mouse-drawn EQ / notch filter, with lots of DBs) to remove all frequencies that are not within the human voice range; and the specific singer's voice rangeUse Audacity's sampled noise filter or Reaper’s Reafir VST to remove specific sounds (like snare hits)Scan the song to find the most convenient part to sampleIf you end up with too little midrange, use some sort of \"exciter\" filter to rebuild the higher frequencies with harmoniesAt this point, it might sounds like a mess, but In the context of a remix/mashup - cover-up the glitches with effects.",
            "date": "Updated December 23, 2017",
            "views": "409",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Sappal",
                    "user_href": "/profile/Jan-Sappal"
                },
                {
                    "user_id": "Tejas Shukla",
                    "user_href": "/profile/Tejas-Shukla-23"
                },
                {
                    "user_id": "Dalton Morrison",
                    "user_href": "/profile/Dalton-Morrison"
                },
                {
                    "user_id": "Meet Parsana",
                    "user_href": "/profile/Meet-Parsana-1"
                },
                {
                    "user_id": "Tris",
                    "user_href": "/profile/Tris-62"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Zvonimir Ivanov",
                    "user_href": "/profile/Zvonimir-Ivanov"
                },
                {
                    "user_id": "Yves Tumulak",
                    "user_href": "/profile/Yves-Tumulak"
                },
                {
                    "user_id": "Ashley Roberts",
                    "user_href": "/profile/Ashley-Roberts-128"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Deeksha Gangwar",
                    "user_href": "/profile/Deeksha-Gangwar-10"
                },
                {
                    "user_id": "Alexy Chateau",
                    "user_href": "/profile/Alexy-Chateau"
                },
                {
                    "user_id": "Hazell Shaikh",
                    "user_href": "/profile/Hazell-Shaikh"
                },
                {
                    "user_id": "Gurudutt Mallapur",
                    "user_href": "/profile/Gurudutt-Mallapur"
                },
                {
                    "user_id": "Erick A. Fabian",
                    "user_href": "/profile/ファビャン-エリック-Erick-A-Fabian"
                },
                {
                    "user_id": "Matt Carland",
                    "user_href": "/profile/Matt-Carland"
                },
                {
                    "user_id": "Fengyi Chen",
                    "user_href": "/profile/Fengyi-Chen"
                },
                {
                    "user_id": "Dan Weaver",
                    "user_href": "/profile/Dan-Weaver-2"
                },
                {
                    "user_id": "Gareth Michael Jones",
                    "user_href": "/profile/Gareth-Michael-Jones"
                },
                {
                    "user_id": "Sean Holbert",
                    "user_href": "/profile/Sean-Holbert"
                },
                {
                    "user_id": "Kruti Munot",
                    "user_href": "/profile/Kruti-Munot"
                },
                {
                    "user_id": "Heidi Strom Moon",
                    "user_href": "/profile/Heidi-Strom-Moon"
                },
                {
                    "user_id": "Rahul Keerthi",
                    "user_href": "/profile/Rahul-Keerthi"
                },
                {
                    "user_id": "Edouard Gasser",
                    "user_href": "/profile/Edouard-Gasser"
                },
                {
                    "user_id": "Sunil Anand",
                    "user_href": "/profile/Sunil-Anand"
                },
                {
                    "user_id": "Sundar Lakshmanan",
                    "user_href": "/profile/Sundar-Lakshmanan"
                },
                {
                    "user_id": "Balaraman Lakshmanan",
                    "user_href": "/profile/Balaraman-Lakshmanan"
                },
                {
                    "user_id": "Furkan Tunalı",
                    "user_href": "/profile/Furkan-Tunalı"
                },
                {
                    "user_id": "Colin Jensen",
                    "user_href": "/profile/Colin-Jensen"
                },
                {
                    "user_id": "JG McLean",
                    "user_href": "/profile/JG-McLean"
                },
                {
                    "user_id": "Max Yankov",
                    "user_href": "/profile/Max-Yankov"
                },
                {
                    "user_id": "Shuhan (Tony) Jin",
                    "user_href": "/profile/Shuhan-Tony-Jin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miloš Milohanović",
                "href": "/profile/Miloš-Milohanović"
            },
            "answer_text": "TL:DR - Use Chord Pulse and Audacity. I have created some tracks for existing songs:  As well as original backings:  And even some unique compositions: https://www.youtube.com/watch?v=u9l9Ioehnachttps://www.youtube.com/watch?v=fryBPfUTR9s So, if you want to have backing tracks for singing or instruments, follow different YouTube channels (including mine haha) and download Chord Pulse. You can always find backing tracks on YouTube or record your own instruments. You can search for the backing track without a specific instrument or vocals, or you can search for something called master tracks - if a song has bass, two guitars and drums alongside with vocals, you can search for separate master tracks for bass, one guitar, the second guitar and drums, download those with a YT to MP3 converter, then combine them in a software like audacity. You are essentially doing a puzzle and it takes some time but it gives much better results than simply using a software to remove vocals which kills the quality of the overall song. Now, maybe you want to create your own backing tracks with only software. One really good and easy software for that is Chord Pulse. You can choose the chords, tempo and tonality and set it up to be exactly as the song you want. Then you can choose from preset styles which change the instruments. It is really intuitive and easy to use if you have very basic musical theory knowledge. ",
            "date": "Answered September 4, 2017",
            "views": "212",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "S P",
                    "user_href": "/profile/S-P-1474"
                },
                {
                    "user_id": "Jamil Ahmad",
                    "user_href": "/profile/Jamil-Ahmad-42"
                },
                {
                    "user_id": "Sabiha Bagwan",
                    "user_href": "/profile/Sabiha-Bagwan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Ahern",
                "href": "/profile/Joseph-Ahern-10"
            },
            "answer_text": "I have software Karaoke Sound Tools. That’s by Power Karaoke. MTU sells a software called Vogone. I have owned both these programs. I have had good luck with both those, but I haven’t really used them a lot for performances etc. I had a mixer that did the same function real time. Haven’t really used this technology very much. I have software to add words and create cdg (karaoke graphics) On one, only one occasion did I remove vocals from a song, add words to the file, and then use it in a performance. That’s going on about 20 years. And like the other answers indicate, usually the vocal is not 100 percent removed and some of the other sounds are compromised It is just too easy to look for a Karaoke version of a song online. Spanish songs can be searched for using the term “Pista” and Karaoke. Youtube has many of these. Other services can download these for like 99 cents a song. After getting a few SCDG discs and a couple of programs to rip songs off them and play them on my computer, I get the rest of my songs online. ",
            "date": "Answered August 15, 2020",
            "views": "443",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "To add to Jared Brickman's answer: you can't remove vocals or background tracks completely. Some karaoke machines and audio software selectively remove the characteristic frequencies of vocals using EQ, but that doesn't remove them, it just makes them quieter (and makes the remaining track sound strange.) As Jared said, you need acapellas and instrumentals. Very rarely, these will be available through mainstream retail channels like iTunes -- for example, you can legally download a ton of Michael Jackson acapellas. More commonly, you need to find \"white labels\" sold to club DJs, sometimes not completely legally. Another not-so-legal option is to search the web for DJ versions or stems ripped from games like Guitar Hero. I assume that games are the source of the stems on this site: http://www.studiomultitracks.com/ ",
            "date": "Updated March 5, 2017",
            "views": "159",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Tan",
                    "user_href": "/profile/Jordan-Tan-16"
                },
                {
                    "user_id": "Rakshit Johri",
                    "user_href": "/profile/Rakshit-Johri"
                },
                {
                    "user_id": "Patel Bunty",
                    "user_href": "/profile/Patel-Bunty"
                },
                {
                    "user_id": "Krunal Shah",
                    "user_href": "/profile/Krunal-Shah-52"
                },
                {
                    "user_id": "Pavan Kumar Nagubadi",
                    "user_href": "/profile/Pavan-Kumar-Nagubadi"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Farhan Shahid",
                    "user_href": "/profile/Farhan-Shahid-7"
                },
                {
                    "user_id": "Gareth Michael Jones",
                    "user_href": "/profile/Gareth-Michael-Jones"
                },
                {
                    "user_id": "Furkan Tunalı",
                    "user_href": "/profile/Furkan-Tunalı"
                },
                {
                    "user_id": "Mark Jeffrey",
                    "user_href": "/profile/Mark-Jeffrey"
                }
            ]
        },
        {
            "author_info": {
                "name": "S P",
                "href": "/profile/S-P-1474"
            },
            "answer_text": "So, extracting bgm from audio is easy and only one-click-away and at the same time needs luck. A stereo track has some sounds in the center like voice and drum, flute and some parts of regular instruments and bass guitar ; and some sound panned in the sides like the reverbed instruments and reverbed vocals and any audio that is meant to be in the side like someone entering the screen/song from left side while talking,or some other sound. You can only eliminate the vocals and other sounds(instruments included, can't help) that are in the center. Some instruments get eliminated too. And the the reverbed vocals don't get removed bcz their some parts are in the sides. You can visualize and understand it. Software : Audacity ,best open-source DAW ,made by Carnegie Mellon University. No need to wait after downloading Audacity. 1. Go to preferences,then Libraries. There you need to download the two plug-ins : LAME and FFmpeg from Audacity website. Congrats! You are ready. 2. Upload any video or audio. Video better be raw hd and audio better be hq mp320kbps or hd WAV or FLAC. 3. Select any area that needs vocal-removed and go to effect.then scroll down and select \"vocal reduction and isolation\". 4. A tab opens. Select the followings. Action : remove vocals Strength : 0.70 to 1.00.....1.00 will be too dull so I do 0.70. Low cut for vocals : 1.0 High cut for vocals : 24000.0 Listen to preview and if you like the version,click ok. 5. Done. Export the Audio file to WAV file. it takes more space but audio will be lossless. ",
            "date": "Answered April 25, 2019",
            "views": "8",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alok Kumar",
                    "user_href": "/profile/Alok-Kumar-2661"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikir Patel",
                "href": "/profile/Mikir-Patel-1"
            },
            "answer_text": "I think you are talking about karaoke. Try searching karaoke for the song you want on google. You will find ready made karaoke tracks. You can also go for MIDI file for the song but it will not be the same as original. MIDI sounds robotic. Another way is to get a Karaoke generating software. There are many of them available for free. I use Karaoke Sound Tools. Another one is Atomix Virtual DJ, which has a plug-in to block vocals. In this approach you can browse the song in the software and it will produce Karaoke file for you. But it is not efficient. It will work for some songs and will not for some. I'll not get into details because it is very technical and I don't know how much you know. But if you know a little bit about music production on computers then you can do it in one of the DAW. Below is the link that shows how to do that in FL studio.How to Isolate Vocals in Fruity Loops | eHowYou might also find some videos on youtube for FL studio. ",
            "date": "Answered May 23, 2015",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dale Leopold",
                "href": "/profile/Dale-Leopold"
            },
            "answer_text": "You can create your own \"instrumental\" version of most pop songs, as long as you have a stereo MP3 or WAV version of the song, using the free audio editing software Audacity. This link explains how to do it: How to Remove Vocals From a Song Using Audacity | eHow  This technique takes advantage of the fact that on most pop music, vocals are placed front and center in the mix. If a track has the vocals mostly on the left or right channel, rather than centered, the technique will not work. And you may still hear some \"ghost\" vocals, or echo effects that were not centered. But if you're trying to create tracks that you can practice vocals against, or for cheap-skate karaoke, it will work just fine.  ",
            "date": "Answered December 30, 2015",
            "views": "352",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Citevo Karkantoua",
                    "user_href": "/profile/Citevo-Karkantoua"
                },
                {
                    "user_id": "Mihir Gokani",
                    "user_href": "/profile/Mihir-Gokani-3"
                },
                {
                    "user_id": "Moritz Engelbrecht",
                    "user_href": "/profile/Moritz-Engelbrecht"
                },
                {
                    "user_id": "Barry Cole",
                    "user_href": "/profile/Barry-Cole-2"
                },
                {
                    "user_id": "Patel Bunty",
                    "user_href": "/profile/Patel-Bunty"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Danny Hembree",
                    "user_href": "/profile/Danny-Hembree"
                },
                {
                    "user_id": "Avin Sadamate",
                    "user_href": "/profile/Avin-Sadamate"
                },
                {
                    "user_id": "Jenny Leigh Hodgins",
                    "user_href": "/profile/Jenny-Leigh-Hodgins"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Ialuna",
                "href": "/profile/John-Ialuna"
            },
            "answer_text": "If your question includes the use of backing tracks to use as a professional singer or musician, the accepted method is to use backing tracks available through several approved and licensed producers of high quality MIDI Files (MIDIfiles) [1]and MP3 backing tracks. MIDI Files require a dedicated playback device like those produced by M-Live[2], Roland[3], Yamaha[4] and similar respected instrument manufacturers. Using these devices, MIDI Files provide excellent backing tracks and - MIDI Files can be edited to your pitch (key), tempo and instrument selection. Be aware if you play back a MIDI File using your laptop, IOS/Android device’s own sound chip, the results will be poor. MP3 backing track files will play back on any device that plays an MP3 file, be it a computer, cell phone/tablet device and so on. if you are unsure of the difference between a MIDI File and MP3 Backing Track[5], I have written an article to explain. I hope this helps. If you need additional information please send me a message. Footnotes: [1] Professional MIDIfiles at Hit Trax [2] MERISH MIDI File & MP3 backing track players by M-Live [3] MIDI File & MP3 backing track players by Roland Corp [4] MIDI File & MP3 backing track players by Yamaha [5] MIDI Files vs MP3 Backing Tracks blog by John Ialuna Footnotes[1] https://www.MIDI.com.au[2] http://www.MIDI.com.au/hi-tech/[3] Roland - Search[4] Synths[5] MIDI Files vs Mp3 Backing Tracks |MIDI Files Backing Tracks Hit Trax Australia",
            "date": "Answered June 28, 2018",
            "views": "4",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tracey Lock",
                    "user_href": "/profile/Tracey-Lock-3"
                },
                {
                    "user_id": "Zain Alemdar",
                    "user_href": "/profile/Zain-Alemdar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shrey Chakravorty",
                "href": "/profile/Shrey-Chakravorty"
            },
            "answer_text": "There is an 'Effect' in Audacity which lets you remove center-panned vocals. Audacity is an open-source software. P.S. Not every song works with this method, but it's worth trying because it takes very little time and effort. Even if it does not remove the vocals, it definitely reduces the vocal frequencies and makes instruments sound more interesting by changing the mix. There are a few settings you can tinker with. When i am fed up of listening a song over and over again, i do this little trick to make it sound interesting again.   ",
            "date": "Answered July 21, 2014",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Citevo Karkantoua",
                    "user_href": "/profile/Citevo-Karkantoua"
                },
                {
                    "user_id": "Ramees Clt",
                    "user_href": "/profile/Ramees-Clt"
                },
                {
                    "user_id": "Thomas Young",
                    "user_href": "/profile/Thomas-Young-128"
                },
                {
                    "user_id": "Patel Bunty",
                    "user_href": "/profile/Patel-Bunty"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Pooja Kataria",
                    "user_href": "/profile/Pooja-Kataria-5"
                },
                {
                    "user_id": "Rikky Malviya",
                    "user_href": "/profile/Rikky-Malviya"
                }
            ]
        },
        {
            "author_info": {
                "name": "D Love Tap",
                "href": "/profile/D-Love-Tap"
            },
            "answer_text": "Oooh, this one’s tricky. Learn the tricks with a youtube tutorial. I use Ableton, and getting the track ready for remix or karaoke ready as it might be known is a matter of using some filtering techniques: EQ 8 and Difference (under utility), and the reverse is also possible. But first things first, pick a good DAW (Digital Audio Workstation) to produce with and buy a MIDI controller, and then you’re on your way after a few youtube tutorials. They’ll make it much easier than reading this mini-manual/blog. Here’s a link in case you’re curious who’s online teaching this process:  Hope this helps. Check out my remixes on DJ LOVE TAP to see the final results of the process and my upcoming soon to be released tracks. Thanky! ",
            "date": "Answered April 6, 2018",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samiran Chakraborty",
                    "user_href": "/profile/Samiran-Chakraborty-30"
                },
                {
                    "user_id": "ESIKALA PRADEEP KUMAR",
                    "user_href": "/profile/ESIKALA-PRADEEP-KUMAR"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitin K",
                "href": "/profile/Nitin-K-90"
            },
            "answer_text": "It's true that most popular songs have instrumental or karaoke Versions available. Googling will help you. However, this does not happen for all songs. Some songs (which are not very popular) don't have instrumental versions. It's not possible to entirely separate music from voice. There is no separate software available to do this. I have tried to use audacity for some songs and it works rarely. Have a go at audacity. Google for the procedures.  Also, you could request instrumental versions for songs in popular forums.  However, the best bet is you yourself try to create a minimalistic background. ",
            "date": "Answered November 13, 2014",
            "views": "84",
            "upvotes": " Answer requested by Bhargav Kalva",
            "upvoters": [
                {
                    "user_id": "Razasekar",
                    "user_href": "/profile/Razasekar"
                },
                {
                    "user_id": "Divleen Talwar",
                    "user_href": "/profile/Divleen-Talwar"
                },
                {
                    "user_id": "Maheep Isher",
                    "user_href": "/profile/Maheep-Isher"
                },
                {
                    "user_id": "Priya Mistry",
                    "user_href": "/profile/Priya-Mistry"
                },
                {
                    "user_id": "Thomas Pathrose",
                    "user_href": "/profile/Thomas-Pathrose-1"
                },
                {
                    "user_id": "Bhumi",
                    "user_href": "/profile/Bhumi-41"
                },
                {
                    "user_id": "Sandali Mudalige",
                    "user_href": "/profile/Sandali-Mudalige"
                },
                {
                    "user_id": "Juan Felipe Campos",
                    "user_href": "/profile/Juan-Felipe-Campos"
                },
                {
                    "user_id": "Jack Shull",
                    "user_href": "/profile/Jack-Shull-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Curtis",
                "href": "/profile/Ron-Curtis-1"
            },
            "answer_text": "Step 1: Go to Youtube Search “*name of song* kareoke” Step 2: copy URL of the video you found Step 3: type “YouTube to mp3” into Google. Some of the results aren't as good as other. I prefer to use “convert2mp3”.. although, there are random popups like “Update your Flash Player” that you will just have to ignore and close out ofStep 4: paste url and download. ",
            "date": "Updated September 18, 2017",
            "views": "129",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Citevo Karkantoua",
                    "user_href": "/profile/Citevo-Karkantoua"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Faizan Ahmed Bhatti",
                    "user_href": "/profile/Faizan-Ahmed-Bhatti-1"
                },
                {
                    "user_id": "Rikky Malviya",
                    "user_href": "/profile/Rikky-Malviya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Barry",
                "href": "/profile/Dan-Barry-3"
            },
            "answer_text": "It is possible. We originally developed the vocal removal algorithm for Singstar PS3 on the Sony Playstation back in 2006. Since then we've released software which allows you to isolate vocals or any instrument from a commercial mp3. It's available at www.riffstation.com ",
            "date": "Answered February 3, 2013",
            "views": "144",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jill Alphones",
                    "user_href": "/profile/Jill-Alphones"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Tandon",
                "href": "/profile/Rohit-Tandon-13"
            },
            "answer_text": "There are a couple of ways  you can do this.  1. If you are lucky enough to find an instrumental track. Depending on the genre, most electronic music producers release instrumentals along with their singles. Search the internet, sites like Beatport might have them.  2. If you don't have the instrumental, but manage to find the Accapella (that's the vocal track only), you could follow the process explained here.   These are the only two ways I know of ! ",
            "date": "Answered October 4, 2015",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Fox",
                "href": "/profile/Chris-Fox-5"
            },
            "answer_text": "There’s a vast genre known as Ambient Music that pretty much never has vocalists. Try Steve Roach and explore from there. I can’t stand the histrionics that vocalists use now and nearly all music that has the singer’s name on the cover gives me splitting headaches. I listen to a lot of ambient.The diva pop era was torture unless I had a player and earbuds with me. ",
            "date": "Answered October 7, 2016",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick du Plessis",
                "href": "/profile/Nick-du-Plessis"
            },
            "answer_text": "I googled \"how to strip vocals out of a song\" and came up with some very interesting articles. If you are already interested in amateur audio production you have a head start, but it can be done. I recommend this route if you have some obscure songs in mind. Otherwise, go to online karaoke sources as indicated in the other answer. Out of the commercially available software packages, Karaoke Builder looks like the most promising. ",
            "date": "Updated December 30, 2015",
            "views": "205",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeremy Hendricks",
                    "user_href": "/profile/Jeremy-Hendricks-8"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreya Patoa",
                "href": "/profile/Shreya-Patoa"
            },
            "answer_text": "You can go to 1. Audible, try it free - 30 day audiobooks free trial from Audible they have many soundtracks you could use. 2. The YouTube music library with tons of soundtracks accessible from editing portal. 3.Soundcloud.com they have many titles,you might have to do a little bit of effort in searching for the correct ones,because they endorse vocal songs as well. ",
            "date": "Answered January 18, 2016",
            "views": "111",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divyang Khandelwal",
                    "user_href": "/profile/Divyang-Khandelwal"
                },
                {
                    "user_id": "Vishal Pokarne",
                    "user_href": "/profile/Vishal-Pokarne"
                },
                {
                    "user_id": "Nikhil Asrani",
                    "user_href": "/profile/Nikhil-Asrani"
                },
                {
                    "user_id": "Harsh Kamalesh Sanghavi",
                    "user_href": "/profile/Harsh-Kamalesh-Sanghavi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yashas Bvn",
                "href": "/profile/Yashas-Bvn"
            },
            "answer_text": "You can try making Karaoke using this software called Audacity. For most of the songs it must work but not for all songs. And Karaoke(Pronounced Ka-ree-okay) means song without its lyrics! ",
            "date": "Answered July 7, 2014",
            "views": "77",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ethan Hein",
                    "user_href": "/profile/Ethan-Hein"
                },
                {
                    "user_id": "Sk Rania",
                    "user_href": "/profile/Sk-Rania"
                },
                {
                    "user_id": "Ran Ding",
                    "user_href": "/profile/Ran-Ding"
                },
                {
                    "user_id": "Mark Jeffrey",
                    "user_href": "/profile/Mark-Jeffrey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Wonders",
                "href": "/profile/Andrew-Wonders"
            },
            "answer_text": "Well, either search for “karaoke” versions (which will be low quality), or “instrumental version” (usually decent if you’re looking for hip-hop instrumentals). Some rock/metal groups have started releasing instrumental versions of their works, but in general, they are few and far between. Good luck to you. ",
            "date": "Answered March 11, 2017",
            "views": "12",
            "upvotes": " Answer requested by Bilal Hameed",
            "upvoters": [
                {
                    "user_id": "S P",
                    "user_href": "/profile/S-P-1474"
                },
                {
                    "user_id": "Raftaar Muzammil",
                    "user_href": "/profile/Raftaar-Muzammil"
                },
                {
                    "user_id": "Nikhil Parvatikar",
                    "user_href": "/profile/Nikhil-Parvatikar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jared Brickman",
                "href": "/profile/Jared-Brickman"
            },
            "answer_text": "Sorry - that isn't possible. You need to find \"a capella\" tracks if you'd like vocals without background music. For tracks without vocals, look for \"instrumentals\" or \"karaoke\" versions. ",
            "date": "Answered February 7, 2011",
            "views": "65",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sara Kahn",
                    "user_href": "/profile/Sara-Kahn-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viswanathan Sunder",
                "href": "/profile/Viswanathan-Sunder"
            },
            "answer_text": "There is a tool called audacity. You can use that and you will find videos online to filter voice. Like this one :  ",
            "date": "Answered April 6, 2018",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rakesh Verma",
                    "user_href": "/profile/Rakesh-Verma-321"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Kahn",
                "href": "/profile/Steve-Kahn-3"
            },
            "answer_text": "\"Music minus ones\" can be found in various places. Look for \"practice tracks\". There are even some UK-based sites which will record piano-only practice tracks if you can't locate someone locally to do so. In a complete pinch you can enter the piano part into a sequencer and make a track that way. ",
            "date": "Answered August 14, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Rikky Malviya",
                    "user_href": "/profile/Rikky-Malviya"
                },
                {
                    "user_id": "Jasmine Teo",
                    "user_href": "/profile/Jasmine-Teo-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hardhik P",
                "href": "/profile/Hardhik-P"
            },
            "answer_text": "You can look for Karaoke tracks and download them.  But they might not sound authentic. Otherwise you can use music editing software like protools or audacity to remove the vocal track from the sample audio file to get the instrumental portion of the song. Cheers!! ",
            "date": "Answered November 1, 2015",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amit Rao Bhonsle",
                    "user_href": "/profile/Amit-Rao-Bhonsle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Dz",
                "href": "/profile/Mary-Dz-2"
            },
            "answer_text": "You can go to Spotify, SoundCloud, YouTube or a singing app and they have covers or original instrumental versions of songs and on YouTube or SoundCloud you can search karaoke versions of a song or piano versions. :) ",
            "date": "Answered April 6, 2018",
            "views": "577",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fengyi Chen",
                "href": "/profile/Fengyi-Chen"
            },
            "answer_text": "You can use some simple music sttudio softtware like FruitLoop to remove the sound which lower than a special volume to remove the background. Because of the music theory, the volume of vocal should upper than the volume of backgrounds music. ",
            "date": "Answered April 17, 2014",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Allen",
                "href": "/profile/Chris-Allen-31"
            },
            "answer_text": "Great technical answers here, esp. Edo Amin's comprehensive technical treatment. Another good source for acapellas is soundcloud, where lots of popular acapellas can be found to download.   Mind the copyrights, though. :) ",
            "date": "Answered February 10, 2015",
            "views": "187",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Soren",
                    "user_href": "/profile/Joseph-Soren-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sameeyoddin Sayyad",
                "href": "/profile/Sameeyoddin-Sayyad"
            },
            "answer_text": "Its not possible to remove vocal completely but you can reduce the voice. There are some apps on play store that will do the job for you (remember, these apps dont remove vocals completely ) SingPlay: Karaoke your MP3s - Android Apps on Google Play   Thanks. … Cheers….. ",
            "date": "Answered March 25, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Moe Foster",
                "href": "/profile/Moe-Foster"
            },
            "answer_text": "If you have access to an instrumental version of the track, you can employ a technique called Phase Cancellation to create a DIY acapella. However, the results can be of varying quality depending on experience and technique. ",
            "date": "Answered February 7, 2011",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Tripathi",
                "href": "/profile/Abhishek-Tripathi-53"
            },
            "answer_text": "YouTube has ample karaoke songs available.  You can directly download them and for your convenience can convert into mp3 format which you can readily use with your voice.  Hope it helps.  Cheers :) ",
            "date": "Answered November 4, 2015",
            "views": "36",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Keshav Kumar",
                "href": "/profile/Keshav-Kumar-1607"
            },
            "answer_text": "i think you cant find collection for that you have to watch song making on youtube therse is no website like that who will give you this information.and also only few song making is avilable you can watch singer interview there they sing without music  but its impposible to find collection . ty for A2Asorry i couldn't help you ! ",
            "date": "Answered December 11, 2015",
            "views": "5",
            "upvotes": " Answer requested by Patel Bunty"
        },
        {
            "author_info": {
                "name": "Bhargav Sarma",
                "href": "/profile/Bhargav-Sarma-2"
            },
            "answer_text": "Try searching on YouTube for the karaoke version of the song.Other than that, you can use Virtual DJ to attempt to remove the vocals from a song, although it is not always successful. ",
            "date": "Answered March 2, 2016",
            "views": "21",
            "upvotes": " Answer requested by Omprakash Panwar"
        },
        {
            "author_info": {
                "name": "Ivan Peychev",
                "href": "/profile/Ivan-Peychev"
            },
            "answer_text": "Try Audiojungle & don’t forget to check out my fresh releases: s7leven's profile on AudioJungle ",
            "date": "Answered February 9, 2018",
            "views": "519",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rudra Sarkar",
                "href": "/profile/Rudra-Sarkar-8"
            },
            "answer_text": "If you use a guitar pro app.. You can download sheet music and render it to an audio file.. Or you can search it in YouTube.. And get it from there ",
            "date": "Answered May 19, 2017",
            "views": "827",
            "upvotes": " Answer requested by Prabhat Kr"
        },
        {
            "author_info": {
                "name": "Andrae Palmer",
                "href": "/profile/Andrae-Palmer"
            },
            "answer_text": "You have YouTube or you can find the chords and play over the beat. But you can definitely check YouTube even for a karaoke version of the song you looking for. ",
            "date": "Answered January 16, 2018",
            "views": "982",
            "upvotes": " Answer requested by Miloš Milohanović"
        },
        {
            "author_info": {
                "name": "EXTREME SPORT",
                "href": "/profile/EXTREME-SPORT-1"
            },
            "answer_text": "you can get a lot of background music here Background Music No Copyrit ",
            "date": "Answered December 22, 2016",
            "views": "797",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aryan Bajwa",
                "href": "/profile/Aryan-Bajwa"
            },
            "answer_text": "Here is your question's answer How do I get background music without vocals for any song? ",
            "date": "Answered January 13, 2016",
            "views": "72",
            "upvotes": " Answer requested by Apon Konyak"
        },
        {
            "author_info": {
                "name": "Bibin Aby",
                "href": "/profile/Bibin-Aby"
            },
            "answer_text": "Search it on google....type the song name and add the word 'BGM'...you would get a list of results ",
            "date": "Answered June 21, 2016",
            "views": "382",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nguyen Chu Minh",
                "href": "/profile/Nguyen-Chu-Minh"
            },
            "answer_text": "Here is a good channel with peaceful sound that you can choose  ",
            "date": "Answered October 14, 2016",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shabin Nair",
                "href": "/profile/Shabin-Nair"
            },
            "answer_text": "You can get karaoke versions easily from YouTube. ",
            "date": "Answered November 26, 2015",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ishan Priyadarshi",
                "href": "/profile/Ishan-Priyadarshi"
            },
            "answer_text": "search \"song name\" instrumentals ",
            "date": "Answered February 1, 2015",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arijit Das",
                "href": "/profile/Arijit-Das-35"
            },
            "answer_text": "Try mp3skull - Free Mp3 Download ",
            "date": "Answered April 8, 2015",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Kaye",
                "href": "/profile/Ron-Kaye-1"
            },
            "answer_text": "Kareoke-version.com ",
            "date": "Answered April 2, 2018",
            "views": "14",
            "upvotes": " Answer requested by Mohsan Raza"
        },
        {
            "author_info": {
                "name": "Simar Jassal",
                "href": "/profile/Simar-Jassal-2"
            },
            "answer_text": "Pls ans mw ",
            "date": "Answered January 18, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nav Sharifpuria",
                "href": "/profile/Nav-Sharifpuria"
            },
            "answer_text": "November ",
            "date": "Answered January 10, 2017",
            "views": "304",
            "upvotes": "0"
        }
    ]
}