{
    "title": "How to prepare for an audition - Quora",
    "tags": [
        "Auditions",
        "Acting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Metz",
                "href": "/profile/Rebecca-Metz"
            },
            "answer_text": "A2A. It depends on the person and the audition. Let’s assume it’s the kind of audition where I’ve been given sides but no script, and I have about 48 hours to prepare. I will: Read the sides many, many times, keeping an eye out for information and clues that help me understand the story and character and for anything I might want to ask a clarifying question about.At some point, I will highlight my lines.Begin making notes in the script, breaking down the text into beats, noting actions and tactics, etc. These often change and evolve as I get comfortable with the material.Find all the information I can about the project and people involved. Watch samples of their previous work. See if we have friends or professional contacts in common. Get a feel for their sensibility.Think about what I’m going to wear. This is practical, of course, but also helps me get a clearer sense of where I’m going with the character.I like to read over the material right before I go to sleep the night before the audition. When I wake up, I find I’ve done a lot of memorization in my sleep.Record the other character(s’) lines so I can run lines with myself in the car on the way to the audition. This is more about getting comfortable saying the words out loud than about getting the acting right. I don’t like reading with other people, but I also don’t want the audition to be the first time I’ve said the words aloud.Once I get to the audition, my goal is to relax and enjoy the process. I’ve done my homework, my job now is to trust my prep and show the people in the room what I would do with the role. For that few minutes, the character is mine and I get to do whatever I want with it.When I’m done, I ask myself one question — did I do what I wanted to do in the room? If not, I think about what I want to do differently next time. Usually the answer is yes, I call my reps to let them know how it went, and then forget about it. On to the next one!",
            "date": "Answered January 31, 2018",
            "views": "277",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Ward",
                    "user_href": "/profile/William-Ward-50"
                },
                {
                    "user_id": "Peter T Mayer",
                    "user_href": "/profile/Peter-T-Mayer"
                },
                {
                    "user_id": "Laura .",
                    "user_href": "/profile/Laura-971"
                },
                {
                    "user_id": "Patrick Kerr",
                    "user_href": "/profile/Patrick-Kerr-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Parkhurst",
                "href": "/profile/Scott-Parkhurst-2"
            },
            "answer_text": "First of all that’s pretty good that you got that far. Normally to reach a “test shoot” most folks have had to gone through at least a first and second Directors call back. But you say or sound like this is your first time even going in front of an audition “board”? So if this is so, then that’s great too. Just relax and IF they give you a script, it most likely will be just a section of just you and maybe another actor reading together or not, but they just want to see how you “look” and “sound” on camera. And if there is another actor then they are looking for chemistry between the two of you. Just remember one thing, be yourself and show confidence. Also be aware of your body placement and the camera….make sure that you don’t turn your back and or side to it. I just sat through a whole day of doing auditions (48) and the ones that did very well were the one’s who understood body placement and just had fun. I love doing them myself cause I just go in and have fun and know that I’m going to nail them because you have to have that confidence. Hope some of this helped, and good luck and have FUN! ",
            "date": "Answered May 18, 2017",
            "views": "242",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manisha Singh",
                    "user_href": "/profile/Manisha-Singh-1128"
                },
                {
                    "user_id": "Irene Vanessa Vifah",
                    "user_href": "/profile/Irene-Vanessa-Vifah"
                }
            ]
        }
    ]
}