{
    "title": "How to delete my Quora account - Quora",
    "tags": [
        "Account Deletion (Quora feature)",
        "Quora Policies and Guidelines",
        "Using Quora",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikash Kumar",
                "href": "/profile/Vikash-Kumar-129"
            },
            "answer_text": "The best way to quit Quora would be to ask this question with your real name, and then go about making a mockery of every ludicrous quora policy.  Say, \" be nice, be respectful\" policy. Why do you have to be nice to people, why do you have to respect people.  Did they do something to deserve it. Are their views logically,  ethically,  morally correct? If yes, do respect them.  Be nice to them, learn if you can learn something from them.  Now the overwhelming majority would be idiotic.  Either they don't have all the info about something, or if they have they take a stand that is complete antithesis logic.   But before being churlish with those people,  attack their arguments, point out the flaw. So the ethical mirror. If you have done this successfully, either the person would pull out the old trick of \"if you can't attack the argument, attack the person.\"  and that is the best time for you to break that silly, idiotic, anti-constitutional policy of quora : \"be nice,  be respectful\".   Now you get to attack the person yourself. Be as rude as you can be.  That person will surely report that comment,  you will get a message from quora moderation save that as a screenshot.  Re-ask this question, save as a screenshot too. Keep doing it.  It would be fun. A great way to vent your frustration and show those powers that be that you don't let anyone screw with your rights.  And then you know share those screenshots on Twitter. Tag the owner of quora also.  And may be make a hash tag.  P. S.  You should really first put down their argument,  then only should you attack that policy. Otherwise people would think :that you couldn't argue the argument and hence attacked the person. And we definitely don't want that.   Show the fallacies of their argument.  P. P. S : this is only for fun, not to incite some one. Take it in a good humorist way. ",
            "date": "Answered November 4, 2015",
            "views": "255",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Hayes",
                    "user_href": "/profile/Christopher-Hayes-127"
                },
                {
                    "user_id": "Kristina Kampmann",
                    "user_href": "/profile/Kristina-Kampmann-2"
                },
                {
                    "user_id": "Linsey Whitelaw",
                    "user_href": "/profile/Linsey-Whitelaw"
                },
                {
                    "user_id": "Rashmita Patil",
                    "user_href": "/profile/Rashmita-Patil-9"
                },
                {
                    "user_id": "David Thompson",
                    "user_href": "/profile/David-Thompson-298"
                },
                {
                    "user_id": "Kevin Crouch",
                    "user_href": "/profile/Kevin-Crouch-36"
                },
                {
                    "user_id": "Abdul Mohamed",
                    "user_href": "/profile/Abdul-Mohamed-80"
                },
                {
                    "user_id": "Melissa Chapman",
                    "user_href": "/profile/Melissa-Chapman-92"
                },
                {
                    "user_id": "Jeanne Atkins",
                    "user_href": "/profile/Jeanne-Atkins-5"
                },
                {
                    "user_id": "Deepak",
                    "user_href": "/profile/Deepak-2351"
                },
                {
                    "user_id": " Dey",
                    "user_href": "/profile/Dey-39"
                },
                {
                    "user_id": "Chris Smith",
                    "user_href": "/profile/Chris-Smith-3953"
                },
                {
                    "user_id": "Guillermo Alarcon",
                    "user_href": "/profile/Guillermo-Alarcon-5"
                },
                {
                    "user_id": "Shikha Loviyal",
                    "user_href": "/profile/Shikha-Loviyal"
                },
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                },
                {
                    "user_id": "Darryl Schaumburg",
                    "user_href": "/profile/Darryl-Schaumburg-1"
                },
                {
                    "user_id": "Patrick Robertson",
                    "user_href": "/profile/Patrick-Robertson-70"
                },
                {
                    "user_id": "Gleryl Price",
                    "user_href": "/profile/Gleryl-Price"
                },
                {
                    "user_id": "Shashank Bhandary",
                    "user_href": "/profile/Shashank-Bhandary-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Elder",
                "href": "/profile/Jonathan-Elder"
            },
            "answer_text": "This is going to have to be a multi-stage plan: Quora, Inc is already a company with shares. This is good. Unfortunately, it’s not traded on the stock exchange, so this makes it harder. Stage one is locate the shareholders. In my 3-minute research they are held by at least three executives, plus an investment firm. You need to identify them.Next approach them with an offer to buy the shares. You need more than 50% of the shares, so depending on how they are distributed you might need to approach several of them. You need to offer them enough money per share for them to transfer them to you. I have zero idea of how much what would be, but given the involvement of an investment firm, it’s going to be 7 or 8 figures at least.Once you control over 50% of the shares, you need to get rid of the existing board of directors. Quora may need to pay compensation.Appoint a new board of directors that will accept your orders. Tell them to shut the company down and distribute the assets to the shareholders. It’s likely to be far less than you paid, as the share value, especially in tech firms, is normally far more than tangible assets. This is especially true if you want to shut down the biggest asset, the site, making it unsaleable.Be a bit careful with the above. Doing so is clearly not in the interests of the other shareholders, and they have legal protection. You may find yourself sued or otherwise blocked. Best to buy 100% of the shares at a good price. That’s another few tens of millions - possibly even higher as it’s a sellers market.You have shut down the site. And lost tens to hundreds of millions of dollars. Well done you.Addendum The Quora directors and investors, pleased at their ability to build a company and make an excellent profit selling it, go on to set up a new one. Called ‘Query’, it does the same thing as Quora. Because Quora no longer exists it’s able to pick up a lot of the users and traffic, and becomes even bigger. ",
            "date": "Answered November 16, 2018",
            "views": "53",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mcfatfuck Psycho",
                    "user_href": "/profile/Mcfatfuck-Psycho"
                },
                {
                    "user_id": "Sharlia's Playhouse",
                    "user_href": "/profile/Sharlias-Playhouse"
                },
                {
                    "user_id": "Nathan Sheridan",
                    "user_href": "/profile/Nathan-Sheridan-14"
                },
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "Question: How do I quit Quora? I want to cancel my profile and have nothing to do with this. Speech is either free or it’s not. Your thumb is either on the scale, or it’s not. Only a coward is afraid of free and open dialogue. Here’s the First Amendment of the US Constitution: First Amendment Please feel free to point out the part that says a private company has to allow you to say whatever you want to. Even the Supreme Court has never ruled that a private company needs to allow random people to say or write whatever they want in a forum that they control. This is because no charitable interpretation of the amendment would lend itself to stating that. You have freedom of speech, questioner. You can create a blog, post THOUSANDS of Instagrams, tweets, and Facebook postings; you can even stay up late at night making and releasing YouTube videos until you have flooded the site. You can even livestream yourself on several dozen other websites. The government, with rare exceptions, will have no problems, with that and in fact will even allow content which might violate the laws until it’s pointed out to them and they direct the site to remove it. Quora asks that you follow a few basic rules. If you cannot, or simply will not do that, then they MIGHT sanction you. You can also leave comments if you like; however if they insulting, racist, demeaning, or argumentative, the person who answered the question can delete. I know that I do…sometimes HOURLY. Those are the limitations of the site and if you don’t think that you can abide by them, then perhaps you should find someplace to “emote”. Anyway…if you click on photo and go to Settings, it will direct you to the steps necessary to delete your profile. It’s actually pretty easy and it should be over with in a few minutes or so, after they confirm that you really want to do it. You might want to brush up on the whole “free speech thing” as your understanding of it does not seem to match objective reality. ",
            "date": "Answered April 8, 2020",
            "views": "189",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "GenaLynn Booker",
                    "user_href": "/profile/GenaLynn-Booker"
                },
                {
                    "user_id": "Al Schimke",
                    "user_href": "/profile/Al-Schimke"
                },
                {
                    "user_id": "James Benaquis",
                    "user_href": "/profile/James-Benaquis-1"
                },
                {
                    "user_id": "Intisha Yasmin",
                    "user_href": "/profile/Intisha-Yasmin"
                },
                {
                    "user_id": "Saisree Gujjari",
                    "user_href": "/profile/Saisree-Gujjari"
                },
                {
                    "user_id": "Iain Cummings",
                    "user_href": "/profile/Iain-Cummings"
                },
                {
                    "user_id": "James Hershey",
                    "user_href": "/profile/James-Hershey-3"
                },
                {
                    "user_id": "Anup V Shanbhag",
                    "user_href": "/profile/Anup-V-Shanbhag"
                },
                {
                    "user_id": "Chris Tion",
                    "user_href": "/profile/Chris-Tion-1"
                },
                {
                    "user_id": "Victoria Seidel",
                    "user_href": "/profile/Victoria-Seidel-1"
                },
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1379"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Charlie-Boy-53"
                },
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                },
                {
                    "user_id": "Rediet Getahun Mengistu",
                    "user_href": "/profile/Rediet-Getahun-Mengistu"
                },
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                },
                {
                    "user_id": "Heather Kelly",
                    "user_href": "/profile/Heather-Kelly-41"
                },
                {
                    "user_id": "Anirutthan N",
                    "user_href": "/profile/Anirutthan-N"
                },
                {
                    "user_id": "Luke Thomas",
                    "user_href": "/profile/Luke-Thomas-377"
                },
                {
                    "user_id": "Maria Green",
                    "user_href": "/profile/Maria-Green-125"
                },
                {
                    "user_id": "Charlie Johnson",
                    "user_href": "/profile/Charlie-Johnson-245"
                },
                {
                    "user_id": "A Person",
                    "user_href": "/profile/A-Person-1246"
                },
                {
                    "user_id": "Lon Johnson",
                    "user_href": "/profile/Lon-Johnson-4"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                },
                {
                    "user_id": "Valerie Teti",
                    "user_href": "/profile/Valerie-Teti"
                },
                {
                    "user_id": "Lance Nyce",
                    "user_href": "/profile/Lance-Nyce"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-16"
                },
                {
                    "user_id": "Dan Robrish",
                    "user_href": "/profile/Dan-Robrish"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                },
                {
                    "user_id": "Maura Rudd",
                    "user_href": "/profile/Maura-Rudd"
                },
                {
                    "user_id": "Carlos Acosta",
                    "user_href": "/profile/Carlos-Acosta-86"
                },
                {
                    "user_id": "Marion Campbell",
                    "user_href": "/profile/Marion-Campbell-28"
                },
                {
                    "user_id": "Dian Pink",
                    "user_href": "/profile/Dian-Pink-2"
                },
                {
                    "user_id": "Mom",
                    "user_href": "/profile/Mom-154"
                },
                {
                    "user_id": "JD Schaefer",
                    "user_href": "/profile/JD-Schaefer"
                },
                {
                    "user_id": "Harold Sherman",
                    "user_href": "/profile/Harold-Sherman-8"
                },
                {
                    "user_id": "Judy Tallman",
                    "user_href": "/profile/Judy-Tallman"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Mike Lloret",
                    "user_href": "/profile/Mike-Lloret"
                },
                {
                    "user_id": "Donna Kolodziejski",
                    "user_href": "/profile/Donna-Kolodziejski"
                },
                {
                    "user_id": "Sıla Okur",
                    "user_href": "/profile/Sıla-Okur"
                },
                {
                    "user_id": "Mohammed Bala",
                    "user_href": "/profile/Mohammed-Bala-1"
                },
                {
                    "user_id": "Heather Jensen",
                    "user_href": "/profile/Heather-Jensen-31"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Debbie Scott",
                    "user_href": "/profile/Debbie-Scott-210"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-6573"
                },
                {
                    "user_id": "Praveen Gupta",
                    "user_href": "/profile/Praveen-Gupta-776"
                },
                {
                    "user_id": "Tim Dees",
                    "user_href": "/profile/Tim-Dees"
                }
            ]
        },
        {
            "author_info": {
                "name": "Etienne Charilaou",
                "href": "/profile/Etienne-Charilaou"
            },
            "answer_text": "It sounds to me as though you’re struggling to get off despite having limited time and limited resources to stay on. Quora is consuming your valuable time because you stay on far too long, and, of course, it costs you in data. It sounds like Quora addiction (social media addiction). Like me then you have a bit of a problem. I tried to quit for good but came back. Fell off the wagon! There are options to deactivate or delete your account but even doing that won’t stop you from either reactivating your account or signing up again, at some point. Perhaps, though, you don’t want to quit it for good but if you had the time and resources you would continue. In that case, you need to find the time and money to carry on. I’m going to suggest a thing or two which may help you to either give Quora a long break or give it up altogether (if that’s even possible). Turn off email notifications from Quora so that there’s nothing in your inbox to lure you back in. I tried a ‘Quora lite’ by alloting myself an hour daily on Quora and no more, or only replying to comments - didn’t work, once you’re at Quora you will browse, read, and compulsively search for good questions to answer. There will be prompts in notifications from time to time - someone would like YOU to answer their question - how can you refuse? You want to help and be useful or kind - nothing wrong with that, of course but how quickly did you have to decide that you can’t help (answer) every single request that comes your way - too many hours of your day would be taken by it. It’s worth remembering that people ask a lot of people to answer their question. It’s easy for them to click, click but it’s hard for you to take time to compose a good answer. There is interesting stuff to read, don’t get me wrong. Since being on the site will inevitably start the ball rolling the idea then is not to venture onto the website. Stop yourself from logging in - far easier said than done. You can ask yourself: What is driving me to spend inordinate amounts of time on Quora? Now, in my case, it’s pretty much loneliness, and the desire to connect with people - something missing from my offline life. I realize that Quora is not the answer because what’s required is face-to-face stuff. If you manage to find a substitute for Quora to satisfy your desire for company then you may be able to give it up entirely or use it more wisely. So, it’s obvious what you must do but it may be very, very hard to do. You’ve got to stop. Don’t check Quora - stop cold turkey and resist the urge to come back. And be savvy to the rationalizations you offer yourself to come back. ",
            "date": "Updated January 22, 2020",
            "views": "8",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kannan Iyer",
                    "user_href": "/profile/Kannan-Iyer-45"
                },
                {
                    "user_id": "Kenneth Li",
                    "user_href": "/profile/Kenneth-Li-71"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Swartzendruber",
                "href": "/profile/Ron-Swartzendruber"
            },
            "answer_text": "Did you know that Quora questions are answered by other users, and almost never by Quora staff? Even though you didn't ask this question anonymously, we have no way of knowing which other account you are talking about. Even Quora staff probably don't have any way of knowing. As such, I can only give you possibilities. Do not take this personally, because I would say the same to anyone I didn't know. The first possibility is that you used that other account for serious violations of Quora rules, and did not post anything the moderators thought was worth keeping. Even spam accounts don't always get deleted when the owner is banned; their spam content is wiped, but if they also posted non-spam stuff, the account itself might be left on the system so that the non-spam content could remain. For an account to be completely deleted, it must have contained little redeeming value. If this happened, though, you would have received multiple warnings in advance, and probably several temporary edit blocks of increasing length. You would know, in other words. So let's look at the other possibilities. You might have deleted the account yourself and forgotten about it. Yes, this is unlikely, but in group of people several million strong, one-in-a-million events happen daily, so I should at least mention it. You would have needed to go into your privacy options, chosen to delete the account, and then not logged in for more than fourteen days for the account to actually be deleted. Which brings me to the final possibility: the account might not actually have been deleted. For example, maybe you logged in using Facebook when you formerly used Google, and you were doing it from a different computer or browser than normal, and you hadn't linked your Quora account to your Facebook account. Circumstances like that could cause Quora to create a brand new account because the site would have no way to know that you already had one. If you think that might have happened, go back to your normal browser and log in with the Google or Facebook account you used before. If that still doesn't fix it, go to your user profile and look for the contact menu; describe the situation to Quora staff, making sure to give them the name on the other account you are talking about, even if it is the same as the one you are using now. ",
            "date": "Answered February 22, 2018",
            "views": "151",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Andrew Marshall",
                    "user_href": "/profile/Scott-Andrew-Marshall"
                },
                {
                    "user_id": "Sony Adhikari",
                    "user_href": "/profile/Sony-Adhikari-8"
                },
                {
                    "user_id": "Darryl Schaumburg",
                    "user_href": "/profile/Darryl-Schaumburg-1"
                },
                {
                    "user_id": "Georgia Watson",
                    "user_href": "/profile/Georgia-Watson-50"
                },
                {
                    "user_id": "Richard Li",
                    "user_href": "/profile/Richard-Li-220"
                },
                {
                    "user_id": "Danyl Kay",
                    "user_href": "/profile/Danyl-Kay"
                },
                {
                    "user_id": "Eliza Chin",
                    "user_href": "/profile/Eliza-Chin-2"
                },
                {
                    "user_id": "Jon Comer",
                    "user_href": "/profile/Jon-Comer-2"
                },
                {
                    "user_id": "Daniel Quatro",
                    "user_href": "/profile/Daniel-Quatro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Hernandez",
                "href": "/profile/Leslie-Hernandez-445"
            },
            "answer_text": "Just… Go to your setting.Click privacy.Scroll right to bottom and you’ll see Delete account.When done, go to your lawyer because these social platforms like to make you believe a digital contract uses sign by clicking on a subscribe button is law. It’s not.Your lawyer, will give you details on what forms to fill in and this will then be sent to this company and they’ll have to delete ALL your content no matter of all this “content is ours.” No, they are not the law and law is very different. Law will actually say content is the users not quora. The question even can also be questionable because some are writtern by users who are on the pay program.They cannot say to a user who takes their content, and posts it on their blog. So saying it’s their content and then going into court saying.. “The user who wrote the content was banned/or deleted their account and then took WHAT THEY WROTE, on their blog.” You know how stupid that will look on any social media corp who do that. In fact, most of these companies think that if a user posts content that they can just do whatever they wish with it but by law it’s not true. They just haven’t been challenged by many but those who do challenge in court of law, find these corporates back off and delete the content because they don’t want to look like thieves and against online users. And the fact is there is ‘limitation of intellectual property rights' in their terms of use of someone else’s content even when these social platforms have policies in place. It’s very ignorant thinking policies written and typed out is law, because it’s not and they know that if they sit down with a lawyer who really does know what they are talking about. Law can be challenged. So can policies in the court of law and over turned. That’s what law is also for and law evolves through time too especially with social media. Example, using a photograph that someone else took and quora then says it’s their property to use as they will, will have them being sued for using a photography that is the intellectual property of the creator. They forget there is law about “creation, ideas, content designed, written by anyone.” An example.. Federal jury presided over by Judge Alison Nathan finally ordered the agencies to pay $1,200,000 as compensation for violation of intellectual property rights. Copyright was deemed to have been infringed precisely on the grounds that, contrary to the argument posed by the agency (that everything that is published on Twitter may be used without any authorisation being required), Twitter's licences do not include the right to use users' content for commercial purposes. And quora IS using content for commericial purposes, to drive traffic to their site, to make money from the content. I suggest quora deletes all content when someone deletes their account or when Quora bans someone as that is the user content no matter what their policy says on their website. Someone will soon challenge them and I daresay that is around the corner. ",
            "date": "Answered May 9, 2020",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruhul Amin Hira",
                    "user_href": "/profile/Ruhul-Amin-Hira-1"
                },
                {
                    "user_id": "Neal Sam",
                    "user_href": "/profile/Neal-Sam-1"
                },
                {
                    "user_id": "Barbara Newlin Miller",
                    "user_href": "/profile/Barbara-Newlin-Miller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Plano",
                "href": "/profile/Linda-Plano"
            },
            "answer_text": "It’s simple: Just like any other digest-type email, scroll to the bottom of the email and click on the “Unsubscribe” link. On the screen that opens, you can select “Never. No digest emails.” and then click Save. Voila, no more digest emails. Do the same thing with any other types of emails you get (e.g., the ones that open with “Can you answer this question?”). However, stopping emails will not delete your account (if you have one, which I suspect you do, however inadvertently you signed up for it). So before clicking on Save, click on “Edit other settings.” Click on the Account menu link in the left sidebar and see which Connections to other social media you have, which may give you a clue as to how you wound up on Quora in the first place. Delete those connections if you feel like it. Click on the Privacy menu link and select Deactivate Account (if you think you might like to return someday) or Delete Account (if you want to lose your profile permanently). Note that any answers or questions you have already submitted will remain as community property unless you delete them before submission, but won’t be linked to your now-deleted profile. ",
            "date": "Answered February 3, 2019",
            "views": "68",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "এসো ইসলামকে জানি - Let's Know Islam",
                    "user_href": "/profile/এসো-ইসলামকে-জানি-Lets-Know-Islam"
                },
                {
                    "user_id": "Ken Maberry",
                    "user_href": "/profile/Ken-Maberry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Hubbard",
                "href": "/profile/Robin-Hubbard-6"
            },
            "answer_text": ".How do I get off Quora? I've tried 3 times but it appears it will not be deleted. Are you checking too soon? [After delete] If you login during the next 14 days, the account will be reactivated and deletion will be canceled. Once the 14-day grace period has expired and your account has been deleted, your content and profile will be permanently deleted, and personal data associated with your account will be removed from Quora's databases.Jan 2, 2019 https://help.quora.com/hc/en-us/articles/115004250866-How-do-I-delete-my-Quora-account- .  SOURCE: YouTube dqTgqLH9vGc  SOURCE: How To Delete Quora Account from Android/PC/iOS 2020? (Working) How to Delete Your Quora Account Go to www.Quora.com and log in to your account.Navigate to your Privacy Settings.Click \"Delete Account\"When prompted, enter your password and press \"Done\"Don't login for 14 days; it will reactivate your accountDec 5, 2018 How to Delete Your Quora Account  ALTERNATIVELY or ADDITIONALLY Uninstall it like any other app or program.Restart your device.Check that the app is deleted.Locate the “Quora” folder and delete it (may have to add write permissions to delete)If Windows, use Regedit or RegCleaner to locate quora entries and delete (only for confident, advanced user)OR Send an e-mail (privacy@quora.com) asking for deletion. Not very neat – however on the other hand, all your info and published texts will be deleted. You can also deactivate your account (and probably reactivate later, if you wish). Go to https://www.quora.com/settings/privacy and click 'Deactivate account'. Popular › delete-quora-a... How to delete your Quora account - ACCOUNTKILLER.COM . How do I delete my Quora account? Quora allows users to delete their account if they choose to do so. Deleting your Quora account means that the following content will be removed from public view: Your profile including photos and bioYour answersCommentsBlog postsVotesEndorsementsMessagesQuestions you may have asked will remain, since questions on Quora are community owned, but will not be associated with your name publicly. Deletion of your account is not reversible once the process is complete. Alternatives to deletion include: DeactivationEdit your Quora Privacy SettingsDeleting individual pieces of content, such as answers, comments, or postsIf you are certain you wish to delete your account, visit your account privacy settings and choose \"Delete Account\". It will ask you for your password in order to confirm the deletion (Note: if you created the account via Google or Facebook, you will first need to create a password by clicking the \"Change Password\" link near the top of the page, then clicking on \"create an account password\"). Once you confirm the deletion of your account, the account will be deactivated immediately and the deletion process will begin. If you login during the next 14 days, the account will be reactivated and deletion will be canceled. Once the 14-day grace period has expired and your account has been deleted, your content and profile will be permanently deleted, and personal data associated with your account will be removed from Quora’s databases. As described in our Privacy Policy (https://www.quora.com/about/privacy), we may preserve your data if necessary to comply with legal obligations (subpoenas, legal process, or other court-ordered obligations). Keep in mind that your content may have been republished or shared by others outside of the Quora Platform. Account deletion on the Quora Platform does not remove any links or data hosted by others. However, under Quora’s Terms of Service, users republishing content from the Quora Platform have an obligation, upon request to delete content that has been deleted on the Quora Platform. If you have further questions regarding account deletion or you need your account to be deleted before the 14 day deactivation period, please let us know by contacting us via our contact form. ",
            "date": "Updated August 16, 2020",
            "views": "19",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruce Bicknell",
                    "user_href": "/profile/Bruce-Bicknell"
                },
                {
                    "user_id": "Michael Gately",
                    "user_href": "/profile/Michael-Gately-8"
                },
                {
                    "user_id": "Ethan Wing",
                    "user_href": "/profile/Ethan-Wing-3"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Nan Waldman",
                    "user_href": "/profile/Nan-Waldman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ford Dyce",
                "href": "/profile/Ford-Dyce"
            },
            "answer_text": "Taken from Quora’s official account (How do I delete my Quora account?): Quora allows users to delete their account if they choose to do so. Deleting your Quora account means that the following content will be removed from public view: your profile including photos and bio, your answers, comments, blog posts, votes, endorsements, and messages. Questions you may have asked will remain, since questions on Quora are community owned, but will not be associated with your name publicly. Deletion of your account is not reversible once the process is complete. Alternatives to deletion include: DeactivationEdit your Quora Privacy SettingsDeleting individual pieces of content, such as answers, comments, or postsIf you are certain you wish to delete your account, visit your account privacy settings and choose “Delete Account”. Once you confirm, your account will be deactivated immediately and the deletion process will begin. If you login during the next 14 days, the account will be reactivated and deletion will be canceled. Once the 14 day grace period has expired and your account has been deleted, your content and profile will no longer be publicly accessible. Older versions of your content or account may be stored indefinitely by Quora in the form of backups or internal logs. Keep in mind that your content may have been republished or shared by others outside of Quora. Account deletion here does not remove any links or data hosted by others. If you have further questions regarding account deletion, contact us using our contact form. ",
            "date": "Answered December 27, 2017",
            "views": "49",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ritesh",
                    "user_href": "/profile/Ritesh-388"
                },
                {
                    "user_id": "Joanna Lawrence",
                    "user_href": "/profile/Joanna-Lawrence-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandeep Reddy Seguru",
                "href": "/profile/Sandeep-Reddy-Seguru"
            },
            "answer_text": "Deleting your Quora account is fairly simple. All you have to do is go your profile. Proceed to privacy and click on ‘Delete Account’. Your account will be deleted if you do not login within 14 days of deleting your account. If you do so, your account will automatically be reactivated. You must keep in mind that deleting your account does not remove the questions you have posted as they belong to the Quora community. However, once you have deleted your account your questions won’t appear with your name publicly. The things that are removed from public view are your photos, bio, answers, comments, votes, endorsements and messages. You should bear in mind that deleting your account does not delete your content that has been shared by others outside of Quora.  If you have a query whether deleting your quora account is a reversible process, let me tell you that it is not. It is not possible to recover once you have permanently deleted your quora account. If you plan on returning to Quora sometime in future, you can deactivate your account instead of deleting it. You can do so by going to Settings in your profile and click Deactivate Account under Privacy. You can easily reactivate your account whenever you wish simply by logging in again. Hope this helps :) ",
            "date": "Answered February 6, 2018",
            "views": "106",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rahul Ashokayan",
                    "user_href": "/profile/Rahul-Ashokayan"
                },
                {
                    "user_id": "Mahesh Jawale",
                    "user_href": "/profile/Mahesh-jawale-12"
                },
                {
                    "user_id": "Anil Tiwari",
                    "user_href": "/profile/Anil-Tiwari-618"
                },
                {
                    "user_id": "Saisree Gujjari",
                    "user_href": "/profile/Saisree-Gujjari"
                },
                {
                    "user_id": "Nainu Bhat",
                    "user_href": "/profile/Nainu-Bhat"
                },
                {
                    "user_id": "S.K. Jagannath",
                    "user_href": "/profile/S-K-Jagannath"
                },
                {
                    "user_id": "DEEPAK Singh",
                    "user_href": "/profile/DEEPAK-Singh-11239"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1379"
                },
                {
                    "user_id": "Moira Bain",
                    "user_href": "/profile/Moira-Bain-1"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Munzal",
                "href": "/profile/Jack-Munzal"
            },
            "answer_text": "In order to “cancel” your Quora account, you must delete it. Deleting your account removes all answers, blog posts, comments, and other content (with the exception of questions) from the site. Your profile will be deleted, and all @-mentions will read “User” and direct to an empty topic page. In other words, your Quora presence will vanish. To delete your account, first visit the Privacy Settings page. Scroll all the way to the bottom and click “Delete Account.” Deleting your account will trigger its deactivation and, after fourteen days, its permanent deletion. Logging back in during while your account is deactivated will reactivate it and cancel the deletion. Please note that you can have your account deleted immediately if you so desire. Contact Quora directly if this is your preference.  We’re sorry to see you go! Why did you leave Quora? Check all that apply. Subpar UI and UXInconsistent and volatile ModerationRemoval of question detailsWrite your own reason…",
            "date": "Answered August 4, 2017",
            "views": "246",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saisree Gujjari",
                    "user_href": "/profile/Saisree-Gujjari"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/No-One-5203"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1379"
                },
                {
                    "user_id": "Chonas Assl",
                    "user_href": "/profile/Chonas-Assl"
                },
                {
                    "user_id": "Durgesh trimbak",
                    "user_href": "/profile/Durgesh-trimbak"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                },
                {
                    "user_id": "Ed Gamble",
                    "user_href": "/profile/Ed-Gamble-4"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Jay Sapinsky",
                    "user_href": "/profile/Jay-Sapinsky"
                },
                {
                    "user_id": "Mickey M. Bencetích",
                    "user_href": "/profile/Mickey-M-Bencetích"
                },
                {
                    "user_id": "Hafsah Kamal",
                    "user_href": "/profile/Hafsah-Kamal"
                },
                {
                    "user_id": "Gabriella Kettles",
                    "user_href": "/profile/Gabriella-Kettles"
                },
                {
                    "user_id": "Nancy Jacobsen",
                    "user_href": "/profile/Nancy-Jacobsen"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Sam Mayerhofer",
                    "user_href": "/profile/Sam-Mayerhofer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manpreet Singh",
                "href": "/profile/Manpreet-Singh-1094"
            },
            "answer_text": "Quora allows users to delete their account if they choose to do so. Deleting your Quora account means that the following content will be removed from public view: your profile including photos and bio, your answers, comments, blog posts, votes, endorsements, and messages. Questions you may have asked will remain, since questions on Quora are community owned, but will not be associated with your name publicly. Deletion of your account is not reversibleonce the process is complete. Alternatives to deletion include: DeactivationEdit your Quora Privacy SettingsDeleting individual pieces of content, such as answers, comments, or postsIf you are certain you wish to delete your account, visit your account privacy settings and choose “Delete Account”. Once you confirm, your account will be deactivated immediately and the deletion process will begin. If you login during the next 14 days, the account will be reactivated and deletion will be canceled. Once the 14 day grace period has expired and your account has been deleted, your content and profile will no longer be publicly accessible. Older versions of your content or account may be stored indefinitely by Quora in the form of backups or internal logs. Keep in mind that your content may have been republished or shared by others outside of Quora. Account deletion here does not remove any links or data hosted by others. If you have further questions regarding account deletion, contact us using our contact form. ",
            "date": "Answered September 18, 2017",
            "views": "17",
            "upvotes": " Answer requested by Education",
            "upvoters": [
                {
                    "user_id": "Julianne Legon",
                    "user_href": "/profile/Julianne-Legon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": "You know what, I really don’t like to answer this question since I hope you don’t delete your Quora account unless you really have a valid reason(s). It is a good platform that you can learn many things, let alone there are so many dedicated writers working for you. Several days ago, I got a solution to command about port numbers on my computer. How do I find the port my localhost is running on Windows? netstat -a -o There you will see many IP addresses. Local host is 127.0.0.1 what you see past the: is the port number. If you would like to know what process is responsible for that then pay attention to the PID (Process ID) column (the one on the far right)…. I tried to figure it for a period of time and checked the internet. Finally, I found the solution from Quora and solved another problem. I couldn’t remember it exactly. Anyway, thanks Quora. From my perspective, I am trying to submit the best answer that I can have although my English and knowledge are not good enough. But I still hope that you can learn something from my past experience and search from the internet. This is a friendly platform that enriches with people’s experience and knowledge. Hope you like it. Thanks for reading. ",
            "date": "Answered July 20, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zoe Kamper-Lawson",
                    "user_href": "/profile/Zoe-Kamper-Lawson"
                },
                {
                    "user_id": "Prashant Gnawali",
                    "user_href": "/profile/Prashant-Gnawali-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Swerling",
                "href": "/profile/Jason-Swerling"
            },
            "answer_text": "The way you write your question seems like you want to remove yourself from Quora. If that is the case then you can delete your account: Desktop: Click on your avatar - the little circle with a head silhouette in it, left of the big ‘Add Question’ button on the top row of the window. Then click on settings from the drop down list. Then click on privacy…. From there you can delete or de-activate the account. Android: Click on ‘You’ at the bottom of the screen. then click on the 3 dots under your name in the same ( name ) section. Then click on settings, then privacy and scroll down to ‘Delete or de-activate your account. If this wasn’t about the Quora website, these days most reputable websites have similar options… ",
            "date": "Answered February 12, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1379"
                },
                {
                    "user_id": "Amrita",
                    "user_href": "/profile/Amrita-242"
                },
                {
                    "user_id": "Dennis Hults",
                    "user_href": "/profile/Dennis-Hults"
                },
                {
                    "user_id": "Meredith Kirby",
                    "user_href": "/profile/Meredith-Kirby-2"
                },
                {
                    "user_id": "Nadine Touzet",
                    "user_href": "/profile/Nadine-Touzet"
                },
                {
                    "user_id": "L. Blade",
                    "user_href": "/profile/L-Blade-1"
                },
                {
                    "user_id": "Malcolm Berry",
                    "user_href": "/profile/Malcolm-Berry-1"
                },
                {
                    "user_id": "Indy Wang",
                    "user_href": "/profile/Indy-Wang"
                },
                {
                    "user_id": "Edward Snijders",
                    "user_href": "/profile/Edward-Snijders-1"
                },
                {
                    "user_id": "Majestic UNcasual",
                    "user_href": "/profile/Majestic-UNcasual"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Francesca Zylstra",
                    "user_href": "/profile/Francesca-Zylstra"
                },
                {
                    "user_id": "Bryan Hannaford",
                    "user_href": "/profile/Bryan-Hannaford"
                },
                {
                    "user_id": "Bernhard Kockoth",
                    "user_href": "/profile/Bernhard-Kockoth-1"
                },
                {
                    "user_id": "Tim Balthazar",
                    "user_href": "/profile/Tim-Balthazar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ユーリャン-コー"
                },
                {
                    "user_id": "Elijah Salvatore",
                    "user_href": "/profile/Elijah-Salvatore"
                },
                {
                    "user_id": "Frans van Oostveen",
                    "user_href": "/profile/Frans-van-Oostveen"
                },
                {
                    "user_id": "Abhishek Singham",
                    "user_href": "/profile/Abhishek-Singham-1"
                },
                {
                    "user_id": "Thomas Lowden",
                    "user_href": "/profile/Thomas-Lowden"
                },
                {
                    "user_id": "Ceil Niel",
                    "user_href": "/profile/Ceil-Niel"
                },
                {
                    "user_id": "Anirudh Rajesh",
                    "user_href": "/profile/Anirudh-Rajesh"
                },
                {
                    "user_id": "CIndy wIngate",
                    "user_href": "/profile/CIndy-wIngate"
                },
                {
                    "user_id": "Garima Bhatia",
                    "user_href": "/profile/Garima-Bhatia-28"
                },
                {
                    "user_id": "Cornelia Samuel Hacik",
                    "user_href": "/profile/Cornelia-Samuel-Hacik"
                },
                {
                    "user_id": "Melissa Leonopolis",
                    "user_href": "/profile/Melissa-Leonopolis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Behr Palomo",
                "href": "/profile/Behr-Palomo"
            },
            "answer_text": "You have to go through a ridiculous, drawn out process to delete an account that you were FORCED to sign up for just to post a single comment. Then they automatically send you a bunch of SPAM to the email you are FORCED to provide and now you have to jump through their hoops to cancel and delete the account. This is a doomed business model, I can't wait to complain about it to everyone I know. The process:\"...If you want to delete your account, e-mail privacy@quora.com from the e-mail address that is associated with your account. Please include a link to your profile...\" I assume they have an actual LIVE person grinding cancellation requests out at an extremely slow rate? What a technologically inept way to handle things. ",
            "date": "Answered June 12, 2015",
            "views": "219",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jess Wattse",
                    "user_href": "/profile/Jess-Wattse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Thomas Lirio",
                "href": "/profile/Derek-Thomas-Lirio"
            },
            "answer_text": "The very next time you see him, don’t even say anything, just walk right up to him, kiss him, and shove your tongue in his mouth. If he kisses you back passionately, you have 2 options. You can put your arms around his neck, or you can put your hand in his pants. That depends on you. If you think you want him inside you, buy some condoms before any of this happens, and when you grab him down below and you feel him getting hard, tell him you’re wet and his feels big and fat enough for you. Now, because he’s your best friend, follow my advice for during sex too. When he puts it in you, tell him how good it feels. Beg him to be rougher. When you are taking it in the doggy style position, tell him you’ve been a naughty slut and you hope you can take the spanking you deserve. I hope this helps, and I sincerely wish you a sore,m very satisfied vagina. Oh, and make sure to ride him, make his balls bounce. At the end of it all, tell him he owes Derek. LOL ",
            "date": "Answered October 23, 2020",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/No-One-5203"
                },
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Kaplan",
                "href": "/profile/Daniel-Kaplan"
            },
            "answer_text": "Nothing is keeping you here. Simply… turn off your computer. Open the drapes. Look outside.  It’s nice out there, isn’t it? Shut that computer down. Open your front door. There’s a whole universe out there waiting to be explored, and nothing keeping you inside… assuming that you aren’t handcuffed to your computer. Listen, Francesca Zylstra, it isn’t like you have a huge footprint here. You’ve written an answer and added a handful of questions. It shouldn’t be that hard to walk away. The good news is that you got at least two answers to this question, as opposed to the last time you asked pretty much the same question a minute before asking this time (Quora how can I leave your group I'm fed up with your silly questions?). Oh… you can also just send Quora emails to spam or deactivate your account. No fuss, no muss. ",
            "date": "Answered August 14, 2017",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/No-One-5203"
                },
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "Jami Bacmier",
                    "user_href": "/profile/Jami-Bacmier"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Sorrell",
                "href": "/profile/Jerry-Sorrell"
            },
            "answer_text": "With more and more people using Quora more and more with changes being made without more efficient servers and staff the site might self destruct. Changes aren't always for the better so disgust or frustration could set in. No matter what I try to do things are slow or freeze up. I love interaction with most but interaction on here is not always pleasant. Know it is not a debate site but even just considering the technical aspect you have to read multiple answers to try to get a consensus to be somewhat assured you're getting the right answer especially if subjective. I love the site but wouldn't give it an A rating. Guess it became imperfect when I came on it. Quora's success or demise will come from within. Easiest method is to just let nature/Quora take its course. ",
            "date": "Answered April 15, 2019",
            "views": "553",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-1379"
                },
                {
                    "user_id": "Tamoghna Chakrabarti",
                    "user_href": "/profile/Tamoghna-Chakrabarti-1"
                },
                {
                    "user_id": "Jacqueline Harty",
                    "user_href": "/profile/Jacqueline-Harty"
                },
                {
                    "user_id": "Abigail Killey",
                    "user_href": "/profile/Abigail-Killey"
                },
                {
                    "user_id": "Marie Farrell",
                    "user_href": "/profile/Marie-Farrell-27"
                },
                {
                    "user_id": "Carmen Wardrope",
                    "user_href": "/profile/Carmen-Wardrope-1"
                },
                {
                    "user_id": "A Person",
                    "user_href": "/profile/A-Person-1246"
                },
                {
                    "user_id": "Pintu Gurjar",
                    "user_href": "/profile/Pintu-Gurjar-14"
                },
                {
                    "user_id": "Tahitoa Toefuata",
                    "user_href": "/profile/Tahitoa-Toefuata"
                },
                {
                    "user_id": "Thomas Kinney",
                    "user_href": "/profile/Thomas-Kinney-3"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                },
                {
                    "user_id": "Prateek Kumar Jha",
                    "user_href": "/profile/Prateek-Kumar-Jha-3"
                },
                {
                    "user_id": "Greg Dhu",
                    "user_href": "/profile/Greg-Dhu"
                },
                {
                    "user_id": "Roy Bowey",
                    "user_href": "/profile/Roy-Bowey"
                },
                {
                    "user_id": "Alex S. Gabor",
                    "user_href": "/profile/Alex-S-Gabor"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Fi-Aifi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Ingram",
                "href": "/profile/Jack-Ingram-10"
            },
            "answer_text": "Read your last sentence again and you have your answer . In your last sentence you say ”I’m not sure”. When you no longer feel unsure is soon enough. What is your hurry? Nothing you wrote gives any sense of urgency except you seem to feel this need. Ask yourself why. I am not talking down to you so please don’t take offense with what I am telling you. You are young, so very young, and at your age it seems as if it has taken forever for you to reach the age you are now. Let me tell you that there is a phenomenon with time that we experience. We all do, everyone of us. The passage of time appears to pass at an ever increasing rate of speed as we age. The period from your birth to where you are now has taken you, your whole life to travel. Whereas I can go into my closet and find a jacket that I bought before you were born and to me it seems like yesterday. I can remember the purchase and maybe something in particular about the sale or sales person. My car looks nearly new and I drive it with pride and get compliments on it. You were just eight years old when I bought it. Do you see my point or are you confused as to why my trip down memory lane? My point my young friend is you have created a sense of urgency regarding your feelings where there is really none. In affairs of the heart it is nearly always the better decision to move slowly then slow it down a bit more. At your age and this being one of if not you very first affair of the heart, you really have no knowledge of where it is going. If you are lucky this will be but one of several in your life. You must understand that you are very inexperienced with this state of mind. Just relax and enjoy the ride and your life. Life has ups and downs so one should optimize the pleasures of the good times as those memories get us through the bad times. I hope my convoluted method of writing this leaves you with some small something that may assist you in making your journey more interesting and help you to slow down and smell the roses along your way. ",
            "date": "Answered July 27, 2020",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Wilkins",
                "href": "/profile/Andrew-Wilkins-18"
            },
            "answer_text": "“What is the best way to unsubscribe from Quora?” Assuming a full-on browser here so sorry if this doesn’t apply to mobileapps Hit your profile pictureThat resulting pop up shows a number of links including ‘Settings”In there go to “Privacy”Scroll down (a long way) to see the “Deactivate” and “Delete” Account optionsHitting these will cause Quora to ask you “are you sure?”, “are you really sure?”, “are you absolutely positive” and so on until it says something along the lines of “Oh all right then - but we won’t really do it for a few weeks so it is still there when you change your mind”Eventually your account is deactivated or deleted accordingly. Note that if deactivated it becomes reactivated if you access it at all.So it is important to get rid of your Quora shortcuts and delete it from your browser historyNote that I am, in fact, still alive and active on Quora so how come I know all this? I discovered that one of the other 20 or so other “Andrew Wilkins” users on Quora was also actually me. I’d created a second account by accident under another of my many email accounts. ",
            "date": "Answered July 30, 2018",
            "views": "196",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Witt",
                    "user_href": "/profile/Anthony-Witt-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reba Schneider",
                "href": "/profile/Reba-Schneider-1"
            },
            "answer_text": "It looked to me like you had edited your name and it had been accepted. You have now found out about Quora's Real Name policy. You don't get to be Mr Anybody or even Dr Anybody. In any case, writing a question here will get you exactly nowhere with Quora Moderation. They don't read questions unless it's one that got reported to them. It's not possible for one person, or even several people, to read all the questions on Quora. You either use the appeal link you should have gotten in an email, or you use http://Quora.com/contactthem Again it looks like you fixed the name problem. Save the contact link or go to http://Quora.com/help to look for policies and FAQ. ",
            "date": "Answered April 26, 2019",
            "views": "549",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laurie Edward",
                    "user_href": "/profile/Laurie-Edward-2"
                },
                {
                    "user_id": "McKayla Kennedy",
                    "user_href": "/profile/McKayla-Kennedy"
                },
                {
                    "user_id": "Julie Gates",
                    "user_href": "/profile/Julie-Gates-5"
                },
                {
                    "user_id": "Gerhard Reus",
                    "user_href": "/profile/Gerhard-Reus"
                },
                {
                    "user_id": "Lance Hotz",
                    "user_href": "/profile/Lance-Hotz"
                },
                {
                    "user_id": "Aditya Narayan Sharma",
                    "user_href": "/profile/Aditya-Narayan-Sharma-8"
                },
                {
                    "user_id": "Ambrose Lo",
                    "user_href": "/profile/Ambrose-Lo"
                },
                {
                    "user_id": "Logan Forbes",
                    "user_href": "/profile/Logan-Forbes-1"
                },
                {
                    "user_id": "Sara Erickson",
                    "user_href": "/profile/Sara-Erickson-5"
                },
                {
                    "user_id": "Elvira Ki",
                    "user_href": "/profile/Elvira-Ki"
                },
                {
                    "user_id": "Israel Gomez",
                    "user_href": "/profile/Israel-Gomez-8"
                },
                {
                    "user_id": "Katrina Wray",
                    "user_href": "/profile/Katrina-Wray-1"
                },
                {
                    "user_id": "Abir Chawla",
                    "user_href": "/profile/Abir-Chawla"
                },
                {
                    "user_id": "Josh White",
                    "user_href": "/profile/Josh-White-129"
                },
                {
                    "user_id": "Erin Garmin",
                    "user_href": "/profile/Erin-Garmin"
                },
                {
                    "user_id": "Emma Homes",
                    "user_href": "/profile/Emma-Homes"
                },
                {
                    "user_id": "Anthony Gosse",
                    "user_href": "/profile/Anthony-Gosse"
                },
                {
                    "user_id": "Alexa Kearns",
                    "user_href": "/profile/Alexa-Kearns"
                },
                {
                    "user_id": "Nirupa Shinde",
                    "user_href": "/profile/निरूपा-शिंदे-Nirupa-Shinde"
                },
                {
                    "user_id": "Aryan Dara",
                    "user_href": "/profile/Aryan-Dara-2"
                },
                {
                    "user_id": "Joe Hempelmann",
                    "user_href": "/profile/Jo-Hempelmann"
                },
                {
                    "user_id": "Alex Hernandez",
                    "user_href": "/profile/Alex-Hernandez-230"
                },
                {
                    "user_id": "Michael Bucari",
                    "user_href": "/profile/Michael-Bucari"
                },
                {
                    "user_id": "Sean Sanders",
                    "user_href": "/profile/Sean-S-11"
                },
                {
                    "user_id": "Alexandra Torres",
                    "user_href": "/profile/Alexandra-Torres-20"
                },
                {
                    "user_id": "Casey Lake",
                    "user_href": "/profile/Casey-Lake"
                },
                {
                    "user_id": "Maya Smith",
                    "user_href": "/profile/Maya-Smith-51"
                },
                {
                    "user_id": "Jerry Gomez",
                    "user_href": "/profile/Jerry-Gomez-11"
                },
                {
                    "user_id": "Kay Pease",
                    "user_href": "/profile/Kay-Pease"
                },
                {
                    "user_id": "Martin Fox",
                    "user_href": "/profile/Martin-Fox-3"
                },
                {
                    "user_id": "Kyle Leonard",
                    "user_href": "/profile/Kyle-Leonard-21"
                },
                {
                    "user_id": "Pavan Kumar",
                    "user_href": "/profile/Pavan-Kumar-895"
                },
                {
                    "user_id": "Polina Inozemtseva",
                    "user_href": "/profile/Polina-Inozemtseva"
                },
                {
                    "user_id": "Zach Norman",
                    "user_href": "/profile/Zach-Norman-5"
                },
                {
                    "user_id": "Kaelan Dreyer",
                    "user_href": "/profile/Kaelan-Dreyer"
                },
                {
                    "user_id": "Joseph Still",
                    "user_href": "/profile/Joseph-Still-3"
                },
                {
                    "user_id": "Iris Perez",
                    "user_href": "/profile/Iris-Perez-21"
                },
                {
                    "user_id": "Caroline Ben-Ari",
                    "user_href": "/profile/Caroline-Ben-Ari"
                },
                {
                    "user_id": "Gage H. Leibman",
                    "user_href": "/profile/Gage-H-Leibman"
                },
                {
                    "user_id": "Katie Anne Holton",
                    "user_href": "/profile/Katie-Anne-Holton"
                },
                {
                    "user_id": "Pragnya Kunichi",
                    "user_href": "/profile/Pragnya-Kunichi"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Marta Opie",
                    "user_href": "/profile/Marta-Opie"
                },
                {
                    "user_id": "Benjamin Thomas",
                    "user_href": "/profile/Benjamin-Thomas-46"
                },
                {
                    "user_id": "M Melanie Chevalier",
                    "user_href": "/profile/M-Melanie-Chevalier-1"
                },
                {
                    "user_id": "Jeff Muscato",
                    "user_href": "/profile/Jeff-Muscato"
                },
                {
                    "user_id": "Sulthan Zahran",
                    "user_href": "/profile/Sulthan-Zahran"
                },
                {
                    "user_id": "Quentin Davis",
                    "user_href": "/profile/Quentin-Davis-51"
                },
                {
                    "user_id": "Alex Weaver",
                    "user_href": "/profile/Alex-Weaver-29"
                },
                {
                    "user_id": "Liana Lang",
                    "user_href": "/profile/Liana-Lang"
                },
                {
                    "user_id": "Kayla A. Jo",
                    "user_href": "/profile/Kayla-A-Jo"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                },
                {
                    "user_id": "Sam Schowalter",
                    "user_href": "/profile/Sam-Schowalter-3"
                },
                {
                    "user_id": "Ruxandra Dancea",
                    "user_href": "/profile/Ruxandra-Dancea"
                },
                {
                    "user_id": "Mike McAfee",
                    "user_href": "/profile/Mike-McAfee"
                },
                {
                    "user_id": "Numa Ali",
                    "user_href": "/profile/Numa-Ali-2"
                },
                {
                    "user_id": "Sanchit Sharma",
                    "user_href": "/profile/Sanchit-Sharma-16"
                },
                {
                    "user_id": "Mike Down",
                    "user_href": "/profile/Mike-Down-2"
                },
                {
                    "user_id": "Sean Moriarty",
                    "user_href": "/profile/Sean-Moriarty-12"
                },
                {
                    "user_id": "Kyle Fowler",
                    "user_href": "/profile/Kyle-Fowler-14"
                },
                {
                    "user_id": "Rad",
                    "user_href": "/profile/Rad-149"
                },
                {
                    "user_id": "Kihiro Tanakamaru",
                    "user_href": "/profile/Kihiro-Tanakamaru"
                },
                {
                    "user_id": "Dusty Ramsey",
                    "user_href": "/profile/Dusty-Ramsey"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                },
                {
                    "user_id": "Yash Sharma",
                    "user_href": "/profile/Yash-Sharma-478"
                },
                {
                    "user_id": "Laura Gunnells",
                    "user_href": "/profile/Laura-Gunnells"
                },
                {
                    "user_id": "Frances Meredith",
                    "user_href": "/profile/Frances-Meredith"
                },
                {
                    "user_id": "Janine White",
                    "user_href": "/profile/Janine-White"
                },
                {
                    "user_id": "Barbara Munic",
                    "user_href": "/profile/Barbara-Munic"
                },
                {
                    "user_id": "Kimberly Vu",
                    "user_href": "/profile/Kimberly-Vu-1"
                },
                {
                    "user_id": "Stephen Brimhall",
                    "user_href": "/profile/Stephen-Brimhall-3"
                },
                {
                    "user_id": "Lucy Rose Jessep",
                    "user_href": "/profile/Lucy-Rose-Jessep"
                },
                {
                    "user_id": "Austin Duong-Van",
                    "user_href": "/profile/Austin-Duong-Van"
                },
                {
                    "user_id": "Dan Smith",
                    "user_href": "/profile/Dan-Smith-1602"
                },
                {
                    "user_id": "Joshua Li",
                    "user_href": "/profile/Joshua-Li-45"
                },
                {
                    "user_id": "Daniel Newman",
                    "user_href": "/profile/Daniel-Newman-30"
                },
                {
                    "user_id": "Daniyal Qazi",
                    "user_href": "/profile/Daniyal-Qazi-1"
                },
                {
                    "user_id": "John Gragson",
                    "user_href": "/profile/John-Gragson"
                },
                {
                    "user_id": "Jack Clark",
                    "user_href": "/profile/Jack-Clark-24"
                },
                {
                    "user_id": "M. A. Steinberger",
                    "user_href": "/profile/M-A-Steinberger"
                },
                {
                    "user_id": "Tyler Glisson",
                    "user_href": "/profile/Tyler-Glisson-1"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Drew Eckhardt",
                    "user_href": "/profile/Drew-Eckhardt"
                },
                {
                    "user_id": "Aidan Matthews",
                    "user_href": "/profile/Aidan-Matthews-6"
                },
                {
                    "user_id": "Danny Wright",
                    "user_href": "/profile/Danny-Wright-35"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Andrew Karam",
                    "user_href": "/profile/Andrew-Karam-3"
                },
                {
                    "user_id": "Bethany Jones",
                    "user_href": "/profile/Bethany-Jones-64"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Charles Leggat",
                    "user_href": "/profile/Charles-Leggat"
                },
                {
                    "user_id": "Gary Elmer",
                    "user_href": "/profile/Gary-Elmer"
                },
                {
                    "user_id": "Ryan Mak",
                    "user_href": "/profile/Ryan-Mak-8"
                },
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                },
                {
                    "user_id": "Aaron Gullison",
                    "user_href": "/profile/Aaron-Gullison"
                },
                {
                    "user_id": "Elspeth Cowie",
                    "user_href": "/profile/Elspeth-Cowie"
                },
                {
                    "user_id": "Jeremy Glenesk",
                    "user_href": "/profile/Jeremy-Glenesk"
                },
                {
                    "user_id": "Wren Jayasekara",
                    "user_href": "/profile/Wren-Jayasekara"
                },
                {
                    "user_id": "Garion Hall",
                    "user_href": "/profile/Garion-Hall"
                },
                {
                    "user_id": "Robert Thornton",
                    "user_href": "/profile/Robert-Thornton-2"
                },
                {
                    "user_id": "Gordon Dewis",
                    "user_href": "/profile/Gordon-Dewis"
                },
                {
                    "user_id": "Rebecca Wilova",
                    "user_href": "/profile/Rebecca-Wilova"
                },
                {
                    "user_id": "Julia Fox",
                    "user_href": "/profile/Julia-Fox-36"
                },
                {
                    "user_id": "Hari Srinivas (हरि श्रीनिवास)",
                    "user_href": "/profile/Hari-Srinivas-हरि-श्रीनिवास"
                },
                {
                    "user_id": "Michael Vogel",
                    "user_href": "/profile/Michael-Vogel-5"
                },
                {
                    "user_id": "Alexander Lee",
                    "user_href": "/profile/Alexander-Lee-梅治-新太"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1350"
                },
                {
                    "user_id": "Cyrilla Baer",
                    "user_href": "/profile/Cyrilla-Baer"
                },
                {
                    "user_id": "Maura Rudd",
                    "user_href": "/profile/Maura-Rudd"
                },
                {
                    "user_id": "Nicole Ballard",
                    "user_href": "/profile/Nicole-Ballard"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-6"
                },
                {
                    "user_id": "Dan Smith",
                    "user_href": "/profile/Dan-Smith-702"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephanie Vardavas",
                "href": "/profile/Stephanie-Vardavas"
            },
            "answer_text": "Just log off. But keep in mind: Quora is enormous. If you are seeing content that you don’t find interesting, you have the ability to use your tools to find content that is. Your tools include FOLLOW - topics and people MUTE - topics and people BLOCK - people Mute the topics and people you don’t like. Follow the ones that interest you. Or log off, it is up to you. I’m over 60 and I find a lot of the content here very interesting…. and avoid the rest. ",
            "date": "Updated December 4, 2017",
            "views": "98",
            "upvotes": " View 111 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doris Wong",
                    "user_href": "/profile/Doris-Wong-28"
                },
                {
                    "user_id": "John Scallan",
                    "user_href": "/profile/John-Scallan-1"
                },
                {
                    "user_id": "E. Goco",
                    "user_href": "/profile/E-Goco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Burns",
                "href": "/profile/Greg-Burns-5"
            },
            "answer_text": "Assuming you are using the desktop application, rather than the mobile or the app: Click on your name “Michelle” to the top right hand of the screen.Select the “Settings” option from the drop down menu.On the left hand side select the “Privacy” link.To the bottom of the “Privacy” settings, you will see two links in red. One is entitled “Deactivate Account” and the other is “Delete Account.”Select the option you prefer and follow the prompts.Assuming you are on an iPad or equivalent tablet running the Quora app Start the application logged into your accountClick the ‘you’ icon at the bottom right of the screenClick the three dots at the upper right of the screen about 1/4 of the way downSelect the option settingsSelect privacySelect the option “Deactivate Account” or “Delete Account” as desired and follow the promptsDon’t forget to remove the app from your device once the account is deactivated.",
            "date": "Answered February 9, 2017",
            "views": "4",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kannan Iyer",
                    "user_href": "/profile/Kannan-Iyer-45"
                },
                {
                    "user_id": "Edward Munzhedzi",
                    "user_href": "/profile/Edward-Munzhedzi"
                },
                {
                    "user_id": "Callum McNeill",
                    "user_href": "/profile/Callum-McNeill-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debbie Scott",
                "href": "/profile/Debbie-Scott-210"
            },
            "answer_text": "How do I delete my Quora account or edit the topic I care about? Hmmm, two quite different questions. For #1 : Read : How do I delete my Quora account? And for question #2, the closest I can get (which may very well have the answer you are looking for) is: How do I change what topics I follow on Quora? If, for example you want to look up : Salmon Fishing, you would type into the “add Question or Link” box at the top on the right : Topic: Salmon Fishing. This will take you to another page with a whole lot of questions on it, but no “Salmon Fishing” topic. On the left hand side of this page, is a list with Topics on it, just above Blogs :  Click on Topics. This will take you to a new page, which has, on the far right, something like : Don’t See the Topic You’re Looking for? and underneath that is a box marked : Create Topic. Click on that and type in Salmon Fishing - et voila! that becomes a Topic which you can then click on to follow. One point however - if you are the first and only (or one of under say, 10 people to follow a topic, there will be few answers, and even fewer questions on that Topic, so to get better info, you may want to go Broader rather than too Specific. Under Psychology, for example, Specific is the way to go…  ",
            "date": "Answered April 1, 2019",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anitha Webcomm",
                    "user_href": "/profile/Anitha-Webcomm"
                },
                {
                    "user_id": "Aaron Gullison",
                    "user_href": "/profile/Aaron-Gullison"
                },
                {
                    "user_id": "HimaBindhu Chilumulla",
                    "user_href": "/profile/HimaBindhu-Chilumulla"
                },
                {
                    "user_id": "Brian Blood",
                    "user_href": "/profile/Brian-Blood-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Sinha",
                "href": "/profile/Rahul-Sinha-113"
            },
            "answer_text": "I don't understand that why do you want to delete your account? Just because you don't want one specific edit history, you want to delete your account. Not a good idea.  Why? The process of deletion isn't that easy. It takes time. Initially, 14 days deactivation period, then deletion and then also I can't assure you whether you could use same email account to create a new account because I didn't know about it specifically. So, due to one edit history, would you like to go through this process and still you don't know whether Quora will allow you to create new account with same email id or not.  Though, I'll suggest you to not delete your account due to one edit history. It doesn't make a big difference.  Or, if you like to delete, then check this post to know the deletion steps: How do I delete my Quora account? Hope this helps. Thank you! ",
            "date": "Answered November 11, 2015",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesus Alex Lechuga",
                    "user_href": "/profile/Jesus-Alex-Lechuga"
                },
                {
                    "user_id": "Debbie Scott",
                    "user_href": "/profile/Debbie-Scott-210"
                },
                {
                    "user_id": "Nguyễn Tấn Khoa",
                    "user_href": "/profile/Nguyễn-Tấn-Khoa"
                },
                {
                    "user_id": "Travis Mull",
                    "user_href": "/profile/Travis-Mull"
                },
                {
                    "user_id": "Jose Martius",
                    "user_href": "/profile/Jose-Martius"
                },
                {
                    "user_id": "Al Marshall",
                    "user_href": "/profile/Al-Marshall-6"
                },
                {
                    "user_id": "Mia Atkinson",
                    "user_href": "/profile/Mia-Atkinson-1"
                },
                {
                    "user_id": "Frank Wei",
                    "user_href": "/profile/Frank-Wei-19"
                },
                {
                    "user_id": "Julie Swiss",
                    "user_href": "/profile/Julie-Swiss"
                },
                {
                    "user_id": "Ethan Stedman",
                    "user_href": "/profile/Ethan-Stedman"
                },
                {
                    "user_id": "Niklas Rohleder",
                    "user_href": "/profile/Niklas-Rohleder"
                },
                {
                    "user_id": "Luis Bolaños Lapinski",
                    "user_href": "/profile/Luis-Bolaños-Lapinski"
                },
                {
                    "user_id": "Thomas van der Valk",
                    "user_href": "/profile/Thomas-van-der-Valk"
                },
                {
                    "user_id": "Devin Connelly",
                    "user_href": "/profile/Devin-Connelly-1"
                },
                {
                    "user_id": "Saloni Mahwar",
                    "user_href": "/profile/Saloni-Mahwar"
                },
                {
                    "user_id": "Petra DeBat",
                    "user_href": "/profile/Petra-DeBat"
                },
                {
                    "user_id": "Scott Shamblin",
                    "user_href": "/profile/Scott-Shamblin-2"
                },
                {
                    "user_id": "Christian Eaglen",
                    "user_href": "/profile/Christian-Eaglen"
                },
                {
                    "user_id": "Xander de Vries",
                    "user_href": "/profile/Xander-de-Vries-2"
                },
                {
                    "user_id": "Caleb Teague",
                    "user_href": "/profile/Caleb-Teague-2"
                },
                {
                    "user_id": "Pacey Tian",
                    "user_href": "/profile/Pacey-Tian"
                },
                {
                    "user_id": "Oliver Ashton",
                    "user_href": "/profile/Oliver-Ashton-2"
                },
                {
                    "user_id": "Izzy Brewer",
                    "user_href": "/profile/Izzy-Brewer-3"
                },
                {
                    "user_id": "Harper Qiu",
                    "user_href": "/profile/Harper-Qiu-1"
                },
                {
                    "user_id": "Ganesh R",
                    "user_href": "/profile/Ganesh-R-312"
                },
                {
                    "user_id": "Eric Schumaker",
                    "user_href": "/profile/Eric-Schumaker"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Noah VanEnkevort",
                    "user_href": "/profile/Noah-VanEnkevort"
                },
                {
                    "user_id": "Charles Leggat",
                    "user_href": "/profile/Charles-Leggat"
                },
                {
                    "user_id": "Benjamin Larson",
                    "user_href": "/profile/Benjamin-Larson-10"
                },
                {
                    "user_id": "Hasnain Rashid",
                    "user_href": "/profile/Hasnain-Rashid-2"
                },
                {
                    "user_id": "Oscar Yuandinata",
                    "user_href": "/profile/Oscar-Yuandinata"
                },
                {
                    "user_id": "Alex Walker",
                    "user_href": "/profile/Alex-Walker-229"
                },
                {
                    "user_id": "Shalmali Raut",
                    "user_href": "/profile/Shalmali-Raut"
                },
                {
                    "user_id": "Muhammad Fauzi",
                    "user_href": "/profile/Muhammad-Fauzi-39"
                },
                {
                    "user_id": "Adelle Guerlach",
                    "user_href": "/profile/Adelle-Guerlach"
                },
                {
                    "user_id": "Filipa Rocha",
                    "user_href": "/profile/Filipa-Rocha-2"
                },
                {
                    "user_id": "Emily Rae",
                    "user_href": "/profile/Emily-Rae-12"
                },
                {
                    "user_id": "Alvaro Soler",
                    "user_href": "/profile/Alvaro-Soler-2"
                },
                {
                    "user_id": "Navni Bajpai",
                    "user_href": "/profile/Navni-Bajpai"
                },
                {
                    "user_id": "Ayush Nair",
                    "user_href": "/profile/Ayush-Nair-1"
                },
                {
                    "user_id": "Harry Butcher",
                    "user_href": "/profile/Harry-Butcher-4"
                },
                {
                    "user_id": "Skylar Gayton",
                    "user_href": "/profile/Skylar-Gayton-1"
                },
                {
                    "user_id": "Rey J. Weiler",
                    "user_href": "/profile/Rey-J-Weiler"
                },
                {
                    "user_id": "Austin Morehead",
                    "user_href": "/profile/Austin-Morehead"
                },
                {
                    "user_id": "Kaustubh Shastrakar",
                    "user_href": "/profile/Kaustubh-Shastrakar"
                },
                {
                    "user_id": "Joshua Fox",
                    "user_href": "/profile/Joshua-Fox-32"
                },
                {
                    "user_id": "Gregory Domurat",
                    "user_href": "/profile/Gregory-Domurat"
                },
                {
                    "user_id": "Patrick O'Neill",
                    "user_href": "/profile/Patrick-ONeill-45"
                },
                {
                    "user_id": "Josephine Hoskins",
                    "user_href": "/profile/Josephine-Hoskins"
                },
                {
                    "user_id": "Keyon Rosen",
                    "user_href": "/profile/Keyon-Rosen"
                },
                {
                    "user_id": "Alexandra Torres",
                    "user_href": "/profile/Alexandra-Torres-20"
                },
                {
                    "user_id": "Sebastian Dädeby",
                    "user_href": "/profile/Sebastian-Dädeby"
                },
                {
                    "user_id": "Brett Roper",
                    "user_href": "/profile/Brett-Roper-2"
                },
                {
                    "user_id": "Brandon Rivera",
                    "user_href": "/profile/Brandon-Rivera-40"
                },
                {
                    "user_id": "Harriet Missy",
                    "user_href": "/profile/Harriet-Missy"
                },
                {
                    "user_id": "Larry Crawford",
                    "user_href": "/profile/Larry-Crawford"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/John-T-248"
                },
                {
                    "user_id": "Khaled Omar",
                    "user_href": "/profile/Khaled-Omar-31"
                },
                {
                    "user_id": "Brandon Grant",
                    "user_href": "/profile/Brandon-Grant-22"
                },
                {
                    "user_id": "Abraham Hengyucius",
                    "user_href": "/profile/Abraham-Hengyucius"
                },
                {
                    "user_id": "Rahul K",
                    "user_href": "/profile/Rahul-K-930"
                },
                {
                    "user_id": "Chloe Russell",
                    "user_href": "/profile/Chloe-Russell-34"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Candacy White",
                    "user_href": "/profile/Candacy-White"
                },
                {
                    "user_id": "Kasie Liang",
                    "user_href": "/profile/Kasie-Liang"
                },
                {
                    "user_id": "Connor Berens",
                    "user_href": "/profile/Connor-Berens"
                },
                {
                    "user_id": "Nick Olson",
                    "user_href": "/profile/Nick-Olson"
                },
                {
                    "user_id": "Ty Mauldin",
                    "user_href": "/profile/Ty-Mauldin-1"
                },
                {
                    "user_id": "Connor Gilpin",
                    "user_href": "/profile/Connor-Gilpin"
                },
                {
                    "user_id": "Neil Patel",
                    "user_href": "/profile/Neil-Patel-35"
                },
                {
                    "user_id": "Dali Metzker",
                    "user_href": "/profile/Dali-Metzker"
                },
                {
                    "user_id": "Reggie Harrell",
                    "user_href": "/profile/Reggie-Harrell"
                },
                {
                    "user_id": "Aaron ibrahim",
                    "user_href": "/profile/Aaron-ibrahim-3"
                },
                {
                    "user_id": "Yuvi Bhamra",
                    "user_href": "/profile/Yuvi-Bhamra"
                },
                {
                    "user_id": "Rachit Arora",
                    "user_href": "/profile/Rachit-Arora-69"
                },
                {
                    "user_id": "Kevin Anand",
                    "user_href": "/profile/Kevin-Anand-3"
                },
                {
                    "user_id": "Hanna Graczyńska",
                    "user_href": "/profile/Hanna-Graczyńska"
                },
                {
                    "user_id": "Duncan Capron",
                    "user_href": "/profile/Duncan-Capron-1"
                },
                {
                    "user_id": "Videsh Boodu",
                    "user_href": "/profile/Videsh-Boodu"
                },
                {
                    "user_id": "Jessica Nilsson",
                    "user_href": "/profile/Jessica-Nilsson-5"
                },
                {
                    "user_id": "Russell Broussard",
                    "user_href": "/profile/Russell-Broussard"
                },
                {
                    "user_id": "Jon Jones",
                    "user_href": "/profile/Jon-Jones-219"
                },
                {
                    "user_id": "Braeden Haeck",
                    "user_href": "/profile/Braeden-Haeck"
                },
                {
                    "user_id": "Adebanjo Olayemi",
                    "user_href": "/profile/Adebanjo-Olayemi"
                },
                {
                    "user_id": "Aaron Swords",
                    "user_href": "/profile/Aaron-Swords"
                },
                {
                    "user_id": "Mike Stork",
                    "user_href": "/profile/Mike-Stork-1"
                },
                {
                    "user_id": "Stephen Brimhall",
                    "user_href": "/profile/Stephen-Brimhall-3"
                },
                {
                    "user_id": "Hamza Hasan",
                    "user_href": "/profile/Hamza-Hasan-11"
                },
                {
                    "user_id": "Steve Sharp",
                    "user_href": "/profile/Steve-Sharp-29"
                },
                {
                    "user_id": "Gavin Harding",
                    "user_href": "/profile/Gavin-Harding-1"
                },
                {
                    "user_id": "Caleb Thompson",
                    "user_href": "/profile/Caleb-Thompson-47"
                },
                {
                    "user_id": "Lorri Robinson",
                    "user_href": "/profile/Lorri-Robinson"
                },
                {
                    "user_id": "Saurabh Baranwal",
                    "user_href": "/profile/Saurabh-Baranwal-29"
                },
                {
                    "user_id": "Luca Celestino",
                    "user_href": "/profile/Luca-Celestino"
                },
                {
                    "user_id": "Nandhitha Rajkumar",
                    "user_href": "/profile/Nandhitha-Rajkumar-2"
                },
                {
                    "user_id": "Dana Tessier",
                    "user_href": "/profile/Dana-Tessier-2"
                },
                {
                    "user_id": "Lenny Dagostini",
                    "user_href": "/profile/Lenny-Dagostini"
                },
                {
                    "user_id": "Debbie Pendry",
                    "user_href": "/profile/Debbie-Pendry"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                },
                {
                    "user_id": "Tom Stevenon",
                    "user_href": "/profile/Tom-Stevenon"
                },
                {
                    "user_id": "John Verdi",
                    "user_href": "/profile/John-Verdi-8"
                },
                {
                    "user_id": "Rakshith Dasenahalli Lingaraju",
                    "user_href": "/profile/Rakshith-Dasenahalli-Lingaraju-1"
                },
                {
                    "user_id": "Aravind Karthigeyan",
                    "user_href": "/profile/Aravind-Karthigeyan-1"
                },
                {
                    "user_id": "Alicia Woods",
                    "user_href": "/profile/Alicia-Woods-32"
                },
                {
                    "user_id": "Marcy Buono",
                    "user_href": "/profile/Marcy-Buono"
                },
                {
                    "user_id": "Howard Lynch",
                    "user_href": "/profile/Howard-Lynch"
                },
                {
                    "user_id": "Yan Golenko",
                    "user_href": "/profile/Yan-Golenko"
                },
                {
                    "user_id": "Vikendu Singh",
                    "user_href": "/profile/Vikendu-Singh"
                },
                {
                    "user_id": "Andreas James Mathiassen",
                    "user_href": "/profile/Andreas-James-Mathiassen"
                },
                {
                    "user_id": "Tim Faulkner",
                    "user_href": "/profile/Tim-Faulkner-5"
                },
                {
                    "user_id": "Steven Hash",
                    "user_href": "/profile/Steven-Hash"
                },
                {
                    "user_id": "Felix Sandberg",
                    "user_href": "/profile/Felix-Sandberg-1"
                },
                {
                    "user_id": "Michael Turner",
                    "user_href": "/profile/Michael-Turner-299"
                },
                {
                    "user_id": "Stepham Karambasis",
                    "user_href": "/profile/Stepham-Karambasis"
                },
                {
                    "user_id": "John Buginas",
                    "user_href": "/profile/John-Buginas"
                },
                {
                    "user_id": "Lucus Zha",
                    "user_href": "/profile/Lucus-Zha"
                },
                {
                    "user_id": "Utkarsh Priyam",
                    "user_href": "/profile/Utkarsh-Priyam"
                },
                {
                    "user_id": "Tyler Kinsey",
                    "user_href": "/profile/Tyler-Kinsey-6"
                },
                {
                    "user_id": "Oluwatobi Shittu",
                    "user_href": "/profile/Oluwatobi-Shittu"
                },
                {
                    "user_id": "Ash Martin",
                    "user_href": "/profile/Ash-Martin-15"
                },
                {
                    "user_id": "Ward Van Frost",
                    "user_href": "/profile/Ward-Van-Frost"
                },
                {
                    "user_id": "Phillip Vassallo",
                    "user_href": "/profile/Phillip-Vassallo"
                },
                {
                    "user_id": "Alaska Fawkes",
                    "user_href": "/profile/Alaska-Fawkes"
                },
                {
                    "user_id": "Rachel Baillie",
                    "user_href": "/profile/Rachel-Baillie-1"
                },
                {
                    "user_id": "Kevin Knaebel",
                    "user_href": "/profile/Kevin-Knaebel"
                },
                {
                    "user_id": "Laura Mitchell",
                    "user_href": "/profile/Laura-Mitchell-5"
                },
                {
                    "user_id": "Calvin Chik",
                    "user_href": "/profile/Calvin-Chik"
                },
                {
                    "user_id": "Numa Ali",
                    "user_href": "/profile/Numa-Ali-2"
                },
                {
                    "user_id": "Jacob Plante",
                    "user_href": "/profile/Jacob-Plante-1"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Samantha Coupe",
                    "user_href": "/profile/Samantha-Coupe-2"
                },
                {
                    "user_id": "Rachana Keyal",
                    "user_href": "/profile/Rachana-Keyal"
                },
                {
                    "user_id": "Isaiah Davis",
                    "user_href": "/profile/Isaiah-Davis-9"
                },
                {
                    "user_id": "Nathan Avery Drake",
                    "user_href": "/profile/Nathan-Avery-Drake"
                },
                {
                    "user_id": "Wendy Lo",
                    "user_href": "/profile/Wendy-Lo-9"
                },
                {
                    "user_id": "Matthew Weber",
                    "user_href": "/profile/Matthew-Weber-15"
                },
                {
                    "user_id": "Isaac Utovac",
                    "user_href": "/profile/Isaac-Utovac"
                },
                {
                    "user_id": "Alejandro Paulino",
                    "user_href": "/profile/Alejandro-Paulino-3"
                },
                {
                    "user_id": "Bob Simcoke",
                    "user_href": "/profile/Bob-Simcoke"
                },
                {
                    "user_id": "Dov Geoghegan",
                    "user_href": "/profile/Dov-Geoghegan-1"
                },
                {
                    "user_id": "Macon Wilson",
                    "user_href": "/profile/Macon-Wilson-1"
                },
                {
                    "user_id": "Lewis Howe",
                    "user_href": "/profile/Lewis-Howe-1"
                },
                {
                    "user_id": "Alejandro Castillo",
                    "user_href": "/profile/Alejandro-Castillo-23"
                },
                {
                    "user_id": "Jared Cohen",
                    "user_href": "/profile/Jared-Cohen-29"
                },
                {
                    "user_id": "Annika Rose",
                    "user_href": "/profile/Annika-Rose-5"
                },
                {
                    "user_id": "Rafi Amirali",
                    "user_href": "/profile/Rafi-Amirali"
                },
                {
                    "user_id": "Timothy Cassidy Jr.",
                    "user_href": "/profile/Timothy-Cassidy-Jr"
                },
                {
                    "user_id": "Ryan Chen",
                    "user_href": "/profile/Ryan-Chen-146"
                },
                {
                    "user_id": "Vlad Strelchik",
                    "user_href": "/profile/Vlad-Strelchik"
                },
                {
                    "user_id": "Andrew Zhang",
                    "user_href": "/profile/Andrew-Zhang-103"
                },
                {
                    "user_id": "Matthew Bates",
                    "user_href": "/profile/Matthew-Bates-27"
                },
                {
                    "user_id": "Gage H. Leibman",
                    "user_href": "/profile/Gage-H-Leibman"
                },
                {
                    "user_id": "Joe French",
                    "user_href": "/profile/Joe-French-6"
                },
                {
                    "user_id": "Carter N. Reilly",
                    "user_href": "/profile/Carter-N-Reilly"
                },
                {
                    "user_id": "Laura Tokeensuu",
                    "user_href": "/profile/Laura-Tokeensuu"
                },
                {
                    "user_id": "Riley Camille",
                    "user_href": "/profile/Riley-Camille-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Phabio-Host"
                },
                {
                    "user_id": "Erik Bergland",
                    "user_href": "/profile/Erik-Bergland"
                },
                {
                    "user_id": "Saahil Mohta",
                    "user_href": "/profile/Saahil-Mohta"
                },
                {
                    "user_id": "Nicholas Zacharias",
                    "user_href": "/profile/Nicholas-Zacharias"
                },
                {
                    "user_id": "Luna Sunny",
                    "user_href": "/profile/Luna-Sunny"
                },
                {
                    "user_id": "Eva Stein",
                    "user_href": "/profile/Eva-Stein-4"
                },
                {
                    "user_id": "Eric Jun",
                    "user_href": "/profile/Eric-Jun-8"
                },
                {
                    "user_id": "Tawfeeq Mannan",
                    "user_href": "/profile/Tawfeeq-Mannan"
                },
                {
                    "user_id": "Kevin Nguyen",
                    "user_href": "/profile/Kevin-Nguyen-834"
                },
                {
                    "user_id": "Martin Racz",
                    "user_href": "/profile/Martin-Racz"
                },
                {
                    "user_id": "Jacob Martindale",
                    "user_href": "/profile/Jacob-Martindale-11"
                },
                {
                    "user_id": "Jasmine Adamson",
                    "user_href": "/profile/Jasmine-Adamson"
                },
                {
                    "user_id": "Hari Srinivas (हरि श्रीनिवास)",
                    "user_href": "/profile/Hari-Srinivas-हरि-श्रीनिवास"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Danni Flanigen",
                    "user_href": "/profile/Danni-Flanigen"
                },
                {
                    "user_id": "Gabriel Alencar",
                    "user_href": "/profile/Gabriel-Alencar-4"
                },
                {
                    "user_id": "Ajahar Vishnu",
                    "user_href": "/profile/Ajahar-Vishnu"
                },
                {
                    "user_id": "Jillian D’Herin",
                    "user_href": "/profile/Jillian-D’Herin"
                },
                {
                    "user_id": "Dimas Mahardika",
                    "user_href": "/profile/Dimas-Mahardika-1"
                },
                {
                    "user_id": "Pasada Klahan",
                    "user_href": "/profile/Pasada-Klahan"
                },
                {
                    "user_id": "Darshna Rathod",
                    "user_href": "/profile/Darshna-Rathod-1"
                },
                {
                    "user_id": "Samuel Tan",
                    "user_href": "/profile/Samuel-Tan-104"
                },
                {
                    "user_id": "Aylin Ergün",
                    "user_href": "/profile/Aylin-Ergün"
                },
                {
                    "user_id": "Brandon Nguyen",
                    "user_href": "/profile/Brandon-Nguyen-24"
                },
                {
                    "user_id": "Andrew Karam",
                    "user_href": "/profile/Andrew-Karam-3"
                },
                {
                    "user_id": "Oscar Stahlberg",
                    "user_href": "/profile/Oscar-Stahlberg"
                },
                {
                    "user_id": "Sourik Aditya",
                    "user_href": "/profile/Sourik-Aditya"
                },
                {
                    "user_id": "Zac Davis",
                    "user_href": "/profile/Zac-Davis-16"
                },
                {
                    "user_id": "Alon Amit",
                    "user_href": "/profile/Alon-Amit"
                },
                {
                    "user_id": "Ruth Sagers",
                    "user_href": "/profile/Ruth-Sagers"
                },
                {
                    "user_id": "Jonas Grandt",
                    "user_href": "/profile/Jonas-Grandt-1"
                },
                {
                    "user_id": "Jerric Wong",
                    "user_href": "/profile/Jerric-Wong"
                },
                {
                    "user_id": "Alexander Kroeger",
                    "user_href": "/profile/Alexander-Kroeger"
                },
                {
                    "user_id": "Billy Chiu",
                    "user_href": "/profile/Billy-Chiu-3"
                },
                {
                    "user_id": "Briana Anthony",
                    "user_href": "/profile/Briana-Anthony-3"
                },
                {
                    "user_id": "Yichen Wang",
                    "user_href": "/profile/Yichen-Wang-36"
                },
                {
                    "user_id": "Victor Aguiar",
                    "user_href": "/profile/Victor-Aguiar-6"
                },
                {
                    "user_id": "Ron Rothenberg",
                    "user_href": "/profile/Ron-Rothenberg-2"
                },
                {
                    "user_id": "James Declan",
                    "user_href": "/profile/James-Declan"
                },
                {
                    "user_id": "Cyril Rajan",
                    "user_href": "/profile/Cyril-Rajan"
                },
                {
                    "user_id": "Michael Schweigert",
                    "user_href": "/profile/Michael-Schweigert-1"
                },
                {
                    "user_id": "Katie Blohm",
                    "user_href": "/profile/Katie-Blohm-1"
                },
                {
                    "user_id": "David Evans",
                    "user_href": "/profile/David-Evans-29"
                },
                {
                    "user_id": "Brooke Schwartz",
                    "user_href": "/profile/Brooke-Schwartz"
                },
                {
                    "user_id": "Zoë Dunning (she/they)",
                    "user_href": "/profile/Zoë-Dunning-she-they"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "James Keenley",
                    "user_href": "/profile/James-Keenley"
                },
                {
                    "user_id": "Mike Wu",
                    "user_href": "/profile/Mike-Wu-62"
                },
                {
                    "user_id": "B. Rathkeale Timmins",
                    "user_href": "/profile/B-Rathkeale-Timmins"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                },
                {
                    "user_id": "Kurtis Main",
                    "user_href": "/profile/Kurtis-Main-3"
                },
                {
                    "user_id": "Richard Wall",
                    "user_href": "/profile/Richard-Wall-14"
                },
                {
                    "user_id": "Harrison Luba",
                    "user_href": "/profile/Harrison-Luba"
                },
                {
                    "user_id": "Ihenacho Henry",
                    "user_href": "/profile/Ihenacho-Henry"
                },
                {
                    "user_id": "Richard Dintelman",
                    "user_href": "/profile/Richard-Dintelman"
                },
                {
                    "user_id": "Bridget McCrea",
                    "user_href": "/profile/Bridget-McCrea-1"
                },
                {
                    "user_id": "Melanie Wiegand",
                    "user_href": "/profile/Melanie-Wiegand"
                },
                {
                    "user_id": "Shintia Zaman Riva",
                    "user_href": "/profile/Shintia-Riva-1"
                },
                {
                    "user_id": "Ava Reid",
                    "user_href": "/profile/Ava-Reid-7"
                },
                {
                    "user_id": "Steven Grauwmans",
                    "user_href": "/profile/Steven-Grauwmans"
                },
                {
                    "user_id": "Will Jennings",
                    "user_href": "/profile/Will-Jennings-17"
                },
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                },
                {
                    "user_id": "Luke Takayoshi",
                    "user_href": "/profile/Luke-Takayoshi"
                },
                {
                    "user_id": "Scarlett DéLìon",
                    "user_href": "/profile/Scarlett-DéLìon"
                },
                {
                    "user_id": "Jeremy Bloch",
                    "user_href": "/profile/Jeremy-Bloch"
                },
                {
                    "user_id": "Elspeth Cowie",
                    "user_href": "/profile/Elspeth-Cowie"
                },
                {
                    "user_id": "Piyush Gautam",
                    "user_href": "/profile/Piyush-Gautam-71"
                },
                {
                    "user_id": "Ethan Kang",
                    "user_href": "/profile/Ethan-Kang-8"
                },
                {
                    "user_id": "Nicholas Gagarin",
                    "user_href": "/profile/Nicholas-Gagarin"
                },
                {
                    "user_id": "Rachel Bateman",
                    "user_href": "/profile/Rachel-Bateman-6"
                },
                {
                    "user_id": "Shashwat Khanna",
                    "user_href": "/profile/Shashwat-Khanna-1"
                },
                {
                    "user_id": "Atul Grover",
                    "user_href": "/profile/Atul-Grover-5"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Kartik V",
                    "user_href": "/profile/Kartik-V-9"
                },
                {
                    "user_id": "Akhil Aggarwal",
                    "user_href": "/profile/Akhil-Aggarwal-24"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "Abir Chawla",
                    "user_href": "/profile/Abir-Chawla"
                },
                {
                    "user_id": "Sean Sanders",
                    "user_href": "/profile/Sean-S-11"
                },
                {
                    "user_id": "Nabarun Choudhury",
                    "user_href": "/profile/Nabarun-Choudhury-3"
                },
                {
                    "user_id": "Nick Christodoulou",
                    "user_href": "/profile/Nick-Christodoulou-1"
                },
                {
                    "user_id": "Charlie Mason",
                    "user_href": "/profile/Charlie-Mason-26"
                },
                {
                    "user_id": "Claudio",
                    "user_href": "/profile/Claudio-48"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                },
                {
                    "user_id": "Joseph Ingram",
                    "user_href": "/profile/Joseph-Ingram-11"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-10448"
                },
                {
                    "user_id": "Christine Wendt",
                    "user_href": "/profile/Christine-Wendt"
                },
                {
                    "user_id": "Rafael Oliveira",
                    "user_href": "/profile/Rafael-Oliveira-55"
                },
                {
                    "user_id": "Liew Kim Thye",
                    "user_href": "/profile/Liew-Kim-Thye"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Adrien Letur",
                    "user_href": "/profile/Adrien-Letur"
                },
                {
                    "user_id": "Christian Lingan",
                    "user_href": "/profile/Christian-Lingan"
                },
                {
                    "user_id": "Nevi Løvfelt",
                    "user_href": "/profile/Nevi-Løvfelt"
                },
                {
                    "user_id": "Henry Brice",
                    "user_href": "/profile/Henry-Brice"
                },
                {
                    "user_id": "Jed E. Herman",
                    "user_href": "/profile/Jed-E-Herman"
                },
                {
                    "user_id": "Joseph Dedrick",
                    "user_href": "/profile/Joseph-Dedrick"
                },
                {
                    "user_id": "Monica Balakrishnan",
                    "user_href": "/profile/Monica-Balakrishnan"
                },
                {
                    "user_id": "Biswajit Singh",
                    "user_href": "/profile/Biswajit-Singh-3"
                },
                {
                    "user_id": "Frank Hollis",
                    "user_href": "/profile/Frank-Hollis"
                },
                {
                    "user_id": "Dev Joshi",
                    "user_href": "/profile/Dev-Joshi-9"
                },
                {
                    "user_id": "Aman Jha",
                    "user_href": "/profile/Aman-Jha-21"
                },
                {
                    "user_id": "Rebecca Wilova",
                    "user_href": "/profile/Rebecca-Wilova"
                },
                {
                    "user_id": "Jarod Bianti",
                    "user_href": "/profile/Jarod-Bianti"
                },
                {
                    "user_id": "Meghna Patel",
                    "user_href": "/profile/Meghna-Patel-46"
                },
                {
                    "user_id": "Paul Feist",
                    "user_href": "/profile/Paul-Feist-5"
                },
                {
                    "user_id": "Gary Ow",
                    "user_href": "/profile/Gary-Ow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicky Prest",
                "href": "/profile/Vicky-Prest"
            },
            "answer_text": "Yes, they can permanently delete your “fucking account”. Don't want it to be deleted? Use your real name or prove your real name if it's unusualDon't break the rulesAppeal any BNBRs or other offenses if you feel they are unjustified.Don't be a dickEDIT - Thought I'd check out who wrote this answer and saw your profile. Why do you keep using quora if you dislike it so much? Seriously, what do you get out of it if all you're trying to do is get banned?  ",
            "date": "Answered January 2, 2018",
            "views": "99",
            "upvotes": " View 263 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Pratyush Kumar",
                    "user_href": "/profile/Pratyush-Kumar-1"
                },
                {
                    "user_id": "Randy Vinluan",
                    "user_href": "/profile/Randy-Vinluan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Wilson",
                "href": "/profile/Tim-Wilson-9"
            },
            "answer_text": "The content of their terms of service  Your License to QuoraBy submitting, posting or displaying Content on or through the Service, you grant us a worldwide, non-exclusive, royalty-free license (with the right to sublicense) to use, copy, reproduce, process, adapt, modify, publish, transmit, display and distribute such Content in any and all media or distribution methods (now known or later developed). seems to indicate that you cannot force Quora to remove your data. You could sue (and I imagine they might give in and delete it just to get you to go away), but you don't really have any legal standing. For now, it appears the best you can do today without an enormous hassle is delete the data you can find manually and then deactivate your account. ",
            "date": "Answered January 26, 2013",
            "views": "43",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Debbie Scott",
                    "user_href": "/profile/Debbie-Scott-210"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Bowman",
                "href": "/profile/Sarah-Bowman-28"
            },
            "answer_text": "Where is my page to delete my Quora account? Follow these instructions and you should find it: Click on your profile photo.Click on Settings.Click on Privacy.Click on Delete Account as shown below.I think you then have to wait at least fourteen days for the account to be deleted. If you check back it will not be deleted. I would give it a month before checking back. Also note the difference between deactivate and delete. If you want it to be gone off the internet, click Delete. I saw your other question, too. I don’t know how Quora drags people in here unawares. You’re far from the only one. They’re really slippery, using Facebook and Twitter, etc.  ",
            "date": "Answered May 26, 2019",
            "views": "815",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yadav R.B.",
                    "user_href": "/profile/Yadav-R-B"
                },
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                },
                {
                    "user_id": "Rebecca Engels",
                    "user_href": "/profile/Rebecca-Engels"
                },
                {
                    "user_id": "Mike King",
                    "user_href": "/profile/Mike-King-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Schwarz Carigiet",
                "href": "/profile/Daniel-Schwarz-Carigiet"
            },
            "answer_text": "You can’t delete Quora, pumpkin. What you can do is decide that you would like a timeout from Quora. To do that, simply close your browser window or your app and get out into the fresh air. Go to the park, cook something nice with friends, enjoy life. If you want to really leave Quora, then that’s a little sad, but if you go into “Settings” and then “Privacy” (on a web browser), and then scroll down to the bottom of the list of options, you’ll find “Deactivate your account (in all languages)” which means that you can re-activate it again if you like later, or “Delete Account”, which is pretty self-explanatory. The “in all languages possibly only appears if you use Quora in more than just one language. Question: How do I get out of Quora? I don't see how to delete it. ",
            "date": "Answered September 8, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Helland",
                    "user_href": "/profile/Joshua-Helland-1"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Wren Jayasekara",
                    "user_href": "/profile/Wren-Jayasekara"
                },
                {
                    "user_id": "Connor Kuhn",
                    "user_href": "/profile/Connor-Kuhn"
                },
                {
                    "user_id": "David S. Rose",
                    "user_href": "/profile/David-S-Rose"
                },
                {
                    "user_id": "Mary Topolski",
                    "user_href": "/profile/Mary-Topolski"
                },
                {
                    "user_id": "Edward Morris",
                    "user_href": "/profile/Edward-Morris-9"
                },
                {
                    "user_id": "Macon Wilson",
                    "user_href": "/profile/Macon-Wilson-1"
                },
                {
                    "user_id": "Jeremy Bloch",
                    "user_href": "/profile/Jeremy-Bloch"
                },
                {
                    "user_id": "Karanvir Singh",
                    "user_href": "/profile/Karanvir-Singh-47"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                },
                {
                    "user_id": "Joel Cleveland",
                    "user_href": "/profile/Joel-Cleveland-1"
                },
                {
                    "user_id": "Jack Coe",
                    "user_href": "/profile/Jack-Coe-3"
                },
                {
                    "user_id": "Shane Doerre",
                    "user_href": "/profile/Shane-Doerre-1"
                },
                {
                    "user_id": "Ahmad Zulizham Mohd Sham",
                    "user_href": "/profile/Ahmad-Zulizham-Mohd-Sham"
                },
                {
                    "user_id": "Michael Lawrence",
                    "user_href": "/profile/Michael-Lawrence"
                },
                {
                    "user_id": "Yitzchok Mickler",
                    "user_href": "/profile/Yitzchok-Mickler"
                },
                {
                    "user_id": "Robert Burton",
                    "user_href": "/profile/Robert-Burton-9"
                },
                {
                    "user_id": "Anjeanette Jose",
                    "user_href": "/profile/Anjeanette-Jose-1"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Drew Ayers",
                    "user_href": "/profile/Drew-Ayers-1"
                },
                {
                    "user_id": "John Arceneaux",
                    "user_href": "/profile/John-Arceneaux-1"
                },
                {
                    "user_id": "John Varghese",
                    "user_href": "/profile/John-Varghese-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-10646"
                },
                {
                    "user_id": "Rob Whitney",
                    "user_href": "/profile/Rob-Whitney-6"
                },
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                },
                {
                    "user_id": "Cassandra Sullivan",
                    "user_href": "/profile/Cassandra-Sullivan-2"
                },
                {
                    "user_id": "Rodrigo Estrada Gil",
                    "user_href": "/profile/Rodrigo-Estrada-Gil"
                },
                {
                    "user_id": "Grace Ogden",
                    "user_href": "/profile/Grace-Ogden-1"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Klugman",
                "href": "/profile/Rick-Klugman"
            },
            "answer_text": "I've done it. Go into your bio. Just under in the right hand corner you'll see “…”. Tap on that and a drop down menu will appear. Tap on “settings”. Tap on “privacy”. Scroll down and tap on “delete account “. You'll then be ask to verify deletion. You then have a two week grace period until you become an ex-Quoran and all answers and comments go poof. Any questions that you've asked remain the property of Quora and will be tagged as “User”. And, no peeksies or you void the deletion process. Your account is then reactivated and you will need to have to start the process all over again. ",
            "date": "Answered July 2, 2017",
            "views": "33",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marilyn Polivka",
                    "user_href": "/profile/Marilyn-Polivka"
                },
                {
                    "user_id": "Nikita Verma",
                    "user_href": "/profile/Nikita-Verma-149"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/Akshay-Kumar-337"
                },
                {
                    "user_id": "Subham",
                    "user_href": "/profile/Subham-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Badoo Help",
                "href": "/profile/Badoo-Help"
            },
            "answer_text": "We're sad to see you want to leave! If you're really sure you want to go, please follow the instructions below if you’re using Badoo on a desktop PC: 1. Go to your own profile2. Click the cog icon in the top right corner3. Scroll to the bottom of the menu and click the 'Delete account' link To delete your profile on Android or iOS devices, please follow the instructions below: 1. Open your profile page2. Tap on the Gear icon in the top left corner3. Tap on 'Account'4. Tap on 'Delete account' at the bottom of the screen. If you can't see the 'Delete account' link it means that you need to verify your email address first; we sent you a verification email when you first joined. However, if you need us to send it again, please do let me know. I hope you found this helpful! ",
            "date": "Answered October 22, 2018",
            "views": "17",
            "upvotes": " Answer requested by Alex Parker",
            "upvoters": [
                {
                    "user_id": "C.H.",
                    "user_href": "/profile/C-H-865"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Taylor",
                "href": "/profile/Bill-Taylor-16"
            },
            "answer_text": "Sigh. I really wish that older women would teach younger women about men - it would save a lot of grief. They aren't explaining that men are far more physically driven than women, and they aren't telling What Drives Men to Marry? Women used to say, \"Not unless we're married, and I won't marry you unless you grow up and get a job.\" If a woman says she wants to marry but lets a man have her without marrying her, he feels that she's a liar. Marriage clearly means nothing to her or she would insist on it instead of just giving herself. If she gives herself to him without marriage, how can he trust her not to give herself to someone else? If he already has her, what would marrying her give him that he doesn't already have? Intimacy without commitment is like icing without the cake. It can be sweet, but it's going to end up making you sick. A woman sets her price by what she does. If her price is a few dinners or movies, she isn't worth much. If her price is that he dedicate his life to taking care of her before getting her, she can be a priceless treasure. What you do shouts so loudly that nobody can hear what you say. There are only two possible modes when a girl interacts with a guy: 1) she can be his toy or 2) she can be his treasure. You've all seen a little boy play with a truck. He pushes it this way and that, then, when he gets tired of it, he throws it away and grabs another toy. It is very hard on girls when boys get tired of them and throw them away; the book \"Unprotected\" by Miriam Grossman explains biological reasons why this is so. It is very wrong for a man to toy with a woman. Unfortunately, many men seem to feel that it is perfectly OK to play with a woman and throw her away. Enough women permit this that men can keep doing it for a long time. It sounds like he wants to play with both of you. If you tell your grandmother what you say to him and what he says to you, she can tell you. If you can't do that, you will find out in due time. To defend yourself against this happening again, you can do what my wife did to position herself when I told her I was going to date her, details here: What My Wife Told Me Before We Were Married When I did that, the wheels turned behind her eyes for a few seconds, she gulped, and said, \"Yes.\" As a woman, she was more interested in being wanted than in wanting. She knew that the time would come when she'd have the flu, she'd be pregnant out to HERE, the other kids would be leaking at both ends, the house would be hip-deep in diapers, and she'd be too sick to do anything about it. If I was really smitten with her, I'd stick around and help her through it instead of running off. That kind of attraction happens quickly and she could see it. She acknowledged my claim on her, but she laid out a few terms and conditions which are described in the article above, specifically that I acknowledge that she was a treasure and not a toy, using those exact words. She also insisted that I agree that the purpose of being together was to decide whether she and I would get married. That took her immediately out of the \"toy\" category. We've been married since 1971. It worked because I wanted her strongly enough to meet her terms and conditions, she wanted to be wanted, and because she really did want to be a treasure for her husband. Being treated as a treasure made her happy, and there is no joy for a man this side of heaven like having a woman like belonging to him. The important point was that she knew enough about men to demand that I treat her as a treasure and marriage candidate from the beginning. She tells young ladies to do that. If a guy walks away from a women who declares that she intends to be God's treasure for her husband, letting herself fall in love with him would be a BAD idea. There's an old saying about romance, \"It don't mean a thing if it ain't got that ZING!\" The zing is the man's desire for one specific woman. If it isn't there, there's no way to make it happen. There's another explanation of this concept at What Do Women Want? #8 - Courtship ",
            "date": "Answered June 18, 2017",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Austin Blessing",
                "href": "/profile/Austin-Blessing"
            },
            "answer_text": "Assuming you mean your account, here is a link that should help you. How do I delete my Quora account? Now, if you want to delete the whole company, you can’t unless you somehow acquire the company and shut it down, which is not easy to do. I suppose there may also be a way to delete the site through hacking, but besides the severe legal penalties you’d face (including civil actions, fines, and prison time), I assume it would be incredibly hard to do and since Quora probably has their data backed up they’d probably reinstate the site (even if some of the content was forever lost the website can still be reuploaded and I assume at least some of the content is backed up and could also be restored) so at the end of the day the site would still exist and you’d be in prison for a long time (and you’d also be forever hated by millions of Quorans). ",
            "date": "Answered February 22, 2020",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Ferral",
                "href": "/profile/Tom-Ferral"
            },
            "answer_text": "The question was: How do I cancel my Quora account? I'm tired of this site. Click on your user icon, located to the left of the “Add Question or Link” button in the upper right hand corner.Click on Settings in the menu which drops downOn the left, near the top of the page that is displayed, click PrivacyScroll down to the bottom of the next page and choose either Deactivate Account or Delete AccountFollow the instructions which will be displayedDeactivate Account will deactivate your account but y8ou can sign back in and reactivate it. Delete Account will delete your account completely - it will be gone and you will not be able to recover it. ",
            "date": "Answered December 13, 2018",
            "views": "446",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tarun Rohilla",
                "href": "/profile/Tarun-704"
            },
            "answer_text": "Well , if you want to know about the process of deleting your account permanently so here ia the steps but i want to tell you something Quora is far better than Any social media , that is my advice not to delete your account , anyways if you still want to do it then go ahead and read following steps : Step 1: Go to three dot option which is right most of your profile  Step -2 Go to settings of Quora  Step - 3  Step -4 Click on deactivate account / delete account . Then that's it , Your account will delete permanently and officially . Don't you think there is no need to delete your account , this is awesome platform compared to any social media , so before deleting your account think about it , Hope this will helpful for you :) ",
            "date": "Answered May 23, 2018",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kannan Iyer",
                    "user_href": "/profile/Kannan-Iyer-45"
                },
                {
                    "user_id": "Reba Schneider",
                    "user_href": "/profile/Reba-Schneider-1"
                },
                {
                    "user_id": "Donald Lyons",
                    "user_href": "/profile/Donald-Lyons-7"
                },
                {
                    "user_id": "Talya De Fay",
                    "user_href": "/profile/Talya-De-Fay"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Jacky Dror",
                    "user_href": "/profile/Jacky-Dror"
                },
                {
                    "user_id": "Fred Paul",
                    "user_href": "/profile/Fred-Paul-6"
                },
                {
                    "user_id": "Skye Walters",
                    "user_href": "/profile/Skye-Walters-3"
                },
                {
                    "user_id": "Will Jennings",
                    "user_href": "/profile/Will-Jennings-17"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mickey M. Bencetích",
                "href": "/profile/Mickey-M-Bencetích"
            },
            "answer_text": "Original Question:> How do I cancel Quora account?> Thank you for the A2A Claire. Go to ellipsis (•••) to the lower right of your profile page (where your photo is) and tap on it, next go to settings, then in settings go to privacy. Scroll down to the bottom of the page and you can choose to deactivate your account which can allow you to come back to Quora at any given time, or you can tap on delete which will entirely remove your account. Either process will take up to approximately two weeks, (usually) so once you choose to do either of these don't log back into your account or you will have to begin the process all over again. Best wishes in your choice. ",
            "date": "Answered February 3, 2017",
            "views": "31",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                },
                {
                    "user_id": "Jack Jones",
                    "user_href": "/profile/Jack-Jones-1034"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zinatul Iffah",
                "href": "/profile/Zinatul-Iffah"
            },
            "answer_text": "Considering there are 260 answers for this question, I wonder how can I help you. First, ask yourself. Do you want to delete your Quora account or deactivate it temporary? Why do you want to delete your Quora account? Are you sure you won’t regret it? Are you sure it is just a temporary mood swing? Second, if you are confident to delete your quora account, then go to your profile picture. A list of things will be appearing. Click on setting. Click on privacy. Down there, there is a section called deactivate account. Delete account. Simply press either one. Just remember that once you delete your account, it is irreversible. So think wisely. If it is a temporary, deactivate it instead. The account will be gone but you can activate them later. Good luck. ",
            "date": "Answered August 24, 2019",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tamoghna Chakrabarti",
                    "user_href": "/profile/Tamoghna-Chakrabarti-1"
                },
                {
                    "user_id": "Ellen Yahney",
                    "user_href": "/profile/Ellen-Yahney"
                },
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                },
                {
                    "user_id": "Joan Clarke",
                    "user_href": "/profile/Joan-Clarke-8"
                },
                {
                    "user_id": "Sunil Rao Scindhia",
                    "user_href": "/profile/Sunil-Rao-Scindhia"
                },
                {
                    "user_id": "Satyam Kumar",
                    "user_href": "/profile/Satyam-Kumar-447"
                },
                {
                    "user_id": "Sheena Hocking",
                    "user_href": "/profile/Sheena-Hocking"
                },
                {
                    "user_id": "Jonathan Schnapp",
                    "user_href": "/profile/Jonathan-Schnapp-3"
                },
                {
                    "user_id": "Linda Ball",
                    "user_href": "/profile/Linda-Ball-5"
                },
                {
                    "user_id": "Linda Barnard Waldroup",
                    "user_href": "/profile/Linda-Barnard-Waldroup"
                },
                {
                    "user_id": "Barrie Levine",
                    "user_href": "/profile/Barrie-Levine"
                },
                {
                    "user_id": "Sophia Dora Weiler",
                    "user_href": "/profile/Sophia-Dora-Weiler"
                },
                {
                    "user_id": "Phumla Nondala",
                    "user_href": "/profile/Phumla-Nondala"
                },
                {
                    "user_id": "Carol Lee Doeden",
                    "user_href": "/profile/Carol-Lee-Doeden"
                },
                {
                    "user_id": "Robbie Mowles",
                    "user_href": "/profile/Robbie-Mowles"
                },
                {
                    "user_id": "Bhawna Mishra",
                    "user_href": "/profile/Bhawna-Mishra-29"
                },
                {
                    "user_id": "Annemarie Stojkovic",
                    "user_href": "/profile/Annemarie-Stojkovic"
                },
                {
                    "user_id": "E Michelle Million",
                    "user_href": "/profile/E-Michelle-Million"
                },
                {
                    "user_id": "Max McClelland",
                    "user_href": "/profile/Max-McClelland"
                },
                {
                    "user_id": "Nancy Shaw",
                    "user_href": "/profile/Nancy-Shaw-9"
                },
                {
                    "user_id": "Jaimie Franklin Bell",
                    "user_href": "/profile/Jaimie-Franklin-Bell"
                },
                {
                    "user_id": "Paula Smith",
                    "user_href": "/profile/Paula-Smith-115"
                },
                {
                    "user_id": "Georgia Shore",
                    "user_href": "/profile/Georgia-Shore-1"
                },
                {
                    "user_id": "Bev Anne",
                    "user_href": "/profile/Bev-Anne-1"
                },
                {
                    "user_id": "Arul Dominic",
                    "user_href": "/profile/Arul-Dominic-1"
                },
                {
                    "user_id": "Devin Connelly",
                    "user_href": "/profile/Devin-Connelly-1"
                },
                {
                    "user_id": "Marius Gorvett",
                    "user_href": "/profile/Marius-Gorvett"
                },
                {
                    "user_id": "Laura Wrzeski",
                    "user_href": "/profile/Laura-Wrzeski"
                },
                {
                    "user_id": "Willie Coughlan",
                    "user_href": "/profile/Willie-Coughlan"
                },
                {
                    "user_id": "Christine Sorenson",
                    "user_href": "/profile/Christine-Sorenson"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Anita Palladino",
                    "user_href": "/profile/Anita-Palladino"
                },
                {
                    "user_id": "Eleanor Murray",
                    "user_href": "/profile/Eleanor-Murray-1"
                },
                {
                    "user_id": "Pádraic Breathnach",
                    "user_href": "/profile/Pádraic-Breathnach"
                },
                {
                    "user_id": "Marva Dasef",
                    "user_href": "/profile/Marva-Dasef"
                },
                {
                    "user_id": "Rebecca Wilova",
                    "user_href": "/profile/Rebecca-Wilova"
                },
                {
                    "user_id": "Caz Lessels",
                    "user_href": "/profile/Caz-Lessels"
                },
                {
                    "user_id": "Andrei Streche",
                    "user_href": "/profile/Andrei-Streche-1"
                },
                {
                    "user_id": "Hugo Quinonez",
                    "user_href": "/profile/Hugo-Quinonez-1"
                },
                {
                    "user_id": "Bruce Downing",
                    "user_href": "/profile/Bruce-Downing-1"
                },
                {
                    "user_id": "Pattie Huggins Deitrick",
                    "user_href": "/profile/Pattie-Huggins-Deitrick"
                },
                {
                    "user_id": "Richard Williams",
                    "user_href": "/profile/Richard-Williams-195"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Fitzjohn",
                "href": "/profile/Michael-Fitzjohn-1"
            },
            "answer_text": "There is no “Quora thing.” You can easily make it go away by not coming here. NO ONE is forcing you to come to this site. There are many sites on the net I will never go to. There are many radio stations I will never listen to. I TURN THE CHANNEL. Quora and I have our differences but their platform is the best I know of to read and learn from people all over the world. I like being educated. I like having a chance to be of use to people everywhere. Learning from and helping others is a good thing, not a bad thing. ",
            "date": "Answered August 12, 2018",
            "views": "32",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Colleen Kish Toupin",
                    "user_href": "/profile/Colleen-Kish-Toupin"
                },
                {
                    "user_id": "Katherine Ezell",
                    "user_href": "/profile/Katherine-Ezell-4"
                },
                {
                    "user_id": "Jack Lurhstaap Romero",
                    "user_href": "/profile/Jack-Lurhstaap-Romero"
                },
                {
                    "user_id": "Justin Leskovsky",
                    "user_href": "/profile/Justin-Leskovsky"
                },
                {
                    "user_id": "Shaun Haney",
                    "user_href": "/profile/Shaun-Haney"
                },
                {
                    "user_id": "Benjamin Thomas",
                    "user_href": "/profile/Benjamin-Thomas-46"
                },
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sundeesh Srikantam",
                "href": "/profile/Sundeesh-Srikantam"
            },
            "answer_text": "If your question is about deleting a quora account: To go profile > Settings (by clicking on the three dots (…) below YOUR CONTANT, on upper-right corner of your profile > privacy > delete / deactivate account Happy deactivation, hope to see you back later ! P.s : if you wanted to delete your account just because you are addicted to it, I would suggest you to deactivate your account and activate it when you have considerable amount of free time in your daily routine. ",
            "date": "Answered October 18, 2017",
            "views": "388",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Johnson",
                "href": "/profile/Brian-Johnson-577"
            },
            "answer_text": "Once you are on Quora you can never leave, what are they really doing with our personal information? Why won’t they let me delete my account? Quora will let you delete your account. To do so, you will need to go to the settings page by clicking on your profile picture and then settings.  From there, select Privacy[1]  From here, you can choose to either deactivate, which will turn off your account but leave the content for others to view, or delete, which will remove all of your content un-viewable by others.  Once you select one of these links, it will ask you to enter your password and then will give you a button to complete the action. If you want to know what data Quora collects and how they use it, a quick review of Quora’s privacy policy[2] is a good idea. Footnotes[1] https://www.quora.com/settings/privacy[2] https://www.quora.com/about/privacy",
            "date": "Answered December 6, 2019",
            "views": "21",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Cohen",
                    "user_href": "/profile/Tom-Cohen-7"
                },
                {
                    "user_id": "Abraham Mwenda",
                    "user_href": "/profile/Abraham-Mwenda"
                },
                {
                    "user_id": "Kshitij Gondhalekar",
                    "user_href": "/profile/Kshitij-Gondhalekar"
                },
                {
                    "user_id": "Michael Chavez",
                    "user_href": "/profile/Michael-Chavez-97"
                },
                {
                    "user_id": "Rakshith Dasenahalli Lingaraju",
                    "user_href": "/profile/Rakshith-Dasenahalli-Lingaraju-1"
                },
                {
                    "user_id": "Amith Mallya",
                    "user_href": "/profile/Amith-Mallya"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Tilak Kumar (ತಿಲಕ್ ಕುಮಾರ್)",
                    "user_href": "/profile/Tilak-Kumar-ತಿಲಕ್-ಕುಮಾರ್"
                },
                {
                    "user_id": "Denise Canty",
                    "user_href": "/profile/Denise-Canty-1"
                },
                {
                    "user_id": "Wilson Walker",
                    "user_href": "/profile/Wilson-Walker"
                },
                {
                    "user_id": "Chris Thain",
                    "user_href": "/profile/Chris-Thain"
                },
                {
                    "user_id": "Hemant Singh",
                    "user_href": "/profile/Hemant-Singh-90"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                },
                {
                    "user_id": "Brandon Lesche",
                    "user_href": "/profile/Brandon-Lesche"
                },
                {
                    "user_id": "Rynnah Lim",
                    "user_href": "/profile/Rynnah-Lim"
                },
                {
                    "user_id": "Jared Zwick",
                    "user_href": "/profile/Jared-Zwick"
                },
                {
                    "user_id": "Jereme Allison",
                    "user_href": "/profile/Jereme-Allison"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kat-Said-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gordon Miller",
                "href": "/profile/Gordon-Miller-21"
            },
            "answer_text": "Well, it isn’t like getting pregnant from sex that you don’t recall having, at some point you had to actually navigate to http://Quora.com and sign in, either with your email or social media account. It can be as easy as clicking one button, so it is easy to overlook. That said, it isn’t like a gym membership, you can quit anytime. There is a Delete Account option under your account settings. ",
            "date": "Answered November 2, 2017",
            "views": "42",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lora Gilliland-Schneider",
                    "user_href": "/profile/Lora-Gilliland-Schneider"
                },
                {
                    "user_id": "Elijah Salvatore",
                    "user_href": "/profile/Elijah-Salvatore"
                },
                {
                    "user_id": "Marco Sanvido",
                    "user_href": "/profile/Marco-Sanvido"
                },
                {
                    "user_id": "Sandy Wasserman",
                    "user_href": "/profile/Sandy-Wasserman"
                },
                {
                    "user_id": "Ben Lowers",
                    "user_href": "/profile/Ben-Lowers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tristan Irwin",
                "href": "/profile/Tristan-Irwin"
            },
            "answer_text": "To change your email settings, You would got to http://www.quora.com/settingsThere is a section marked Email Settings which contains links to change when Quora emails you. You can check or uncheck any of these settings to enable or disable receiving email messages when these events occur. If you wish to deactivate your account, there is also a link on the page which will allow you to do this. If you deactivate your account, you will not receive any emails from Quora and users will not be able to interact with you. ",
            "date": "Answered August 17, 2012",
            "views": "47",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janet Buntz",
                    "user_href": "/profile/Janet-Buntz"
                },
                {
                    "user_id": "Jack Coe",
                    "user_href": "/profile/Jack-Coe-3"
                },
                {
                    "user_id": "Matthew Daneman",
                    "user_href": "/profile/Matthew-Daneman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Hawk",
                "href": "/profile/Christopher-Hawk"
            },
            "answer_text": "“I did not request to be a part of this site, how do I get removed from it?” Aside from Mandy Trouten's advice on how to deactivate your Quora account, you might want to consider how your name and email were added to the site. Sometime before February 27th, 2018, someone used your name and email address to create an account on Quora. That person was even nice enough to add some profile information to the account! On February 27, your account shows a flurry of activity, following various topics and people. If that was not you, I have to wonder how you were able to to sign into the account to post this question... ",
            "date": "Answered March 8, 2018",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Goodman",
                    "user_href": "/profile/James-Goodman-18"
                },
                {
                    "user_id": "Delia Marheineke",
                    "user_href": "/profile/Delia-Marheineke"
                },
                {
                    "user_id": "Aniyah Smith",
                    "user_href": "/profile/Aniyah-Smith-48"
                },
                {
                    "user_id": "Pratik Joshi",
                    "user_href": "/profile/Pratik-Joshi-17"
                },
                {
                    "user_id": "Jeeson Quadros",
                    "user_href": "/profile/Jeeson-Quadros-1"
                },
                {
                    "user_id": "Akarsh Singh",
                    "user_href": "/profile/Akarsh-Singh-41"
                },
                {
                    "user_id": "Gaurav Kumar",
                    "user_href": "/profile/गौरव-कुमार-Gaurav-Kumar"
                },
                {
                    "user_id": "Marudhu Sathish",
                    "user_href": "/profile/Marudhu-Sathish"
                },
                {
                    "user_id": "Kishan Patel",
                    "user_href": "/profile/Kishan-Patel-722"
                },
                {
                    "user_id": "Aayan Haque",
                    "user_href": "/profile/Aayan-Haque-1"
                },
                {
                    "user_id": "Mohit Savaliya",
                    "user_href": "/profile/मोहित-सांवलिया-Mohit-Savaliya"
                },
                {
                    "user_id": "Siddalingeshwara",
                    "user_href": "/profile/Siddalingeshwara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manju Gangadhar",
                "href": "/profile/Manju-Gangadhar"
            },
            "answer_text": "Quora Addiction is not bad! Less marks in exam. Blame it on quora.Late to office. Blame it on quora.Mood out. Blame it on quora.Woke up late. Blame it on quora.No charge in mobile. Blame it on quora.No time for exercise. Blame it on quora.Not getting sleep. Blame it on quora.Why? Who told us to use quora to that extent? This is what happening. We want everything to go hand to hand just because we are using quora. Absolutely it will not. We have to do what is needed, until then nothing will change. We read the fact that we should not use social media much in Quora itself. But we don’t apply it. We still continue to use Quora. Quora is rich source of knowledge. Ability to apply that knowledge is what decides whether quora addiction is good or bad. ‘knowing is not doing, Doing is doing’. “I came across the fact that some people are leaving quora just because they got addict. This answer is written by considering that fact” Thanks for reading :-) ",
            "date": "Answered November 15, 2017",
            "views": "47",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaune Harvey",
                    "user_href": "/profile/Shaune-Harvey"
                },
                {
                    "user_id": "Gleryl Price",
                    "user_href": "/profile/Gleryl-Price"
                },
                {
                    "user_id": "Art Retti",
                    "user_href": "/profile/Art-Retti"
                },
                {
                    "user_id": "Ashutosh Gour",
                    "user_href": "/profile/Ashutosh-Gour"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Chandler",
                "href": "/profile/Tom-Chandler-16"
            },
            "answer_text": "Like many other “addictions” there are several options. Remove the app from your cell phone, then The best : delete your account, which removes all email updates and remonders that Quora is there waiting to suck you in. This is the “cold turkey” quit option. Just do it once and don’t look back. Next best: Suspend your account, this will stop email notifications, but if you log in to look at an answer, you account will reactivate without notice. Get tough : Just ignore all those notifications and make yourself tougher each time you are able to ignore a notice to get sucked back here. ",
            "date": "Answered February 4, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shell Majumdar",
                    "user_href": "/profile/Shell-Majumdar"
                },
                {
                    "user_id": "Samy Alkadi",
                    "user_href": "/profile/Samy-Alkadi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kizze Cumberbatch",
                "href": "/profile/Kizze-Cumberbatch"
            },
            "answer_text": "To delete Quora go to settings. Settings is located in the drop down box when you click on your image. On the left hand side of the screen click privacy. Scroll to the bottom and see delete account. Quora will give you fourteen days before account is completely deleted. If you sign back in before the fourteen days are up, you account will be automatically reactivated and the deletion process cancelled. Quora will send you an email about the deletion. If you sign back into Quora before the fourteen days you will get an email about that as well. ",
            "date": "Answered July 15, 2017",
            "views": "652",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Greifzu",
                    "user_href": "/profile/Richard-Greifzu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Hulse",
                "href": "/profile/Mike-Hulse-1"
            },
            "answer_text": "The easiest way is to plagiarize some really vile and bigoted stuff so that the Quora police ban you from the site. It happens pretty quickly, and you won’t ever have to worry about coming back. Alternatively, you could just delete your account. If that’s too hard, eliminate your email notifications from Quora, go away, and never log in again. I would like to say that I’m going to miss you, but since I don’t even know who you are, that would be an obvious lie. ",
            "date": "Answered April 14, 2018",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noname Lastname",
                    "user_href": "/profile/Noname-Lastname-1"
                },
                {
                    "user_id": "Nan Waldman",
                    "user_href": "/profile/Nan-Waldman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Stockley",
                "href": "/profile/Paul-Stockley"
            },
            "answer_text": "[Responding to question details which were in a different question; now merged, referring to a problem solved by changing a name] The best, easiest option is just to edit your name. Go to your profile page (click your 'name', on the Quora toolbar). On your profile page, mouse over your name, you'll see the word 'edit' appear in grey at the right-hand end. Click it and change your name.  (If you have set a general bio line, you'll need to click a second 'edit'.) Save the change and breathe easy.  There's no need to deactivate your account, but that's usually enough to 'close' an account. If, in the end, you really want to close and delete your account, email privacy@quora.com. They are the only one who can do that. ",
            "date": "Updated May 31, 2015",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Orion A. Watson",
                    "user_href": "/profile/Orion-A-Watson"
                },
                {
                    "user_id": "Sando D",
                    "user_href": "/profile/Sando-D"
                },
                {
                    "user_id": "Barbara Tenn Kinn",
                    "user_href": "/profile/Barbara-Tenn-Kinn"
                },
                {
                    "user_id": "Carol L. Tollison",
                    "user_href": "/profile/Carol-L-Tollison"
                },
                {
                    "user_id": "Haseeb Ali",
                    "user_href": "/profile/Haseeb-Ali-63"
                },
                {
                    "user_id": "Raja Moiz",
                    "user_href": "/profile/Raja-Moiz-1"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                },
                {
                    "user_id": "Lizzie Spring",
                    "user_href": "/profile/Lizzie-Spring"
                },
                {
                    "user_id": "Alex Lefebvre",
                    "user_href": "/profile/Alex-Lefebvre-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milton D'Souza",
                "href": "/profile/Milton-DSouza-2"
            },
            "answer_text": "There is no way to leave Quora. Once you are in you are in. Forever. Haven’t you heard the song Hotel California? \"Relax, \" said the night man,\"We are programmed to receive.You can check-out any time you like,But you can never leave! \" Okay, I am done with my bullshit. If you want to delete your account, you go to Settings > Privacy > Delete Account It was nice knowing you. ",
            "date": "Answered November 5, 2017",
            "views": "649",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Franz",
                    "user_href": "/profile/Jim-Franz"
                },
                {
                    "user_id": "Gary Fasso",
                    "user_href": "/profile/Gary-Fasso"
                },
                {
                    "user_id": "Jim Murphy",
                    "user_href": "/profile/Jim-Murphy-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Hand",
                "href": "/profile/Peter-Hand-4"
            },
            "answer_text": "You haven’t been here very long, Mary - this is your only question and you have written no answers. What you may not realize is that a lot of the people who hang out and write here are of your generation. Me, I could be your younger brother, but I’m too old to be your son. I come here and write so that the young whippersnappers will get some quality answers and maybe learn something, and I often learn new things myself from what I find here. Why don’t you stick around and share some of your own experience. If you really want to get rid of Quora, just stop coming to the site. ",
            "date": "Answered December 6, 2017",
            "views": "745",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Owen",
                    "user_href": "/profile/Chris-Owen-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Wright",
                "href": "/profile/Lisa-Wright-510"
            },
            "answer_text": "I don't understand that why do you want to delete your account? Just because you don't want one specific edit history, you want to delete your account. Not a good idea. Why? The process of deletion isn't that easy. It takes time. Initially, 14 days deactivation period, then deletion and then also I can't assure you whether you could use same email account to create a new account because I didn't know about it specifically. So, due to one edit history, would you like to go through this process and still you don't know whether Quora will allow you to create new account with same email id or not. Though, I'll suggest one to maybe not erase your account due to one edit record. It does not make a positive change. Or, if you want to erase, after that go here post to understand the deletion measures: How do I delete my Quora account? Hope it will help. Thank you! ",
            "date": "Answered March 19, 2020",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Hartanto",
                "href": "/profile/William-Hartanto"
            },
            "answer_text": "Question: How do I shut off Quora? Answer: You can choose between these 2 equally great options You can run a DDOS (distributed denial of service) attack on their server. At least until the FBI or local police are knocking on your door, then you don’t have to worry about internet for a few years in jail.You can click this X icon on the top right of your browser, and then turn off the notification for the quora apps on your mobile phone.",
            "date": "Answered September 20, 2017",
            "views": "365",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sania Khan",
                    "user_href": "/profile/Sania-Khan-156"
                },
                {
                    "user_id": "Donnie Hill",
                    "user_href": "/profile/Donnie-Hill-3"
                },
                {
                    "user_id": "Daniel Dudgeon",
                    "user_href": "/profile/Daniel-Dudgeon"
                },
                {
                    "user_id": "Michael Seid",
                    "user_href": "/profile/Michael-Seid-2"
                },
                {
                    "user_id": "Gerard Luft",
                    "user_href": "/profile/Gerard-Luft"
                },
                {
                    "user_id": "Hamna Shabbir",
                    "user_href": "/profile/Hamna-Shabbir"
                },
                {
                    "user_id": "Ana Pereira",
                    "user_href": "/profile/Ana-Pereira-148"
                },
                {
                    "user_id": "Mohammad Omar Khan",
                    "user_href": "/profile/Mohammad-Omar-Khan-2"
                },
                {
                    "user_id": "Pranjal Jharkharia",
                    "user_href": "/profile/Pranjal-Jharkharia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angelique Valentini",
                "href": "/profile/Angelique-Valentini"
            },
            "answer_text": "I think for me, it's all the achievements I've made. I reached 2 million answer views last month, and reached 200 followers not long ago. I became Most Viewed Writer in a few topics, even though I never got number one. In April 2018, I unexpectedly got a Top Writer badge. I earned a follow from a few popular Quorans, and made a few new friends. There's also having written 2,000+ answers, something that took me close to two years to write. I've come so far, so something like deleting my Quora profile is like setting my house on fire. If my Quora got deleted or I got banned for whatever reason, I don't think I would ever come back. I don't want to achieve all that again a second time, as it would take a few years to get what I've lost. Luckily I screenshot every one of my achievements as proof that I did something positive. ",
            "date": "Answered March 8, 2019",
            "views": "542",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Enda O'Kane",
                    "user_href": "/profile/Enda-OKane-1"
                },
                {
                    "user_id": "Joan Round",
                    "user_href": "/profile/Joan-Round"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miles-Kevin Baron",
                "href": "/profile/Miles-Kevin-Baron"
            },
            "answer_text": "It generally depends on the site, but more legit forums and the like you can just contact the webmaster or admin and ask to be removed. As to “how” you joined… again, depending on the site.. it’s possible “you” didn’t sign up, but some malicious bot got ahold of your email address and used it to sign up. I run several forums and get 100’s of signup attempts from hijacked email accounts. In our case, their initial password is sent to the email address they use to sign up, so… unless they actually have access to the account, it’s meaningless noise. Anyway… I find the best way to resolve these issues is just contact the site involved and ask to be removed. ",
            "date": "Answered February 12, 2018",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nan Walker",
                    "user_href": "/profile/Nan-Walker"
                },
                {
                    "user_id": "Vipin Chandran",
                    "user_href": "/profile/Vipin-Chandran-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzel Veracruz",
                "href": "/profile/Suzel-Veracruz"
            },
            "answer_text": "Just stop posting answers or asking questions on it. You can deactivate your account too, I am sure there is a link somewhere or you can also write to the moderators or people in charge of Quora. I think it may be easier though to just not go here anymore. I am sorry that you did not like it. I know that it can be a soapbox for people (aka trolls sometimes) and there are heated conversations and arguements here (all because of the safety and comfort of their keyboards!). Good luck and hopefully you find another site that you like better that can help you have a sense of friendship, support or community! …Either that, or give it a rest for a while and see where that leads you. Come back after a short break. You can also try to just subscribe to topics that you do like and ignore and unsubscribe to the ones you don’t. Again, good luck! :-) ",
            "date": "Answered December 27, 2017",
            "views": "288",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Davidson",
                "href": "/profile/Kevin-Davidson-9"
            },
            "answer_text": "To delete or disable a Quora account, go your profile link and choose settings. Then click “Privacy” from the list on the left side. There are links at the bottom of that page to disable or delete your account. BUT it’s not quite that easy. Once you tell Quora to delete your account, there is a time window before it actually deletes (several days). If you accidentally touch Quora logged in, Quora assumes you don’t want to delete the account, and turns off your deletion request. I have two accounts on Quora by accident. I’ve been trying for ages to delete one, but it keeps getting restored. ",
            "date": "Answered April 9, 2018",
            "views": "8",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuelgatton .",
                    "user_href": "/profile/Samuelgatton"
                },
                {
                    "user_id": "Sando D",
                    "user_href": "/profile/Sando-D"
                },
                {
                    "user_id": "Ramon S Ramsey",
                    "user_href": "/profile/Ramon-S-Ramsey"
                },
                {
                    "user_id": "Ja Walker",
                    "user_href": "/profile/Ja-Walker-1"
                },
                {
                    "user_id": "Nina Zala",
                    "user_href": "/profile/Nina-Zala"
                },
                {
                    "user_id": "David Backlin",
                    "user_href": "/profile/David-Backlin-1"
                },
                {
                    "user_id": "Madeline Tallulah Watson",
                    "user_href": "/profile/Madeline-Tallulah-Watson"
                },
                {
                    "user_id": "Jessica Steimel",
                    "user_href": "/profile/Jessica-Steimel"
                },
                {
                    "user_id": "Tom Monk",
                    "user_href": "/profile/Tom-Monk-3"
                },
                {
                    "user_id": "Alani Valdez",
                    "user_href": "/profile/Alani-Valdez"
                },
                {
                    "user_id": "Jesse Haughton",
                    "user_href": "/profile/Jesse-Haughton-1"
                },
                {
                    "user_id": "Linda Mathies",
                    "user_href": "/profile/Linda-Mathies-1"
                },
                {
                    "user_id": "Beverly Asmutis",
                    "user_href": "/profile/Beverly-Asmutis"
                },
                {
                    "user_id": "Stacy Jalbert",
                    "user_href": "/profile/Stacy-Jalbert"
                },
                {
                    "user_id": "Pam Atkins",
                    "user_href": "/profile/Pam-Atkins-6"
                },
                {
                    "user_id": "Tom Underwood",
                    "user_href": "/profile/Tom-Underwood-8"
                },
                {
                    "user_id": "Ren Rick",
                    "user_href": "/profile/Ren-Rick"
                },
                {
                    "user_id": "Jennifer Turner",
                    "user_href": "/profile/Jennifer-Turner-244"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angela McLean",
                "href": "/profile/Angela-McLean-18"
            },
            "answer_text": "I most definitely did not sign up Possibly it sedms Quora has “misappropriated” my details from something else I did I do not authorise nor want Quora and it has accessed my information without my informed consent. I want my details removed and as I did not willingly join dint see whyI should have to go in and cancel. Ayou have no right to my details whether legal or moral I have not followed snyone BAD PRACTICE QUORA!!!!! ",
            "date": "Answered May 8, 2018",
            "views": "14",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Kihiro Tanakamaru",
                    "user_href": "/profile/Kihiro-Tanakamaru"
                },
                {
                    "user_id": "Pravasi Meet",
                    "user_href": "/profile/Pravasi-Meet"
                },
                {
                    "user_id": "Jeremy Glenesk",
                    "user_href": "/profile/Jeremy-Glenesk"
                },
                {
                    "user_id": "Lorenz Duremdes",
                    "user_href": "/profile/Lorenz-Duremdes"
                },
                {
                    "user_id": "Har Wen Jun",
                    "user_href": "/profile/Har-Wen-Jun"
                },
                {
                    "user_id": "Shahnoor Dhanani",
                    "user_href": "/profile/Shahnoor-Dhanani"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Lucienne LeBeau",
                    "user_href": "/profile/Lucienne-LeBeau"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Wren Jayasekara",
                    "user_href": "/profile/Wren-Jayasekara"
                },
                {
                    "user_id": "Kaustuv K Chattopadhyay",
                    "user_href": "/profile/Kaustuv-K-Chattopadhyay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Good",
                "href": "/profile/Craig-Good"
            },
            "answer_text": "You can go through and delete any of your answers. Just go to the question page. You do not have any questions. Questions belong to Quora. You may have asked some, but you can’t delete them because they are no longer yours. You seem to have a rather strange idea of what censorship means and how Quora works. I don’t think you’ll be missed. ",
            "date": "Answered October 2, 2016",
            "views": "42",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noah Topping",
                    "user_href": "/profile/Noah-Topping"
                },
                {
                    "user_id": "Scott Blanch",
                    "user_href": "/profile/Scott-Blanch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Adams",
                "href": "/profile/Aaron-Adams-67"
            },
            "answer_text": "Here's the only way I know to do this: Go over to the “You” tab, and then to “Your Content”  That will give a list of all answers you've ever made. From there you can go to an answer, click its triple-dot menu icon, and click Delete Answer.  However, I don't think you actually need to do this. Somebody please correct me if I'm wrong, but I believe all your answers either become dissasociated with you (“Written by Quora User”) or become automatically deleted. ",
            "date": "Answered September 14, 2017",
            "views": "335",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shaban Noman",
                "href": "/profile/Shaban-Noman"
            },
            "answer_text": "Erase the existence of it then. Go to your settings, privacy settings then delete your account. Simple, but I guess you meant something else so… Just delete the app or any shortcut to this website, turn off any notifications or emails or anything that’ll remind you of this basically. You won’t be here nor will your account be. Find a new hobby or something to pass your time with so whenever you do somehow think, ‘I’m bored, a few minutes on Quora wouldn’t hurt,’ you instead just squash that thought and play a new game, read a book, watch something or whatever it is you occupy your time with. Done and dusted. ",
            "date": "Answered July 2, 2018",
            "views": "375",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shahnoor Dhanani",
                    "user_href": "/profile/Shahnoor-Dhanani"
                },
                {
                    "user_id": "Aditya Biswal",
                    "user_href": "/profile/Aditya-Biswal"
                },
                {
                    "user_id": "Nell Zhang",
                    "user_href": "/profile/Nell-Zhang"
                },
                {
                    "user_id": "Erik Holladay",
                    "user_href": "/profile/Erik-Holladay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Markeith Thompson",
                "href": "/profile/Jeremy-Markeith-Thompson"
            },
            "answer_text": "This answer from Quora will provide the necessary information to delete your Quora account. Please understand that it takes 14 days to permanently delete your account. Provided by Quora: “If you are certain you wish to delete your account, visit your account privacy settings and choose “Delete Account”. Once you confirm, your account will be deactivated immediately and the deletion process will begin. If you login during the next 14 days, the account will be reactivated and deletion will be canceled.” This link leads to the official Quora account answer. Quora's answer to How do I delete my Quora account? ",
            "date": "Answered September 18, 2017",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luis Rocha",
                    "user_href": "/profile/Luis-Rocha-12"
                },
                {
                    "user_id": "Ben Dermoudy",
                    "user_href": "/profile/Ben-Dermoudy-1"
                },
                {
                    "user_id": "Jennifer Moore",
                    "user_href": "/profile/Jennifer-Moore-213"
                },
                {
                    "user_id": "Blair James Stuart",
                    "user_href": "/profile/Blair-James-Stuart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melissa Mcginnis",
                "href": "/profile/Melissa-Mcginnis-1"
            },
            "answer_text": "I found the answer for you, and it’s quite simple. Hover over your picture, it brings up a menu. Click settings. (I sometimes get a blank page, if that happens, just try refreshing.) On the left is another menu, click “privacy”. Scroll down to the bottom, and there are two options: One to deactivate your account (It’s still there, but, well, inactive.) and the other to delete your account. Beyond that, there might be a confirmation pop-up or two, I’m not sure. Take care. ",
            "date": "Answered November 5, 2017",
            "views": "238",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ghazi Al-Marayati",
                "href": "/profile/Ghazi-Al-Marayati"
            },
            "answer_text": "Quora is a complete joke and an enemy of truth. It is place where the ignorant gather to provide misinformation on a wide variety of topics about which they know nothing, and then bully and silence through moderation those who have they temerity simply to say, “No, that is wrong.” The site is far more concerned about snowflakes getting their feelings hurt by merely being told they are incorrect, than with assuring the accuracy of content. Anyone who looks to Quora for information deserves to follow the advice they get. ",
            "date": "Answered April 18, 2019",
            "views": "341",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harshit Madan",
                    "user_href": "/profile/Harshit-Madan-9"
                },
                {
                    "user_id": "Vikas Singh",
                    "user_href": "/profile/Vikas-Singh-461"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Rathod",
                "href": "/profile/Anand-Rathod-5"
            },
            "answer_text": "Hello......first of all i want to say something to you..me either was sufferin g from the same kind of problem ..i use to open this app very frequently...(once in 30 min)...even when i got my exams near ..it was highly impossible to stop the quora from reading...i got four subjects back(engg)..and the reason behind this is only quora ..but wen i explained this problem to my one of the favourite lecturer named \"miskin\"..he gave me a very fantastic decision ..u might be wondering by his reply...he directly said me to uninstall the app..i did it and now im very happy in my life ...nw im able to concentrate at my studies .and i have scored 91 percent in my engg 3rd year ...i really very thank full to mr miskin .....u too do the same think .... ",
            "date": "Answered October 3, 2015",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anitha Webcomm",
                    "user_href": "/profile/Anitha-Webcomm"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Blood",
                "href": "/profile/Brian-Blood-3"
            },
            "answer_text": "I don't get what your problem is. You opened your account with your real name. That is good. You are required to use your real name on Quora. Did you change your profile name from your real name or did you just delete your surname? Trust me, just because it shows up in the edit log doesn't mean a lot of people will see it. Most don't even look there. I just look there to see if there is a reason why someone was banned from Quora. I can tell you that what ever the reason is that you are wanting to delete your account for, it is not worth it. Unless you truly want to leave Quora, you should not delete your account. If you do end up still wanting to delete your account see How do I delete my Quora account? for more information. ",
            "date": "Answered November 12, 2015",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Todd Gardiner",
                    "user_href": "/profile/Todd-Gardiner"
                },
                {
                    "user_id": "Casey Allen",
                    "user_href": "/profile/Casey-Allen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Vinluan",
                "href": "/profile/Randy-Vinluan"
            },
            "answer_text": "You opened your account of your own free will, and unless you really want to waste your money and sue them on the very remote possibility that you may win, Quora (and FB, and Google, and name-your-favorite consumer Internet company) will keep your data (which is probably useless anyway)  and will try to make what they can of it for as long as they can.  Nobody wants to pay for most things on the Internet and this is the business model most sites have come up with to continue to create and maintain services that have proven useful to people. Deal with it. ",
            "date": "Answered January 26, 2013",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Jiakang Xie",
                    "user_href": "/profile/Jiakang-Xie"
                },
                {
                    "user_id": "Michael Burry",
                    "user_href": "/profile/Michael-Burry-5"
                },
                {
                    "user_id": "Al Marshall",
                    "user_href": "/profile/Al-Marshall-6"
                },
                {
                    "user_id": "Ashfaq Manzoor",
                    "user_href": "/profile/Ashfaq-Manzoor"
                },
                {
                    "user_id": "B.J. Cobbledick",
                    "user_href": "/profile/B-J-Cobbledick-1"
                },
                {
                    "user_id": "Abhiraam Khanna",
                    "user_href": "/profile/Abhiraam-Khanna"
                },
                {
                    "user_id": "Patrick Appell",
                    "user_href": "/profile/Patrick-Appell"
                },
                {
                    "user_id": "Kihiro Tanakamaru",
                    "user_href": "/profile/Kihiro-Tanakamaru"
                },
                {
                    "user_id": "Tyron Nathan King",
                    "user_href": "/profile/Tyron-King"
                },
                {
                    "user_id": "Vijay Anand",
                    "user_href": "/profile/Vijay-Anand-199"
                },
                {
                    "user_id": "Kathy Smith",
                    "user_href": "/profile/Kathy-Smith-1245"
                },
                {
                    "user_id": "Nitesh Ranjan",
                    "user_href": "/profile/Nitesh-Ranjan-81"
                },
                {
                    "user_id": "Robin Hubbard",
                    "user_href": "/profile/Robin-Hubbard-6"
                },
                {
                    "user_id": "Elijah Salvatore",
                    "user_href": "/profile/Elijah-Salvatore"
                },
                {
                    "user_id": "Nathan Deunk",
                    "user_href": "/profile/Nathan-Deunk"
                },
                {
                    "user_id": "Pooja Sharma",
                    "user_href": "/profile/Pooja-Sharma-1575"
                },
                {
                    "user_id": "Omkar Salgaonkar",
                    "user_href": "/profile/Omkar-Salgaonkar-1"
                },
                {
                    "user_id": "Deepak Lukkad",
                    "user_href": "/profile/Deepak-Lukkad"
                },
                {
                    "user_id": "Sadanand Wachche",
                    "user_href": "/profile/Sadanand-Wachche"
                },
                {
                    "user_id": "Rupert Baines",
                    "user_href": "/profile/Rupert-Baines"
                },
                {
                    "user_id": "Ravi Babu",
                    "user_href": "/profile/Ravi-Babu-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Maddy",
                "href": "/profile/Sam-Maddy-4"
            },
            "answer_text": "Totally cancel Quora! If you are serious about it, do following.Stop using computer.Stop using your mobile phone.Why do I say so?You seem to be addicted to Quora. So this the best way to cancel quora from your mind, rather than from the web. Update! The answer was meant for “Totally cancel Quora” What is cancellation? If somebody does not want to use it, just stop logging into Quora.If you are using it on phone remove the App.Deactivate account.My answer was for the people who are addicted. Who can not stop themselves from using it. That was the intention behind the answer. People who are addicted, the get tempted to use it, if they use computer and mobile. ",
            "date": "Updated February 13, 2018",
            "views": "770",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Munachimso Emeka",
                "href": "/profile/Munachimso-Emeka"
            },
            "answer_text": "Munachimso, can you answer this question?People are searching for a better answer to this questio. Go to your Account Settings.Click the Delete Account link at the bottom of the Account Page.select a reason why you want to delete your account.Click the orange Delete My Account button.Click the Confirm button on the window that appears. 5 then wait for the confirmation and delete.",
            "date": "Answered March 6, 2019",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Harrison",
                "href": "/profile/Mark-Harrison-2"
            },
            "answer_text": "Subscribe to lots of really irritating topics, and people with whose views you strongly disagree. Gradually, you will find it full of content that either bores you, or rubs you up the wrong way. ",
            "date": "Answered April 25, 2014",
            "views": "22",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leigh Kerrigan",
                    "user_href": "/profile/Leigh-Kerrigan-2"
                },
                {
                    "user_id": "Margot Seaton",
                    "user_href": "/profile/Margot-Seaton"
                },
                {
                    "user_id": "Andres Pilquil Varas",
                    "user_href": "/profile/Andres-Pilquil-Varas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Claus Lindemann Mikkelsen",
                "href": "/profile/Claus-Lindemann-Mikkelsen"
            },
            "answer_text": "Don’t read this answer, that will be a start. Then when you are done not reading my answer, stop asking questions. If it gets too hard try to find a real-life hobby. Woodcarving is nice I hear. You could also get a dog and walk it every time the urge to quora appears. If none of that works, start a thread on Reddit. Call it r/how-to-get-completely-out-of-quora. It will probably get a lot of hits, and you will find yourself spending a vast amount of time reading and commenting on that thread. This will leave you no time for Quora. If you find yourself asking “how can I get completely out of Reddit…” in about half a year, then post a new question here on Quora. Then answer it yourself by copy pasting this answer and replace Reddit with Quora and Quora with Reddit. When you are done go get that dog. ",
            "date": "Answered February 7, 2019",
            "views": "371",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lee-Ann Knowles",
                "href": "/profile/Lee-Ann-Knowles"
            },
            "answer_text": "I'm going to try and strike a balance between Sandra’s considerate stance and everybody else’s suspicion... Ask him to be completely honest and to tell you why his ex gets a vote in how you use your online presence. Then listen respectfully and thoughtfully to his answer. If he pretty much sticks to the party line he's delivered so far. Ask him to do something for you that will undermine the feelings of ‘misdirection’/’hidden girlfriend’ that you've got going now. Then make a suggestion: would you invite a friend to join us at a sports event or movie. If he makes zero effort to meet your request, even if he's telling the truth, then he's the kind of person who doesn't see their partners needs as just as important as theirs... BIG red flag! Get out fast. ",
            "date": "Answered June 11, 2017",
            "views": "315",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Shaw",
                    "user_href": "/profile/Brandon-Shaw-64"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadib Khan",
                "href": "/profile/Sadib-Khan-2"
            },
            "answer_text": "Send an e-mail (privacy@quora.com) asking for deletion. Not very neat - however on the other hand, all your info and published texts will be deleted. You can also deactivate youraccount (and probably reactivate later, if you wish). Go to https://www.quora.com/settings/privacy and click 'Deactivate account'. ",
            "date": "Answered December 4, 2018",
            "views": "178",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kristen Young",
                "href": "/profile/Kristen-Young-47"
            },
            "answer_text": "Facebook didn't automatically set it up, if that's what you think. At some point you must have signed into Quora THROUGH Facebook. Quora can't get your information from Facebook unless you choose sign in through Facebook on the Quora login page. No need to be upset over something so trivial, especially when you're the only one that could have done it. To delete, go to settings > privacy and at the bottom you should see deactivate and delete options. ",
            "date": "Answered April 7, 2018",
            "views": "523",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Birks",
                    "user_href": "/profile/Gary-Birks-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Galan",
                "href": "/profile/John-Galan-5"
            },
            "answer_text": "Can I opt out of Quora altogether?  Not sure what you mean by opt out. You don’t need to participate in asking and answering questions. Just use the site. Learn how the Search Quora feature works and enjoy the content. If you mean leave quora you have two option. Under your Profile, Settings, Privacy:  You can Deactivate Account. You content, answers, blogs are left in place. Questions are communal property and are not removed. Delete Account. This deletes you content. Anything with your user ID, which is created when your account was made. Here is the official Quora link for details. Quora's answer to How do I delete my Quora account? A2A ",
            "date": "Answered September 10, 2017",
            "views": "864",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ariannah Skye De Avalon",
                    "user_href": "/profile/Ariannah-Skye-De-Avalon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francisco Rodriguez",
                "href": "/profile/Francisco-Rodriguez-144"
            },
            "answer_text": "go to your profile page and go to settings and under security settings which if you scroll down at the bottom or look to the left side you will usually see and option to delete or permanently delete your account but not all sites make it easy and will require you to search on google or even youtube on how to delete the accounts but always know that not sites are the same and most of them make it impossible for purposes of keeping you as some goat they can use to their advantage to either sell or share your info as it will make them money somehow not sure if that is true but i believe so. The internet is a wicked place sometimes and often we are held helpless like sheeps in a room full of wolves to eat us as imagine it. Sorry for getting dark there but that is my thoughts even though not necessary but often the truth ",
            "date": "Answered February 3, 2020",
            "views": "393",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sandy McLean",
                    "user_href": "/profile/Sandy-McLean-13"
                },
                {
                    "user_id": "Eric Sikes",
                    "user_href": "/profile/Eric-Sikes-5"
                },
                {
                    "user_id": "Cole Harris",
                    "user_href": "/profile/Cole-Harris-43"
                },
                {
                    "user_id": "James Lundquist",
                    "user_href": "/profile/James-Lundquist-2"
                },
                {
                    "user_id": "Jacek Rzepka",
                    "user_href": "/profile/Jacek-Rzepka-1"
                },
                {
                    "user_id": "Michał Wieczorek",
                    "user_href": "/profile/Michał-Wieczorek-6"
                },
                {
                    "user_id": "Chandan Rg",
                    "user_href": "/profile/Chandan-Rg"
                },
                {
                    "user_id": "Kinga Sot",
                    "user_href": "/profile/Kinga-Sot"
                },
                {
                    "user_id": "Jakub Wygladala",
                    "user_href": "/profile/Jakub-Wygladala"
                },
                {
                    "user_id": "Hisham Itani",
                    "user_href": "/profile/Hisham-Itani-2"
                },
                {
                    "user_id": "Sylwia Szczepanska",
                    "user_href": "/profile/Sylwia-Szczepanska"
                },
                {
                    "user_id": "Małgorzata Walendziewska",
                    "user_href": "/profile/Małgorzata-Walendziewska"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Iwicki",
                "href": "/profile/Mike-Iwicki"
            },
            "answer_text": "Considering that you have 3 followers; are following 37 others; and have 27 topics you are following, I’d guess you know pretty darn well what Quora is all about. You filled out a profile, and I can see where you went to school and where you live. Quora did not pull these items out of the ether and force questions, responses, or followers upon you. Don’t want to deal with Quora? Then don’t go to the site. ",
            "date": "Answered December 1, 2017",
            "views": "215",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Klaudia Joanna Amelia Żyłka",
                "href": "/profile/Klaudia-Joanna-Amelia-Żyłka"
            },
            "answer_text": "If you really have to… ;) In the menu at the top of the page - next to ‘Notifications’ there is your profile photo with your name - click on it. You’ll see another menu - choose ‘Settings’ and then ‘Privacy’ on the left. A the very bottom of this page you will see options to delete or deactivate your account. Hope it helps! ",
            "date": "Answered June 17, 2017",
            "views": "45",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lily Hodgson",
                    "user_href": "/profile/Lily-Hodgson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Lynn",
                "href": "/profile/Jessica-Lynn-201"
            },
            "answer_text": "To delete your Quora account, you: click the button with your face/icon on it and go to “Settings.”Once in Settings, go to the “Privacy” tab on the left side.There, you have the option to deactivate or to delete your Quora account.If you are feeling temporarily overwhelmed to the website, or just feeling like you are looking at it too much, I suggest deactivating your account rather than deleting it. I know that, when I have found my social media to be too much for me, I have simply deactivated it for a bit to take a break. That way, you can always come back to it at a later date. ",
            "date": "Answered September 30, 2018",
            "views": "392",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gleryl Price",
                    "user_href": "/profile/Gleryl-Price"
                },
                {
                    "user_id": "Megan Langridge",
                    "user_href": "/profile/Megan-Langridge-1"
                },
                {
                    "user_id": "Reed Smith",
                    "user_href": "/profile/Reed-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arihant Bansal",
                "href": "/profile/Arihant-Bansal-3"
            },
            "answer_text": "You can delete or deactivate your account under Privacy sub-section under the Settings section. Here’s a step-by-step guide to do so on Quora Website on PC. Click on your username. A drop down list will appear. Click on Settings option. 2. Click on the Privacy sub-section on the right hand side of the page.  3. Scroll down until you reach the end of the page. You will find the option to Delete or Deactivate your account. Choose whichever you’d like.  ",
            "date": "Answered September 7, 2016",
            "views": "14",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruv Raina",
                    "user_href": "/profile/Dhruv-Raina"
                },
                {
                    "user_id": "Pranjali Manjrekar",
                    "user_href": "/profile/Pranjali-Manjrekar"
                },
                {
                    "user_id": "Ramandeep Singh",
                    "user_href": "/profile/Ramandeep-Singh-308"
                },
                {
                    "user_id": "Aditya Raja",
                    "user_href": "/profile/Aditya-Raja-6"
                },
                {
                    "user_id": "Suvanssh Mahajan",
                    "user_href": "/profile/Suvanssh-Mahajan"
                },
                {
                    "user_id": "Raghuram Prabhu",
                    "user_href": "/profile/Raghuram-Prabhu-2"
                },
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Brennan",
                "href": "/profile/Michael-Brennan-295"
            },
            "answer_text": "That’s like saying “how do you unsubscribe from life? “Remember the people out here represents society. Very small percentage of them will have high IQs. 68% of society will fall into the questionable range if you’re looking for a super intelligent people. If you want perfect grammar, punctuation and intelligent people all around, you’ve come to the wrong plac. This platform is slightly better than most with a higher average IQ but remember society is filled with idiots. Expecting more is Idiocracy. ",
            "date": "Answered August 10, 2019",
            "views": "473",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Cornell",
                    "user_href": "/profile/Chris-Cornell-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Birchall",
                "href": "/profile/Daniel-J-Birchall-1"
            },
            "answer_text": "If you want to unsubscribe from the various notifications you get from Quora, Amit Jadhav (अमित जाधव)'s answer to How do I unsubscribe from Quora emails? to this question has you covered. If you want to deactivate your Quora account, Claire Stahl's answer to How do I delete my Quora account? to this question has you covered. If you want to totally delete your Quora account, that's a different question, and you'll want to read Quora's official answer to How do I delete my Quora account? ",
            "date": "Answered June 22, 2015",
            "views": "226",
            "upvotes": " Answer requested by Roy Brown",
            "upvoters": [
                {
                    "user_id": "Vaishali Panicker",
                    "user_href": "/profile/Vaishali-Panicker"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Knut Ragnar Slettebø",
                    "user_href": "/profile/Knut-Ragnar-Slettebø"
                },
                {
                    "user_id": "Daniel Watanabe",
                    "user_href": "/profile/Daniel-Watanabe-2"
                },
                {
                    "user_id": "Pati Domagała",
                    "user_href": "/profile/Pati-Domagała"
                },
                {
                    "user_id": "Sucheth Gs",
                    "user_href": "/profile/Sucheth-Gs"
                },
                {
                    "user_id": "Sankalp Mukherjee",
                    "user_href": "/profile/Sankalp-Mukherjee-1"
                },
                {
                    "user_id": "Tanish Arora",
                    "user_href": "/profile/Tanish-Arora-6"
                },
                {
                    "user_id": "Pratik Sinha",
                    "user_href": "/profile/Pratik-Sinha-112"
                },
                {
                    "user_id": "Mankaran Singh Bawa",
                    "user_href": "/profile/Mankaran-Singh-Bawa-1"
                },
                {
                    "user_id": "Rishika Chaudhary",
                    "user_href": "/profile/Rishika-Chaudhary-3"
                },
                {
                    "user_id": "Kishan Chaudhary",
                    "user_href": "/profile/Kishan-Chaudhary-6"
                },
                {
                    "user_id": "Sunil",
                    "user_href": "/profile/Sunil-557"
                },
                {
                    "user_id": "Abir Chawla",
                    "user_href": "/profile/Abir-Chawla"
                },
                {
                    "user_id": "Aaditee Pate",
                    "user_href": "/profile/Aaditee-Pate"
                },
                {
                    "user_id": "Ronak Patel",
                    "user_href": "/profile/Ronak-Patel-350"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                },
                {
                    "user_id": "Raghu S",
                    "user_href": "/profile/Raghu-S-3"
                },
                {
                    "user_id": "Rahul Chhabra",
                    "user_href": "/profile/Rahul-Chhabra-47"
                },
                {
                    "user_id": "Abhisar Krishna",
                    "user_href": "/profile/Abhisar-Krishna"
                },
                {
                    "user_id": "Radhika R Babu",
                    "user_href": "/profile/Radhika-R-Babu"
                },
                {
                    "user_id": "Angana H",
                    "user_href": "/profile/Angana-H"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Balaji Soundar",
                    "user_href": "/profile/Balaji-Soundar-4"
                },
                {
                    "user_id": "Sonu Kumar",
                    "user_href": "/profile/Sonu-Kumar-626"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopalkrishna Vishwanath",
                "href": "/profile/Gopalkrishna-Vishwanath"
            },
            "answer_text": "You can unsubscribe Go to your profile. Choose Settings. Choose Privacy. Select either ‘Deactivate’ or ‘Delete’ Hope this helps. GV ",
            "date": "Answered March 31, 2017",
            "views": "33",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                },
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Eldredge",
                "href": "/profile/Jeff-Eldredge"
            },
            "answer_text": "Get used to it. Some panty waist doesn’t like how you responded to their moronic question? BNBR will zoom in and take you down. Your appeal will occasionally be respected and the answer will be put back up. More often than not? Don’t even worry about it. Or, copy your original answer, go and delete the answer. Find the question again, and repost it with your original answer. or, figure out who you may have offended. Keep sending them the answer. ",
            "date": "Answered February 15, 2020",
            "views": "105",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Jonathan Buttall",
                    "user_href": "/profile/Jonathan-Buttall"
                },
                {
                    "user_id": "Harpo Rose",
                    "user_href": "/profile/Harpo-Rose"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Shelley McCoy",
                    "user_href": "/profile/Shelley-McCoy"
                },
                {
                    "user_id": "Alison Bocian",
                    "user_href": "/profile/Alison-Bocian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jimmy Gant",
                "href": "/profile/Jimmy-Gant"
            },
            "answer_text": "Are you sure you want out Yolanda Ramirez? You are barely in. No answers and this is your first question. Fortunately for you, you haven’t gone past a point of no return. You can either go through the steps to delete your account or just not sign on again. To delete, look at the questions to the right of the page with your question. A similar question is displayed - How do I delete my Quora account? Click on that and it will guide you through. ",
            "date": "Answered July 1, 2018",
            "views": "795",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dave-Boehm-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Infanger",
                "href": "/profile/Christine-Infanger"
            },
            "answer_text": "I may be wrong but I don't think deactivating your account does anything to the content you've shared. I think you'd actually have to delete your answers prior to deactivating your account. You wrote those answers to offer advice or input on something you're knowledgeable about, it would seem a bit histrionic to remove that information simply because you're no longer active on Quora. ",
            "date": "Answered August 22, 2016",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Babruh Ardana",
                    "user_href": "/profile/Babruh-Ardana"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                },
                {
                    "user_id": "Susan Campbell",
                    "user_href": "/profile/Susan-Campbell-173"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Evans",
                "href": "/profile/David-Evans-29"
            },
            "answer_text": "Can you remove Quora? Not on my own. It would take a brain surgeon, an intensive care unit, and a delicate operation to remove this growth from my cranium. Of course, since it’s a benign growth, I probably won’t bother. You’re clearly not using a laptop or you would have nothing to remove but a bookmark. If you’re using an Android (or similar), simply uninstall the app. ",
            "date": "Answered December 31, 2019",
            "views": "210",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathy Smith",
                    "user_href": "/profile/Kathy-Smith-1245"
                },
                {
                    "user_id": "David Marland",
                    "user_href": "/profile/David-Marland"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maxfield-Mansel-Mc-Coy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Olaru",
                "href": "/profile/Paul-Olaru"
            },
            "answer_text": "\"How delete quo?\"-ra?Quora accounts can be deactivated from the privacy settings: https://www.quora.com/settings/privacy\"How delete qu?\"-estions?A question on Quora can be deleted if it has less than 5 answers, by clicking on its \"...\" options menu (once it's open) and deleting it. This only works if you asked it originally and it won't work if the question has more than 5 answers. ",
            "date": "Answered May 16, 2015",
            "views": "730",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-15802"
                },
                {
                    "user_id": "Edilberto Barrero Dávalos",
                    "user_href": "/profile/Edilberto-Barrero-Dávalos"
                },
                {
                    "user_id": "John White",
                    "user_href": "/profile/John-White-363"
                },
                {
                    "user_id": "Timothy Soo",
                    "user_href": "/profile/Timothy-Soo-2"
                },
                {
                    "user_id": "Danny Flores",
                    "user_href": "/profile/Danny-Flores-4"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Hari Srinivas (हरि श्रीनिवास)",
                    "user_href": "/profile/Hari-Srinivas-हरि-श्रीनिवास"
                },
                {
                    "user_id": "Dmitry Petrov",
                    "user_href": "/profile/Dmitry-Petrov-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Grace",
                "href": "/profile/Kathleen-Grace"
            },
            "answer_text": "Yeah, here’s why. You came back. Your account gets reinstated if you return to the site during the 14-day grace period after deleting. It is the default setting in case you change your mind. So, you want to delete your account, stay off the site for two weeks, 14 days, and all your content WILL be deleted AFTER that grace period. If you even read one answer that’s posted on the site, or log in just once, that cancels the delete. ",
            "date": "Answered December 24, 2017",
            "views": "3",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aiden Geiss",
                    "user_href": "/profile/Aiden-Geiss-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bird",
                "href": "/profile/Michael-Bird-54"
            },
            "answer_text": "Are you referring to the account that you used to post this question, or to a different account? If you were able to post the question, then you know the password (or your browser does) and you can go to https://www.quora.com/settings/privacy and click the “Deactivate account” or “Delete account” options. If you believe that someone else has created an account and is pretending to be you, send an email to privacy@quora.com and ask them to investigate and disable the fraudulent account. ",
            "date": "Answered May 7, 2018",
            "views": "217",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cyrilla Baer",
                    "user_href": "/profile/Cyrilla-Baer"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Lewiston",
                "href": "/profile/David-Lewiston"
            },
            "answer_text": "Just delete your account. The action will be final after two weeks. It’s easy; just go to your settings and delete, and do not sign in to Quora during those two weeks. I’ve done if a few times myself, even after getting awards from Quora. You don’t own your questions, so those won’t get deleted. But everything else will get deleted. ",
            "date": "Answered April 21, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jean Claude",
                    "user_href": "/profile/Jean-Claude-41"
                },
                {
                    "user_id": "Caryssa Kramer",
                    "user_href": "/profile/Caryssa-Kramer"
                },
                {
                    "user_id": "Sheila Hughes",
                    "user_href": "/profile/Sheila-Hughes-24"
                },
                {
                    "user_id": "Tatiauna Brown",
                    "user_href": "/profile/Tatiauna-Brown-1"
                },
                {
                    "user_id": "Du Toit van Schalkwyk",
                    "user_href": "/profile/Du-Toit-van-Schalkwyk"
                },
                {
                    "user_id": "Matthew Gouge",
                    "user_href": "/profile/Matthew-Gouge"
                },
                {
                    "user_id": "Harshita Joshi",
                    "user_href": "/profile/Harshita-Joshi-15"
                },
                {
                    "user_id": "Jingyi Pan",
                    "user_href": "/profile/Jingyi-Pan-4"
                },
                {
                    "user_id": "Alexander Moriarty",
                    "user_href": "/profile/Alexander-Moriarty-1"
                },
                {
                    "user_id": "Donnie Hill",
                    "user_href": "/profile/Donnie-Hill-3"
                },
                {
                    "user_id": "Gabrielle Mailoa",
                    "user_href": "/profile/Gabrielle-Mailoa"
                },
                {
                    "user_id": "Ryan Travis Jones",
                    "user_href": "/profile/Ryan-Travis-Jones"
                },
                {
                    "user_id": "Dorian Alexus",
                    "user_href": "/profile/Dorian-Alexus"
                },
                {
                    "user_id": "Kris Meyer",
                    "user_href": "/profile/Kris-Meyer-7"
                },
                {
                    "user_id": "Al Welch",
                    "user_href": "/profile/Al-Welch-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Athena Walker",
                "href": "/profile/Athena-Walker"
            },
            "answer_text": "Go to your profile settings which are with your avatar image. Select privacy settings. Choose from the following. Delete or Deactivate Your Account Deactivate AccountDelete AccountDone ",
            "date": "Answered March 25, 2018",
            "views": "1",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reba Schneider",
                    "user_href": "/profile/Reba-Schneider-1"
                },
                {
                    "user_id": "Michael Ellis",
                    "user_href": "/profile/Michael-Ellis-147"
                },
                {
                    "user_id": "Stijn Hommes",
                    "user_href": "/profile/Stijn-Hommes"
                },
                {
                    "user_id": "Elizabeth Andonova",
                    "user_href": "/profile/Elizabeth-Andonova"
                },
                {
                    "user_id": "Sam Wiegand",
                    "user_href": "/profile/Sam-Wiegand-1"
                },
                {
                    "user_id": "Jay Edelson",
                    "user_href": "/profile/Jay-Edelson"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Jennifer Ellis",
                    "user_href": "/profile/Jennifer-Ellis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subhasish Ghosh",
                "href": "/profile/Subhasish-Ghosh"
            },
            "answer_text": "You simply need to click on your profile > Settings > Privacy and then there are 2 options therein: Deactivate Account means, your content still stays on Quora. If you login back within a period of 30 days; your account is again reinstated and “activated”.Delete Account means, your content, all questions and answers disappear from Quora; and your account is purged from the Quora system. ",
            "date": "Answered October 24, 2017",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carson Folio",
                "href": "/profile/Carson-Folio"
            },
            "answer_text": "Assuming you meant Quora, There’s multiple ways to do this, the easy way and the hard way. The hard way: Sending an e-mail (privacy@quora.com) asking for deletion. It might take a while, but all of your info and published texts will be deleted.The easy way: Deactivating your account. Go to https://www.quora.com/settings/privacy and click 'Deactivate account'.",
            "date": "Answered October 30, 2017",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "All Star Flooring",
                "href": "/profile/All-Star-Flooring-1"
            },
            "answer_text": "I’ve included a link which lets you delete your account. All you have to do is go to your account privacy settings. I don’t see why you’d need a Cease and Desist notice. How do I delete my Quora account? ",
            "date": "Answered January 20, 2017",
            "views": "455",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gigi J Wolf",
                    "user_href": "/profile/Gigi-J-Wolf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Volkov",
                "href": "/profile/Victor-Volkov-3"
            },
            "answer_text": "To delete your account see this question:How do I delete my Quora account? To delete the site…. You’ll need to take over the company and then shut it down. This going to be incredibly difficult and/or incredibly expensive. Quora is not a publicly traded company, and it would be even quite difficult to find a reason to shut it down from legal angle. ",
            "date": "Answered February 9, 2017",
            "views": "426",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Carey",
                "href": "/profile/Stephen-Carey-14"
            },
            "answer_text": "You mean delete every single question and answer on Quora? I doubt that’s possible unless you can hack into their computers and backups. If you mean your own, just switch off notifications and you won’t get any. Remove the icon from your Favorites so you aren’t compelled to click it. If you mean your own questions and answers, you can do that any time within the site. Goodbye! ",
            "date": "Answered October 17, 2017",
            "views": "334",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Derek Frost (フブキ)",
                    "user_href": "/profile/Derek-Frost-フブキ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Jordan",
                "href": "/profile/Robert-Jordan-82"
            },
            "answer_text": "Link your profile to porn, There was a couple of cute girls doing this just a month or so ago, I think they got bounced within a day or so. You could probably much easier just unsubscribe, whichever you choose, it should remove you, Good Luck! Robert ",
            "date": "Answered February 12, 2018",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheila Hughes",
                    "user_href": "/profile/Sheila-Hughes-24"
                },
                {
                    "user_id": "Kristen Young",
                    "user_href": "/profile/Kristen-Young-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leeman Cheng (鄭禮民)",
                "href": "/profile/Leeman-Cheng-1"
            },
            "answer_text": "You could have just as easily searched how this is done on Quora. It would have literally taken under 5 seconds. Go here: https://www.quora.com/settings/privacyScroll down and click “Delete Account”.Enter your password and click “Submit”.If you don’t know your password, log out of the site and click the “Forgot Password” link to retrieve the password. Log back in and follow the steps above. How do I delete this Quora account that was created without my awareness from my Facebook profile? ",
            "date": "Answered March 25, 2018",
            "views": "304",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pravasi Meet",
                    "user_href": "/profile/Pravasi-Meet"
                },
                {
                    "user_id": "Karthik Sharma",
                    "user_href": "/profile/Karthik-Sharma-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramaninder Singh",
                "href": "/profile/Ramaninder-Singh"
            },
            "answer_text": "Sorry to hear that you had bad experience with Quora. If you have made your mind already to leave quora, well then you have to follow the following steps to deactivate you account: Click on you Name on right-top corner and select Settings.In settings page, select Privacy and at the bottom, you will get the link to Deactivate Account.  ",
            "date": "Answered April 29, 2015",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preeya",
                    "user_href": "/profile/Preeya-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "New Login Tips",
                "href": "/profile/New-Login-Tips"
            },
            "answer_text": "Once your account is deleted you cannot reactivate it .If you seriously want to delete your account you can follow some steps 1.Firstly open Quora account you want to delete.Go to drop down button and click Setting. 2.Visit your account privacy setting and click “Delete account”. After you click the button it will ask you for your password in order to deactivate account. 3.Once you confirm, your account will immediately deactivate and deletion process will begin. You can also take more information with pictures from the link below : Delete Quora Account Permanently | ",
            "date": "Answered June 23, 2018",
            "views": "635",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harshit Singh",
                    "user_href": "/profile/Harshit-Singh-1666"
                },
                {
                    "user_id": "MD Classes",
                    "user_href": "/profile/MD-Classes-3"
                },
                {
                    "user_id": "Reliable Bro Abdullah",
                    "user_href": "/profile/Reliable-Bro-Abdullah"
                },
                {
                    "user_id": "Ahijith Allu",
                    "user_href": "/profile/Ahijith-Allu"
                },
                {
                    "user_id": "Harihar Karthikeyan",
                    "user_href": "/profile/Harihar-Karthikeyan"
                },
                {
                    "user_id": "Vedpal Hooda Hooda",
                    "user_href": "/profile/Vedpal-Hooda-Hooda"
                },
                {
                    "user_id": "Kaustubh Narawadkar",
                    "user_href": "/profile/Kaustubh-Narawadkar"
                },
                {
                    "user_id": "Sneha Singh",
                    "user_href": "/profile/Sneha-Singh-856"
                }
            ]
        },
        {
            "author_info": {
                "name": "Romon Ahmed",
                "href": "/profile/Romon-Ahmed"
            },
            "answer_text": "Go to your Account Settings.Click the Delete Account link at the bottom of the Account Page. ...Choose a reason why you want to delete your account.Click the orange Delete My Account button.Click the Confirm button on the window that appears.",
            "date": "Answered February 9, 2018",
            "views": "151",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thara Merrygold",
                    "user_href": "/profile/Thara-Merrygold-2"
                },
                {
                    "user_id": "Tamara Wiens",
                    "user_href": "/profile/Tamara-Wiens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi B",
                "href": "/profile/Ravi-B-281"
            },
            "answer_text": "To delete quora account - Login to your Account using google or facebook and then Click your profile link which will be on the top right corner and then click “Settings” and then Privacy link then scroll DOWN you can see Delete or Deactivate your Account. Click that and you can delete your account permanently. If any issue you facing then let me know. Ravi B ",
            "date": "Answered June 12, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Graeme Shimmin",
                "href": "/profile/Graeme-Shimmin"
            },
            "answer_text": "User gives a good explanation of how to deactivate your account. Deactivating doesn't remove anything you have written here though. If you want to completely remove any trace you were ever here then you can get your account deleted by emailing the administrators at privacy@quora.com * * According to Quora's answer to How do I delete my Quora account? ",
            "date": "Answered July 30, 2014",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Follows",
                    "user_href": "/profile/Paul-Follows"
                },
                {
                    "user_id": "Matthew Brandt",
                    "user_href": "/profile/Matthew-Brandt-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Pembleton",
                "href": "/profile/Jacob-Pembleton"
            },
            "answer_text": "How did I become part of this? I don’t remember creating an account, and I don’t know how to delete it. My question is, how did you sign in if you don’t remember creating this account? Although to answer your question, go to your profile, settings, privacy settings, and delete account will be at the bottom. That’s how you do it on the app, should be a similar process on the website. ",
            "date": "Answered April 6, 2018",
            "views": "537",
            "upvotes": " View 2 Upvoters"
        }
    ]
}