{
    "title": "How does one record several instruments live through a laptop? I've got a band and want to record us all playing at the same time but with seperate tracks. (I'm not wanting this for live performances, just recording) - Quora",
    "tags": [
        "Recording",
        "Specific Recording Studios",
        "Music Recording",
        "Audio Recording",
        "Bands (music)",
        "Audio Equipment",
        "Music Industry",
        "Laptops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "You need an audio interface that has enough inputs for your whole band. Each input is one mic or one instrument line. So for example we have a drummer, a bassist, a keyboard player, and a vocalist you will need: 3 to 7 inputs for drums1 for bass1 to 2 for keyboards1 for vocalsThats 6 to 11 inputs total. Now affordable interfaces usually only have two. Some that are a bit more expensive have 4. Some like the one I own, the Scarlett 18i8, has 18 inputs total, but to be able to access all of them you need to buy an ADAT interface to physically provide more jacks to plug into, like the Behringer ADA8000. There are cheaper solutions with a lot of inputs like the Zoom R24, but it only has 8 physical inputs. If you need to plug in more than 8, it would not be enough. ",
            "date": "Answered May 27, 2020",
            "views": "87",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                },
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Alexander Lehmann",
                    "user_href": "/profile/Alexander-Lehmann"
                },
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Wilson",
                "href": "/profile/Alan-Wilson-9"
            },
            "answer_text": "You need to get an audio interface with multiple inputs, and plug your mics/instruments into that. Then in your DAW you can assign each instrument/mic to a separate track. ",
            "date": "Answered May 27, 2020",
            "views": "71",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victor Eijkhout",
                    "user_href": "/profile/Victor-Eijkhout"
                },
                {
                    "user_id": "Peter Harris",
                    "user_href": "/profile/Peter-Harris-226"
                }
            ]
        }
    ]
}