{
    "title": "How bad was Bob Dylan hurt in his 1966 motorcycle accident? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "David Stewart",
                "href": "/profile/David-Stewart-8"
            },
            "answer_text": "The general consensus is that he was injured but not seriously. There were some people who claimed he faked the whole thing. He was exhausted and his manager was demanding he go out on the road again after a punishing touring schedule. The motorbike accident essentially stopped all touring plans and allowed him to spend time at home with the family, which is what he was craving. It was very convenient and it’s been suggested that he just made it all up. This doesn’t seem to gel with the facts. He was seen in hospital and the bike was written off. If he faked it he went to great lengths and destroyed a possession he loved. Unlike other aspects of his life, to which Bob can often be described as an unreliable witness, his accounts have been consistent throughout the years. It should also be pointed out that Dylan had a long time love of riding motorcycles at great speed but was apparently pretty bad at it. He had a reputation for recklessness from a young age. A motorbike accident isn’t at all implausible. From all accounts, including Dylan’s, he was in hospital for about a week and then returned home to recuperate further. He hit his head and hurt his back and had scrapes and bruises but nothing that required surgery or rehabilitation. ",
            "date": "Answered January 18, 2018",
            "views": "19",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ardeshir Sassani",
                    "user_href": "/profile/Ardeshir-Sassani"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Patrick Allen",
                    "user_href": "/profile/Patrick-Allen-64"
                },
                {
                    "user_id": "Jasper Thomas",
                    "user_href": "/profile/Jasper-Thomas-13"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "Shashank Das",
                    "user_href": "/profile/Shashank-Das"
                },
                {
                    "user_id": "Fred Welton Hill",
                    "user_href": "/profile/Fred-Welton-Hill"
                },
                {
                    "user_id": "Mason Duke",
                    "user_href": "/profile/Mason-Duke-1"
                },
                {
                    "user_id": "Allan Bloxham",
                    "user_href": "/profile/Allan-Bloxham"
                },
                {
                    "user_id": "Raphaël Fernandes",
                    "user_href": "/profile/Raphaël-Fernandes"
                },
                {
                    "user_id": "Scott Rowland",
                    "user_href": "/profile/Scott-Rowland-10"
                },
                {
                    "user_id": "Nick Moyne",
                    "user_href": "/profile/Nick-Moyne"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Dave Gouldstone",
                    "user_href": "/profile/Dave-Gouldstone"
                },
                {
                    "user_id": "John Savidge",
                    "user_href": "/profile/John-Savidge"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Dunkel",
                "href": "/profile/Ed-Dunkel"
            },
            "answer_text": "From what I have read read over the years, Bob Dylan's 1966 motorcycle accident may not even have happened. If it did it seems that it is was very minor. The following snippet is from DOWN THE HIGHWAY- THE LIFE OF BOB DYLAN, Book by Howard Sounes: On the morning of Friday July 29, 1966, Bob and Sara were leaving the Grossmans' Bearsville house. Bob had retrieved an old motorcycle from the garage and wanted to ride it to the repair shop. Sara followed in the car. As the pulled out of the drive, Sally Grossman was in the hall talking by telephone to Albert, who was in his office in Manhattan. She was still speaking with Albert a short time later when Sara's car reappeared in the drive. 'Hold on.’ she told Albert as she saw Bob emerge from the car. Apparently, he was hurt. 'He was kind of moaning and groaning' Bob came up to the house and ‘sort of lay down on the porch.’ When Sally came closer, Sara told her excitedly 'Keep away from him!' Sally gathered that Bob had 'slipped off the bike' -which was nowhere to be seen - and hurt himself. Yet he was not cut or obviously roughed up. The only evidence he was hurt was his moans of pain. Sally went back to the telephone to tell Albert what was happening. What exactly happened to Dylan after he rode out of the Grossmans' that morning has remained extraordinarily mysterious. Despite the fact that it seems to have been a fairly minor fall off a motorbike- and Bob, with his poor eyesight, was known for his haphazard road skills- the incident seethes with intrigue. There are contradictory accounts of where exactly the accident happened, and even whether there was an 'accident' at all. This is because the timing was very convenient for Bob; the accident gave Dylan an excuse to get out of the numerous business commitments then threatening to overwhelm him. There certainly was an accident, or rather an incident. But it was not as serious as was reported at the time. Sally Grossman, who has never previously discussed the matter publicly and is a key witness to part of the events of that day, believe it occurred on Black Turnpike, the country road that led from Bearsville to Bob's house in Byrdcliffe. A close friend of Bob, who wishes to remain anonymous, says the accident happened on Striebel Road, which runs directly outside the Grossman property. The source says Bob later admitted to him that when he came out of the Grossmans' drive onto the steep and slippery Striebel Road, he simply lost his balance and, rather feebly, fell off his bike. The bike then fell on top of him. In quite a different version of what happened, former Woodstock constable Charlie Solvent recollects Bob being involved in an accident several miles away, on Zena Road, near the hamlet of Saugerties, at a sharply twisting S-shaped bend. Although Solvent says he was called to do traffic duty after an accident here, and he thinks the accident involved Bob, he did not see Bob and there is no police report of Bob being involved in an accident on Zena Road. It seems very unlikely that this was the the fabled accident. Apart from anything else, it would be almost impossible for Bob to ride to Zena Road and have Sara bring him back to Bearsville in the short time Sally was on the telephone with Albert. 'I know it wasn't that long a time, because I was standing in my hallway talking to Albert when they pulled out, and still talking to him [when] they came back.’ Considering all the evidence, it seems almost certain that the accident happened very close to the Grossman property, probably on Striebel Road or a little farther on, perhaps Glasco Turnpike. Subsequent press reports stated that Bob was rendered unconscious, broke his neck, and was almost killed. Yet by Sally's account, there were no obvious injuries and Bob was conscious. Furthermore, if Bob was that badly injured common sense has it that he would have been rushed to the nearest general hospital, only fifteen minutes away in Kingston. But Sally confirms that no ambulance was called. Neither were there any police. Most important, Bob's doctor Dr Thaler, now reveals that Sara did not take Bob to hospital. She drove Bob directly from the Grossman property to Dr. Thaler's house-cum-surgery in Middletown,fully fifty miles away. This was a grueling one-hour drive by country roads, not a journey for a man in dire need of medical help. As Bob laynin Dr. Thaler's surgery, radio stations across the country flashed dramatic news that Bob Dylan- an artist at the height of his fame and creative powers- had been in a motorcycle wreck. The New York Times reported that Bob's injuries were so serious he was forced to cancel a concert in New Haven scheduled for the following Saturday. In this way the first part of a remarkable career drew to a close.  Reading this, I am of the belief that Bob used the hype surrounding his ever so minor accident, as a way to get out of the million and one commitments Albert Grossman had signed him up to for the next however many years. The fact Albert was on the phone to Sally at the time of the accident worked in Bob's favour. Upon hearing reports on the radio at Dr. Thaler's surgery allowed Bob to make the most of what minor injuries he did suffer. Bob was/is very self aware, he will have known the drugs he was using at the time [speed, cocaine and heroin] to keep up with the crazy schedule Albert had planned for him, were actually getting the better of him. This self awareness is what has set Bob apart for his entire career and kept him alive. So to conclude, in my opinion Bob probably suffered a few bruises and maybe a couple of cuts/grazes, then used accident to his advantage to get clean and generally slow down and get out of the limelight. E/D ",
            "date": "Answered February 7, 2018",
            "views": "477",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yusuf Thompson",
                    "user_href": "/profile/Yusuf-Thompson"
                },
                {
                    "user_id": "Joerg Hickman",
                    "user_href": "/profile/Joerg-Hickman"
                },
                {
                    "user_id": "Raf Beenaerts",
                    "user_href": "/profile/Raf-Beenaerts"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                },
                {
                    "user_id": "Scott Rowland",
                    "user_href": "/profile/Scott-Rowland-10"
                }
            ]
        }
    ]
}