{
    "title": "How to write song lyrics - Quora",
    "tags": [
        "Songwriting",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grayson King",
                "href": "/profile/Grayson-King-1"
            },
            "answer_text": "There are multiple effective ways each as varied and simple and complex as each person and whether they’ll work for anyone but the person doing it is hard to say… How I write lyrics might be of little use to you, however I personally just do anything and everything to find something to say regardless of quality. I figure out how good it is or not after a few years of edits here and there assuming I bother to look up old songs I gave up on or got distracted from. It helps that I tend to react to the music I’m creating from my guitar as it tends to guide you to certain themes and tones and especially it sets a lot of limits on how long and precisely what your vocal riff can be. I highlight things I have and haven’t said before and try to find a new word or phrase, find a new concept. Have I ever sworn? If not give it a try… have I ever expressed anger and spite? If I have how recently etc and will this be too similar? Is the problem today (a new problem arises each time or familiar problems are circular) that I’m trying to write lyrics? That I’m trying? Or that what I’m writing is lyrics? Can I just write sentences instead? There’s a huge difference between the mindset behind writing lyrics and writing sentences to me but maybe it doesn’t have this huge revelation for you like it did for me when I wrote Backyard Superstar and few others during that phase Either I will just start randomly singing about not having anything to sing about then searching for rhymes, making mistakes is not a crime, I’m gonna find a way to make you mine. Then you forget the first two sentences and use that one line as a basis of a song. Some songs really mean something and some wrote themselves and some are just catchy or silly and others are just failures that needed to be written to learn what not to do in order to become prepared for the next effort How do I write lyrics? I try to quote and describe life, but I also throw random words together sometimes and at others I just start singing and through the miracle of improvising in a free flow state I come up with ‘werewolves in fur coats’ and ‘zombies on the catwalk’ and so on If something isn’t working then I try something else or I just make another way up or I repeat and repeat until something comes out or something else I can develop comes along to make me forget about the one I was stuck on and frustrated by It helps that I repeat myself in life a lot and have developed the kind of character to take mistakes and slips of the tongues and seek them out and celebrate them. New words and messed up sentences break your usual pattern, spellcheck has some great words it throws out at you, but I’m also a cheeky and punny kind of person so I’m constantly practising and living on the edge of wondering what I’ll say next that is inappropriate or somehow deeply philosophical sounding etc So many ways… I doubt I can count them ",
            "date": "Answered December 25, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michal Swiader",
                    "user_href": "/profile/Michal-Swiader"
                },
                {
                    "user_id": "Robin Glasco",
                    "user_href": "/profile/Robin-Glasco"
                },
                {
                    "user_id": "Vika Min",
                    "user_href": "/profile/Vika-Min"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roel van Veldt",
                "href": "/profile/Roel-van-Veldt"
            },
            "answer_text": "First of all, why would you want to write a song? I stumbled into songwriting after recording tons of melodies and tunes I had improvised on the piano. Later I found out that if you structure your melodies, you get tunes, if you add lyrics to your tunes, you got songs. But that’s my story. I would say, create your own story, following your own path. Where did it begin for you? Do you find yourself humming melodies that come to you out of the blue? When you sing in the shower, do you often use words and melodies no one has ever sung before? Are you playing an instrument and did you discover some chord progressions you like? Do you write poems or original song lyrics to existing music, or that are waiting there for music to be added to them? It has to start with something you already do, and preferably enjoy. Then you have to find a way to put it down. You can write your ideas down, record them with your smartphone, or enter them straight into a DAW (digital audio workstation, being music software) on your computer. Try not to make it a drag. Find a way to keep it as easy and as simple as can be. Take a small notebook with you wherever you go, or an app in your smartphone. Now check what part of a song it is you are good in: SingingCreating original melodies on your instrumentWriting lyricsFinding great chord progressions.Accompany yourself on the piano, guitar, …Hearing all the parts of a song in your head and how they come together and should evolve during the song (Michael Jackson could do that). This is called arranging a song.Recording and/or mixing and/or mastering a song once all instruments know their part.Working with a certain DAW to bring ideas to a finished song.Then learn how to develop your own gift. The best way to get better is to do something daily. Practice makes perfect. Also go find people that have the talents that you lack. And last but not least: work together, co-write, as much as you can, with other people that complement your strengths. Did you find here step by step instructions to write your first song. No. Because a song is not a piece of IKEA furniture. But eventually you will create that what we would call songs. And you will get better and better at it, especially when you remember to collaborate with other passionate creators. Enjoy the process! ",
            "date": "Answered November 14, 2019",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar Addison",
                    "user_href": "/profile/Oscar-Addison-1"
                },
                {
                    "user_id": "Michal Swiader",
                    "user_href": "/profile/Michal-Swiader"
                },
                {
                    "user_id": "Jp Tolentino",
                    "user_href": "/profile/Jp-Tolentino-1"
                },
                {
                    "user_id": "Nature Lover",
                    "user_href": "/profile/Nature-Lover-319"
                },
                {
                    "user_id": "Vika Min",
                    "user_href": "/profile/Vika-Min"
                },
                {
                    "user_id": "Sagar Sontakke",
                    "user_href": "/profile/Sagar-Sontakke-14"
                },
                {
                    "user_id": "Evans Ofori",
                    "user_href": "/profile/Evans-Ofori-1"
                },
                {
                    "user_id": "Nikhilchandra Yeram",
                    "user_href": "/profile/Nikhilchandra-Yeram"
                },
                {
                    "user_id": "Rosie May",
                    "user_href": "/profile/Rosie-May-45"
                }
            ]
        }
    ]
}