{
    "title": "How do Korea, China, Japan, and Korea come in common in terms of musical instruments? - Quora",
    "tags": [
        "Korean Peninsula",
        "South Korea",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Tran",
                "href": "/profile/Tim-Tran-14"
            },
            "answer_text": "I’m not sure what you mean by 2 Koreas? Do you mean north and south? Because they’re the same culture, so they share literally the same instruments, so… I’ll change that question into: “How do China, Japan, Korea, and Vietnam share commonalities in terms of musical instruments?” Most, if not all, of these either had origins in China or came to China first, then spread to the other three. Some of these have disputable origins, but are still very similar and may even use similar names. Sometimes, a single instrument can have multiple descendants from one region, so expect some with 2 or more related instruments in the same country.  Chinese Pípá 琵琶 - Japanese Biwa 琵琶 - Korean Bipa 琵琶 - Vietnamese Đàn Tì Bà 彈琵琶  Chinese Gǔzhēng 古箏 - Japanese Koto 箏 - Korean Gayageum 가야琴 - Vietnamese Đàn Tranh 彈箏  Chinese Gǔqín 古琴 - Japanese Kokin 古琴 | Ichigenkin 一絃琴 - Korean Geum 琴 | Geomungo 거문고 - Vietnamese Cầm 琴  Chinese Húqín 胡琴 (Húqín is a family of instruments, with over 30 documented, so I’ll just use the family name for refer to all of them) - Korean Haegeum 奚琴 | Sohaegeum 四奚琴- Vietnamese Đàn Hồ 彈胡 | Đàn Nhị 彈二  Chinese Sānxián 三弦 - Japanese Shamisen 三味線 | Kokyū 胡弓 - Vietnamese Đàn Tam 彈三   These are all I can find at the moment. However, this is an extremely long list, so if anyone has anything to add, please feel free to comment below! ",
            "date": "Answered April 25, 2018",
            "views": "22",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stefan Onk",
                    "user_href": "/profile/Stefan-Onk"
                },
                {
                    "user_id": "Zewei Lee",
                    "user_href": "/profile/Zewei-Lee"
                },
                {
                    "user_id": "Chance Teo",
                    "user_href": "/profile/Chance-Teo-2"
                },
                {
                    "user_id": "Jerry Cheung（张家睿）",
                    "user_href": "/profile/Jerry-Cheung-张家睿"
                },
                {
                    "user_id": "李煜(Li Yu)",
                    "user_href": "/profile/李煜-Li-Yu"
                },
                {
                    "user_id": "Grigory Kryachko",
                    "user_href": "/profile/Grigory-Kryachko"
                },
                {
                    "user_id": "Justin Xu",
                    "user_href": "/profile/Justin-Xu-21"
                },
                {
                    "user_id": "Zihao Xue",
                    "user_href": "/profile/Zihao-Xue-1"
                },
                {
                    "user_id": "Alvin Kylee Plaza",
                    "user_href": "/profile/Alvin-Kylee-Plaza"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Will-Charlie-4"
                }
            ]
        }
    ]
}