{
    "title": "How many studio recording tracks are there for 1 hour? - Quora",
    "tags": [
        "Studio Recording",
        "Recording",
        "Home Recording",
        "Specific Recording Studios",
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Curci",
                "href": "/profile/Jeff-Curci"
            },
            "answer_text": "Thanx for the A2A Anthony. One hour is really not enough of a block of time IMO. When I have had bands in to record, the first 30mins or so are discussion (i always tried to get this part done beforehand), setup and sound testing. If we’re tracking an acoustic drum set and the drummer insists on using his kit, add another 15–30mins to get it properly mic’d, tuned and sounding “right” for recording. Now those times are estimated at best. Being prepared and knowing their parts will shorten the actual tracking time considerably. Using the studio drum kit or an E-kit (my preference) and studio amps is a big time saver too. There is a LOT more involved getting an acoustic drum kit setup for tracking than just placing a couple mics here and there. Nothing can make a song sound horrible like a badly mic’d/sounding drum kit. Your drummer might think his kit sounds great live and when jamming at rehearsals, but when recorded and within the mix 9 times out of 10 they will sound terrible. Mic’ing a guitar cab can take some time as well. Using house gear might only need a little tweaking. Studio time begins basically when you got all your gear loaded in, NOT after it’s all setup. So let’s say you are all well rehearsed, everyone knows their parts and use the studio drum kit, amps and the Bass is going direct. Mic’ing of amps and drum kit are already done. You leave the vocal mic and preamp choice at the engineers discretion, you might be actually tracking about 10–15mins in. Here’s where planning in advance can make things move along quicker snd smoothly. Laying down the rhythm guitars/bass/drum tracks (with a scratch vocal to make sure the changes are done correctly), recording the lead vocals, recording backing vocals, then solo’s, overdubs and doubling tracks if needed/wanted (instead of duplicating/re-amping post recording) figuring songs are 3–4mins in length, getting them on the 1st take (doubtful this will be the case, at least on most). You might get lucky and complete 2 songs, maybe 3. That doesn’t include the rough mix and playback. I usually stopped the clock so to speak and did this part on my time. Especially with a band on a tight budget and who are cooperative. If you are a group of narcissistic assholes, you pay for it. You want your best performance and want the end result to be professional. I have done it this way many times. That was always the case with majority of bands I’ve done work with when I did the tracking and not just the mix/mastering (I do mostly mix/mastering now). I did a lot of demo & ep work. First time in a studio bands. I was once paid with rolled coins lol. I would strongly suggest blocking out 3–4 hours minimal for 2–4 song projects. You will get much better results if your band isn’t watching the clock, rushing through trying to get as much done as possible will usually end up with disappointment, and that’s not the Engineers fault. You could do it in a couple days of short sessions too. Record the rhythm tracks and overdubs on day 1, all the vocals and any corrections or parts you forgot the day before and listen back to the rough mix on day 2. The key factor is being prepared, well rehearsed (EVERYBODY KNOWS THIER PARTS) and have a plan of attack. I trie to have the plan worked out with the band BEFORE they came in. I also get a basic idea of what they want to use and tried to be setup before they arrived. I’ve been on the other side myself s few times back in the day. Final mix/mastering is not always included btw. Although this is usually worked out in advance as a flat fee per song or project. But some prefer someone else to mix/master, a different set of ears so to speak. ",
            "date": "Answered September 7, 2020",
            "views": "31",
            "upvotes": " Answer requested by Anthony Bowens"
        },
        {
            "author_info": {
                "name": "Walt Borys",
                "href": "/profile/Walt-Borys"
            },
            "answer_text": "It all depends on how well rehearsed your group is, and how prepared your arrangements are. Assume you can play each song perfectly the first time… Figure at least 30 minutes, probably more, setting up and testing the mic balances and tonalities. And after each take, you need time for playback. so factor in at minimum the length of each song times 2. and then there’s mixing down to a final track, probably another factor of 2 times a song length. Do the math…. ",
            "date": "Answered September 6, 2020",
            "views": "25",
            "upvotes": " Answer requested by Anthony Bowens"
        }
    ]
}