{
    "title": "How is audio sound recorded onto stored on and played back from a CD? - Quora",
    "tags": [
        "Digital Audio",
        "Compact Discs (CDs)",
        "Audio Recording",
        "Audio"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zach Abass",
                "href": "/profile/Zach-Abass"
            },
            "answer_text": "In very simple terms: the sound is broken into 44,100 “samples” per second. Each of these samples is then assigned a number to represent its voltage, or, how loud it is (amplitude).CD uses 16 bits to do this, and basically each one is half the voltage of previous one, going first to last. So, more or less, divide the voltage that each bit represents in half, and if the sample in question is half that or more, it gets a 1, and you move to the next bit, assigning a 1 or a 0 depending on if it is more than half or less than half. As you go, you are getting closer and closer to zeroing in on its actual voltage, and more precisely defining it. Now, repeat this all over again for each of the remaining 44,099 samples per second! (44.k was chosen as it is a bit higher than 40k- Nyquist’s Theorem says a digital system can losslessly record any frequency up to half the sampling rate. We hear out to 20k, so you have to sample at at least 40k). Once you have all of your 1s and 0s for your recording, those are transferred to the CD in the form of pits. The pits are in a spiral, 20 times thinner than a typical human hair. A laser bounces off of the disc, reading the pits or absence thereof, and sends the resulting stream of 1s and 0s to a Digital to Analog Converter (DAC) which converts them each to their representative voltages, creating an AC analog wave which would be the same as you’d get out of a tape deck, tuner, or other analog device. This goes to the preamp section of your playback system for volume, tone, etc controls, and thence to the amplifier section to get, uh, amplified to a high voltage, high current signal sufficient to drive your speakers (or out to your headphones, or wherever is appropriate for how you end up hearing it). ",
            "date": "Answered July 5, 2019",
            "views": "220",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Pyron",
                    "user_href": "/profile/Matthew-Pyron"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Lillie",
                "href": "/profile/Joshua-Lillie-2"
            },
            "answer_text": "For a very detailed explanation follow this link. High Fidelity Audio ",
            "date": "Answered July 7, 2019",
            "views": "100",
            "upvotes": "0"
        }
    ]
}