{
    "title": "How to start my own commercial radio station - Quora",
    "tags": [
        "Public Radio",
        "FM Radio",
        "Broadcast Media",
        "Internet Radio",
        "Radio Stations",
        "Radio",
        "Entrepreneurship",
        "Startup Strategy",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricia Wilson",
                "href": "/profile/Patricia-Wilson-66"
            },
            "answer_text": "Find one near you and get a job there. Any job will do. Work there 10 years or so and learn everything you can. This MAY give you the necessary background to avoid some of the mistakes you would otherwise make. You will learn: how and from whom the station gets paid for its programming; what it is like to be responsible for filling 24 hours a day, seven days a week with something people in your area want to hear; what equipment is necessary to support your format and what its maintenance requirements are; what sorts of expertise your staff needs in the areas of marketing, operating, content, maintenance, scheduling, accounting, HR, et cetera ad nauseum. You may get some idea of what legal issues and what regulatory issues a radio station might confront. You might learn a bit about producing your own content if the station does that. You might learn about what unions you are likely going to have to deal with if you want experienced, qualified talent. Ditto for experienced qualified engineers. While you have been working at the station you have been saving up towards that $500K-$1M you will need to build your station and get it started. And that is low-ball for any sizeable market. I am not here saying you can’t do it. I am saying you are going to have to REALLY BADLY WANT to do it. Of course the other alternative, if you have way more money, is to hire the necessary operational, legal, engineering, marketing smarts and turn them loose. One of the TV stations I worked at was bought by a meat packer who thought TV stations were fun toys. He didn’t last long. ",
            "date": "Answered August 26, 2019",
            "views": "129",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alfredo Torrejon",
                    "user_href": "/profile/Alfredo-Torrejon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Snyder",
                "href": "/profile/Stan-Snyder-4"
            },
            "answer_text": "Buy an existing station or buy a CP (construction permit) issued by the FCC and build the station in accordance with the engineering outlined. Are you liquid a $million or so? A commercial CP in a decent sized market where you may be able to make some money is going to set you back about $300,000.00 add another $300,000 for equipment, engineering, consulting and installation. Now you’ll need to front these costs until some revenues start rolling in; personnel, rent, a studio, an inventory of songs or other content. If music licensing to ASCAP, SoundExchange, BMI and the others for licensing so you don’t get sued when you’re playing your favorite country or blues tune. The after all that, you still have the issue of where to get listeners. Billboards are $1500 to $2500 per month each, going out an doing promotion for your new station also takes bucks. Perhaps the $mil plus is better spent in good stocks or some real estate. Commercial radio is a tough game. If you still have the burning desire to broadcast, try internet radio. About $200. to set up and get going, spend a little for some ads (google or bing), get listed on the internet radio directories and watch it grow. No FCC to contend with, no studio requirement, runs on a laptop. Here are some links: LP Broadcasting Radio.co | Create Your Own Internet Radio Station Broadcast and Listen to Internet Radio Still want to punish yourself, here’s a link to Media brokers who are happy to help you: Home I’m sorry I’m so sarcastic, it was a $100,000. education for me that I still feel. Stan ",
            "date": "Answered August 25, 2019",
            "views": "136",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo Torrejon",
                    "user_href": "/profile/Alfredo-Torrejon"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                }
            ]
        }
    ]
}