{
    "title": "How long will it take to learn to play guitar? What would be the hardest thing about learning how to play the guitar for beginners? - Quora",
    "tags": [
        "Playing Guitar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donovan Deans",
                "href": "/profile/Donovan-Deans-1"
            },
            "answer_text": "How long will it take to learn to play guitar?This entirely depends on your benchmark. What do you want to do, at what's point do you think you'll be satisfied? To play like Nirvana - 3 months of 2 hours a day 3–5 days a week consistently. To play like Slash from GnR? Maybe a year and a half of that same practice intensity. To play like Steve Vai? Maybe 5 years of 3–5hours a day 5 days a week. Tommy Emmanuel? 7–10 years of consistent obsessive practice, essentially marriage to the instrument. Keep in mind this is to be able to interpret & play that level of composition. To compose yourself add 1.5x to all of those because you need an exhaustive amount of creative time, library's of licks & examples and a thorough understanding of the theory relative to each level which isn't as necessary if you’re just playing songs rather than composing them. There's no shortcut, the point of diminishing returns applies here. Practicing for 3 hrs over 3 days consecutively will take you scores further than practicing 1 day for 10–12hrs. Music is an exhaustive psychological sport, and trying to compress tons of information in your brain per sitting will be more exhausting than reading a 1000page anthology in a sitting. Just like muscle growth, that train to failure, rest & repair equation will dictate your gains. 2. What would be the hardest thing about learning for beginners? Highly subjective. Universally the hardest thing for people is being consistent. Unless your eyes stranded on an island, there will always be something else you can do that will provide more instant gratification. Always. It takes serious discipline to put in those hours especially in the beginning when you suck, have very little freedom or mobility on the instrument and the frustration is ever present. It's like taming a wild animal that's kicks your ass every day until one day it hurts less and less and then one day you wake up and notice this thing mostly does what I want in my mind. It so gradual you will probably think you suck all the way until you don't. Some people are bothered by chords but even when I couldn't do them I had faith that it could be done from the many examples. For others the strings biting into your fingers can scare away but again I had faith that it would go away and it did. Theory is intimidating to wrap your head around in the beginning, but if you give it enough time you will accidentally learn a ton of theory just from playing a lot of different stuff and trying to understand a little bit about “\"why this works. What's type of chord makes that type of sound. Why. How do people know where they and can't play. Where will the chords I know how to play move to in a different key. How do I find out what key the song I'm playing is in. How do I find a note on the fretboard. Why do Stevie Wonder progressions sound so freaking good.” Ask enough little questions along the way and in time you'll know a ton of theory without even trying. No matter what your goal is, just be consistent! Dont think of guitar as a quick quirk you will pick up to make you interesting, or famous or laid. Those may come as a consequence but the timeline make it more akin to a long term lifestyle investment like meditation or fitness. ",
            "date": "Answered December 29, 2017",
            "views": "681",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sergey Retsya",
                    "user_href": "/profile/Sergey-Retsya"
                },
                {
                    "user_id": "Mike Whitt",
                    "user_href": "/profile/Mike-Whitt-11"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Futch",
                "href": "/profile/John-Futch-2"
            },
            "answer_text": "Practice a little each day. If you average around 15 minutes a day you’ll keep moving forward and love the results: In a couple months you’ll be able to play some basic (but great) songs. The hardest part of learning guitar will be encountered here, when it feels like your finger tips are wrestling six taught runs of lava-hot razor wire.In 6 months you’ll be able to play countless songs because you’ll know the most common rhythms and common chords in the most common keys. Now you will absolutely love playing guitar. You’ll also be comfortable using a variety of guitar implements: the capo, tuner, metronome, etc.In a year you’ll be able to write your own stuff, read basic song charts/chord charts, and you’ll know how to play some great riffs/licks in the most popular (and musical) scale: the Pentatonic scale.In three years you’ll know how to play 60 chords with their root notes on the low E-string, and 60 more chords with their roots on the A-strong (these are much easier to learn/remember than you might think); you’ll be able to transpose songs to any key because you know these moveable chords; you’ll be able to solo more creatively: at this stage you’ll have learned the 5 most important scale/modal shapes - you’ll have “mapped” the fretboard; you can harmonize the major scale, and you understand what (and why) certain chords go well with certain other chords.In 5 years you’ll be proficient in a range of textures - from hammer-ons and pull-offs to slides and bends to vibrato. Your single note melodies will have a true musical quality about them - you’ll enjoy listening to what you play and others will enjoy it too; your hybrid picking and fingerstyle technique will be nicely developed too, allowing you to explore and create an even wider variety of music and musical styles.…If you practice 15 minutes, every day. John ",
            "date": "Answered December 29, 2017",
            "views": "32",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sergey Retsya",
                    "user_href": "/profile/Sergey-Retsya"
                },
                {
                    "user_id": "Barath Kumar",
                    "user_href": "/profile/Barath-Kumar-450"
                },
                {
                    "user_id": "Ayan Das",
                    "user_href": "/profile/Ayan-Das-10"
                },
                {
                    "user_id": "Bob Burns",
                    "user_href": "/profile/Bob-Burns-28"
                },
                {
                    "user_id": "John Gregory",
                    "user_href": "/profile/John-Gregory-44"
                },
                {
                    "user_id": "Mike Whitt",
                    "user_href": "/profile/Mike-Whitt-11"
                },
                {
                    "user_id": "Mehal Shah",
                    "user_href": "/profile/Mehal-Shah-11"
                },
                {
                    "user_id": "Erin French",
                    "user_href": "/profile/Erin-French-3"
                },
                {
                    "user_id": "Daria Ostapengo",
                    "user_href": "/profile/Daria-Ostapengo"
                },
                {
                    "user_id": "Madan Makineedi",
                    "user_href": "/profile/Madan-Makineedi"
                }
            ]
        }
    ]
}