{
    "title": "How much did the Louisiana Purchase cost? - Quora",
    "tags": [
        "Louisiana Purchase (1803–04)",
        "Louisiana (state)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kay J. Johnson",
                "href": "/profile/Kay-J-Johnson"
            },
            "answer_text": "It’s absolutely free. Louisiana Purchase is Food Stamps paid by the government for people with low income and people with kids who are struggling and all that sort of stuff. How ever much the government gives you is based on how many kids/adults you personally claim. The more heads you claim the more money they give you. I never used food stamps before but if I was living by myself I would probably need it. Or it would at least help a lot. It used to be really easy to get food stamps here in Louisiana, but now a lot has changed. It’s still free of course but they’ve become stricter because of all the riff raffs who tried to cheat the system. I’m not 100% sure but I think they started drug testing for it. I mean I may be wrong but if they hadn’t started by now they surely will in the future. You know to weed out all the riff raffs. I know they do drug test with Medicaid on a few programs so it wouldn’t surprise me if they started testing for food stamps as well. ",
            "date": "Answered September 3, 2018",
            "views": "893",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Caffery",
                "href": "/profile/Kevin-Caffery"
            },
            "answer_text": "The average cost of farmland (crop&pasture land average and the area in question,which is roughly the Midwest ,is roughly half pasture -half crop) in 1800 was $1.25/ac In 2018 the average cost of farmland (crop&pasture land average) in the Midwest (encompassing a large portion of the Louisiana Purchase) was $2,000 /ac . Using a composite CPI calculator arguably gives a skewed value of the cost of the Louisiana Purchase (and not only did we get land we got many major rivers to facilitate commerce and provide military security) Using land inflation figures the $15 million cost would amount in today’s dollars to $2,000 x the number of acres in the Louisiana Purchase that being 530,000,000 acres. The sum value in current dollars is therefore $1,060,000,000,000 or 1.06 trillion dollars. Arguably a discount has to be made to compare the respective amounts as a percentage of total wealth in 1803 and today. Also you would have to factor in the tax structure, both property and income, of the two years in question ",
            "date": "Answered July 25, 2018",
            "views": "86",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phooripat Anchovy Srinithiwat",
                    "user_href": "/profile/Phooripat-Anchovy-Srinithiwat"
                },
                {
                    "user_id": "Gary Morasca",
                    "user_href": "/profile/Gary-Morasca"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                }
            ]
        }
    ]
}