{
    "title": "How to make my music and video copyrighted on YouTube - Quora",
    "tags": [
        "Copyright Infringement",
        "Copyright Law",
        "Videos",
        "YouTube Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Let’s back up. The YouTube part isn’t important here. Your music and videos are automatically protected by copyright from the moment you create them. Your creation of them lets you make copyright claims under the DMCA to have them removed from websites and allows you to sue to block distribution or duplication by other means. If you register your copyrights at the Copyright Office in your country, you get extra protections. In the U.S. you get additional fines levied on the infringing party if you win your lawsuit. That can be VERY substantial. Here is an example where a few photos were used without permission, but shared really widely: NYTimes Photographer Sues Perez Hilton for $2.1M Over Copyright Infringement Registration is easy and fair cheap. For those in the U.S., you just go to the Copyright Office website and register, then pay $35. ",
            "date": "Answered September 20, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Timothy Amarok",
                    "user_href": "/profile/Timothy-Amarok-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Richards",
                "href": "/profile/Bob-Richards-54"
            },
            "answer_text": "I just post it and see if it gets a copyright claim. Since I post old music and nothing current, I seldom have a problem. Recently, however, a million selling song from 1952 was rejected. I had to substitute a live version. Yet there were other copies of the recording posted there for many years. Why was I blocked? Well, it seems someone fought it, and it is now free to post. Any views for a copyrighted video are paid for by YouTube. No one is cheated. Here’s my video. It’s the million selling song, Jambalaya, now converted to stereo sound. The Jo Stafford version is also in stereo. Enjoy.  ",
            "date": "Answered April 28, 2019",
            "views": "543",
            "upvotes": " Answer requested by Farhan Aslam"
        }
    ]
}