{
    "title": "How would you describe a perfect kiss? - Quora",
    "tags": [
        "Perfection",
        "Descriptions",
        "Kissing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bridget McCrea",
                "href": "/profile/Bridget-McCrea-1"
            },
            "answer_text": "It’s different for everyone, so I’ll just describe my perfect kiss: It’s the one that comes after long anticipation. It’s the one you’ve been moving towards…slowly…for what feels like years. It’s the one that was freely given. It’s the one that you have to close your eyes to fully experience. It’s the one that feels like sunshine after days of rain. It’s the one that gets taken with no regrets. It’s the one that feels like you just came home after a long absence. It’s the first soft rain after a drought. It starts slow before building to a crescendo. It’s the one that steals your breath. It’s neither too wet, nor too dry. It tastes sweet. It feels spicy. It’s electric. It causes shivers from the top of your head to the bottom of your feet. It makes your toes curl. It makes you feel unsteady. And once it’s over, all you want is more. ",
            "date": "Answered July 25, 2018",
            "views": "99",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cindy Ha",
                    "user_href": "/profile/Cindy-Ha-20"
                },
                {
                    "user_id": "ZAMANGUNI",
                    "user_href": "/profile/ZAMANGUNI"
                },
                {
                    "user_id": "Larry Calhoun",
                    "user_href": "/profile/Larry-Calhoun-17"
                },
                {
                    "user_id": "Miley Morton",
                    "user_href": "/profile/Miley-Morton"
                },
                {
                    "user_id": "Foxy The Pirate",
                    "user_href": "/profile/Foxy-The-Pirate-55"
                },
                {
                    "user_id": "Bela Irfan",
                    "user_href": "/profile/Bela-Irfan"
                },
                {
                    "user_id": "Haslo India",
                    "user_href": "/profile/Haslo-India-1"
                },
                {
                    "user_id": "Andy Murray",
                    "user_href": "/profile/Andy-Murray-52"
                },
                {
                    "user_id": "Alex Johnson",
                    "user_href": "/profile/Alex-Johnson-465"
                },
                {
                    "user_id": "Sethuramalingam Venkatasubramanian",
                    "user_href": "/profile/சேதுராமலிங்கம்-வெங்கடசுப்ரமணியன்-Sethuramalingam-Venkatasubramanian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Elliot",
                "href": "/profile/Todd-Elliot-3"
            },
            "answer_text": "How would you describe a perfect kiss? Before I was married I had two kisses, from two different girls, that rocked my world. They were similar enough that I can describe both by describing only one. It begins with attraction, and anticipation. A nice date, good food, and a mutual interest in becoming physical. The kiss, when it happens, is a promise of things to come. A hesitation, unhurried, to provide the mindset so you can remember the moment. Then a quick peck of soft pursed lips, followed immediately by a hungry open mouth. Wet, and hot, and swollen. No tongue, just lips trying to swallow lips. But it doesn’t stop there. Hands… traveling curves with intent, gripping lightly, but with force. Encouraging, kneading, pleading, controlling… Soft skin and hard muscles, two bodies tentative, but with growing insistence. Caressing lightly at first but searching for ways to shape themselves into each other, to inhabit, to indulge, to become. The scent of passion… Breaking off is difficult, the mind stunned, the head light with vertigo. The world rocked. A promise… And I married the last one to kiss me like that. Forty years and she still rocks. I’m a lucky man. EDIT: Forty-two years now. ",
            "date": "Updated April 16, 2020",
            "views": "61",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arts and Crafts Lana",
                    "user_href": "/profile/Arts-and-Crafts-Lana"
                },
                {
                    "user_id": "Cian Shay",
                    "user_href": "/profile/Cian-Shay"
                },
                {
                    "user_id": "Xi Aussie Squizzy",
                    "user_href": "/profile/Xi-Aussie-Squizzy"
                },
                {
                    "user_id": "Shambhavi Bhardwaj",
                    "user_href": "/profile/Shambhavi-Bhardwaj-3"
                },
                {
                    "user_id": "Denise Tukes",
                    "user_href": "/profile/Denise-Tukes"
                },
                {
                    "user_id": "Sofija Gičeva",
                    "user_href": "/profile/Sofija-Gičeva-1"
                },
                {
                    "user_id": "Brent Brown",
                    "user_href": "/profile/Brent-Brown-23"
                }
            ]
        }
    ]
}