{
    "title": "How to get bad karma - Quora",
    "tags": [
        "Karma",
        "Self-Improvement Advice",
        "Understanding Self-Improvement",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bapan Pathak",
                "href": "/profile/Bapan-Pathak-1"
            },
            "answer_text": "There is no “good” or “bad” karma. However, a karma that results in lesser chaotic outcome can be called a “good karma” and a karma that results in higher chaotic outcome can be called a “bad karma”. If you compare your daily works as a student or a job holder you will notice that a good karma is nothing more than a step towards an organized goal (good result, better performance, etc.) An organized goal is less chaotic state compared to an unorganized goal. For example: if you don’t follow an organized steps to get a set of work done you may end up taking more time in completing the work. Not following an organized method is like working in a chaotic pattern. A chaotic pattern may not lead to completion of a work. When a criminal commits a crime, he/she creates a chaotic effect in society which affects the entire society. The society then brings the criminal to justice only if the society as a whole considers that particular karma as a crime. For example: In a terror-breeding society, it is not a crime for a member of a terrorist organization to kill people. A society that doesn’t see the activity of a terrorist as a crime is a society which considers the karma of the terrorist as a less chaotic karma and as a good karma towards its existence. Such society as a whole does highly chaotic karma or bad karma towards the societies that are liberal, open minded and that are less chaotic. If we consider all the societies in our planet, we can identify the karma of the entire human race. We can see the envelope of the karma of our species and also get a hint of its direction; as in what will be our condition in next 100 years or where we are heading. You can now understand why a crime may go un-punished while a good karma may go un-rewarded. It all depends on the ‘degree of chaos’ involved in a karma and what is the envelope of the karma of the group or society to which one belong to. Karma can never be void of chaos. Like a flutter of the wings of a butterfly may be a cause of a destructive tornado; a karma that gives life to someone may bring death to many. It is the direction or the envelop of the karma performed by all the individuals that is important. For more, you may read my blog: Space Post Or, this answer on Karma: What is karma? ",
            "date": "Answered May 4, 2017",
            "views": "681",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raghuraman Raghavan",
                    "user_href": "/profile/Raghuraman-Raghavan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishnava Seva Dasa",
                "href": "/profile/Vaishnava-Seva-Dasa"
            },
            "answer_text": "By doing activities against the will of God evaṁ pravartitaṁ cakraṁnānuvartayatīha yaḥaghāyur indriyārāmomoghaṁ pārtha sa jīvatiWord for word: evam — thus; pravartitam — established by the Vedas; cakram — cycle; na — does not; anuvartayati — adopt; iha — in this life; yaḥ — one who; agha-āyuḥ — whose life is full of sins; indriya-ārāmaḥ — satisﬁed in sense gratiﬁcation; mogham — uselessly; pārtha — O son of Pṛthā (Arjuna); saḥ — he; jīvati — lives.Translation: My dear Arjuna, one who does not follow in human life the cycle of sacriﬁce thus established by the Vedas certainly leads a life full of sin. Living only for the satisfaction of the senses, such a person lives in vain.Purport: The mammonist philosophy of “work very hard and enjoy sense gratiﬁcation” is condemned herein by the Lord. Therefore, for those who want to enjoy this material world, the above-mentioned cycle of performing yajñas is absolutely necessary. One who does not follow such regulations is living a very risky life, being condemned more and more. By nature’s law, this human form of life is speciﬁcally meant for self-realization, in either of the three ways – namely karma-yoga, jñāna-yoga or bhakti-yoga. There is no necessity of rigidly following the performances of the prescribed yajñas for the transcendentalists who are above vice and virtue; but those who are engaged in sense gratiﬁcation require puriﬁcation by the above-mentioned cycle of yajña performances. There are different kinds of activities. Those who are not Kṛṣṇa conscious are certainly engaged in sensory consciousness; therefore they need to execute pious work. The yajña system is planned in such a way that sensory conscious persons may satisfy their desires without becoming entangled in the reaction of sense-gratiﬁcatory work. The prosperity of the world depends not on our own efforts but on the background arrangement of the Supreme Lord, directly carried out by the demigods. Therefore, the yajñas are directly aimed at the particular demigods mentioned in the Vedas. Indirectly, it is the practice of Kṛṣṇa consciousness, because when one masters the performance of yajñas one is sure to become Kṛṣṇa conscious. But if by performing yajñas one does not become Kṛṣṇa conscious, such principles are counted as only moral codes. One should not, therefore, limit his progress only to the point of moral codes, but should transcend them, to attain Kṛṣṇa consciousness. ",
            "date": "Answered July 23, 2016",
            "views": "400",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roopal Tripathi",
                    "user_href": "/profile/Roopal-Tripathi-2"
                },
                {
                    "user_id": "Manohar Patil",
                    "user_href": "/profile/Manohar-Patil-13"
                }
            ]
        }
    ]
}