{
    "title": "How do professional musicians record new tracks? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bart Reardon",
                "href": "/profile/Bart-Reardon"
            },
            "answer_text": "There are a gazillion and one ways to organize the workflow and production process for recording tracks. However, there are a few time honored traditions that serve as foundations for a variety of production types. Most production processes are variations on these basic models. Large Ensemble For large ensembles, such as orchestra and choir, the most common working method is to record all the instruments and/or voices in one pass. It’s just too time consuming and expensive to do it any other way when there are 30-60 musicians involved. In this case, the players must be very good at what they do. One little mistake by one player costs everyone else their time. It’s pressure. Usually, there will be several takes of each significant portion of the program and sometimes sections of each take will be edited and pieced together for a final version. Huge Ensemble When tracking music for mega-production film scores, the elements are divided up among different teams of specialists and then later assembled by a mixing engineer. Quite often, the process will begin with a computer and keyboard generated version of the film score, created by the composer and overseen by the musical director. When the decisions and details of the composition have been ironed out, the computer/keyboard version will be used as a guide track for live instrument ensembles and then discarded. That is, of course, if the live sessions prove to be better than the computer generated score. Sometimes the final version contains parts of both. If the orchestra and choir are both enormous, then each will be recorded in an independent session. As the production moves into the mixing and assembly phase, all the elements of dialogue, music, sound effects, foley and background ambiences are passed along to some poor soul called the “mixing engineer,” who now has to deal with 140 channels of audio that must be perfectly balanced and synchronized to the action and movements of the visual components. Picture if you will, a mad genius who is also an extreme adrenaline junkie who never needs sleep. :-) Popular Music In music styles that feature an artist who uses a hired studio session band, the process is pretty straight-forward. Most commonly, recording begins with a session called “rhythm tracking.” In this scenario, we’d most often see drums, bass, keyboards and a guitar or two playing together in one pass while the featured artist sings a scratch track, just as a helpful guide. The instrumental musicians will be aiming for final takes as quickly as possible and the vocal scratch track is later replaced. Next come additional sessions for instrumental solos, backing vocals and then sweeteners. Sweeteners can be any incidental idea or additional instrument track that the artist or producer envisions and could include hand percussion, synthesizers, string or horn sections, etc. In most cases, the final vocal sessions come last in the process in order to afford the featured artist the best opportunity for being inspired by and responsive to the final instrumental and backing vocal tracks. Vocals may involve as little as 15 minutes per song and as much as a full day for each song. I once saw a producer cue sheet from a Whitney Houston session where every note and every phrase was marked with instructions from the vocal coach regarding inflection, vibrato intensity, vibrato speed, loudness and a variety of other expressive nuances. Bands I’ll define “bands” as a circumstance where all the players are publicly recognized as a part of the ensemble, as opposed to the singing artist or group where the backing band is of secondary importance in the marketing package. Quite often, the “band” tracking scenario will be the same as the studio session player date -- rhythm tracks first, then instrumental solos, backing vocals and sweeteners. But, it would be just as common to see bands tracking everything they have in one pass, doing multiple takes of each song, choosing a favorite take, then replacing or repairing whatever tracks or sections of tracks that may not be suitable. There’s a fabled story about Eric Johnson doing a guitar solo over and over again, late into the night. The engineer finally wore out and set Eric up with a remote control in the tracking room so he could work by himself. Reportedly, the engineer went home, got a decent night’s sleep, came back the next morning and Eric was still working on the same solo. I don’t know if this is true but it was written in a credible industry magazine. I also recall reading in George Martin’s book, “All You Need Is Ears,” that Paul McCartney’s release of “Blackbird,” was take number 38. Wshew! Jazz All the Jazz artists I’ve ever worked with track everything in one pass. In most cases, the interactive nature of Jazz musicians playing straight from the hip and responding to one another’s cues requires this. Many of the Jazz artists I’ve worked with also insist on one take and one take only. Their intuitions dictate that it’s not Jazz if the details have been perfected. The majority of Bluegrass and Old-Time musicians I’ve worked with also operate under the same principle and track everything in one pass. The One-Man Artist And of course, this could also be the One-Woman Artist. In this scenario the featured artist plans to do all or most of the tracking themselves and is assisted by a recording technician to manage the technical setups, workflow, equipment, etc. This, by the way, is how the musician, Prince worked with his engineer, Susan Rogers -- only two people present in the studio for tracking, the musician and the engineer. For this production style, I’ll always start by tracking a scratch version to a click track. For the scratch, the client typically plays an instrument and may sing along or possibly just narrate instructions that map out the location of particular points in the song. As the artist accumulates enough additional final tracks to keep their place in the song, the scratch tracks are discarded. Tracking continues at the artist’s discretion, one instrument or vocal per pass at a time until the song is complete. In situations where musical time-keeping and/or pitch references are vague in the early tracking stages, I’ll play a MIDI keyboard or MIDI percussion track and quantize it strictly to the tempo and recording timeline to use as a temporary reference that’s discarded as soon as it’s no longer needed. The Solitary Producer This is a setting where only one person is present in the studio, doing both the engineering and the music. This method was pioneered by artists such as Paul McCartney and Todd Rundgren in the mid-1970s, and is extremely common today across many genres and budget levels. In cases where I have a singer/songwriter client who needs a studio backing band, I will often provide their backing tracks working as a solitary producer. My personal workflow begins with mapping out the structure of the song on a computer DAW timeline, where I create markers for, Intro, Verses, Breaks, Chorus’s, Solos, Turn-Arounds, Bridges, Outro’s, or whatever the form of the song may be. The tempo, meter and any rubato sections are also visually noted or mapped on the click track. With the song mapped out visually and the click track audible, I’ll quickly hammer out a crude version of MIDI percussion and bass with no regard to expression or nuance and quantize them exactly to the tempo and timeline. After a few of the live instruments are then recorded, I’ll then replace the static sounding, quantized MIDI percussion with bass guitar and MIDI percussion, played with attention to expression and musicality. If the song arrangement is involved, I’ll sometimes have the singer/songwriter come into the studio for a scratch vocal to serve as an aid to expressing the instrumental tracks as well as possible. For instruments and backing vocals that are beyond my level of expertise, I have studio musicians at distant locations who can provide those accompaniments via the Internet. In this case, I make a rough mix of the work in progress, email an MP3 to the studio musician, receive their finished track via Drop Box, YouSendIt, or whatever and pay them by way of PayPal. It’s really kind of fun and cool because we no longer have to schedule each other’s time and since there’s no travel involved, their work is far more affordable. So there we have the basics and the typical models. Most productions either fit the models closely or are variations. That said, the role of a producer is to know what works under what circumstance, anticipate a process and workflow while always being alert to knowing when and where exceptions and changes need to be made. There will always be unexpected snafu’s and even points of crisis in most recording projects. Fortunately, our current state of technology is giving us the tools we need to work in just about any way that may be required to get the job done. Which brings me to one last little story about recording and technology. Several years ago, my friend and client Csilla Muscan, called me, excited that she’d just thought up a new song while driving. She sang the new song idea into her phone which was recorded onto my answering machine. I transferred the phone message to my DAW, used it as a scratch guide and played a few simple instrumental parts go along with it. Csilla liked the simple arrangement, so she came into the studio and spent five minutes singing a final version ... and that was it. From phone message to song in about 90 minutes time, here’s the final version of the release:  ",
            "date": "Answered April 3, 2017",
            "views": "14",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Joseph Byrd",
                    "user_href": "/profile/Joseph-Byrd"
                },
                {
                    "user_id": "Virgil Breeden",
                    "user_href": "/profile/Virgil-Breeden"
                },
                {
                    "user_id": "Dave Garfield",
                    "user_href": "/profile/Dave-Garfield"
                },
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Colby Cruz",
                    "user_href": "/profile/Colby-Cruz-1"
                },
                {
                    "user_id": "Yvette Renshy",
                    "user_href": "/profile/Yvette-Renshy"
                },
                {
                    "user_id": "Mark McRae",
                    "user_href": "/profile/Mark-McRae-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gustavo Woltmann",
                "href": "/profile/Gustavo-Woltmann-3"
            },
            "answer_text": "Decades ago, if you were a musician, and you wanted to record an album… You and your band played your asses off in bars and clubs every night… but now world of music is changed. Entire performances are recorded in single takes, sometimes with just 1 or 2 mics. The first step is creating some kind of guide for the other instruments to follow along with. Or you can also use pre-recorded drum loops. When music starts everyone follow drum or bases. Another method is to play all the musical instruments separately and then mix it all. Then harmonies and melodies are recorded. And then you can edit if you feel any deficiency. Jazz musician tends to record all in one trial. How to record track depends upon whether you are running band or just singing alone. In band everyone is responsible for his part. You can record track either in separate room, with band in one room or record every music separate and then mix. I’m a Jazz musician also having a band. I have played natively in Brazil and across many countries like USA , Europe and Japan. I have explained my experience of recording tracks. Now, I want to explore whole world with my Jazz and Lounge music.  Gustavo Woltmann Upcoming Fantastic Jazz musician ",
            "date": "Answered September 29, 2020",
            "views": "50",
            "upvotes": "0"
        }
    ]
}