{
    "title": "How much do touring bands make playing small venues? - Quora",
    "tags": [
        "Touring Bands",
        "Compensation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "I will give two examples. A 5 member tribute band that I hung around with for a few gigs. Not one I played in, just one whose members I knew well.They played a well-known venue on a major city and sold it out. Capacity was 220. The venue took 20% of ticket sales… leaving them with revenue from 176 tickets at £12 each. The government has 20% VAT included in the ticket price of course, so that gets deducted unless the band is VAT registered (not, in this case).The band got £1750, which equated to £350 each for their day’s work. They travelled separately by car, paying their own fuel expenses - averaging about £40 each. Net profit of £310 each for a long day from 11 am to about 2 am the following day.An original music band with 5 members that I played with a few times.Playing a well-known venue in a fairly large UK university town, the audience numbered 80 - half the capacity of 160, and the venue took 20% of ticket sales, leaving revenue from 64 tickets at £10 each. VAT to be deducted again.The band got £530, out of which came van hire and fuel to travel from meeting point to the venue and back - total £100. Each member got £86, out of which they paid their own fuel costs to get to the meeting point. I shared with two other members, picking them up on the way, and it was £20 each. Net profit of £66 each for a VERY long day from 7 am to 4 am the following day.Of course the tribute sold out whilst the original band could only half fill the venue. The public seems to want to hear what has been around for 50 years more than what’s fresh and exciting… even if both are in the same genre. Neither band is “famous”, both do all their own promotion and management. Neither made significant merch sales at the venues, and merch revenue in both cases went into the band’s own fund for promotion and re-stocking of merch… NOT into the pockets of the performers. This is pretty standard stuff. Bigger tributes with a decent reputation can play bigger venues or theatres but have much higher associated expenses (like paying for crew, security, lighting and sound technicians and equipment hire) so they actually can end up paying members LESS than they would by playing smaller venues… but it’s more rewarding to play bigger stages than for each performer to be squeezed into a space of two square metres with no elbow room, let alone guitar-posing or mic-stand-twirling space. Original bands are likely to make a loss or barely break even if they go into a large venue or theatre… unless they’re very very well known nationally with a prominent catalogue of songs and heavily promoted.  EDIT on 3d August 2020: I have a spreadsheet I used to calculate the breakeven point on ticket sales for playing venues and theatres. Putting in the costs and taxes and venue fees on one side, and the ticket prices and venue capacity on the other, I could set the performers’ income at zero and let the spreadsheet show me how many tickets needed to be sold to pay costs. Obviously, if the required number of ticket sales was higher than venue capacity, we’d be making a loss. If the required number ticket sales was only 25% of venue capacity, we stood a good chance of paying the performers a good fee by selling 50% of capacity, and an excellent fee by selling out. Then along came COVID-19. In the UK, ticket sales are now limited to 25% of capacity. Putting that as the maximum number of tickets, EVERY past performance would have lost money unless ticket prices were increased by 60%. And that’s without paying the performers a penny. So a £20 ticket in 2019 would need to be £32 in 2020 and you’d have to sell EVERY TICKET… in other words, the risk is huge, because the public needs to be willing to pay that high price, to attend a performance that will have little or no atmosphere because the theatre/venue is only a quarter full, with cheering, whistling, and shouting appreciation all banned. So in 2020, the answer to the question is: NOTHING. They make nothing. And probably the same in 2021. Since the public now doesn’t pay for recorded music, preferring all-you-can-eat fixed price streaming that pays musicians about $0.001 per stream, do not be surprised if new music and performing musicians become as rare as hen’s teeth very soon. Musicians have lost their last hope of a revenue stream. ",
            "date": "Updated August 3, 2020",
            "views": "27",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pietro Pavan",
                    "user_href": "/profile/Pietro-Pavan"
                },
                {
                    "user_id": "A Smith",
                    "user_href": "/profile/A-Smith-283"
                },
                {
                    "user_id": "David Homes",
                    "user_href": "/profile/David-Homes-3"
                },
                {
                    "user_id": "Marcus Streets",
                    "user_href": "/profile/Marcus-Streets"
                },
                {
                    "user_id": "Laurence Graber",
                    "user_href": "/profile/Laurence-Graber"
                },
                {
                    "user_id": "Kartikey Anand",
                    "user_href": "/profile/Kartikey-Anand-1"
                },
                {
                    "user_id": "Albert Grande",
                    "user_href": "/profile/Albert-Grande"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Stiffelman",
                "href": "/profile/Gary-Stiffelman"
            },
            "answer_text": "Often, artists like this are enjoying \"tour support\", funding from a label that is deficit financing their touring to build an audience.  Where the artist has no such support, they are usually making little more than food and gas money.   The math is simple.  A small venue (1,000) grosses maybe $20,000 for a show, assuming robust ticket sales.  Liquor, parking, food is all retained by the house.  The band usually is paid either a piece of the ticket price, and isnt charged rent, or the act buys out the night for a flat fee and keeps all the proceeds from the box office.  At the lowest end, the band has to \"pay to play\", renting the slot and losing money, just to be able to perform and build an audience or awareness from labels and others. The manager, agent, lawyer, etc.make nothing from these shows.  Usually the roadie is a cousin or brother working for fun, room and board (often sleeping on a bus or at a local friend or fan's place). Where the band can sell more tickets at a higher price, they might split a few grand per night, but it isnt much. ",
            "date": "Answered December 23, 2011",
            "views": "321",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erin Quinn",
                    "user_href": "/profile/Erin-Quinn-24"
                },
                {
                    "user_id": "David Homes",
                    "user_href": "/profile/David-Homes-3"
                },
                {
                    "user_id": "Southern Hemisphere",
                    "user_href": "/profile/Southern-Hemisphere-1"
                },
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Albert Grande",
                    "user_href": "/profile/Albert-Grande"
                },
                {
                    "user_id": "John Thomas",
                    "user_href": "/profile/John-Thomas-171"
                },
                {
                    "user_id": "Bert Dries",
                    "user_href": "/profile/Bert-Dries-1"
                },
                {
                    "user_id": "Zak Ely",
                    "user_href": "/profile/Zak-Ely-2"
                },
                {
                    "user_id": "Himansh Pandey",
                    "user_href": "/profile/Himansh-Pandey-8"
                },
                {
                    "user_id": "David Elrod",
                    "user_href": "/profile/David-Elrod-2"
                }
            ]
        }
    ]
}