{
    "title": "How much do musicians get paid per hour? - Quora",
    "tags": [
        "Getting Paid",
        "Wages and Hourly Wages",
        "Music Industry",
        "Musicians",
        "Salaries and Wages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michaele Hannemann",
                "href": "/profile/Michaele-Hannemann"
            },
            "answer_text": "In my experience, performance isn't usually a per-hour kind of job, but I'll do some figuring below. Sometimes the pay is based on how much money the venue makes at the door or at the bar that night, but it’s almost always a flat rate on my gigs. The type of performance can make a huge difference in pay. I have experience with small, local venues (the least pay), festivals, weddings/private parties & corporate gigs (the most pay). Ball park figures, I've made $75-$150 at the lower-paying gigs & $200-$800 for the higher-paying gigs I've played. Lower-paying shows usually require at least 2 hours total of setup & load out time in addition to the 3-hour show (usually… sometimes 4 it’s hours)… So each little gig is no less than 5 hours of work (after all the learning, practicing & otherwise preparing for the show). I usually make $100 for this type of gig. So that would be $20/hour. My most typical high-paying gig is a 4-hour corporate event or wedding with additional time required to set up early enough to be out of the way when the party starts (band starts later). So, maybe 4 hours of setup/load out/be available in general time. 8 hours of work (& it's often a travel gig for these, so that's actually more time) & pay is $350… That's $43.75/hour. Edit: It doesn't really make sense to consider it per-hour work, though, because we aren't working 40-hour work weeks. We can only play so many gigs per week… and that fluctuates with the change of seasons & weather for outdoor venues, daytime show opportunities in the area & other variables. Edit #2: Also, (a related side note) there's no paid training on this job… most musicians spent years paying someone else to teach them what they need to know to fulfill the prerequisite of being able to play professionally before they could even begin trying to do it. ",
            "date": "Answered June 18, 2019",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Ruddick",
                    "user_href": "/profile/Thomas-Ruddick-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Chovanek",
                "href": "/profile/Chris-Chovanek"
            },
            "answer_text": "Depends, they take into consideration the time of day, it's location, how far they have to travel, the type of event… there's a lot of factors that need to be considered, some charge more than others, they need to consider transporting gear, eating and possibly staying in a hotel overnight…. I've gigged for free, I've gigged for £500 how much it costs depends on a lot of things and the musician themselves ",
            "date": "Answered March 31, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}