{
    "title": "How does copyright law work when sampling music? - Quora",
    "tags": [
        "Music Composition",
        "Copyright Infringement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "There’s the legal answer, and the practical answer. First, here’s the legal answer. Note that I’m a music academic, not a lawyer. For a complete listing of legal resources, see the USC Music Copyright Infringement Resource. The law around sampling was unclear in the early days of hip-hop and electronic dance music. Statute did not (and still doesn’t) explicitly address transformative sampling. This hardly mattered, since so few artists had enough commercial success to attract the attention of copyright holders. The first high-profile sampling lawsuits began in the late 1980s as hip-hop and techno became more commercially significant. Courts generally found that sampling without permission was not acceptable. Producers and music labels began working out ad-hoc arrangements, setting prices and reaching agreements according to the specific situation. The first generation of sampling artists could (and maybe should) have put forward a Fair Use argument for not having to license samples at all, so long as their use was sufficiently transformative as to constitute a commentary on or parody of the original work. But this is not what artists did. Instead, most recognizable samples got cleared, and those artists who failed to seek permission knew they were at risk of a lawsuit. In 2004, the US Sixth Circuit Court of Appeals held that copyright law applied to any sample used in a remixed recording, regardless of how small or fragmentary the sample might be. That precedent has mostly informed the legal status quo, until new legislation specifically addresses transformative sampling. The situation continues to be confusing and contradictory, with considerable ambiguity about the extent of the Fair Use exception. Meanwhile, as hip-hop and electronic dance music have become more commercially successful and culturally prominent, rights holders have recognized the value of samples and have raised their license fees accordingly. Free culture advocates and hip-hop lovers alike complain that presently, the only way to make collage-like works from pop music is to either skirt the law or pay exorbitant sums of money. McLeod and DiCola (2011) calculated that if the Beastie Boys’ well loved album Paul’s Boutique were made today, the sample licenses would result in almost twenty million dollars in losses on 2.5 million copies sold. Some producers continue to seek the shelter of the Fair Use exception, in spite of courts generally not recognizing it outside of academic or institutional usage. The mashup artist Greg “Girl Talk” Gillis, whose work consists entirely of highly recognizable pop samples, does not seek clearances, and invokes Fair Use to justify his practices. So far, no one has taken action against him, but this is is probably due less to the effectiveness of Fair Use as a legal argument, and more to pragmatism on the part of rights holders. Copyright attorney Martin Schwimmer (personal communication, 2010) argues that no one will ever sue Girl Talk, regardless of the legal merits, because it would inevitably be a losing proposition. Girl Talk would be a highly sympathetic defendant, since he is white, well-educated, and possessed of a fervent online following. (Schwimmer himself is a fan.) If Girl Talk is successfully sued, the internet will rise up in protest, resulting in a public relations disaster that would cost the copyright holder far more than they could win in a settlement. If a rightsholder brings a case and loses, that establishes a precedent that will embolden other sampling artists. Rights holders prefer the status quo, where the law is murky and commercial artists mostly license their samples to be on the safe side. So that leads us to the practical answer. In reality, thousands of sample-based tracks get released every year, and a huge percentage of those samples are unlicensed. If the sample is sufficiently short or transformed to the point of being unrecognizable, then no one will know that it’s there, and you’re fine. If you’re a low profile artist without a large following or significant commercial success, which most of us are, then no one cares what you do, legal or not. I’ve been posting unauthorized sample-based music on SoundCloud, YouTube and other sites for years, and nothing bad has ever happened to me. If I’m doing commercial work, like a film or video score, then I’ll keep my samples small and unobtrusive. But if I’m making art for the sake of art, then anything goes. A little philosophy: I believe that you have a positive moral obligation to make sample-based music without permission, as a form of civil disobedience against our copyright regime, which favors corporate interests over bedroom producers to an absurd degree. We have a societally valuable right to make transformative works, and the law unfairly inhibits that right. Sampling is an incredibly powerful and useful production technique, and it shouldn’t be the exclusive privilege of superstars and the rich. Pragmatically, there are different approaches you can take. One is to ask permission. Sometimes you get it without having to pay anything, or the license fee is something you can easily afford. Alternatively, you can complete the track and then replace the sample with an SBD (“same but different”) - something that sounds very similar but isn’t copyrighted. Sometimes producers will have musicians replay (interpolate) the sample, which is perfectly legal as long as the sample isn’t part of the top-line melody of a song. Dr Dre productions are full of P-Funk samples that were replayed by studio musicians. Finally, you can always hope to become successful enough to be able to clear any sample you want. In the meantime, call your representatives in Congress and ask for a compulsory licensing system for samples like the one we have for cover songs. ",
            "date": "Answered January 14, 2017",
            "views": "23",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun Nekkalapudi",
                    "user_href": "/profile/Arun-Nekkalapudi"
                },
                {
                    "user_id": "Pieter Mario Fernandez",
                    "user_href": "/profile/Pieter-Mario-Fernandez"
                },
                {
                    "user_id": "Mina Aslan",
                    "user_href": "/profile/Mina-Aslan"
                },
                {
                    "user_id": "Kelly Warner",
                    "user_href": "/profile/Kelly-Warner-5"
                },
                {
                    "user_id": "Steve Rubens",
                    "user_href": "/profile/Steve-Rubens-3"
                },
                {
                    "user_id": "Seth Balogh",
                    "user_href": "/profile/Seth-Balogh-1"
                },
                {
                    "user_id": "Raheem Brooks",
                    "user_href": "/profile/Raheem-Brooks-1"
                },
                {
                    "user_id": "Nick Moyne",
                    "user_href": "/profile/Nick-Moyne"
                },
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Following the 1991 lawsuit Grand Upright Music, Ltd. v. Warner Bros. Records Inc.., Biz Markie lost in his fair use claim that a sample of Alone Again was allowable. This caused a huge shift in the music industry and from that point samples have to be licensed from the original record publisher or artists. Yes, many artists let this go for free, assuming they were contacted first. But it is the right of the copyright owners to expect payment upfront before giving permission for use. The standard currently is \"would the record execs recognize the sample\". One measure probably qualifies. Or you could use this personal standard: if it isn't recognizable, no one ever knows they are supposed to sue you. ",
            "date": "Updated January 11, 2017",
            "views": "589",
            "upvotes": "0"
        }
    ]
}