{
    "title": "How to resonate in my mask when singing - Quora",
    "tags": [
        "Singing",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Libby Mehaley",
                "href": "/profile/Libby-Mehaley"
            },
            "answer_text": "Hold mask in front of face. Sing into it. The surfaces of the object will resonate palpably. Ha ha. Just kidding. Seriously though, you have a face, not a mask. What some folks are referring to with said terminology is the phenomenon of sympathetic resonance in the bones and tissues of the face. Humming on an ‘m' ’n' or ‘ng' should produced this sensation for you. That’s because you are forcing the sound to exit only through the nose, so clearly those areas around the nose will resonate more. If you want to work on increasing resonance in your sound, try switching back and forth from those nasal consonants to pure vowels. Ex. “nnnn-eeeee, nnnn-aaaaay, nnnn-aaaaah, nnnnn-oooo, nnnn-oooooh”. Now, some styles want more of that twangy nasal sound than others, so be careful with this. Coming from the classical genre, I incorporate nasal resonance minimally. It's helpful to me to think about directing higher head voice notes a bit more behind the nose (naso-pharynx) and I then feel sympathetic resonance sort of in and between the cheek-bones. Remember, there is a difference between sympathetic resonance and the resonance produced in the pharynx during vocal production. It's better not to be too concerned about the former type, as everyone has individual sensations. ",
            "date": "Answered June 30, 2018",
            "views": "637",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zubair Hossain",
                "href": "/profile/Zubair-Hossain-3"
            },
            "answer_text": "Unfortunately nothing online or on youtube will help. I hate to break it to ya, but this sort of thing needs a teacher. You really should get a teacher, belting is dangerous and without proper technique you will damage your vocal cords. The idea is not to scare you, but to tell you to be careful. Also, resonance strategies change depending on what you’re planning on singing. Resonating in the mask is something more operatic leaning than what pop or rock or musical belters are doing. One can learn even by example, but there aren’t a lot of good examples on youtube and even then, seeing it happen in front of you is a lot more educational. My advice to you is to try and get a teacher. You can message me if you want to speak at length. Vocal technique is definitely too complicated for a single quora answer. Good luck! ",
            "date": "Answered June 29, 2018",
            "views": "468",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barry Pulliam",
                    "user_href": "/profile/Barry-Pulliam-3"
                },
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                }
            ]
        }
    ]
}