{
    "title": "How to determine the musical rhythm of a song - Quora",
    "tags": [
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Omar Baltuth",
                "href": "/profile/Omar-Baltuth"
            },
            "answer_text": "The other answers so far have the “right” answer as long as one’s goal is to replicate a performance of a piece by another artist. Listen. Mimic. Reproduce. If that’s what you are trying to do, then have at it. Posing this question, though, implies that the querent is having some difficulty in “picking up on” the rhythm of some songs with an irregular or problematic rhythm. Perhaps one is trying to play along and just can’t get the strum right. Proficient musicians don’t have any trouble with this kind of thing and may not even understand the question. Suggestions like, “Get into the groove,” don’t help much if you’re rhythmically challenged because you don’t know where the groove is and are unable to get into it, whatever that means. What does one do? Novices and musicians who do not play with other people much often have this problem. They have their own way of playing and it doesn’t mesh well with anyone else’s way of playing the same thing. Getting the rhythm “right” is more a question of letting go of your preconceived notion of the musical piece and starting over from scratch. Here are some things to do. Track the drummer’s basic beat. Ignore flourishes and fills and see if you can sync up with the basic “thump, thump, thump, thump,” thing underlying all the flashy stuff. This is what dancers do to stay with the music. Try doing the same thing. Play with that rhythm and assess how well it matches the melody. For simpler songs, this is all you need to do.Track the bass player. Play notes in sync with the bass line. If it’s too fast, try playing every other note. If it’s too slow, fill in the gaps while minding that slow beat and taking pains to stay in sync with it.Once the basic rhythm is locked down, analyze what the rhythm guitarist or keyboardist is doing as a background accompaniment. This is not the lead melody line or what a soloist is playing! This is that repetitive thing in the background (e.g., “oom-chika-BLANG-blong”) that is probably what you are thinking of as “the rhythm”. The important thing to remember in analyzing any such rhythm is that it’s built on top of the underlying basic rhythm. It has to fit neatly into that basic rhythm and not conflict with it.If the foregoing activities do not suffice, consult some sheet music. You can ignore, for the most part, the treble part because that’s the melody. What you want is probably in the bass clef, the “left hand part” of a piano score. Seeing the rhythm written out with musical notation can clarify what’s going on. Problematic constructs like syncopated rhythms, rests and arrhythmic elements like triplets are shown in enough detail to figure out something that you can do that is consistent with it. You can simplify it as much as you need to as long as you don’t “step on it”, that is, conflict with it.A great deal of the difficulty some people have in working out rhythms is attributable to doggedly sticking with a wrongheaded notion of a song’s rhythm that one has been taught or derived on one’s own. I’ve got two examples of this from my own experience. One of the earliest songs people showed me how to play was Mr. Bojangles. This was done informally, by demonstration, without any kind of score or lead sheet. Everyone who showed me how to play the song used a 4/4 rhythm that never sounded quite right to me. Just a few years ago, I worked up a lead sheet for the song. Listening to recordings, I realized that what I had worked out on my own was a 6/8 rhythm that allowed me to track the melody line very closely, making it possible to play and sing simultaneously. (Use 1/8-note triplets with the emphasis on the first of each set of triplets. “I knew a man Bo-jangles and he danced for you, DAH-da-da..”) Being curious if this was correct, I looked at some sheet music. Surprisingly, many of these scores indicated 4/4, but some indicated 3/4. The timing in these was awkward. When I tried to play it as written, it was impossible to make it sound like the recordings with which I was familiar. Eventually, I found a 6/8 version and was able to play from it easily. I don’t think Jerry Jeff Walker (the songwriter) was partial to scoring sheet music, so whatever sheet music there is for the song reflects what some transcriber thought they heard. I can’t say what is “correct”, but I know what works for me. I can play it in 6/8, and sing at the same time. A 3/4 or 4/4 was useless.The Cat Stevens song Rubylove from his 1971 album Teaser and the Firecat is a quintessentially “Greek-sounding” song that many people like to hear but few attempt to perform. The few people who I’ve seen try seemed to think it was in common 4/4 time. It didn’t sound at all like the recording. Doing some research, I found that the frenetic bouzouki accompaniment used an odd Mediterranean rhythm, 7/8, that you could count out as, “1–2–3, 1–2, 1–2.” This may be fine if you’re flailing a bouzouki or a mandolin, but it’s hard to follow if you’re playing a guitar or singing the melody. Taking my cue from the lyrics, which follow the stressed eighth notes, I started ignoring the unstressed beats and internalized an unnatural 3.5/4 rhythm that sounded like, “DAAH, dah, dah,” inside my head. That is, I thought of it as one slow beat, followed by two of shorter duration, equal to each other. This works well. (“Who’ll be my love, dah, dah. You’ll be my love, dah, dah…”) Anything else sounds like crap. Try it.The point of these anecdotes is that once I got the rhythm right, the song got easy. I could actually play it and it sounded enough like the performance that I was covering that listeners recognized it. If this is what you’re after, then you could profit by working out a similar methodology. My way isn’t the only way to do it, but it works for me. Work out something that works for you, then answer some question like this on Quora. We must not ignore what happens when you use a different rhythm than the performance that you are working from as a model. It can sound really good, fine but a bit odd, or just godawful. Once in a great while, such alterations create a truly unique interpretation that creates what is essentially a different song. Here’s a few of which I have taken note. In 1976, Walter Murphy too, the first movement of Beethoven’s Symphony No. 5 and made a pop tune out of it. It was a big hit. Some people like it and some don’t. Either way, it sound pretty much like the same song.UB40 took Neil Diamond’s Red Red Wine and restructured it with a reggae back-beat (1-and-2-and-3-and-4-and) rhythm. It changed the whole thing. If you hear the UB40 version first, as many people now do, it’s hard to not think of it as the “original” version. It’s certainly more interesting than Diamond’s original version.The 1971 song Killing Me Softly with His Song was a tasty soft pop ballad hit as recorded by Roberta Flack in 1973. In 1996, Lauryn Hill and the Fugees decided to “update” the song to reflect the developing hip-hot trends in popular music. They brought in a rapper to do an extensive rap in the middle while they eviscerated this beautiful song to reduce it down to a feeble, monotonous background for the rap and Hill’s rough-hewn yowling. The melody was gone. They basically destroyed the song. What’s worse is that this corruption is thought of a “the song” by a lot of non-musical younger people who have no appreciation of melodic phrasing. Listen to Roberta’s version first, then Fugees’ and tell me which is better. If you prefer the latter, you know nothing about music.",
            "date": "Answered November 16, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eugenio Gonzalez",
                    "user_href": "/profile/Eugenio-Gonzalez-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles B. Kreitzberg",
                "href": "/profile/Charles-B-Kreitzberg"
            },
            "answer_text": "How do you determine the musical rhythm of a song? This is an oversimplification but most songs fall into three basic rhythms: 3/4 4/4 6/8 Here is a bit of music notation. You can see that the rhythm for this piece is 3/4:  (Image source: File:Time signature example.svg (https://commons.wikimedia.org/wiki/File:Time_signature_example.svg)) Now, music is divided into measures. Each measure has the same number of beats. The top number in the time signature tells you how many beats there are in the measure. So in 3/4 time there are 3 beats in a measure. The pulse of this music is 1–2–3, 1–2–3, 1–2–3… If you listen to a piece in 3/4 time you should be able to hear that pulse. An example of 3/4 time is a waltz. Listen to this waltz and hear the pulse:  OK. Now let’s look at 4/4. This is the most common rhythm. Each measure has 4 beats: 1–2–3–4, 1–2–3–4, 1–2–3–4… Most songs are in 4/4 time. This is the rhythm to which we walk. So a great example to listen to is a march:  Compare it to the waltz and you will hear the difference. Now, you can probably guess that 6/8 time has six beats in each measure. But there is a twist. In 6/8 time the beats are divided into two groups of 3. So a measure looks like this: 1–2–3 | 4–5–6, 1–2–3 | 4–5–6, 1–2–3 | 4–5–6…  Of course there are other rhythms but most of the time anything you listen to will be one of the three: 3/4, 4/4 and 6/8. Here are a couple of other links I found on YouTube that may help you feel the pulse. Listen and let your body move. Dance. And you will develop a good feel for rhythm.   Charlie ",
            "date": "Answered July 21, 2018",
            "views": "31",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arash Hosseini",
                    "user_href": "/profile/Arash-Hosseini-7"
                },
                {
                    "user_id": "Shounak Dawalkar",
                    "user_href": "/profile/Shounak-Dawalkar-1"
                },
                {
                    "user_id": "Sarthak Mitra",
                    "user_href": "/profile/Sarthak-Mitra-2"
                },
                {
                    "user_id": "Amudan Maney",
                    "user_href": "/profile/Amudan-Maney"
                },
                {
                    "user_id": "Bach Tran",
                    "user_href": "/profile/Bach-Tran-15"
                },
                {
                    "user_id": "Michael Bruce",
                    "user_href": "/profile/Michael-Bruce-108"
                },
                {
                    "user_id": "Monica McCoy",
                    "user_href": "/profile/Monica-McCoy"
                }
            ]
        }
    ]
}