{
    "title": "How to learn playing the piano in 2 months - Quora",
    "tags": [
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fernanda Machado",
                "href": "/profile/Fernanda-Machado-5"
            },
            "answer_text": "Find yourself a great teacher and practice smart every day. I’ve had lots of students who were taking part in live public presentations within 2 months of lessons. A consistent plan of musical experiences (practicing, listening, reading, writing) with the proper constant guidance should do the trick. Have fun! ",
            "date": "Answered September 19, 2018",
            "views": "131",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Teo Chew Lang",
                    "user_href": "/profile/George-Teo-Chew-Lang"
                },
                {
                    "user_id": "Austin He",
                    "user_href": "/profile/Austin-He-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Rae",
                "href": "/profile/Michael-Rae-13"
            },
            "answer_text": "Try HDpiano(dot)com if you want to learn accompaniment real fast. FlowKey for solo piano. I learned best by learning different styles of music. Example: New age piano music strengthened by fingers and developed my sense of Melody. Favorite new age pianists Ludovico Einaudi and Helen Jane Long (although the web says she's classical but I think her music sounds new age-y). Classical taught me sight reading and structure. I like Haydn and Chopin. Accompaniment taught me chords, inversions, progressions, rhythm. Pop and rock songs are my favorite to play. I exercised my fingers a lot to develop agility and stamina. Rolling a rubber ball between my fingers helped, and also scales and hanon exercises. But I believe if you want to learn something fast, start with accompaniment (chords, rhythm). HDpiano is a great website to learn your favorite pop and rock songs that you want to sing to. Check out my Instagram @mraebermudez. I learned to play piano last year. I started with accompaniment then as you'll see in my videos as I moved on to new age and solo piano. Good luck! ",
            "date": "Answered September 23, 2018",
            "views": "212",
            "upvotes": "0"
        }
    ]
}