{
    "title": "How does EXO have that many fans? I love BTS better. - Quora",
    "tags": [
        "EXO (K-pop group)",
        "Fans and Supporters",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zemuang Muang",
                "href": "/profile/Zemuang-Muang"
            },
            "answer_text": "Well firstly note I'm an ARMY have been one, is one and will remain one. So, EXO? Actually they're pretty good you know. Ik you're entitled to your own opinions, so I'm being mild here. I'll admit, they have a large number of members and all that so I gave up watching some reality shows as I am not one who can recognise faces easily (idk how I even remembered BTS) But basing on their MVs and choreo and music and the like, they really deserve their huge fan base. Don't try to go exo is from sm and bts is from bighit shit, true that agency may play a role, but in the end, they had to work their asses off like ALL idols out there. The members are all good people as well. They have a good personality, plus everything that can draw in fans like a tycoon whoops. So what I'm trying to do here is NOT defend them, I am a forever BTS Stan and I really couldn't care less about other idols or other fandoms particularly with hixtaps out rn. But, it would be absurd to think that one group exceeds the other or that your bias group is better than all others just cause you Love them better. For exo Ls they are lovers of exo just as we are lovers of bts. Everyone got their own personal likes and dislikes so just putting down your confusion about why exol is a big fanbase just casue you think or feel that bts is better is actually pretty stupid. I'm not trying to instigate war or any hard feelings, what I want to say is that just as you feel that bts is better or just as you love bts better, exols love exo better. And that's all there to it. No one can change what we feel about our idols and that's that. It would be absurd to base your question on mere assumption. EXO is pretty cool to me. So are all other idol groups somehow, they all are cool in their own ways fighting and struggling hard. I just love BTS and that's about it. ",
            "date": "Answered March 1, 2018",
            "views": "720",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Conrado Luis Lallego",
                    "user_href": "/profile/Conrado-Luis-Lallego"
                },
                {
                    "user_id": "Nay Myo",
                    "user_href": "/profile/Nay-Myo-143"
                },
                {
                    "user_id": "Neha",
                    "user_href": "/profile/Neha-1769"
                },
                {
                    "user_id": "Tulika Gogoi",
                    "user_href": "/profile/Tulika-Gogoi-5"
                },
                {
                    "user_id": "Danielle Doyle",
                    "user_href": "/profile/Danielle-Doyle-41"
                },
                {
                    "user_id": "Mary S Ngaihte",
                    "user_href": "/profile/Mary-S-Ngaihte"
                },
                {
                    "user_id": "Teeny Tiny",
                    "user_href": "/profile/Teeny-Tiny-5"
                },
                {
                    "user_id": "Vu Minh Hoang",
                    "user_href": "/profile/Vu-Minh-Hoang-2"
                },
                {
                    "user_id": "María Parralo",
                    "user_href": "/profile/María-Parralo"
                },
                {
                    "user_id": "Gabriel Ensistan",
                    "user_href": "/profile/Gabriel-Ensistan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ale Plazola",
                "href": "/profile/Ale-Plazola"
            },
            "answer_text": "As everyone else has basically said. It all comes down to Personal Taste. As an EXO-L, I can tell you the many qualities that EXO has that makes them one of Korea’s Top boy groups. But, I’m not going to since you declared that you like BTS better, which is great. I love BTS as well. The only thing I will tell you is think about how long Exo has stayed relevant in kpop since 2013 actually with the explosion of Growl. Do you really think that if they didn’t have such a large fanbase would they still be very big in Kpop? Probably not. I would say the same thing applies to BTS. Their music is very appealing to a lot of people and I would say the group itself is very appealing to a lot of people. I can say that I love their music(VOCALS) and their personalities as a Hardcore EXO-L. Honestly, groups with big fanbases do in fact have large fan bases due to the talent a group and qualities the group has. (Some will disagree) I don’t think that if EXO weren’t talented then they would have such a large fanbase and would have died down a long time ago. But, that is not the case. Anyways, I would advise to try to keep an open mind when asking these sort of questions. Remember that not everyone likes the same things as you, not everyone likes BTS or EXO. ",
            "date": "Updated March 8, 2018",
            "views": "13",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nay Myo",
                    "user_href": "/profile/Nay-Myo-143"
                },
                {
                    "user_id": "Muskaan Hossain",
                    "user_href": "/profile/Muskaan-Hossain"
                },
                {
                    "user_id": "Sharonrose Dsouza",
                    "user_href": "/profile/Sharonrose-Dsouza"
                },
                {
                    "user_id": "Neha",
                    "user_href": "/profile/Neha-1769"
                },
                {
                    "user_id": "Im Just Here",
                    "user_href": "/profile/Im-Just-Here-4"
                },
                {
                    "user_id": "Danielle Doyle",
                    "user_href": "/profile/Danielle-Doyle-41"
                },
                {
                    "user_id": "María Parralo",
                    "user_href": "/profile/María-Parralo"
                },
                {
                    "user_id": "Marshmallow",
                    "user_href": "/profile/Marshmallow-44"
                },
                {
                    "user_id": "Anne",
                    "user_href": "/profile/Anne-509"
                },
                {
                    "user_id": "Marika Desquitado",
                    "user_href": "/profile/Marika-Desquitado"
                }
            ]
        }
    ]
}