{
    "title": "How to convince my mom to take me to a boarding school - Quora",
    "tags": [
        "Boarding Schools",
        "Mother-Child Relationships",
        "Persuasion",
        "Mothers",
        "Schools",
        "Family Relationships and Dynamics",
        "Parents",
        "Family",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Hendrix",
                "href": "/profile/Jennifer-Hendrix-1"
            },
            "answer_text": "1 - Do they have the money for this, cause it's not cheap? 2 - We're in a pandemic, are you a fool? Keep your behind at home, mask up, and deal with what you got. You never know when someone's going to lose a job right now. Not to mention, if you're a U.S. citizen and in the U.S., there are like 3 countries who'll admit us right now. None who you'd want to go to boarding school in. 3 - Once we get thru this mess, *then* approach them with the situation and only if you're sure everything is copacetic. And I mean, you better have been kissing some major butt. Helping out around the house without being asked, staying home and not getting COVID, don't ask for any big purchases cause they're going to need that for boarding school, keeping those grades WAY up there. Study like crazy! All in all, just don't act like some fool President, act like you have sense. Then you can talk to them calmly about it. ",
            "date": "Answered October 9, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nan Waldman",
                "href": "/profile/Nan-Waldman"
            },
            "answer_text": "To persuade parents to allow their child to attend a boarding school, make a list of pros and cons so that parents can see and better understand the reasons why boarding school would be the best education placement for their child. It would help if the student applied for admission and was accepted. Then, access to boarding school staff could help parents decide their child’s best education placement. One major advantage of a boarding school is that there is no commute except for walking to class and all other sports and activities. A reason why many parents are initially reluctant to send their child to boarding school is that they love being parents and want to be with their child as they grow up. If financial aid is available, financing a costly boarding school education may not be as burdensome as parents may fear it will be. Usually private schools give priority in admissions to legacies, but highly gifted students improve the school’s stats; and private schools encourage enrollment of students whose diversity (race, religion, national origin, native lanfuage(s), disability, etc.) improves the school’s student population. Boarding school can be a wonderful experience. Look at a few of the best examples you can find. Do your research. Start here: Phillips Exeter Academy. Good luck! ",
            "date": "Answered October 9, 2020",
            "views": "53",
            "upvotes": " Answer requested by Esther George"
        },
        {
            "author_info": {
                "name": "Ernest Cleto",
                "href": "/profile/Ernest-Cleto"
            },
            "answer_text": "Are you sure about that?I have heard those places are very hard,strict and sometimes cruel.You might want to read Paris Hiltons story before you decide.She became famous at a young age and dropped off the face of the earth.Then I read that her parents sent her to one of those http://schools.It truly broke my heart. ",
            "date": "Answered October 9, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theresa Mohr",
                "href": "/profile/Theresa-Mohr-2"
            },
            "answer_text": "Boarding schools are extremely expensive. If your family has the money just ask her and give her a reason why you would like to go away. ",
            "date": "Answered October 9, 2020",
            "views": "19",
            "upvotes": " Answer requested by Esther George"
        },
        {
            "author_info": {
                "name": "Elaine Cox",
                "href": "/profile/Elaine-Cox-14"
            },
            "answer_text": "Can she afford to take you to a boarding school? If not, get a job and earn the money to go yourself. ",
            "date": "Answered October 9, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}