{
    "title": "How long is a day in the Bible? - Quora",
    "tags": [
        "Bible Study",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Williams",
                "href": "/profile/George-Williams-210"
            },
            "answer_text": "You might be asking because of the extremist fanatical view some religious people have from the Bible account of Genesis…if that´s the case… How Long Is a Genesis “Day”? Many consider the word “day” used in Genesis chapter 1 to mean 24 hours. However, in Genesis 1:5 God himself is said to divide day into a smaller period of time, calling just the light portion “day.” In Genesis 2:4 all the creative periods are called one “day”: “This is a history of the heavens and the earth in the time of their being created, in the day [all six creative periods] that Jehovah God made earth and heaven.” The Hebrew word yohm, translated “day,” can mean different lengths of time. Among the meanings possible, William Wilson’s Old Testament Word Studies includes the following: “A day; it is frequently put for time in general, or for a long time; a whole period under consideration . . . Day is also put for a particular season or time when any extraordinary event happens.”1 This last sentence appears to fit the creative “days,” for certainly they were periods when extraordinary events were described as happening. It also allows for periods much longer than 24 hours. Genesis chapter 1 uses the expressions “evening” and “morning” relative to the creative periods. Does this not indicate that they were 24 hours long? Not necessarily. In some places people often refer to a man’s lifetime as his “day.” They speak of “my father’s day” or “in Shakespeare’s day.” They may divide up that lifetime “day,” saying “in the morning [or dawn] of his life” or “in the evening [or twilight] of his life.” So ‘evening and morning’ in Genesis chapter 1 does not limit the meaning to a literal 24 hours. “Day” as used in the Bible can include summer and winter, the passing of seasons. (Zechariah 14:8) “The day of harvest” involves many days. (Compare Proverbs 25:13 and Genesis 30:14.) A thousand years are likened to a day. (Psalm 90:4; 2 Peter 3:8, 10) “Judgment Day” covers many years. (Matthew 10:15; 11:22-24) It would seem reasonable that the “days” of Genesis could likewise have embraced long periods of time—millenniums. Want to know more?… Well let´s brake it down: First “Day” “‘Let light come to be.’ Then there came to be light. And God began calling the light Day, but the darkness he called Night. And there came to be evening and there came to be morning, a first day.”—Genesis 1:3, 5. Of course the sun and moon were in outer space long before this first “day,” but their light did not reach the surface of the earth for an earthly observer to see. Now, light evidently came to be visible on earth on this first “day,” and the rotating earth began to have alternating days and nights. Apparently, the light came in a gradual process, extending over a long period of time, not instantaneously as when you turn on an electric light bulb. The Genesis rendering by translator J. W. Watts reflects this when it says: “And gradually light came into existence.” (A Distinctive Translation of Genesis) This light was from the sun, but the sun itself could not be seen through the overcast. Hence, the light that reached earth was “light diffused,” as indicated by a comment about verse 3 in Rotherham’s Emphasised Bible.—See footnote b for verse 14. Second “Day” “‘Let an expanse come to be in between the waters and let a dividing occur between the waters and the waters.’ Then God proceeded to make the expanse and to make a division between the waters that should be beneath the expanse and the waters that should be above the expanse. And it came to be so. And God began to call the expanse Heaven.”—Genesis 1:6-8. Some translations use the word “firmament” instead of “expanse.” From this the argument is made that the Genesis account borrowed from creation myths that represent this “firmament” as a metal dome. But even the King James Version Bible, which uses “firmament,” says in the margin, “expansion.” This is because the Hebrew word ra·qiʹa‛, translated “expanse,” means to stretch out or spread out or expand. The Genesis account says that God did it, but it does not say how. In whatever way the described separation occurred, it would look as though the ‘waters above’ had been pushed up from the earth. And birds could later be said to fly in “the expanse of the heavens,” as stated at Genesis 1:20. Third “Day” “‘Let the waters under the heavens be brought together into one place and let the dry land appear.’ And it came to be so. And God began calling the dry land Earth, but the bringing together of the waters he called Seas.” (Genesis 1:9, 10) As usual, the account does not describe how this was done. No doubt, tremendous earth movements would have been involved in the formation of land areas. Geologists would explain such major upheavals as catastrophism. But Genesis indicates direction and control by a Creator. In the Biblical account where God is described as questioning Job about his knowledge of the earth, a variety of developments concerning earth’s history are described: its measurements, its cloud masses, its seas and how their waves were limited by dry land—many things in general about the creation, spanning long periods of time. Among these things, comparing earth to a building, the Bible says that God asked Job: “Into what have its socket pedestals been sunk down, or who laid its cornerstone?”—Job 38:6. Interestingly, like “socket pedestals,” earth’s crust is much thicker under continents and even more so under mountain ranges, pushing deep into the underlying mantle, like tree roots into soil. “The idea that mountains and continents had roots has been tested over and over again, and shown to be valid,” says Putnam’s Geology.2 Oceanic crust is only about 5 miles thick, but continental roots go down about 20 miles and mountain roots penetrate about twice that far. And all earth’s layers press inward upon earth’s core from all directions, making it like a great “cornerstone” of support. Whatever means were used to accomplish the raising up of dry land, the important point is: Both the Bible and science recognize it as one of the stages in the forming of the earth. Land Plants on Third “Day” The Bible account adds: “‘Let the earth cause grass to shoot forth, vegetation bearing seed, fruit trees yielding fruit according to their kinds, the seed of which is in it, upon the earth.’ And it came to be so.”—Genesis 1:11. Thus by the close of this third creative period, three broad categories of land plants had been created. The diffused light would have become quite strong by then, ample for the process of photosynthesis so vital to green plants. Incidentally, the account here does not mention every “kind” of plant that came on the scene. Microscopic organisms, water plants and others are not specifically named, but likely were created on this “day.” Fourth “Day” “‘Let luminaries come to be in the expanse of the heavens to make a division between the day and the night; and they must serve as signs and for seasons and for days and years. And they must serve as luminaries in the expanse of the heavens to shine upon the earth.’ And it came to be so. And God proceeded to make the two great luminaries, the greater luminary for dominating the day and the lesser luminary for dominating the night, and also the stars.”—Genesis 1:14-16; Psalm 136:7-9. Previously, on the first “day,” the expression “Let light come to be” was used. The Hebrew word there used for “light” is ’ohr, meaning light in a general sense. But on the fourth “day,” the Hebrew word changes to ma·’ohrʹ, which means the source of the light. Rotherham, in a footnote on “Luminaries” in the Emphasised Bible, says: “In ver. 3, ’ôr [’ohr], light diffused.” Then he goes on to show that the Hebrew word ma·’ohrʹ in verse 14 means something “affording light.” On the first “day” diffused light evidently penetrated the swaddling bands, but the sources of that light could not have been seen by an earthly observer because of the cloud layers still enveloping the earth. Now, on this fourth “day,” things apparently changed. An atmosphere initially rich in carbon dioxide may have caused an earth-wide hot climate. But the lush growth of vegetation during the third and fourth creative periods would absorb some of this heat-retaining blanket of carbon dioxide. The vegetation, in turn, would release oxygen—a requirement for animal life. Now, had there been an earthly observer, he would be able to discern the sun, moon and stars, which would “serve as signs and for seasons and for days and years.” (Genesis 1:14) The moon would indicate the passing of lunar months, and the sun the passing of solar years. The seasons that now “came to be” on this fourth “day” would no doubt have been much milder than they became later on.—Genesis 1:15; 8:20-22. Fifth “Day” “‘Let the waters swarm forth a swarm of living souls and let flying creatures fly over the earth upon the face of the expanse of the heavens.’ And God proceeded to create the great sea monsters and every living soul that moves about, which the waters swarmed forth according to their kinds, and every winged flying creature according to its kind.”—Genesis 1:20, 21. It is of interest to note that the nonhuman creatures with which the waters were to swarm are called “living souls.” This term would also apply to the “flying creatures [that] fly over the earth upon the face of the expanse.” And it would also embrace the forms of sea and air life, such as the sea monsters, whose fossil remains scientists have found in recent times. Sixth “Day” “‘Let the earth put forth living souls according to their kinds, domestic animal and moving animal and wild beast of the earth according to its kind.’ And it came to be so.”—Genesis 1:24. Thus on the sixth “day,” land animals characterized as wild and domestic appeared. But this final “day” was not over. One last remarkable “kind” was to come: “And God went on to say: ‘Let us make man in our image, according to our likeness, and let them have in subjection the fish of the sea and the flying creatures of the heavens and the domestic animals and all the earth and every moving animal that is moving upon the earth.’ And God proceeded to create the man in his image, in God’s image he created him; male and female he created them.”—Genesis 1:26, 27. Chapter 2 of Genesis apparently adds some details. However, it is not, as some have concluded, another account of creation in conflict with that of chapter 1. It just takes up at a point in the third “day,” after dry land appeared but before land plants were created, adding details that were pertinent to the arrival of humans—Adam the living soul, his garden home, Eden, and the woman Eve, his wife.—Genesis 2:5-9, 15-18, 21, 22. The foregoing is presented to help us understand what Genesis says. And this quite realistic account indicates that the creative process continued throughout a period of, not just 144 hours (6 × 24), but over many millenniums of time. How Did Genesis Know? Many find it hard to accept this creation account. They contend that it is drawn from the creation myths of ancient peoples, primarily those from ancient Babylon. However, as one recent Bible dictionary noted: “No myth has yet been found which explicitly refers to the creation of the universe” and the myths “are marked by polytheism and the struggles of deities for supremacy in marked contrast to the Heb[rew] monotheism of [Genesis] 1-2.”3 Regarding Babylonian creation legends, the trustees of the British Museum stated: “The fundamental conceptions of the Babylonian and Hebrew accounts are essentially different.”4 From what we have considered, the Genesis creation account emerges as a scientifically sound document. It reveals the larger categories of plants and animals, with their many varieties, reproducing only “according to their kinds.” The fossil record provides confirmation of this. In fact, it indicates that each “kind” appeared suddenly, with no true transitional forms linking it with any previous “kind,” as required by the evolution theory. All the knowledge of the wise men of Egypt could not have furnished Moses, the writer of Genesis, any clue to the process of creation. The creation myths of ancient peoples bore no resemblance to what Moses wrote in Genesis. Where, then, did Moses learn all these things? Apparently from someone who was there. The science of mathematical probability offers striking proof that the Genesis creation account must have come from a source with knowledge of the events. The account lists 10 major stages in this order: (1) a beginning; (2) a primitive earth in darkness and enshrouded in heavy gases and water; (3) light; (4) an expanse or atmosphere; (5) large areas of dry land; (6) land plants; (7) sun, moon and stars discernible in the expanse, and seasons beginning; (8) sea monsters and flying creatures; (9) wild and tame beasts, mammals; (10) man. Science agrees that these stages occurred in this general order. What are the chances that the writer of Genesis just guessed this order? The same as if you picked at random the numbers 1 to 10 from a box, and drew them in consecutive order. The chances of doing this on your first try are 1 in 3,628,800! So, to say the writer just happened to list the foregoing events in the right order without getting the facts from somewhere is not realistic. ",
            "date": "Answered May 8, 2017",
            "views": "89",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Depew",
                    "user_href": "/profile/Karen-Depew-3"
                },
                {
                    "user_id": "Sue Adams",
                    "user_href": "/profile/Sue-Adams-65"
                },
                {
                    "user_id": "Rod Shearman",
                    "user_href": "/profile/Rod-Shearman"
                },
                {
                    "user_id": "Gunter Piontek",
                    "user_href": "/profile/Gunter-Piontek-1"
                },
                {
                    "user_id": "William Anderson",
                    "user_href": "/profile/William-Anderson-338"
                },
                {
                    "user_id": "Christine Hester",
                    "user_href": "/profile/Christine-Hester-8"
                },
                {
                    "user_id": "Alfredo De La Fe",
                    "user_href": "/profile/Alfredo-De-La-Fe"
                },
                {
                    "user_id": "Robert Gibbs",
                    "user_href": "/profile/Robert-Gibbs-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony - Antonakis Maritis",
                "href": "/profile/Tony-Antonakis-Maritis"
            },
            "answer_text": " “But, beloved, be not ignorant of this one thing, that one day is with the Lord as a thousand years, and a thousand years as one day.” 2 Peter 3:8 The context is the key to determining the correct understanding of this account, especially the comparison of a thousand years to one day. The context of 2 Peter 3 is the return of the Lord to deliver His people. Peter tells the persecuted believers that scoffers will come and mock the idea that the Lord will return. They will say something like, “He’s been gone a long time; He’s not ever coming back” (verse 4). As Christians are persecuted and continue to look for the Lord to deliver them, it appears as though His coming is “delayed.” Peter reminds the believers not to lose heart because God is working on a different timetable. For a human being, if something doesn’t happen within a matter of years, then we may miss it. God, however, is not limited by the same constraints of time because “that one day is with the Lord as a thousand years, and a thousand years as one day.”  Consider the patience of Noah in building the Ark, The Bible does not specifically say how long it took Noah to build the ark. When Noah is first mentioned in Genesis 5:32, he is 500 years old. When Noah enters the ark, he is 600 years old. The time it took to build the ark would depend on how much time passed between Genesis 6:14, when God commanded Noah to build the ark; and Genesis 7:1, when God commanded Noah to enter the ark. Some estimate that it took Noah 120 years to build the ark, based on Genesis 6:3. Other estimates 100 years, based on Noah’s age in Genesis 5:32 and his age in Genesis 7:6. Either way that's a long time to build a boat on dry land while being ridiculed.  Noah entered the ark in the 600th year of his life, on the 17th day of the 2nd month (Genesis 7:11-13). Noah left the ark on the 27th day of the 2nd month of the following year (Genesis 8:14-15). Therefore, assuming a lunar calendar of 360 days, Noah was on the ark for approximately 370 days. A long tome to be on a boat by mans standards. Time is simply not an issue with God because He has an unlimited amount of it. If the average person sees something in the store, it would make no difference whether it cost a penny or a dime, even though one is ten times more expensive than the other. If a billionaire wanted to buy a piece of property it might make no difference to him whether it cost $50,000 or $500,000 or even $5,000,000. This is the idea of the verse—both a day and a thousand years are such miniscule amounts of time to God that it really makes no difference to Him.  If a person promises to do something, there is a finite amount of time available for him to keep that promise. If an elderly father promises to buy his son a home, there is a limited amount of time available for him to keep the promise. As year after year passes and he does not buy the home, the son may begin to wonder if he ever will. Ultimately, if the father dies before keeping the promise and does not leave the son anything in his will, then the promise has expired. We must not look at the promises of God through the lens of human time. If God is working a plan that will take ten thousand years to unfold, it is no different to Him than if His plan took 10 days to unfold. The point of 2 Peter 3 is that, no matter how long it takes, God will keep His word—“The Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance.” (verse 9)—specifically, He will return one day to judge the world and reconcile His people. The fact that it has not happened yet is absolutely no indication that He will not do it.  As people with eternal life, Christians need to adopt an eternal perspective on time. We have all eternity before us to receive the promises of God. We need not fret if it looks like our lives may end before we get everything we have been promised. If the Lord does not come back for another 50,000 years, that is less than two months (sixty “days”), using a literal reckoning of verse 8. The main point is that given the amount of time available to Him, time is just not a concern. Some who hold to old earth creationism use 2 Peter 3:8 to bolster their view that the “days” of Genesis 1 were not literal days but long eons of time. If “a day is like a thousand years,” the reasoning goes, then the word day in the creation narrative cannot mean a literal, twenty-four-hour day. The problem is that God is not attempting to redefine our words in 2 Peter 3:8. Peter does not say that one day is a thousand years; he says that one day is like a thousand years. In other words, he is using figurative language to make his point. The point is not that we should interpret the word day as “a thousand years” everywhere we find it in Scripture; rather, the point is that the passing of time has no bearing on God’s faithfulness to His promises. He is “the same yesterday and today and forever” (Hebrews 13:8). Besides, the day-age theory requires much more than 6,000 years in the creation “week.”  Others also interpretations of 2 Peter 3:8 use a literal, mathematical equation. Some who hold to young earth creationism estimate that Earth has been around for 6,000 years or, according to the mathematical equation in 2 Peter 3:8, about six “days.” Seven is the number of perfection and completion, this view considers the whole of human history will last one week—that is, seven days (7,000 years). This view considers the millennial kingdom of 1,000 years as the seventh day of rest and that the seventh day is still to come and will be inaugurated by the Lord’s return. It presumes we have already been on Earth for 6 days, then the Lord must return soon. Some go further in their calculations and set specific dates—which is always an exercise in folly. “Watch therefore, for ye know neither the day nor the hour wherein the Son of man cometh.” Matthew 25:13  While the “seven-day theory” looks attractive given our particular point in history—about 6,000 years in, or somewhere near the end of the sixth day—it goes against the spirit of the verse. The whole point of the passage is that we cannot know when the Lord will return because He is operating on a different timetable. 2 Peter 3:8 does not give us a cryptic equation to enable us to figure out when He will return. If that were the case, it would seem that Peter would have been able to figure it out and could simply have told the persecuted believers that the Lord would return in about 2,000 years. He didn’t do that because he didn’t know when the Lord would return. And neither do we. We need to wait as patiently for the Lord as the persecuted believers of the first century did. (2 Peter 3:11–12). ",
            "date": "Answered January 15, 2019",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Anderson",
                    "user_href": "/profile/William-Anderson-338"
                },
                {
                    "user_id": "Rose May",
                    "user_href": "/profile/Rose-May-41"
                }
            ]
        }
    ]
}