{
    "title": "How to describe music to a deaf person - Quora",
    "tags": [
        "Deafhood (culture)",
        "Deafness (physiological condition)",
        "Disability and Disabilities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Feitan Portor",
                "href": "/profile/Feitan-Portor-8"
            },
            "answer_text": "The main thing about music is how it makes you feel, and the feeling is good. More than good, its euphoric. When it hits your senses, your body releases dopamine and you experience pleasure. The greatest, strangest phenomenon about music is that it makes you feel emotions. A song doesn't need sad lyrics to make you cry. I know deaf people get annoyed when hearing people express sympathy over not being able to hear music the same way. I apologize to deaf people. I hope you can understand where we come from, and I will try to explain from our point of view. Plenty of people expressed sympathy to me because I disliked cheese. My taste buds just naturally don’t like it, it wasn’t my own choice. I don’t care at all though, because I can enjoy other foods! so why do I need to like cheese? I suppose deaf people feel this way about music. The type of pleasure music brings to you is addictive like a drug. When there is a song you really love, you literally crave it, wanting to play on repeat. It’s a type of experience that makes you want to share with others. Music is one of life’s greatest pleasures to most people, which is why hearing people seem ignorant trying to shove their sympathy in deaf people’s faces. ",
            "date": "Answered March 5, 2020",
            "views": "455",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akane Chan",
                    "user_href": "/profile/Akane-Chan-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Portch",
                "href": "/profile/Gregg-Portch"
            },
            "answer_text": "Interaction and communication takes way more body language than just the words that are spoken. With music, especially live music, the body language and the passion that is conveyed tell a larger story than just the lyrics. I am Deaf, and I enjoy music very much. When my wife and I go to a bar to watch live music, I bring a red keg cup. Why? Because the sound vibrates through the cup and between my lip reading and the vibrations, I can figure out what song is playing. If it is a song I do not know, my wife will sign me the name of the song and I just go to Lyrics.com and pull them up. If it is an up-and-coming band, their website will most likely have the lyrics on them. So, in closing, you do not have to describe what music is, allow them to experience it! ",
            "date": "Answered March 24, 2018",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Feitan Portor",
                    "user_href": "/profile/Feitan-Portor-8"
                },
                {
                    "user_id": "Priyanka Tilwani",
                    "user_href": "/profile/Priyanka-Tilwani"
                },
                {
                    "user_id": "Quinton Cummings",
                    "user_href": "/profile/Quinton-Cummings-2"
                },
                {
                    "user_id": "Oliver Smith",
                    "user_href": "/profile/Oliver-Smith-409"
                },
                {
                    "user_id": "Jade Spide",
                    "user_href": "/profile/Jade-Spide"
                },
                {
                    "user_id": "Michael Mays",
                    "user_href": "/profile/Michael-Mays-2"
                },
                {
                    "user_id": "No Body",
                    "user_href": "/profile/No-Body-666"
                },
                {
                    "user_id": "Brendyn Elizabeth Beard",
                    "user_href": "/profile/Brendyn-Elizabeth-Beard"
                },
                {
                    "user_id": "Nanya Okolie",
                    "user_href": "/profile/Nanya-Okolie-1"
                },
                {
                    "user_id": "Pam Houdyshell",
                    "user_href": "/profile/Pam-Houdyshell"
                },
                {
                    "user_id": "Lotismo Salah",
                    "user_href": "/profile/Lotismo-Salah"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lee Sillyman",
                "href": "/profile/William-Lee-Sillyman-1"
            },
            "answer_text": "The greatest way to describe music to a deaf person is for them to feel it. I am hearing impaired (undiagnosed when I was a kid) yet I had difficulty understanding the phonetics of words. Much like how Beethoven wrote his music, I learned sound by vibration through the piano case. No one taught me this, I was something I discovered on my own. Beethoven would either lay his head on the top of the piano or use his feet to feel the vibrations. If you ever want to hear something amazing, go to YouTube and type in Beethoven’s Opera Fidelio OP 72. It is beautiful, and he never heard it. I memorized sound, and with my limited hearing, I can sense and feel the time and beat of the music, without ever looking at the sheet music. I can read music, but I am not a skilled pianist. You will know when a deaf person is getting it, by how they feel with the music. ",
            "date": "Answered September 9, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeanete Alves",
                    "user_href": "/profile/Jeanete-Alves"
                },
                {
                    "user_id": "Mary Abel",
                    "user_href": "/profile/Mary-Abel-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill McGrath",
                "href": "/profile/Bill-McGrath-26"
            },
            "answer_text": "If a deaf person truly does not understand what music is, I think I would take that deaf person to some place where music is played really loud, and people dance. Many deaf folk enjoy the vibrations that music makes and can pick up the beat from the vibrations. The louder the music, the stronger the vibrations. I believe a deaf person sensing those vibrations and then seeing people dance to match the rhythm of the music (vibrations) might understand a little of how we hear music. There was a movie called Mr. Holland’s Opus (1995) staring Richard Dreyfuss. He plays a frustrated composer who becomes a music teacher. He has a son that is deaf and there is a lot of interaction of his son Cole, enjoying the music through vibrations. It is really an excellent movie. ",
            "date": "Answered March 21, 2018",
            "views": "981",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brendyn Elizabeth Beard",
                    "user_href": "/profile/Brendyn-Elizabeth-Beard"
                },
                {
                    "user_id": "Alabi Samuel",
                    "user_href": "/profile/Alabi-Samuel"
                },
                {
                    "user_id": "João Vitor",
                    "user_href": "/profile/João-Vitor-43"
                }
            ]
        }
    ]
}