{
    "title": "How to feel about Eddie Van Halen's death today - Quora",
    "tags": [
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Guitarists",
        "Guitars",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Liermann",
                "href": "/profile/Tyler-Liermann"
            },
            "answer_text": "Definitely an energy shift. Eddie was not just a rocker but a true musical innovator. This guy lived his music, he even said very rarely if really ever listens to others music, just simply wasn’t interested. When driving he prefers the sound of the car engine instead of turning on the radio or pulling up a playlist. In his younger touring days when everyone would go out and party after shows, he would drink and work on his music alone. He never felt his rocking solos were genuine and loud enough unless the hair on his arm was would stand up at one point (his poor ear drums!) He loved his fans too, if he didn’t play his best he genuinely felt he was cheating them out of the money the paid for the ticket (you’d be surprised how some musicians take for granted their fans)… With that all said, he loss felt like a legit loss. My father has been a fan of his since his teen years. Had the original albums on cassette and on CD to where the CD case is showing its wear from over the years. Just a few months ago as a gift I rebought him the remastered CDs of his beloved albums before discs are discontinued! He saw them in the 80s in person, front row in the mosh pit…But when David Lee Roth rejoined in 2007, we went to see them in Jacksonville in February 2008 and it was amazing!!! Even more memorable was their last tour when they played in Birmingham, Alabama 5 years ago. My dad got this feeling that we really need to see them that this was going to be their last tour as a Van Halen group. By a lucky roll of the rice I was able to snag some amazing seats in the lower level just 2 days before the show. It’s one of my dad’s most memorable experiences. When I found out he died from scrolling through FB, I know my dad likely didn't know (he texts and enjoys Youtube vids but isn't super tech savvy and doesn't have any social media) and I had a heavy heart but felt a responsibility to tell him. Once I did, he responded (which sums how how me and many others feel): “I’m so glad we got to see it, ill never forget it, I didn't know him, but I feel like I lost a friend.” ",
            "date": "Answered October 10, 2020",
            "views": "100",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jodi Schuetzle",
                    "user_href": "/profile/Jodi-Schuetzle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Wilson",
                "href": "/profile/Tom-Wilson-376"
            },
            "answer_text": "It’s always saddening when such a enormous talent is lost. Van Halen definitely made a impact on the world of guitarists with his unique style and sound. He also made it okay for young guitarists to put together parts guitars and play them instead of feeling like they had work and save money to buy a Gibson Les Paul to sound like Jimmy Page or find a original preCBS Stratocaster to sound like SRV. He proved that you could put together pawnshop finds and sound great. Even those who play country or jazz or any style of music on guitar can appreciate his talent and innovation. It’s unfortunate we won’t be able to hear anything new from him again but he does live on through the music of his son and all those who have been influenced by him over the years. ",
            "date": "Answered October 6, 2020",
            "views": "96",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo Alchek",
                    "user_href": "/profile/Leo-Alchek-1"
                },
                {
                    "user_id": "Cole Ohanian",
                    "user_href": "/profile/Cole-Ohanian"
                },
                {
                    "user_id": "Cynthia Christie",
                    "user_href": "/profile/Cynthia-Christie-7"
                }
            ]
        }
    ]
}