{
    "title": "How many songs did The Beatles write? - Quora",
    "tags": [
        "Singer-Songwriters",
        "The Beatles (band)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Garrick Saito",
                "href": "/profile/Garrick-Saito"
            },
            "answer_text": "185, by my count. A Day in the Life, Lennon/McCartneyA Hard Day’s Night, LennonA World Without Love, Lennon/McCartneyAcross the Universe, LennonAll I’ve Got to Do, LennonAll My Loving, McCartneyAll Together Now, McCartneyAll You Need is Love, LennonAnd I Love Her, McCartneyAnd Your Bird Can Sing, LennonAnother Girl, McCartneyAny Time at All, LennonAsk Me Why, LennonBaby, You’re a Rich Man, 1967, Lennon/McCartneyBaby’s in Black, Lennon/McCartneyBack in the USSR, McCartneyBecause, LennonBeing For the Benefit of Mr. Kite, LennonBirthday, McCartneyBlackbird, McCartneyBlue Jay Way, HarrisonCan’t Buy Me Love, McCartneyCarry That Weight, McCartneyCome Together, LennonCry Baby Cry, LennonCry For A Shadow, Lennon/HarrisonDay Tripper, 1965 , LennonDear Prudence, LennonDig a Ponny, LennonDig It, LennonDo You Want to Know a Secret, LennonDoctor Robert, LennonDon’t Bother Me, HarrisonDon’t Let Me Down, 1969, LennonDrive My Car, McCartneyEight Days a Week, McCartneyEleanor Rigby, McCartneyEvery Little Thing, McCartneyEverybody´s Got Something to Hide Except Me and My Monkey, LennonFixing a Hole, McCartneyFlying, Harrison/Lennon/Harrison/StarrFor No One, McCartneyFor You Blue, HarrisonFrom Me to You, 1963, Lennon/McCartneyGet Back, McCartneyGetting Better, McCartneyGirl, LennonGlass Onion, LennonGolden Slumbers, McCartneyGood Day Sunshine , McCartneyGood Morning Good Morning, LennonGood Night, LennonGot to Get You Into My Life, McCartneyHappiness is a Warm Gun, LennonHello, Goodbye, 1967, McCartneyHelp!, LennonHelter Skelter, McCartneyHer Majesty, McCartneyHere Comes the Sun, HarrisonHere, There and Everywhere, McCartneyHey Bulldog, Lennon/McCartneyHey Jude, McCartneyHold Me Tight, McCartneyHoney Pie, McCartneyI Am the Walrus, LennonI Call Your Name, LennonI Don´t Want to Spoil the Party, LennonI Feel Fine, LennonI Me Mine, HarrisonI Need You, HarrisonI Saw Her Standing There, McCartneyI Should Have Known Better, LennonI Wanna Be Your Man, Lennon/McCartneyI Want to Hold Your Hand, Lennon/McCartneyI Want to Tell You, HarrisonI Want You (She´s So Heavy), LennonI Will, McCartneyI’ll Be Back, LennonI’ll Cry Instead, LennonI’ll Follow the Sun, McCartneyI’ll Get You, 1963, Lennon/McCartneyI’m a Loser, LennonI’m Down, 1965, McCartneyI’m Happy Just to Dance With You, LennonI’m Looking Through You, McCartneyI’m Only Sleeping, LennonI’m So Tired, LennonI’ve Got a Feeling, Lennon/McCartneyI’ve Just Seen a Face, McCartneyIf I fell, LennonIf I Need Someone , HarrisonIn My Life, Lennon/McCartneyIt Won’t Be Long, LennonIt’s All Too Much, HarrisonIt’s Only Love, LennonJulia, LennonLady Madonna, McCartneyLet It Be, McCartneyLittle Child, Lennon/McCartneyLong Long Long, HarrisonLove Me Do, McCartneyLove You to, HarrisonLovely Rita, McCartneyLucy in the Sky with Diamonds, LennonMagical Mystery Tour, McCartneyMartha My Dear, McCartneyMaxwell´s Silver Hammer, McCartneyMean Mr Mustard, LennonMichelle, McCartneyMisery, Lennon/McCartneyMother Nature´s Son, McCartneyNo Replay, LennonNorwegian Wood (This Bird Has Flown), LennonNot a Second Time, LennonNowhere Man, LennonOb-la-di, Ob-la-da, McCartneyOctopus’s Garden, StarrOh! Darling, McCartneyOld Brown Shoe, 1969, HarrisonOne After 909, LennonOnly a Nothern Song, HarrisonP.S. I Love You, McCartneyPaperback Writer, 1966, McCartneyPenny Lane, 1967, McCartneyPiggies, HarrisonPlease Please Me, LennonPolythene Pam, LennonRain, LennonRevolution 1, LennonRevolution 9, LennonRocky Raccoon, McCartneyRun for Your Life, LennonSavoy Truffle, HarrisonSexy Sadie, LennonSgt. Pepper’s Lonely Hearts Club Band, McCartneyShe Came in Through the Bathroom Window, McCartneyShe Loves You, Lennon/McCartneyShe Said She Said, LennonShe’s a Woman, McCartneyShe’s Leaving Home, McCartneySomething, HarrisonStrawberry Fields Forever, LennonSun King, LennonTaxman, HarrisonTell Me What You See, McCartneyTell Me Why , LennonThank You Girl, Lennon/McCartneyThe Ballad of John and Yoko, LennonThe Continuing Story of Bungalow Bill, LennonThe End, McCartneyThe Fool on the Hill, McCartneyThe Inner Light, HarrisonThe Long and Winding Road, McCartneyThe Night Before, McCartneyThe Word, Lennon/McCartneyThere’s a Place, LennonThings We Said Today, McCartneyThink for Yourself, HarrisonThis Boy, LennonTicket to Ride, LennonTomorrow Never Knows, LennonTwo of Us, McCartneyWait, Lennon/McCartneyWe Can Work It Out, Lennon/McCartneyWhat Goes On, Lennon/McCartneyWhat You’re Doing, McCartneyWhen I Get Home, LennonWhen I´m 64, McCartneyWhile My Guitar Gently Weeps, HarrisonWhy Don’t We Do It in the Road?, McCartneyWild Honey Pie, McCartneyWith a Little Help From My Friends, McCartneyWithin You Without You, HarrisonYellow Submarine, McCartneyYer Blues, LennonYes it is, LennonYesterday , McCartneyYou Can’t Do That, LennonYou Know My Name (Look up the Number), LennonYou Like Me Too Much, HarrisonYou Never Give Me Your Money, McCartneyYou Won’t See Me, McCartneyYou’re Going to Lose That Girl, LennonYou’ve Got to Hide Your Love Away, LennonYour Mother Should Know, McCartneyIf you find any errors or omissions, please leave a comment and I will update this list (or suggest an edit). Thanks. ",
            "date": "Updated August 21, 2017",
            "views": "133",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "THE BEAN MAN PIRATES",
                    "user_href": "/profile/THE-BEAN-MAN-PIRATES"
                },
                {
                    "user_id": "Stephen Round",
                    "user_href": "/profile/Stephen-Round-6"
                },
                {
                    "user_id": "Paul Jenner",
                    "user_href": "/profile/Paul-Jenner-2"
                },
                {
                    "user_id": "Denise Beckerle",
                    "user_href": "/profile/Denise-Beckerle"
                },
                {
                    "user_id": "Tom Hazelton",
                    "user_href": "/profile/Tom-Hazelton-5"
                },
                {
                    "user_id": "Siddesh Shinde",
                    "user_href": "/profile/Siddesh-Shinde-2"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                },
                {
                    "user_id": "Luca Dornelles",
                    "user_href": "/profile/Luca-Dornelles"
                },
                {
                    "user_id": "Prateek Thareja",
                    "user_href": "/profile/Prateek-Thareja-1"
                },
                {
                    "user_id": "Alessandro Salvatore",
                    "user_href": "/profile/Alessandro-Salvatore-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Moore",
                "href": "/profile/Barry-Moore-4"
            },
            "answer_text": "Wikipedia lists 237 songs written by The Beatles. But, I just read Mark Lewisohn’s “Complete Beatles” chronicle, and Allen J. Wiener’s “ultimate recording guide,” which lists virtually every song they ever did. Let me tell you that there are many songs that were never released! So, if you count them - how many would there be. There also TONS of solo songs by McCartney, Lennon, Harrison and even Ringo that were recorded but not released. There are FILMS that were shot and never released - all kinds of scripts that were ordered, written, and never saw the light of day. I think you will find most artists have works they don’t release because they don’t like them, never finished them, etc. So many unfinished little gems of history waiting to be discovered some day … ",
            "date": "Answered September 15, 2016",
            "views": "96",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Israel Sandoval",
                    "user_href": "/profile/Israel-Sandoval-12"
                },
                {
                    "user_id": "Connie Casella",
                    "user_href": "/profile/Connie-Casella"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Janis-J-2"
                },
                {
                    "user_id": "Annie Margaret",
                    "user_href": "/profile/Annie-Margaret"
                },
                {
                    "user_id": "Kevin Klein Cartagena",
                    "user_href": "/profile/Kevin-Klein-Cartagena"
                },
                {
                    "user_id": "Denis Evlard",
                    "user_href": "/profile/Denis-Evlard"
                }
            ]
        }
    ]
}