{
    "title": "How are professional music videos made? - Quora",
    "tags": [
        "Video Production",
        "Music Videos",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "James McInnes",
                "href": "/profile/James-McInnes-1"
            },
            "answer_text": "There's all sorts of types of videos: concert, dance, animated, story, etc. And a slew of different cameras and techniques that might be involved. In the general sense, the thing that makes music videos unique is the synchronization with the music. More often than not, the music track for the video is recorded in a music studio as it would be for a traditional track for an album (in fact, they will often use an album track). For concert videos, they'll sync footage with shots from various angles from the concert. For a dance video, they will record many takes of the choreographed dance scenes or the band lip-synching to the pre-recorded track and then dub the synced up pre-recorded track over the footage. For animated and story videos, they generate the animation and story timelines either specifically synced to the pre-recorded track, or completely independently. When it comes to editing the video, cuts generally occur at the down-beats to sync the visual presentation with the musical rhythm. Color grading and frequency of cuts are generally selected to match the pace and tone of the song. ",
            "date": "Answered August 28, 2014",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Musonye",
                    "user_href": "/profile/Bruce-Musonye"
                },
                {
                    "user_id": "Wade Williams",
                    "user_href": "/profile/Wade-Williams-41"
                },
                {
                    "user_id": "Thomas Shera",
                    "user_href": "/profile/Thomas-Shera"
                },
                {
                    "user_id": "Rashaud Hutson",
                    "user_href": "/profile/Rashaud-Hutson"
                },
                {
                    "user_id": "Gary Elmer",
                    "user_href": "/profile/Gary-Elmer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom D'Angelo",
                "href": "/profile/Tom-DAngelo-3"
            },
            "answer_text": "Historically the record label will hire a production company with an executive producer who has a track record producing music videos, maybe even for that label, in the past. The executive producer will put together the rest of the team, a production manager, director, director of photography and scenic designer, etc. Often there are meetings between artist’s management and the video production team regarding the creative vision for the project.  The artist will also have their input into the creative planning. Once a budget is approved by the label, the executive producer will then hire a studio or a location scout, wardrobe, hair/make-up, technical crew, craft services/catering, permits, etc. executing the budget and plan. The video is then edited and goes through an approval process before being delivered to the client.   There are other variations, typically where the artist may have more control and financial burden instead of the record label’s control and financial responsibility. ",
            "date": "Answered September 30, 2015",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "M. Tijany",
                    "user_href": "/profile/M-Tijany"
                },
                {
                    "user_id": "Tuan Ton",
                    "user_href": "/profile/Tuan-Ton-7"
                },
                {
                    "user_id": "Joe Jowers",
                    "user_href": "/profile/Joe-Jowers-2"
                },
                {
                    "user_id": "Thomas Shera",
                    "user_href": "/profile/Thomas-Shera"
                },
                {
                    "user_id": "Viet Duc Duong",
                    "user_href": "/profile/Viet-Duc-Duong"
                }
            ]
        },
        {
            "author_info": {
                "name": "DailyUrbano",
                "href": "/profile/DailyUrbano"
            },
            "answer_text": "We have to work hard to made a professional music videos. We should keep all these things in mind to made a professional music videos that I am sharing with you. Here is the tips to made a professional videos Introduction.Music Video History & Record Labels.Finding the Right Collaborators.Music Video Templates & Structures.Shooting Music Videos with Only Natural Light.A Day in the Life of a Full-Time Music Video Director.A Music Video Can Be Good, Fast, & Cheap.I also sharing with you hope you like it. We gives a platform to submit your music videos on Home - DailyUrbano ",
            "date": "Answered July 28, 2017",
            "views": "712",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Argha Biswas",
                    "user_href": "/profile/John-Argha-Biswas"
                }
            ]
        }
    ]
}