{
    "title": "How to make a custom mixtape for someone who doesn’t own a CD player - Quora",
    "tags": [
        "Mixtapes",
        "CD Players",
        "MP3 (audio encoding format)",
        "Compact Discs (CDs)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Si Sutton",
                "href": "/profile/Si-Sutton"
            },
            "answer_text": "Thanks for a2a. The term 'mixtape' was coined in the late 70's & was quite literally, a mix that was recorded on to a tape cassette. Over the years the technologies & thus formats, changed. The term became synonymous with the act of producing a mix for a specific need. Usually this was a gift to a romantic or potential romantic partner with idea being that the songs expressed the way the giver felt about the receiver. It was often also a promotional item, used as a way to promote a dj's skills/musical preferences. Not unlike using the term 'to hoover', meaning to vacuum, purely because Hoover was the most prominent manufacturer of vacuum cleaners back in the day. So, with that in mind, it makes little difference the terms or words used to describe it, you are putting together a musical mix for a specific reason, to a specific person. I have no info on how you intend to do this or whether any of the individual tracks will be mixed together, however, how you do so will ultimately determine what happens next. If you have at least some rudimentary dj skills, then in all likelihood you will record to a universal format, such as mp3. With the file appropriately labelled & safely stored on your pc or ext hdd, you can easily send it to the intended recipient for them to dl to their phone, tablet or whatever, such that they can play it as they do their other music.If this is somehow a challenge for them, then using the same file, you can upload it to a music hosting site such as youtube, sound cloud etc. Settings for these can be private &/or password protected & you can link it to any social media accts they may have. If you aren't able to actually mix or assemble the tracks together, then what you are talking about leans more towards a 'playlist'. I don't know very much about the various streaming sites as I don't use them. I would however expect that you can create a list of the songs you want to hear in the particular order you want to listen to them. Sav that list, then export & send to your intended recipient. Of course it would be sensible to confirm their preferred platform before wasting your time on a device they cant use or don't have a subscription for. In summary, there are a multitude of ways to achieve your desired result, which is the best option will depend on what both of you are comfortable with & capable of. If you would like very specific advice, then let me know, along with all the specific info I will need to direct you in the best way forward. Good luck! ",
            "date": "Answered December 14, 2018",
            "views": "365",
            "upvotes": " Answer requested by Lizz Dregne",
            "upvoters": [
                {
                    "user_id": "JG McLean",
                    "user_href": "/profile/JG-McLean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Farnsworth",
                "href": "/profile/Richard-Farnsworth"
            },
            "answer_text": "I have a friend who didn’t own a working CD player. I bought several cheap MP3 players and put a few hundred tracks in them. You can even give them the original CD’s. Makes a great gift, is as unique as you want it to be, and fulfills the mixtape ethic. Which is actually from the cassette tape era. ",
            "date": "Answered December 28, 2018",
            "views": "83",
            "upvotes": " View 1 Upvoter "
        }
    ]
}