{
    "title": "How to tell my mom that I can't help around the house - Quora",
    "tags": [
        "Mother-Child Relationship Advice",
        "Mother-Child Relationships",
        "Family Advice",
        "Grades (education)",
        "Mothers",
        "Family Relationships and Dynamics",
        "Parents",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Carleton",
                "href": "/profile/Angela-Carleton-5"
            },
            "answer_text": "How do I tell my mom that I can't help around the house? My grades will eventually drop if this keeps up. There is plenty of time to get early to take care of your room as well as help setting the table and others tasks you can help out. There is no excuse because even when I went to school I did my homework after I got back from my job at night at 9:30 pm. It wasn’t easy but I did. Also check with your mother or dad what you can do that would help out perhaps throw the garbage or set it by the curve which doesn’t take much time. Place dishes in the dish washer after all dishes have been removed from the dining room table. What you need to do is “compromise” so you can do your homework as soon as you get home. I had my children become disciplined to do their homework as soon as they got home like clockwork. It was a piece of cake. Plus they did their room which they took care of themselves and got themselves changed so they can play outside before dinnertime. Various chores can also be done on Fridays and weekends check with your parents on what is best for you both to do those chores. It you get up early you can at least make your bed and get ready for school too. ",
            "date": "Answered May 5, 2020",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Spurgin",
                    "user_href": "/profile/Sharon-Spurgin-1"
                },
                {
                    "user_id": "Natalia Smith",
                    "user_href": "/profile/Natalia-Smith-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sammi Acea",
                "href": "/profile/Sammi-Acea"
            },
            "answer_text": "It sounds like you are overwhelmed with school and you need your mother to understand what is going on . I suggest you show your mother your actual work load and help her to understand the seriousness of your education and set up a meeting with your teachers. Teachers are sometimes great at advocating for you if you are serious about your studies. ",
            "date": "Answered May 5, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ami Lovelace",
                    "user_href": "/profile/Ami-Lovelace"
                },
                {
                    "user_id": "Kinda Nawfal",
                    "user_href": "/profile/Kinda-Nawfal"
                }
            ]
        }
    ]
}