{
    "title": "How to download a song I found on Youtube - Quora",
    "tags": [
        "YouTube User FAQs",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bella Gorden",
                "href": "/profile/Bella-Gorden"
            },
            "answer_text": "There are a lot of YouTube music-ripping websites out there, but they’re not all trustworthy. Here I would recommend a YouTube Music Downloader developed by TunesKit to you. TunesKit Audio Capture could help you download music from YouTube and convert YouTube music to MP3 or other formats with four steps. This tool could get the job done well. Just perform the following steps: Open TunesKit Audio CaptureSet the output audio formatPlay a music track from SpotifyBegin to record music from YouTubeFinally, you will get YouTube music with the original audio quality and listen to YouTube music without the distraction of ads even though you don’t have an Internet connection. ",
            "date": "Answered March 26, 2020",
            "views": "18",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Siva Nanda",
                    "user_href": "/profile/Siva-Nanda-39"
                },
                {
                    "user_id": "Rima",
                    "user_href": "/profile/Rima-105"
                },
                {
                    "user_id": "Bhaskar Divyam Nautiyal",
                    "user_href": "/profile/Bhaskar-Divyam-Nautiyal"
                },
                {
                    "user_id": "Ricardo Lopes",
                    "user_href": "/profile/Ricardo-Lopes-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhil Pisharody",
                "href": "/profile/Akhil-Pisharody-2"
            },
            "answer_text": "1] Open the video on youtube. 2] replace the word “youtube” from the link of the video (“http://www.youtube.com/xxxxxxx”) to “youmagictube”. It opens up a website called Save-Video. 3] Click on “Proceed”. There might be a pop-up window. So, close it. 4] Click on “Listen”. 5] Click on “Click to Continue” and then “Click here to start”. 6] Select “Save File” and then download the song. ",
            "date": "Answered August 3, 2018",
            "views": "181",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Henderson",
                    "user_href": "/profile/Gary-Henderson-122"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Betty",
                "href": "/profile/William-Betty-1"
            },
            "answer_text": "You can use audio recorder to do that. Here I recommend RecMaster to you with high performance. Once the internet is connected and you can record anything on YouTube. No matter the MV or songs can all be saved in your perferred format and resolution. Try this tool to record any desired music from YouTube. ",
            "date": "Answered May 29, 2020",
            "views": "322",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prateek Batra",
                    "user_href": "/profile/Prateek-Batra-21"
                },
                {
                    "user_id": "Sneha Sri",
                    "user_href": "/profile/Sneha-Sri-4"
                },
                {
                    "user_id": "Xaharo Xahari",
                    "user_href": "/profile/Xaharo-Xahari"
                },
                {
                    "user_id": "Brett Miller",
                    "user_href": "/profile/Brett-Miller-18"
                },
                {
                    "user_id": "Nitin Singh",
                    "user_href": "/profile/Nitin-Singh-150"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avinash Jaiswal",
                "href": "/profile/Avinash-Jaiswal-52"
            },
            "answer_text": "You could copy and paste the YouTube link to the Download box on savefrom.net, or simply add ss before the YouTube link to see all available resolutions for a given video, from there you will get to see an option to download the video in Audio MP4 format. Do the same.  Or you could paste the YouTube video link to the Download box on keepvid.com and download the video in M4A format which will give you the required audio file.  Good Luck ! ",
            "date": "Answered May 30, 2017",
            "views": "47",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicolas Shen",
                    "user_href": "/profile/Nicolas-Shen-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Henderson",
                "href": "/profile/Gary-Henderson-122"
            },
            "answer_text": "Okay, I am going straight to the point and tell you that, it is possible to download youtube music to your hard disc, but not directly, you may take a little bit detours if you care about the safety of your PC. The most common solution - Use YouTube downloader to download YouTube videos and convert them to MP3 files is, how to say, risky due to the good downloaders are intermingled with the bad ones, which means they could carry spam or malware. The concern is also true of YouTube converters. So I am here to suggest you try a 3rd-party screen recorder - RecMaster to capture YouTube audios. With valid paid licenses, your benefits will be protected to the most degree. And beyond that, the screen recorder captures youtube videos effortlessly and you can choose the audio-only mode to capture YouTube music. ",
            "date": "Answered September 21, 2020",
            "views": "216",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill Watts",
                    "user_href": "/profile/Bill-Watts-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Richards",
                "href": "/profile/Bob-Richards-54"
            },
            "answer_text": "Just type that same question into Google, and you will find all the ways. Look on the right side of your screen. You will find your question has been asked again and again. More answers are there. I recommend VideoProc. Try the free trial. You can download any video one way or another. I even recorded an Amazon movie with it. It will rip DVD’s. You can do basic editing. You can download a music video and convert the audio to a wav (not MP3) file for best quality. ",
            "date": "Answered February 1, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shrey Dhingra",
                "href": "/profile/Shrey-Dhingra-9"
            },
            "answer_text": "Yes… but there’s the right way and the wrong way. The right way is uncommon, that is to get YouTube Red, which costs money monthly, and download videos like that. The way most people do it is by simply going on your computer, searching YouTube to MP3 in Google, and using a website to convert it into the content. MP3 works if you just want audio. If you want the video screen as well, you can search YouTube to MP4, which includes video. The sites are sketchy, so make sure your computer and browser are safe before proceeding. Hope this helps. ",
            "date": "Answered March 20, 2020",
            "views": "885",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Parth Nagpal",
                "href": "/profile/Parth-Nagpal-3"
            },
            "answer_text": "Usually, copyrighted videos (and/or audios from those videos) cannot be used for personal or commercial use. However, there are videos that are copyright free. Look for videos with Creative Commons License. You can even use those videos in your own videos and monetize them. You can download the audio of any video (whether copyright protected or not) anyway as no one gets to know that you have those files. But this is not legal. ",
            "date": "Answered December 22, 2016",
            "views": "84",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dhruv Parekh",
                    "user_href": "/profile/Dhruv-Parekh-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelsea Forrest",
                "href": "/profile/Kelsea-Forrest"
            },
            "answer_text": "Normally it's regulated by the channel owner. So if they allow to download youtube videos it is normally stated in the description to the video. Another way to check that is to write to them directly and ask a permission. In all other instances, consider the video copyrighted unless this content belongs to the public by law. Downloading content for commercial use is not allowed in almost all cases. But this if of course my humble and strictly private opinion. If you have doubts, ask the lawyer. ",
            "date": "Answered March 4, 2020",
            "views": "460",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Camarillo",
                "href": "/profile/Nick-Camarillo-3"
            },
            "answer_text": "You could use YouTube’s Premium feature, which allows you to download videos. But that wouldnt download the mp3 file. You can use any “YouTube to MP3” website. You import the link, and then you hit download. Pretty easy but I think it's illegal. You can search more about it. ",
            "date": "Answered March 21, 2020",
            "views": "381",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suraj Kumar",
                "href": "/profile/Suraj-Kumar-14482"
            },
            "answer_text": "Youtube45 ! When watching a youtube video, just add “45″ in the browser url after “youtube”  After hitting enter you will see this >>  Select the .m4a format as it is better than the mp3 format (m4a format was invented by Apple. Youtube also prefers .m4a over mp3) After clicking the download button, video will start playing in the browser Just “Cntrl + S” or Right click and “Save as” to save music to PC ! ",
            "date": "Answered June 14, 2020",
            "views": "305",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meet Kotak",
                "href": "/profile/Meet-Kotak-2"
            },
            "answer_text": "Just go to the link: http://www.youtube-mp3.org/    ​ and paste the URL of the song you want to download in the box below YouTube mp3 and click on convert video.  ​You will get a screen as shown above (ofcourse with the photo of the video which you want to convert).Then click on download. As simple as that.This site even works on mobile.Good luck. ",
            "date": "Answered December 21, 2014",
            "views": "7",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jyoti Sharma",
                    "user_href": "/profile/Jyoti-Sharma-1345"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sajjad Hossain",
                "href": "/profile/Sajjad-Hossain-7"
            },
            "answer_text": "Go to YouTube To MP3 Converter , YouTube Playlist to MP3 Converter, YouTube Video Downloader and paste youtube video link into the input box and press Download button.  After some moments you will get the download link of MP3 click Download Mp3 button.  Enjoy, and make sure a share from the right side of the page to support them. ",
            "date": "Answered November 29, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Android Gamers",
                    "user_href": "/profile/Android-Gamers"
                },
                {
                    "user_id": "Nitin Singh",
                    "user_href": "/profile/Nitin-Singh-150"
                },
                {
                    "user_id": "Bhavik Patel",
                    "user_href": "/profile/Bhavik-Patel-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaishav Pidadi",
                "href": "/profile/Shaishav-Pidadi"
            },
            "answer_text": "Yes , its possible and very easy as well . The process to download audio is same as downloading video !! You simply have to add “to” just after youtube . For Example : Real Link : http://www.youtube.com/videourl After Adding “to” : http://www.youtubeto.com/videourl ",
            "date": "Answered May 30, 2017",
            "views": "799",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anil Tandon",
                    "user_href": "/profile/Anil-Tandon-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gugan Subramaniam",
                "href": "/profile/Gugan-Subramaniam-1"
            },
            "answer_text": "It's simple,use snaptube app(this is not official in playstore) u have to download it from snaptube website.After download the app ,go to youtube app and select the required video and choose share option and it will show “download with snaptube” select it and it shows all the audio and video formats available. ",
            "date": "Answered February 24, 2020",
            "views": "459",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Catch-The-StartupBus"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Jue",
                "href": "/profile/David-Jue"
            },
            "answer_text": "The easiest way to download a Youtube song is to add ‘work’ in front of youtube in your URL. You will be directed to a download page where you can click Download Audio. A few seconds later and your song should be downloaded! An example of what I mean: https://www.workyoutube.com/watch?v=dQw4w9WgXcQ ",
            "date": "Answered August 1, 2019",
            "views": "390",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "You cannot download videos from YouTube unless the uploader has chosen a license that allows people to download it. If they have, there is a download button. If there is no button, YouTube does not permit downloads. Further, doing a download anyway would be illegal copyright infringement. ",
            "date": "Answered January 7, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Koraw Skatoula",
                    "user_href": "/profile/Koraw-Skatoula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valente Hernandez Perez",
                "href": "/profile/Valente-Hernandez-Perez"
            },
            "answer_text": "You can use an application called clipgrab, which you need to install in your computer. It is a open source application where you can choose whether you want to save the video or or the audio file, and you can choose from different formats. ",
            "date": "Answered March 12, 2020",
            "views": "210",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Freddy Low",
                "href": "/profile/Freddy-Low-2"
            },
            "answer_text": "No there is no trick that i know of to downloading music from youtube just straight forward download. Of course if the music you are wanting to get is copyrighted then you simply are not allowed to download it. but you can use this website to download to mp3 : YourConversionSite.com ",
            "date": "Answered March 6, 2020",
            "views": "263",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lakhwinder Singh",
                    "user_href": "/profile/Lakhwinder-Singh-562"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Gen",
                "href": "/profile/Laura-Gen"
            },
            "answer_text": "Yes, you can download music from YouTube with iMusic manager. It is the best music downloader and recorder. with the iMusic downloader, you can discover and download music over 3000+ websites.  You can directly download music on Youtube. It means you can directly download MP3 from YouTube, Spotify, Pandora, and other music websites.  you can enjoy music whenever you want. You can also use iMusic to burn music to CD. Try it out to download music on Windows 10, 8, 7, XP, Vista. ",
            "date": "Answered December 6, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stanley Lin",
                    "user_href": "/profile/Stanley-Lin-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Verma",
                "href": "/profile/Shubham-Verma-495"
            },
            "answer_text": "There is no standalone application for Windows and Mac OS available as of now but you can expect it to come later. However, you can still use this website - http://www.music.youtube.com for now. :) ",
            "date": "Answered March 23, 2019",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Herbert Lin",
                "href": "/profile/Herbert-Lin-1"
            },
            "answer_text": "It is illegal according to YouTube’s terms. You probably feel like it is not illegal because people are doing it, and Google isn’t acting on this issue. ",
            "date": "Answered February 28, 2017",
            "views": "424",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Haseena Syed Abuthahir",
                    "user_href": "/profile/Haseena-Syed-Abuthahir"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Cowan",
                "href": "/profile/James-Cowan-48"
            },
            "answer_text": "Yes you can.if you have a paid subscription you can download directly from YouTube. You can also download from YouTube from a computer. I don't have much info on that though so I will leave that answer for others. Now with my own personal Use I can honestly say that I have and still do download YouTube music videos for free using an Android phone. I have also downloaded music videos using a fire stick, a fire tv, as well as an Android tv box. All you would need is a third party app and sign into your YouTube account ",
            "date": "Answered March 21, 2020",
            "views": "620",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meet Majethia",
                "href": "/profile/Meet-Majethia"
            },
            "answer_text": "Well first you have to copy the url that is the link of the YouTube video you want to download. Then head to the following site and select the quality yoh want and hit enter. ytmp3.eu - YouTube to MP3 Converter & Downloader - 320kbps You can also change the start time and end time of the audio to be trimmed from the video. ",
            "date": "Answered July 29, 2019",
            "views": "305",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Henri Aubin",
                    "user_href": "/profile/Henri-Aubin"
                }
            ]
        },
        {
            "author_info": {
                "name": "José Amendoeira",
                "href": "/profile/José-Amendoeira"
            },
            "answer_text": "Got to Conversor Vídeo YouTube - Converter para MP4, MP3, AVI, paste the link to the video and hit start. On the next page, click Download, and you’re done. There are other similar services, but this is the one I usually use. ",
            "date": "Answered March 15, 2019",
            "views": "296",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lara Garg",
                    "user_href": "/profile/Lara-Garg-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Freddie Fernandez",
                "href": "/profile/Freddie-Fernandez-7"
            },
            "answer_text": "No there is no trick that i know of to downloading music from youtube just straight forward download. Of course if the music you are wanting to get is copyrighted then you simply are not allowed to download it. Pm me and i may help you get music from any sites with available mp3s. I am not allowed to circumvent protection from any site in public view. Hope this help. ",
            "date": "Answered September 4, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexavier Miller",
                "href": "/profile/Alexavier-Miller"
            },
            "answer_text": "You can use Any Video Converter Free. It can extract audio tracks, sound or background music from YouTube videos.  ",
            "date": "Answered July 1, 2020",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Travis",
                "href": "/profile/Jeff-Travis"
            },
            "answer_text": "Look at torch browser, exactly the same as google chrome.Got an inbuilt media grabber, play a few seconds of a youtube video then it`s just one click.Initially, you will have to go into the settings so that it downloads the video then extracts the audio ( in .aac format ) ",
            "date": "Answered October 28, 2018",
            "views": "126",
            "upvotes": " Answer requested by Jesus Rodriguez",
            "upvoters": [
                {
                    "user_id": "Henri Aubin",
                    "user_href": "/profile/Henri-Aubin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shiwani Sharma",
                "href": "/profile/Shiwani-Sharma-135"
            },
            "answer_text": "The best Song to Download on YouTube is Cover Songs by Sabrish Saba who Records Best Cover Songs. You can Watch their Songs on YouTube Channel named ‘SABRISH SABA Official’ Here’s the link to the Video:- SABRISH SABA| ATIF ASLAM| PEHLI NAZAR ME| ACOUSTIC VERSION | RAW | NEG | NORTHEASTGRAVITY  ",
            "date": "Answered November 28, 2019",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mtafiti JP Kahindo",
                "href": "/profile/Mtafiti-JP-Kahindo"
            },
            "answer_text": "It's very easy, I have created a video that will walk you through it. Try and comment on the video with any questions you have. ==> How to download music from Youtube 2017 ",
            "date": "Answered April 12, 2017",
            "views": "82",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Brent Austin",
                "href": "/profile/Brent-Austin-3"
            },
            "answer_text": "Type in the URL of video: GenYoutube - Download Youtube Videos ",
            "date": "Answered March 15, 2019",
            "views": "467",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Nikhil Dhand",
                "href": "/profile/Nikhil-Dhand"
            },
            "answer_text": "SEArch for the top ten songs In you browser based on your theme. As if you are into pop, then search top pop songs; and thereon similarly go to the Tubes and have your way with it. ",
            "date": "Answered December 11, 2016",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Holly Marsden",
                "href": "/profile/Holly-Marsden-3"
            },
            "answer_text": "Copy YouTube Link of the Video.Enter the Copied Link into the Input Field.Click the \"Convert To\" Button.Press Download and Get Your MP3!High-Quality vs. Low-Quality YouTube Views.",
            "date": "Answered November 27, 2018",
            "views": "934",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ali Raza Rajar",
                "href": "/profile/Ali-Raza-Rajar"
            },
            "answer_text": "It's so easy,just download snaptube app or vidmate from any browser(not from Google play store)and any video Frome YouTube,Dailymotion or any other website…. ",
            "date": "Answered August 4, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anja Krusell",
                "href": "/profile/Anja-Krusell"
            },
            "answer_text": "Youtube to mp3 player and then download, it goes into your desktop and you can open it on iTunes. ",
            "date": "Answered March 13, 2020",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Iain Evans",
                "href": "/profile/Iain-Evans-7"
            },
            "answer_text": "They get taken down all the time so the best thing to do is Google YouTube to MP3 and YouTube to mp4 for videos ",
            "date": "Answered October 28, 2018",
            "views": "42",
            "upvotes": " Answer requested by Jesus Rodriguez"
        },
        {
            "author_info": {
                "name": "Geoff Field",
                "href": "/profile/Geoff-Field-2"
            },
            "answer_text": "Yes, you can, but you need to install an app to do so. Some will allow you to download in multiple formats Just google “youtube mp3 downloader app” or similar (depending on the format you want it in). ",
            "date": "Answered March 30, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Huseyin Aksu",
                "href": "/profile/Huseyin-Aksu"
            },
            "answer_text": "It is illegal unless the music is royalty free/the owner is giving you permission to do so. ",
            "date": "Answered May 17, 2017",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "U Know Tech",
                "href": "/profile/U-Know-Tech"
            },
            "answer_text": "Watch 1st trick of video and click on mp3  ",
            "date": "Answered May 23, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gopi Krishnan V Nair",
                "href": "/profile/Gopi-Krishnan-V-Nair"
            },
            "answer_text": "https://www.onlinevideoconverter.com/mp3-converter ",
            "date": "Answered December 13, 2018",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohtasim Hossain Refat",
                "href": "/profile/Mohtasim-Hossain-Refat"
            },
            "answer_text": "Use snaptube app to download and convert to any format ",
            "date": "Answered August 3, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aura Marx",
                "href": "/profile/Aura-Marx"
            },
            "answer_text": "No. The music is still copyrighted to the artist and therefore it’s theft of intellectual property. ",
            "date": "Answered January 15, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hyder Ali",
                "href": "/profile/Hyder-Ali-127"
            },
            "answer_text": "Newly released from kaabil hoon of hrithik nice from 123moviesonline .in ",
            "date": "Answered December 11, 2016",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fas Vlogs",
                "href": "/profile/Fas-Vlogs"
            },
            "answer_text": "you must have an extension for it ",
            "date": "Answered June 7, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishi Sanjay Jaiswal",
                "href": "/profile/Rishi-Sanjay-Jaiswal"
            },
            "answer_text": "$SORRY$…Justin Biber at it’s BEST!!! ",
            "date": "Answered December 12, 2016",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Greg",
                "href": "/profile/Mark-Greg-15"
            },
            "answer_text": "No ",
            "date": "Answered March 25, 2020",
            "views": "262",
            "upvotes": "0"
        }
    ]
}