{
    "title": "How and why do all ancient cultures have very similar musical instruments, even though they were oceans apart? - Quora",
    "tags": [
        "Ancient Cultures",
        "Culture (social science)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maryanne Slater",
                "href": "/profile/Maryanne-Slater"
            },
            "answer_text": "The concept of making music was probably already with our ancestors when they parted ways tens of thousands of years ago. Percussion instruments like drums and jangly shells would have been the easy things even pre-homo sapiens. I do wonder how they came up with whistles. Was it kids making funny noises with reeds, or someone who sucked the marrow out of a bone really hard and made a tweety sound? Anyway, I’d say the rest of it is a case of “great minds think alike.” ",
            "date": "Answered July 4, 2017",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Craig",
                "href": "/profile/Michael-Craig-6"
            },
            "answer_text": "I’m assuming we’re discussing musical instruments here, as opposed to surgical or financial instruments. The easiest way to make music is to sing, but if you can’t or won’t sing, there are a limited number of ways to accompany a singer (or dancer). Bashing things together, blowing through things, and plucking or bowing strings. So you pick up whatever is available and try bashing, blowing or plucking it and then modify it to suit whatever cultural ideas you have of what ‘sounds right’. ",
            "date": "Answered July 4, 2017",
            "views": "137",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Dara",
                    "user_href": "/profile/Aryan-Dara-2"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Maryanne Slater",
                    "user_href": "/profile/Maryanne-Slater"
                }
            ]
        },
        {
            "author_info": {
                "name": "Baladhamodaran Balajaganathan",
                "href": "/profile/Baladhamodaran-Balajaganathan"
            },
            "answer_text": "Because necessity is the mother of invention. So even if they were completely different cultures, their basic needs as humans were same and so they have similar instruments. Also many cultures, civilisations and religions were a revision upon the previous ones. So they have very similar instruments. ",
            "date": "Answered July 4, 2017",
            "views": "154",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maryanne Slater",
                    "user_href": "/profile/Maryanne-Slater"
                },
                {
                    "user_id": "Atanas Arnaudov",
                    "user_href": "/profile/Atanas-Arnaudov"
                },
                {
                    "user_id": "Paul Bejdyk",
                    "user_href": "/profile/Paul-Bejdyk"
                }
            ]
        }
    ]
}