{
    "title": "How would you rank each part of JoJo’s Bizarre Adventure, from least favorite to favorite, and why? - Quora",
    "tags": [
        "Favorites and Favorite",
        "JoJo's Bizarre Adventure",
        "Least Favorite",
        "Personal Favorites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Battler Ushiromiya",
                "href": "/profile/Battler-Ushiromiya-2"
            },
            "answer_text": "I’ll rank every part accordingly to the main Jojo, JoBro (supporting cast), villain and the plot. WARNING: HEAVY SPOILERS AHEAD. 8. Phantom Blood Jonathan Joestar is a great Jojo despite what others might say. He is selfless, brave and just. He is arguably one of the Jojos that experience the most unfortunate turn of events in his lifetime. He sets the standard for what is just and conveys the utmost importance of the gentlemanly nature. He is such a resilient main character and is the purest of all Jojos. Although I prefer many other Jojos over Johnathan, Johnathan is the role model of justice and decency for all Jojos in the mainline universe. As for his supporting cast, Will H. Zeppeli is a great mentor and teacher of Hamon and Speedwagon is loyal and great. Will H. Zeppeli’s bond with Johnathan was great and I think this is a great example of building great combinations in a short amount of time, as Will H. Zeppeli died quite early into the part. Although they had a teacher and student dynamic, it was mentioned that Zeppeli also considered him like a son which was very touching. Dio Brando is a good villain with arguably understandable motives and reasons for his attitude being the loss of his mother and a terrible upbringing from his father Dario Brando. Many of his character traits are shown here, being shamelessness, yet also having pride and the will to be on top. The combination between Johnathan and Dio here is so well developed, as Dio only recognizes Johnathan as a true contender and he respects him throughout the rest of Jojo’s Bizarre Adventure. To be very honest, I enjoyed the plot from the start between the buildup of the feud of Dio and Johnathan. However, I do think the pacing is a bit slow and nothing big happens until Johnathan enters Ogre Street. The ending, however, was definitely sad and melancholic, starting the concept of the ‘Joestar curse’. Since this is quite early into the series, fights weren’t as creative or psychological, only focusing on ‘punching harder’ or new Hamon techniques. Many times they would introduce new types of Hamon techniques such as “Turquoise Blue Overdrive” or “Metal Silver Overdrive”. Overall, a solid part but there are so many other fleshed out and better parts in my opinion. Fights are really weak in this part, introducing many different types of Hamon techniques that I couldn’t really care for (Thunder Cross Split Attack is a great example of this). However, I thoroughly enjoyed Part 1 and believe this is a part that should not be even considered to be skipped when recommending to newcomers. 7. Stardust Crusaders Jotaro Kujo is an interesting Jojo. He has an angry surface, but is considerate and definitely carries ‘Joestar’ character traits. He is a stoic bad-ass in this part. His stand Star Platinum is quite overpowered but is certainly awesome. I feel like he learns to care for his team as he journeys further in Part 3 during Egypt, connecting with the Crusaders a lot more towards the end. The loss of his comrades is a great influence on his character and his rage is let out in DIO’s fight. To be honest I think Jotaro is better in Parts 4 and 6 as he gets increasingly calculating, experienced and mature as a character. The Stardust Crusaders are great in general. Kakyoin is a great JoBro, portraying justice and selflessness towards the end (finding out The World’s ability). He is also incredibly analytical and intellectual, playing a large role in saving the crusaders a number of times (Death 13 and discovering the secret of The World are some notable examples). I wished they explored Kakyoin’s backstory a bit further though. Joseph Joestar is also great having so much battle experience and knowledge but also not having the archetype of the ‘retired veteran’. Polnareff is arguably one of the most developed characters of this part and undergoes such a mental journey, from vengeance to determination to defeat DIO. His fight against Vanilla Ice was one of his pillar moments. Avdol is overall a great stand fighter and an essential asset to the team, portraying selflessness (saving Polnareff). Iggy although I disliked at the start, my opinion changed quite quickly when he fought to save Polnareff, displaying pride and also selflessness. DIO is left in the dark for a majority of the part, probably done to buildup the tension of The World’s unknown ability. For this reason, we do not see much of DIO in this part. However, he is characterized more like a god. He is idolized due to his charisma and his collected nature. His influence from Part 3 and onward is substantial to the Jojo legacy as seen in Pucci. DIO at the end fight showed many of his older traits being the same shamelessness and insanity in Part 1. Overall, the plot was quite slow-paced (in my opinion) and especially some stand fights were quite weird (e.g. The Sun). I feel like Araki was simply testing the waters in terms of stand abilities. However, there were some humorous fights such as Oingo and Boingo and especially the D’arby fight, that portrayed excellent psychological stand battles rather than physical. Also, the fight between Iggy and Pet Shop is definitely a great battle and was one of the moments that really made Iggy shine. The end fight was a great end to Part 3, showing an epic physical stand fight between two similar stands. It is an iconic moment in the Jojo series and it definitely lived up to the hype. However, Part 3 definitely scores lower on my list as most of the minor villains, in my opinion, isn’t as good as the other subsequent parts and their fights felt subpar. To sum up, the part that kickstarted stands but I feel like Araki hadn’t become creative with stand abilities yet and his whole set up of the concept of the weekly stands was quite weak here. I feel like many of the minor villains were straight-up dislikeable or did not have much of a story with the exception of few. Personally, because of the surrounding hype for the last battle, I had moments of being tired from stand fights prior to DIO’s battle and had the urge to skip right to DIO’s fight. However, there were memorable moments such as the fight between Jotaro and DIO, D’arby poker fight and the climactic segment of the Egypt arc (a huge amount of the stardust crusaders die around this segment). 6. Stone Ocean Jolyne Kujo. She is a great Jojo and is arguably one of the best Jojos. Even though people consider her introduction a bit shocking, I thought it was absolutely hilarious and I just love the honesty of Jolyne. She is independent, intelligent and also incredibly considerate for her comrades. Her backstory is quite messed up, being framed for manslaughter. Her stand Stone Free has the string ability that allows for great stand battles, despite not being an incredibly powerful stand. We see many creative uses such as the stitching herself up, bullet catching, walking on water and the Möbius strip. The supporting cast of Weather Report, Ermes, Foo Fighters, Emporio and Anasui are great. Weather Report’s backstory is so in-depth and is a twisting and sad story. His character is great overall, being a quiet but calculating character. His stand Weather Report is an interesting stand and makes for interesting stand battles. Ermes was quite an underutilized character disappearing for a good chunk of Part 6. Despite this, I love her combination with Jolyne. She is a character torn by revenge but learns goodness from Jolyne. Her stand Kiss is very underused and I believe its full capabilities weren’t shown. Foo Fighters was great. Although she (or it) was a plankton, Foo Fighters learned positive human attributes. We really see FF at her peak when fighting Pucci. Her combination with the group was very entertaining. As for the villain, Enrico Pucci is a good villain that carries over the legacy of DIO. I feel that DIO’s influence is quite clear in Part 6. Pucci is a big threat in this part and his power is escalated like crazy here. I honestly really liked his stand White Snake, having the ability to steal stand discs. But its ability to create illusions was quite confusing honestly. C-Moon is a perfectly fine stand and I thoroughly enjoyed the arc. However, his final stand Made In Heaven definitely heightened the threat in Part 6 and made for a deadly ending. Although Pucci is essentially following DIO’s goal of achieving heaven, moments in his backstory really push him to idolize DIO and to make DIO’s goals his own. I really enjoyed Pucci’s entanglement with Weather Report and the tragedy of losing his sister. The plot FELT SUPER SLOW at certain points especially fights like Dragon’s Dream, explaining the concept of a really hard-to-understand stand. Yo-Yo Ma was also a really strange stand and man did I just want to punch the shit out of this stand. Bohemian Rhapsody was also a really strange read for me. The prison setting was good in my opinion (a little restricting at points) and the concept for a female lead was great. I enjoyed some sideline stories but I prominently enjoyed the main storyline with Pucci, Heavy Weather, and Jotaro. The ending though is quite debatable. It was extremely abrupt and although I know it’s not great, it certainly is a bizarre way to end the initial universe and lead on to another. The inclusion of Jotaro was also great and his role in this part was quite big despite being absent for a huge portion of the story. I feel like I would have really enjoyed this part if it weren’t for some really strange and complicated stands that really stretched the pacing of this part. Yet, I really love all the main and supporting cast. The supporting cast is great but Ermes is barely shown and her ability is given hardly any time to shine. Pucci is a good villain but without his own goals and motivations. 5. Battle Tendency Joseph Joestar is a refreshing transition from Johnathan Joestar. He is witty, charming and carries many of Johnathan’s traits of selflessness and courage. His comedic character is overall a fresh change from Johnathan and he is definitely a distinguished Jojo from the part. Joseph implemented many new Hamon techniques such as Clacker Volley, ropes, oil, etc, which was great to see transitioning from simple punches. Caesar Zeppeli is a great combination with Joseph in my opinion and we really see their friendship grow within their adventure. His Hamon bubbles was also an awesome ability at the time. Although his arrogant nature is not well-liked, I think most of it is justified with his harsh upbringing and seeing his father die to the Pillar Men, which shapes his reckless mindset. For the villains, Kars was personally not one of my favorite villains. Kars’ drive in this part is to achieve world domination through obtaining the Red Stone of Aja and to conquer the sun. His most defining trait is his sheer determination to achieve his goal, therefore discarding all sense of honor and fair-play. To be honest for this reason, Kars is ranked pretty low when it comes to Jojo villains, as I feel compared to other villains he isn’t as nuanced. I personally enjoyed Wamuu a lot more, seeing the importance of honor and fairness. He is definitely the most ‘good’ out of all Pillar Men and the battle between Jojo and Wamuu was a fight I really enjoyed. The plot was well-paced and certainly encapsulated the feeling of the “bizarre adventure” aspect. Battles were no longer just punches but more strategy and mind-games which I thought was refreshing and left me on edge at points. It was really cool to see Joseph develop his Hamon, initially being quite weak but grow stronger and implement newer techniques throughout the part. This was definitely the part that executed the power of Hamon way better in comparison to Part 1. But for better, it was also the last part we see Hamon being used as the central power in Jojo. Overall, a great pick-up from Part 1. Popular opinion is that Part 2 really kicks off the Jojo series and eases in newer Jojo fans. It is a fantastic read/watch, having relatively good pacing, buildup, and good fights. 4. Vento Aureo Giorno Giovanna. At first, I did not like his character, being silent and supposedly one-dimensional. But over my second read of Part 5, his character speaks louder in his actions I believe. He is brave, calculating, creative, extremely polite and carries Joestar characteristics which are important since he is the offspring of DIO. His stand Gold Experience is great, bringing in uses for many creative purposes with the life-creating ability. But, some of his skills aren’t used again (like where his punches gave more life in enemies) which is weird. However, he is certainly one of the most determined Jojos and my presumptions about his character are now gone. The main sub-gang of Passione (Bruno’s team). I love the gang. I’ll talk about the gang as a whole here. The chemistry and combination are so well thought out by Araki and everyone has their own quirks. They are all good stand-fighters and work cooperatively to defeat their enemies. Fugo is kind of discarded later into Part 5 though. Personally, even though the spin-off ‘Purple Haze feedback’ and the anime explore his backstory, I would have loved to see Fugo become more involved in the manga. Arguably, their combination is very deadly and I love each and every character. Specifically, my favorites are Mista and Bruno. Bruno is such an amazing character with great leadership, courage, and even kindness. Popular opinion is that Bruno really stole the show in Part 5. He is a cunning stand-fighter and there is a reason why he is well-liked by Passione. His stand Sticky Fingers is so cool, bringing in creative tactics and cool manga panels. Mista is a great character that is so humorous but not restricted to a ‘comedy-relief’ archetype. He is also very determined and I love his stand Sex Pistols and their own little character traits. Diavolo is a big enigma throughout the entire part which is done on purpose. He has a dual personality of Doppio which makes for funny sequences and also tense moments. The duality of Diavolo is dark and twisted, which is also another fresh concept. The buildup to Diavolo’s big reveal in the Colosseum is awesome and super tense. His stand King Crimson despite the confusion around it is a concept I love. The ability to remove time and also Forecast 10 seconds into the future is a cool concept that really messes with your head sometimes. The plot was possibly one of the fastest-paced in my opinion. There is a lot of action-packed scenes and arguably I think Part 5 has the best action. The mafia concept is also such a cool and fresh idea, straying quite far from the previous concepts I had seen. The buildup of the mafia boss, Trish and Gold Experience Requiem was great. Despite the argument that Gold Experience Requiem is the biggest asspull, the concept of requiems was established in Part 4 so I disagree. Also, I love Araki’s transition from the pure masculine art style to a more defining and feminine art style. Overall, the gang is excellent and the villain is a cool one. This is by far a very action-packed part of Jojo which has all my favorite attack rushes. 3. Diamond is Unbreakable Josuke Higashikata is such a likable character. At first, I did not personally like the overused “What did you say about my hair?” joke, but overlooking that, Josuke is a dude that looks over his mates. He is a carefree character, but also serious when he needs to be. Although he is not always the main focus in the part, he is a great Jojo and is one of the kindest Jojos I have seen. His stand Crazy Diamond is quite strong, but I love how rather than elevating its power throughout the part like acts or the stand arrow, Josuke becomes more creative with Crazy Diamond through mentorship and experience, allowing Josuke to beat his opponents through wit. A good example of this is Josuke vs Kira. The crew of Morioh (or duwang gang). I really like the Morioh warriors and the number of different quirks and characteristics each possess. Koichi is an extremely kind character but undergoes the most development in this part. His stand Echoes develops quite substantially and I love how Act 3 is an amalgamation of his inner anger. Okuyasu despite his stupidity is also great, eventually learning the path of independence from his brother and his combination with Josuke is hilarious and entertaining to read (or watch depending on anime watchers). His stand the Hand has an insanely powerful concept but is limited by his intellect, which is a shame because we basically see only a fraction of its potential. Rohan Kishibe. He is eccentric, knowledgeable, overbearing but charming. His character is excellent and I love his constant curiosity and need to expand on experiences. His stand Heaven’s Door is a nice but extremely powerful concept. I really need to read his spin-offs to reflect his character in greater depth, Kira Yoshikage. He is such a well-sculpted villain and is arguably my personal favorite villain of Jojo. His will to live a quiet, normal life but fulfill his desires is creepy but also a very fresh perspective. It really strayed far from drives such as world domination and brought down the scale, but I believe it was an excellent change of pace and a lot cooler. His stand Killer Queen possesses great abilities to create bombs, bring out Sheer Heart Attack and later his conjunction with Stray Cat made for a new villainous stand. His character was well fleshed out, exploring motives and very often telling parts of the story from his perspective. He is definitely a very likable villain in the sense that he is very nuanced. The overall pacing of the part was to some quite slow. There are definitely a lot of ‘slice-of-life’ aspects of this part and I really like the comfort of this. Earlier in the part, the arrival of Joseph Joestar and the stand arrows are an important plot point. There are certainly some characters that weren’t that interesting such as Terunosuke Miyamoto (stand owner for Engima). The overall mystery aspect of Kira Yoshikage was great and the overall search for Kira after his identity change was tense, but I felt like the pace kind of dropped again. Standout moments in this part was the Highway Star arc and the last fight between Kira and Josuke, really portraying a creative way to use Crazy Diamond. Overall, a fantastic read/watch and hopefully enjoyed by many. It has a likable cast of characters with great companions and also a really good villain. Here and there some people might wonder where the plot might be headed but it is a very worthwhile part in my opinion. 2. Jojolion Josuke Higashikata (aka Gappy). He is personally my favorite Jojo, being the most contemporary and (subjectively) well-developed Jojo. His loss of memory really allows us to see him interact with the world, people and his motivations. I really believe we see a huge development, from a lost man to a determined man eager to save his mother Holly from an incurable disease (unless through equivalent exchange). He is selfless, but also determined to find out about his identity and place in the world, His stand Soft & Wet is a cool stand, having the ability of ‘plundering’. Although it is super strong, there are a lot of innovative fights with this stand. I love how he is a combination of Josefumi Kujo and Kira Yoshikage (Part 8 ver.), sculpting detailed personality traits like kindness but also incredible wit. Seeing Josuke’s determination to save Holly was truly inspirational. Yasuho Hirose. I love Yasuho Hirose. She is an excellent duo to Josuke and is a very well-involved character throughout Part 8. She also suffers similarly to Josuke (not through memory-loss) but more like trying to find where she belongs and her place in this world. Her backstory is very in-depth, suffering from a divorced family and very disconnected with her mother, resulting in her confiding with Josuke. Her stand Paisley Park is so cool, not being a strong stand in any regard but more support, utility stand. The concept design is creative with the idea of maps and she even states her specialty was with reading maps. Her character is great and her combination with Josuke just works so well. Also the fruit appraiser, Rai Mamezuku is bloody awesome. He is calm and calculative in fights even in the brink of death. Although he is a bit cold, I think he is a cool character that also possesses a cool stand ‘Doggy Style’ (Snoop Dogg reference yes), which is identical to Stone Free in a sense. Also, I would like to mention Norisuke Higashikata, being a great character overall. He is so modern, funny but determined to protect his family. He is a great father and his sense of duty in the Higashikata family is admirable. His stand King Nothing is also quite cool, being able to see smells and recreate objects with its jigsaw puzzle physique. Jobin Higashikata. He is a very mysterious villain for the most part but holds a very eccentric and interesting personality. His backstory of being bullied and killing the bully is a huge influence on his current personality, being ruthless and assertive. Jobin has the need to escalate in society, to achieve happiness. Tsurugi and Jobin hold very similar characteristics as the part progresses. Although I feel like since Part 8 is still ongoing, his full character has not been portrayed yet. His stand Speed King is very interesting, with the ability to ‘heat up’. Although its full potential has not been shown yet, I anticipate creative uses in future chapters. I do like how this stand ability is not one that holds immense power, but with creative uses, can be extremely powerful. Overall, the plot is my personal favorite, initially being the discovery of identity and now the involvement of the Stone People and retrieving the Rokkaka fruit to save Holly Joestar Kira. I love how Josuke discovers more of his identity through stand battles and I love the interaction with the Higashikata family, each having their own moments. (Yes even Joshu with the Milagro Man arc). I believe this is my most comfortable and most entertaining read in Jojo yet, filled with humor, mystery, and depth in capturing the life of the characters. Certain side-plots such as Shakedown Road was such an entertaining read and I found myself enjoying many mini-arcs that aren’t super important to the main plotline. And c’mon Araki managed to make a stag beetle fight super tense. The concept of ‘stone people’ is so strange but I love it. However, I am sometimes a bit confused as to the extent of what the Stone People can do. Currently, I do wonder about the direction of the plot. Overall, this is subjectively my favorite part, containing my favorite Jojo and an excellent companion. Although sometimes the part can be very confusing in its direction it always leaves me eager to read the next chapter. Its mystery aspect is fantastic and I really hope Part 8 continues to pump out quality content like this! 1. Steel Ball Run Johnny Joestar. He is a revamped version of Johnathan Joestar in an alternate universe. Johnny Joestar I believe is such an excellently written Jojo. He is a Jojo that is flawed, one who “hungers” and is very ambitious. His whole backstory is very deep and we get a real sense of where his motivations and characteristics stem from. We see flashbacks of his jockeying, cause of cripple, loss of his brother and the complications with his family. His ambition to gather the corpse parts and his strong friendship with Gyro is excellent. Johnny Joestar is by far one of the most diligent, determined and developed Jojos of the series. His stand Tusk is a symbolism of Johnny’s development throughout the part, learning cool abilities such as the spatial wormhole, black-hole creation and the achievement of the infinite-spin. I personally like how it wasn’t a punching ghost stand this time around (excluding Act 4 obviously). Gyro Zeppeli. He is such a good companion. He is humorous, quirky and charming. But most importantly, he holds such a strong sense of justice for the young boy who was about to be executed. He attends the SBR race just so the king could give amnesty in hope that the child’s execution would be lifted. His battle of sentimentality was interesting to see and his stray from Zeppeli tradition. Gyro’s combination with Johnny make for great bros and is arguably one of the best duos in all of Jojo history. They were determined but also really good friends cracking up jokes, songs, and fetishes (bug bite fetish). I personally love Gyro’s ability of ‘spin’, through his steel balls. Gyro is a great mentor to Johnny, mentally motivating Johnny and teaching him how to achieve the golden rectangle through the spin. Definitely a nod to the master and student dynamic in Phantom Blood. Except I really like the way they executed it here and his death was a real pull on the heartstrings. Funny Valentine. Funny Valentine I believe is Jojo’s best villain with arguably better motivations than the main cast. Funny Valentine carries intense patriotism and pride for his country. He is a ruthless, but convicted man that acts accordingly for the greater good of his people and portrays characteristics of leadership and an equal amount of determination to the duo. He is an outstanding villain and is a great threat to the duo. I also love his childhood backstory, where we initially see one of the crucial moments that develop his patriotic nature. His stand D4C (Dirty Deeds Done Dirt Cheap) is a bloody cool stand with the ability to shift and bring things from other dimensions. I will also talk a little bit about Diego Brando. Personally, in some aspects, I prefer Diego Brando over Dio in the original universe. This is because Diego Brando to me had a more reasonable motivation for climbing on top of society, which is revealed in his backstory suffering from being stuck in the lower class of his hierarchy. I also love his stand Scary Monsters. The decision to move to an alternate universe really allows for a fresh start and new stand abilities. Standout moments such as The True Man’s World was a great mini-villain fight. The idea of a horse race as well is great and the idea of the weekly stands really works in its favor in this part. The development we see between Gyro and Johnny is great. We see trust and true friendship being built in this part. Gyro’s death was built up so well and was also really depressing. It is also a great moment where we see Tusk Act 4 against D4C Love Train, two extremely powerful stands. We also see ‘The World’ make another appearance. Overall, the collection of the corpse parts is quite lengthy (Part 7 is really long btw), but is by far one of Jojo’s most bizarre main plot point. Overall, a staple of the series and is honestly not a surprise to see this in many people’s number one spot. Great Jojo that is morally flawed and an amazing companion Gyro Zeppeli, make for a tense and bizarre adventure. Funny Valentine should also be appreciated for his great sense of duty and nationalism. By far one of the most bizarre but memorable parts of the entire series. Final thoughts: I think it was quite evident that I really like the SBR parts a lot. But don’t get me wrong, I like all parts in Jojo and its own distinct style. Each part explores a different genre which is what really keeps Jojo fresh. ",
            "date": "Updated July 16, 2019",
            "views": "607",
            "upvotes": " View 139 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ali Jimale-Ahmed",
                    "user_href": "/profile/Ali-Jimale-Ahmed"
                },
                {
                    "user_id": "Mr.S Mr.D",
                    "user_href": "/profile/Mr-S-Mr-D-1"
                },
                {
                    "user_id": "Nur Amirah Amirrudin",
                    "user_href": "/profile/Nur-Amirah-Amirrudin"
                },
                {
                    "user_id": "Turtle Front",
                    "user_href": "/profile/Turtle-Front"
                },
                {
                    "user_id": "Aviv Haim",
                    "user_href": "/profile/Aviv-Haim-1"
                },
                {
                    "user_id": "Garnet Heron",
                    "user_href": "/profile/Garnet-Heron"
                },
                {
                    "user_id": "Abhi Jith",
                    "user_href": "/profile/Abhi-Jith-113"
                },
                {
                    "user_id": "Josh White",
                    "user_href": "/profile/Josh-White-527"
                },
                {
                    "user_id": "Riley Escobar",
                    "user_href": "/profile/Riley-Escobar"
                },
                {
                    "user_id": "Chase Dallin",
                    "user_href": "/profile/Chase-Dallin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Saayman",
                "href": "/profile/Ian-Saayman"
            },
            "answer_text": "Alright in descending order from worst to best it would be. Part 1 Phantom Blood (5 Volumes)  Araki’s first attempt at JOJO and the weakest part by a land slide. It’s the shortest part, cardboard cutout characters, Jonathan is a generic MC and Araki’s least favorite JOJO. Fights are at their weakest in this part and so is the humor which would only start to get a lot better at part 2. Dio is awsome. Part 3 Stardust crusaders (16 Volumes)  Arguably the most popular part that made JOJO the juggernaut that it is today. I can’t stress how big the gap is between 1 and 3 Stands were an amazing addition that changed the franchise and manga in general. But the villain of the week format starts getting very boring at the mid way point of Stardust, it wouldn't have been so bad if they’d grown stronger or learned new abilities but they literally stayed the exact same. You could easily skip 20 episodes and still understand the plot perfectly. Jotaro also works much better as a side character than an MC trying to carry the whole story. DIO is still awesome if a bit scarce. Part 2 Battle Tendency (7 Volumes)  This was one fast paced thrill ride from beginning to end, the strategy that JOJO is known for started to make an appearance here, the characters were all lovable and hilarious. I’m a big fan of how this part tried to represent everyone equally, this story actually made me love a Nazi. GERMAN SCIENCE !!! Joseph is an awesome clown and top 3 JOJO’s easily. This was also where the franchise started handling death properly unlike in Part 1. The only weak point for this part are the villains who fall flat compared to DIO. Part 6 Stone Ocean (17 Volumes)  Starts out very strong but degrades very quickly, up until the half way point with the worst arc in JOJO the “Maximum security arc” it physically hurts me to read that story. But once the green baby shows up and Pucci actually starts doing stuff again the awesomeness sky rockets. I’m 95% sure Araki was on acid when he made the last half of this part and since this is Araki we’re talking about that’s saying a lot. I loved it, Part 6 has easily one of the most climactic endings in the entire series. The characters felt unique and Jolyne was one hell of a badass. Pucci is one brutal son of a bitch. Part 5 Vento Aureo (17 Volumes)  Despite the anime just finishing I’m not letting it cloud my judgement, part 5 is deeply flawed just like 6. But Araki is so masterful at drawing your attention away from those flaws Part 5 still comes off nearly masterpiece-like. Awesome group of characters if not a bit crowded to the point were some of them never really get a chance to shine all that often Abbacchio, Trish and Fugo either do nothing or spend more time in a turtle than actually helping. Despite Giorno being the actual son of freaking DIO he somehow manages to be kinda bland I blame Jonathan. Luckily Bruno and Mista more than make up for that. Also Part 5 in terms of stands randomly changing their abilities might actually be worse than part 3, Gold Experience and King Crimson forget abilities and make up new ones almost every fight. Diavolo is great but he lacks any chemistry with Giorno which is kinda important they never even met once before GER stomped Daivolo into oblivion. But still Italy is an awesome setting and the pace was fantastic what a great Part. Part 4 Diamond is Unbreakable (18 Volumes)  Part 4 is very close to flawless if not for a few plot holes here and there, but when ever there’s a plot hole like Josuke forgetting he can heal stuff it’s clearly in service of creating a more entertaining story. It’s usually that way with almost all plot holes in JOJO. The setting of Morioh is amazingly fleshed out it feels like a real town with a proper community. The side villains in Diamond are fantastic and aren’t just there to die, Josuke is a great MC who’s no where near the invincible badass his predecessors were making him more relatable. Stands also became a nearly perfect Power system during the course of this part. If I could criticize this part it would be that it feels a bit directionless in the first half. Kira is one of the best villains in all of JOJO and the final arc with BiteZadusto was horrifying and awesome at the same time. Great damn part Part 8 Jojolion (23 Volumes so far)  Part 8 is still ongoing but it’s managed to completely steal my heart away from part 4 even without a main villain. Gappy is fan freaking tastic fusing 3 characters we know and love into one MC who has no memories is genius. Everything we learn about the world and about who Gappy use to be, Gappy is learning with us for the first time. The fights aren’t even fights anymore they feel like complex puzzles that make you think more than anything else. This is also a part of Araki’s Seinin line up meaning Part 8 is adult rated and running on a monthly release schedule. This means that Araki actually has time to write characters and story better than he ever could before the Art is also jaw dropping. Might be my favorite once it finishes. Part 7 Steel Ball Run (24 Volumes)  Imagine a greatest hits album from part 1 - 3 but set in the 1890’s with cowboys, all your favorites are here Dio, Caesar, Jonathan, Joseph, Hamon and stands just far more complex alternate universe versions of them. The story never feels like it’s lacking direction since the characters are in a race, Johnny is easily the most developed character in all of JOJO and Gyro makes all other Jobro’s feel like unnecessary side characters. This was also where Araki moved from Shonen to Seinin allowing far more freedom to do what he wanted, with more adult concepts and godlike art. Spin in addition with Stands makes every fight feel fresh and every asspull feel more like Gyro and Johnny learning how to use their new powers better. And there’s freaking DINOSAURS !! The villain Funny Valentine is the only villain in all of JOJO with an actual justifiable motive. Part 7 is the best part in JOJO for me at least and one hell of a Bizarre adventure. ",
            "date": "Updated October 19, 2020",
            "views": "34",
            "upvotes": " View 103 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonah Slater",
                    "user_href": "/profile/Jonah-Slater-2"
                },
                {
                    "user_id": "Mr.S Mr.D",
                    "user_href": "/profile/Mr-S-Mr-D-1"
                },
                {
                    "user_id": "The Gamemaster",
                    "user_href": "/profile/The-Gamemaster-5"
                },
                {
                    "user_id": "Tyler Cruz",
                    "user_href": "/profile/Tyler-Cruz-60"
                },
                {
                    "user_id": "Ameeq Shaikh",
                    "user_href": "/profile/Ameeq-Shaikh-1"
                },
                {
                    "user_id": "Nirmal Shekhawat",
                    "user_href": "/profile/Nirmal-Shekhawat-10"
                },
                {
                    "user_id": "Aarnav Kunder",
                    "user_href": "/profile/Aarnav-Kunder"
                },
                {
                    "user_id": "Muhammad Taqiyyan",
                    "user_href": "/profile/Muhammad-Taqiyyan"
                },
                {
                    "user_id": "SSJBLUEKaix20 Gaming",
                    "user_href": "/profile/SSJBLUEKaix20-Gaming"
                },
                {
                    "user_id": "Senay Birhane",
                    "user_href": "/profile/Senay-Birhane-1"
                }
            ]
        }
    ]
}