{
    "title": "How to start a music streaming service? What about the music's legal terms - Quora",
    "tags": [
        "Streaming Video Startups and Companies",
        "Streaming Music",
        "Social and Online Music",
        "Spotify (product)",
        "Streaming Content",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Sears",
                "href": "/profile/Glen-Sears"
            },
            "answer_text": "2nd the motion: it's complicated. That being said, companies like MediaNet do make it easier and more accessible—as mentioned below. You simply sign up for their APIs, pay a monthly fee, and have legal access to the catalog, delivery, and even royalty payments. If you were to decide to go it alone, there are a few bedrock understandings you need to have: Geography has an enormous impact.Different countries have very different laws in place for handling the labyrinth of intellectual property ownership and royalty delivery expectations inherent in streaming music. Where your business is located and where you want to deliver music both matter, so familiarize yourself with the intellectual property laws of both.It matters what kind of streaming you want to do.Online radio, on-demand streaming, portable subscription, non-portable subscription, cloud-based ringtones, ad-supported...all of these types of streaming require different licensing. Determining exactly how and why you want to stream music before getting in the game will save you tons of negotiation time down the road.You need 2-3 licenses to stream 1 song.A license for the sound recording, which is provided by the record label who owns it. Usually a label grants a \"full catalog\" license for a monthly fee or equity in the business, and as mentioned below it can be a process with the larger labelsA license for the composition, which is provided by the publishing company who owns it or the company that administers that publisher's transactions. In the U.S. these licenses are often \"compulsory,\" meaning you don't need approval to get them provided you pay the publisher the royalty rate set out by CongressA license for the \"public performance,\" provided by the performing rights organization the composition is registered to. Unlike online radio, on-demand streaming (where you can choose the song you listen to) is considered a \"public performance\" and is subject to fees normally paid by people like TV stations.Once you understand what you want to stream, how you want to stream it, and who you want to stream it to, getting proper licensing is mostly a matter of time and persistence. Labels and publishers (and 3rd party distributors and fulfillment providers) are bombarded with daily requests to use all or part of their catalogs. Coming to the table with usage specifications will save time and legitimize the request. It is also important to determine the size and scope of your project. If a person wants a song to play when users open their app, it makes more sense to go to the owners of the song and hash out a direct deal—avoiding the rigors of the larger system.  Anything more complicated and it is at least worth considering a 3rd party API. Many have free tiers for testing and are sometimes enough to launch with, and using a turn-key solution that costs $1000/month is usually more prudent than spending $100k to develop a bespoke solution and develop all the necessary deals. TL;DR it's a tough game but mostly because there are so many options and little standardization. Learn the basics, decide exactly what/how/where/who you want to stream, and go nuts. Good luck! ",
            "date": "Answered April 28, 2016",
            "views": "141",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrii Ko",
                    "user_href": "/profile/Andrii-Ko-2"
                },
                {
                    "user_id": "Tobi Ogunleye",
                    "user_href": "/profile/Tobi-Ogunleye"
                },
                {
                    "user_id": "Kagiso Shokane",
                    "user_href": "/profile/Kagiso-Shokane"
                },
                {
                    "user_id": "Dennis Stewart",
                    "user_href": "/profile/Dennis-Stewart-36"
                },
                {
                    "user_id": "Yash Jagasia",
                    "user_href": "/profile/Yash-Jagasia-1"
                },
                {
                    "user_id": "Subby Ramesh",
                    "user_href": "/profile/Subby-Ramesh"
                },
                {
                    "user_id": "Kiersten Farmer",
                    "user_href": "/profile/Kiersten-Farmer"
                },
                {
                    "user_id": "Khady Thiam",
                    "user_href": "/profile/Khady-Thiam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Légère",
                "href": "/profile/Daniel-Légère"
            },
            "answer_text": "It is complicated.Record labels will not listen to your proposition until you are able to prove that the service is viable i.e. has a user base / audience.  This obviously means you will need access to their catalogue in the first place... and you will need to pay for a license to communicate (via streaming) label catalogue, the terms of which will vary depending on the territory in which you establish the business.  Speaking for the UK, you will need a joint PRS/MCPS online music license (OML) Online Music Licence. Licensing and royalty calculations will need to be factored into the business plan and in most cases (I'm pretty sure but you can search online) digital services are often pressured to pay advance royalties to labels to guarantee they will see some return IF they grant you the right to use their music. But before even getting into the technicalities, you need to seriously consider how you can compete / find a niche amongst pre-existing services such as Spotify, Grooveshark, Youtube's upcoming service, iTunes' upcoming service (following the acquisition of Beats) etcetc. It's dubious. A territory-specific service could work if you live somewhere obscure. ",
            "date": "Answered July 1, 2014",
            "views": "65",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yash Jagasia",
                    "user_href": "/profile/Yash-Jagasia-1"
                },
                {
                    "user_id": "Glen Sears",
                    "user_href": "/profile/Glen-Sears"
                },
                {
                    "user_id": "Anis Sayyad",
                    "user_href": "/profile/Anis-Sayyad-1"
                },
                {
                    "user_id": "Elias Canoa",
                    "user_href": "/profile/Elias-Canoa"
                }
            ]
        }
    ]
}