{
    "title": "How would Wagner and Brahms feel about Schoenberg and Stravinsky? - Quora",
    "tags": [
        "Arnold Schönberg",
        "Johannes Brahms (composer)",
        "Igor Stravinsky (composer)",
        "Richard Wagner (composer)",
        "Classical Music Composition",
        "Classical Composers",
        "Music Composition"
    ],
    "response": [
        {
            "author_info": {
                "name": "René Villarreal",
                "href": "/profile/René-Villarreal"
            },
            "answer_text": "Brahms would have agreed with Schoenberg and Wagner with Stravinsky, at least ideologically. Note: The actual two ideologies of the romantic period were led by Brahms and Liszt. Not Wagner. Liszt advocated in favor of Program music (Music that depicts an image or describes a poem. Akin to his Après une Lecture de Dante or the Wilde Jagd Trascendental Étude). Brahms denied him and favored Absolute music. (Music with metaphysical meaning, that would go beyond the human experience, instead of reflecting upon it). The debate between these ideas started before the romantics and has yet to end. But it got so fierce at that time that it was even called the War of the Romantics. Among the few important composers that didn't take sides was Robert Schumann (even his wife Clara sided with Brahms). Brahms & Schoenberg Schoenberg really understood the tonal system, he mastered it in his own way. (you can read about this in his books Treatise on Harmony, Harmonielehre and Structural Functions of Harmony). He in fact designed the twelve tone system as a substitute and he could only do this thanks to the profound insight that he garnered on the tonal system. This is vague at first but makes one thing clear: Schoenberg sought the essence of Music to the very axioms that it was previously founded upon. He took the ideal of absolute music a step further: Where Brahms gave meaning to the music by itself, Schoenberg gave meaning to the meaning.  Wagner & Stravinsky Wagner’s work isn’t limited to music. Gotthold Lessing’s essay on the Laocoön Group —A gorgeous Hellenistic-Baroque Greek sculptue— expresses the great problem that rises from interdisciplinarity.  Lessing explores the limitations of the different kinds of artistic expression by directly comparing Virgil’s hexameters in the Aeneid and the sculpture in the picture. Which art is superior? It's a question without an answer… This dilemma is behind Wagner’s ‘total’ approach to art. He opted for a medium that conveyed his message in as many ways as it was possible at the time. He would’ve been a fantastic filmmaker. In this regard Stravinsky is much closer to Wagner than Schoenberg. He worked very personally with Serge Diaghilev, Nijinsky and the rest of the Ballets Russes company in the making of The Firebird, Petrushka and The Rite of Spring. But compared with Wagner, his involvement was rather shallow, as anyone's would be. This only talking about ideology. In J. S. Bach’s words: Music must please both the mind and the ear. Would Schoenberg’s Pierrot Lunaire please Brahms’ ear? Would Stravinsky’s Symphony of Psalms please Wagner’s? We will never know. ",
            "date": "Updated May 4, 2018",
            "views": "18",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Banks",
                    "user_href": "/profile/William-Banks-101"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "John Beowulf Pearce",
                    "user_href": "/profile/John-Beowulf-Pearce"
                },
                {
                    "user_id": "Campbell Gill",
                    "user_href": "/profile/Campbell-Gill"
                },
                {
                    "user_id": "Guenther Grun",
                    "user_href": "/profile/Guenther-Grun"
                },
                {
                    "user_id": "Bruce Watson",
                    "user_href": "/profile/Bruce-Watson-8"
                },
                {
                    "user_id": "Krishnendu Ray",
                    "user_href": "/profile/Krishnendu-Ray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "One of the fundamental differences between the musical worldviews of Wagner and Brahms is that Wagner rationalized virtually everything that came before him as prelude to himself and his ideas — and he had little tolerance for the work of composers who were not enthusiastic, self-avowed Wagnerians (such as Bruckner, in many respects his protégé); Brahms, on the other hand, viewed himself as the last remaining scion in a long line of musical craftsmanship extending back to Palestrina and Schütz, and as he aged, he frequently despaired for the future of music, believing that his noble ideals would not long survive him. He lived to see the early efforts of Richard Strauss and Gustav Mahler, and while he took a particular interest in both young men as conductors, he did not care much for their compositions. Brahms heard an early performance of Also sprach Zarathustra, and could not get past the strangeness of its polytonal ending, ranting furiously about it for days afterward. Mahler loved to recount a story about going to visit Brahms in the country. As they walked along the riverbank, Brahms, now in the last years of his life, waxed melancholic to his young companion about the lost art of the masters and the impending doom of music after his death. As a zealous Wagnerian himself, this must have been difficult for Mahler to take. Interrupting Brahms, Mahler grabbed his arm and then pointed out to the rolling water: “Doctor Brahms, look — and there, just now, goes the very last wave.” Brahms chuckled gruffly and then fell silent as they continued on their walk, evidently haven taken the point in good humor. Schoenberg took Brahms’ proclivity for motivic development and invention as a starting point for his experiments, often citing Brahms’ work as an impetus. But Brahms would not have understood Schoenberg’s extreme deconstructionism. Similarly, he might have appreciated Stravinsky’s eclecticism and his neoclassical sensibilities, but he would have been mystified by the strangeness of the musical language. Perhaps Wagner would have been more sympathetic to these modernists in a detached musical sense, if he were really capable of such thought; but we must remember that Wagner’s ideals were as much philosophical and political as musical: if he could construe the work of Schoenberg and Stravinsky as somehow bolstering his own world-redeeming, almost cosmic vision for music (doubtful), or as combating “Jewry in music,” (even more doubtful), then he might have gotten on board. ",
            "date": "Answered December 31, 2016",
            "views": "14",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Blackfish",
                    "user_href": "/profile/Joseph-Blackfish"
                },
                {
                    "user_id": "Neil Metcalfe",
                    "user_href": "/profile/Neil-Metcalfe-6"
                },
                {
                    "user_id": "Matt Barros",
                    "user_href": "/profile/Matt-Barros-4"
                },
                {
                    "user_id": "Daniel Hungerford",
                    "user_href": "/profile/Daniel-Hungerford"
                },
                {
                    "user_id": "Lucas Sha",
                    "user_href": "/profile/Lucas-Sha-2"
                },
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                },
                {
                    "user_id": "Emanuel León",
                    "user_href": "/profile/Emanuel-León"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Ethan Smith",
                    "user_href": "/profile/Ethan-Smith-148"
                }
            ]
        }
    ]
}