{
    "title": "How do feel about lip syncing during a music performance? - Quora",
    "tags": [
        "Music Performance",
        "Lip Synching",
        "Live Performances",
        "Concerts",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nanae Laid",
                "href": "/profile/Nanae-Laid"
            },
            "answer_text": "Depends on why. I personally don’t really care for lip syncing that much, though I don’t think it’s the showcase of someone’s true talent. if you can’t sing and dance well at the same time, whatever. But if you can’t sing live while standing still (and aren’t sick somehow), I have a problem sometimes. I know nerves and stuff can be a factor, but lip syncing while not really moving at all is why I dislike a lot of artists. There’s no point in it. I’d rather you sing live with live autotune then lip-sync. If I wanted to listen to a pre-recording, I’d listen to the album version of the damn song. That’s some real cheating to me sometimes, especially when someone receives an awards based on a live performance alone and it wasn’t really live. ",
            "date": "Answered May 2, 2019",
            "views": "92",
            "upvotes": " Answer requested by Eric DeLuca",
            "upvoters": [
                {
                    "user_id": "Peter Entz",
                    "user_href": "/profile/Peter-Entz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Buck Moore",
                "href": "/profile/Buck-Moore"
            },
            "answer_text": "Lip syncing is ‘cheating’, plain and simple. Audiences aren’t stupid, and want to hear the real person sing on stage. Also, if the person cannot sing live without auto-tune, and needs to lip-sync to achieve ‘album-perfection’, then their ‘talent’ is questionable. I am not against auto-tune for recording and then using the recording as the reference to achieve during live performances, in the same way I sometimes edit a guitar solo and then learn the edited solo on the recording for live performances, but my own live performances are always real (and I personally do not use auto-tune when I record, even if my vocal notes aren’t perfect because I am not a robot…..I’m pretty sure, anyway). :-) ",
            "date": "Answered May 2, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter"
        }
    ]
}