{
    "title": "How to find the lower number in a time signature - Quora",
    "tags": [
        "Time Signatures",
        "Signatures"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praloy M Sangma",
                "href": "/profile/Praloy-M-Sangma"
            },
            "answer_text": "Since you have understood the upper number in time signature, you have overcome 50% of Time Signature. The Lower number denotes which note gets one beat irrespective of the upper number is irrespective whether it is Simple, Compound(for slower counting) or even in Irregular or Odd Time Signature. However in the Compound Time Signature, 2 times or double of bottom number gets a dotted note. Yes, Compound time signature has fast or slow count. For Slow counting system in compound it follows the same method as I have mentioned above, however for fast count it is slight different than I just mentioned. For better clarification:Whole Note or 1 Note (in USA) = Semi breve(in UK)Half Note or 1/2 Note (in USA) = Minim(in UK)Quarter Note or 1/4 Note (in USA) = Crochet(in UK)Eight Note or 1/8 Note (in USA) = Quaver(in UK) So with that being said, to keep it simple lets give example of Simple Time Signature. The bottom numbers can be of any number which represent a note or sub-division of note. For example 2, 4, 8, 16, 32, etc but can never have the numbers like 3, 5, 7, 9 which is not a sub-division of a note. Consider that bottom number is like denominator in maths and represents the sub-division or sub-multiple of a note.  For example if the bottom number is 2 then 1/2 Note or Half Note or Minim receives 1 beat. Which also means that its sub-multiple crotchet or 1/4 or quarter note receives 1/2(half) beat in simple time signature with the bottom number as 2, likewise whole note receives 2 beats in this time signature. Likewise it continues and will always receive respective beats in respective level whether we go higher or lower(multiple or sub-multiple of beats). If the bottom number is 4 then quarter note or crotchet note or 1/4th note receives 1 beat and likewise its multiple and sub-multiple gets their respective beat into how many levels we are going higher or lower. If the bottom number is 8 then 1/8th note or quaver note receives 1 beat and likewise its multiple and sub-multiple gets their respective beat into how many levels we are going higher or lower. Note that these numbers are not only applicable for notes but also for rest. For more symbols and for more details like symbols and meanings or multiples or sub-multiples(division of notes/rests), see some of the youtube or website materials. Once you are thorough in understanding Simple Time Signature, you can explore Compound and Odd/Irregular Time Signature. Hope i could be of some help? Welcome to the world of Music Theory and all the best. ",
            "date": "Updated March 23, 2016",
            "views": "953",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Olowu",
                    "user_href": "/profile/Daniel-Olowu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Rigby",
                "href": "/profile/Mary-Rigby"
            },
            "answer_text": "You are right that the upper number refers to how many beats are in a measure. The lower number \"that gets the beat\" refers to the quarter note, half note, etc. They are assigned a number: a quarter note = the number 4 and a half note = 2 and an eighth note = 8. For example, in 4/4 time, you have 4 beats per measure and the quarter note gets that beat. Meaning it takes 4 quarter notes to make up a measure. Or 2 eighth notes and 3 quarter notes, or 8 eighth notes or any combination adding up to 4 quarter notes, which could also include two half notes or one whole note.  One more example for clarity, 3/2 means 3 beats per measure with a half note getting the beat. So that means two half notes per measure or 4 quarter notes, etc. 6/8 means six beats per measure so six eighth notes make the measure complete.  It may help to look at several sets of sheet music and examine the time signature and then see the various combinations of notes/rests used in each measure that makes the measure whole. You can see that they all will add up to how ever many beats per measure using whatever note \"gets the beat.\" Hope that makes sense! (This answer is pretty simplistic, check out https://www.musictheory.net/lessons/15 for more information especially about compound meters.) ",
            "date": "Answered March 16, 2016",
            "views": "879",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "SJ Corber",
                    "user_href": "/profile/SJ-Corber"
                },
                {
                    "user_id": "Daniel Olowu",
                    "user_href": "/profile/Daniel-Olowu"
                }
            ]
        }
    ]
}