{
    "title": "How hard is it to make a living as a musician? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucero De'Lucero",
                "href": "/profile/Lucero-DeLucero"
            },
            "answer_text": "Everything depends on how hard you work at it, how much you are willing to bend, and what your goals are. For some musicians (myself) My goal was clear. I took the necessary steps which meant, I played music that bored me, in order to attain the funds, experience and to make the connections that would help me attain my goals. Some musicians have the attitude, “I will play only Indie, jazz, R&B or Metal and nothing else! I will do this until I am successful!” The odds are that you will not be able to earn a living with those musical restrictions. From my experience, you have to have the musical ability, flexibility to travel, in order to earn a living based on the current music market. You have to be prepared to work with a legitimate, well-reviewed booking agent, listen to their advice, and be flexible. With all this in mind, during my time on the road, I was earning five to ten times the average weekly wage. And yes, as a young man blew almost every penny of it. We worked our asses off, spent many nights driving between San Francisco and Chicago to make the next gig, slept in the back of an equipment van, and ate delicious meals prepared by Circle K! When I look back on the adventures, and the insanity of it I would ABSOLUTELY do it all again. If you plan to be a flight engineer at NASA, chances that won’t be your first job with them. If you plan on being president of a bank, you will first start off as a teller. ",
            "date": "Updated July 5, 2020",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stacey Nash",
                    "user_href": "/profile/Stacey-Nash-1"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clay Mottley",
                "href": "/profile/Clay-Mottley"
            },
            "answer_text": "It depends on many factors, but what you work hard on is getting the job; not necessarily performing the music. There are several jobs musicians can do locally that can all be grown with word-of-mouth marketing. These jobs include teaching lessons, performing weddings, playing local venues in bars, music at churches, etc. In all honesty, nearly every musician has done and can easily get these types of gigs in their local town. But these types of jobs aren’t easy to come by in a full-time or long term set up. Few if any of these jobs will include health insurance, retirement, paid days off, and all of the other perks most full-time jobs come with. A full-time music job is hard to come by. Recording and selling your music is another option, but again revenue from selling music is hard to come by. Ask yourself, how much do you pay for Spotify or any of the other streaming services? Do the math on how many songs you listen to versus how much you pay per month. You’ll see it maybe pennies to the artist each month. Being a musician is a labor of love, and if you’re lucky enough to make enough money to even pay one bill, you consider yourself lucky! And there are those who are able to do it full-time. But most are living a dream that will never fully financial support you and the family, but it’s a lot of fun trying to reach it. ",
            "date": "Answered June 26, 2018",
            "views": "37",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                },
                {
                    "user_id": "Stacey Nash",
                    "user_href": "/profile/Stacey-Nash-1"
                },
                {
                    "user_id": "Elena Garcia",
                    "user_href": "/profile/Elena-Garcia-8"
                },
                {
                    "user_id": "Shigeru Andres",
                    "user_href": "/profile/Shigeru-Andres"
                },
                {
                    "user_id": "Tasnim Mohd Hanafiah",
                    "user_href": "/profile/Tasnim-Mohd-Hanafiah"
                },
                {
                    "user_id": "Grace Frederick",
                    "user_href": "/profile/Grace-Frederick-4"
                },
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                }
            ]
        }
    ]
}