{
    "title": "How to be sure that a politician is honest - Quora",
    "tags": [
        "Honest Politician",
        "Honesty",
        "Decision Making",
        "Politicians and Government Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Satya Parkash Sud",
                "href": "/profile/Satya-Parkash-Sud-1"
            },
            "answer_text": "OP: Are politicians ever honest?  We in Himachal Pradesh have been blessed to have had a succession of honest politicians who had kept the welfare of the people of the state always to the fore. I shall recount of a few of the great sons of the state. During the period when freedom fighters were waging a struggle for Independence from the British under the banner of the Congress in the British ruled India, similar freedom struggle in states ruled by Rajas and Maharajas was being waged under the banner of 'Praja Mandal' movements. Giani Zail Singh, one of our past Presidents, was a product of the 'Praja Mandal' movement. In Himachal Pradesh, the 'Praja Mandal'movement was headed by Pandit Padam Dev. After India attained freedom, state governments were being formed mostly under prominent freedom fighters of the state. When it came to choose the Chief-ministerial candidate for the state, the delegate proposed the name of Pandit Padam Dev. No other candidate was proposed. Pandit Padam Dev stood up and told the delegates : “ Sitting among us is Yashwant Singh Parmar, who is a Ph.D from the Lucknow University. I propose that Dr. Yashwant Singh Parmar should be our chief minister. It will be good for the progress of the state. Other delegates did not utter anything against this proposal, though many may had been senior to Dr. Y. S. Parmar as freedom fighter, such was the stature of Pandit Padam Dev. Dr. Y. S. Parmar became the first Chief Minister of Himachal. It was under the vision of Dr. Y. S. Parmar that Himachal Pradesh made big strides in the all fields. There is a statue of Dr. Y. S. Parmar on the Ridge Maidan, Shimla, to honour our visionary leader. There is a Shopping Complex on the Ridge Maidan, Shimla named after Pandit Padam Dev to honour him also. Dr. Y. S. Parmar, remained Chief- Minister of the state from 1952- 1956. In 1956, Himachal Pradesh became a Union Territory and Dr. Parmar stepped down. He again became Chief Minister of the state on July 1, 1963 and remained Chief- Minister of the state till he stepped down on 28.01. 1977, during the emergency on his refusal to kow-tow to Mr. Sanjay Gandhi. Dr. Parmar was Chief Ministef of the state for almost 17–18 years. It was under his Chief-ministership that Himachal Pradesh became a full fledged state. I had joined the Regional Centre for Post Graduate Studies, of Punjab University Chandigarh, at Shimla in December, 1969 and seen Dr. Y. S. Parmar, walk on the Mall, accompanied by only one constable about 10 paces behind. When Dr. Y. S. Parmar was in office, the BJP and its earlier version BJS used to label serious allegations of corruption against Dr. Parmar. Mrs. Indira Gandhi had the chargesheets enquired into, and found no substance of any corruption against Dr. Parmar in these allegations. The only thing that was found to have some truth in it, was that Mrs. Satya Vati Dang, President of the PCC, and a widow, and Dr. Y. S. Parmar, whose wife had died long years ago, were living together without being married. She advised both to get married to put a stop to these allegations, which they did. Thereafter the allegations stopped altogether. On the death of Dr. Y. S. Parmar, his only assets were a small house in Shimla and a sum of about Rs. 3000/ in his bank account. Another of our great Chief Minister whom I admire is Mr. Shanta Kumar of BJP. He is known to be a great administrator and very upright person. Besides being CM of the state twice, he was a minister in the Atal Behari Vajpayee cabinet. I have read in letters to the editor published in the Tribune, of people being plesantly surprised that Mr. Shanta Kumar would que like other ordinary passengers while traveling by air and not throw his weight around and seek special privileges. It is pity that the rule of denying political office to BJP politicians of 75 years or more has deprived Mr. Modi of the administrative acumen of Shri Shanta Kumar, besides many others in other states. ",
            "date": "Answered May 27, 2018",
            "views": "14",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunjan Rana",
                    "user_href": "/profile/Kunjan-Rana"
                },
                {
                    "user_id": "Pramod Kumar",
                    "user_href": "/profile/Pramod-Kumar-983"
                },
                {
                    "user_id": "Srinandan P",
                    "user_href": "/profile/Srinandan-P-2"
                },
                {
                    "user_id": "Shikher Srivastava",
                    "user_href": "/profile/Shikher-Srivastava-7"
                },
                {
                    "user_id": "Dev Kumar",
                    "user_href": "/profile/Dev-Kumar-482"
                },
                {
                    "user_id": "Aravind Varier",
                    "user_href": "/profile/Aravind-Varier-2"
                },
                {
                    "user_id": "Manish",
                    "user_href": "/profile/Manish-752"
                },
                {
                    "user_id": "Prem Gupta",
                    "user_href": "/profile/Prem-Gupta-11"
                },
                {
                    "user_id": "Vaibhav Anand",
                    "user_href": "/profile/Vaibhav-Anand-39"
                },
                {
                    "user_id": "Suhas DL",
                    "user_href": "/profile/Suhas-DL"
                },
                {
                    "user_id": "Pavan Kumar V",
                    "user_href": "/profile/Pavan-Kumar-V-1"
                },
                {
                    "user_id": "Rajan Anil Joshi",
                    "user_href": "/profile/Rajan-Anil-Joshi"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                },
                {
                    "user_id": "Ramkumar Mudumbai Venkata",
                    "user_href": "/profile/Ramkumar-Mudumbai-Venkata"
                },
                {
                    "user_id": "Jack Napier",
                    "user_href": "/profile/Jack-Napier-14"
                },
                {
                    "user_id": "Shiv Kumar",
                    "user_href": "/profile/Shiv-Kumar-809"
                },
                {
                    "user_id": "Ajit Singh Bhatnagar",
                    "user_href": "/profile/Ajit-Singh-Bhatnagar"
                },
                {
                    "user_id": "Arshpreet Singh",
                    "user_href": "/profile/Arshpreet-Singh-75"
                },
                {
                    "user_id": "Nandita Das",
                    "user_href": "/profile/Nandita-Das-10"
                },
                {
                    "user_id": "Apoorv Ranjan",
                    "user_href": "/profile/Apoorv-Ranjan-7"
                },
                {
                    "user_id": "Nishant Kumar Jha",
                    "user_href": "/profile/Nishant-Kumar-Jha-4"
                },
                {
                    "user_id": "Nagarajan Srinivas",
                    "user_href": "/profile/நாகராஜன்-ஸ்ரீனிவாஸ்-Nagarajan-Srinivas"
                },
                {
                    "user_id": "Shabeer Ahmed",
                    "user_href": "/profile/Shabeer-Ahmed-9"
                },
                {
                    "user_id": "Shashwat Khanna",
                    "user_href": "/profile/Shashwat-Khanna-1"
                },
                {
                    "user_id": "Rajat Verma",
                    "user_href": "/profile/Rajat-Verma-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Rodrigues",
                "href": "/profile/Sandra-Rodrigues-17"
            },
            "answer_text": "By studying that polititian. By collecting as much possible information about them as you can. Then, ask yourself these questions: When that polititian says he/she will make something happen, does it usually happen? (should be yes)When that polititian is describing a certain occurance is the story lengthty and consistant? Do other sources of information confirm that person’s story? (should be yes)Has that polititian ever been witnessed lying to someone before? (should be no)Has that polititian ever withheld information to make things more acceptable and avoid conflict? (should be no)Have you ever witnessed that polititian doing something (lying) that he or she had condemned before? (should be no)If the answer to these questions is as above then most likely that polititian is honest and trustworthy. ",
            "date": "Answered November 27, 2017",
            "views": "130",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacque Scott",
                    "user_href": "/profile/Jacque-Scott"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dikran Tulaine",
                "href": "/profile/Dikran-Tulaine-2"
            },
            "answer_text": "There probably are. Like the rest of us Honesty is in short supply. But then look at the necessary qualifications: you have to believe you can do what few others can, persuade, convince and be loved by many people. Ironically, the ones who are no good at it, Hillary Clinton, are somehow the most honest, it the least good at lying, the least capable of being what we want them to be. The bottom line is that we like liars: they flatter us, convince us they care about us. The rare ones really do but the rest, as I say, are a reflection of us: as honest as we are. ",
            "date": "Answered December 10, 2019",
            "views": "43",
            "upvotes": " Answer requested by Jimmie Perry III",
            "upvoters": [
                {
                    "user_id": "M J McGrail",
                    "user_href": "/profile/M-J-McGrail"
                },
                {
                    "user_id": "Daniel Cox",
                    "user_href": "/profile/Daniel-Cox-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Roberts",
                "href": "/profile/Andrew-Roberts-11"
            },
            "answer_text": "Well the following U.K. quote, from Gyles Brandreth (ex-MP), appears genuine: …I can tell you that the one thing I really, really couldn't bear when I was an MP were my constituents. [laughter] Let's face it: the people have contempt for the politicians; it is as nothing to the contempt we have for you. [laughter] All over this country, there are politicians on their way to the Labour Party conference, coming away from the LibDem one, getting ready to go to the Conservative one, thinking \"God, at last he's said it. He's said what we all feel, that happiness is the constituency in the rear-view mirror.\" The News Quiz series 72, episode 1 (BBC Radio 4, 24 September 2010). ",
            "date": "Updated May 18, 2020",
            "views": "175",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peeyush Deepna",
                "href": "/profile/Peeyush-Deepna"
            },
            "answer_text": "They are honest just one day before election ",
            "date": "Answered May 25, 2018",
            "views": "35",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Ravi Banga",
                "href": "/profile/Ravi-Banga-2"
            },
            "answer_text": "Yeah when they are begging you for your vote (only this part), And then chameleon changes its colour. Perpetual vicious cycle since ages. ",
            "date": "Answered May 24, 2018",
            "views": "48",
            "upvotes": "0"
        }
    ]
}