{
    "title": "How would you rank the members of Everglow in terms of vocals, rap, dance, stage presence, and visuals? - Quora",
    "tags": [
        "Girlband",
        "Celebrity and Music",
        "Rap Music",
        "Dance (activity)",
        "K-Pop Idols",
        "Singing",
        "Music Industry",
        "K-Pop",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amir Aviv",
                "href": "/profile/Amir-Aviv"
            },
            "answer_text": "Thanks for the request : ) Lets go  this are professionals opinions plus mine when I know great about the subject. - Vocals (technical analysis- my vocal opinions mix with professionals) - 1.Mia Mia have a great range power and stability, she is good at strong high notes and I think in general she succeed more in power based songs with an energetic sound that match her tone, while she have some flaws such as her nasal placement and inconsistent breath control she is still a good main vocalist for her short time in the industry. 1.Sihyeon No it’s not a mistake, Sihyeon by the time of La Di Da era succeed in every category Mia does and overall stand very close to Mia’s vocal skills, Sihyeon is more suited toward dark/mellow songs due to her less nasal placement, she have a better head voice then Mia and softer high notes are more natural to her, she can be a little throaty and unrelaxed at time but overall have a strong base. 2. Aisha Aisha is a developing vocalist, while she is focused more in rap she is still a potentially great lead vocalist, her upper and lower range sound good and I would say she have a great musicality for a non vocal line idol, one of her big problems is her very airy stylish sound that blocking her voice from sounding powerful and full, also she is unclear at times. 3. Onda Onda is a good sub vocalist potentially lead vocalist one day, her tone is really nasal and she have voice cracks in her higher register, her lower register seems natural and good while singing even though her voice is higher naturally(which is kind of confusing), in general it seems like Onda is relying a lot on her natural limitations good areas rather then proper technique, with that being said I think she improved in La Di Da and she didn’t show us her improvement just yet also the screaming lines in the previous eras didn’t let us see the improvement she did might have. 4. Yiren/Eu Eu have a potential for singing, she seems to have good musicality in term of stylising and a good lower range, her higher range as we hear also from her rapping is good too, she can be off tune at times and we didn’t hear her sing that much recently, so that’s her place for now Yiren have a pretty tone, she can hit high notes due to her naturally higher voice and she is able to adept her voice a bit to the song style, how ever she is singing very weak and her breath support and control are not good enough.  Rap (technical analysis) - 1.Eu Eu is an extremely versatile rapper she can fit any concept, she is super charismatic clear and sharp, she can write her own lyrics and generally great, a little stepping up in her line difficulty and minor technique improvement will set her high as a rapper in the 4th gen. 2. Aisha Aisha have a deep unique tone that suit rapping well, she trained for long time and her potential is promising, her flow and power are great even though Eu’s are better, she can be unclear in pronunciation and breathy but its not the case usually. 3. Mia and sihyeon Mia is a good sub rapper with a good base technique but she is monotone and unemotional. Sihyeon lack basic technique but her tone and dynamic are better then Mia. 4. Yiren Yiren have the potential to be higher if she will work on technique and basically take rapping as her thing, she is a high potential and her cute voice and way of rapping resemble Yeri and Dahyun. 5. Onda Onda is an ok rapper but she is not good at that at the moment, her tone can suit rapping.  Dancing (technical analysis) I wouldn’t explain as much, dancing is not my thing. Mia- best technique and fluidity a very good dancer Eu- lack some areas where mia is good, better then Mia in very sharp powerful dances. Onda- a very good unappreciated fluid dancer a lot of dancers praised her skills. Aisha- natural disadvantage bc of long limbs, very good at boy group dances and powerful choreographys. Yiren- lack power in some areas, strong in modern/traditional Chinese dances. Sihyeon- lack natural sense for dancing, still a good dancer (slow dances seems better for her)  Stage presence (my taste and preference) Mia Yiren AishaEu Onda Sihyeon Visuals (-Korean beauty standard-) 1.Yiren  2.Sihyeon  3.Onda  4.Aisha  5.Mia  6. Eu  Visuals my standard 1.Sihyeon  2.Yiren  3..EU  4. Aisha  5. Onda  6. Mia  - - Thank you for reading my answer, comment your opinion ! Upvotes are highly appreciated and if you enjoyed this answer I am more than happy for that ✨ : )  ",
            "date": "Updated October 11, 2020",
            "views": "1",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akansha Prasad",
                    "user_href": "/profile/Akansha-Prasad-8"
                },
                {
                    "user_id": "Raheel Abeed Alam",
                    "user_href": "/profile/Raheel-Abeed-Alam"
                },
                {
                    "user_id": "Twice Is Beautiful",
                    "user_href": "/profile/Twice-Is-Beautiful"
                },
                {
                    "user_id": "Ritha Sara",
                    "user_href": "/profile/Ritha-Sara"
                },
                {
                    "user_id": "Pranjal",
                    "user_href": "/profile/Pranjal-190"
                },
                {
                    "user_id": "Vaishavi Joshi",
                    "user_href": "/profile/Vaishavi-Joshi"
                },
                {
                    "user_id": "Samantha",
                    "user_href": "/profile/Samantha-2297"
                },
                {
                    "user_id": "Ikram Osman",
                    "user_href": "/profile/Ikram-Osman-6"
                },
                {
                    "user_id": "Audrey Lai",
                    "user_href": "/profile/Audrey-Lai-18"
                },
                {
                    "user_id": "Don Thompson",
                    "user_href": "/profile/Don-Thompson-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carmen Lin",
                "href": "/profile/Carmen-Lin-29"
            },
            "answer_text": "Although I am not a big fan of them, I would still rank them based con my opinions and preferences. If you do not agree with me, in some parts, you may respectfully disagree. but my ranking doesn’t validate one more than the other and it certainly doesn't mean that one is better based on my preferences, nor do I think that one of them is superior to the other. I am just ranking them based on my preferences and want suits my taste more, and attracts me the most as a viewer of both their music videos and performances, and also enjoy listening to their songs. Vocals Mia It comes to no surprise why I would rank Mia as the number one vocal in the group. Not only is she the main vocalists, which doesn't imply her voice is better than the other members, but because her voice is unique and different from the others, which make her stand out in terms of vocal quality. her voice is subtle, and calm, sully and seductive, yet it is also honey like and smooth. It has a nice touch of her flair to it, and has a nice stability and strength. She executes her high notes, perfectly, or the long notes that really highlight the quality of her voice and her true colors. She is able to deliver her motions through the song well, and able to maintain a stable and healthy state while dancing as well, and can adjust to different concepts accordingly in each era, which we get to see the versatility in her voice. She has a good range and it is able to sing in a low tone, with a bit of high pitch. But not as much as the others. So, her voice is really mellow and subtle, which gives it the mysterious and sultry vibe that I get from her, and the force and powerful aura I get from her just makes it complete. Sihyun I ranked her second because I think out of all the vocals, she would stand second. She is able to execute her parts well and has a nice, sweet, and high pitched voice. She also has great stability and power in her voice, which really shows when she is singing her parts, and the high notes that she also gets incorporated to her future highlight her voice. It is overall very nice and pleasant to hear, and she really suits her stage presence really well. it is high pitched from the other members, which is nice contrast to the song, and in the recent music video. She has shown us that she can be able to sing more lines perfectly and powerfully, and she has delivered in terms of emotions of the song and the power she has in the song in certain parts. Like Mia, her voice is also very fluid, smooth, and honey like and overall heavenly. but her is just a bit more high pitched than Mia, whose voice is more deep in the vocal chords, as if there was a vibrato added to it, or a backup vocals. I think the deep vocals that you hear a bit in her voice, really makes her voice mysterious and very unique. Sihyun has shown that she is capable to be the lead vocalist snd has perfumed beautifully in her role, as she has such amazing emotional delivery, and her vocal quality really shines through in their songs. Odna I ranked her third because her voice is very shrill, and tiny if I should say and very high pitched, as if she is using all her of vocal chords to sing, as if she is whispering into the wind. Her voice is declare and soft and it is a really nice touch to their song, but I sense that her voice wouldn't be really suited for high notes or any singing that requires more power and it is very subtle and calm, and really matches with their concept, which is cool, and laid back, but also force and powerful. She can also accommodate to many different concepts, and still sound good doing it, from fierce and powerful, to sexy and sultry. But her voice doesn't have a wide range, which may set her back from the other two, but nonetheless, her voice is still unique and stable and has nice touch to it. Yerin I ranked her fourth because she has a very soft voice as well with a bit of delicacy, but again. I sense that she wouldn't be able to belt out high notes, and she isn't give the chance to sing out full lines, in the songs, so I don't know the quality of her voice well. But it is very nice and stable, but to mew, has no color, and is very plain. It is a nice voice to hear, but every common, and really offers no uniqueness or originality, which is important as a singer. It is important to have your own colors your singing and let it speak for itself. but she is also not given enough chances to sing full lines, so, I am unable to assess her voice naturally. It is often covered up with autotune, and very short and of the moments she got to sing, it didn't leave a long lasting impression, so it didn't overall have any appeal to me. But I respect her voice and the quality ofd it, it is just not what I prefer. But from the Produce 48 show, she has shown more of her voice, which is very nice and pleasant, and sweet, and honey like, but a very common voice in the Kpop industry, so it didn't really have an effect on me, but it was still a good voice nonetheless. It just didn't stand out. Aisha She isn't a vocalist, but I sense that if she was given the chance she would be a good singer with a deep and rap influenced voice that has a lot of sass and confidence, like she does when she raps. I think she would be able to deliver that in her singing as well and make a really cool and unique voice. Bold and powerful with a bit of rap style into it. It would make for a one of a kind voice, one that is similar to Lisa’s. EU She is also not a vocalist, but from the few moments she has singed, and rapped a bit, in Bon Bon Chocolat, it sound that she had a really nice voice when paired with a bit of autotune and rap style and she could also make a good potential vocalist, but she probably suited more for rapping, as her voice is made for rapping. I will just ran them by numbers because if I was to write a response for each of them, it would take forever. So, I am sorry if this is not what you expected. Rap EUAishaOdnaYerinThe reason I chose Yerin as the fourth rank because although she is a signer, she has the poetical to be a rapper her voice is very sweet and innocent, but I think she can also use that voice to her advantage, and be suited for a rap, which would really make for a cute rap from her. Sihyun Although again, she is not a singer, she can also rap pretty well, from the performance of her rapping a bit in Rumor. She has good power and strength in her voice, and can be able to execute it well. But I cannot completely assess her because if the small part from her and I think her voice is suited for singing, although I think she can achieve both. Mia She is not a rapper, and although she could they out rap. I think singing suits her kore. But if she haver did rap, I wouldn't mind. Dance MiaAishaYerinSihyunEUOdnaStage presence MiaYerinSihyunAishaEUOdnaVisuals All of themI honestly think all of them are beautiful in their own way, and I don't really have any preferences when it comes to beauty. Although I might more naturally attracted to a person than another, beauty was never a big part my preference towards them, but rather their personality, and their character, and their passion and dedication to music. I don't know them all very well, so that might be why I don't have any preferences to to them in terms of beauty, because beauty is not a criteria when being attracted to someone. It just naturally comes to me, and I just fall in love with them more through their personality and attributes. I believe beauty shouldn't be ranked or compared, and i think they are all different, and how could I compare something that is different, especially if I don't have any standards of my own to based it off of. Different, is not bad. It is a good quality to us that gives us our individual and unique beauty. ",
            "date": "Answered October 7, 2020",
            "views": "180",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lisa Johnson",
                    "user_href": "/profile/Lisa-Johnson-2278"
                }
            ]
        }
    ]
}