{
    "title": "How much does a kpop star earn? - Quora",
    "tags": [
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Mbajiaku",
                "href": "/profile/George-Mbajiaku"
            },
            "answer_text": "It’s actually pretty amazing… The average earnings of kpop stars is different depending on their debut ratings and performance. As at 2014, To most Westerners, the world of K-pop stars (especially the dudes) looks understandably ridiculous. But hey, we don’t judge people on looks and cultural differences. Instead, we judge them by how much money they make — and damn, we never could have guessed that ultra-feminine boys in eyeliner made this much money!!! The three major K-pop labels — SM Entertainment, YG Entertainment, and JYP Entertainment — have reported record profits this year. Their clients are the hottest K-pop groups out right now and they each made this much in the first half of 2014: SUPERJUNIOR — $28,491,105.00 GIRLS’ GENERATION — $27,796,200.00 BIG BANG — $26,985,594.00 This was just at 2014! And they’ve been of the charts as of recent. Then we have the upcoming, AOA, EXO, BTS…. who I think are the underpaid and over-worked category. They seem to be doing quite well, from their debut till now…. and don’t get the returns they deserve. Let’s support them, and make sure that they know their entertainment is enjoyed. Then we have the kinda broke groups that signed up with broke companies…. groups like VIXX, that make as low as $5000–$10000 have a long way to go to hit that jackpot. So it depends on the entertainment company, and how talented the KPOP groups are. Just search on Hyoyeon dance compilation…. then google other low budget kpop groups, you’ll see why she earns what she earns. ",
            "date": "Answered May 13, 2017",
            "views": "79",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cookie Jar",
                    "user_href": "/profile/Cookie-Jar-21"
                },
                {
                    "user_id": "Helena Rachel",
                    "user_href": "/profile/Helena-Rachel"
                },
                {
                    "user_id": "Aika Sekine",
                    "user_href": "/profile/Aika-Sekine"
                },
                {
                    "user_id": "Rebecca Rodriquez",
                    "user_href": "/profile/Rebecca-Rodriquez"
                },
                {
                    "user_id": "Sanjushree Dhara",
                    "user_href": "/profile/Sanjushree-Dhara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erica Won",
                "href": "/profile/Erica-Won-2"
            },
            "answer_text": "Yes. But I’ve learned that very few idols make money solely from music unless the artist/group is as big as G-Dragon or TVXQ etc. Most idols make money from endorsements or other commercial activities. That is, you need to be popular among general audience who don’t listen to pop music often. It also explains the importance of exposure in variety show and drama. The average active period of an K-pop idol is less then 4 years (according to a book written by a Korean music producer). For the first 2 years after debut, idols are basically just paying back their debt to the companies. From the 3rd year on, you need to make yourself famous among general audience so that you can earn some extra money. Failing to gain the public recognition within 3 years could mean the end of idol career. Being a K-pop idol is at best like a showcase that leads to other professions, such as acting, hosting, music production, or operating entertainment business. Very few become successful solo singers. ",
            "date": "Answered December 28, 2017",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ari Chen",
                    "user_href": "/profile/Ari-Chen-7"
                },
                {
                    "user_id": "Queen Of Llamas",
                    "user_href": "/profile/Queen-Of-Llamas"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Brit-Whit-1"
                },
                {
                    "user_id": "Nikka Gines",
                    "user_href": "/profile/Nikka-Gines"
                }
            ]
        }
    ]
}