{
    "title": "How would you rate my voice with this song? - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arnaly Arriaga",
                "href": "/profile/Arnaly-Arriaga"
            },
            "answer_text": "I will give you the answer that I wish someone had given me when I was your age. I was always told I sang beautifully but in reality, most of the times I sang out of tune. It was only after growing up, becoming a musician and recording myself many times that I realized how out of tune I was most of the times. Not always, but many times. The good news is that with a lot of training I was able to change that. You have a beautiful and powerful voice but that is not enough. You need to work your support system in order to sustain the notes and support that beautiful voice. Otherwise, you will sound out of tune and you don’t want that. You need to do breathing exercises and record yourself a lot. If you don’t like what you hear is because it is not right, so keep working. Find yourself a voice coach and learn music. Discipline yourself to work on your breathing every morning before you do anything else. Exercise. Dancing is a great way to strengthen your voice. Aerobics exercises are great to strengthen your diaphragm and, in consequence, your voice. You have a lot of work to do. The good news is that with enough support and hard work, you will sing in tune and you have a beautiful tone of voice. The even better piece of news is that you are young enough to fix any issues with your singing. In fact, I have seen videos of Christina Aguilera singing when she was really young and she was singing quite out of tune. Look at how far she made it. So, go for it, work out, exercise, look for a voice coach and learn music. You have all the time in the world to do it. No pain, no gain, so good luck! ",
            "date": "Answered December 10, 2018",
            "views": "225",
            "upvotes": " Answer requested by Mia Jane"
        },
        {
            "author_info": {
                "name": "Zoltan Temesvari",
                "href": "/profile/Zoltan-Temesvari"
            },
            "answer_text": "Couple of advices. You are way too young, you must learn a lot before anyone can “rate” your voice. Currently it is out of tune and you have basically no range. This could all be improved.Stop practicing pop songs, you have to learn the basics and then study easier classical pieces.Join the school choir.Ask your school music teacher for advice how to improve your voice and whether you have talent at all. You have to brutally honest with yourself.Remember, singing is fun and life-enhancer, even you eventually not becoming a singer, you can (and have to) sing!",
            "date": "Answered December 12, 2018",
            "views": "90",
            "upvotes": "0"
        }
    ]
}