{
    "title": "How do music producers get recording artists to use their background tracks? - Quora",
    "tags": [
        "Music Producers",
        "Music Recording"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Horton",
                "href": "/profile/Scott-Horton"
            },
            "answer_text": "Mostly it is about connections - if they never hear your tracks they can't consider using them. Be active with social networking and real life networking, start working with some smaller artists around town and hopefully as they grow, your name grows as well and exposes the tracks to a broader audience. Search Twitter looking for artists searching for tracks and contact them. Consider making contacts with local studios and there a numerous websites that exist on which you can sell or license your tracks. If you make quality tracks and work hard at exposing them, people will take notice. ",
            "date": "Answered August 20, 2010",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Lovell",
                "href": "/profile/Dave-Lovell"
            },
            "answer_text": "This answer applies to vocalists only.                                                                                              1.   Make friends with a Song Writer.  Tell him you will sing one of his tunes with no obligation.2.   Work togather to get the best recording possible.  Help pay for some of the expenses.3.   Populate as many web sites as possible with your new mp3 release.4.   Write the lyrics with the chords and post it on ultimateguitar.com and other web sites.5.   Shoot a video using the recording as the audio.  Do not try to sing it live.6.   Post the video on youtube.7.   Promote your release thru social networking.8.   Contact Dave Lovell.  He may have a song for you.  davelovellshow.com ",
            "date": "Answered November 4, 2011",
            "views": "341",
            "upvotes": "0"
        }
    ]
}