{
    "title": "How to get into Berklee College of Music - Quora",
    "tags": [
        "School Of Music",
        "Berklee College of Music",
        "Graduate School Education",
        "Schools",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "T. Sharron",
                "href": "/profile/T-Sharron"
            },
            "answer_text": "The process for an international student is a little more tedious with applications and visas and such, but in general, you go through the application process and then set up an audition in one of their stations worldwide. You can also go to the Boston campus if possible. There’s an actual instrument-based audition where you play a prepared piece or an original composition, and then you do a few other tests so they can assess where you’re at. After that you do a sit-down interview with a representative where they just ask you some questions…as far as I remember, there wasn’t any psychological trickiness; just questions about your musical life and why you want to attend Berklee. All the finer details are outlined in the application process material. At the end of it all, if they see potential and promise in you, or you just blow them away (or both), then you’ll most likely be accepted! ",
            "date": "Answered April 11, 2017",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kaushal Maru",
                    "user_href": "/profile/Kaushal-Maru-3"
                },
                {
                    "user_id": "Nikhar Jain",
                    "user_href": "/profile/Nikhar-Jain-13"
                },
                {
                    "user_id": "Nader Hanna",
                    "user_href": "/profile/Nader-Hanna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isis Alava",
                "href": "/profile/Isis-Alava"
            },
            "answer_text": "There are several things to take into consideration. First, do you play an instrument, second, Berklee will want to see if you have some type of talent with music. When you go for the audition, they will test your skills through a series of them clapping a rhythm and you clapping back the exact rhythm. After this comes sight reading which you do not need to be the best at but it is beneficial so you will not have to take and pay extra courses while in Berklee since Berklee is already a very expensive school. This is a very general layout but if you have any other questions feel free to ask :) ",
            "date": "Answered July 10, 2018",
            "views": "768",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kaushal Maru",
                    "user_href": "/profile/Kaushal-Maru-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ask Darcie",
                "href": "/profile/Ask-Darcie-2"
            },
            "answer_text": "The first thing to do is to be very gifted on your instrument or as a vocalist and if you are a songwriter, producer, and/or have great potential and dreams of a career in music business, music ed, film or game scoring, or music therapy, even better! Be really good - that’s number one. Then, apply! Berklee College of Music They often audition all over the world so find out when Berklee is going to be near you but first you have to apply. ",
            "date": "Answered November 7, 2018",
            "views": "470",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vidhi Biltheria",
                    "user_href": "/profile/Vidhi-Biltheria"
                },
                {
                    "user_id": "Kaushal Maru",
                    "user_href": "/profile/Kaushal-Maru-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Keogh",
                "href": "/profile/Patrick-Keogh-11"
            },
            "answer_text": "It’s not too hard to get in to Berklee actually. You fill out the admission forms of course and then you’ll get your audition. If they think you’re good enough, you’re in.You should know that the program is very intense. I don’t remember a single party. It was constant never ending huge amounts of work! Classwork needs a lot of participation and homework is heavy. Then you’re required to join performance groups and go to nightly concerts. So, while it’s not tough to get in if they think you have talent, it’s very hard to STAY in! You really need to be devoted. I hope that helps. Go knock ’em dead! ",
            "date": "Answered October 17, 2017",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Grace",
                    "user_href": "/profile/Samuel-Grace-9"
                },
                {
                    "user_id": "Aaira Madaan",
                    "user_href": "/profile/Aaira-Madaan"
                },
                {
                    "user_id": "Ruchuskd",
                    "user_href": "/profile/Ruchuskd"
                },
                {
                    "user_id": "Tejas Joshi",
                    "user_href": "/profile/Tejas-Joshi-144"
                },
                {
                    "user_id": "Kaushal Maru",
                    "user_href": "/profile/Kaushal-Maru-3"
                },
                {
                    "user_id": "Swati Sharma",
                    "user_href": "/profile/Swati-Sharma-1595"
                },
                {
                    "user_id": "Nikhar Jain",
                    "user_href": "/profile/Nikhar-Jain-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Fox",
                "href": "/profile/Michael-Fox-188"
            },
            "answer_text": "Hi! I hope you won’t mind terribly if I drop links to previous answers I’ve provided to your question and one closely related to it. These answers are not the final or only correct ones by any means - but they are true to my experience, and I stand by them! Be sure to always enjoy and respect the music no matter where or how you end up developing your musical art! Michael Fox's answer to How did you get into Berklee? Michael Fox's answer to How can I figure out which major in music I should focus on? ",
            "date": "Answered September 21, 2017",
            "views": "835",
            "upvotes": "0"
        }
    ]
}