{
    "title": "How does Stephen Hawking's voice synthesizer work? - Quora",
    "tags": [
        "Computer Speech",
        "Synthesizers",
        "Stephen Hawking",
        "Physicists",
        "Astrophysics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganesh Subramaniam",
                "href": "/profile/Ganesh-Subramaniam-2"
            },
            "answer_text": "Stephen Hawking’s speech system has been released by Intel as open-source code. The company is hoping that developers will tinker with it and expand its application to a wider range of disabilities. The Assistive Context-Aware Toolkit (ACAT) gives differently abled users the opportunity to use computers with very little movement, and was developed to help Hawking, who has amyotrophic lateral sclerosis (ALS) communicate by translating his facial movements into text. The technology is made up of three parts: the input from an infrared sensor or webcam that detects facial movements, the interface that selects letters to form words, and the autocomplete-like software that predicts what the user is typing. The software’s virtual keyboard can also be used to select and utilize different programs, and browse the internet.  The software is only available for PCs.  The software and the user guide — which includes advanced navigation techniques — can be found on Github. 01org/acat   Here's how Hawking himself describes the system -  Since 1997, my computer-based communication system has been sponsored and provided by Intel® Corporation. A tablet computer mounted on the arm of my wheelchair is powered by my wheelchair batteries, although the tablets internal battery will keep the computer running if necessary. My main interface to the computer is through a program called EZ Keys, written by Words Plus Inc. This provides a software keyboard on the screen. A cursor automatically scans across this keyboard by row or by column. I can select a character by moving my cheek to stop the cursor. My cheek movement is detected by an infrared switch that is mounted on my spectacles. This switch is my only interface with the computer. EZ Keys includes a word prediction algorithm, so I usually only have to type the first couple of characters before I can select the whole word. When I have built up a sentence, I can send it to my speech synthesizer. I use a separate hardware synthesizer, made by Speech+. It is the best I have heard, although it gives me an  accent that has been described variously as Scandinavian, American or Scottish. Through EZ Keys I can also control the mouse in Windows. This allows me to operate my whole computer. I can check my email using the Eudora email client, surf the internet using Firefox, or write lectures using Notepad. My latest computer from Intel, based on an Intel® Core™ i7 Processor and Intel® Solid-State Drive 520 Series, also contains a webcam which I use with Skype to keep in touch with my friends. I can express a lot through my facial expressions to those who know me well. I can also give lectures. I write the lecture beforehand and save it on disk. I can then send it to the speech synthesizer a sentence at a time using the Equalizer software written by Words Plus. It works quite well and I can try out the lecture and polish it before I give it.  Current configuration  (there may be updates)  Lenovo ThinkPad X220 Tablet (2 copies)  Intel® Core™ i7-2620M CPU @ 2.7GHz   Intel® 150Gb Solid-State Drive 520 Series  Windows 7  Speech Synthesizers (3 copies):  Manufacturer - Speech Plus (Incorporated 1988, Mountain View, CA)  Model - CallText 5010 Stephen Hawking - Home  ",
            "date": "Answered December 23, 2015",
            "views": "974",
            "upvotes": " View 63 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jason Snyder",
                    "user_href": "/profile/Jason-Snyder-39"
                },
                {
                    "user_id": "Shubham Jadhavar",
                    "user_href": "/profile/Shubham-Jadhavar-4"
                },
                {
                    "user_id": "Gary Taylor",
                    "user_href": "/profile/Gary-Taylor-54"
                },
                {
                    "user_id": "Nick Kaur",
                    "user_href": "/profile/Nick-Kaur"
                },
                {
                    "user_id": "Annie Ranchana R",
                    "user_href": "/profile/Annie-Ranchana-R"
                },
                {
                    "user_id": "Tayyab Tahir",
                    "user_href": "/profile/Tayyab-Tahir-16"
                },
                {
                    "user_id": "Kushal Salecha",
                    "user_href": "/profile/Kushal-Salecha"
                },
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                },
                {
                    "user_id": "Mk",
                    "user_href": "/profile/Mk-691"
                },
                {
                    "user_id": "Vatsal Mishra",
                    "user_href": "/profile/Vatsal-Mishra-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Van In",
                "href": "/profile/Michael-Van-In"
            },
            "answer_text": "STEPHEN HAWKING FIRST met Gordon Moore, the co-founder of Intel, at a conference in 1997. Moore noticed that Hawking’s computer, which he used to communicate, had an AMD processor and asked him if he preferred instead a “real computer” with an Intel micro-processor. Intel has been providing Hawking with customized PCs and technical support since then, replacing his computer every two years. (The above is the opening paragraph from an article in wired.com) Hawking’s speech synthesizer is a predictive-word processor especially developed for him by a team of five Intel engineers. The solutions that the team have developed over the years have had to accommodate the particular requirements that Hawking has, not the least being that he is an elderly man who does not adapt easily to using some of the technology and also that he has long-held preferences for some of the features of earlier systems that he used. The most severe limitation is that his interface consists of the equivalent of a single-key keyboard - which he activates by tensing a muscle in his cheek. The computer system scans through a list of characters and options and Hawking tenses his cheek muscle to select the character or operation currently being scanned. One can only imagine the patience that this practice requires! As words are spelled out, the system begins to predict what a following word might be. Since this is Stephen Hawking, if he spells out “the”, then the system predicts “black” as the next word. If “black” is selected as correct (instead of him ignoring it and beginning to type a different word), then the system selects “hole” as the word after that. Here is a photo showing the cheek-muscle sensor which is attached to the frame of his spectacles. Naturally, movements like chewing will trigger random responses.  The Intel team has tested other interfaces in attempts to process a wider range of inputs. For example, eye movement and tracking. Unfortunately, Hawking’s eyelids droop too frequently for such an interface to work practically. For the story of how the system and software have been under regular development, here is a very interesting article from Wired magazine: How Intel Gave Stephen Hawking a Voice ",
            "date": "Answered July 3, 2016",
            "views": "548",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Jo Buchanan",
                    "user_href": "/profile/Amy-Jo-Buchanan-4"
                },
                {
                    "user_id": "K. Colin",
                    "user_href": "/profile/K-Colin"
                },
                {
                    "user_id": "Tech Toread",
                    "user_href": "/profile/Tech-Toread"
                },
                {
                    "user_id": "René Moreau",
                    "user_href": "/profile/René-Moreau"
                },
                {
                    "user_id": "Usha Nayak",
                    "user_href": "/profile/Usha-Nayak-5"
                },
                {
                    "user_id": "Chockle Cheung",
                    "user_href": "/profile/Chockle-Cheung"
                },
                {
                    "user_id": "Josh Bradbury",
                    "user_href": "/profile/Josh-Bradbury-3"
                },
                {
                    "user_id": "Xansos",
                    "user_href": "/profile/Xansos"
                },
                {
                    "user_id": "BethAnn Pearce-Davis",
                    "user_href": "/profile/BethAnn-Pearce-Davis"
                },
                {
                    "user_id": "Erkus Dahlénus",
                    "user_href": "/profile/Erkus-Dahlénus"
                }
            ]
        }
    ]
}