{
    "title": "How does the Musical.ly app deal with music copyright and the music industry? - Quora",
    "tags": [
        "Copyright Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alain Souloumiac",
                "href": "/profile/Alain-Souloumiac-1"
            },
            "answer_text": "Music stealing and plagiarism are extended. For a long time, music plagiarism has been protected by national borders. In many countries, national idols would translate and sing the Beatles without serving any return to the creators. A deep gap now separate creators from their creation through a multitude of third party contracts. “Rightful Return” is needed. In the Global Music Report 2017, the Community of Musicians denounces the ‘value gap’ whose creators are victims. Most of the music is free (stolen). Africa, who created most of world music, only receives 1,4% of the poor royalties which is allocated to the world musicians. To put and end to this situation, A World Creation Capital for Music & Dance is being created in Enugu. Several institutions have been designed to protect authentic music, promote original creation, solve disputes, value smart contracts… musical.ly should take contact with Dick Van Gelder, one of the main leaders of the project. ",
            "date": "Answered January 27, 2018",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sagar Jaid",
                    "user_href": "/profile/Sagar-Jaid-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trudy Newell",
                "href": "/profile/Trudy-Newell"
            },
            "answer_text": "Musically app only uses licensed music. But most (unsure about musically in this instance) streaming services pay 0.1 cents per six seconds of your song, so most are not dealing fairly with copyright owners. and apparently it's kinda hard to get paid somet and to get audits of where your songs are streamed. ",
            "date": "Answered January 20, 2017",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tong Lu",
                    "user_href": "/profile/Tong-Lu-22"
                },
                {
                    "user_id": "Nadav Shmuely",
                    "user_href": "/profile/Nadav-Shmuely-2"
                }
            ]
        }
    ]
}