{
    "title": "How do some YouTubers keep uploading football and TV clips without copyrights infringement issues? - Quora",
    "tags": [
        "Video Clips",
        "Video Uploads",
        "Copyright Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Jay",
                "href": "/profile/Andrew-Jay-4"
            },
            "answer_text": "As a rule, they don't. Most are uploaded, and within days are removed. Most of the sports leagues have developed sophisticated mechanisms to detect and remove it. If you can find a way to avoid these detection mechanisms, you've cleared one hurdle. When people see your videos, and if they think you've violated copyright, they can report you. That's the second hurdle: you'll have to prove you have ownership of copyright to the video you uploaded. Here's the problem, and I've been a victim and a victor in this area: If you have an amateur recording of, say, a martial arts school event who is playing Van Halen's Jump as part of their background music, then Jump will be playing in the background of your video. If you uploaded that video to YT, you can get slapped with a CR violation. Even if the martial art school has a right to use that music. (Which was my case). Even if your video was for personal use. (Which was my case). You are nevertheless in violation of CR law. And yet, you see professional sports clips being uploaded all the time. Of course, many people do this because they get the AdSense revenue from this, and sports leagues are keen to this loss. Sometimes, the videos posted are amateur iPhone or Android clips. These are the obvious things, and generally, you are allowed to post that video. (Unless, the arena you entered has a \"no video production\" notice!) Sometimes, if you downloaded a video from a device that records from analog reception (rare these days, as most people pipe their TV watching from DSL and cable), these just miss the detection software that the sports leagues use. It's just a matter of time (sometimes never) before someone reports this. I don't know what the laws are here, or what the copyright statement is on analog recorded production of a pro sports league event; my guess is that they demand no recording. In any case, detecting analog recording of a production is difficult. Two people can record the same thing and the resulting video will be different from a bits and bytes perspective - the very perspective that the auto detection software uses to find such violations. Sometimes, companies do actually get permission to upload a copyrighted video. This is rare. But, say you are an advertisement agency who wants to advertise for a product. By associating a football game 3-second clip with your product, you think you might get people to watch your advertisement because of the clip. Either the clip is embedded in your own video, or, your products are the only products advertised during the clip of the copyrighted pro clip. In this arrangement, the lawyers on both sides of the table might agree to something like this: we'll let you use a particular clip up to 3 seconds for no more than 30 days, as long as you pay us $1000 to use that clip. You hope to gain more than $1000 in revenue for your product. The particulars will vary, of course: you'll never get to use a video clip of a questionable Superbowl touchdown, but, a beginning-of-the-season tackle might be more negotiable. As a rule, though, people who publish clips are violating CR, and will eventually get caught. Most of the time, they do. You are seeing only those who haven't gotten caught yet. Go ahead and check the upload date: it was probably very recent. And now see how long that video stays up. Usually, it's gone in a week or two. If you think it's rampant (that copyrighted videos are up), what you aren't seeing are the massive amounts of videos that are taken down, which makes what you see pale in comparison. ",
            "date": "Updated January 29, 2020",
            "views": "739",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diego Romo",
                    "user_href": "/profile/Diego-Romo-8"
                },
                {
                    "user_id": "Amr Ibrahim",
                    "user_href": "/profile/Amr-Ibrahim-60"
                },
                {
                    "user_id": "Josh Saul",
                    "user_href": "/profile/Josh-Saul-10"
                },
                {
                    "user_id": "Andrew Tanoto",
                    "user_href": "/profile/Andrew-Tanoto-1"
                },
                {
                    "user_id": "Zero Plus",
                    "user_href": "/profile/Zero-Plus-5"
                },
                {
                    "user_id": "Dương Nhật Nguyên",
                    "user_href": "/profile/Dương-Nhật-Nguyên"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jjang-Jjang-man-Bbong-Bong"
                },
                {
                    "user_id": "Mohamed Rasnatt",
                    "user_href": "/profile/Mohamed-Rasnatt"
                },
                {
                    "user_id": "Robert Cleworth",
                    "user_href": "/profile/Robert-Cleworth"
                },
                {
                    "user_id": "Salman Ali",
                    "user_href": "/profile/Salman-Ali-1218"
                }
            ]
        },
        {
            "author_info": {
                "name": "Huseyin Aksu",
                "href": "/profile/Huseyin-Aksu"
            },
            "answer_text": "This is not an easy thing to do without getting in trouble or facing some kind of repercussion(s) from YouTube/Premier League. I have thoroughly researched and tested these things personally numerous times the past few years. Here are some tips that will increase your chances of you not getting in trouble. Regardless of what you do, anybody/any company can report your video, ask YouTube/you to take it down, ask you for money or take you to court—even if you are doing absolutely nothing wrong! Only thing you can do is to educate yourself and do your best to minimize the chance of any of these awful things from happening. People have gotten videos taken down and their channels terminated for no reason at all :( You want to do your best to avoid YouTube’s content ID system that will automatically claim your video. You also want to avoid Premier League from taking any action towards your video or your channel. Try to do these things: Make sure your video falls under Fair UseUse as few clips as possible, edit the heck out of them, chop them up, slow them down, speed them up, make them bigger/smaller, move them around, zoom in/out of them, change the colors, add effects to make it look different, reverse some clips, remove/edit the audio, add graphics over the footage, crop the clips, rotate/mirror/flip the clips, add commentary audio over it, add a small video of you on top of it… Do whatever you can so YouTube won’t automatically Content ID your video. If your entire video is going to be Premier League Highlights, then this will become much more difficult to accomplish.Get Premier League’s permission to use clips (slim chance they will let you or even respond)Give Premier League proper credit and a link in the descriptionAn alternate is to just upload these videos to Facebook as it’s much more lenient and they have no Content ID automated system accept for audio. I applied these tips to my video and it didn’t get claimed automatically nor later on by the NFL:  ",
            "date": "Answered June 17, 2017",
            "views": "987",
            "upvotes": " View 77 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fayzullo Isroilov",
                    "user_href": "/profile/Fayzullo-Isroilov"
                },
                {
                    "user_id": "Jamal Lachguar",
                    "user_href": "/profile/Jamal-Lachguar"
                },
                {
                    "user_id": "Juggle It",
                    "user_href": "/profile/Juggle-It"
                },
                {
                    "user_id": "Andi Bunari",
                    "user_href": "/profile/Andi-Bunari-1"
                },
                {
                    "user_id": "Tejan Kamara",
                    "user_href": "/profile/Tejan-Kamara-7"
                },
                {
                    "user_id": "Vysakh Puthiyedath",
                    "user_href": "/profile/Vysakh-Puthiyedath"
                },
                {
                    "user_id": "Pawan Sharma",
                    "user_href": "/profile/Pawan-Sharma-609"
                },
                {
                    "user_id": "Dương Nhật Nguyên",
                    "user_href": "/profile/Dương-Nhật-Nguyên"
                },
                {
                    "user_id": "Albion Noronha",
                    "user_href": "/profile/Albion-Noronha"
                },
                {
                    "user_id": "Behzad Hameed",
                    "user_href": "/profile/Behzad-Hameed"
                }
            ]
        }
    ]
}