{
    "title": "How do Squier guitars compare with Fenders? - Quora",
    "tags": [
        "Guitars",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean McAleavy",
                "href": "/profile/Sean-McAleavy"
            },
            "answer_text": "The difference would be most noticeable in the hardware. That being tuning pegs, the bridge and nut and the electronics, as in the pickups, pots and switches. There is no mistaking a well made fender with a squire. But having said that, not all fenders are well made. And there is a difference between squires among themselves. As far as I can tell, I think the different levels of quality has a lot to do with what part of the world it was made in. Sadly, not very many american brands are made in America anymore. Not that america has any special magic formula when it comes to building guitars. That would be ridiculous to think that. I say sadly mainly because the outsourcing of manufacturing is indicative of how the world now works, with multi national corporations pulling the the strings, making the rules and generally standing on the necks of the working class and dancing on the backs of the impoverished. But that is a discussion for another place. I don't know if Japan produces squires, but the Japanese have a very good and well earned reputation as luthiers. As far as the Squires that I have personally picked up and played, the ones from Mexico or Korea seem, to me, to be of a better quality. I recently bought a short scale Jaguar bass that was made in Indonesia that I really like. With some hardware improvements it is possible I would even love it. The worse squires I have played have come from China. And with saying worse I really have to add that in this day and age, cheap and crappy guitars are leaps and bounds better than the cheap and crappy guitars of yesteryear. When I was a kid $150 got you an unplayable, untunable, unfortunate piece of junk that would better serve as a wheel chock. That same amount to day can get you a very playable and usable instrument that you can really learn on and play for years. It's true. So if your asking this question because you are looking to get a guitar to learn on, then there is a thing or two to consider. First one is this, if somebody else is paying for it, like a Grandparent or Aunt/Uncle or a guilt ridden divorced Parent. Then let them spring for the Fender. But if you are paying for it, a fender is damn expensive, so you want to be sure your commitment to actually learning how to play is solid before shelling out the big bucks. But if your commitment may be a bit shaky or, if you are like most of us, and simply can't afford to spend that much money, then by all means get a squire and wear it proudly. The learning curve will be no different whatsoever, and it will get you from point A to point B just exactly the same. Regardless of what you decide on it is always a good bet to get the salesman to agree to throw in a free setup with the purchase. A proper setup is the difference between night and day on any guitar, regardless of price or reputation. ",
            "date": "Answered April 11, 2016",
            "views": "482",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barnaby Yeh",
                    "user_href": "/profile/Barnaby-Yeh"
                },
                {
                    "user_id": "Chris Moore",
                    "user_href": "/profile/Chris-Moore-1537"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Martin",
                "href": "/profile/Charlie-Martin-27"
            },
            "answer_text": "When I answered this question, it was phrased: “What is the difference between a square and a fender?”. I naturally assumed this individual was struggling to make sense of a language that is full of homonyms and contradictions. I felt this would be an ideal opportunity to provide assistance….. Try to visualize this in your mind: imagine four lines of exactly equal length, which are connected to each other in such a manner that there are four corners and each of the corners has an angle of exactly 90 degrees. Can you picture that? It looks like a box, doesn’t it? That is what is known as “a square” in the branch of mathematics known as Geometry. Now, picture an automobile in your mind. The sections of the car’s body that encase each of the four wheels are known as “fenders”. They may be manufactured of metal, fiberglass, or some other type of material that can be molded to accommodate the wide, circular shape of the wheels when they have tires on them. I’m sure you’ve heard the slang expression “fender-bender”. Yes? That term is used to refer to an automobile accident of typically mild proportions, in which there is minimal body damage, like a fender, hence the name. As you can readily see, there is no real connection or similarity between a square and a fender. It is possible, that a fender might be manufactured in the shape of a square, but this is highly unlikely. I hope these explanations enable you to develop a clearer understanding of our, at times, puzzling language. Please tune in next week when we will discuss the Main Differences Between A Circle and A Bumper. ",
            "date": "Answered October 18, 2019",
            "views": "457",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Martin",
                    "user_href": "/profile/Michael-Martin-48"
                },
                {
                    "user_id": "Alfred Toledo",
                    "user_href": "/profile/Alfred-Toledo"
                },
                {
                    "user_id": "William Griffith",
                    "user_href": "/profile/William-Griffith-32"
                }
            ]
        }
    ]
}