{
    "title": "How to know when my crush likes me back - Quora",
    "tags": [
        "Dealing with Crushes",
        "Crushes",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diptabrata Mukherjee",
                "href": "/profile/Diptabrata-Mukherjee-1"
            },
            "answer_text": "Eyes are the key to one's soul. Eyes are everything and anything to look in a person. They can tell you almost every detail about a person's likings. If you are a good observant you must have known it by now, if not I will be your guide. You always tend to find them staring at you. Sometimes when get caught they tend to turn away their face and sometimes with a smile?Whenever you are having conversations with them, look very carefully at the eye. The pupil shall tend to get dilated, It's complete science that pupils tend to get dilated on attractiveness.On the other hand, do they always avoid looking at you, no matter what? Not looking at someone might mean they're trying to keep their crush secret and don't want you to know.Get a trusted friend to look at them during class or at recess; have the friend see whether your crush looks at you, and for how long. If they're constantly staring in your direction for minutes at a time, they're really crushing hard.Notice what information they give you. Do they ever tell you about something special they're doing, such as reading a book or playing a sport, out of the blue? Does He/She tell you secrets and random stories about their day? They might be trying to impress you. Do they give you semi-personal information when you didn't ask for it? Giving people personal information is a sign that they trust you or want you to give them personal information back.Do they talk about their family, their ex, or about the past? These topics are all things people are usually pretty guarded about. If your crush is letting you in on them, it may be a sign.Notice how often they're around you. Does it seem that they make it a point to happen to be near you or walk back and forth in front of you? Then it means that they are trying to get your attention, but in a very discreet way. Does their voice get louder when they're talking to other people around you? It could be a sign that they want you to listen or pay attention to them.Do they make little excuses to be around you? Do they ask you for the homework problems, or sit next to you in class, or pick you to be on their team for recess sports? It could mean something!Pay attention to physical contact. Whether or not it's conscious, someone who likes you will generally find excuses to touch you. They might put their hand on your shoulder, or accidentally walk into you in the halls, or wipe something random off your face.Do they tickle you or tease with their hands? Do they throw random things at you in an effort to get your attention?The final one: If you find each other asking to watch their favourites. Trust me. ",
            "date": "Updated June 2, 2018",
            "views": "2792",
            "upvotes": " View 785 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Srishti Singh",
                    "user_href": "/profile/Srishti-Singh-890"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ZIYA-SHIV-PANDEY"
                },
                {
                    "user_id": "Jerry Foo",
                    "user_href": "/profile/Jerry-Foo-3"
                },
                {
                    "user_id": "Sam Law",
                    "user_href": "/profile/Sam-Law-196"
                },
                {
                    "user_id": "Sreenali Hasnu",
                    "user_href": "/profile/Sreenali-Hasnu"
                },
                {
                    "user_id": "Devin Lidberg",
                    "user_href": "/profile/Devin-Lidberg"
                },
                {
                    "user_id": "Cassie Brode",
                    "user_href": "/profile/Cassie-Brode"
                },
                {
                    "user_id": "Rafique Mufasa Basics",
                    "user_href": "/profile/Rafique-Mufasa-Basics"
                },
                {
                    "user_id": "Rajat Verma",
                    "user_href": "/profile/Rajat-Verma-885"
                },
                {
                    "user_id": "Natalie Richard",
                    "user_href": "/profile/Natalie-Richard-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kolby Sack",
                "href": "/profile/Kolby-Sack-1"
            },
            "answer_text": "Fortunately for you, there are many indications that would suggest your crush likes you back. The challenging part is catching onto the subtle hints that they will subconsciously give you. Let’s start with the obvious ones. They smile when you are talking to them, or see you from a distance (either one). Inevitably, if this person likes you, you’ll be able to make them truly smile. We’re talking teeth here. Bonus for you if you are naturally witty/sarcastic/easygoing.In the beginning of your interactions with each other, your crush will naturally agree with most of your opinions. If you state an opinion that they absolutely don’t agree with, they will disagree in a lighthearted and joking manner.They will want to talk to you, and they will find ways to do just that, and I mean going out of their way to approach you in person or online. This one is harder to spot depending on the situation, but if they’re going out of their way to talk to you with no apparent reason, that’s a clear sign.They will remember things you said. After some time of getting to know you, they will remember little details. You will know when this happens because it will pleasantly surprise you.A big one! They ask details about you. When speaking with each other, they will ask you deeper questions than someone who isn’t interested, because they are actively searching for ways to connect with you. For example: What do you do for a living? What kind of music/movies do you like?Those are just a few major signs I look for. Now for the more challenging, sometimes subconscious and very important indicators: body language. I say subconscious because they will do this without even realizing it, and some of them take a while to catch onto. Eye contact. Big one! If this person really likes you, they will look at you. If they are shy, you might catch them from a distance looking, and they’ll look away quickly. If this person happens to be rather confident, they will hold it slightly past the “look away” moment.Mirroring. If you are standing towards them with your hands on your hips, they will place their hands on their own hips. Touch your hair, they will touch theirs. Bonus: if you both are drinking something, take a sip. If they're interested, they will most likely do the same.Oh yes, the classic eyebrow raise. This one is subtle, so watch closely! You will catch it only in the first millisecond you see them. If attracted to you, they will slightly raise their eyebrows when eye contact is made. A completely involuntary move, so that is a beneficial indicator.“Fixing” themselves up. During conversation, they are nervous and fidgety. Their movements will gravitate towards smoothing out their shirt, messing with their hair, fixing their glasses. Anything that involves straightening out their appearance.Their feet point towards you. Another deeply subconscious indicator. If this person is into you, their feet will point towards you naturally. They may not be completely facing you, just pay attention to the feet. That’s the body saying, “I want to face this person!”I tried to pick out clear indicators that could be interchangeable between male and females, and also between different personalities. The major takeaway: if you get a gut feeling they like you, I would trust that gut feeling. Good luck to you! ",
            "date": "Updated January 19, 2020",
            "views": "901",
            "upvotes": " View 383 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kennedy Austin",
                    "user_href": "/profile/Kennedy-Austin-14"
                },
                {
                    "user_id": "Sreenali Hasnu",
                    "user_href": "/profile/Sreenali-Hasnu"
                },
                {
                    "user_id": "Jyothi Verma",
                    "user_href": "/profile/Jyothi-Verma-2"
                },
                {
                    "user_id": "Rafique Mufasa Basics",
                    "user_href": "/profile/Rafique-Mufasa-Basics"
                },
                {
                    "user_id": "Tamara Borrego",
                    "user_href": "/profile/Tamara-Borrego"
                },
                {
                    "user_id": "Marianna Nestora",
                    "user_href": "/profile/Marianna-Nestora-1"
                },
                {
                    "user_id": "Cookie Joe",
                    "user_href": "/profile/Cookie-Joe-4"
                },
                {
                    "user_id": "Xina Lee",
                    "user_href": "/profile/Xina-Lee"
                },
                {
                    "user_id": "Melissa Rivera",
                    "user_href": "/profile/Melissa-Rivera-234"
                },
                {
                    "user_id": "Zap The King",
                    "user_href": "/profile/Zap-The-King"
                }
            ]
        }
    ]
}