{
    "title": "How to meet Ellen DeGeneres - Quora",
    "tags": [
        "How Can I Meet X?",
        "Ellen DeGeneres (actor)",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen Broomall",
                "href": "/profile/Colleen-Broomall"
            },
            "answer_text": "Check out her official site, but you’ve gotta be 14 or older → Request Tickets - Available Dates. However. getting tickets doesn’t guarantee you’ll actually meet her; you’ll just be in the same room as her. But now I’m going to tell you the true story of how my friend met Ellen. It was my friend’s first time visiting Los Angeles, so she wore an extremely nice outfit (all Burberry) and was with her equally well-dressed cousin. I guess they stood out from the rest of the tourists and a production person came up to them and said, “Are you here to see Ellen?” Well, yes they were, so of course they replied yes. She led them inside the studio, away from the rest of the other studio audience members. At this point, they figured something was up, but just went with it. She dropped them off in the green room, where there were snacks and beverages. My friend, who’s a nurse, didn’t even know what green room meant and thought they were picked to be in a game. Maybe 15–20 minutes later, the staff member came back with…Ellen DeGeneres. TLDR → Get tickets to be in her studio audience, dress super nice, get mistaken for a VIP guest and be personally introduced to Ellen in the green room. ",
            "date": "Answered February 19, 2017",
            "views": "57",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaithanya U",
                    "user_href": "/profile/Chaithanya-U"
                },
                {
                    "user_id": "Magdalena Sophia San",
                    "user_href": "/profile/Magdalena-Sophia-San"
                },
                {
                    "user_id": "Arya Rohtogi",
                    "user_href": "/profile/Arya-Rohtogi"
                },
                {
                    "user_id": "Danz H",
                    "user_href": "/profile/Danz-H"
                },
                {
                    "user_id": "Ntombifikile Ntuli",
                    "user_href": "/profile/Ntombifikile-Ntuli"
                },
                {
                    "user_id": "Ram Kanumuri",
                    "user_href": "/profile/Ram-Kanumuri"
                },
                {
                    "user_id": "Dhwani Shah",
                    "user_href": "/profile/Dhwani-Shah-144"
                },
                {
                    "user_id": "Robert Mahoney",
                    "user_href": "/profile/Robert-Mahoney-22"
                },
                {
                    "user_id": "Sufiyan Siddiqui",
                    "user_href": "/profile/Sufiyan-Siddiqui-7"
                },
                {
                    "user_id": "Amitabh Adhikari",
                    "user_href": "/profile/Amitabh-Adhikari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hedda Hopper",
                "href": "/profile/Hedda-Hopper"
            },
            "answer_text": "There are several ways. 1. Go see her show. 2. Find out where she parks her car when she does the show and go to that spot and wait. 3. Write her a letter saying you are very sick and one of your dreams is to meet her. 4. Find out where she lives and go knock on her door and say you are lost and need to use the telephone. But you have to be convincing. 5. Find out where she eats, has a drink, gets her hair cut or her nails done, and go there and wait for her. 6. Contact her agent or manager and say you are with a well known magazine and want to interview her for the cover. Tell them it’s a gay oriented one. Go to a secret database I can’t tell you about, and you’ll find her address and phone number in it. Then call her and get her to answer and make up some story. “Hi Ellen, it’s me, Nancy Cohen, I’m calling to say hello. How are you!? Let her talk. She should sort of think she knows you, but you have to make her believe it. They meet a ton of people and she’ll hear the name and her mind will say, “OH”… then she’ll play along with you and will think she knows you. When you think she is sufficiently knowing you, ask if you can come for a visit, is she still at her Bel Air house or the one in Santa Barbara. Good luck ",
            "date": "Answered November 8, 2016",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noah Palmer",
                    "user_href": "/profile/Noah-Palmer-13"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie Nelson",
                "href": "/profile/Annie-Nelson-13"
            },
            "answer_text": "Hi my name is Annie Nelson and I'm a great big fan of you I would really love to come on your show and meet you I'm sorry you didn't get in the white house when you can get you one but they finally let you in and I hope one day you can finally let me come on your show I really truly am a big fan of your grandmother two great kids and I love you to death I'm from Washington DC you came to DC to get your award I'm sorry I couldn't come and meet you I'm disabled and I'm a grandmother and great-grandmother loved you I hope one day I could get to meet you yours truly Annie Nelson waiting to hear ba Continue Reading",
            "date": "Answered November 23, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hannah Frost",
                "href": "/profile/Hannah-Frost-4"
            },
            "answer_text": "Bumping into her randomly on the street, or being an audience member on her talk show (go on her website to find tickets) Unfortunately she is a busy person so the chances are very slim, no matter which celebrity. My blog doesn't condone rumours of paparazzi so that unfortunately is all the advice I can give. I am in no way to give tips to stalk a celebrity. ",
            "date": "Answered August 12, 2017",
            "views": "828",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Davon Brown",
                "href": "/profile/Davon-Brown-26"
            },
            "answer_text": "I really want to meet Ellen I see her every day I been checking on tickets for 9 years for Christmas or anytime too come on the show when momexlaw was alive she want to go on your show so now me and my husband would like to come on the show please it would mean so much to my husband because his mom died of cancer love you Ellen thank you for your show ",
            "date": "Answered July 24, 2019",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Gabrik",
                "href": "/profile/Susan-Gabrik"
            },
            "answer_text": "Go to a taping of her show! ",
            "date": "Answered February 15, 2019",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theresa Bassey",
                "href": "/profile/Theresa-Bassey"
            },
            "answer_text": "B  ",
            "date": "Answered April 30, 2016",
            "views": "197",
            "upvotes": "0"
        }
    ]
}