{
    "title": "How much money does an average famous singer make per album? - Quora",
    "tags": [
        "Celebrity and Music",
        "Music Industry",
        "Musicians",
        "Celebrities",
        "Salaries and Wages",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrienne Dancer",
                "href": "/profile/Adrienne-Dancer"
            },
            "answer_text": "I don't know if there's a simple way to come up with an average since there are many factors that could be considered.  And, to be honest, usually the artist doesn't get paid quickly with the album sales.  They might get an initial advance, but often money is received over an extended period of time.  Most of the money famous singers and bands make nowadays isn't with actual record sales--it's with the song licensing for commercials/film/TV, it's with licensing of their image for merchandise, and also it's with paid appearances for tours and events. Do you want to count tour revenue that the artist makes to support the album or just album sales? Do you want to count song placement deals where the artist has songs from the album placed in commercials, TV shows, or movies? This article helps to explain all the financial details that go into making an album to understand why album sales aren't the bread and butter for artists nowadays: The Root Investigates Who Really Gets Paid in the Music Industry Bigger musical artists (like Beyoncé, Katy Perry, and Madonna) might have big sales figures for their albums, but they also often have many more people involved in the process of making an album who have to get paid: multiple producers, songwriters, studio musicians, lawyers, PR people, managers, licensing agents, etc.  Don't be surprised to hear that performers of their level make less than a dollar an album, which is the norm, I believe.  (The members of Guns N' Roses receive 25 cents per album sold for Appetite for Destruction, if I remember correctly.) ",
            "date": "Answered May 6, 2015",
            "views": "414",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nyambura Mbugua",
                    "user_href": "/profile/Nyambura-Mbugua"
                },
                {
                    "user_id": "John O. Battenfeld",
                    "user_href": "/profile/John-O-Battenfeld"
                },
                {
                    "user_id": "Robert James",
                    "user_href": "/profile/Robert-James-101"
                },
                {
                    "user_id": "Ryan Caperton",
                    "user_href": "/profile/Ryan-Caperton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reed Alfred Beeley",
                "href": "/profile/Reed-Alfred-Beeley"
            },
            "answer_text": "frankly, this is a topic that most artists do not like to reveal to the public. This question is un answerable, simply because there are way too many variable needed to understand this, and many of them private, legally protected property. You would need to know the specific royalty rate of each singer's recording contract. You would need to know the number of times each individual and particular singer's song was played on the radio. You would need to know the number of shows each particular singer played, how many tickets each show sold, and the percentage of ticket profit each singer made, AFTER the manager and crew took their cut. You would need to know how much of up front bonus the record label is paying the artist.It depends on how many people buy the album instead of pirating it. It depends on how much of that album's merchandise is sold.(see where I'm going with this? there is no easy answer. it is akin to asking which proton is the third to split/explode in a nuclear reaction.) To give you a short answer, probably anywhere from 4 to 6 figures, or if they are really lucky—maybe 7. Maybe.  I'm sorry to give such a dismal answer—but it is an accurate answer none the less.  again I stress that this is a topic that most artists do not like to reveal to the public. ",
            "date": "Answered May 11, 2015",
            "views": "155",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nuny Johnson",
                    "user_href": "/profile/Nuny-Johnson"
                },
                {
                    "user_id": "K.C. Cheng",
                    "user_href": "/profile/K-C-Cheng-1"
                },
                {
                    "user_id": "Nomar Norono",
                    "user_href": "/profile/Nomar-Norono"
                },
                {
                    "user_id": "Eray Özkural",
                    "user_href": "/profile/Eray-Özkural"
                },
                {
                    "user_id": "Alyx Gontier",
                    "user_href": "/profile/Alyx-Gontier"
                },
                {
                    "user_id": "Kakashi Sensei",
                    "user_href": "/profile/Kakashi-Sensei-6"
                }
            ]
        }
    ]
}