{
    "title": "How good was drummer Neil Peart in his prime? - Quora",
    "tags": [
        "Neil Peart",
        "\"Drums, Drummers and Drumming\"",
        "Rush (band)",
        "Drummers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Gold",
                "href": "/profile/David-Gold-7"
            },
            "answer_text": "I've played for over 30 years, Rush is my all time favorite band and I've spent heaven knows how much time “wood-shedding” Neil’s drum parts so I feel particularly well-qualified to step outside my established Quora corridor of expertise in answering this question. For starters, Neil never reached a “prime” per se in that he constantly improved/evolved as a drummer. I think one can, however, define a “vintage” Peart era (more below). Secondly, there were and are many drummers with technical skills equal to or surpassing Neil’s; you can walk into Berklee, Pasic festival or Drummers Collective and find them. There IS a vintage Peart era, which I would define as anything he played prior to Signals although that's debatable. What made Neil great was a combination of distinctive style, drum part composition and technical approach to rock drumming that was well ahead of its time for the genre. He tended to compose fills that underwent a progression in complexity throughout a specific song. He also used techniques such as “\"implied metric modulation” to give passages a driving, energetic feel during choruses. Like all great drummer innovators, he was adept at adapting specific “licks” and fills from other drummers to Rush’s music. A famous example is his classic descending tom fill closely resembling a fill pioneered by the great Billy Cobham (note: this is called a “herta”). His trademark beat is a driving “linear” ride cymbal pattern that is common in the choruses of many early to middle era Rush songs. Neil actually went through a period of occupational angst in the mid to late 80s and was never satisfied with his capabilities from that point on. At this time, he became profoundly dissatisfied with his playing and decided to reinvent himself. Working with the late reknowned drummer and instructor Freddie Gruber, Peart switched from solely playing matched grip to traditional grip and, as the bands arrangements became simpler, Neil’s playing became increasingly “\"groove-oriented”. Neil committed himself to playing more efficiently. To conclude, here is what I'd consider “vintage” Peart: please consult the discography from the mid-to-late 70s through mid-late 80s - basically from “2112” through “Hold Your Fire”. To this day drummers worldwide study and draw inspiration from the drum parts from these albums. Hence, while Neil may not have been the “best” drummer of all time he was certainly one of the most influential and important. ",
            "date": "Updated August 15, 2019",
            "views": "105",
            "upvotes": " View 60 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan John",
                    "user_href": "/profile/Bryan-John-59"
                },
                {
                    "user_id": "Matt Ferrari",
                    "user_href": "/profile/Matt-Ferrari"
                },
                {
                    "user_id": "Kip Friedman",
                    "user_href": "/profile/Kip-Friedman"
                },
                {
                    "user_id": "Gerald McCloy",
                    "user_href": "/profile/Gerald-McCloy-1"
                },
                {
                    "user_id": "Anthony Kellett",
                    "user_href": "/profile/Anthony-Kellett-1"
                },
                {
                    "user_id": "Justin Tabao",
                    "user_href": "/profile/Justin-Tabao"
                },
                {
                    "user_id": "Don Hauskins",
                    "user_href": "/profile/Don-Hauskins"
                },
                {
                    "user_id": "Ben Waggoner",
                    "user_href": "/profile/Ben-Waggoner-1"
                },
                {
                    "user_id": "Felicia Falso",
                    "user_href": "/profile/Felicia-Falso-1"
                },
                {
                    "user_id": "Victor Zale",
                    "user_href": "/profile/Victor-Zale-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Fetter",
                "href": "/profile/Jack-Fetter-2"
            },
            "answer_text": "“Good” and “prime” are difficult to answer with any art form, including music. Musicians typically get better over time as they learn more, are exposed to more and play with other musicians which all helps their craft. “Prime” is usually reserved for any extreme physical or mental ability, which drums are both but physical is the only one Neil is currently facing and it does affect him, he’ll be the first to tell you. To answer this question you also have to factor who is the judge, as music like most things is subjective, my 15 year-old Daughter would give a different answer than me yet both points are valid, so consider the source. Drummers typically praise or trash other musicians, many times envy and jealousy come into play, so be careful if the person answering is a drummer as many would place Neil on a pedestal as God! For me what makes Neil a drummer worth studying and emulating is his playing style, which is unique and precise. He likes to build fills on top of one another, in patterns with subtle changes, or reverse parts, something you wouldn't get unless looking for it. He plays fills 2 beats into the verse or chorus, something not traditional and likes syncopated fills with harder and softer hits making up the syncopated-like sound. Neil throws triplets and flams in and is a master of cymbals and the various sounds they are capable of. Many “drummers” never become “musicians”, Neil has absolutely achieved that by understanding the drums, sounds, interaction with the music, etc., which all make him a better drummer. This never changed from beginning to now, so is he “better” now, absolutely in some ways! Is he also not as good, in relation to physical stamina, no doubt. Neil is certainly in the all-time “best” 25 drummers and while that maybe doesn’t sound definitive, consider how many drummers grew up listening to Neil as their “typical” drummer to emulate, and are maybe in that same list! For that alone he’s probably in the top 5 most influential drummers if not the most influential, for me a bigger honor since it’s not speed alone, or complexity but HOW he plays… ",
            "date": "Answered January 18, 2017",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Jordan",
                    "user_href": "/profile/Josh-Jordan-19"
                },
                {
                    "user_id": "Michael Hughett",
                    "user_href": "/profile/Michael-Hughett-1"
                },
                {
                    "user_id": "Garry Mykes",
                    "user_href": "/profile/Garry-Mykes-1"
                },
                {
                    "user_id": "Rik Osborne",
                    "user_href": "/profile/Rik-Osborne"
                }
            ]
        }
    ]
}