{
    "title": "How do studio musicians get paid? - Quora",
    "tags": [
        "Getting Paid",
        "Music Production",
        "Salaries for Specific Jobs and Careers",
        "Music Industry",
        "Musicians",
        "Salaries and Wages",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Wolf",
                "href": "/profile/Tim-Wolf-45"
            },
            "answer_text": "Typically as a Work For Hire contractor, getting paid a set fee per hour or session. I’ve heard some musicians (like classical musicians) get paid in minimum of 4 hour increments, even if they played 10 min as an example. That said, making a living as a studio musician playing only as a hired gun in studio sessions is quite difficult in 2020, I would think. Modern recording technology has made it possible for people to produce broadcast quality recordings in their living rooms. Editing technology now allows an avg musician to produce excellent quality tracks that are in time and in tune. Midi driven virtual instruments (using recorded samples of real instruments as a base) allow producers to duplicate pretty much any instrument from their keyboard. Yes, there will still be a need for that 110 pc orchestra playing the soundtrack for that mega budget movie, or that funky horn section to come in and lay down killer backing tracks to add that sizzle. But each year the technology gets better and I would guess that it gets harder and harder to get paid consistently and well for being a hired gun studio musician. That said, live revenue for bands is very healthy. Industry touring revenue doubled over the past 10 years. And live musicians in the band or supporting the act make for a great live show. But studio work? The golden days like in the 60s and 70s in LA when session musicians would do as many as 3 or more sessions a day, rushing back and forth between studios, is long gone. A major segment of that work was commercials. Now most music for commercials is produced in a room with a computer. ",
            "date": "Answered April 5, 2020",
            "views": "486",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tata Desthalia",
                    "user_href": "/profile/Tata-Desthalia"
                },
                {
                    "user_id": "Andy Jacobs",
                    "user_href": "/profile/Andy-Jacobs-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benedict Roff-Marsh",
                "href": "/profile/Benedict-Roff-Marsh"
            },
            "answer_text": "Yes, by money in any of the usual transactional methods (but don’t offer bitcoin as we need to eat this week). Who pays studio musicians is the more important question. This is normally the Record Producer’s responsibility as they commonly handle the hires. A particular player can be at the request of the musician or the Producer can simply bring in players he knows and trusts from having worked with them before or word of mouth. The amount is usually agreed up-front and in some countries is governed by laws and/or a union. Pay can be based on a combination of experience, time or number of parts played. If in a bootstrapping situation it is possible to get players for less but if this is where you are at, please be very sure that you treat these people with extreme respect and return value as and where you can with credits on the record, your website (you have one right) and even shout-outs on Facebook otherwise they won’t support you ever again. ",
            "date": "Answered September 11, 2019",
            "views": "339",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "Andy Murphy",
                    "user_href": "/profile/Andy-Murphy-13"
                },
                {
                    "user_id": "Hank Charneskey",
                    "user_href": "/profile/Hank-Charneskey"
                },
                {
                    "user_id": "Michaele Hannemann",
                    "user_href": "/profile/Michaele-Hannemann"
                },
                {
                    "user_id": "James A. Hughes",
                    "user_href": "/profile/James-A-Hughes"
                }
            ]
        }
    ]
}