{
    "title": "How will I communicate with the Illuminati? - Quora",
    "tags": [
        "Illuminati",
        "Secret Societies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mikael Vattali",
                "href": "/profile/Mikael-Vattali"
            },
            "answer_text": "You don't talk to them they talk to you. Unless your in a powerful position in a company or government they ain't talking to you. They want people they can manipulate and use to make the power structure stronger and bigger. If you where talking to them you wouldn't know unless they wanted you to. I believe the original organisation under that name no longer exists. Now it has been adopted as a scary trigger word by the elite family's. Illuminati meaning the enlightened ones those who know all. Who knows all the rich elite familys. We the chess pieces dance round the board for our rich slave masters. Is ignorance happiness? The sheep knows nothing but sleep and eat and is happy all day long. Yes you want the truth but do you want the gigantic headache that comes after your mind is opened to the truth? A legend says cyclops had only one eye because he did a deal to see the future in exchange for an eye. He was tricked and the only future he saw was his own. Everyday knowing what's going to happen and how your final day will arrive. So the sheep eat and sleep and live happy and dumb. ",
            "date": "Answered July 31, 2018",
            "views": "382",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeremy",
                "href": "/profile/Jeremy-1247"
            },
            "answer_text": "I think illuminati is just a blanket term we give to ppl high up in secret societies. E.g. freemasons, skull and bones. I would imagine you would need to get rich and study the occult. Not recommended, after the dark energy takes hold you will be a hollow shell of what you are now. If u are looking at celebrities and thinking they have a great life it is because it is marketed to us that way and completely fake. I doubt they have much control of their wealth and resources and are under mk mind control. Have a look at the fACe of kanye after he meets Donald Trump and other elites. He doesnt know what's going on because he was probably undergoing mind control and/or ritual humiliation which often involves rape and pedophilia. Look up mk mind control glitches of news presenters, politicians and entertainers. You'll slowly learn they have no control of their own life ",
            "date": "Answered July 13, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}