{
    "title": "How much culture is in pop culture? - Quora",
    "tags": [
        "Popular Culture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Theis Engmann",
                "href": "/profile/Theis-Engmann"
            },
            "answer_text": "While it is true, that the old lines between high and low culture is increasingly diminished, you can't just say, that pop culture is the true culture of western societies. In todays capitalist societies we use cultural products to distinguish ourselves from each other and to build identity.(see ‘Distinction' by Pierre Bourdieu). Example: If you listen to jazz, you probably identify as a somewhat cultured individual, with tastes that are in opposition to the mainstream, which (to you) connotes uniformity. For another individual pop culture might connote something possitive like a shared frame of reference, bonds between strangers and bonds across borders (fan culture, internet culture and so on). Sociologist have also noted, that we are better at pointing out, what we dislike and why, than we are at pointing out why we like jazz - for example. Therefore, what a person will tell you HE thinks about pop culture says alot about that persons self view and identity - how he makes sense of himself and the world around him. In conclusion: Pop culture is Culture. In the sense that it is a certain form of culture - among many. A form of culture that connotes certain things to different people, and a culture that says alot about societies values and self image at large ",
            "date": "Answered October 11, 2017",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Weyodi O'Clerc Stern",
                "href": "/profile/Weyodi-OClerc-Stern"
            },
            "answer_text": "It could be argued that any line drawn between “high” culture and pop culture is arbitrary and necessarily false. In our modern era pop culture is the culture of the people, and with the rise of the internet and textural poaching, that is individuals and communities (often very large communities) making use of well known characters in new stories shared around a virtual campfire. Pop culture has thus in many ways become the true culture of the Western world, full of folktales reflecting cultural fears and values. Compare the impact on the greater society of J.K. Rowling side by side with John Updike. Updike, racist ( just read his work), sexist but championed as “high culture” has had far less impact than Rowling, often dismissed as a “children’s writer” has planted ideas and archetypes not just in the minds of a generation of children who grew up on her books but also on the parents who read them aloud at night. Around the world children play wizard with sticks in the yard and adults explore and dissect her characters with eachother, meanwhile Updike sits on the shelf, unread. ",
            "date": "Answered March 25, 2017",
            "views": "193",
            "upvotes": " Answer requested by Nicholas Balcolm"
        }
    ]
}