{
    "title": "How do bassists create basslines when only given the chords to play? - Quora",
    "tags": [
        "Guitar Chords",
        "Bass Guitar",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "Chords are a group of three or more notes played together. So, if you have three or more notes, and you know which notes they are because you know the chord, then all the bassist has to do is make a bass line with those notes! That’s the simplest way to explain it without delving into music theory much. Some techniques bassist use also use notes outside of the chord being played to make a new chord or imply a certain feel. Imagine that the bass and guitar playing together are working to act like one keyboard which has a bigger range. The bass can then play notes so that chords can sound like inversions or imply a different feel to teh chord. ",
            "date": "Answered September 23, 2016",
            "views": "519",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Doire",
                "href": "/profile/Jim-Doire"
            },
            "answer_text": "In any key, there are only 7 notes. These 7 notes will repeat with every octave. Take the Key of C. It’s spelled C, D, E, F, G, A, B. No sharps or flats in that key. Now when you get to B, you play C again but it’s an octave above. This is how instruments and singers get their range. Chords are constructed from those 7 notes. A bass player uses the same notes to create his lines. So you want to play a C Major chord. Major chords are built from the 1st, 3rd and 5th notes of each key. So a C major would be C (the root or first), E (3rd) and G (5th). As a bass player, you could start working around with those three notes while the guitar player is playing a C. If he goes to play another chord, you’ll know the construction of it and modulate with those notes. But this is by all means the most simple of explanations. Every key has a relative minor which will give different ways to skin the cat. Modes is another technique that can enhance you lines. Time division. It’s awesome how much you can do with 7 notes. ",
            "date": "Answered September 17, 2016",
            "views": "421",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Miller",
                    "user_href": "/profile/Michael-Miller-2313"
                }
            ]
        }
    ]
}