{
    "title": "How do television shows get away with not listing the songs and artists for the music they use? - Quora",
    "tags": [
        "Music Industry",
        "Television",
        "Songs",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Witter",
                "href": "/profile/Simon-Witter"
            },
            "answer_text": "Television shows do list the songs and artists whose music they use, but they do so internally. They have to pay mechanical and publishing royalties on all music used, even if the broadcaster has a blanket licence agreement with the appropriate collection agencies. What they don’t do is list all the songs in the credits, and that’s because they don’t have the time – there can often be 25 or more song snippets in an hour long documentary. The wisdom is that nobody wants to watch credits, and there is a lot of truth to that. I’m in the business, so I always watch the credits, but have you ever noticed how many people stay in a cinema for the credits? Film credits, which do list the songs, are often 5 minutes long or more and, within a minute or two, I’m the only person left in the auditorium. Broadcasters seem to fear credits, as if they will lose all of their audience due to them before the next show starts. On some German channels that have axed credits altogether, which is scandalous. In the USA they often rush them by so fast you can’t read them, and in the UK they often squeeze them into an illegible half screen so that they can trail the next programme on the other half of the screen – and then revert to full screen for the company logo at the end. The indignity of it all. Thus the people who have given sweat and blood over months to make the programme get no real credit at all. In this climate, the chance of anyone wanting to add in detailed music credits is pretty much nil. ",
            "date": "Answered September 21, 2018",
            "views": "309",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Shatan",
                    "user_href": "/profile/Jeremy-Shatan"
                },
                {
                    "user_id": "Zachary Siple",
                    "user_href": "/profile/Zachary-Siple"
                },
                {
                    "user_id": "Michael Leahy",
                    "user_href": "/profile/Michael-Leahy-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonny Meyers",
                "href": "/profile/Sonny-Meyers"
            },
            "answer_text": "Local stations pay for a BMI license that gives them carte blanche. The other licensing authority is ASCAP. Also they may deal directly with the performer to use their original tunes without credits. Besides, who really reads credits? If I like a tune and want to know who made it I can usually find it on the internet.  ",
            "date": "Answered September 21, 2018",
            "views": "106",
            "upvotes": " Answer requested by Bill Shor"
        }
    ]
}