{
    "title": "How to play songs the first time on the piano (playing by ear) - Quora",
    "tags": [
        "Learning Piano",
        "Pianos",
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allan Jeong",
                "href": "/profile/Allan-Jeong"
            },
            "answer_text": "I got very frustrated (like what Sammy Hagar felt in I Can't Drive 55) trying to learn to play piano by ear from websites and online videos … until I came upon a few simple revelations. Here’s a short answer on what it means (at least for me) and how to play songs by ear and find chords on piano (assuming you can already play a melody by ear with your right hand) presented in my 55-word poem titled “I Can Jive in 55!” To play song by earplay last note on Cto make learning easyby avoiding black keys. To add chords to songplay root BELOW melodyon the main down beatsat intervals 1, 5, 3. Now play each chordby playing ABOVE rootnotes 5, 8, and 10then add notes to suit. See video below with full demonstration of these three simple steps that unraveled all the mystery and quite suddenly (almost instantaneously after 40+ years of playing piano using just sheet music and rote memory) enabled me to spontaneously play songs by ear and play it in any key. Main Take Away: Focus on identifying the root-melody note intervals when playing songs!  ",
            "date": "Updated June 29, 2020",
            "views": "87",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Steve Roberts",
                    "user_href": "/profile/Steve-Roberts-83"
                },
                {
                    "user_id": "Allan Jeong",
                    "user_href": "/profile/Allan-Jeong"
                },
                {
                    "user_id": "Alan da WA",
                    "user_href": "/profile/Alan-da-WA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Benegal",
                "href": "/profile/Anand-Benegal-1"
            },
            "answer_text": "You slow it down on VLC Media player (or any other player) and catch the notes individually…then a phrase…then a chord…then a more complicated chord, and then you move onto the next segment, and the next…and over time you learn the piece… …And then the next time around, you’re a little better at doing this :) It’s a slow process, but it’s extremely rewarding in the long-term if you stick with it. Good luck! ",
            "date": "Answered September 27, 2017",
            "views": "153",
            "upvotes": " View 3 Upvoters "
        }
    ]
}