{
    "title": "How to start up my Reverb seller account - Quora",
    "tags": [
        "Reverb",
        "Selling on Etsy",
        "Etsy (product)",
        "Online Retail",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akshay Srivastava",
                "href": "/profile/Akshay-Srivastava-133"
            },
            "answer_text": "Hello,  Buy & Sell Music Gear Online is an online marketplace to buy and sell music gear which launched in 2013. The site allows anyone, from large dealers and manufacturers to small shop owners and individuals, to create free listings for musical instruments and other related equipment. To become a seller on reverb you just follow some guidelines and steps which are as follows –1: What are you selling.2: Describe your shop name.3: Provide a full description of your products.4: Fill Shipping details.5: Selling fee.6: Create an account to track your listing of products. 1. What are You selling –  First of all, you have to describe your product and give full details of the product regarding the brand name, product condition, year of manufacture, price, and country of origin, etc.Upload your product photos and photos dimension should be 620*620 pixels. 2: Provide a full description of your products- The description should go beyond what’s in the pictures and describe everything and anything that a potential buyer might want to know about the item. How long have you had the item?  Describe your product what you sell on Reverb 3. Describe your shop name: Provide a beautiful and attractive name of your shop so that customers would have a look at your http://shop.It means shop name must be funniest even you can change your shop name later. 4. Shipping details: Shipping details mean from where you will ship your products and in which region you will deliver the products.  5.Selling fee : As a registered seller, Reverb charges 3.5% of the net sale price (shipping included) after your item being sold. The minimum fee starts at $0.50 and goes up to $350. Store Owners yearning to sell on REVERB. 6. Create an account to track your listing of products: To become a registered seller and to track records of products and product listing you have to create an account so that you will manage all things like how much products are purchased how much is shipped all activities like this.  After setup your account you can also automate your online store via selling on Reverb, just find any 3rd party tool which basically helps in automation process and then you simply do happy selling n reverb Thanks! ",
            "date": "Answered November 6, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nancy Awasthi",
                    "user_href": "/profile/Nancy-Awasthi-5"
                },
                {
                    "user_id": "Anupriya Verma",
                    "user_href": "/profile/Anupriya-Verma-24"
                }
            ]
        }
    ]
}