{
    "title": "How to find Paganini's Caprices, other than the 24 - Quora",
    "tags": [
        "Niccolo Paganini",
        "Violinists",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Byrd",
                "href": "/profile/Joseph-Byrd-8"
            },
            "answer_text": "The Twenty-four Caprices are Paganini’s magnum opus, which he wrote to demonstrate that he was the only violinist in the world who could perform them. He was not a composer, and this set of variations on his own theme was a statement to the world. Until the 20th century, no one else could play them. For someone without extensive composing experience, they are marvelous, far superior to his only other significant work, the Concerto. It was the Caprices that inspired other composers, e.g., Brahms, Liszt, Rachmaninoff, et al., to write music that added complexity and orchestral effects, and wrote for solo piano, something Paganini could not have done. Incidentally, they evoke the famous legend that he had sold his soul to the Devil, thus are a useful motif to suggest a bargain with the Dark Forces. This did no harm at all to his personal legend (and perhaps earned him a cooler spot in Hell). He was also generous with his money, awarding commissions to Liszt, Heine, Ernst, and others, as well as the viola concerto, Harold In Italy for Hector Berlioz, a large sum which saw Berlioz through a difficult financial period in his life following the premiere of Symphonie Fantastique, and his new marriage to Harriet Smithson, the subject of that symphony. ",
            "date": "Answered August 3, 2017",
            "views": "416",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hernan Lee",
                    "user_href": "/profile/Hernan-Lee-2"
                },
                {
                    "user_id": "Angela Blackthorne",
                    "user_href": "/profile/Angela-Blackthorne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joyce Chow",
                "href": "/profile/Joyce-Chow-23"
            },
            "answer_text": "You could find the score on IMSLP, a free classical score website which gives you a large variety of music scores to choose from. Or if you want to listen to them, search them on YouTube. The one played by a wind band (forgot which) was marvelous. Check that out! Good luck on searching! It won't take you a lot of time though. ",
            "date": "Answered April 5, 2018",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Tan",
                    "user_href": "/profile/Daniel-Tan-372"
                }
            ]
        }
    ]
}