{
    "title": "How many octaves is a good vocal range? - Quora",
    "tags": [
        "Vocal Range",
        "Singing Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terrence Chua",
                "href": "/profile/Terrence-Chua-2"
            },
            "answer_text": "If you will allow me to make this reply here as I am a voice enthusiast, been in training for several years, a chorister and a multi-octavian. We need to first recognize that a healthy voice possesses a vocal range anywhere between an octave and a half, to two. That will be BEFORE vocal training. After, depending on whether it has been training for the classical repertoire, the voice is disciplined throughout its original range and is likely to display extensions at either end. This is why we come across opera singers with the 3-octave vocal range. Age, too, has everything to do with it. A young man is unlikely to have his upper register revealed until well into his late 20s, whilst a young lady will have a more stable range already there, ready to undergo training. The voice undergoes subtle changes every ten years, for both the trained and untrained voice. Deepening in quality. Physical changes and mental/emotional changes have a lot to do with things. For some, a voice once noted for the top notes will suffer because of declining health. Remember that singing is a very physical, and yet mental state. Unlike a musical instrument, the voice can NEVER maintain true quality throughout its life because very simply its life is made up of so many things which affect the singer. The voice is subject to our state of confidence, concentration, and the voice is a revealing state of our spiritual health. Simply put, the voice is an organic instrument vulnerable to all manner of external stimulii and stressors. I hope I have moved you away from just the number of notes that make up the human voice. No matter the number of octaves one has we need to be mindful of what we do with each note within our vocal compass. Expression, diction, projection, delivery all come into play for the performance. Finally, stay in good health! ",
            "date": "Updated May 5, 2018",
            "views": "269",
            "upvotes": " View 45 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nishan Ehsan",
                    "user_href": "/profile/Nishan-Ehsan"
                },
                {
                    "user_id": "Sanaeobsisanamana",
                    "user_href": "/profile/Sanaeobsisanamana"
                },
                {
                    "user_id": "Mary Ann Sharma",
                    "user_href": "/profile/Mary-Ann-Sharma"
                },
                {
                    "user_id": "Christina Black",
                    "user_href": "/profile/Christina-Black-23"
                },
                {
                    "user_id": "Ashton Rodgers",
                    "user_href": "/profile/Ashton-Rodgers-2"
                },
                {
                    "user_id": "Clover Thomas",
                    "user_href": "/profile/Clover-Thomas"
                },
                {
                    "user_id": "Samantha Hopkins",
                    "user_href": "/profile/Samantha-Hopkins"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                },
                {
                    "user_id": "Michael Gordon",
                    "user_href": "/profile/Michael-Gordon-39"
                },
                {
                    "user_id": "Siyana Stoyanova",
                    "user_href": "/profile/Siyana-Stoyanova-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eleonor England",
                "href": "/profile/Eleonor-England"
            },
            "answer_text": "Most voices are capable of about 3 octaves of USABLE range when they are trained up in their prime. Without training it varies wildly. Most standards range 1 octave plus maybe 3 whole steps but many untrained voices have a hard time with even this range. When you’re trained up, you can pitch that 10th (the name for the distance of an octave plus 3 whole steps) in many different places in the voice to find the best sound. Some voices are capable of much more than 3 octaves when trained and some maybe less. The physical construction of your body becomes a factor. Learning how to access so-called whistle register can add many notes on to your range. I hope this is helpful to you! Eleonor, owner/teacher at Singing Lessons NYC 520 8th Ave New York, NY 10018 212/736.3118 ",
            "date": "Updated April 4, 2018",
            "views": "134",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guy Eshel",
                    "user_href": "/profile/Guy-Eshel-1"
                },
                {
                    "user_id": "Ricardo Alchini",
                    "user_href": "/profile/Ricardo-Alchini"
                },
                {
                    "user_id": "Richard Fox",
                    "user_href": "/profile/Richard-Fox-24"
                },
                {
                    "user_id": "Stephanie Gunawan",
                    "user_href": "/profile/Stephanie-Gunawan-5"
                },
                {
                    "user_id": "Kevin Wong",
                    "user_href": "/profile/Kevin-Wong-118"
                },
                {
                    "user_id": "Chris Shaw",
                    "user_href": "/profile/Chris-Shaw-117"
                },
                {
                    "user_id": "Baron Lowery",
                    "user_href": "/profile/Baron-Lowery"
                },
                {
                    "user_id": "Gano Stanlee",
                    "user_href": "/profile/Gano-Stanlee"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                },
                {
                    "user_id": "Arno Rahman",
                    "user_href": "/profile/Arno-Rahman"
                }
            ]
        }
    ]
}