{
    "title": "How to develop a musical talent - Quora",
    "tags": [
        "Learning Music",
        "Talent",
        "Learning New Things",
        "Learning",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerome Tankersley",
                "href": "/profile/Jerome-Tankersley"
            },
            "answer_text": "You need to really want to develop a musical talent. Do you already play an instrument? Do you love music? Do you consume it every day?  If not, you need to start doing these things. If you don't love it, you probably won't get very far though—I suppose through sheer discipline you could, but why do that if it's not what you want to be doing.  If you don't play an instrument, you need to choose one to play. Is there one to which you're drawn? Are there sounds in songs you love that you want to learn to make? Choose that instrument. You can pick another later if you find you change your mind or are drawn to another. The good news is that any musical learning you learn on one instrument will inform the next in some ways, so you're still on the path towards musical talent.  Now you need to practice every day (at least for a while). This will help you learn the construction and feel of your particular instrument as well as begin to introduce you to music theory, songs and techniques. The physicality required by your chosen instrument may take weeks to become comfortable with, so it is vital that you stay persistent and work out how your body interacts with the instrument for a while. Guitar/bass/piano require finger and wrist stretching, callous development, muscle development, and hand/eye coordination(and more) to begin with and it takes some hours to get your body to the point where you can form certain chord (or whatever) shapes, so you must stick with it. There will be a point where it all clicks and you can naturally, quickly form these shapes—this is one of many wonderful benchmarks you will achieve along the way.  What to playYou should be able to find countless chord diagrams, tablatures for popular songs, and exercises for various instruments via google or youtube or lots of other places online. I recommend trying to learn songs or parts that you already know and love. There's something special about first learning to play that song you've loved for a long time. It's like solving a puzzle of a picture that you have been looking at for years, so you see it in a new light and know its secrets. Plus, a song you like is far more motivating than something you don't or are unfamiliar with. I'm sure it is helpful for the learning process when your brain already has the song stored in memory from listening.  You should also challenge yourself at some point to learn scales, music theory, technical exercises, warmup exercises, pieces of unfamiliar music, and exercises for particular genres/playing styles. Also for ear training, put a song on repeat and try to play along or transcribe by ear. With some patience, this will develop your ear and connect it with your instrument—a key component to developing musical talent. There are training games for certain instruments as well—use these if you can. They're good identifying exactly what you're missing. Rocksmith for guitar/bass. Synthesia for piano.  Keep doing this for years. Along the way, get some teachers, take classes, start a band or at least others to play with, jam, record yourself, listen to those recordings and identify your weak points. Focus on the weak points until you've corrected them. Challenge yourself to try to things. Over the years your musical tastes may change, this is natural and will help make you a unique player. Keep playing and at some point you will notice that you have developed musical talent. Then keep going further. ",
            "date": "Answered August 21, 2015",
            "views": "46",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eleena Kaul",
                    "user_href": "/profile/Eleena-Kaul"
                },
                {
                    "user_id": "Gulfinaz R. Andronikou",
                    "user_href": "/profile/Gulfinaz-R-Andronikou"
                },
                {
                    "user_id": "Dovie Weinstock",
                    "user_href": "/profile/Dovie-Weinstock"
                },
                {
                    "user_id": "Willian da Silva",
                    "user_href": "/profile/Willian-da-Silva-1"
                },
                {
                    "user_id": "Sebastian Sapeta",
                    "user_href": "/profile/Sebastian-Sapeta"
                },
                {
                    "user_id": "Joseph Akpu",
                    "user_href": "/profile/Joseph-Akpu"
                },
                {
                    "user_id": "Dhruv Das",
                    "user_href": "/profile/Dhruv-Das-1"
                },
                {
                    "user_id": "Piyush Sahu",
                    "user_href": "/profile/Piyush-Sahu-63"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Onye Nwachukwu",
                    "user_href": "/profile/Onye-Nwachukwu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Sullivan",
                "href": "/profile/Stefan-Sullivan"
            },
            "answer_text": "Don't be put off by people that tell you that you have to have some unquenchable thirst for, and an utter inability to do anything else but music. The fact is that music is a uniquely and universally human trait. So you want to develop musical talent. What I'm going to suggest is going to be obvious, but the important part is persistence. Let's set some goals, and make some plans to meet those goals.  First, define musical talent. Do you want to become a veritable expert in understanding music? Do you want to sing, play guitar, piano, accordion?  Next, to what level? Do you want to play alone, in a band, in concerts, at karaoke bars? Finally, over what period of time. If you want to become an expert after 3 years, it is possible only if you spend all of your time working towards your goals, and even then you will probably need a lot of help and guidance. Alternatively, if you just want to practice once a month, you can still get there but it will go very very slowly. Now, do it. Make a plan for what you need to do, with what duration, and what frequency to develop the level of talent you want. I highly recommend you start with a micro-habit. For example, instead of resolving to play one hour a day, which might be difficult to maintain day after day, try 5 minutes a day. It's a lot easier to not get deterred by 5 minutes. The great part about this is that music is fun, so you'll likely exceed this goal each day, but frequency is important for musical talent. I also recommend you watch this Ted talk:    Alright, here's a nonobvious suggestion. I highly recommend that you learn theory *after* practice. Do *not* practice chord charts until you've managed to learn all 3 bazillion chord combinations - that's boring. Most trained musicians forget that theory follows practice. Analysis is post-hoc. If you learn the theory, it only helps you perform if you already have some performance skill, so it shouldn't be the first thing you do. ",
            "date": "Answered August 23, 2015",
            "views": "502",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benjamin Heroux",
                "href": "/profile/Benjamin-Heroux"
            },
            "answer_text": "Sorry for the rant/essay….read on if you wish! The same way you develop any talent, or worthwhile career in which you can grow. Practice! Dedication! Hard work! Time! If you can’t do any of that on your own, hire a teacher. It will still take all of those things, it’ll just make it a little more fun and easier to understand why you have to go through all the “bad,” sounds and lame songs before you get to write or improvise or play original classical/jazz pieces. I feel for adult learners. I’m lucky I found most of the things I wanted to learn by the time I was 10, so I could spend all that free childhood time working on them. Adults want to be so good, so fast, that most of them feel stupid or skip any section of a course that sounds like it would be played in elementary school. If you didn’t play it ever, or butchered it in elementary school, why would it make sense that playing beyond that point would be easy later in life? It’s possible, but only with a lot of frustration. Most of the time I see adults try this route, they quit. It’s too hard. Don’t skip anything. If it’s so easy for you, then do it and be done with it. Then I see adults go the other way, the “academic” route, the one with structure, the one that has WORKED FOR THOUSANDS AND THOUSANDS OF MUSICIANS ACROSS THE PLANET FOR YEARS AND YEARS AND YEARS and they still quit. It’s boring, they feel stupid playing hot cross buns or twinkle twinkle, or other little songs that are only in these lame books. Then they hear another adult play well (but somehow forget that they’ve been playing and PRACTICING for 30+ years) and now they definitely want to give up because there’s NO WAY they’ll ever make it to that point before they are old and no one cares. ALL FALSE! Just practice. Leave the ego at the door and accept the fact that you will play through the same boring, basic tunes that other 5 year olds across the country are tinking their way through. It’s hard to start anything as an adult. Others in the field have been doing it forever, and yes, there are still 10 year olds who blow me away, and can play SOME things better than I can. But I promise I’ll always be able to top that 10 year old at something. I have an adult student, I love using him as an example. 30 years old, ZERO musical history or innate talent. His Rhythm was bad, he can’t read or play, doesn’t even know all the names of the notes. He practiced his ASS off for 6 months. In 6 months he went from playing nothing, to playing a beautiful Fur Elise. He also played it with TWO wrist braces because all the practice had led a doctor to diagnose hi with carpal tunnel. No pain no gain. In every sense of the saying, at least physically and emotionally. I can’t stand when adults quit lessons because it’s “too rudimentary,” (uh, rudiments, duh?) or “too much like school.” …..IT IS SCHOOL! WTF DID THEY THINK IT WAS GOING TO BE? It’s also a little insulting at 30, after working my ass off at this for 25+ years, to run into adults who make little out of that fact, and think they’re just going to play like how I do after a few lessons, or after some youtubing. Anyone can learn in any of these ways. I have students who are AMAZING because of youtube videos. They still practice, a lot, and I can tell when they don’t. I just help them with concepts they may not understand from any theory videos they watch. I have other amazing students that swear against youtube. Either way, there is only one answer: practice. ",
            "date": "Answered May 24, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noah Cohen",
                "href": "/profile/Noah-Cohen-6"
            },
            "answer_text": "It depends what kind of music, but basically you'll want to spend a TON of time listening to the kind of music you want to emulate. Have it on in the background as often as possible, listen to it while falling asleep, whatever, as long as you deeply ingrain the style in your mind. When I attended Berklee College of Music's summer semester last year, my first major assignment was to take a recording of this long, complicated jazz piano solo, listen to it for a while, and ultimately be able to hum it from memory- without having looked at written music or worked it out on my instrument. Having already been adept at reproducing music on guitar by ear going in, I initially figured, 'this is bullshit, I'm just going through extra steps to get to the same place'. It turned out I was completely and unequivocally wrong; learning music by ear without the crutch of an instrument I have skills on has been one of the biggest contributors to my musical improvement since then. Learning something exclusively by ear so well you can hum it, note for note, from memory is the musical equivalent of writing down notes from an academic lecture; it encodes the material into your memory in a far deeper way than you can get from other methods. Start from whatever level you need to, as long as you can make it work, and build up from there; it's a skill that develops quickly enough. Do this, along with technical skills practice on whatever instrument you play, for about an hour a day, and within months you'll be infinitely better at music. ",
            "date": "Answered December 15, 2016",
            "views": "316",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nanae Laid",
                "href": "/profile/Nanae-Laid"
            },
            "answer_text": "I’m a believer that school isn’t required since there are a lot of people who make it in various industries without formal training. Depending on what you’re aiming for, that determines what you should do. If you’re trying to compose, write, or produce, practice! Seriously, I can’t say this enough times. One of my friends produces and sells tracks freelance. He’s been practicing and making his own sound since elementary school and he’s made so many songs that show his growth as he self-taught himself. There are YouTubers and blogs and other free material that helps. If you’re trying to sing or dance, the same as above. There’s free material and you don’t have to pay for lessons anymore (though some would say otherwise). Self-taught singing can be good. Watch videos from vocal coaches, listen to the techniques of singers known for their vocals, watch dance courses/tutorials and just practice. If you’re trying for rap, there’s not much I can say for that. A real rapper, like a singer or dancer, has their own distinction. Again, practice is all I can really tell you to do. Try out different sounds, sub-genres, etc. until you find something you’re comfortable with. Not everyone can afford schooling for this, so if you can’t, YouTube and Google are your best friends. You can find nearly everything for free on the internet at this point. ",
            "date": "Answered May 2, 2019",
            "views": "351",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarah Jane",
                    "user_href": "/profile/Sarah-Jane-1069"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "That depends upon, surely, in what area(s) in music your talents lie. If you don' t know the answer to this, you either need to find out or conclude that maybe music isn' t “your thing\". Without a clear idea of what precisely your abilities are…be it as a composer, singer, teacher, performer or whatever, you cannot possibly focus on developing the requisite skills to further those talents. If you have a love of music but want to further your general knowledge, then look out for a local music appreciation course. It is always more stimulating if you embark upon a joint venture rather than go it alone. If you have an idea that it might be nice to learn an instrument, try to decide upon one that you can see yourself enjoy playing and take proper lessons. If you would like to learn composing, then playing an instrument, particularly a keyboard, is very helpful. Once again, find a stimulating teacher to help you with objectives and offer guidance. But one way or other, at some point if you are serious about developing whatever skills you possess, you will need to have a clear focus as to where you want to go. If/when you know this, then a mentor/ teacher will also be able to assist you in getting there. ",
            "date": "Answered May 2, 2019",
            "views": "231",
            "upvotes": " Answer requested by Sarah Jane",
            "upvoters": [
                {
                    "user_id": "Debra J. Aponte",
                    "user_href": "/profile/Debra-J-Aponte"
                },
                {
                    "user_id": "Noah Cohen",
                    "user_href": "/profile/Noah-Cohen-6"
                },
                {
                    "user_id": "Wyatt Kac",
                    "user_href": "/profile/Wyatt-Kac"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seyi River",
                "href": "/profile/Seyi-River"
            },
            "answer_text": "Practice. Listen. Play. Read. Be patient and cultivate grit. Practice your instrument. Don't skip the difficult parts. And don't skip days - do it everyday even when time is limited. Same applies if you are composing. Take lessons from advanced musicians that you admire, to avoid getting stuck in a rut. Explore ideas and concepts with fellow musicians. Listen to great music of all genres - not just the ones you are interested in. Where possible, play along and give your ears a workout. Play with musicians who are better than yourself. And play in front of different audiences. Try busking. Read good books on music theory, music biographies and whatever else you can find. Be patient and cultivate grit: video-  ",
            "date": "Answered December 16, 2016",
            "views": "381",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mary Megrant",
                "href": "/profile/Mary-Megrant"
            },
            "answer_text": "I think of music as being more of a culture than a talent. What do you want to do? Sing lullabies to a child? Learn to play a particular instrument? Develop your sense of rhythym? There are many skills that you can develop. Your sense of rhythm, playing a particular instrument well, being able to read sheet music. What music do you like and what resources are available to you? Do you already know some local musicians? Can you find an online community based on your favorite genre or instrument ",
            "date": "Answered May 23, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meenakshi Das",
                "href": "/profile/Meenakshi-Das-2"
            },
            "answer_text": "Music is an art and in my perspective, to be a real passionate admirer of an art form, you must connect with emotions. I am sure you would be aware of how much you should practice by now. But mere practice is enough? Nope. Go out. Talk to people. Feel their stories, their struggles, their pain, their emotions. And then sing you heart keeping yourself in those shoes. “Feel” my friend. Because its feeling with which an art is created. ",
            "date": "Answered December 15, 2016",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David J Buck",
                "href": "/profile/David-J-Buck-1"
            },
            "answer_text": "Practice, learn theory, create compositions, practice, learn about your instrument, play with others, practice, listen to a wide variety of music outside your normal interests and analyze them, practice, read everything you can find about playing/performing. Oh, and don’t forget to practice. ",
            "date": "Answered May 2, 2019",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jordan Weeks",
                "href": "/profile/Jordan-Weeks-8"
            },
            "answer_text": "Short answer: stay motivated. Music is a very broad category; if you lack (as I do) a keen sense of discipline the likes of which very few people possess, then I would highly recommend focusing your energy on whatever specific genres, styles, or instrument(s) you are MOST interested in. The narrower your focus, the quicker your path to mastery. YouTube is a great tutor; if I had to guess, your greatest challenge will be not a lack of resources, but rather keeping that inner flame alive that made you want to pursue music to begin with. Stay motivated & the rest will take care of itself! ",
            "date": "Answered December 15, 2016",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mighael Botha",
                "href": "/profile/Mighael-Botha"
            },
            "answer_text": "PRACTICE. When your done. Should put in some more PRACTICE. Done Practicing? MORE PRACTICE. Music is as much muscle memory as it is math and technicality. Practicing is ESSENTIAL to improving. Also listen to music. ALL THE TIME. Start understanding song structures. Learn your scales. And afterwards…. PRACTICE 10 Easy Ways To Optimize Your Music Practice ",
            "date": "Answered December 15, 2016",
            "views": "253",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stefan Sullivan",
                    "user_href": "/profile/Stefan-Sullivan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fanny Rossignol",
                "href": "/profile/Fanny-Rossignol"
            },
            "answer_text": "Practice a lot! and ask people what they think of it because sometimes you think you’re doing great and you’re not actually so ask people around you to listen to you and just perform in front of them so you have someone else “judging” your music. but the most important thing to do is PRACTICE everytime you can. ",
            "date": "Answered December 15, 2016",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Haime",
                "href": "/profile/Peter-Haime"
            },
            "answer_text": "Be it Vocal, instrumental,aural; the best method of musical talent development is taking lessons from a human expert in the field - be it clarinet, violin, organ, euphonium; on a weekly basis, backed by meticulous daily practise. not forgetting goals such as concerts and examinations ",
            "date": "Answered May 23, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pim Ganzeboom",
                "href": "/profile/Pim-Ganzeboom"
            },
            "answer_text": "Play, play, play, explore, explore, explore! I think the most important thing is to do it from the heart. Do you. And listen to a lot of music in all genres (if that interests you). ",
            "date": "Answered August 21, 2015",
            "views": "679",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Joseph Baldassarre",
                "href": "/profile/Joseph-Baldassarre-1"
            },
            "answer_text": "Take lessons from an accredited teacher, learn good technique, use a metronome, practice daily as instructed and efficiently, and work with musicians who are artistic and nuturing. ",
            "date": "Answered May 23, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Praz Khanal",
                "href": "/profile/Praz-Khanal-1"
            },
            "answer_text": "YouTube can help you from beginning to further stuffs🎤 Start watching tutorial videos ",
            "date": "Answered May 23, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nina Robert",
                "href": "/profile/Nina-Robert-2"
            },
            "answer_text": "Listen often.Sing often.Play often.",
            "date": "Answered December 15, 2016",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Chung",
                "href": "/profile/Andrew-Chung-60"
            },
            "answer_text": "Practicing homie, it ain’t rocket appliances. ",
            "date": "Answered September 26, 2019",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Gwilt",
                "href": "/profile/Tom-Gwilt"
            },
            "answer_text": "This link goes to stretching exercises by John Williams. The exercises are very difficult, and you are cautioned to stop if you feel any discomfort in you left hand. You can do serious injury if you fail to heed the advice Stretching Exercises Given To Me By John Williams ",
            "date": "Answered May 23, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}