{
    "title": "How to learn to sing at the age of 14 - Quora",
    "tags": [
        "Singing",
        "Learning New Things",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jared Loveless",
                "href": "/profile/Jared-Loveless-5"
            },
            "answer_text": "Ok, in some of the other answers there is some pretty bad advice. At your (our) age your voice is still changing, especially if you are male. It is easier for you to damage to your voice at this age and if you damage it enough it can be permanent and require surgery to fix if it even can be fixed. Singing along to your favorite songs shouldn't be a problem, but using books or YouTube videos to learn isn't the best way. Books don't even allow you to hear someone else's example of how to sing. Beginners should not use them to learn how to sing. What they are good for is reminding you about techniques you have learned before and being prepared ahead of a lesson. YouTube videos at least allow you to hear something before you try it, but there is nobody there to tell you to stop if you do something wrong. The easiest thing to do is join your school's choir program. It will help you practice sight reading, singing with other people, and basic singing technique (on top of this you will make a lot of friends). Your choir teacher is probably a good resource, even if you aren't part of choir yet. The next step would be to get a voice teacher. They can charge between $10–35 per lesson. Most do half hour lessons. Ask your parents about taking voice lessons. If you are serious about learning you should really consider it. Also, don't forget to try listening to different genres of music. Look up Moses Hogan (Battle of Jericho) for Gospel and Eric Whitacre (Sleep) for some good modern classical music. I would like to leave you with a great example of a good piece performed by a good choir, because I really want to sell the choir thing. Let My Love Be Heard - Jake Runestad ",
            "date": "Answered March 12, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jude McLachlan",
                    "user_href": "/profile/Jude-McLachlan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Bain",
                "href": "/profile/Jeff-Bain-18"
            },
            "answer_text": "These are quick easy answers, but all very valid. 1.) Keep listening to music and sing along. 2.) Go to the library and/or buy a book on singing. Something like Singing for Dummies, etc is a good start, or something similar. 3.) Find some one local to take lessons from. There are people who can actually teach this, and there are good reasons to learn from someone who has already figured things out, knows how to teach and has already made mistakes so you don’t have to. 4.) Record yourself so that you can hear what you sound like and hear yourself improving. You don’t have to share this with anyone, it’s just a tool to learn from. 5.) Don’t be afraid to learn about music and different styles, etc. Singing can be very freeing, and very uplifting. There is an instinctive joy about that will make you feel good. oh finally: 6) Don’t listen to people who say negative things. They don’t always mean it. I have found over the years that a lot of people say stupid things like, “don’t give up your day job,” etc, but honestly, just ignore them and keep doing what you wish to do and keep at it. Even if you aren’t a natural, you can get better and improve. The more you practice the better you will eventually get. ",
            "date": "Answered March 12, 2019",
            "views": "147",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jude McLachlan",
                    "user_href": "/profile/Jude-McLachlan"
                },
                {
                    "user_id": "Emily",
                    "user_href": "/profile/Emily-4854"
                }
            ]
        }
    ]
}