{
    "title": "How does auditory processing disorder affect learning? - Quora",
    "tags": [
        "Auditory Processing",
        "Auditory Processing Disorder",
        "Mental Illness",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emma Skinner",
                "href": "/profile/Emma-Skinner-5"
            },
            "answer_text": "It can make learning in classroom environments very difficult, I have difficulties processing what people are saying when there is background noise, pens flicking, even other students breathing seems loud to me, so that affects my ability to concentrate to the extent that if I don't write down what is being taught then it goes through one ear and out of the other. I've found the best way for me to learn is to copy or write information down and then I can memorise what I've written, preferably in total silence so I don't get distracted. So typically I try to sit as close as possible to the tutor in a classroom environment, I feel really annoyed when other people talk or something distracts me, so I struggle to see the point in attending classes that aren't structured or digress from the material we are supposed to be learning. I can imagine that a lot of people with auditory processing issues are more successful when learning kindesthetically, involving hands on and practical projects oppose to learning from listening to tutors and teachers. I didn't go to school much, I was successful as an absentee and from about thirteen I stopped going to school full time and self learned, in libraries which meant I didn't sit my exams at the same time as my peers, I failed everything at school through successful evasion tactics but then managed to pass everything the following year, at college possibly because classe sizes were less. But ongoingly, I can't listen to people who drone, talkers who like to spin a real slow yarn, don't hold my attention at all and their words turn into meaningless sounds and I can't retain anything they are saying so it can be really difficult to find people who I learn from by listening. The best teacher I've learnt most from was my finance and accountancy tutor who was very no nonsense and verbally efficient and spoke like a lawyer so there was no room for open interpration becssue fundamentally, when I do listen to a person talking, If there is any room to misunderstand or find another way of interpreting the words then I'll find it and I'll be able to think of three potential meanings for what a person said and its most likely I will pick the wrong meaning, which is very annoying for me and probably irritating to people who aren't articulate. ",
            "date": "Answered April 24, 2020",
            "views": "304",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marisa Almor",
                    "user_href": "/profile/Marisa-Almor"
                },
                {
                    "user_id": "Reba Schneider",
                    "user_href": "/profile/Reba-Schneider-1"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Joseph Tan",
                    "user_href": "/profile/Joseph-Tan-123"
                },
                {
                    "user_id": "Tom Gee",
                    "user_href": "/profile/Tom-Gee-8"
                },
                {
                    "user_id": "Amy Bojean Gutel",
                    "user_href": "/profile/Amy-Bojean-Gutel"
                },
                {
                    "user_id": "Rainer Rodrigues",
                    "user_href": "/profile/Rainer-Rodrigues-2"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael J. McFadden",
                "href": "/profile/Michael-J-McFadden"
            },
            "answer_text": "I’d never formalized it with the term, but I think I probably have this problem to a significant degree. I do OK in one-on-one in-person conversations in the flesh, but aside from that… I simply tell folks to email me. Information over a telephone seems to literally go “in one ear and out the other.” LOLOL!!! I had NEVER looked into it before, BUT you’ll see something very interesting if you take a look at this N-Gram: Google Ngram Viewer I may be misinterpreting correlation as causation, but doesn’t the introduction of the telephone seem to track the frequency of the phrase to a significant early extent? Some of the more recent curve would be harder to explain (It’s unfortunate that N-Gram seems to be stuck at 2008! ::sigh::) but the timing early on tracks pretty nicely with the telephone!) MJM, who does, as noted, prefer email…",
            "date": "Answered April 27, 2020",
            "views": "169",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Nelson",
                    "user_href": "/profile/Karen-Nelson-65"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Lorraine Greenbaum",
                    "user_href": "/profile/Lorraine-Greenbaum"
                },
                {
                    "user_id": "Michelle Callard-Stone",
                    "user_href": "/profile/Michelle-Callard-Stone"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Julia Brown",
                    "user_href": "/profile/Julia-Brown-324"
                },
                {
                    "user_id": "Gordon Mills",
                    "user_href": "/profile/Gordon-Mills-16"
                }
            ]
        }
    ]
}