{
    "title": "How to rid myself of tongue tension when singing - Quora",
    "tags": [
        "Tongues",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaitsiri Mongkolsmai Lin",
                "href": "/profile/Gaitsiri-Mongkolsmai-Lin"
            },
            "answer_text": "Tongue tension may stem from other areas of tension, not just the tongue alone. You need to learn how to practice relieving tension in all areas of the voice one at a time, and it will probably take months to years before you build the correct practice. In general the tongue should rest, with the tip behind the lower teeth. The tendency is for the tongue to rise in the back and close off the vocal tract a little, which creates a sort of blocked sound. I’m not a vocal teacher, so I would recommend that you find a good one who can listen to you and help you identify all your sources of tension and begin to help you eliminate them. I would also point you to read more about this at Karyn O’Connor’s Singwise - there are also YouTube videos by her and other good teachers (Kimberley Smith, Inspired to Sing, and Justin Stoney, Voice Lessons to the World) about relieving various kinds of vocal tension. Throat, Jaw, Tongue and Neck Muscle Tension and Pain During Singing - Causes and Solutions Good habits in singing will eventually lead to good speaking habits, but it can take a lot of conscious attention to how you use your voice and proper practice. ",
            "date": "Answered March 20, 2018",
            "views": "728",
            "upvotes": " Answer requested by Bronwyn Riani",
            "upvoters": [
                {
                    "user_id": "Byron R Smith",
                    "user_href": "/profile/Byron-R-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Mays",
                "href": "/profile/Michael-Mays-2"
            },
            "answer_text": "My hunch is that you may have tension elsewhere that causes the tongue to lock up. In any case, the tension in the tongue could be causing tension elsewhere. I would suggest trying to “paint” the back of your bottom front teeth very lightly. It seems the tongue is desperate for something to do; let’s at least see if we can’t redirect some of that nervous energy. Also keep the head loose on the neck. I don’t mean “let your head flop around,” but keep it mobile. Tongue tension can stifle looseness elsewhere; if you can keep the neck free, it may find its way into your tongue. Without seeing and hearing you, it’s hard to be helpful beyond that. ",
            "date": "Answered March 20, 2018",
            "views": "428",
            "upvotes": " View 1 Upvoter "
        }
    ]
}