{
    "title": "How to write a chord progression for a whole song? I can understand chord progressions for 8 bars, but won't it get really repetitive over 2 - 3 minutes - Quora",
    "tags": [
        "Chord Progressions",
        "Guitar Chords"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Kurpas",
                "href": "/profile/Simon-Kurpas"
            },
            "answer_text": "You could just not think in chords at all… …besides that, yes, that can get repetitive—which isn’t necessarily a bad thing, btw.—and by itself might sound quite boring, but, to only have a single chord progression played that never changes as the whole of the music is… unusual. Thing is, not only can you change up the chord progression or transpose it into another key at different points, there are also other instruments that play different things over those chords. Also, you could have different rhythmic accents—or just plain a completely different rhythm and/or meter(s) at times— the chords themselves could be changed up a bit here and there, like playing some inversion of a chord, substitute it, or just make it denser by adding other notes to the chord… even a simple 7-chord can sound quite intense if the rest is all just triads. If there are lyrics then those will add variation as well… I mean, you rarely—but not never—hear a song made up of literally just a single phrase repeated over and over. By the time you have the actual finished instrumentation and arrangement—aka the actually finished song, because just having chords and maybe the lyrics is not a finished song, at all—the repetitive nature of the chord progression will actually have and effect closer to “anchoring” the song in a way that makes it easier to follow while the rest makes it so it isn’t boring.  And then again, repetition in music is not a necessarily bad thing, quite the contrary… a musical piece completely devoid of repetition would be aimless and chaotic. Interesting as a concept, maybe, but in practice probably borderline unlistenable… yet even the polar opposite, something so repetitious as to be devoid of changes, can be quite nice to listen to—for example, one of my favorite tracks by Daft Punk, Make Love, is repetitious to an almost absurd degree, yet taking that repetition away would diminish the track, not enhance it. ",
            "date": "Answered April 29, 2018",
            "views": "457",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig Crawford",
                    "user_href": "/profile/Craig-Crawford-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Bornheimer",
                "href": "/profile/Ernie-Bornheimer"
            },
            "answer_text": "Very few songs repeat 8 bars of the same chords over and over. Well, I take that back. I’m not familiar with current pop music. But from Tin Pan Alley through the rock era, most popular songs had at least a bridge, often a chorus, and sometimes both (plus maybe a pre-chorus and intro) in addition to the verse. All of these bits provide contrast to the verse, and almost always contain (somewhat) different chords than the verse. If you wanted my advice, I’d say listen to a lot of songs by songwriters generally regarded as “great” and try to figure out what they’re doing harmonically, and how the chords, melody, and lyrics work together. OR, decide to be repetitive and revel in it. There are some fabulous songs that use the same short sequence of chords over and over. It’s possible to go that route, but you have to keep the listener’s interest somehow. One of the greatest albums of all time is Van Morrison’s Astral Weeks. About half the songs on the album have just a couple chords repeated over and over. It works because of the sheer intensity of Morrison’s performance. Maybe give a listen to Tom Petty’s song Free Fallin’. It’s the same two bars over and over, but there is a distinguishable verse, chorus, and instrumental break. I think this song only works because the hooks are so good and the lyrics so spare and evocative. Hmmm, what else? The Rolling Stones’ Last Time is pretty repetitive, but still a great song. Day Tripper has the same riff most of the way through (the chords change and the riff changes with them). I’ll Take You There (by the Staple Singers) is the same riff all the way through. I’m on a roll now. Here are some more: Born on the Bayou Cloudy Shoes Jump Into the Fire Papa Was a Rolling Stone The Passenger ",
            "date": "Answered May 1, 2018",
            "views": "602",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Rapaport",
                    "user_href": "/profile/Steve-Rapaport"
                },
                {
                    "user_id": "Johnnie Lockett",
                    "user_href": "/profile/Johnnie-Lockett"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Lerissa Patrick",
                    "user_href": "/profile/Lerissa-Patrick"
                },
                {
                    "user_id": "David McKay",
                    "user_href": "/profile/David-McKay-22"
                },
                {
                    "user_id": "Richard Enna",
                    "user_href": "/profile/Richard-Enna"
                }
            ]
        }
    ]
}