{
    "title": "How many K-Pop groups does an average K-pop stan stan? - Quora",
    "tags": [
        "K-Pop Fandoms",
        "K-Pop Idols",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Morayo Adedapo",
                "href": "/profile/Morayo-Adedapo"
            },
            "answer_text": "you can stan however many groups you want, but here’s the groups i stan: EXO(bias is Chanyeol)   BTS(bias is J-hope)   Ateez(Bias is Minki)   The Rose(bias is woosung)   Day6(bias is jae)   Vromance(bias is chandong)   SuperM(Bias is baekhyun)   NCT 127(bias is haechan)   NCT Dream(bias is Jisung)  (we miss you mark)  BigBang(bias is gdragon)   Winner(bias is Mino)   I think that’s all for Boy groups now girl group stans (I apologize to all the feminists out there I don’t like as many girl groups, most of them are too cute for me) Red Velvet(bias is Wendy)   Mamamoo(bias is Hwasa)   Blackpink(bias is rose)   Twice(bias is undetermined, since i’m an on and off stan)  Kard(co-ed but what ever. Bias is J.seph)   So…I stan a lot of groups. I also stan a crap ton of solo artists as well(hoody, shaun, crush, dean, zico, zion.t, grey, hyolyn, jessi, Cl, giriboy…there’s more). I’m a really dedicated multi stan. But like i said, you can stan as many or as few as you would like. It’s up to your preference. ",
            "date": "Answered April 23, 2020",
            "views": "176",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hind Jallab",
                    "user_href": "/profile/Hind-Jallab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aspry Wright",
                "href": "/profile/Aspry-Wright"
            },
            "answer_text": "How many K-Pop groups does an average K-pop stan stan?  I don't know. What's an “average K-pop stan?” One group? Ten? And if the stan's name is Stan then they have to buy me a meatball sandwich. Look, if you don't make the rules, I'll have to. Oh look, my friend the Internet is here to help. Allkpop will set the bar for our experiment via their own website poll.  They'll have to represent fans around the globe. 1-5 groups is hugely popular while 6-10 makes a close second. Then 21-25 improbably makes things weird. So, we'll say the “average\" K-pop fan stans about 6 groups. Several things can throw off my equation. One could argue the possibility that no one who took the poll was “average.” Or someone could say that my number leans more toward 5 than 6. If you're debating these things, you've just been cooped up in the house for too long. Like me. For instance, I have already fully analyzed the Mandalorian's fighting style and I'm sure I can beat him.  So yeah, 6 groups. How many groups do you stan? Are you “average?” Am I? Let's look. Twice Blackpink Oh My Girl Apink SNSD Gfriend Pink Fantasy (I'm not average) (G)-idle BTS Big Bang Winner Red Velvet Mamamoo Dreamcatcher Loona Okay, that's enough. How many K-Pop groups does an average K-pop stan stan? Less than me.  Okay bye ",
            "date": "Answered April 23, 2020",
            "views": "14",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Zukowsky",
                    "user_href": "/profile/Leah-Zukowsky"
                },
                {
                    "user_id": "Sakshi Wadekar",
                    "user_href": "/profile/Sakshi-Wadekar-5"
                },
                {
                    "user_id": "Ella Nuckols",
                    "user_href": "/profile/Ella-Nuckols"
                },
                {
                    "user_id": "Khe-Sheen Ooi",
                    "user_href": "/profile/Khe-Sheen-Ooi"
                },
                {
                    "user_id": "Mia Starwalker",
                    "user_href": "/profile/Mia-Starwalker"
                },
                {
                    "user_id": "Jay M. Short",
                    "user_href": "/profile/Jay-M-Short"
                },
                {
                    "user_id": "Emily Knight",
                    "user_href": "/profile/Emily-Knight-192"
                },
                {
                    "user_id": "Savannah Goodwin",
                    "user_href": "/profile/Savannah-Goodwin-15"
                },
                {
                    "user_id": "Zahraa Zerkan",
                    "user_href": "/profile/Zahraa-Zerkan"
                },
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                }
            ]
        }
    ]
}