{
    "title": "How to make good song covers without knowing how to play any instrument - Quora",
    "tags": [
        "Musical Instruments",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Atkin",
                "href": "/profile/Ian-Atkin"
            },
            "answer_text": "That's not something you just do. It's a skill that will take at least a couple of years before you can even hope of doing a good job. Most songs don't just rely on single notes, but are a subtle mix of chords and the solo lines. Even if you were to purchase sheet music and program a song into a Digital Audio Workstation, note by painful note, I wouldn't have much faith in the result. In my experience, sheet music often contains glaring errors, such as incorrect chord changes. An experienced musician will hear the mistake immediately, but if it's subtle, you likely won't. As Erik Verhoef said, you could cheat, but where's the fun in that? Last year, I made a cover of a Miley Cyrus song for my daughter (don't ask). It took about two hours to get the basic feel right, and another couple of days of tinkering to get it close to perfect. I've been playing keyboards since I was 13. I recommend keyboards, because synthesizers and samples can emulate most of what you hear in a song, at least to a certain extent. The skill of producing half-decent cover versions is not something you can get good at overnight. It takes practice and a lot of patience to get it right. Listening to the same song over and over, dozens of times, can get really old, really quickly. I can play by ear, which is to say, after hearing a line in a song, I can reproduce it more or less immediately. This, again, is something that comes from experience. So, there is no substitute, and no easy way. If you want to produce cover songs, you'll have to learn to play an instrument.  ",
            "date": "Answered February 7, 2016",
            "views": "56",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tushar Bhardwaj",
                    "user_href": "/profile/Tushar-Bhardwaj-26"
                },
                {
                    "user_id": "Aaron Thomas",
                    "user_href": "/profile/Aaron-Thomas-95"
                },
                {
                    "user_id": "Ken Natco",
                    "user_href": "/profile/Ken-Natco"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Porter Peterson",
                    "user_href": "/profile/Porter-Peterson"
                },
                {
                    "user_id": "Erik Verhoef",
                    "user_href": "/profile/Erik-Verhoef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matias Diez",
                "href": "/profile/Matias-Diez"
            },
            "answer_text": "I’ll try to be more encouraging here by saying you can make good song covers or whatever music you want without playing any instrument yet you can’t create any god or bad song if you don’t at least know something about music. Anyway the answer is easy, you can’t play it? then write it. It is not cheap but you can have a set up of VSTi fr different instruments, integrated with cubase or protools and you just go ahead and write the midi files. If you don’t know how to play any instruments, you don’t know how they work and you don’t know how to write some music, well at that point I would suggest to start studying some harmony and composition. ",
            "date": "Answered September 23, 2016",
            "views": "22",
            "upvotes": "0"
        }
    ]
}