{
    "title": "How to get free Robux on Roblox 2020 - Quora",
    "tags": [
        "Robux",
        "ROBLOX (online game)",
        "2020 (year)",
        "Free Products"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naku Erinite",
                "href": "/profile/Naku-Erinite"
            },
            "answer_text": "Well, technically speaking, nothing is trully ‘free’ - you’ll either have to work, or pay for it. Now, I’m assuming that you’re just talking about getting robux without having to steal your mom’s credit card, so I may suggest some options for you. 1 - Working for a roblox user/group : This one is pretty self-explanatory. You can start learning a skill like making gfx, building, writting, scripting, etc - anything you like! You can even invent new jobs if you’re creative! Once you’ve mastered the skill on a specific level, you can start searching around roblox games, groups, discord or youtube for groups or people that are hiring developers and if you’re lucky, the people you’re working for may pay you robux. Now, I may have to remind you that this could be against the TOS, but I haven’t seen anyone getting severely punished nor warned yet so it should be fine. Also, watch out for scammers! Always make the person pay half of your price first, or they may just take your hard work and disappear. I learned this the hard way. 2 - Work on your own game! : Recently, roblox has made a feature that helps devs and encourage them to make games. As far as I remember, it works like this - Whenever you create a game in roblox studio and publish it, roblox will keep track on the game’s satistics (sorry if I’m spelling that wrong) - Including how long players have been playing that game. And the special part about this is you will get paid if the player spends a reasonable amount of time in the game, but don’t think about fooling the system tho, it will only count if the person who’s playing your game has Premium. So, if you can, try to make your game as interesting as possible, and gives benefits to Premium players. Who knows, maybe your game will even get on the front page and gets thousands of visitors a day if you’re lucky! Also, gamepasses can be useful too since they are free to create! 3 - Free Robux Sites and Groups : Alright listen to me first, it isn’t that easy, but there *may* be real robux groups out there. For most of the time, when you hear of free robux you’d probably imagine some sketchy badly designed sites which require you to download stuff (I mean honestly I can’t blame you, 99% of free robux sites/groups are like that anyways), but that isn’t always the case. Personally you can search around for those groups, but it would probably be a tedious and boring journey which for most of the time would lead you to nowhere, but if you can, try going for popular sites that were confirmed to be safe, search for the infos of people who claimed that the site works, etc. My brother was lucky and got robux from a site that he said was confirmed by his favourite youtuber (I’m not going to mention what it was tho since I’m not 100% sure about whether the website is safe or not and I don’t advertise for people). Remember not to download any suspicious stuff or enter your private infos tho. -All I have for now. Remember those are just from my personal experience.- ",
            "date": "Answered August 23, 2020",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Declan PlayzRoblox",
                    "user_href": "/profile/Declan-PlayzRoblox"
                },
                {
                    "user_id": "To Com Sono",
                    "user_href": "/profile/To-Com-Sono"
                },
                {
                    "user_id": "Lyn Brooks",
                    "user_href": "/profile/Lyn-Brooks-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Choese Trivel",
                "href": "/profile/Choese-Trivel"
            },
            "answer_text": "There are 4 ways you can get Robux, 3 require money. Buy it (requires money)Create a game and sell gamepasses (requires premium)Create and sell a hat, shirt or pants (requires premium)Be friends with a rich person who owns a group and beg them to give you a group payout (free, and a bannable offence)Any and all websites that claim to give you free Robux will steal your account or use your computer for data mining. ",
            "date": "Updated June 21, 2020",
            "views": "45",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vanessa Carvalho",
                    "user_href": "/profile/Vanessa-Carvalho-54"
                },
                {
                    "user_id": "Oscar Martin",
                    "user_href": "/profile/Oscar-Martin-56"
                },
                {
                    "user_id": "Annabel Wong",
                    "user_href": "/profile/Annabel-Wong-13"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/B-A-G-U-E-T-T-E"
                },
                {
                    "user_id": "Alex Alexson",
                    "user_href": "/profile/Alex-Alexson-8"
                },
                {
                    "user_id": "Epic Things",
                    "user_href": "/profile/Epic-Things-6"
                },
                {
                    "user_id": "Exploit Alert Observer",
                    "user_href": "/profile/Exploit-Alert-Observer"
                },
                {
                    "user_id": "NY Yearwood",
                    "user_href": "/profile/NY-Yearwood"
                },
                {
                    "user_id": "Dechief Theo",
                    "user_href": "/profile/Dechief-Theo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Barrish",
                "href": "/profile/Adam-Barrish-1"
            },
            "answer_text": "You don’t. There is no way to get free Robux. Nothing is free in this world. If you don’t pay by money, you pay by effort, sacrifice, or item dysfunction. Remember that as you continue to get older. It will serve you well as you progress through your life. ",
            "date": "Answered December 12, 2019",
            "views": "77",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Barnes",
                    "user_href": "/profile/Jonathan-Barnes-93"
                },
                {
                    "user_id": "Venkatraman S",
                    "user_href": "/profile/Venkatraman-S-23"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/B-A-G-U-E-T-T-E"
                },
                {
                    "user_id": "Alex Alexson",
                    "user_href": "/profile/Alex-Alexson-8"
                },
                {
                    "user_id": "Hi Im Stupid",
                    "user_href": "/profile/Hi-Im-Stupid"
                },
                {
                    "user_id": "ALEXANDER MIRANDA",
                    "user_href": "/profile/ALEXANDER-MIRANDA-51"
                },
                {
                    "user_id": "Gacha Shadow",
                    "user_href": "/profile/Gacha-Shadow-5"
                },
                {
                    "user_id": "Ryan Mcvicker",
                    "user_href": "/profile/Ryan-Mcvicker-6"
                },
                {
                    "user_id": "Aesthetic Cookie",
                    "user_href": "/profile/Aesthetic-Cookie-1"
                },
                {
                    "user_id": "Isabel Andrea",
                    "user_href": "/profile/Isabel-Andrea-8"
                },
                {
                    "user_id": "Jack Iversen",
                    "user_href": "/profile/Jack-Iversen"
                },
                {
                    "user_id": "W4sher 123",
                    "user_href": "/profile/W4sher-123"
                },
                {
                    "user_id": "Alana Roybal",
                    "user_href": "/profile/Alana-Roybal"
                },
                {
                    "user_id": "Kathleen Bednaz",
                    "user_href": "/profile/Kathleen-Bednaz"
                },
                {
                    "user_id": "Stop Scamming People Idiot LOSER",
                    "user_href": "/profile/Stop-Scamming-People-Idiot-LOSER"
                },
                {
                    "user_id": "Ian Rbx",
                    "user_href": "/profile/Ian-Rbx"
                },
                {
                    "user_id": "Kamrin Hanley",
                    "user_href": "/profile/Kamrin-Hanley"
                },
                {
                    "user_id": "Anton Yellowbird",
                    "user_href": "/profile/Anton-Yellowbird"
                },
                {
                    "user_id": "Isabel Criado",
                    "user_href": "/profile/Isabel-Criado-1"
                },
                {
                    "user_id": "Claudio Lusi",
                    "user_href": "/profile/Claudio-Lusi"
                },
                {
                    "user_id": "Tenisha Rogers",
                    "user_href": "/profile/Tenisha-Rogers-1"
                },
                {
                    "user_id": "Silhouette",
                    "user_href": "/profile/Silhouette-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shanica Fervil",
                "href": "/profile/Shanica-Fervil"
            },
            "answer_text": "There are many ways to get free Robux. 1. Buy it from the website- it's always best just to buy it. 2. Make some clothes on the Roblox catalog- You can just make your own clothes on Roblox using Roblox Studio 3. Join a giveaway/ Group funds- Now, there may be a person who could be doing a giveaway, all you have to do is join and do what they said to do. Group funds, on the other hand, are when a Roblox group has Robux in it to give their members from the group Robux. I hope that helped! :) ",
            "date": "Answered July 11, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mona Jaiswal",
                    "user_href": "/profile/Mona-Jaiswal-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthonie Johnston",
                "href": "/profile/Anthonie-Johnston-1"
            },
            "answer_text": "Quite simply, you can’t. Life doesn’t work that way. The closest you might get to free robux is asking one of your parents or relatives to buy you some, but that comes at a cost to them. You might try actually working for a little bit of money here and there, and save up $10 or $25 to buy a Roblox card and get some robux with that. In the long run, you’ll be much better for it! ",
            "date": "Answered February 1, 2020",
            "views": "23",
            "upvotes": " Answer requested by Rafay Hussain Sabri",
            "upvoters": [
                {
                    "user_id": "Barock Caleb",
                    "user_href": "/profile/Barock-Caleb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Declan PlayzRoblox",
                "href": "/profile/Declan-PlayzRoblox"
            },
            "answer_text": "It does not work, but you can go on a computer and highlight the amount of Robux you have on the website. Hit inspect, find the amount, highlight that, type the amount of Robux you want and thee you go! It does not work, but you can prank someone! Hehe ",
            "date": "Answered October 18, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kinley Alexis",
                    "user_href": "/profile/Kinley-Alexis"
                },
                {
                    "user_id": "Sonicbros5 2",
                    "user_href": "/profile/Sonicbros5-2"
                },
                {
                    "user_id": "Melanie Sopkowicz",
                    "user_href": "/profile/Melanie-Sopkowicz"
                },
                {
                    "user_id": "Aesthetic Cookie",
                    "user_href": "/profile/Aesthetic-Cookie-1"
                },
                {
                    "user_id": "Just Why",
                    "user_href": "/profile/Just-Why-24"
                },
                {
                    "user_id": "Amii Burton-Pye",
                    "user_href": "/profile/Amii-Burton-Pye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kk Kingkev",
                "href": "/profile/Kk-Kingkev"
            },
            "answer_text": "It's quite hard to get free robux nowadays because the websites could be scams and if you put your roblox password they might hack your account there is a website that is called make robux. Com and you can get free robux ",
            "date": "Answered April 5, 2020",
            "views": "52",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barock Caleb",
                    "user_href": "/profile/Barock-Caleb"
                },
                {
                    "user_id": "Alexei Stucov",
                    "user_href": "/profile/Alexei-Stucov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nery Diaz",
                "href": "/profile/Nery-Diaz-2"
            },
            "answer_text": "You cant really. All free robux games are scams. You would have to work for it but to make a good item or game you would have to know scripting and texturizing or you can pay someone to do it for you but you would have to have or get robux to do most of the things i mentioned above. ",
            "date": "Answered October 24, 2020",
            "views": "29",
            "upvotes": " Answer requested by Daniel Spencer",
            "upvoters": [
                {
                    "user_id": "Alex Alexson",
                    "user_href": "/profile/Alex-Alexson-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "The HungryIronApple",
                "href": "/profile/The-HungryIronApple"
            },
            "answer_text": "Well you can’t get robux without having to spend money or timeassuming you are just not willing to spend money, certain websites can give you such rewards DO NOT click on a website that says “generator”DO find websites that have companies such as AdGate and OfferToro on their site ",
            "date": "Answered October 22, 2020",
            "views": "19",
            "upvotes": " Answer requested by Anton Cary and Daniel Spencer"
        },
        {
            "author_info": {
                "name": "Yan Chekan",
                "href": "/profile/Yan-Chekan"
            },
            "answer_text": "Why on earth are there so many questions about 'Free Robux' on this space!?!!?! See, kid, Free Robux is not a thing, it doesn't exist, and if something promises you \"Free Robux\" then it's a scam. \"If it's too good to be true then it probably is\" -Me, The wise man. ",
            "date": "Answered October 18, 2020",
            "views": "55",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "AJ Steward",
                "href": "/profile/AJ-Steward"
            },
            "answer_text": "You’re still asking for too much since you think stuff is free. There’s always a drawback, or it’s simply not free. Why try spinning the wheel of mysterious drawbacks instead of just paying the flat fee Robux costs? ",
            "date": "Answered July 22, 2020",
            "views": "189",
            "upvotes": " Answer requested by Rafay Hussain Sabri, Richard Deocades and 1 more"
        },
        {
            "author_info": {
                "name": "Gracie Hook",
                "href": "/profile/Gracie-Hook-1"
            },
            "answer_text": "Simple, you can’t. Why don’t people these days pay for Robux? Any websites claiming they give free Robux are SCAMS don’t fall for them. ",
            "date": "Answered July 15, 2020",
            "views": "197",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bland2",
                "href": "/profile/Bland2"
            },
            "answer_text": "there is no way to get free robux anything that promises to give you free robux is lying Robux will never be free, nothing in this world will ever be free. ",
            "date": "Answered August 31, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gamer Ahmed",
                "href": "/profile/Gamer-Ahmed-1"
            },
            "answer_text": "YOU CAN NOT GET FREE ROBUX… PEOPLE…UNDERSTAND THE ONLY WAY TO GET ROBUX IS TO BUY IT THERE IS NOTHING FREE IN LIFE AHHHHHHHHH ",
            "date": "Answered July 4, 2020",
            "views": "567",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacob Guinness",
                "href": "/profile/Jacob-Guinness"
            },
            "answer_text": "You can't. Do not go to free robux websites, or play free robux games. These are scams. ",
            "date": "Answered May 30, 2020",
            "views": "339",
            "upvotes": "0"
        }
    ]
}