{
    "title": "How many songs does an EP have to have to be considered an album? - Quora",
    "tags": [
        "Music Albums",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Rowe",
                "href": "/profile/Ken-Rowe-7"
            },
            "answer_text": "To the OP as well as to add to what GirarVidaLejos said- Its an album no matter how many songs you put on it. Its named the same way a photo album is named, but generally a record album has less songs than a photo album has photos. I’d say if it has 2 songs then Id call it a mini album. To add to Girar’s answer: The “space” you refer to is created by how thin the track is. Thicker tracks like from the 1960’s could hold about 20 minutes,(SP) per side, whereas thinner tracks (EP) could hold about 28 minutes per side. You can put as many songs as you like so long as there is room for the songs and the spaces between them, including the lead space and the return. When EP’s first came out, all the manufacturers switched over to EP etching and no one made SP albums much any more. “Singles” used the same technology of each time period but were smaller in size and rotated at 45 RPM. (faster than 12 inch) The SP would usually have an A and a B side, but in the time of EP you could fit as many as 4 or even 5 songs if they were short enough. Also- there are very few singles that were put out that only had one song on them. Usually there was a promotional side and the other side had some other song that was from the band or artist. ",
            "date": "Answered November 23, 2017",
            "views": "12",
            "upvotes": " Answer requested by José Marques",
            "upvoters": [
                {
                    "user_id": "Jeroen De Wijn",
                    "user_href": "/profile/Jeroen-De-Wijn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary McAdam",
                "href": "/profile/Gary-McAdam-2"
            },
            "answer_text": "In days past, if a release had two or three songs (each no more than 10 minutes in length), it was classified as a single. Four to six songs (and a max running time of about 25 minutes) would see the offering classed as an E.P, whilst anything more than that was considered to be a full album. In today’s market (where digital music is the norm), those definitions aren’t as rigid any more, but for the most part still hold true. ",
            "date": "Answered July 29, 2020",
            "views": "135",
            "upvotes": " View 1 Upvoter"
        }
    ]
}