{
    "title": "How to remove the vocals from any song - Quora",
    "tags": [
        "Vocal Removing",
        "Music Editing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "Lead vocals are placed in the centre of the mix. HOW IT’S DONE It is possible in hardware - but MUCH easier in software - to make a version of a recording where the Left and Right tracks of a stereo recording are manipulated to give you : Left channel PLUS right channel on one trackLeft channel MINUS right channel on another trackTrack 1 will then contain a mono version of the recording, everything is centre, but of course things that were centre to start with are now twice as loud. We call this the SUM channel. Track 2 will contain a version of the track where anything that was in the centre has been subtracted from itself… leaving nothing. The remaining information is what was only left or only right (as strong as before) and things in-between left and right but not central (weaker but present). We call this the DIFFERENCE channel. If you now play back both the SUM and DIFFERENCE channels together, what you hear is exactly what you did when it was just LEFT and RIGHT channels. HOWEVER, if you reduce the volume of the SUM channel, the things that were in the centre will get quieter and the stereo effect will increase as well. Some audio systems have a knob marked “WIDTH” that performs EXACTLY the functions described above. There are software plugins that can do this if added to most digital audio programs. Some audio programs, like AUDACITY, have a one-click “Vocal remover” which will take away the SUM channel leaving only the DIFFERENCE channel, and hopefully the vocals were all panned to the centre so they’re gone… HINT: usually they aren’t all in the centre, but it works for 80% of vocals. Unfortunately, when the vocals go, so can everything else in the centre of the mix - Bass, Kick Drum, Snare Drum, Mid-range string parts, the middle range of a stereo piano, and so on. It can sound very odd. The best way to get a good backing track with no lead vocal is to buy a professionally made “instrumental only” version of the track. There are dozens of internet sites that offer them from free of charge to a few tens of dollars per track. The good news is, by buying a track, you’ll feed a starving musician AND sound better! ",
            "date": "Answered August 26, 2020",
            "views": "513",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vignesh J",
                "href": "/profile/Vignesh-J-26"
            },
            "answer_text": "Step 1: Open Audacity If you haven't downloaded it already, download it. It is free. If you have, then open it up to a new project.  Step 2: Drag In The Song Drag in the song from your desktop, or any folder. You can also drag in the song straight from iTunes.    Step 3: Split The Stereo Track Go to the upper left of the sound track and click on the drop down arrow next to the name of the song. Click on \"Split Stereo Track\".  Step 4: Select The Bottom Track To do this, double click on the blue part of the lower track. It should turn a darker shade of gray than the other track.  Step 5: Invert The Bottom Track Go to the Effects tab and click on \"Invert\". This flips around the lower track.  Step 6: Set Both Tracks To Mono Next go back to the drop down arrow next to the name of the song, and click on \"Mono\". Do this for both tracks. This sets it so that each audio signal is routed through a single channel.  Step 7: E  Export It Lastly, click the play button to make sure that the vocals are gone. If so, go up to the File tab and click \"Export\". Once you do this, a box or two may pop up asking you to choose what name you want to export it as. Type in the name you want and press either Ok or Export. You should be good! If your vocals could not be removed, I apologize, but some songs have vocals that can't be removed completely. I wish you the best of luck though!     Hope U understand!!!!!!!!!!!!!!!!!!!!!!! ",
            "date": "Answered December 30, 2016",
            "views": "65",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aryn Wolf",
                    "user_href": "/profile/Aryn-Wolf"
                },
                {
                    "user_id": "Sourabh S",
                    "user_href": "/profile/Sourabh-S-9"
                },
                {
                    "user_id": "Rahul Raj",
                    "user_href": "/profile/Rahul-Raj-1093"
                },
                {
                    "user_id": "Vidya V",
                    "user_href": "/profile/Vidya-V-8"
                },
                {
                    "user_id": "Siddhartha Majji",
                    "user_href": "/profile/Siddhartha-Majji"
                },
                {
                    "user_id": "Brian Davis",
                    "user_href": "/profile/Brian-Davis-144"
                },
                {
                    "user_id": "Piyush Kumar",
                    "user_href": "/profile/Piyush-Kumar-128"
                },
                {
                    "user_id": "John Lawrence",
                    "user_href": "/profile/John-Lawrence-316"
                },
                {
                    "user_id": "Cody",
                    "user_href": "/profile/Cody-355"
                },
                {
                    "user_id": "Venu Gopal",
                    "user_href": "/profile/Venu-Gopal-54"
                }
            ]
        }
    ]
}