{
    "title": "How many pieces of music did Mozart compose over his life time? - Quora",
    "tags": [
        "Classical Music Composition",
        "Wolfgang Amadeus Mozart (composer)",
        "Classical Composers",
        "Contemporary Classical Music",
        "Composers",
        "Music Composition",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roel Weerheijm",
                "href": "/profile/Roel-Weerheijm"
            },
            "answer_text": " Ludwig Ritter von Köchel (1800–1877) was a.o. a musicologist. He made one of the first serious attempts to catalogue of all of Mozarts compositions: Chronologisch-thematisches Verzeichnis sämmtlicher Tonwerke W.A. Mozarts. After his death, several other musicologists revised his catalogue, mostly adding compositions. The most recent (sixth) revision was published in 1964, last adapted in 1983, and is still used. Several of Mozarts works were discovered only after Köchel had died, and several works proved hard or even impossible to date. Köchels catalogue sorts Mozarts compositions in chronological order. Every composition has its own number, starting with K or KV (both short for Köchel-Verzeichnis: Köchel-catalogue). So KV 1 is Mozarts first composition and KV 626 is his last. In the later revisions, some KV-entries have one or more letters behind the number. In the present table (from 1983), KV 1 consists of six short compositions, numbered KV 1a - KV 1f. KV 293 consists of five compositions, numbered KV 293a - KV 293e. On the other hand, some KV-entries are not used, like KV 17, KV 18, KV 36 and KV 49 up to KV 60. A very important (yet incomplete) source for this catalogue is Mozarts own catalogue: during parts of his life, especially in his Viennese years, he kept score of the compositions he wrote and the dates at which he finished them. Last but not least: we still have to consider the possibility of still undiscovered compositions that will hopefully be unearthed in the future, as well as compositions of which we’re not sure whether Mozart wrote them.  So we have to conclude that Mozart wrote anywhere between 626 and +/- 800 compositions. The important compositions include: 21 operas17 masses, two of which are unfinished (including the Requiem)41 numbered symphonies6 unnumbered symphonies (and another six that are doubtful)30 piano concertos (seven of which are adaptations of piano compositions by C.P.E. Bach, J.C. Bach, Eckart, Honauer, Raupach, Schobert)5 violin concertos4 horn concertos7 concertos for other solo-instrumentsmore than a dozen single-movement pieces for solo-instrument and orchestra17 church sonatas (for chamber ensembles)27 divertimenti11 serenades5 string quintets23 string quartets6 piano trios2 piano quartets4 flute quartets32 violin sonatas18 piano sonatas6 piano sonatas à quatre mains16 variation cycles for piano soloThe rest of the compositions include a.o. a lot of dances (minuets, German dances, contradances), marches, songs, religious choir pieces and hymns, and several organ pieces. Considering Mozarts productive life lasted for only 30 years (as he died very young at age 35), he composed on average 30 pieces each year - small pieces like the marches and minuets, but also very big compositions like operas, piano concertos and symphonies - next to his careers as a piano virtuoso, piano teacher, conductor… And well over a hundred of his compositions made it to the very core of the repertoire of almost every musician, whether in a choir, an orchestra, a chamber ensemble or as a soloist. This is truly exceptional. ",
            "date": "Answered January 24, 2019",
            "views": "26",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Bryan Querioz",
                    "user_href": "/profile/John-Bryan-Querioz"
                },
                {
                    "user_id": "Kile Baker",
                    "user_href": "/profile/Kile-Baker-1"
                },
                {
                    "user_id": "Daniel Moguel",
                    "user_href": "/profile/Daniel-Moguel"
                },
                {
                    "user_id": "Gatotkaca Pambudi",
                    "user_href": "/profile/Gatotkaca-Pambudi"
                },
                {
                    "user_id": "Ryan Kim",
                    "user_href": "/profile/Ryan-Kim-388"
                },
                {
                    "user_id": "Gregory Miner Gustafson",
                    "user_href": "/profile/Gregory-Miner-Gustafson"
                },
                {
                    "user_id": "Jean-Michel Reynaud",
                    "user_href": "/profile/Jean-Michel-Reynaud"
                },
                {
                    "user_id": "Bill Flewelling",
                    "user_href": "/profile/Bill-Flewelling"
                },
                {
                    "user_id": "Andrei Cusiac",
                    "user_href": "/profile/Andrei-Cusiac"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Mendoza",
                "href": "/profile/Bernard-Mendoza-5"
            },
            "answer_text": "Narrow, technical explanations take you nowhere near the miracle that was, is, Wolfgang Amadeus Mozart A famous woman musicologist, in a programme on BBC-tv, once told us that Mozart’s music - what MADE it Mozart - was that you could always sing it. “If you can’t sing it, it isn’t Mozart” were her words. They’ve stuck with me ever since. She was smiling, yes, but she meant it. Look at it this way. Every one of Mozart’s operas is packed full of songs (arias, if you like), all of them glorious to sing. He was terribly fussy about who was going to sing them AND would throw a first class wobbler if his favourite soprano (known as “la Bastardella”, if I remember rightly) wasn’t available because of a prior engagement. Just read his published diaries if you want chapter and verse. Schubert wrote songs, wonderful song cycles, as did Gustav Mahler in a much later era; but opera was Mozart’s passion and it shows in every trill. People will tell you - far more erudite than me - that Mozart was the greatest composer of opera; not Verdi, not Puccini or Wagner (heaven help us) but Mozart. The man who didn’t write songs! By the way, don’t be misled by Amazon-speak. They call everything “songs”, even orchestral suites and symphonies! Treat yourself. Listen to the Marriage of Figaro, to Cosi fan Tutte, listen to the Queen of the Night in The Magic Flute. Songs, songs, songs. Posh people call them arias, but who cares? Enjoy them. Love Mozart. Stop counting. ",
            "date": "Answered July 28, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gregory Miner Gustafson",
                    "user_href": "/profile/Gregory-Miner-Gustafson"
                }
            ]
        }
    ]
}