{
    "title": "How is it possible that music makes a difference to a plant's growth? - Quora",
    "tags": [
        "Plants",
        "Botany"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudarshan Nambiar",
                "href": "/profile/Sudarshan-Nambiar"
            },
            "answer_text": "I know it sounds weird but they say and Experts have proved that music can make a difference to a plant’s growth. Sad but True because I like Rock music —- In a 1973 experiment by Dorothy Retallack, then a student of Professor Francis Brown, three groups of plants were exposed to various types of musical sounds. For one group, Retallack played the note F for an 8-hour period. For the second group, she played similar note for three hours. The third controlled group remained in silence. The first group died within two weeks, while the second group was much healthier than the controlled group. Fascinated by Retallack's findings, two other students went on to do their own test. Plants exposed to Hayden, Beethoven, Brahms, and Schubert grew towards and entwined themselves around the speakers. Another plant group grew away from a speaker that played rock music. That group even tried to climb a glass-walled enclosure in what appeared to be an attempt to get away from the sound. Retallack later replicated the experiment with rock music (like Led Zeppelin and Jimi Hendrix) on a variety of plants. She observed abnormal vertical growth and smaller leaves. She also observed the plants to have damage similar to that associated with excessive water uptake. In the experiment, marigolds died within two weeks. No matter which way they were turned, plants leaned away from the rock music source. These findings were documented in Retallack's 1973 book The Sound of Music and Plants. Strangely, plants’ musical tastes show a remarkable congruence with those of the humans reporting them. — Daniel Chamovitz ",
            "date": "Answered May 27, 2017",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Decker",
                "href": "/profile/Mark-Decker-1"
            },
            "answer_text": "I don’t know about music affecting plant growth but my stepfather once read an article regarding a theory that plants grow better under wind movement vs. just sitting still as is the case with indoor plants. He jokingly said to my Mother that maybe she should shake all their indoor plants. He came home one day to find her shaking the plants and started laughing and asked what she was doing to which Mom replied, “Well you TOLD me to shake the plants!” She was a little gullible sometimes.. ",
            "date": "Answered May 27, 2017",
            "views": "66",
            "upvotes": "0"
        }
    ]
}