{
    "title": "How many bassists has Metallica had? - Quora",
    "tags": [
        "Robert Trujillo",
        "Thrash Metal (music genre)",
        "Bass Guitarists",
        "Metallica (band)",
        "Heavy Metal (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Drew Dewar",
                "href": "/profile/Drew-Dewar"
            },
            "answer_text": "Four. Five, technically. The first was Ron Mcgovney, who was with the band very shortly and soon left after former guitarist Dave Mustaine poured a full can of beer on his bass. This is also why Dave was kicked out and formed Megadeth. The second was Cliff Burton, who Lead Vocalist/Rhythm Guitarist James Hetfield and Drummer Lars Ulrich found when they heard \"some serious shredding\" at a bar and went inside to find Cliff Burton using wah and distortion pedals to play a bass solo, and they decided they had to bring him in. He is regarded as Metallica's best and most recognizable bass player, who is featured in songs like \"Anesthesia\" (a bass solo), \"Orion\" (a song with two bass solos) and \"For Whom The Bell Tolls\" (featuring a kickass bass intro). Cliff Burton was killed in a tour bus crash while on the Master of Puppets tour in 1986. Cliff was replaced by Jason Newsted of Flotsam and Jetsam. Newsted went through constant tormenting by the rest of the band , as they were still shaken from the loss of Cliff Burton. Jason Newsted performed on Metallica albums \"...And Justice for All\", \"Metallica\", \"Load\" and \"ReLoad\". In 2001 Newsted proposed for Metallica to take a year-long hiatus so he could focus on his side project Echobrain. The band refused, so he quit. Their new producer, Bob Rock, filled in on bass for their next album, \"St. Anger\". I don't really count this guy as a bassist, but technically he make five bass players. Robert Trujillo, their current bassist, joined in 2003. ",
            "date": "Updated December 8, 2016",
            "views": "81",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Mardini",
                    "user_href": "/profile/Adam-Mardini-1"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                },
                {
                    "user_id": "Witold Furmanek",
                    "user_href": "/profile/Witold-Furmanek"
                },
                {
                    "user_id": "Chris Lyles",
                    "user_href": "/profile/Chris-Lyles-4"
                },
                {
                    "user_id": "Jim Costa",
                    "user_href": "/profile/Jim-Costa-2"
                },
                {
                    "user_id": "Jack Kent",
                    "user_href": "/profile/Jack-Kent-24"
                },
                {
                    "user_id": "Fred Siewert",
                    "user_href": "/profile/Fred-Siewert"
                },
                {
                    "user_id": "Alexander Alexandrow",
                    "user_href": "/profile/Alexander-Alexandrow-1"
                },
                {
                    "user_id": "Akshay Bhat",
                    "user_href": "/profile/Akshay-Bhat-48"
                },
                {
                    "user_id": "Grant Reid",
                    "user_href": "/profile/Grant-Reid-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Dey",
                "href": "/profile/Rahul-Dey-109"
            },
            "answer_text": "They have had four bassists. First was Clifford Lee Burton who died on a tour after the bus fliped over from ice an landed on him. After that it was Ron Mcgoveny. Then it was Jason Newsted. Their current bassist is Rob Trujillo don't forget bob rock He played bass on the album st anger i think James hetfield played bass on a few songs Metallica's first bassist was Ron McGoveny. McGoveny left the band because of the constant harassment from the bands first guitarits: David Mustaine. Metallica's second Bassist was Cliff Burton. Cliff was killed while on tour, when he was throw from the bus when it lost control because the driver was drunk, and landed on him. RIP. Metallica's third bassist was Jason Newsted. Newsted quit the band to further his music career, and focus on his own band. Metallica's current bassit is Robert Trujillo. ",
            "date": "Updated September 7, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}