{
    "title": "How to find inappropriate games on Roblox - Quora",
    "tags": [
        "Inappropriate Games",
        "ROBLOX (online game)",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "모모 리MOMORI",
                "href": "/profile/모모-리MOMORI"
            },
            "answer_text": "First of all, Roblox isn’t that kind of site for young players to be playing games with any type of sexual content, or sexual inspiration for kids to start following the term “sex.” It is a site for players to connect and have lots of fun while playing. There are a few Roblox videos exposing some Roblox games that are actually still on Roblox for many years. Sex shouldn’t be exposed to kids under the age of 6. It takes time for kids to really understand the meaning of what sex is. Now there is this thing on Roblox called ODERS. An oder is someone on Roblox who goes around in random games trolling people inappropriately . However, Roblox automatically recognizes when you’ve been trying to use a cuss word in the social chat. And if you think about it, the word … O - D- E R, stands for ….. Or is also known as online dating. That means him or her who’s a player in the Roblox community is trying to find a sexual partner to become romantic . A lot of these are adults who are trying to track down minors on Roblox. That’s why you should be very mindful and safe when being on a site that contains messaging chat rooms. It can be very dangerous for your children. Keep them safe, and love them for life. Did I answer your question? Message me ",
            "date": "Answered September 4, 2019",
            "views": "86",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Teo",
                    "user_href": "/profile/Ryan-Teo-92"
                },
                {
                    "user_id": "Anise Fox",
                    "user_href": "/profile/Anise-Fox"
                },
                {
                    "user_id": "Sarah Chester",
                    "user_href": "/profile/Sarah-Chester-27"
                },
                {
                    "user_id": "Cool Guy",
                    "user_href": "/profile/Cool-Guy-989"
                },
                {
                    "user_id": "Trevor Tnt",
                    "user_href": "/profile/Trevor-Tnt"
                },
                {
                    "user_id": "Piggy Fan",
                    "user_href": "/profile/Piggy-Fan-1"
                },
                {
                    "user_id": "Caitlin McColl",
                    "user_href": "/profile/Caitlin-McColl-10"
                },
                {
                    "user_id": "Is Adora",
                    "user_href": "/profile/Is-Adora"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ingrid-MONAGHAN"
                },
                {
                    "user_id": "Bald Black Woman",
                    "user_href": "/profile/Bald-Black-Woman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Pascas",
                "href": "/profile/Nathan-Pascas"
            },
            "answer_text": "Roblox is a fun platform, and you probably won’t stumble upon a sex related game. To do so, you must dig and dig until you find one. And that will be deleted in the next day or so. There was one popular game that Online Daters took advantage of, “MeepCity”. It is not popular anymore however, and ODers have mostly fled form there. If you are talking about gun games however, there are some, most namely “Arsenal”and “Phantom Forces”. They are not controversial, as many teens/young adults play those games mostly. You can’t restrict what games your child plays, just keep an eye on what games they do play. In conclusion, Roblox is mostly safe, you have to search for inapropriate games, and you cannot say inapropriate words in the chat as well. If needed, have a talk with your child about these games. Hope this helps. ",
            "date": "Answered May 27, 2020",
            "views": "258",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ryan Teo",
                    "user_href": "/profile/Ryan-Teo-92"
                },
                {
                    "user_id": "Sarah Chester",
                    "user_href": "/profile/Sarah-Chester-27"
                },
                {
                    "user_id": "Joshua Chinnaiyan",
                    "user_href": "/profile/Joshua-Chinnaiyan"
                },
                {
                    "user_id": "Edmond Tso",
                    "user_href": "/profile/Edmond-Tso"
                },
                {
                    "user_id": "Daniel Na",
                    "user_href": "/profile/Daniel-Na-22"
                }
            ]
        }
    ]
}