{
    "title": "How do music producers typically charge? - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jake Wood",
                "href": "/profile/Jake-Wood-67"
            },
            "answer_text": "Usually, a producer is paid by the hour, by the number of master recordings completed, or a flat fee. He or she probably will ask for a royalty from the sale of the record as well. If you agree to such an arrangement, you’ll have to account to the producer and make regular royalty payments, based on record sales. These issues must be agreed upon in advance and laid out in a written contract. As always, it is recommend to consult with an entertainment attorney to provide guidance in drafting and/or negotiating this contract. The producer’s up-front fee will vary (usually from $250 to $10,000 per song), based on his or her experience and success, your artist’s level of success, and the number of songs to be recorded. The fee also can be influenced by whether the label is a local, national independent, or major record company. “Producers of tracks,” discussed in the previous chapter, will receive an additional royalty, because they create the original music to which artists add vocals. Ultimately, the producer you and the artist select will depend on the artist’s musical style and naturally, on the budget. Aside from his or her fee, the producer, like the artist, will receive a record royalty. Traditionally this was based on the same way the artist was paid, which was a percentage of the record’s sales price, multiplied by the number of CDs or downloads sold. The record royalty to the artist is around 15% to 16% of the sales price of the audio product. The record royalty for a producer is usually between 3% to 4% of the record’s sales price or 20% to 25% of the artist's royalties. On a CD that sells for $10.98, the producer’s royalty would be about 33 cents for each copy sold and for a digital download of an album priced at $9.98 the producer receives 30 cents. However, this 3% record royalty (or “three points,” as it’s called in the record industry) comes out of the artist’s royalties and is not an expense incurred by the record label. Feel free to comment on the answer below or send us a message on dreambigrecords.beatstars .com if you have more questions! Read more: How Does A Producer Get Paid ",
            "date": "Answered February 23, 2018",
            "views": "112",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chieff Ace",
                    "user_href": "/profile/Chieff-Ace"
                },
                {
                    "user_id": "Angel E",
                    "user_href": "/profile/Angel-E-23"
                },
                {
                    "user_id": "Danielle Edwards",
                    "user_href": "/profile/Danielle-Edwards-55"
                },
                {
                    "user_id": "Mert Arslan",
                    "user_href": "/profile/Mert-Arslan-20"
                },
                {
                    "user_id": "Alex Potter",
                    "user_href": "/profile/Alex-Potter-64"
                },
                {
                    "user_id": "Adrián Ortiz Blasser",
                    "user_href": "/profile/Adrián-Ortiz-Blasser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Sokal",
                "href": "/profile/Sarah-Sokal"
            },
            "answer_text": "A good music producer in Canada that received some industry recognition will charge around 1500–3500 CAD /song in Canada with an average of 2000$/fee per song** . I worked with producers in different cities that were also songwriters /instrumentalists/multi-instrumentalists (1800–3500$) if your producer is not a songwriter or multi instrumentalist but suceeded at having songs on the radio for example,she/he should be charging more around 1500$ . It is more expensive in Toronto & Vancouver than in smaller cities like Quebec or Montreal taking in consideration living costs ect.. Producers in Nashville with some industry recognition will also charge about the same rates about 1500–3000$ /song in USD . It will cost you more if you add instruments/musicians but should stay in that range for independent artists. Still expensive for an album, but an independent artist that has a job and is ready to invest in his/her career is normally able to handle the costs. ☆ The producers are most likely to want you to succeed and bring additional income for them, so they should consider that you will need funds to provide an efficient marketing campaign for the material you both created ☆ If you work with a serious Award winner producer that worked with some of the biggest names in the industry expect 5000+ and up to 15 000 $/song & sometimes even more. Having said that, You can also find very talented “not yet recognized” younger talents for cheaper, especially if you have gained some music industry recognition yourself ( government music grants, contests, awards, festivals) but make sure you compensate with great professional mastering from a bigger studio own engineers, great songwriting & the most talented musicians. I recommend to get a “package price” or “per song price” and not by the hour ! This has made me feel less concerned about costs and is letting me focused more on the songs outcome, knowing what to expect also helps to build a budget. Producers might want some rights , so you must get an entertainment lawyer to revise your contracts. They can provide references for affordable and competent lawyers in the field, at your local songwriters union or rights union (SOCAN /BMI/ASCAP .etc ..). ",
            "date": "Answered April 20, 2019",
            "views": "56",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Martines Sanches",
                    "user_href": "/profile/Erik-Martines-Sanches"
                },
                {
                    "user_id": "Joshua Phelps",
                    "user_href": "/profile/Joshua-Phelps-12"
                },
                {
                    "user_id": "Chieff Ace",
                    "user_href": "/profile/Chieff-Ace"
                }
            ]
        }
    ]
}