{
    "title": "How to start playing the violin - Quora",
    "tags": [
        "Learning Violin",
        "Violins",
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Medicine Madison",
                "href": "/profile/Medicine-Madison"
            },
            "answer_text": "A Great teacher is of utmost importance. In person. Not online. A teacher that can physically touch you and move your hand, wrist, fingers, violin into the right position. Skip this and you become likely to be seriously injured by violin playing in wrong positions. A teacher protects you from Carpal Tunnel Syndrome, and wrist, back, arm, shoulder, neck and finger pains.Practice EVERY DAY no excuses. Cancel plans if interfering with practice. Use gloves in winter and sleep with gloves if your hands hurt when you are just starting out due to improper positions.Learn to read sheet music, it opens your ability to play more music. Memorizing music is a great skill which I use but do not substitute reading with memorizing both have their importance.Your love for the violin must be infinite if you want to evolve. If you just “like” it, and think it is “fun” don’t bother. It will disappoint you terribly. If however you worship it and are absolutely desperate to hold it under your neck, this is a good sign. You will end up harvesting honey out of it and feeling incredible joy.Scales are boring but essential do not ignore them. Also Sevcik has good beginner exercises.Develop a great taste and discover violinists you like, role models, a good start is to watch the documentary “Art Of Violin” then look for Jascha Heifetz, Yehudi Menuhin, Zino Francescatti, Leonid Kogan, David Oistrakh.You MUST know who Niccoló Paganini is. He is the sole reason for which violin music has evolved to such heights. Among other things he invented left hand pizzicato, playing an entire piece on the G string, artificial harmonics, double harmonics…most of the most extraordinary violin techniques are his invention he played so beautifully people thought he sold his soul to the Devil in order to achieve such mastery.Prepare for calluses and red marks on your neck and goodbye normal/long fingernails.I have started learning 18 months ago on the classical path. I have been playing Bach (Minuets), Brahms (Hungarian Dance 5), Shostakovich (Waltz no 2), Gossec (Gavotte), Vivaldi (Violin comcerto in A minor 1st movement), and even some snippets of Paganini. Not perfectly but enough to surprise myself and those around me. You can do it too if you are committed and disciplined enough.Last one. Please do not consider Lindsey Stirling a violinist. She is not. She is a combination between a bad dancer and a hopes-to-pretend-to-try-to-be “violinist”. This is not about my taste, it is about the instrument you want to learn and the respect you hopefully should have for it. I am worried that the true masters are being forgotten and the ones lacking any skills are admired. I share the names of these masters so the world can start remembering how a violin should sound like, they were too great to be forgotten. A taste of ANY of the masters I mentioned can cure -hopefully, this modern ailment. I am mentioning this because many people nowadays start an interest in violin playing because they listen to her. I truly hope you are not one of them, but if you are, go on a classical music diet before even trying to play the violin. This is because you MUST know what’s going on with the instrument and who are the greatest masters and what was its music historically. This is not written to offend in case you enjoy her. I hope it will help you because there’s no point in becoming LS 2 when you can become a real musician.",
            "date": "Answered October 31, 2017",
            "views": "536",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Camila Llwa",
                    "user_href": "/profile/Camila-Llwa"
                },
                {
                    "user_id": "Jordan Dawson",
                    "user_href": "/profile/Jordan-Dawson-47"
                },
                {
                    "user_id": "Laurent Boukobza",
                    "user_href": "/profile/Laurent-Boukobza"
                },
                {
                    "user_id": "Evelyn Black",
                    "user_href": "/profile/Evelyn-Black-21"
                },
                {
                    "user_id": "Vishnu Sivaprasadan",
                    "user_href": "/profile/Vishnu-Sivaprasadan-1"
                },
                {
                    "user_id": "Kevin David",
                    "user_href": "/profile/Kevin-David-36"
                },
                {
                    "user_id": "Anton Melnik",
                    "user_href": "/profile/Anton-Melnik-2"
                },
                {
                    "user_id": "Aishwariya Viswanathan",
                    "user_href": "/profile/Aishwariya-Viswanathan"
                },
                {
                    "user_id": "Sania Anisa Farah",
                    "user_href": "/profile/Sania-Anisa-Farah"
                },
                {
                    "user_id": "Kathy Spector",
                    "user_href": "/profile/Kathy-Spector-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Wallace",
                "href": "/profile/Randall-Wallace-2"
            },
            "answer_text": "the cheapest and most painless way i know for a rank beginner to learn violin basics is go to the Ashokan Fiddle Camps in the summer. they have a “fiddle from scratch” as well as a “fiddle from scratch and a half” class where they show you how to position your left thumb so your wrist doesn’t collapse when learning vibrato later - take both classes and bug everyone with extra questions all week. i’ve gone for decades (they have advanced classes), love the teachers and i started there in the 70’s at age 30 with a $400 fiddle i couldn’t play at all! being with other beginners emboldened me. after each camp ended i continue reading through 100 fiddle tune books trying to play with better feel until next years camp. careful though: choosing a bad teacher could hold you back for years. i took lessons from a bad NYC teacher until a great teacher/friend Paul Peabody, a concertmaster, set me straight: your bow must travel at a controlled 90 angle to the strings. think of your bow as your lungs, practice using it fully when you play. get volume through bow speed. the most important thing i learned on violin was that when practicing, never play the next line until the first line is played in tune. be strict about that and really develop your strict internal “pitch police” - never wait for someone else to tell you you are out of tune. also, practice bow divisions. also, practice to drone notes - tune yourself playing scales to a drone. buy the App, iTablaPro and practice playing to it (scroll through the 100’s of advanced tamboura/drone multi-pitch presets). learn the easiest scales on violin first: G, D, A, and C. after a few years of non-classical violin, i joined three amateur orchestras in NYC in the 90’s and learned a huge amount playing in four different coached chamber music groups from Brandenburg’s down to string trios. hang with friends who play/read better than you. practice being in tune and bowing in steady rhythm. ",
            "date": "Answered October 30, 2017",
            "views": "316",
            "upvotes": "0"
        }
    ]
}