{
    "title": "How hard is it to learn to play the violin? - Quora",
    "tags": [
        "Playing the Violin",
        "Violinists",
        "Learning Violin",
        "Violins",
        "Learning to Play Musical Instruments",
        "Musical Instruments",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dav Hardret",
                "href": "/profile/Dav-Hardret"
            },
            "answer_text": "It’s hard. It’s very hard. Classically-trained arts like ballet, voice (opera-style singing), and the like require discipline and rigorous training with sometimes steep learning curves. It’s not something I’d recommend to someone who isn’t up to the challenge. It's not impossible. The violin is known to be one of the more difficult instruments to master. It'll sound shrieky and scratchy for the first few months to a year or so, but starting maybe year 2 (depending on your talent and your tenacity), you can get a smoother, sweeter sound out of it. Your ear will tune in, maybe develop a 440 \"A\" perfect pitch, make that bow glide and get a feel for that springy bounce, and you'll really make it sing by adding some vibrato. (I remember when my father's eyes welled up when I first played his favorite violin piece for him, Concerto in D by Tchaikovsky.) Violins are not cheap. You'll probably (make that definitely) want to start renting at first. Learn how to take care of it. DO NOT LET ANYONE BUT YOUR TEACHER TO EVEN TOUCH IT. Violins are very fragile, easily damaged by shock, heat or moisture. The varnished wood will get dents and chips in it unless you're very careful. You'll eventually want to invest in a good case; rental ones are garbage. I didn't get my own violin until maybe 6 years after I began, and it cost $2,000 (which was back in 1993). My first teacher started me on the Suzuki method, whose books are available at your local music store; I recommend buying the accompanying audio tracks. (I had cassette tapes; that’s how old I am… they made CDs too and you can probably download the tracks online.) You can learn from a book alone, but I highly advise that you take private lessons and join an ensemble of some kind, which are really kind of fun… and you simply must practice. Every day. Half an hour to an hour, maybe more. No kidding. No skipping. Your private music teacher/ instructor/ coach/ whatever will know if you haven't been practicing. (I remember my second teacher once lost his patience with me because he knew I didn’t practice enough and it showed.) If you’re not improving, you’re wasting your own time, your teacher’s time… everyone’s time, not to mention money as well. You have to get better and be constantly advancing. Anticipate playing the next song in the book. Play the same four bars over and over a hundred times if you have to until you get it right. Your fingers and bowing arm will learn through repetition. It’s challenging, I will say. It's like beating bosses or levels in a video game. The songs get harder and harder, but once you can get it right and keep getting it right, you'll want to go on to the next one. It's like a drug, almost. Before you know it, years have gone by and you'll be playing anything from minuets and folk songs to concertos. If you do decide to pursue mastery of this, one of humankind's finest instruments, let me tell you: it’s worth it. It’s extremely rewarding! It’s such a great gift that you can share with others, making music. Sharing your art is something special, and makes others want to share theirs. I wish you the best of luck. Like Albert Einstein, Sherlock Holmes, and Lieutenant Commander Data (okay, the first one's dead and the last two are fictional), the world could use more violinists, I say. ",
            "date": "Updated July 11, 2019",
            "views": "372",
            "upvotes": " View 153 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miriam Caro",
                    "user_href": "/profile/Miriam-Caro"
                },
                {
                    "user_id": "Malhar Kshatriya",
                    "user_href": "/profile/Malhar-Kshatriya"
                },
                {
                    "user_id": "Balamurugan Jeyachandran",
                    "user_href": "/profile/Balamurugan-Jeyachandran"
                },
                {
                    "user_id": "Kalika Halde",
                    "user_href": "/profile/Kalika-Halde"
                },
                {
                    "user_id": "Sujay Munagekar",
                    "user_href": "/profile/Sujay-Munagekar-1"
                },
                {
                    "user_id": "David Jenks",
                    "user_href": "/profile/David-Jenks-2"
                },
                {
                    "user_id": "Anastasia Martinez",
                    "user_href": "/profile/Anastasia-Martinez-23"
                },
                {
                    "user_id": "Valor Alvez",
                    "user_href": "/profile/Valor-Alvez"
                },
                {
                    "user_id": "Abhinav Sharma",
                    "user_href": "/profile/Abhinav-Sharma-3"
                },
                {
                    "user_id": "Jef Pauwels",
                    "user_href": "/profile/Jef-Pauwels-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Reeve",
                "href": "/profile/Jay-Reeve"
            },
            "answer_text": "I’m sure there could be many different answers to this question, and none of them wrong. I recently heard of someone who tried to give hope to aspiring violinists with the advice that violin technique is finite. In other words, there are only 30 or 40 specific techniques one has to master to play all the violin repertoire. The fact that each one of those techniques may require hundreds or thousands of hours of focused practice to master might be one answer to your question. Consider this, just for a start: the violinist has four fingers on the left hand which are required to find the precise position on a string to produce the exact pitch for roughly 50 different notes in the violin range. The keys on a piano are equally spaced, and a guitar’s notes are determined by the position of its frets, but the notes on a violin, without the aid of frets, get logarithmically closer together as one gets higher on the string. A half-step interval in first position is about the width of a finger, so the same half-step an octave higher (half-way up the string length) is half that width. Go up another octave (3/4 of the length of the string), and that interval size has decreased by half again. And yes, professional-level violinists regularly play that far up the string. Now add the fact that a finger-position error of as little as a millimeter in first position can be detected by an acute listener as out-of-tune. As one gets higher on the string, the size of that detectable error shrinks just like the finger spacing. One of my teachers talked about adding one more line from my fingerprint to the string. The demands on the left hand, though, pale in comparison to what the right hand must do (in perfect coordination with the left, of course). A good violin bow is a piece of pernambuco wood carved to less than the thickness of a pencil, and strung with a carefully arranged hank of horse hair stretched taut. The weight, balance, and elasticity of the wood, the degree and evenness of its taper from one end to the other, combine to create a magical tool for extracting a plethora of different sounds from the violin string. The right hand must master the coordination of all of those factors, along with the speed of the bow, the amount of weight transferred into the string, and the place where the bow hair contacts the string, not just to produce a sound, but to control every aspect of that sound at each moment. There is a story about a top violin soloist (I’ve forgotten which one) whose driver accidentally slammed the visiting maestro’s fingers in the car door as they arrived for the rehearsal before a concert. Deeply chagrinned and apologetic, the driver asked, looking at the bruised and swollen fingers, “Maestro, how will you be able to play?” The maestro replied, “I’ll manage—at least it wasn’t my bow hand.” If you’re starting to imagine playing the violin as being of similar difficulty to brain surgery, you might not be far wrong. Fortunately, the consequences for doing it badly aren’t nearly so profound. ",
            "date": "Answered May 2, 2018",
            "views": "23",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenan Dogan",
                    "user_href": "/profile/Kenan-Dogan-11"
                },
                {
                    "user_id": "Steven Rudin",
                    "user_href": "/profile/Steven-Rudin"
                },
                {
                    "user_id": "Amber S",
                    "user_href": "/profile/Amber-S-55"
                },
                {
                    "user_id": "Ayush Shah",
                    "user_href": "/profile/Ayush-Shah-5"
                },
                {
                    "user_id": "Mary Trope",
                    "user_href": "/profile/Mary-Trope"
                },
                {
                    "user_id": "Jeff Gebhart",
                    "user_href": "/profile/Jeff-Gebhart-2"
                }
            ]
        }
    ]
}