{
    "title": "How to make friends with happy people - Quora",
    "tags": [
        "Friend Making Advice",
        "Making Friends",
        "Developing and Maintaining Happiness",
        "Entertainment",
        "Social Psychology",
        "Happiness",
        "Friendship Advice",
        "Friendship",
        "Social Advice",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shulamit Widawsky",
                "href": "/profile/Shulamit-Widawsky"
            },
            "answer_text": "No one is happy all the time. That said, most people are not dealing with serious depression or anxiety. If the definition of happy people is people who feel happy often, and are not loaded down with depression or extreme anxiety (everyone has some anxiety sometimes), then the good news is there are happy people pretty much anywhere you might go. School, work, service clubs, your neighborhood, library, grocery store, etc. The bad news is, if you haven’t noticed how many happy people are around you, then you might have trouble making friends with happy people, because you tend to find them boring, or at least uninteresting. Happy people like to get things done. Try joining a club or two at school, especially service clubs (eg. where people join them to accomplish things like fixing up the gardens, visiting lonely old people, working at a soup kitchen). Watch the people around you, and try to especially pay attention to people who have the combination of not seeming very interesting, but also tend to smile at others. Happy people are not boring, but if you are used to people who exude drama or comedy, you might not notice those who don’t. Happy people can be happy without showing off, without complaining, without making people laugh. There are happy people who do those things, of course, but often, the happiest people are too busy accomplishing something to bother with self-aggrandizement, complaints, or clowning around. You want to be friends with happy people? Look for the people who are busy and smiling, and then smile at them, and get to work next to them. You make friends with happy people by noticing them, and then doing stuff with them that they do. Of course, happy people hang out with friends, and just talk and eat. But to become their friend, if you haven’t managed to become friends with a happy person before, means you have to do something other than what you have always done before. Activities are the easiest way to make new friends. Volunteer. Join a club. Do something active, with a purpose. The other people out there doing those things are where you find happy people to be friends with. Not that everyone who joins a club or volunteers is happy, but these activities make it easier to find and make friends with happy people. ",
            "date": "Answered July 9, 2017",
            "views": "441",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Psam Ordener",
                    "user_href": "/profile/Psam-Ordener"
                },
                {
                    "user_id": "Daniel Ostendorf",
                    "user_href": "/profile/Daniel-Ostendorf-1"
                },
                {
                    "user_id": "Megan Cummings",
                    "user_href": "/profile/Megan-Cummings-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Stevenson",
                "href": "/profile/Marvin-Stevenson-3"
            },
            "answer_text": "good morning again Timon. This is quite nice to see you in a good frame of mind to explore more of those who are around you. A local paper is one of the best sources of coming events in your own local neighborhood. The coastline is 10 km east of you. Now to go the coastline. What could be there. You sir are sitting around a gold mine. The skyview from the satellites says lots. If and when you can afford the camera, and note. (((never go into a restricted area with a camera))). If you do not recall that is worse than having someone with military boots at your behind. Profit. Yes well there is a little profit made available to all of the ability. I saw all of the ships from the satellite view. Now I have no idea of how incredible they may be for (((somehow that verbiage yesterday of the boots can come into play))). Go to YouTube and see some of the crap they produce. To get yourself in, is not the problem. The thing is what happens when you do things like going to the local pub. As stated I have no idea but the closer you are to the sea water the better the response as these are the sailor types. That seems to have been marked as “Murphy’s Pub”. An age would be helpful, at this point, as no one is going to be too intimidated by a small child. Now start to learn about “””ancient aliens”””. youtube. The potential is to be too intelligent. Show after show after show until you would scream just to have a nose bleed. This is technique. This is a project. No new bicycle. Does Israel have pawn shops. Somehow the idea is at least a 2K resolution camera digital. Underwater casing. (((I am psychic, so trust me this can be helpful))). called getting the proper amount of attention. Well I did find you, one place to look at. The newspaper is also a good choice. Gets you out of the neighborhood, into that new domain. At all times remain safe and ask parents and known friends about this. Two weeks of ancient aliens is like (((oh darn it I can not speak those ideas))). I did nothing. You just happen to like smiling anyway. ",
            "date": "Answered July 11, 2017",
            "views": "168",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Ostendorf",
                    "user_href": "/profile/Daniel-Ostendorf-1"
                }
            ]
        }
    ]
}