{
    "title": "How good was Kurt Cobain as a guitarist? - Quora",
    "tags": [
        "Kurt Cobain (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyle Grymes",
                "href": "/profile/Kyle-Grymes"
            },
            "answer_text": "Kurt Cobain was not a flashy guitarist, but he was a great one. The majority of Bleach was recorded in a few days. Listen to how on point his playing is in addition to his vocal duties. Original material and lots of practice. This brings us to… Nevermind. Recorded in around two weeks. Sure, the songs are simple. But listen to how tight the guitar tracks are. There’s not a note out of place. The tone and playing are excellent. In Utero: We’re in art country. Deciding that Nevermind came off “candy-ass”, the band retreats for a couple weeks to record roughly two years later. You can decide for yourself how sober Cobain was at the time, but I’d put my money on “relatively”. The studio was isolated, he had to prove himself, etc. Much of In Utero is recorded live and overdubbed with vocals later (the vocals took about 7 hours). “Milk It”, for instance, is a live take. Go do that. Now that Cobain’s studio prowess has been touched upon, let’s move on to concerts. He was a completely different animal on stage. Disheveled, overly distorted, raw, and using cheap equipment. If the pop-studio records would be his blueprint, here he found his credibility. His studio work showed he was a real songwriter and his shows proved he was a rock star. This is his basic resume, yet what I really respect about Cobain’s guitar playing is his sense of touch. He always applied the proper force to each note played. He seemed to know exactly how to come across as lazy in his picking for dramatic effect as well as precise when the time called for it. “You Know You’re Right” is a masterclass in modern rock guitar. I’m not even considering dynamics, just the touch of the pick to the strings. So cool. Cobain was a master of his own tone, his own style. Reading his journals (the published ones) you can really understand how he masterminded his craft. Despite his appearance, Kurt Cobain worked hard. His guitar playing shows it. He surpassed many more talented people of his generation. That’s why Nirvana’s catalog of three studio albums can hold its own against a band with far more material. ",
            "date": "Updated March 27, 2018",
            "views": "12",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liam Innes",
                    "user_href": "/profile/Liam-Innes-6"
                },
                {
                    "user_id": "Daseiserneskreuz .",
                    "user_href": "/profile/Daseiserneskreuz"
                },
                {
                    "user_id": "Bob Simard",
                    "user_href": "/profile/Bob-Simard"
                },
                {
                    "user_id": "Michael Bronfman",
                    "user_href": "/profile/Michael-Bronfman-5"
                },
                {
                    "user_id": "Jon Seaman",
                    "user_href": "/profile/Jon-Seaman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jerry-P-Bubba"
                },
                {
                    "user_id": "Chimps Ahoy",
                    "user_href": "/profile/Chimps-Ahoy"
                },
                {
                    "user_id": "Gabriel Bossei",
                    "user_href": "/profile/Gabriel-Bossei"
                },
                {
                    "user_id": "Sam Warrender",
                    "user_href": "/profile/Sam-Warrender"
                },
                {
                    "user_id": "Matthew Moore",
                    "user_href": "/profile/Matthew-Moore-250"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Stuart",
                "href": "/profile/Don-Stuart-6"
            },
            "answer_text": "Cobain was pretty good. Early on, when he was young and angsty and had a lot of punk rock influences, he had poor guitar technique, which was true of a lot of punk type players, especially young ones. Late in his career, he had taken some lessons and improved his technique, which we can observe in the Unplugged video sessions. Being the guitarist and singer in a three-piece rock outfit is a bit of a workout. You’re kind of naked out there if you mess up. When Nirvana was sort of an anti-rock band and sloppy by nature, Kurt could get away with some messiness. In fact he was downright awful in Nirvana’s early days, which I witnessed. It was the complete opposite of the highly technical, post EVH hair-band rock that was popular at the time. “Hey, we’re punk-rawk and we suck!” was kind of the mantra . . . and then because of Pearl Jam, Soundgarden and Alice in Chains, they got a major-label record contract. Some clean-up was required, which included six months of daily practice with pro musician Dave Grohl. Kurt was also influenced by Thurston Moore’s ability to make guitar noise sound musical. This is not easy to do. Guitarists who can do it are pretty good, to make an understatement, and Kurt could do it. When Nirvana hit it big Kurt had to learn technique to be able to survive touring . . . and mainstream crowds were expecting the band to “sound like the record.” He got swallowed in the maw that is Rock Stardom, similarly to what happened to Jimi Hendrix. Not that he was fit to carry Jimi’s guitar case . . . but Kurt was pretty good. ",
            "date": "Updated July 8, 2020",
            "views": "86",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Dillard",
                    "user_href": "/profile/Chris-Dillard-3"
                },
                {
                    "user_id": "Cal Sparks",
                    "user_href": "/profile/Cal-Sparks"
                },
                {
                    "user_id": "Matthew Moore",
                    "user_href": "/profile/Matthew-Moore-250"
                },
                {
                    "user_id": "David Testaverde",
                    "user_href": "/profile/David-Testaverde"
                },
                {
                    "user_id": "Daniel De Kroon",
                    "user_href": "/profile/Daniel-De-Kroon"
                },
                {
                    "user_id": "Lynn Bee",
                    "user_href": "/profile/Lynn-Bee-5"
                },
                {
                    "user_id": "Scott Reszek",
                    "user_href": "/profile/Scott-Reszek"
                },
                {
                    "user_id": "Ali Joffrey",
                    "user_href": "/profile/Ali-Joffrey"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                },
                {
                    "user_id": "James Hawk",
                    "user_href": "/profile/James-Hawk-24"
                }
            ]
        }
    ]
}