{
    "title": "How to get successful in network marketing - Quora",
    "tags": [
        "QNET (company)",
        "Network Marketing",
        "Multi-Level Marketing (MLM)",
        "Success",
        "Becoming Successful"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle Fluech",
                "href": "/profile/Michelle-Fluech"
            },
            "answer_text": "Reading through the responses you've already gotten, there's some great tips in there!  Definitely jot those down!!  The thing is...I'm reading them from the perspective of someone who has already been in it for quite some time and already have a grasp of what they're saying to you.  I remember hearing much the same & taking notes when I first started...even the things I thought I understood don't mean the same now.   There are THREE main areas you need to focus on developing to be successful in network marketing:  MindsetSkillsetKnowledge EACH is a journey in and of itself.  Learning the skills & the knowledge takes time...but it's not really THAT difficult.  Persevere, learn a little more each day, don't be afraid to apply what you're learning...not that big of a deal!  :)  It's the FIRST one that's the really hard part.  So what I'm going to give you is a few keys to help you out in that area.  #1:   There are a few points in history in which something comes about that profoundly TRANSFORMS our lives, perspectives & society in general...we are in one of those transformations RIGHT NOW.  Welcome to the Digital Revolution.  When a caterpillar transforms into a butterfly, however, it is not a small or easy change.   We have spent a lifetime being socially programmed to think in certain ways, some of which are so incorrect it isn't funny...yet we believe it to be and our perceptions DEFINE our reality.  You must realize that at one point ALL \"logical and rational\" people believed the Earth was flat...that does not make it so in reality...but in their reality it was.  People with the audacity to defy conventional wisdom of the time were ostracized & ridiculed.  Idk about anyone else...but I have come to DESPISE the terms \"Scam\" and \"Pyramid Scheme\".   We have ALSO spent a lifetime developing habits that you will have to break in order to succeed.  They are detrimental and sabotaging to what you want to accomplish. CHANGE.  To many people that is a scary word!  Changes in thinking, changes in behaviors and perceptions...these are NOT easy.  When you hear people say \"It's EASY!\" yet a majority fail...it's because they have already come out of the other side of transforming their mindset...and many people aren't willing to let go of what they think they know in order to learn what they need to.  My Grandma is STILL telling me to get a \"good, stable factory job\". (Gulp!  Kill me now, that would be torture for someone like me!) In order to transform...you must INTERNALIZE the message, not merely read & process it with your mind.  You have to make it a part of you.  Words have GREAT power...but they are only as powerful as you allow them to be.  You have to grow and become a different person.  Still YOU, just more.   Coming Soon: YOU 2.0! I was ALREADY an \"Outside-the-box\" thinker that defied social conditioning when I came into this...but every day I would do SOMETHING to develop mindset...listen to an audio, read through memes, listen to speeches, read a book, do a program, etc... Ted Talks, Steve Jobs, Tony Robbins...too many to list.  I wouldn't ONLY listen, though...I would internalize it, apply it to myself, assess my own life through these new perspectives...and I would write about it from a personal standpoint, reinterpreting the original message as it applies TO ME.  I would take the concept and make it MINE. (While still crediting the original creator, of course...'cuz plagiarism is bad!) Nobody can give you the answers, only the words.  You're the only one that can give them power.   #2:   Remember the game \"Operation\"?  If you were GOOD at it...did you suddenly say \"WooHoo! I'm a SURGEON!\"?  O_o  I certainly hope not...if so...you are NEVER going to be my doctor!  :P   In no other area of life, unless it's something that requires little skill like flipping burgers, do we expect to jump right in & VIOLA!  Yet...when people get involved with network marketing...they TRULY expect it to be super simple and to \"Get Rich Quick!\" O_o  They'll give this one a \"try\" and, when it doesn't produce right away...they'll try a different one...and another...and another.  Somewhere in all this process they decide it's a SCAM and scream to the world it doesn't work.  smh  Marketers in the real world are STILL bogged down with huge student debt...so are writers & graphic designers & computer science majors.  People truly successful in sales spend YEARS honing their skills!  FYI...being successful in the online world requires at least SOME working knowledge of ALL of these areas & then some.  You CAN outsource...but how could you discern whether something is GOOD & right for YOU...if you don't even know what you're looking at?  Yet people truly expect to jump in & be chilling on their yachts in little to no time at all!  O_o   You want to be a Network Marketer?  Then do it.  Don't \"try\".  It's a long-term commitment to a new career path.   #3:   Many wanted to \"fit in\" & be \"accepted\", especially in high school!  Were those the \"cool\" kids?  I liked the ones who were UNIQUE.  Confident.  Unapolegetically themselves.  They weren't the cookie-cutter clone copy of everyone else.  Do YOU follow people who are like \"Look at me, I'm mundane just like everyone else!!\"  Doubt it.   \"Find someone who has it figured out and do what they do\" does NOT mean you have to copy them!  You are unique...and THAT is what makes YOU \"special\".  Learn your craft, provide value...but do it in a way that is ALL YOU! One of the things I see a lot are the carbon copy website systems.  If you're in that company then that should only be ONE tool in your arsenal!  If you want people to follow you...you have to show them WHY they should follow you! Ray Higdon, Michelle & Bill Pescosolido and other successful network marketers...yeah, they're great!  They built their brand & provide value...and they're very good at it!  Do you HAVE to be like them?  David Wood over at Empower Network built his brand as the \"Hippy in flip flops\" that was a \"homeless van man\" before figuring out how to leverage the internet...he made a whole lot of money and has a cult-like following calling people \"Wussies\".  lol  Love them or hate them, that's moot...they're all unique, \"special\" and uber successful being who they ARE, not copy-cats. Sometimes you have to know what to ignore, too.  I've heard mention of \"ignore your uplines\".  I prefer \"Take the value that applies to YOU from your uplines\".  They have some valuable things to offer...but I will NEVER market to my family.  Not because I don't believe in the product...it's that you couldn't pay me enough to work with them!  I only tolerate them during the holidays because I love my Grandma so much!  I'm kind of the \"black sheep\"...only in a good way.  I rarely drink & I like to do crazy things...like think!  lol  Not gonna happen.  There are plenty of other ways to find people that are right for ME, I don't need to upset the redneck delicate balance to succeed. (Thank God!) Same goes for choosing a product to promote...chose a product that you TRULY believe in, in an area you have a passion for!  I am just not an \"Avon\" kind of girl!  I have no interest in \"Home Interiors\" or \"JamBerry Nails\".  I was the girl who loved riding quads on an inactive volcano in Flagstaff, AZ (Sunset Crater, it's AWESOME!!)  That's WHO I AM!  I've worked in the travel industry before, it's fun!  So...I know a network marketing company that sells Vacation Club Memberships.  It's a great company, love the culture, love the product...and who the heck doesn't WANT to go on vacation?  That's a good fit FOR ME!  I can effectively sell it to other people because it's something that I can personally get excited about! What else do I love?  I LOVE knowledge, learning new things & helping other people...so I'm in this awesome learning platform for network marketers that I truly feel anybody trying to learn how to succeed in this industry should be in!  The best part is...they give free webinars on different topics related to online/network marketing every Wednesday.  So even if people don't want to join...that's okay!  I can still offer them something that will help them!  :)   Free Training Webinar!  ----------------------------------------------------------------------------------------------I always try to explain things in down-to-earth concepts with real-life/world examples that people can grasp easier!  Hopefully I've succeeded in giving you a few useful nuggets that help you in your journey!  Good Luck & I hope you enjoy not only success...but the journey getting there, too! ",
            "date": "Answered December 3, 2015",
            "views": "5",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gloria MacDonald",
                    "user_href": "/profile/Gloria-MacDonald-9"
                },
                {
                    "user_id": "Rogan Ritchie",
                    "user_href": "/profile/Rogan-Ritchie"
                },
                {
                    "user_id": "Sakhi Sarkar",
                    "user_href": "/profile/Sakhi-Sarkar"
                },
                {
                    "user_id": "Alex Mwangi",
                    "user_href": "/profile/Alex-Mwangi-99"
                },
                {
                    "user_id": "Ravi Roy",
                    "user_href": "/profile/Ravi-Roy-137"
                },
                {
                    "user_id": "Gagandeep N A",
                    "user_href": "/profile/Gagandeep-N-A-1"
                },
                {
                    "user_id": "Joy Sithar",
                    "user_href": "/profile/Joy-Sithar"
                },
                {
                    "user_id": "Pauline Love",
                    "user_href": "/profile/Pauline-Love-7"
                },
                {
                    "user_id": "Nitin Vaja",
                    "user_href": "/profile/Nitin-Vaja-3"
                },
                {
                    "user_id": "Nghia Nguyen",
                    "user_href": "/profile/Nghia-Nguyen-217"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clara Lam Lam",
                "href": "/profile/Clara-Lam-Lam"
            },
            "answer_text": "Success as a network marketer need not be elusive. If other people can make 6 figure money and more, so can you. It's a matter of doing the right things and employing the right strategies so you can grow your network. After all, growing or building a solid network is what makes a direct selling business highly successful. Below are seven tips that will help you grab hold of success as a network marketer: 1. Choose the Right Company If there are a lot of legitimate and stable companies in the industry, there are a few that aren't to be trusted. Your job is to find the good ones and make a decision from there. The key to a successful network marketing business is to choose the right company. To do that, you need to look at the company's stability, integrity, track record, support system and product line. Above all, look for great leadership from the company, but also from your upline. This is critical. 2. Treat it Like Any Serious Business When you sign up for a network marketing business, resolve to treat it like a real business. You need to make sure that your investment will count. It means doing everything in your power to succeed. You may need to create a business if necessary, and you should keep tabs of your cash flow too. It is a fact that people often treat a traditional business more seriously than a network marketing business. They often think that their MLM venture is not a serious business. Perhaps this is because of the low investment, or due to the fact they're only doing it part-time. Whatever the reason it's vital to treat it like a million-dollar business from day 1. 3. Follow the Formula What's the best way to reach the pinnacle of network marketing success? Follow what the successful leaders have done. They are where they are because they did something right. One of which is following the business model or system that made it work. To succeed, stick with the proven and tested formula. Even if there are setbacks, keep at it because the said formula has been proven time and again to lead to the top. All good network marketing companies have a system or a set way that they do the business. While it is sometimes tempting to reinvent the wheel and do things 'your way' do not kid yourself - if you take this approach you will fail. Nothing is more certain. Rather, follow the leader and use the system that is already in place. 4. Use the Web With technology at the tip of your fingertips, take advantage! More people are now using the web nowadays. For your business, it means you can reach out to more people if you use the web as a marketing tool. Use it to promote and generate leads, but never indulge in spamming as that will do more harm than good to your credibility. It is important to note that some companies frown on the use of online methods to build your business. If so, ignore this tip! 5. Get Support As they say, \"no man is an island.\" That is especially true with any direct selling ventures. To get to the top of the ranks, you need help and a lot of it too. That includes training, coaching and possibly every support you can get from the company and the higher-ups. This tip also links with choosing the right company. Always look at the support system, and if it's good, then you're in good hands. If you have a problem talk to your sponsor or your upline leader. But always do it respectfully. Do not inflict 'stinking thinking on your upline - they don't want to be swamped by negative energy. Give them some energy and some positivity, and they will return it to you, with interest! 6. Help Others Think of yourself as a go-giver, rather than a go-getter. Instead of just recruiting, make it your mission to help others achieve their financial goals. You're in the business because of the promise of huge commissions, bonuses, and rewards. If you want to be successful in this, help your downline as much as you can. If they know they're getting enough support, they are more likely to stick around for a long time. And that means success and greater profitability for you. 7. Follow Up Twenty years ago, a great teacher called Larry Thompson said something I will never forget: 'follow up equals fortune.' And he's right - the money is in the follow-up. Most people don't sign up the first time they hear about a new program or product. They need to be exposed to the information many times. And they need to be followed up many times too. To build your network, you need to recruit other people to join the company. That means a lot of calling and inviting of friends, family, and even strangers. It also involves a lot of promoting and marketing. And it doesn't stop there. You also need to follow-up even if it means you're going to be rejected. Following up is one step a lot of marketers disregard. You need to do it because one follow-up might mean a sign-up. It's better to take your chances and make that follow up call, even if it means rejection most of the time. Some Of My Core Values: You must truly desire to help people...you can't fake it. People know.This is a relationship, mentoring, coaching business...not a sales business.People join PEOPLE, not a company, not a compensation plan, not a product.Prospects want to know...Can I do this? & Can you help me?People only remember the ones who CARE...so I want to care for you & help you.Top priority...help people achieve their dreams.",
            "date": "Answered October 22, 2017",
            "views": "32",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakhi Sarkar",
                    "user_href": "/profile/Sakhi-Sarkar"
                },
                {
                    "user_id": "Ifeanyi Charles",
                    "user_href": "/profile/Ifeanyi-Charles-9"
                },
                {
                    "user_id": "Chandan Patra",
                    "user_href": "/profile/Chandan-Patra-13"
                },
                {
                    "user_id": "Tejal Patel",
                    "user_href": "/profile/Tejal-Patel-25"
                },
                {
                    "user_id": "Gagandeep N A",
                    "user_href": "/profile/Gagandeep-N-A-1"
                },
                {
                    "user_id": "Aadhish Raman",
                    "user_href": "/profile/Aadhish-Raman"
                },
                {
                    "user_id": "Michelle Spark",
                    "user_href": "/profile/Michelle-Spark-9"
                },
                {
                    "user_id": "Sambodhi Rangari",
                    "user_href": "/profile/Sambodhi-Rangari-1"
                },
                {
                    "user_id": "Ashu Minho",
                    "user_href": "/profile/Ashu-Minho"
                },
                {
                    "user_id": "Nikhil Gupta",
                    "user_href": "/profile/Nikhil-Gupta-386"
                }
            ]
        }
    ]
}