{
    "title": "How much of a song can I play without paying royalties? - Quora",
    "tags": [
        "Music Royalties",
        "Royalties",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Hurst",
                "href": "/profile/Robert-Hurst-2"
            },
            "answer_text": "The law differs around the world and is evolving so usually a good idea to licence the music usage upfront usually for a modest sum to avoid potentially big legal costs later When assessing whether usage of a song is substantial and contrary to copyright law under law in that territory courts have taken into account factors such as how recognisable is the usage or what was the intent of the usage In addition to simply considering how many seconds of usage of a song have been used it is an urban myth that is is ok to use a certain number of seconds of music without consent I believe a music publisher won a case on appeal on the use of just the first note of a song as the context of the usage meant it was instantly recognisable so the appeal court didn’t need to listen to anymore to conclude there had been a copyright infringement ",
            "date": "Answered June 14, 2020",
            "views": "151",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Travis Casey",
                    "user_href": "/profile/Travis-Casey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Turner",
                "href": "/profile/Adam-Turner-11"
            },
            "answer_text": "All of them, provided you’re in private company and not charging money for people to hear you play them. Heck, it’s how I learned to play the guitar and congas. Now, if you’re playing in front a live audience, and money was charged for the opportunity, then, none of them. Truth be told, I’ve been guilty of copyright infringement. Aside from my own material, I’d certainly played covers. Luckily for me and my friends, the copyright police weren’t there those nights… ",
            "date": "Answered June 14, 2020",
            "views": "147",
            "upvotes": "0"
        }
    ]
}