{
    "title": "How to nicely tell someone they are bad at singing and can’t be on my MUSICAL YouTube channel - Quora",
    "tags": [
        "Voice",
        "Singing",
        "YouTube Channels",
        "Musicians",
        "YouTube Videos",
        "YouTube",
        "Social Advice",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Martindale",
                "href": "/profile/Craig-Martindale"
            },
            "answer_text": "There’s a reason why people enjoy Simon Cowell on those TV talent shows. He is direct and truthful, and you know he’s being straight with you. Feelings get hurt, sure … but, you’re actually doing someone a favor by telling them they are not ready for prime time if they are not cut out to be a singer. Show business is cruel to people who actually have talent. But it can be awful to the mediocre. There are countless scams and scammers who are more than willing to take money for lessons, or representation, or photos, or wardrobe, or “consulting” fees … the list goes on. Not to mention hecklers and trolls. Then there is the mathematics of the situation: for every decent gig that actually pays enough to make it worth doing, there are about 5,000 people vying for it. If you want any level of success in the music business you need plenty of talent, a sincere work ethic, unending persistence, and a heck of a tolerance for insults, dismissive jerks and unappreciative audiences. It’s a tough road that’s littered with talented people who got spit out along the way. If it turns out that you’ve got what it takes, it can be greatly rewarding to be onstage in front of thousands of cheering fans. But it doesn’t work out that way for many people. You could be saving someone a lot of heartache (and probably a lot of money) by advising them to get out of a race they can’t win. Also, be aware that everyone’s a critic, and you could be wrong. But taking criticism is part of being a singer. There aren’t any stars who are beloved by absolutely everyone. Even the biggest stars are hated by a few. If someone wants to be a singer - then they should expect to be criticized. The best thing you can do is to be straight with them. Make sure it’s not personal. Be kind, be fair, but don’t deny the obvious. Who knows? They may work so hard to prove you wrong, that they actually develop their talent. ",
            "date": "Answered April 9, 2020",
            "views": "363",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juan Santamaria",
                    "user_href": "/profile/Juan-Santamaria-17"
                },
                {
                    "user_id": "James Martindale",
                    "user_href": "/profile/James-Martindale-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve McConnachie",
                "href": "/profile/Steve-McConnachie-2"
            },
            "answer_text": "I find in this day and age (I'm not an old bugger yet either, 25 years young) people are terrified of 2 things; Confrontation Criticism Honestly if they are bad tell them they are and need to practice, there clearly aren't enough people in their life telling them the truth and you are being one of them. If I screw something up or do something badly I try to be self critical of it within reason e.g not nitpicking tiny details and I accept the same criticism from my peers as I know all they are trying to do is help me get better. Most people are mature enough (or should be) to understand a lot of the time we give these opinions because we care about them not jumping the gun and posting something easily mockable or in some cases unremarkable online. Also if they are stubborn about it let them be, with more people eventually telling them they aren't as good as they think they WILL have to take note someday. Some people are just like that. I hope you're a decent enough person to give them the truth even if it hurts. ",
            "date": "Answered April 9, 2020",
            "views": "291",
            "upvotes": " Answer requested by Hailey Derosa",
            "upvoters": [
                {
                    "user_id": "Element Lake",
                    "user_href": "/profile/Element-Lake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Destiny Pivonka",
                "href": "/profile/Destiny-Pivonka"
            },
            "answer_text": "You don't have to tell them they're bad at anything. Would you want someone telling you that you're bad at something you're passionate about? We're all terrible at the things we're passionate about when we first start. Don't knock them down. That's just being mean for no reason. It's your channel, you get to choose the content. Tell them, \"It's nothing personal, you're just giving me content I'm not looking for right now. I'll let you know when I can use you and your talent,\" and thank them for offering to contribute. Making them feel good in this context opens up a dialogue and relationship. You won't burn any bridges. Maybe a year (or few years) from now, they will have taken lessons and become incredible. ",
            "date": "Answered April 10, 2020",
            "views": "270",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tiffany Smith",
                    "user_href": "/profile/Tiffany-Smith-1324"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rose Dickson",
                "href": "/profile/Rose-Dickson-5"
            },
            "answer_text": "I’m more concerned that she was presumptuous enough to think she was going to be featured on your channel. You wouldn’t be in this position if she hadn’t said that. Instead of telling her that she’s a terrible singer, you can say that you’d rather stick to singing solo while you start out. You can also suggest that she make her own channel to “show off [her] talent.” The ruthless and usually overly mean critics will tell her the truth. ",
            "date": "Answered April 9, 2020",
            "views": "276",
            "upvotes": " Answer requested by Hailey Derosa",
            "upvoters": [
                {
                    "user_id": "Enrique Woolfolk",
                    "user_href": "/profile/Enrique-Woolfolk"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramesh Ns",
                "href": "/profile/Ramesh-Ns"
            },
            "answer_text": "If you have to talk straight from a position of authority there should always be a clear message to the team and people involved in the scheme of things, something is not upto your expectations , failing which your enterprise will not move to achieve the goal, you don’t have to be rude while giving the message but you could tell subtly that they are not the type suiting the requirement , period .you will be actually saving the person from a wild goose chase ",
            "date": "Answered April 9, 2020",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angelia Milanovic",
                    "user_href": "/profile/Angelia-Milanovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colleen Kitchen",
                "href": "/profile/Colleen-Kitchen-4"
            },
            "answer_text": "You don’t have to tell them anything. Put on your youtube channel what you want, if you gave them rights, rescind them. If they bother you about it tell them you are “going in a different direction” and their talent would be put to better use on their own youtube channel. ",
            "date": "Answered April 11, 2020",
            "views": "257",
            "upvotes": " Answer requested by Hailey Derosa"
        },
        {
            "author_info": {
                "name": "Nancy Shuster",
                "href": "/profile/Nancy-Shuster-2"
            },
            "answer_text": "I would say that I don’t think the voice is suitable for use on the channel. If asked why, I would not say, “You are a bad singer”, but I would say something like, “your intonation can use some work” or “your style (and or technique) doesn’t match what I want to do with my channel”. ",
            "date": "Answered April 9, 2020",
            "views": "132",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "Just say that their particular singing isn’t geared toward your target audience. ",
            "date": "Answered April 10, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter "
        }
    ]
}