{
    "title": "How does religion negatively affect mental health? - Quora",
    "tags": [
        "Mental Illness",
        "Mental Health",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darren Farley",
                "href": "/profile/Darren-Farley-7"
            },
            "answer_text": "How does religion negatively affect mental health? Faith is defined as being belief in an issue without the requirement of evidence. It’s consciously letting something into your mental process without first having objective evidence available to make a determination on whether or not the idea is based upon reality or not, on whether it’s true or false. Once you remove the requirement of evidence, your mental gatekeeper or club bouncer let’s everything in, including the make believe and lies that you don’t really want in there. It allows the implanting of thoughts into your head that are not based upon reality. It’s the very definition of psychosis. And with every mental step that builds upon that initial lie you take a step further and further away from reality, disappearing into a world of make believe and fairy tales. And the bigger problem is that it makes people act in immoral and strange ways, just as a clinically psychotic person does. It twists their minds and thoughts into something grotesque. It makes them treat people around them with unearned disdain, it makes them turn against and hate themselves and/or their families and friends, it artificially divides and destroys entire communities. And then they claim they’re a religion of love and compassion. It doesn’t count though when that love and compassion only extends to people who have been brainwashed in precisely the same way. ",
            "date": "Answered July 20, 2020",
            "views": "330",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Leonard",
                    "user_href": "/profile/Steve-Leonard-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naomi Pardue",
                "href": "/profile/Naomi-851"
            },
            "answer_text": "Overall, it doesn’t. There is nothing inherent in ‘religion’ that causes mental health problems. For some people, some aspects of religious belief/practice may be problematic for THEIR mental health, while other aspects are positive. For other people, there are no particular negative aspects. There is considerable research/evidence that religiosity tends to improve mental health. Religion and Mental Health: What Is the Link? God Help Us? How Religion is Good (And Bad) For Mental Health The Mental Health Benefits of Religion & Spirituality | NAMI: National Alliance on Mental Illness Religion, Spirituality, and Mental Health (PDF) Religion and mental health https://www.apa.org/news/press/releases/2013/03/religion-spirituality ",
            "date": "Answered July 20, 2020",
            "views": "190",
            "upvotes": "0"
        }
    ]
}