{
    "title": "How to get big in the music industry - Quora",
    "tags": [
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Rowe",
                "href": "/profile/Ken-Rowe-7"
            },
            "answer_text": "You know, it is actually easier than you think, but you may have to do stuff that you dont want to do. The entertainment business is a continuous power play between producers, shareholders and entertainers. As an entertainer you have to appease everyone, not just the audience. Most of the time its being there at the right time and place. and then being willing to do the gig. It could start simply by doing some small time tracks for someone else in the studio. Maybe they want you to sing an example of how you think a song should be, and then the real vocalist will take over. you get a few dollars and none of the credit. But eventually you will end up getting in with a crowed who are all trying to rise to the top and you will have a better chance than you did before. Its all about hard work, dedication and not causing any problems. over the last 20 years, talent has been steadily coming in second to all this. but it certainly stands out if you have it. Play the local scene, meet people and develop relationships to build from. the more your name gets around the more the higher-ups are willing to listen to you. And do your best not to re-invent the wheel. you need fresh new material all the time. The more time you dedicating to writing new songs, the better. ",
            "date": "Answered December 19, 2017",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-44"
            },
            "answer_text": "As what? Artist? DJ? Producer? Agent? Promoter? You’re a bit vague here. If it’s about being a musician, do it for the love of it first and you might get rich anyhow. Probably the best way is to be a music business lawyer… ",
            "date": "Answered December 24, 2017",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abe Wiz",
                    "user_href": "/profile/Abe-Wiz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marina D Samoylovich",
                "href": "/profile/Marina-D-Samoylovich"
            },
            "answer_text": "It all depends on your talent or having a producer. Perform for different venues and see what is a demand for your music. ",
            "date": "Answered December 19, 2017",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Spinney",
                "href": "/profile/Keith-Spinney"
            },
            "answer_text": "Used to be talent. But that seems to be the least of todays stars worries. I hear giving up the tail is the only way. That goes for guys too. Haven’t you been watching the news? ",
            "date": "Answered December 22, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Michael Reiter",
                "href": "/profile/Jonathan-Michael-Reiter"
            },
            "answer_text": "Find out if you have talent, then make a valiant attempt but don’t give up your day job. You might need it… ",
            "date": "Answered December 19, 2017",
            "views": "25",
            "upvotes": "0"
        }
    ]
}