{
    "title": "How do YouTube musicians obtain permission to cover a song? - Quora",
    "tags": [
        "YouTube Music (website)",
        "iTunes",
        "Copyright Law",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shinsekai Yori Tenshi",
                "href": "/profile/Shinsekai-Yori-Tenshi"
            },
            "answer_text": "No you don’t. I am a living example. Here is my channel: AnimePianoAngel I cover mainly anime songs btw. There are many of us. Probably around hundreds of channel/people covering anime songs on piano alone. You do not need permission to upload piano covers. From my experience, if you don’t place ads, no one cares. If you do, only a very small number of them may be claimed by the original creator. If you are asking whether the video will stay on YouTube. Yes, it will. A rule though, don’t play over the original music. This increases the chance for your video to be taken down dramatically. If let’s say you want to place some of the music video or film clips from original sources over your cover, you can but again increases risk for your video to be claim by the original artist. As for making money out of YouTube as a cover artist?Yes you can. I know some artists earning around $2,000–5,000 a month from YouTube ads alone. You need about 1–2 million views per a month or video to turn YouTube into full time career. Perferably have around 1 million subscriber. Yes that should be your target. You can use other method to earn money too. You can distribute cover song tracks into itunes, google play, Spotify and many more by using distrokid or sound drop. Yes you can sell them. Musicians: Use DistroKid to upload your music to iTunes, Spotify, Amazon and Google Play -use if you are a constant and large artist -charge $20 for unlimited upload of covers for distribution in iTunes and other stores per a year Or Soundrop Distribution -use if you only distribute occasionally and small artists -they take 15% royalty for all sells -no start up fee. AND use Patreon, where you can get constant income per month/per video by your subscribers. Best way for artists and creators to get sustainable income and connect with fans | Patreon All this relies on one thing. Subscribers and how much they can engage to your music. Building them up should be your biggest priority if you want to make cover music on YouTube into your career. Admittedly, it’s hard. Unless you are the best of the best, it’s really hard. Out of the hundreds of anime pianist, I was talking about, probably only around 4–5 have the ability to sustain themselves with YouTube. So there you go not impossible but hard. Oh as for a medium size channel, like mine 1.5k subscriber or even for 10k subscribers, you won’t earn enough money to sustain your self. Full stop. You need a million sub or stable views per a month. Yes, it’s that cruel. ",
            "date": "Answered January 3, 2017",
            "views": "93",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Oh",
                    "user_href": "/profile/Kevin-Oh-73"
                },
                {
                    "user_id": "Erik Johann Riconalla",
                    "user_href": "/profile/Erik-Johann-Riconalla"
                },
                {
                    "user_id": "Thupten Dukpa",
                    "user_href": "/profile/Thupten-Dukpa-1"
                },
                {
                    "user_id": "Jasmine Law",
                    "user_href": "/profile/Jasmine-Law-15"
                },
                {
                    "user_id": "Jan Kincaid",
                    "user_href": "/profile/Jan-Kincaid-1"
                },
                {
                    "user_id": "Tang Qing Yau",
                    "user_href": "/profile/Tang-Qing-Yau"
                },
                {
                    "user_id": "Teng Zhang Totz",
                    "user_href": "/profile/Teng-Zhang-Totz"
                },
                {
                    "user_id": "Ryan Brown",
                    "user_href": "/profile/Ryan-Brown-127"
                },
                {
                    "user_id": "Yuvraj Metrani",
                    "user_href": "/profile/Yuvraj-Metrani"
                },
                {
                    "user_id": "Neha Mishra",
                    "user_href": "/profile/Neha-Mishra-1008"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elijah Sturdevant",
                "href": "/profile/Elijah-Sturdevant"
            },
            "answer_text": "YouTuber with 6K subs here with a music based channel! Thanks for the request! I know from experience that this can be tricky. It is completely allowed but the copyright system is not the best as you know. You might get a claim on your videos making them not able to make money off of, but if you dispute that claim there is about a 75% chance it will get fixed. Be careful what you do covers of, Sony is really well known to deal with them badly. Hope that helps! ",
            "date": "Answered January 3, 2017",
            "views": "26",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nissala McKay",
                    "user_href": "/profile/Nissala-McKay"
                },
                {
                    "user_id": "Bachtiar Achmad",
                    "user_href": "/profile/Bachtiar-Achmad-1"
                },
                {
                    "user_id": "Chandan Boruah",
                    "user_href": "/profile/Chandan-Boruah"
                },
                {
                    "user_id": "Portugal is Poglasan Greek Renzo Arshier Marsher Vlamidar",
                    "user_href": "/profile/Portugal-is-Poglasan-Greek-Renzo-Arshier-Marsher-Vlamidar"
                },
                {
                    "user_id": "Neo You Ming",
                    "user_href": "/profile/Neo-You-Ming"
                },
                {
                    "user_id": "Mario Caiti",
                    "user_href": "/profile/Mario-Caiti"
                }
            ]
        }
    ]
}