{
    "title": "How will the life of TikTokers be if TikTok gets banned? - Quora",
    "tags": [
        "Bans and Banning in India",
        "Censorship",
        "TikTok (mobile app)",
        "Bans and Banning",
        "The Internet",
        "Software and Applications",
        "Social Media",
        "Mobile Applications",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": "I just watched several videos and they said that India should launch other applications for these TikTok stars to transfer to once TikTok is banned. (2) One article says “If the app is banned in India, these TikTok celebs will have to shift to alternate social media apps in order to continue with their work. These celebrities also have a large fan following and thus they will have to cater to them by shifting their content on other apps. Apps like Instagram and Snapchat can be used to post similar TikTok videos, but they will have to adjust their material according to the tools available on these apps. Another good platform to shift on is YouTube as it is a great place to continue with their content along with not losing their followers count.” (1) I think YouTube may be a good choice after they enrich their TikTok content. The TikTok stars have skills in performance and people like to see them playing. Therefore, it should be fine if their videos last longer. I checked some materials before and found that some TikTok stars in India are actually actors or actresses, singers, dancers, musicians, or engage in other careers. TikTok is only one part of their life. For example, Riyaz Aly is also an Indian actor and fashion blogger, besides a top Indian TikTok star. He is only 17 years old as of 2020. I believe many of TikTok stars are young people who got famous because of their performance on TikTok or have already been popular from other causes before joining TikTok. Therefore, the ban of TikTok may affect them and their income a little bit, but they still have many chances and places to play, be it online or offline, be it on social media platforms or TV, movies. If your videos can really endure the test, YouTube, Instagram, and many other social media platforms are all ideal media that can make you popular. The only difference is that your videos may not reach that amount of audiences and there is no “For you” feed. And you may not feel comfortable for their rules and your videos have to be adjusted a little bit. Same with the TikTok stars. But I do believe that the singing, dancing, and other real skills would keep them sought-after for a long time. It is hard to believe that they would drop out of this acting career just because of this ban. They may insist on a lit bit longer and see what would happen.  (Why is TikTok still working in India after getting banned by the government? - Republic World) Thanks for reading. Sources:) What happens now after TikTok is banned in India? Here's what TikTok stars will do next - Republic WorldWhy is TikTok still working in India after getting banned by the government? - Republic World India bans dozens of Chinese apps, including TikTok and WeChat, after deadly border clash ",
            "date": "Answered July 9, 2020",
            "views": "453",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Valentin Urziceanu",
                    "user_href": "/profile/Valentin-Urziceanu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Bhatt",
                "href": "/profile/शुभम-भट्ट-Shubham-Bhatt"
            },
            "answer_text": "Here are some possibilities:- They might start using alternatives of TikTok such as Share Chat etc.They might start a Youtube channel and try to make cringy contents there.Some may spend less time on making videos and more time on studies. It is surely going to affect self education and mind growth.After the ban of TikTok, we can expect more traffic on Facebook and Instagram. Mark Zuckerberg is surely going to get profit from the ban.There are several employment schemes such as Skill Development Yojna of the Government from which they might get benifit due to the loss of job on TikTok.I read somewhere that Goverment might expand their MGNREGA sceme for those unemployed people after the ban of TikTok. Government might increase the current 100 to 200 days. On a serious note: I felt bad for few people who belonged to rural areas and got the opportunity to become famous through TikTok. They didn't have anything but talent. Along with the cringy content makers, other real influencers would also lose the fame to some extent. Yes but the ban was also necessary as China was gaining profit from it ultimately. I hope that those real talented people find a new “Made In India” source and get back on track. ",
            "date": "Answered June 30, 2020",
            "views": "34",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankur Sharma",
                    "user_href": "/profile/Ankur-Sharma-348"
                },
                {
                    "user_id": "Shambhavi Shandilya",
                    "user_href": "/profile/Shambhavi-Shandilya-3"
                },
                {
                    "user_id": "Manasvi Sharma",
                    "user_href": "/profile/Manasvi-Sharma-139"
                },
                {
                    "user_id": "Sushma Jha",
                    "user_href": "/profile/Sushma-Jha-20"
                },
                {
                    "user_id": "Rinkal Tomar",
                    "user_href": "/profile/Rinkal-Tomar"
                },
                {
                    "user_id": "Anupma",
                    "user_href": "/profile/Anupma-14"
                },
                {
                    "user_id": "Rahul Sharma",
                    "user_href": "/profile/Rahul-Sharma-13983"
                },
                {
                    "user_id": "Juhi Sinha",
                    "user_href": "/profile/Juhi-Sinha-47"
                },
                {
                    "user_id": "Bhanu Kiran",
                    "user_href": "/profile/Bhanu-Kiran-44"
                },
                {
                    "user_id": "Ananya Singh",
                    "user_href": "/profile/Ananya-Singh-859"
                }
            ]
        }
    ]
}