{
    "title": "How does a gramophone and a phonograph differ? - Quora",
    "tags": [
        "Gramophone",
        "Phonograph"
    ],
    "response": [
        {
            "author_info": {
                "name": "M Fisher",
                "href": "/profile/M-Fisher-14"
            },
            "answer_text": "The word “phonograph” (sound writing) was originally used as the name for Thomas Edison’s invention of the cylinder player in 1877. As time went on, it became a generic term for any cylinder-type audio recording & playback device The “gramophone” (letter voice) came about as a trademark in 1887 and also referred to cylinder-type players. Soon after, it was used to describe the newer invention of the flat disc record player by Emile Berliner. After the turn of the century, both words became more generic. In the US, a phonograph could be either a cylinder or flat disc player, although the latter was also called a “talking machine”. The largest manufacturer of disc machines for the first two decades of the 20th century was the “Victor Talking Machine Company”. In the UK, the term gramophone was the more popular name for disc players. One of the earliest producers there was “The Gramophone Company Limited”, founded in 1898. ",
            "date": "Answered February 17, 2017",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhragendra Bhat",
                    "user_href": "/profile/Bhragendra-Bhat"
                },
                {
                    "user_id": "Peter Loo",
                    "user_href": "/profile/Peter-Loo-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Loo",
                "href": "/profile/Peter-Loo-23"
            },
            "answer_text": "To tell them apart simply or in layman’s terms….. GRAMOPHONE: More of a British name for a record player. It is newer and more well-known than a PHONOGRAPH, developed by Emile Berliner, which uses a FLAT-DISC as storage for it to produce sounds.  PHONOGRAPH: More of an American name for a noise-playing machine. It is older and rarer than a GRAMOPHONE, invented by Thomas Edison, which uses a CYLINDER as storage for it to create sounds.  ",
            "date": "Answered September 2, 2018",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lihao Yam",
                    "user_href": "/profile/Lihao-Yam"
                },
                {
                    "user_id": "Bhragendra Bhat",
                    "user_href": "/profile/Bhragendra-Bhat"
                },
                {
                    "user_id": "Zanotto Andrea",
                    "user_href": "/profile/Zanotto-Andrea"
                }
            ]
        }
    ]
}