{
    "title": "How will musicians make money after the RIAA is shut down? - Quora",
    "tags": [
        "Recording Industry Association of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Peraino",
                "href": "/profile/Chris-Peraino"
            },
            "answer_text": "The first thing to realize in this question is that the RIAA is a trade organization made up of Record Labels and distributors of music.  The RIAA engages in political lobbying, legal action, and generally the marketing information related to the music industry.  The RIAA does not directly collect royalties and distribute them to artist.  The collection and distribution of royalties is handled by the performance rights organizations (such as ASCAP, BMI) and directly from the record companies for actual sales. The second thing to realize is that while Record sales have fallen, including 2014 being the first year without a platinum album award, the industry still make billions of dollars.  So it‘s a long way from “shutting down”. Digital distribution has changed one important aspect of the industry. Record labels cannot force distributors and stores to stock-up on an “up-and-coming” but unproven artist, if they want access to larger Mega stars recordings.  However that does not mean that similar tactics are not still employed all over the industry as a means to break new artists into mainstream play. Record labels (while the term might still be outdated) still have a vital role in the music industry, because performers either don’t want to, or do not have the skill, to handle promoting their music to a larger audience outside their shows.   Yes there are direct methods for artist to make money, including selling their music at shows or directly on-line.  There are also many new businesses and models that help artist achieve market distribution and reach fans in ways not possible just a few years ago. For top drawing artist, there are also opportunities to bypass the typical record label deals and now make deals with touring/promoters like the Live Nation deals with U2, Madonna and Jay-Z a few years ago.  But then we are talking about artist who can sell out arenas worldwide, not \"up and coming\" artist. What is gone (or going away) is the “Golden Age of Album Oriented Music”.  This a period from the late 60’s to the early 2000s that was largely catalyzed by the Beatles and became the gravy train for most record companies and artists for at least 2 generations.  The idea that an artist could “get signed” and then ”they made it” has always been overblown, but there were many artists and record companies that profited heavily from the sales of record albums, when fans only wanted or likely a few songs.   In the end, if an artist wants to perform, there are many avenues in which to do so, and many more opportunities to reach a wide audience (such as YouTube) without even having to play live in that area.   If an artist wants to “make a living” play music, then it’s still as difficult as it’s been and the combination of talent, tenacity, preparedness and luck are still the best ingredients for success. ",
            "date": "Answered October 26, 2014",
            "views": "294",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devin Jackson",
                    "user_href": "/profile/Devin-Jackson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vernon Smith Jr",
                "href": "/profile/Vernon-Smith-Jr"
            },
            "answer_text": "the riaa isn’t a record company. they don’t have anything to do with money or royalties or determining what money an artist gets when a song sells.. ",
            "date": "Answered April 6, 2019",
            "views": "8",
            "upvotes": "0"
        }
    ]
}