{
    "title": "How to make music if I am not creative - Quora",
    "tags": [
        "Making Music",
        "Music Production",
        "Creativity",
        "Artists and Creative Professions",
        "Music Industry",
        "Musicians",
        "Music",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Ruddick",
                "href": "/profile/Thomas-Ruddick-1"
            },
            "answer_text": "Creativity is over-rated. Firest, creativity is made, not born. You do not lack anything that the most creative people possess. What you haven’t done yet is to work as hard at creating something as they have. If you go back and lesten to the songs that many great writers turned out before they were famous, you’ll discover that they were not great from the outset, they had to learn and grow. U recall ab ubtervuew wutg /Bruce Hornsby where he said he’d wanted to write his hit “The Way It Is” for a long time, but he wasn’t ready as a sonwriter at first—he had to get better to pull the idea off. I’m presuming you want to to write music since your question is in the category. Well, then learn about the mechanics of writing music. You need to understand tonality and form and harmony and the congentions of any style, and if you’re doing songs you need lyrics. I recommend watching the Leonard Bernstein series of Young People’s Concerts on Youtube, it’s a good start, and then get a college-level music theory text or enroll in a class.Also try to find articles about songwriters that relate how they write. Now, songwriters (and all creative people) do not work alike, but those who have long-term success approach it like a job. They set aside time every day for writing. If they get stuck on one piece, they start another and come back to it later. After finishing a piece, put it away and revisit it a few weeks later—you may find there are edits and improvements and cuts that you didn’t notice when you were so pleased to have finished one. Many find it essential to keep a diary with them at all times, for writing down ideas about subjects and snippets of lyric that might come to you spontaneously. Revisit the diary often. There are some psychollogical techniques to get the creative juices flowing; I like the old book “Drawing on the Left Side of the Brain”. Go easy on yourself. Being self-critical is essential, and understand that to be successful you must “murder your darlings” (meaning that you have to be ready to trash something you’d love to keep(, but don’t ever fall into a self-defeating loop of thinking “I suck, I’ll never write anything good, I should just give up.” The right self-talk is “I wonder what I can do b etter?” ",
            "date": "Answered February 17, 2020",
            "views": "257",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rich Whitsell",
                    "user_href": "/profile/Rich-Whitsell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saibal Sen",
                "href": "/profile/Saibal-Sen-9"
            },
            "answer_text": "How do you know that you are not CREATIVE ? Please do not underestimate your inner power, I will suggest you to get rid of the negative feelings and try to CREATE something, I think that you can do that. Best of luck. ",
            "date": "Answered February 17, 2020",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Learn Stuff",
                    "user_href": "/profile/Learn-Stuff-4"
                }
            ]
        }
    ]
}