{
    "title": "How are a dialogue and action sounds recorded for movies? - Quora",
    "tags": [
        "Audio Recording",
        "Movie Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Surya Ramanathan",
                "href": "/profile/Surya-Ramanathan-2"
            },
            "answer_text": "Production sound mixerThe production sound mixer is head of the sound department on set, responsible for recording all sound during filming. This involves the choice and deployment of microphones, operation of a sound recording device, and the mixing of audio signals in real time. Boom operatorThe boom operator is an assistant to the production sound mixer, responsible for microphone placement and movement during filming. The boom operator uses a boom pole, a long pole made of light aluminum or carbon fiber that allows precise positioning of the microphone above or below the actors, just out of the camera's frame. The boom operator may also place radio microphones and hidden set microphones. In France, the boom operator is called the Perchman. Utility sound technicianThe utility sound technician has a dynamic role in the sound department, most typically pulling cables, but often acting as an additional boom operator or mixer when required by complex filming circumstances. Not all films employ a utility sound technician, but the increasing complexities of location sound recording in modern film have made the job more prevalent. This role is sometimes credited as cable puller or python wrangler. Sound designerThe sound designer, or supervising sound editor, is in charge of the post-production sound of a movie. Sometimes this may involve great creative license, and other times it may simply mean working with the director and editor to balance the sound to their liking. Dialogue editorThe dialogue editor is responsible for assembling and editing all the dialog in the soundtrack. Sound editorThe sound editor is responsible for assembling and editing all the sound effects in the soundtrack. Re-recording mixerThe re-recording mixer balances all of the sounds prepared by the dialogue, music and effects editors, and finalizes the films audio track. Music supervisorThe music supervisor works with the composer, mixers and editors to create and integrate the film's music. In Hollywood a music supervisor's primary responsibility is to act as liaison between the film production and the recording industry, negotiating the use rights for all source music used in a film. ComposerThe composer is responsible for writing the musical score for a film. Foley artistThe foley artist is the person who creates the post-sync sound effects for a film. These sound effects are recorded in sync to picture and are mostly body movements, footsteps or object manipulations. The most common reason for recording these effects live to picture is the fact that such sounds are lost when the dialogue is removed to be replaced by a foreign language version. Unsatisfactorily recorded sync sound effects can also be replaced with foley effects. Foley artists are also known as foley walkers. Foley is named after its first known practitioner, an early hollywood sound editor named Jack Foley. And yes, they rerecord every single sound you hear in the theatre. ",
            "date": "Answered March 29, 2015",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankit Kumrawat",
                    "user_href": "/profile/Ankit-Kumrawat-6"
                },
                {
                    "user_id": "Kean Sakata",
                    "user_href": "/profile/Kean-Sakata-1"
                },
                {
                    "user_id": "Dazz Malarkey",
                    "user_href": "/profile/Dazz-Malarkey"
                },
                {
                    "user_id": "Geordie Keitt",
                    "user_href": "/profile/Geordie-Keitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicole Rayner",
                "href": "/profile/Nicole-Rayner-1"
            },
            "answer_text": "In many movies, you never hear any of the sound that was recorded on location.  The audio that is recorded by the boom is usually there for reference.  There are a few main components to sound in a movie - dialogue, music, and the other \"background noises.\" Dialogue - The actors will come back during the post-production process to re-record their dialogue.  This is called ADR - Automated Dialogue Replacement.  Using the original recordings as a reference, they will record the dialogue so that it can be synced perfectly with the film.  Background Noise - Background noise in a movie or high quality tv show can be very complex.  The shuffling of the clothing, the sounds of footsteps, the sound of the wind rustling the leaves, etc.  These sounds are created and layered through many different techniques. Music - The last major component of the audio process is the music.  Sometimes a composer is chosen to write the music for the film; sometimes commercial music is curated into a soundtrack for the film. In conclusion; yes - typically the audio is completely replaced for the commercial release of the film.  This allows the sound designers and creators to craft sounds to suit the needs of the film, and helps to create a cohesive mood or theme. ",
            "date": "Answered April 4, 2015",
            "views": "902",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kean Sakata",
                "href": "/profile/Kean-Sakata-1"
            },
            "answer_text": "Good answers here. Just a quick note on ADR and audio effects. ADR (automated dialogue replacement) is time-consuming and expensive so when possible the live sound (spoken dialogue on set) is used especially on a “sound stage”. That’s why they call it a sound stage-it’s so the actors can speak their lines without any distracting or unnecessary noises in the background. Ever hear the director yell “quiet on the set!” before a scene take? They want the live dialogue. Anyway ADR almost always sucks b/c the dialogue editor can never match the ambience/voice quality of the live set (usually a boom mic audio capture) or the actor can't match the vocal continuity after the fact no matter how hard they try. A trained ear can almost always detect intercut ADR unless it’s a really effects heavy scene that live dialogue was only for reference and EVERYTHING was replaced. Audio effects on the other hand is almost always replaced. The sound of footsteps, doors opening/closing, street noises, sirens etc, are all ADDED in later. This is to hide dialogue imperfections and editing. Also the reference sound that was recorded on the live set almost always have the wrong “quality” for the producer, director and/or editor. Live sound can be a major PIA as the consistency/continuity will become a distraction so they simply replace it with what they want. ",
            "date": "Answered April 26, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Faisal",
                "href": "/profile/फ़ैसल-Faisal"
            },
            "answer_text": "This is very complex process and done in two ways. The firsts method is known as sync (Synchronised) Sound and second method is termed as ADR. In order to understand both you must know the basic principles of audiography. I am a trained audiographer and entrepreneur connect me for more details info@thesoundofindia.com ",
            "date": "Answered July 27, 2019",
            "views": "144",
            "upvotes": "0"
        }
    ]
}