{
    "title": "How to get my YouTube videos on Instagram - Quora",
    "tags": [
        "Instagram (product)",
        "Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Walker",
                "href": "/profile/Chris-Walker-802"
            },
            "answer_text": "Sometimes, Instagram can make it hard for you to promote links. This is for two reasons: You get a limited amount of areas to promote a linkInstagram doesn’t want you to promote dubious on their platformNow, there are two places you can insert a direct link on Instagram: Your bioIn a Story, but only if you have over 10,000 followersThis is really your only course of action as it can be challenging to promote links on Instagram without spamming. Here are some tips for linking on Instagram: Direct Link A direct link is the actual raw link you copy and paste from the address bar. This means it’s not on your website or landing page and you haven’t cloaked it with a URL shortener, such as Bitly. This can lead to more clicks, but your link is out in the open and more likely to be seen and taken down by Instagram. Sometimes you can get away with this, other times you can’t. It depends on how popular your Instagram account is and if Instagram can detect the link, possibly through a blacklist or user reports. Link to Website You can direct Instagram users to your website or to a page on your website. So you could be promoting a specific offer which would work better if you could direct traffic to a specific page rather than a home page. You can create Instagram posts related to this offer and in the caption or even on the image you can tell people to view the link in your bio. URL Shorteners A URL shortener can be used to hide the real URL and also shorten it to something more visually appealing. A popular URL shortening service is Bitly and there are plenty of services out there. Sometimes URL shorteners can be flagged by Instagram as spam, so you may need to stay on top of this and change your shorteners periodically. Link to a Link Page A Link Page is a web page that is specifically designed to be short, concise, and have a few links to pages that you want users to be directed to. It’s essentially a Landing Page that is designed to funnel users off into different areas that they’re interested in. Linktree is a popular service for this and you can add the main link to your bio which directs users to a page that contains multiple links. This strategy is great if you have multiple links that you want to be visible from a single page. ",
            "date": "Answered May 27, 2019",
            "views": "842",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "S Shreyas",
                    "user_href": "/profile/S-Shreyas-7"
                },
                {
                    "user_id": "Deepa S",
                    "user_href": "/profile/Deepa-S-301"
                },
                {
                    "user_id": "Sehba Rais",
                    "user_href": "/profile/Sehba-Rais-1"
                },
                {
                    "user_id": "Abhijit Mandavgade",
                    "user_href": "/profile/Abhijit-Mandavgade"
                },
                {
                    "user_id": "HP Progs",
                    "user_href": "/profile/HP-Progs"
                },
                {
                    "user_id": "Adriana Velasco",
                    "user_href": "/profile/Adriana-Velasco-7"
                },
                {
                    "user_id": "Vidyut Kumar",
                    "user_href": "/profile/Vidyut-Kumar-13"
                },
                {
                    "user_id": "Byung Gyu Lim",
                    "user_href": "/profile/Byung-Gyu-Lim"
                },
                {
                    "user_id": "Almar Haas",
                    "user_href": "/profile/Almar-Haas"
                },
                {
                    "user_id": "Brad Metcalf",
                    "user_href": "/profile/Brad-Metcalf-2"
                },
                {
                    "user_id": "Danielle Edwards",
                    "user_href": "/profile/Danielle-Edwards-55"
                },
                {
                    "user_id": "Shrenik Ab",
                    "user_href": "/profile/Shrenik-Ab"
                },
                {
                    "user_id": "ََAli Amjadi",
                    "user_href": "/profile/ََAli-Amjadi"
                },
                {
                    "user_id": "Arvind Kennedy",
                    "user_href": "/profile/Arvind-Kennedy"
                },
                {
                    "user_id": "Vikramjeet",
                    "user_href": "/profile/Vikramjeet-2"
                },
                {
                    "user_id": "Mikaela Barnes",
                    "user_href": "/profile/Mikaela-Barnes-4"
                },
                {
                    "user_id": "Eugene Lewis",
                    "user_href": "/profile/Eugene-Lewis-14"
                },
                {
                    "user_id": "Martin Gallagher",
                    "user_href": "/profile/Martin-Gallagher-51"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Easton",
                "href": "/profile/Louis-Easton-3"
            },
            "answer_text": "You’d be happy to know that it is actually possible to share the links of YouTube videos on Instagram. I have personally been doing this for over a year now. I have added more than 5 of my YouTube video links in my Instagram bio. You surely are thinking how I do this when Instagram only allows us to include one link in our bio? Well,m that’s a trick which has helped my get lots of people and traffic for my YouTube videos. I use a service called iLink which allows me to add as many links a s I want in my bio and convert all of them into only one short link which then I share in my Instagram bio. One of the best options of iLink is that you can either include the link of your videos as a clickable button, or have the video preview itself, as a button which is both clickable and can be played. This way, you can add as many YouTube videos or links as you want and drive traffic for them through Instagram. Using iLink, you can add several links to wesbsites, products, blogs, other social media platforms, videos and even musics. easily ditch the Instagram restriction and have lots of links in an Instagram bio.  ",
            "date": "Answered January 11, 2020",
            "views": "66",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sehba Rais",
                    "user_href": "/profile/Sehba-Rais-1"
                },
                {
                    "user_id": "Maryam Kefayati",
                    "user_href": "/profile/Maryam-Kefayati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Richards",
                "href": "/profile/Mike-Richards-187"
            },
            "answer_text": "With difficulty … ? ? IG only “allows” videos to be uploaded from your Phone Gallery. This means that you will have to copy the video into your phone gallery and then upload in IG in the normal way. However, IG is natively set to #Vertivision. (Arrrgg – HATE it!)If your YT video is in the proper Landscape mode then you will have either the edges cropped or black bars top and bottom in IG. So, make your choice and edit accordingly. Do a bit of a crop if there is room to spare on the sides. Position the video on a suitable background to make a square with something (interesting and relevant text?) in that top/bottom (both?) black space. You have seen others doing it so take them as an example. The easier way could be if YT had an IG link in the Share - but it doesn’t (I wonder why?) So the next logical thought is to just copy the link in your “Share” on YT and put it into the IG but I am not sure if IG still allows this to happen.  However, a quick test has shown that, although the link is shown in the comments, it does not seem to be a clickable URL in the normal way …  Ah well, that’s IG for you ☺ ",
            "date": "Answered November 13, 2019",
            "views": "683",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sehba Rais",
                    "user_href": "/profile/Sehba-Rais-1"
                },
                {
                    "user_id": "Tsaujla Aujla",
                    "user_href": "/profile/Tsaujla-Aujla"
                },
                {
                    "user_id": "Monei Da Goddess",
                    "user_href": "/profile/Monei-Da-Goddess-1"
                },
                {
                    "user_id": "Dr Pradeep Khasnobis",
                    "user_href": "/profile/Dr-Pradeep-Khasnobis"
                },
                {
                    "user_id": "Jeric Adrian Monzon",
                    "user_href": "/profile/Jeric-Adrian-Monzon"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TEM-1-ON-INDIA"
                },
                {
                    "user_id": "Tara O'Hanley",
                    "user_href": "/profile/Tara-OHanley"
                },
                {
                    "user_id": "Roshini",
                    "user_href": "/profile/Roshini-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Explore With Beri",
                "href": "/profile/Explore-With-Beri"
            },
            "answer_text": "  There is no way to get your YouTube videos directly on Instagram. However the below methods helps you promote your videos which are on YouTube and also ways to upload videos on Instagram. Use your Instagram bio to add YouTube video link. As shown in the screen shot. This way your viewers can directly watch your YouTube video via that link.If your intention is to just upload same video on Instagram without worrying about getting views on YouTube for that video then, You can upload your video that you have created for your YouTube channel again on Instagram in two ways.One, You can just upload a one minute video as a post for lengthy video on IGTV.You need to upload IGTV videos in portrait mode for which you might need to adjust the dimensions of your videos. Or you can use the below technique, add your video like below in any video editing app and then upload. ",
            "date": "Answered July 5, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oleg Sergeykin",
                "href": "/profile/Oleg-Sergeykin"
            },
            "answer_text": "You cannot directly get your Youtube video to Instagram, and also need to consider that Instagram has different video formats as compared to Youtube. You usually need to reformat your video from horizontal to vertical orientation before uploading it.You can use video conversion tools like Tappable Horizontal to Vertical Video Converter to convert a landscape video with no need to install additional software on your computer/smartphone. The tool is mostly focused on vloggers and videographers to create better content for Instagram. It converts horizontal video content into a square or vertical one. Its 1080x1920 (9:16) and 1080x1350 (4:5) output formats for vertical videos are exactly maximal and minimum video aspect ratios for IGTV.  ",
            "date": "Answered August 8, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oscar Scland",
                "href": "/profile/Oscar-Scland"
            },
            "answer_text": "I see a lot of people having issues with putting just their channel name after www.YouTube.com/. You can only put your YouTube Channel name after the URL if you have a Custom URL. For instance, www.YouTube.com/TheMaltbieBunch would work because we have a custom URL. If you don't have a Custom URL, 95% of creators you must go to your channel and double click the URL, copy and paste and use that on your Instagram page. I hope this helped, just wanted to clarify that for everyone! I also found this useful youtube video on How to put your YouTube Channel Link on Instagram. I recommend you to watch this video if you are experiencing any problems with this subject.  ",
            "date": "Answered June 30, 2019",
            "views": "21",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Adhikari",
                    "user_href": "/profile/A-Adhikari-3"
                },
                {
                    "user_id": "Jim Danby",
                    "user_href": "/profile/Jim-Danby"
                },
                {
                    "user_id": "Ruby Preclaid",
                    "user_href": "/profile/Ruby-Preclaid"
                },
                {
                    "user_id": "Art Ocan",
                    "user_href": "/profile/Art-Ocan"
                },
                {
                    "user_id": "Geertruida Weared",
                    "user_href": "/profile/Geertruida-Weared"
                },
                {
                    "user_id": "Svijetlana Hishmad",
                    "user_href": "/profile/Svijetlana-Hishmad"
                },
                {
                    "user_id": "French Thibaut",
                    "user_href": "/profile/French-Thibaut"
                },
                {
                    "user_id": "German Vanessa",
                    "user_href": "/profile/German-Vanessa"
                },
                {
                    "user_id": "Hungarian János",
                    "user_href": "/profile/Hungarian-János"
                },
                {
                    "user_id": "American Everett",
                    "user_href": "/profile/American-Everett"
                },
                {
                    "user_id": "Slovenian Stevica",
                    "user_href": "/profile/Slovenian-Stevica"
                },
                {
                    "user_id": "Croatian Srebrenka",
                    "user_href": "/profile/Croatian-Srebrenka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth McEntee",
                "href": "/profile/Beth-McEntee"
            },
            "answer_text": "Instagram definitely doesn’t make it easy to do this. Unless you have 10K followers and a business account, you won’t be able to include ‘swipe up’ links in your Stories. And given that you’re not able to include clickable links in the posts on your feed, your only other option is to include the link in your bio. Obviously, this is pretty limiting if you want to include more than one link, so your best option here would be to look at using a bio link tool—they let you host links to multiple destinations on a page that can be accessed from a single link, so you can include as many YouTube video links as you want. Hope this helps! ",
            "date": "Answered February 6, 2020",
            "views": "863",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Winston Fuhn",
                "href": "/profile/Winston-Fuhn"
            },
            "answer_text": "As you probably already know, there's no direct way to share YouTube videos to Instagram at the moment. But there is a walkaround way of uploading your youtube videos to instagram with ease Here are the steps to follow Copy the link of the video you want to post on instagramCut it into a 60sec video using a tool like Tube2gramInstall the IGTV app on your instagram accountUpload your 60secs videowatch the video below to check out the steps in details…. we will start by looking at some of the benefits of uploading video to instagram before getting into the steps of how to actually do it  Grow your Instagram account Fast with Instaboss: Tube Mechanics Notes.Com - Affiliate Marketing for Beginners ",
            "date": "Answered May 16, 2020",
            "views": "674",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Sunny Lens",
                    "user_href": "/profile/Sunny-Lens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Ruvolo",
                "href": "/profile/Dave-Ruvolo"
            },
            "answer_text": "You can’t upload a “YouTube” video per say, you would need to upload the MP4, MOV, or VID file directly. Keep in mind that Instagram only allows 1 minute of video per post. Also, using a mobile app like YouStar create and utilize a PRESS PLAY BUTTON or SCRIPT to use as your COVER image. This will prompt more plays on your video. *You can use a hyperlink on the “Stories” option showcased on your profile picture. Using the link extension/button or typing in the url copied from your YouTube video. **You can then put the Stories (only last 24 hours) into “Highlights” which stay on your Instagram page for your discretion regarding timeline. ",
            "date": "Answered March 10, 2018",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "JoAnne Mbonigaba",
                "href": "/profile/JoAnne-Mbonigaba"
            },
            "answer_text": "As far as I understand, videos on instagram have to be max 90 seconds so that greatly diminishes the videos that are eligible to be shared. For best results, i recommend clients to upload a “trailer” video directly to instagram and telling followers to go check out the full video on youtube for which the link is in their profile. Then put a link in their profile to their youtube channel. To your success JoAnne Mbonigaba ",
            "date": "Answered May 10, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adolfo-Usier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paco Aguilar",
                "href": "/profile/Paco-Aguilar-3-1"
            },
            "answer_text": "The only way to add more than one link to your Instagram profile is: ✅ Meet all the requirements of being a store on Facebook and get registered in Instagram Shopping. ✅ Or exceed 10,000 followers and be able to link the stories. Apart from this, the only way you can direct your traffic is by using the bio link or writing non-clickable links in your posts. This is a half solution because sometimes it even complicates the work and it is not easy to direct your audience to a landing page. And if you have a high budget, you have the option of creating ads on Instagram Ads to get users to land on your page, but what I'm saying ... be prepared to pay for it. Enviar comentarios Historial Guardadas Comunidad ",
            "date": "Answered June 11, 2020",
            "views": "615",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "S Blijheid",
                    "user_href": "/profile/S-Blijheid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean Trevis",
                "href": "/profile/Jean-Trevis"
            },
            "answer_text": "IG doesn’t allow to post links under the pictures or in the comments, so the only place where you can post a link is on your profile description. Some users post a part of the video and in the description say “you can find the link in my profile description”. ",
            "date": "Answered February 27, 2017",
            "views": "156",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gabriel Mendoza",
                    "user_href": "/profile/Gabriel-Mendoza-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Umanand Tripathi",
                "href": "/profile/Umanand-Tripathi"
            },
            "answer_text": "A common tactic is to add “link in profile” to a photo caption, sending followers to your bio where they can click on the link and watch the YouTube video. Instagram prevents links in photo captions or comments from being clickable. Other than paid ads, the only clickable link within Instagram is on your profile page. ",
            "date": "Answered February 27, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                },
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefano Cerruti",
                "href": "/profile/Stefano-Cerruti-1"
            },
            "answer_text": "It’s a bit tricky, but possible. Firstly you have to download the video from Youtube with a software (search on Google “Youtube downloader”). Then if this video lenght is more than 60 seconds you will edit with another software to shorten it. Finally you will upload it on your instagram account: open it and press the F12 button on your keyboard then in the developers panel select the mobile phone view. Now you can to proceed with the uploading. ",
            "date": "Answered January 5, 2019",
            "views": "993",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christine Welsh",
                "href": "/profile/Christine-Welsh-26"
            },
            "answer_text": "You can’t. YouTube is owned by Google, who is a mortal enemy of Facebook, who owns Instagram. You can’t put any links to anything in Instagram, unless it is sent in a DM, or you pay for an ad, or you have 10K+ followers and do a swipe up story link. ",
            "date": "Answered June 8, 2020",
            "views": "611",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay von Mohr",
                    "user_href": "/profile/Jay-von-Mohr"
                },
                {
                    "user_id": "VASUKI NATH Ojha",
                    "user_href": "/profile/VASUKI-NATH-Ojha-1"
                },
                {
                    "user_id": "Brenda Seldin",
                    "user_href": "/profile/Brenda-Seldin"
                },
                {
                    "user_id": "Stephen Westland",
                    "user_href": "/profile/Stephen-Westland"
                },
                {
                    "user_id": "Jeff Drock",
                    "user_href": "/profile/Jeff-Drock-1"
                },
                {
                    "user_id": "Maria Batka",
                    "user_href": "/profile/Maria-Batka"
                },
                {
                    "user_id": "Jason Allen",
                    "user_href": "/profile/Jason-Allen-98"
                },
                {
                    "user_id": "Pooja",
                    "user_href": "/profile/Pooja-754"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marshall Johnson",
                "href": "/profile/Marshall-Johnson"
            },
            "answer_text": "You can also go to Youtube Video Downloader for Instagram & Twitter and it will convert any YouTube video to a video suitable for upload to Instagram! Then you can either download the video or send it to you phone so you can upload it. Very handy! ",
            "date": "Answered March 22, 2017",
            "views": "223",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hetal Chandarana",
                    "user_href": "/profile/Hetal-Chandarana-1"
                },
                {
                    "user_id": "ََAli Amjadi",
                    "user_href": "/profile/ََAli-Amjadi"
                },
                {
                    "user_id": "Pritish Srivastava",
                    "user_href": "/profile/Pritish-Srivastava-4"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Nehal Ossama El Soda",
                    "user_href": "/profile/Nehal-Ossama-El-Soda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maxim Sidko",
                "href": "/profile/Maxim-Sidko"
            },
            "answer_text": "Presumably your videos are longer than 1 minute, you can’t. This is because Instagram regulates videos to only 1 minute to conserve file size, people's convenience, etc. So if your video is less than 1 minute, you may put it into a (Windows PC) file (most likely mp4) and upload it to Instagram, or save it off of YouTube to your phone library and just go to Instagram and pick the video out of your library. Hope this helps! ",
            "date": "Answered February 25, 2017",
            "views": "61",
            "upvotes": " Answer requested by Goto Japanschool",
            "upvoters": [
                {
                    "user_id": "Nimesh Madushanka",
                    "user_href": "/profile/Nimesh-Madushanka"
                },
                {
                    "user_id": "Ronak",
                    "user_href": "/profile/Ronak-113"
                },
                {
                    "user_id": "Anisha Thakur",
                    "user_href": "/profile/Anisha-Thakur-23"
                },
                {
                    "user_id": "Mateusz Kowal",
                    "user_href": "/profile/Mateusz-Kowal-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Becca Clark",
                "href": "/profile/Becca-Clark-16"
            },
            "answer_text": "Since everyone else has put their own two cents about uploading the physical videos, I'm going to take it a step further. When you post these videos, include a call-to-action in your caption. Something like “want to see the whole video? click the link in my bio!” This will get you views on both Instagram AND YouTube! ",
            "date": "Answered November 20, 2017",
            "views": "226",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajah Titus",
                "href": "/profile/Ajah-Titus"
            },
            "answer_text": "Firstly you have to copy the youtube link from the video then head over to any instagram video and comment on it.. Ensure you dont Spam the posts.do not abuse the privilege",
            "date": "Answered March 9, 2018",
            "views": "263",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rosina Thapa",
                    "user_href": "/profile/Rosina-Thapa"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reo Saito",
                "href": "/profile/Reo-Saito-1"
            },
            "answer_text": "Simply download with iTube Studio then post them on Instagram. it is the best video downloader. with the iTube studio, we can download videos from any video streaming websites. ",
            "date": "Answered January 5, 2019",
            "views": "251",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shana Graham",
                    "user_href": "/profile/Shana-Graham-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Logan Miller",
                "href": "/profile/Logan-Miller-52"
            },
            "answer_text": "Unfortunately, you can’t place a link on any of your Instagram posts. You can, however, change the link in your bio and reference the link in your posts. To do that, go to your profile and press “Edit Profile” and add the link to the YouTube video to your bio. Hope this helps! ",
            "date": "Answered March 3, 2017",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin Taylor",
                "href": "/profile/Justin-Taylor-124"
            },
            "answer_text": "I would suggest downloading the video you want. Copy the files into a Google Drive folder, access that folder with your phone to upload to Instagram. That is how I am able to do it. ",
            "date": "Answered July 7, 2018",
            "views": "29",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Kate Brown",
                "href": "/profile/Kate-Brown-264"
            },
            "answer_text": "Download videos from YouTube, cut and edit the video to meet Instagram requirements for video posting, then share YouTube videos to Instagram with one click. Here is the full guide: How To Share YouTube Videos to Instagram (4 Simple Steps) ",
            "date": "Answered July 8, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rohan Kumar",
                "href": "/profile/Rohan-Kumar-3197"
            },
            "answer_text": "Instagram allow us to post a story with the swipe up link after ten thousand followers. One can easily get their YouTube video on Instagram through this mean 😇 I hope I helped you 😬 Rohan Kumar ✍️ ",
            "date": "Answered July 24, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanel Aavistu",
                "href": "/profile/Tanel-Aavistu"
            },
            "answer_text": "The best way is to put it in your profile, under the bio. Then it is clickable and when you post you can say for example: “New video up, link in bio.” ",
            "date": "Answered February 27, 2017",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hriddhi Maitra",
                "href": "/profile/Hriddhi-Maitra-1"
            },
            "answer_text": "Just copy paste the link from Youtube to instagram bio or insta post wherever you want people to see it. (?) ",
            "date": "Answered March 6, 2018",
            "views": "689",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "San Abhignu",
                "href": "/profile/San-Abhignu"
            },
            "answer_text": "Promote your account by posting links ",
            "date": "Answered December 24, 2017",
            "views": "229",
            "upvotes": " Answer requested by Manish Virendra Kandwal"
        },
        {
            "author_info": {
                "name": "Andre L. Vaughn",
                "href": "/profile/Andre-L-Vaughn"
            },
            "answer_text": "Go to your proflie and enter it… ",
            "date": "Answered March 10, 2017",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathin Ramos",
                "href": "/profile/Jonathin-Ramos-1"
            },
            "answer_text": " 0:00-0:30 ",
            "date": "Answered November 12, 2017",
            "views": "692",
            "upvotes": "0"
        }
    ]
}