{
    "title": "How can a politician become rich? - Quora",
    "tags": [
        "Politicians and Government Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Whalen",
                "href": "/profile/Mark-Whalen-8"
            },
            "answer_text": "If you want to know why Trump is going to be impeached with only Democrat support. Follow the money. When he drains the swamp, he removes the ways that Dems and some Republicans get rich while they are in office. Biden and son are just one small example. So Trump, who needs no money, becomes prez and already knows where the money is coming from in most cases. Its our foreign aid programs. Our tax dollars go to corrupt nations who return much of it in whatever format works to the politicians who send it to them. Meanwhile their country gets nothing and the leaders get 50% or so and Biden or some other American politician or the Democrat party itself is given millions in - used to be- before Trump-untraceable kick backs.Trump has spilled the beans regarding the big honey pot used by each party in an effort to save taxpayers money and of course make him a hero.It probably seemed like a good plan once he was prez. I guaranfreakintee you that the Dems see impeachment as something they will blame on the soon to be gone far left wing of their party and every politician up there wants things to go back to those good old honey pot days. Cats out of the bag though so they are all scrambling behind the scenes trying to find a what they hope will be high ground after what they hope is a short high tide. What they obviously do nort want to see is the American public wising up to the real truth. The next election could be very very interesting. impeachment or not. ",
            "date": "Answered December 9, 2019",
            "views": "883",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Weise",
                    "user_href": "/profile/Andrew-Weise-4"
                },
                {
                    "user_id": "Jim Travoli",
                    "user_href": "/profile/Jim-Travoli"
                },
                {
                    "user_id": "Helen Miller",
                    "user_href": "/profile/Helen-Miller-118"
                },
                {
                    "user_id": "Alina Davidov",
                    "user_href": "/profile/Alina-Davidov"
                },
                {
                    "user_id": "Justin W. Clarke",
                    "user_href": "/profile/Justin-W-Clarke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dondrell McCallon",
                "href": "/profile/Dondrell-McCallon"
            },
            "answer_text": "I believe the most efficient, legal way politicians can become rich are speaking at conferences and/or writing books. Everyone knows of Bill and Hillary charging copious amounts to speak at various banks. The two have earned an estimated total of $153 million from 729 different speeches averaging $210,795 for each one. It's also said that President George W. Bush has earned $15 million for speeches charging an average of $100,000–175,000 per. Secondly is books. Most notable, President Obama has gotten around $2.5 million from book royalties. Also, Hillary Clinton is has received $5 million in book royalties. Although, there's not tons of ways to get rich while in office. Play your cards right, and you'll be a millionaire in no time when you get out. Sources: $153 million in Bill and Hillary Clinton speaking fees, documented On talk circuit, George W. Bush makes millions but few waves Obama Earned Nearly $2.5 Million in Book Royalties in 2008 Clinton discloses millions in book royalties, speaking fees ",
            "date": "Answered November 17, 2016",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Colin Croteau",
                    "user_href": "/profile/Colin-Croteau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "Legally? Networking - Politicians meet a wide variety of people. The can use this network if/when they retire to enter into a number of different business ventures.Friendships - Besides networking politicians make friends with wealthy and important people. These friendships can be leveraged into money-making opportunities.The media - Especially in the US, former politicians are sought for their advice and access. Many can leverage their term in office into book deals, appearances as television and radio commentators an even speaking tours.Insider information - Politicians are privy to a wide range of information that is not necessarily available to the general public. As long as they act within the laws of their nation, many can leverage that information into personal wealth for themselvesIllegally? Bribes and kickbacks - Politicians can receive payments for making or not making certain decision while in office. They can also steer friends and cronies to positions and government deals in return for kickbacks This is illegal; however it does occur.Insider trading - They can use information which they can uncover for personal and illegal financial advantage",
            "date": "Updated November 10, 2018",
            "views": "33",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Chris White",
                    "user_href": "/profile/Chris-White-427"
                },
                {
                    "user_id": "Colin Croteau",
                    "user_href": "/profile/Colin-Croteau"
                },
                {
                    "user_id": "Neil Clayman",
                    "user_href": "/profile/Neil-Clayman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Andrew-402"
                },
                {
                    "user_id": "Rangga Saputra",
                    "user_href": "/profile/Rangga-Saputra"
                },
                {
                    "user_id": "John Sullivan",
                    "user_href": "/profile/John-Sullivan-24"
                },
                {
                    "user_id": "Kenneth Harper",
                    "user_href": "/profile/Kenneth-Harper"
                },
                {
                    "user_id": "Kai Peter Chang",
                    "user_href": "/profile/Kai-Peter-Chang"
                },
                {
                    "user_id": "Eddie Xue",
                    "user_href": "/profile/Eddie-Xue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andre Ewert",
                "href": "/profile/Andre-Ewert"
            },
            "answer_text": "Most retire after 25 years as Multi millionaires so you Do the Math…lol There are official earnings and then there are Speaker fees, political donations, AIPAC Donations, consultancy fees, endorsements, brown envelopes..a plethora of available sources of income, all listed in their Babylonian Rulebook ..lol Why do you think nothing ever changes to help Joe Public? Because they’ve been bought, co-opted, compromised, blackmailed, enticed, tantalized and some have even gone to Epstein Island of pleasure and perdition…or to the Cruiseship of a famous arms merchant planning that next war …lol  There is always for Weapons and War, and never any for Universal Healthcare, Housing and Help for the Poor…why is that? Both the GOP and DNC work for the same War Merchants, Banksters and Big Cartels, not for Joe Pubic…it is a corrupt, broken, dysfunctional system that needs to be overhauled. Be the change you want to See. Love Life Loud and Clear ",
            "date": "Answered July 29, 2019",
            "views": "312",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roger Duncan",
                "href": "/profile/Roger-Duncan"
            },
            "answer_text": "Because they have something very valuable to sell. Influence. You think it’s unfair that the wealthy & corporations have an outsized influence in politics? You want less money in politics? You’ll never accomplish that through legislation. You have to reduce the scope of the Federal government to a point to where the economic returns don’t justify the investment in influence. Devolve power to the states, away from the Federal government. Switzerland has 26 cantons. Their central government is very weak, with limited power. The real power rests in the cantons. Because of this, special interest group lobbying is virtually non-existent in Switzerland. It simply isn’t economically feasible. As a result, politics there is local. This is how these United States were supposed to operate. ",
            "date": "Answered September 26, 2019",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garrett Mosley",
                    "user_href": "/profile/Garrett-Mosley-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Weldon Dunlap",
                "href": "/profile/Weldon-Dunlap"
            },
            "answer_text": "Here is a book deal worth 60 million received by the Obama's. https://www.google.com/url?sa=t&source=web&rct=j&url=http://www.newsweek.com/barack-and-michelle-obama-sign-joint-book-deal-worth-over-65-million-report-562409%3Famp%3D1&ved=0ahUKEwiw55Xu1qTWAhVs74MKHfQ8CaYQFggdMAA&usg=AFQjCNHgQgDEmECz-WNH52ygchzQ2nN41Q&ampcf=1 Speaking fees https://www.google.com/url?sa=t&source=web&rct=j&url=https://amp.cnn.com/cnn/2016/02/05/politics/hillary-clinton-bill-clinton-paid-speeches/index.html&ved=0ahUKEwjB1JaC2KTWAhVj74MKHepwAmEQFggdMAA&usg=AFQjCNGBP8MOaB647BBUyK1AgXfG1x72jA&ampcf=1 https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.usnews.com/news/articles/2016-04-22/heres-who-paid-hillary-clinton-22-million-in-speaking-fees%3Fcontext%3Damp&ved=0ahUKEwjB1JaC2KTWAhVj74MKHepwAmEQFgggMAE&usg=AFQjCNGAczyC79FPCupWSiGTe2AV4kU1bw&ampcf=1 https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.economist.com/news/business/21725303-six-months-mr-trumps-conflicts-interest-look-even-worse-how-donald-trump-monetising&ved=0ahUKEwiep_7E2KTWAhUN8YMKHYviBQ8QFggsMAU&usg=AFQjCNGTyNn-y_Wz0qhFN_NORvkLFRBdZw ",
            "date": "Answered September 14, 2017",
            "views": "998",
            "upvotes": " Answer requested by Gerald C Dunn",
            "upvoters": [
                {
                    "user_id": "Ekemini Okoro",
                    "user_href": "/profile/Ekemini-Okoro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Greatman Walter",
                "href": "/profile/Daniel-Greatman-Walter"
            },
            "answer_text": "In my country politicians are rich by reason of the normal salary ( they are paid well ). But when they want to be richer these are the things they do. They hype the price of government contracts given to them to manage. Example if a project should cost 3 million they'll add 2 more millions and still use less quality materials for the project. This act is locally called “ chanfer ”.They building companies and award government contracts to their companies. And go as far doing number 1.If they don't get the chance to handle government projects, they appoint some other organisation to handle the project but with a conditional deal of them getting something in return.Only the bad guys do this. Not all politicians are bad ",
            "date": "Answered June 25, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nellie McConnell",
                    "user_href": "/profile/Nellie-McConnell-2"
                },
                {
                    "user_id": "Colin Croteau",
                    "user_href": "/profile/Colin-Croteau"
                }
            ]
        },
        {
            "author_info": {
                "name": "T.L. Brink",
                "href": "/profile/T-L-Brink"
            },
            "answer_text": "Make it plain by words and deeds that you are someone donors can count on for favors. Come through with the pork barrel appropriations, special favors and pardons, no matter how embarrassing or unpopular. Make it clear that you expect quid pro quo in the form of political contributionsdonations to your “charitable foundations”book dealsspeaking feespositions on the boardconsulting feesinsider information for investmentsSome of these returns will come only after you leave office, so you have to maintain the perception that you can run again (maybe for a higher office) or your wife or child will be in office and can deliver future favors. ",
            "date": "Answered July 11, 2019",
            "views": "314",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mithun Rathod",
                    "user_href": "/profile/मिथुन-राठोड-Mithun-Rathod"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mina Sevique",
                "href": "/profile/Mina-Sevique"
            },
            "answer_text": "Unless they have their own companies, it is mostly by abusing power and exploiting crony capitalism, doing favours to mostly international companies and using “pay to play” schemes. Add on top of that fees for speeches, endorsements and a powerful network and pretty much that all adds up. It is impossible to get rich by being “a public servant” and no one should be able to get rich without a single day of work experience, going straight from college to politics. ",
            "date": "Answered July 8, 2017",
            "views": "344",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rachit Gupta",
                "href": "/profile/Rachit-Gupta-36"
            },
            "answer_text": "I feel every politician becomes gazillionaire because the project whichever passed by the government. They are well aware of those projects. So they give projects to their family members’ companies, which increases their wealth. Not only this they are free to purchase the stocks from the stock exchanges. So they could invest their money by purchasing the stocks. So by giving projects to their selected companies, they could increase the value of their stocks, which increased their wealth. So they become a gazillionaire. So I think, the stock exchange makes them a gazillionaire. Not only this they don’t need to purchase vehicles. As most of the politicians get a vehicle from the government. So they don’t need to take loans for a vehicle, which makes their life savings. So saving and investment make their wealth increase. ",
            "date": "Answered April 3, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Helen Miller",
                    "user_href": "/profile/Helen-Miller-118"
                },
                {
                    "user_id": "Alina Davidov",
                    "user_href": "/profile/Alina-Davidov"
                },
                {
                    "user_id": "Cameron Cornell",
                    "user_href": "/profile/Cameron-Cornell-5"
                },
                {
                    "user_id": "Kat Makinney",
                    "user_href": "/profile/Kat-Makinney"
                },
                {
                    "user_id": "Neil Clayman",
                    "user_href": "/profile/Neil-Clayman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard H. Green",
                "href": "/profile/Richard-H-Green"
            },
            "answer_text": "Many politicians are offered “business” deals and partnerships that are really just a “cover” for a bribe. If you really have “brass balls,” set up a foundation and funnel millions of dollars through it for your family and friends while giving pennies on the dollar to charities. Of course, you can always be like Biden and let China invest over $1 BILLION with your son. It’s technically legal. LOL ",
            "date": "Answered April 15, 2018",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Harding",
                    "user_href": "/profile/James-Harding-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Peoples",
                "href": "/profile/Patricia-Ann-Peoples"
            },
            "answer_text": "Representatives and Senators are paid salaries. They get speaking engagements, write books, and of course, as legally-as-possible are pursued by PAC's (Political Action Committees). It adds-up, but they aren't living Trump or Bloomberg-lavishly. Also, let me remind you, some of the candidates are wealthy before they enter public service. Sen. Susan Collins is one of them. So, is Senator John Kelly, plus he married an heiress. ",
            "date": "Answered March 2, 2020",
            "views": "556",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ernest Vilches",
                    "user_href": "/profile/Ernest-Vilches"
                },
                {
                    "user_id": "Kart Keyan",
                    "user_href": "/profile/Kart-Keyan-2"
                },
                {
                    "user_id": "Alvont Gedrich",
                    "user_href": "/profile/Alvont-Gedrich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Robinson",
                "href": "/profile/Howard-Robinson-20"
            },
            "answer_text": "First they vote themselves their salaries and benefits, usually without limitation. I would like for all politicians to abide by the same laws they make for all of us and that means participation in the social security and Medicare systems with no government funded IRA or 401K. They should be forced to participate in Obamacare or purchase medical insurance without subsidy. ",
            "date": "Answered June 8, 2019",
            "views": "116",
            "upvotes": " Answer requested by Penny Nichols",
            "upvoters": [
                {
                    "user_id": "Colin Croteau",
                    "user_href": "/profile/Colin-Croteau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateek Jain",
                "href": "/profile/Prateek-Jain-31"
            },
            "answer_text": "They generally get black money in form of commission for work which government departments give for public welfare.. To tackle this problem government decided to go for online biding Then politicians decided to put technical conditions who is eligible to apply for contact.. And if eligibility criteria is fulfilled by many persons they put cartel to stop deserving candidate by under bidding.. Bidding for lowest price and once contact is granted they will use price escalation clause to revise the contract value.. Or Ask deserving candidate to give sub contact to their agents or dummy companies.. ",
            "date": "Answered December 9, 2014",
            "views": "490",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy Marchand",
                    "user_href": "/profile/Roy-Marchand"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Moore",
                "href": "/profile/Leslie-Moore-28"
            },
            "answer_text": "Politician become rich automatically because they develop access to multi-millionaires and billionaires. The Billionaires and Millionaires meets with elected politicians for easier approvals on investment deals. Politicians take that opportunity to make their own side deals with these millionaires. ",
            "date": "Answered February 27, 2018",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Lie Kwee",
                "href": "/profile/John-Lie-Kwee"
            },
            "answer_text": "Wow… From my experience living in developing country, in many circumstances (but not always and not all of them), politicians become so rich because of corruptions, or getting some “reward” after helping some businessmen get rich by mean of “rent seeking”. The term rent seeking means getting abnormal profit due to something out of normal competition such as getting monopolistic or oligopolistic licenses, or getting some “insider information” and make money out of it, or using their influence to help somebody “win” some large government contracts. ",
            "date": "Answered September 27, 2018",
            "views": "360",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tabuk Taggu",
                    "user_href": "/profile/Tabuk-Taggu"
                },
                {
                    "user_id": "Deepanjan Basu",
                    "user_href": "/profile/Deepanjan-Basu-2"
                },
                {
                    "user_id": "Abhishek Bhosle",
                    "user_href": "/profile/Abhishek-Bhosle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Buca",
                "href": "/profile/Peter-Buca-1"
            },
            "answer_text": "Power. Politics is about power. Those that have it can translate it into income. Power comes from the populace - by controlling the populace politicians collect power. Consider this when politicians tell you the world will end IF you do not vote for them. The world will go on for billions of years quite happily. What will end is their income. ",
            "date": "Answered September 30, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Buddy Alton",
                "href": "/profile/Buddy-Alton"
            },
            "answer_text": "Because they are dishonest and getting paid for selling a manufactured (false) viewpoint to Americans. Getting paid for passing unfavorable laws with which to control Americans. Getting paid to pave the way for big business to do as they damned well please in the name of profit. ",
            "date": "Answered September 26, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jody Rossel",
                "href": "/profile/Jody-Rossel-1"
            },
            "answer_text": "They usually bring their wealth with them. Most of them are heavily into the stock market. If you think about it, Candidates have to have a wealthy checkbook in order to run financially viable campaigns. ",
            "date": "Answered September 8, 2017",
            "views": "482",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Pease",
                "href": "/profile/Jim-Pease-4"
            },
            "answer_text": "the front door deals are nothing compared to the backdoor deals..A professional politician is a professionally dishonorable man. In order to get anywhere near high office he has to make so many compromises and submit to so many humiliations that he becomes indistinguishable from a streetwalker. ― H.L. Mencken ",
            "date": "Answered July 29, 2019",
            "views": "155",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Anderson",
                    "user_href": "/profile/Chris-Anderson-633"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venkatesh Iyer",
                "href": "/profile/Venkatesh-Iyer-5"
            },
            "answer_text": "Politicians are involved in the planning and passing of government funded infrastructural projects, human resources related projects, projects in pretty much any field you can think of. If you wish to be a contractor for some such project, you will find it easier to bag the contract if you grease the right politician’s palm.The bigger the contract, the more grease needed. ",
            "date": "Answered March 1, 2020",
            "views": "180",
            "upvotes": " Answer requested by Alexander Richardson",
            "upvoters": [
                {
                    "user_id": "Mithun Rathod",
                    "user_href": "/profile/मिथुन-राठोड-Mithun-Rathod"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthick Muthumuniyandi",
                "href": "/profile/Karthick-Muthumuniyandi"
            },
            "answer_text": "Bz they are getting few things in very cheap price and lots and lots of things free of cost.. they are not going to spend single penny from their packet except election time..    ",
            "date": "Answered December 13, 2014",
            "views": "364",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yubraj Bhatt",
                    "user_href": "/profile/Yubraj-Bhatt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marlene Fischer",
                "href": "/profile/Marlene-Fischer-1"
            },
            "answer_text": "might be that they take from the poor and give to the rich. might be that they have tenure for life instead of one or two terms. might be that they write books that sell. might be that they get pensions for life with medical … robin hood - took from the rich and gave to the poor. alas, fiction. ",
            "date": "Answered March 1, 2020",
            "views": "301",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mithun Rathod",
                    "user_href": "/profile/मिथुन-राठोड-Mithun-Rathod"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "Given their job responsibilities once elected, they don’t make it while in office. Instead, as others have suggested, they use their records in office to get jobs as consultants, lobbyists, etc., from which they can make some real money. ",
            "date": "Answered March 1, 2020",
            "views": "272",
            "upvotes": " Answer requested by Alexander Richardson",
            "upvoters": [
                {
                    "user_id": "Alvont Gedrich",
                    "user_href": "/profile/Alvont-Gedrich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyam Beriwal",
                "href": "/profile/Priyam-Beriwal"
            },
            "answer_text": "Make a list of present politicians & collect their financial data (before & after being politician). And then tally the majority of politicians financial conditions in past & present. You will definitely get your answer. ",
            "date": "Answered April 8, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Isaac Wingfield",
                "href": "/profile/Isaac-Wingfield"
            },
            "answer_text": "Here’s a quote on the subject: “If you put your politicians up for sale, as the US does … then someone will buy them–and it won’t be you; you can’t afford them.” — Juan Cole ",
            "date": "Answered March 1, 2020",
            "views": "228",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jignesh Parekh",
                "href": "/profile/Jignesh-Parekh-41"
            },
            "answer_text": "Politicians become rich and powerful doing scams when ruling party does any scam it gives 40 percent to opposition party to remain quiet ",
            "date": "Answered October 17, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Marie Maglione",
                "href": "/profile/Marie-Maglione"
            },
            "answer_text": "Sad to say if u pay attention not only do they get rich their spouses n children get rich too. 1% of the population r millionaires but 50% of congress are millionaires. ",
            "date": "Answered September 26, 2019",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vipul Singh",
                "href": "/profile/Vipul-Singh-47"
            },
            "answer_text": "No. ",
            "date": "Answered April 3, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Don Hank",
                "href": "/profile/Don-Hank-3"
            },
            "answer_text": "There are many ways but they all work. Ya know what is funny? The country whose career politicians are mostly corrupt rails against Putin claiming he is corrupt. ",
            "date": "Answered July 11, 2019",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adish Jain",
                "href": "/profile/Adish-Jain-22"
            },
            "answer_text": "Due to corruption they do in their  life,because there salary are not that much to categorize them as rich.(this doesn't include their allowances they get from the government.) ",
            "date": "Answered December 9, 2014",
            "views": "302",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Robert Real",
                "href": "/profile/Robert-Real-2"
            },
            "answer_text": "They probably make more than what people think, but I have article here that will lay it out for you to make more sense. How Much Do Federal Politicians and Cabinet Members Get Paid? Thanks for the a2a. ",
            "date": "Answered July 29, 2019",
            "views": "76",
            "upvotes": " Answer requested by Pedro Tejado"
        },
        {
            "author_info": {
                "name": "Scott Simmons",
                "href": "/profile/Scott-Simmons-50"
            },
            "answer_text": "Illegally ",
            "date": "Answered February 27, 2018",
            "views": "16",
            "upvotes": "0"
        }
    ]
}