{
    "title": "How much money do movie producers make from a movie? - Quora",
    "tags": [
        "Movie Producers",
        "Movie Production",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bryn Lipinski",
                "href": "/profile/Bryn-Lipinski"
            },
            "answer_text": "Firstly let me say that producing a film is just another term for investing in one, and for any film that makes a profit the producer will make a profit as well. However, beyond that it depends on many factors. Firstly—and I wish this wasn’t true but it is—the producer will get a better contract, more business and more money if they are well-known. Secondly, how much money do they have? If they give more money to the project they’ll get more back. Just like stocks. Thirdly, if the film is very successful the producers will make more money. To that same token, if a film is made with only a little money but gets a ton back—refer to Primer and Following because they both pulled that off—the producers would make a handsome profit margin. And lastly, though this isn't close to the real last, the producers will make more money if they have a better contract. The more movies a producer signs off on, the better his/her contract will be. A contract says how much money the producer pledges to the project, and what they will get back. This can be in a dollar value, and can also be a percentage of the total profit, net profit, gross, etc. With less-aged producers they may in fact lose money if the film is not successful, but that becomes less common with experience. As I said this isn’t close to the full list, but it’s the basics. Really want to know which producers make the most money? The ones that sign off on projects they know about and care about, and projects that they think have a potential. If you don’t want to say it I will: it’s gambling. ",
            "date": "Answered December 12, 2016",
            "views": "146",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Katie Chandelier",
                    "user_href": "/profile/Katie-Chandelier"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                },
                {
                    "user_id": "Abhishek Dev",
                    "user_href": "/profile/Abhishek-Dev-41"
                },
                {
                    "user_id": "Hank Charneskey",
                    "user_href": "/profile/Hank-Charneskey"
                },
                {
                    "user_id": "Andrew Bennett",
                    "user_href": "/profile/Andrew-Bennett-190"
                },
                {
                    "user_id": "Ramya",
                    "user_href": "/profile/Ramya-22"
                },
                {
                    "user_id": "J.M. Bergman",
                    "user_href": "/profile/J-M-Bergman"
                },
                {
                    "user_id": "Lakshya Goyal",
                    "user_href": "/profile/Lakshya-Goyal-1"
                },
                {
                    "user_id": "Sefa Eryilmaz",
                    "user_href": "/profile/Sefa-Eryilmaz"
                },
                {
                    "user_id": "Joshua Atchue",
                    "user_href": "/profile/Joshua-Atchue-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Miyamoto",
                "href": "/profile/Ken-Miyamoto"
            },
            "answer_text": "It varies.   Big time producers like J.J. Abrams and Jerry Bruckheimer can get a huge amount of money upfront, millions, plus a big part of the back end gross profits.  Some producers like that opt out of the front end pay days and demand a bigger percentage of the back end, thus taking more ownership of the film.   That's the top one-percenters though.   Most producers work for much less upfront, in the six figure range, or perhaps the low seven figures, and then rely on the back end profits.   One thing to keep in mind is that producers generally don't get paid to develop a slate of projects.  Development is often unpaid.  They may have a \"term deal\" with a studio, which means that the studio gives them office space and covers certain expenses.  However, producers will most often be working for free until they have a project greenlit by a studio or investors.   Lastly, the \"producer\" credit is often used as currency itself.  There are times when a person has been attached to a project, but then replaced early on in the development process, but are given a producing credit for their time and contributions.   So it varies for sure. ",
            "date": "Answered June 6, 2013",
            "views": "299",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akash Amat",
                    "user_href": "/profile/Akash-Amat"
                },
                {
                    "user_id": "Katie Chandelier",
                    "user_href": "/profile/Katie-Chandelier"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                },
                {
                    "user_id": "Satvik Guruvelli",
                    "user_href": "/profile/Satvik-Guruvelli-1"
                },
                {
                    "user_id": "CaroleAnn Franklin",
                    "user_href": "/profile/CaroleAnn-Franklin"
                },
                {
                    "user_id": "Bharath Gajula",
                    "user_href": "/profile/Bharath-Gajula-5"
                },
                {
                    "user_id": "Oisin McCormack",
                    "user_href": "/profile/Oisin-McCormack-4"
                },
                {
                    "user_id": "Radha Bhise",
                    "user_href": "/profile/Radha-Bhise"
                },
                {
                    "user_id": "Rakesh Kumar",
                    "user_href": "/profile/Rakesh-Kumar-7004"
                },
                {
                    "user_id": "Elenora Timotius",
                    "user_href": "/profile/Elenora-Timotius"
                }
            ]
        }
    ]
}