{
    "title": "How to sing with my own real and unique voice - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "As a lifelong learner in singing, this is what my vocal teacher told me - speak the lyrics first before you sing. Imagine the similar feeling when you sing, but in pitch & time and without adding any unnecessary strain that can happen if you reach for notes or engage your jaw, throat or neck muscles excessively. That is basically your real voice, without any inhibitions or unnecessary attempts to beautify or impersonate someone else in any way. The point of learning vocal technique is not just to sing healthily but to also help you discover and get the best out of your real and unique voice, not otherwise. If you try to artificially beautify your tone or put too much effort to sound impressive like your favorite singer(s) (on the contrary, the harder you try to impress, the less impactful your singing will be), you will never find your own identity and style as a vocalist. The most memorable singers are those who are in tune with their own authentic selves when they sing, regardless of the imperfections in their voices. If Axl Rose and Louis Armstrong decided to copy a particular singer they liked instead of embracing their voices in all their strengths and limitations, we would not have some of the greatest and most original singing ever recorded regardless of genre or style of music. As life goes on, you will be able to feel the songs you are singing even more with greater experience, and this is where, IMO, you have graduated from a mere singer to a real story-teller. All the best! ",
            "date": "Answered August 1, 2017",
            "views": "32",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ana María",
                    "user_href": "/profile/Ana-María-15"
                },
                {
                    "user_id": "Lynn Spencer",
                    "user_href": "/profile/Lynn-Spencer-34"
                },
                {
                    "user_id": "Stanford Felix",
                    "user_href": "/profile/Stanford-Felix"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anat-Aimee-Azure"
                },
                {
                    "user_id": "Vicky Styles",
                    "user_href": "/profile/Vicky-Styles-9"
                },
                {
                    "user_id": "Timi Dare",
                    "user_href": "/profile/Timi-Dare"
                },
                {
                    "user_id": "Aakash Senthil",
                    "user_href": "/profile/Aakash-Senthil-2"
                },
                {
                    "user_id": "Samrat Karki",
                    "user_href": "/profile/Samrat-Karki-18"
                },
                {
                    "user_id": "Andrezza Alencar",
                    "user_href": "/profile/Andrezza-Alencar"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Q.Y. See",
                "href": "/profile/Ryan-Q-Y-See"
            },
            "answer_text": "For this particular question, I like and agree with Chuck’s answer the most. You don’t have to write your own songs, though - what you can do instead with the marvel that is Youtube, is find a song that you understand and empathize with deeply. Whether it’s because the lyrics transport you back to a particular period in your life, or because the words convey something that you’ve been trying to express for a long time - when you sing that song, to people, and you mean it, that’s when your own real and unique voice comes out. Because you mean it, and that’s the voice of a memory. …or your voice of pain…or joy…or fear…or anxiety…or, even, numbness. From there you can branch out, and bring more of yourself into the songs you sing, whether they’re your own songs, or someone else’s. As an example, my go-to axe song and the one I know has my real and unique voice in it is Hallelujah, by Leonard Cohen / Jeff Buckley (Leonard Cohen’s original words in Various Positions, Jeff Buckley’s tune throughout). Strictly because I know what it’s like to fail…and fail again…and think you’ve succeeded…and fail again. And that knowledge, emotion, and pain, carries through, and people - the audience - hears it. And so, every time I sing that song at a performance, the room’s mood is electric. You can do the same, but with a song more fitting to your life, and your choice - and if you want to know what it sounds like, record it or have an audience member record it. I hope you find your song. ",
            "date": "Answered July 31, 2017",
            "views": "986",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anat-Aimee-Azure"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        }
    ]
}