{
    "title": "How to legally upload a karaoke version of a popular song on YouTube - Quora",
    "tags": [
        "Karaoke",
        "YouTube Music (website)",
        "Copyright Law",
        "How-to Question",
        "YouTube",
        "Songs",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oleg Sergeykin",
                "href": "/profile/Oleg-Sergeykin"
            },
            "answer_text": "If you’re not totally sure whether you can use such a song for your Youtube video, get in touch with the artist and let them know what you’re thinking of doing. They’ll tell you if it’s alright or if you’ll need written permission. Most of the music you’ll find on the sites listed here are offered under a Creative Commons license, which means you can download and share them freely. But there are many types of Creative Commons licenses, each with specific requirements. There are many types of Creative Commons licenses, each with specific requirements: Best 7 Places To Find Free Music For Video Editing - Types of Creative Commons Licenses CC0: Completely free. You can download, use, remix, share, and do anything else you want with this track, and you don’t have to credit the artist.CC-BY: Attribution. You can use this however you’d like, but you need to provide an attribution link to the original artist.CC-BY-SA: ShareAlike. With this license, you need to make anything that uses the piece of music available under the same license.CC-BY-NC: NonCommercial. The track can’t be used in anything that’s intended for monetary gain, including monetized YouTube videos, without written permission from the artist.CC-BY-ND: NonDerivative. You can’t put this track in a video without written permission from the artist.Your best bet for safely using music in your videos is to only use CC0 or CC-BY licenses. With CC-BY, you’ll need to credit the artist. If you’re using a license other than that, it’s a good idea to carefully check the requirements. Creative Commons music collections will help you find royalty-free music for videos, but you still need to make sure that you’re following the correct attribution procedures and not using non-commercial tracks for commercial purposes. ",
            "date": "Answered December 5, 2018",
            "views": "8",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Best",
                    "user_href": "/profile/James-Best-81"
                },
                {
                    "user_id": "Nancy Liu",
                    "user_href": "/profile/Nancy-Liu-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Basko",
                "href": "/profile/Sue-Basko"
            },
            "answer_text": "At this moment, Youtube still has Music Policies. (Google “Youtube Music Policies” to find it.) Go to the Music Policies and see if the song you want to record allows Cover Songs and if so, in which nations they will be shown. If the Policies on the song allow Cover versions, then simply upload your cover version. If the Music Policies on the particular song does not allow Cover versions, you will need to get mechanical and synch licensing — which is not likely and will be expensive. ",
            "date": "Answered June 13, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neeraj Dixit",
                    "user_href": "/profile/Neeraj-Dixit-115"
                }
            ]
        }
    ]
}