{
    "title": "How can we listen to what others are not saying? - Quora",
    "tags": [
        "Listening",
        "Communication",
        "Social Advice",
        "Understanding Human Behavior",
        "Psychology of Everyday Life",
        "Interpersonal Interaction",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfredo Torrejon",
                "href": "/profile/Alfredo-Torrejon"
            },
            "answer_text": "In a literal sense, this is not possible. However, if one were to simply transcribe a person’s speech, much of the meaning would be lost. Non-verbal communication, such as the expression on the person’s face, posture, gesturing, etc. provide important information about the emotional context of the message. The person’s tone of voice provides additional information about the person’s emotional state. When people started to discover text-based online communication years ago, they quickly noticed that not being able to hear or see the person on the other end greatly hampered communications. Often, it could be difficult to tell whether people in these forums were intending to be taken literally or if they were making jokes. It was hard to tell when people were upset, annoyed, frustrated, etc., unless they specifically mentioned it. An ad-hoc language of faces (“smilies”) drawn using punctuation marks developed to fill this need for an emotional shorthand. Another important technique is understanding the context behind what the person is saying, or “reading between the lines.” Is the remark atypical for the person, based on prior knowledge of the person’s personality? Is the remark unusual, based on circumstances? Taken as a whole, do the person’s remarks and body language seem to be intended to give clues to a deeper message? ",
            "date": "Answered April 22, 2020",
            "views": "15",
            "upvotes": " Answer requested by Rabee Abuhazeem",
            "upvoters": [
                {
                    "user_id": "Alfredo Torrejon",
                    "user_href": "/profile/Alfredo-Torrejon"
                },
                {
                    "user_id": "Jennifer Van Rensburg",
                    "user_href": "/profile/Jennifer-Van-Rensburg-1"
                },
                {
                    "user_id": "Rabee Abuhazeem",
                    "user_href": "/profile/Rabee-Abuhazeem"
                },
                {
                    "user_id": "Imeldah Mwale",
                    "user_href": "/profile/Imeldah-Mwale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucy McKinney",
                "href": "/profile/Lucy-McKinney-2"
            },
            "answer_text": "We already know what they are not saying. We have to fill in the blanks. We could also pose questions that include certain controls to elicit what most people would include in any response, and open-ended inquiries calculated to elicit variable information. Then we pay attention to their answers. Also, if we encounter someone who has a puffy red face and eyes, instead of asking if they've been crying, we can ask if we can get them an allergy pill or decongestant. If they say they don't have a cold or allergies, they're probably crying. No need to ask. ",
            "date": "Answered April 19, 2020",
            "views": "73",
            "upvotes": " Answer requested by Rabee Abuhazeem"
        },
        {
            "author_info": {
                "name": "Luis Martins",
                "href": "/profile/Luis-Martins-21"
            },
            "answer_text": "You can contact the wicked spirits, or the people who are their mediums. Warning: You do not know what you are getting into. You will be invited to live in false reality. A reality that is beyond anything that is possibly normal for a human person to bear. Suggestion: ask people for the things you cannot hear them saying. ",
            "date": "Answered April 20, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Silvestru Andreea-Maria",
                "href": "/profile/Silvestru-Andreea-Maria"
            },
            "answer_text": "Hmmm, very interesting question so I will try to share my point of view shortly. It could be their gaze, their eyes, their body language or simply their posture. I have read something very interesting which basically explained that the body and the mind state can rapidly influence each other. There cannot be an imbalance between them, they have to be “on the same page”. Yes, many people know how to hide their feeling but if you pay attention, at some point their body will show you what is truly going on. ",
            "date": "Answered April 19, 2020",
            "views": "87",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Duraiswamy Vaidyanathan Chandrasekar",
                "href": "/profile/Duraiswamy-Vaidyanathan-Chandrasekar"
            },
            "answer_text": "By watching their body language closely and checking any variation in tone or language to their baseline behaviour. The book, “You can’t lie to me” by Janine Driver may be of help. But, remember, it takes a lot of practice and experience to master the art. Meanwhile, go by your gut feel and the vibes others send. ",
            "date": "Answered April 19, 2020",
            "views": "42",
            "upvotes": " Answer requested by Rabee Abuhazeem"
        },
        {
            "author_info": {
                "name": "Alessio David Ricioppo Parra",
                "href": "/profile/Alessio-David-Ricioppo-Parra-1"
            },
            "answer_text": "Do you want to have amazing communication skills and to be happy for the rest of your life? Then you wanna listen to me. This is what you do. NOW! You check my WTK system. And you’ll use it to improve a lot your dating, relationships and communication skills. For example you can find in it a detailed analysis of non verbal communication. You can find more information about my WTK system in my official website. Check it RIGHT NOW. You'll thank me later. ",
            "date": "Answered April 20, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Penturn",
                "href": "/profile/John-Penturn"
            },
            "answer_text": "The short answer is empathy. Powered by your intuition. The rest is detail. Important detail granted but only to the degree you use both. The thing of it is that includes (& absolutely must) on your self. W/o insufficient introspection & self awareness you won’t be able to do either and/or both well. ",
            "date": "Answered April 20, 2020",
            "views": "21",
            "upvotes": " Answer requested by Rabee Abuhazeem"
        },
        {
            "author_info": {
                "name": "Prafull Ambekar",
                "href": "/profile/Prafull-Ambekar"
            },
            "answer_text": "You can’t listen if the others are not saying anything. Someone has to speak or make a sound for others to listen. But yeah, you sure can observe and learn what the other is trying to convey through his body language, his actions, and his posture. ",
            "date": "Answered April 20, 2020",
            "views": "18",
            "upvotes": " Answer requested by Rabee Abuhazeem"
        }
    ]
}