{
    "title": "I am a huge Jimi Hendrix fan. I know he plays Fender but I like the way PRS looks. Which one sounds most like him: PRS or Fender? - Quora",
    "tags": [
        "PRS Guitars",
        "Jimi Hendrix (musician)",
        "Fender Guitars",
        "Music Suggestions",
        "Electric Guitars",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elton Edgar",
                "href": "/profile/Elton-Edgar-1"
            },
            "answer_text": "Why not do both? Hendrix was a notorious off the rack kind of guitar buyer. So, when it came to Strats, he basically bought a standard; flipped the nut and strung it upside down. This made the staggered poling of the pickups the reverse of what they should be (meaning the high E was over the pole the low E usually uses) (the stock Fender staggered pole set up looks like this)  Also, when Jimi played, the pickups were reverse what they should be therefore changing the sound from what a normal Strat to something more Jimi-fied. That and he usually used the middle/bridge pickup selection (which he or his guitar guy would facilitate by jamming cardboard or some other damned thing to jam the 3-way switch into a hybrid position). So, if you want your PRS and your Strat too, you have one of two options: Buy this PRS… PRS 305 Electric Guitar Review And flip the pickups the other way round…or… 2. Split the coils on a regular PRS and get pretty close to the Jimi sound…, but not quite. Of course, there are always other options beyond that, I simply chose two for the purpose of writing convenience. You could take a regular PRS and toss humbucker shaped single coils in it…or who knows what. I hope this helps. ",
            "date": "Answered May 17, 2016",
            "views": "650",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Urs0polar"
                },
                {
                    "user_id": "A. K. Lee",
                    "user_href": "/profile/A-K-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry-David Sayers",
                "href": "/profile/Harry-David-Sayers"
            },
            "answer_text": "Jimi Hendrix played a Gibson flying V and a Gibson SG amongst others. Jimi would have played a PRS because they are very good in all aspects of how a good instrument should be.... Fenders unique sound can be replicated on any electric guitar, check out Guitar Rig 5 Native Instruments. The older the Fender the more unique is the sound because of the pick-up technology and amplification of the time. The wiring of the electrics which could morph the sound has been replicated by many guitar manufactures over the years, the single coil 5 way toggle switched Strat's being an all time favourite.... Today's guitar manufactures have blow all illusions of grandeur out of the ball park ...... the electric guitar is no more a secret than menstruation.... ",
            "date": "Answered March 17, 2016",
            "views": "765",
            "upvotes": "0"
        }
    ]
}