{
    "title": "I am the lead singer in a band but I can't write songs, and I feel bad for singing lyrics that aren't mine, how can I write good lyrics? - Quora",
    "tags": [
        "Song Lyrics",
        "Musicians",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samantha Kornegay",
                "href": "/profile/Samantha-Kornegay"
            },
            "answer_text": "I write many songs, so if you're like singing about happy things, write about things that make you happy. Maybe like dogs, skateboarding, ect.ect. If you have never had anything happy happen to you think about writing about your crush(without his or her’s name[if your band mates get a hold of the paper its pretty much game over, unless you can use their name without making it so obvious, like Olivia by One Direction]) sunsets, your gf/bf. You can look up happy things. If you sing about sad stuff pretty much the same thing. You don’t always have to rhyme every time you sing; take Closer for an example they did not rhyme and that song was a HUGE success. If you have a really good song line, don't be afraid to have a journal to write it in and at the end of the week take it and make a song with those lyrics. You most likely will come up with more and more lyrics as you go on. And if you cant write, ask friend your bandmates for help for ideas and stuff. I was in the same exact situation about a month ago…It is okay to sing other peoples song-5SOS did and look where they are now. If you are not good at writing lyrics now, you will be eventually. A lot of singers/songwriters/bands that are famous were in this situation a year or two ago. Hey can you tell me the name of your band? (: ",
            "date": "Answered February 26, 2017",
            "views": "928",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Cottier",
                "href": "/profile/Gary-Cottier"
            },
            "answer_text": "I write lyrics. I've always been fascinated by lyrics and always took a lot of notice of them when I was young. Then I started writing songs. I love writing lyrics, and that's maybe the difference, I write everyday. I wasn't great at first but I persevered and got better and better. I guess what I'm saying is you've really got to want it, it's possible that if you had the burning desire to write lyrics/songs you would be doing it already, especially if you're already in a band. Still, give it a go, start writing and keep at it. Think about how you feel, about the opinions you have, maybe even do some reading and study other people's lyrics. If you want it enough, you'll get there. ",
            "date": "Answered February 27, 2017",
            "views": "214",
            "upvotes": "0"
        }
    ]
}