{
    "title": "I am a big fan of country music. What makes classic country music different from today's country music? - Quora",
    "tags": [
        "Classic Country Music",
        "Country Music",
        "Music Suggestions",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Genwei Zagorac",
                "href": "/profile/Genwei-Zagorac"
            },
            "answer_text": "Country is music is filled with cliches now. Like, people make fun of how it's all about white guys singing about girls, beer, and tractors so when they hear that they just dismiss it. Personally, I'm not a huge fan of country music but I am slowly starting to become somewhat fond of it. Tim McGraw and Darius Rucker are my favorites.  Classic country is regarded as much better because it was also more original. Most country songs today are not that original. It's just a re-hash of stuff that's already been done, but with slightly different lyrics. Or at least, that's what it seems like, speaking as someone who doesn't know much about it. I'm sure the more hardcore country fans would disagree with me as they have heard more and have a greater appreciation of modern country artists. This is just what my friends and I have observed, and we all know almost nothing about country music. So, sorry for our ignorance. ",
            "date": "Answered June 3, 2015",
            "views": "584",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonny Armstrong",
                    "user_href": "/profile/Sonny-Armstrong-5"
                },
                {
                    "user_id": "Hunter Duncan",
                    "user_href": "/profile/Hunter-Duncan-8"
                },
                {
                    "user_id": "Miles Cullom",
                    "user_href": "/profile/Miles-Cullom"
                },
                {
                    "user_id": "Harish Subramanian",
                    "user_href": "/profile/Harish-Subramanian-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Davis",
                "href": "/profile/Jim-Davis-56"
            },
            "answer_text": "From First to Sixth Generation country the music became less about substance and more about spectacle.  There were popular artists in the early days, but they were popular because they were doing something they loved while expressing something that thousands of others happened to be able to get behind and support.  These days it's that support the artists are looking for prior to the expression.    The reason Nashville is famous for its country music artistry is that near the turn of the century many formerly agrarian families made their way into the city to work in the mills and factories.  They brought their Appalachian music with them.  They brought it with them for comfort, for expression, as a means to hold onto the mountain lifestyle that had raised them and to pull themselves together as a cultural unit and provide some sort of individual identification in the midst of the macrocosmic growing industrial world.   Nowadays artists flock to Nashville to \"make it\" or \"get noticed\".  The motivation isn't the same, so the outcome isn't the same.  While it's always held that noticed artists become famous, the desire to be noticed rather than to be an artist is more common today than it was 100 years ago. ",
            "date": "Answered June 1, 2015",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonny Armstrong",
                    "user_href": "/profile/Sonny-Armstrong-5"
                },
                {
                    "user_id": "Shaun Flaherty",
                    "user_href": "/profile/Shaun-Flaherty-12"
                },
                {
                    "user_id": "Janet Dixon",
                    "user_href": "/profile/Janet-Dixon-1"
                },
                {
                    "user_id": "Aarushi Mittal",
                    "user_href": "/profile/Aarushi-Mittal-5"
                },
                {
                    "user_id": "Ernie Bornheimer",
                    "user_href": "/profile/Ernie-Bornheimer"
                }
            ]
        }
    ]
}