{
    "title": "I am an Indian girl and I want to audition in YG and JYP. I am 16. I can do rap and dance, but I have not taken any professional training. What are some tips? - Quora",
    "tags": [
        "YG Entertainment",
        "JYP Entertainment",
        "Auditions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Revaa Semwal",
                "href": "/profile/Revaa-Semwal"
            },
            "answer_text": "First thing I'm not trying to discourage you but you know what you are a bit old now. And if u want to get into YG or JYP then I don't think u will get it. It would have been better if u would have been just an year small. As for an example ROSÉ of blackpink, she auditioned at the age of 15. And as u said that u can sing and rap but have not taken any formal training then their is no chance at all. And if u want to get selected then u have to be flawless and flawless means that you have to be better than their trainees…which is actually not possible. Because getting better than their trainees is just a far fetched idea. U need training for atleast 4 years. Jyp could have been the company but afcourse u r a Full year late. But if u know more than signing, rapping and dancing like playing guitar or a keyboard then your chances can improve or if u r fluent in English and Korean then u might get into one of these. Because u still have 3 years. As u know keeping the hope of debuting after 19 in JYP or YG is just nonesence until u r full and final ready. And even if u manage to debut still u won't be able to gain as much popularity than ur other members that can be disheartening. For example JISOO of blackpink she trained at YG for 6 years and then at she debuted with a boom song at the age of 20 that too as the oldest member of blackpink. But still people love her very much. And as u can see she debuted after 6 years of hard training. So now it's up to u. U still have time go and find a new passion for urself. Well that's all goodbye see u. ",
            "date": "Answered September 28, 2020",
            "views": "26",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayush Agrahari",
                    "user_href": "/profile/Ayush-Agrahari-56"
                },
                {
                    "user_id": "Yuvika Sharma",
                    "user_href": "/profile/Yuvika-Sharma-53"
                },
                {
                    "user_id": "Sushree",
                    "user_href": "/profile/Sushree-15"
                },
                {
                    "user_id": "Navya",
                    "user_href": "/profile/Navya-340"
                },
                {
                    "user_id": "Shivani K M",
                    "user_href": "/profile/Shivani-K-M"
                },
                {
                    "user_id": "Sreelakshmi Enduri",
                    "user_href": "/profile/Sreelakshmi-Enduri"
                },
                {
                    "user_id": "Renz Jarredh Santiago",
                    "user_href": "/profile/Renz-Jarredh-Santiago"
                }
            ]
        },
        {
            "author_info": {
                "name": "Renz Jarredh Santiago",
                "href": "/profile/Renz-Jarredh-Santiago"
            },
            "answer_text": "Just like what someone said, but im not discouraging you. But I hardly think you would be accepted. In kpop, you would hardly see any indian idols. They mostly accept people in south east asia (philippines, malaysia, thailand, etc) or china so if your from india, that’s highly impossible. But if you want to try then go ahead. But you said it yourself, you’re 16 and i think you’re a little late. You also stated that you have no professional training and thats going to be a problem. If you become a trainee, then you’re going to be professionally trained which will take years (mostly more than 5 years of being a trainee or maybe even more) so you would be debuting (in case you get accepted in the audition but is highly impossible) at a late age. You also have to make sure you have the right visuals since the korean beauty standards when becoming an idol is REALLY STRICT. You must have a fair skin colour, and you must have a face of an idol in YG or JYP (depending on the company you’re auditioning in). You must also have a good english skills so you’re accent must be FLUENT. You must also learn at least some common korean phrases such as ‘hello’, ‘good morning/afternoon’, ‘how are you’, ‘my name is_____ and other self introductory phrases’ and other basic korean phrases. If you have decided to audition, good luck! ",
            "date": "Answered September 29, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yuvika Sharma",
                    "user_href": "/profile/Yuvika-Sharma-53"
                },
                {
                    "user_id": "Sushree",
                    "user_href": "/profile/Sushree-15"
                }
            ]
        }
    ]
}