{
    "title": "I am 18 now and know nothing about production thing and I am planning to be a music producer, can I pursue my career in music producer? - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry",
        "Music",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Vit",
                "href": "/profile/Tony-Vit-1"
            },
            "answer_text": "The short answer yes, but the long one is a hard one. Yes become a producer if that's what you want. Did you found out what you want in life? Do you know aprox hoe music industry works. Where the profit cones from? , however you need to ask yourself this: do you have music education? Do you like repeating things?How well do you handle criticism towards you? There are 3 types of music producers: 92% wannabe producers, or average)(i have started as wannabe producer however i had self learned for 12 years plus i had music school diploma)2. 6% A passionate and music education having producer. 3. 2% successful and awarded producers. The producers that have successfully demonstrated and consistently been awarded for their work foe at least 10 years of their presence. If you are no 1 you are doomed. Competition is extremely high. If you are no 2 go for it. You will have to work 10 times harder than your normal job. No 3 will come with time. If you wanna become producer you hsve to be serious about it. And have a lot of knowledge in music theory and education. Then you Learn audio software and hardware. Only then!!!! Then you start making hits that you believe willing be successful. And then you push Companies to pay you money. We are working on debut single Vitko Mind ft Phoebe D - be free. Please support and listen 5o it when released so we can give you more music. Vitko Mind Vitko Music ",
            "date": "Answered May 5, 2020",
            "views": "329",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vasudev",
                "href": "/profile/Vasudev-29"
            },
            "answer_text": "I'd suggest you to meet the music producers around you and get an insight how the field actually is, then only you'll be able to decide whether you really want to pursue it as a career or not. If you're worried about the age factor, then let me tell you one thing. IT'S NEVER TOO LATE TO START ANYTHING! I started producing music when I was 18 and now I teach the same subject (and I'm 20!). I have students who are younger than me, at the same time a few are working professionals who are above 30 years of age. In this field, nobody asks what your age is but you're known for your knowledge and most importantly, your creativity. Hope my answer helped you. All the best! ",
            "date": "Answered May 24, 2019",
            "views": "210",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manmohit Singh",
                    "user_href": "/profile/Manmohit-Singh-34"
                }
            ]
        }
    ]
}