{
    "title": "I am in 12std but I am scared as many changes are happening such as the NEP, the pandemic and portion reduction, online classes, all this is kinda putting psychological pressure on my mind, what should I do? - Quora",
    "tags": [
        "Coping with and Overcoming Fear",
        "The Mind",
        "Fear",
        "Academic and Educational Advice",
        "Psychology",
        "Mental Health",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhramar Bhattacharya",
                "href": "/profile/Bhramar-Bhattacharya"
            },
            "answer_text": "It is a tough time and it is natural as well. But do not feel anxious as you are not alone. There are many students who are facing this. Now first advice is take one day at a time. Pandemic has already passed few months so we have already known what to do…so follow the guidelines and you will be safe. Things are changing and it will be better over the time…have faith. Secondly the change in education policy is not going to implemented drastically and whn it will start all the students and teachers will be given guidelines. That will not happen right now and surely again you are not alone. Other than that online classes etc are already in use so I believe you have gt used to tht. Yes smtms we get overwhelmed with so many changes but if you tk one day at a time then it will be easy to adjust. Change is always stressful but if we accept that it is a part of the process, it bcms easy fr us to adjust. Try to exercise regularly, eat and sleep well, take break frm online activities, pursue hobbies as you like talk to yourfriends and relatives and stay active. This will make you feel good. If you still feel distressed then call national mental health helpline . ",
            "date": "Answered August 3, 2020",
            "views": "135",
            "upvotes": " Answer requested by Deshbhakt",
            "upvoters": [
                {
                    "user_id": "Pramod Wadekar",
                    "user_href": "/profile/Pramod-Wadekar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Apoorva Nadig",
                "href": "/profile/Apoorva-Nadig"
            },
            "answer_text": "NEP is for the better. How does portion reduction affect you psychologically?Analyse. It means reduced syllabus to study right? Online classes are useful if you concentrate. Has the pandemic affected you? If not,then all these above issues are not issues and should be dismissed from your mind. If you have health issues, consult a doctor, follow advice and reduce stress. Important point to remember is that it is just once that you will be taking the exam,so give it your best shot. If you are too scared go to your subject teacher and request a special class. ",
            "date": "Answered August 2, 2020",
            "views": "126",
            "upvotes": " View 1 Upvoter"
        }
    ]
}