{
    "title": "I am classified as a tenor but I have no falsetto. Is there a way to obtain a falsetto voice? - Quora",
    "tags": [
        "Vocal Coaches",
        "Tenors",
        "Music Suggestions",
        "Singing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Q.Y. See",
                "href": "/profile/Ryan-Q-Y-See"
            },
            "answer_text": "Yes, there is. All boys have a falsetto, but it’s quite possible for it to be untrained, and/or come out as a squeak, crack, or various other not-so-nice and possibly-damaging-to-your-vocal cord sounds. Further, some people’s falsettos blend in so closely to their head voice / high range that there is no apparent transition. Some boys’ falsettos are extremely low in range as well. What are you looking for a falsetto for? Timbre, or range? For range: After hydrating yourself thoroughly, sing scales that are concentrated in the upper register of your voice. Start at a comfortable pitch, and move in a systematic manner upward, focusing predominantly on the high side of your range. It will burn a little, but vocal cords are muscles like any other muscle, and so the same rules apply. Work it until you feel the burn (your throat will also dry out), rest and drink a lot of water. Do it again. Maintain good singing posture at all times; tensing the throat is bad and will cause damage in the long term. Get to your highest note and push it two notes further. Stop. Rest. Retry over a period of weeks. Get your highest note to be at volume. Eventually, the top note will become your second-highest top note. And so on. If you’re hitting a note which is the barest hint of air and going any higher hurts your throat just to reach it, that is your upper limit. For timbre: At some point during the above-mentioned exercise, the notes you sing will feel as though they are coming from a different place. While your higher register comes from the centre of your throat (with bad breathing) and perhaps stomach to higher chest (diaphragm breathing) this sound will come out almost from your nose. This is falsetto. Continue until it is comfortable. ",
            "date": "Answered October 31, 2016",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leonard Nyatigi",
                    "user_href": "/profile/Leonard-Nyatigi"
                },
                {
                    "user_id": "Tim Derrico",
                    "user_href": "/profile/Tim-Derrico"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monika Welch",
                "href": "/profile/Monika-Welch"
            },
            "answer_text": "With enough practice, most singers can attain falsetto. The falsetto voice, with its characteristic breathy, airy, flute-like sound, is produced by the vibration of the ligamentous edges of the vocal cords, which in falsetto are barely touching. A couple of good exercises to help you find and practise your falsetto voice are the following: - A siren on an ‘ooh’ or ‘eee’ from the top of your register – start as delicate / soft and as high as you can and siren your way down - Speaking in a childlike or female voice – soft, delicate, airy, breathy tone In practising falsetto, ensure you are placing the voice ‘forward’ not at the back of the throat, and most importantly, please STOP if you feel any pain or burning sensation!! Vocal exercises should NEVER hurt! If they do, you are either doing them incorrectly or simply trying to achieve too much too soon and thus are on the fast way to damaging your voice. \u0003Best wishes! ",
            "date": "Answered November 2, 2016",
            "views": "29",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "J Jones",
                    "user_href": "/profile/J-Jones-66"
                },
                {
                    "user_id": "Jacky Tasmin",
                    "user_href": "/profile/Jacky-Tasmin"
                },
                {
                    "user_id": "Siddharth Billawa",
                    "user_href": "/profile/Siddharth-Billawa-1"
                }
            ]
        }
    ]
}