{
    "title": "I can't seem to consciously sing with true vibrato. Yet, sometimes, when I am singing softly and in a relaxed state, a very slight vibrato will come out. Can singing with vibrato be learned? - Quora",
    "tags": [
        "Singing in Vibrato",
        "Vibrato",
        "Singing Lessons",
        "Singing Tips",
        "Vocal Performance",
        "Singing Voice",
        "Voice",
        "Singing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Abernathy",
                "href": "/profile/Michael-Abernathy-18"
            },
            "answer_text": "Work on developing vocal quality. Get the basics down. Learn to sing with proper breath support, a relaxed, open throat, and work on resonance. I’ve heard people attempt vibrato before gaining this control. You need both control and a relaxed throat before you work on vibrato. If you are tense, you can’t do it. You also need steady, even breaths to support the sound. Vibrato should be a quick variation in pitch that comes naturally. Listen for the variation when you are singing. As your voice matures, it will develop vibrato. However, not everyone has a strong vibrato. It may never be very strong but you can develop it. Practice often and work on the basics and your voice can become amazing. ",
            "date": "Answered April 6, 2020",
            "views": "136",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jrs Reyes",
                    "user_href": "/profile/Jrs-Reyes"
                },
                {
                    "user_id": "Clair Bower",
                    "user_href": "/profile/Clair-Bower"
                },
                {
                    "user_id": "Mary Jacobs",
                    "user_href": "/profile/Mary-Jacobs-6"
                },
                {
                    "user_id": "Robert Stevens",
                    "user_href": "/profile/Robert-Stevens-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clair Bower",
                "href": "/profile/Clair-Bower"
            },
            "answer_text": "In short… yes. If you get some vibrato when you’re relaxed, you’re on the right track! Sing like this often and you’ll train your muscles to do it. It’s very much like exercise. Eventually, it will come naturally to you. Beware that this is a slow process and may take years. I’m not sure of your age, so if you are younger than 22 (ish) then you are still in the development period and your voice is changing constantly. Try not to push vibrato, since there are far more important vocal techniques you can learn, such as jumps, trills, runs, etc. Best of luck on your musical journey! ",
            "date": "Answered April 10, 2020",
            "views": "319",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Powell",
                    "user_href": "/profile/Mark-Powell-179"
                }
            ]
        }
    ]
}