{
    "title": "I can sleep at night while listening music through earphones. What does this reflect? - Quora",
    "tags": [
        "Listening to Music",
        "Sleep Habits",
        "Sleep",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elle Hayes",
                "href": "/profile/Elle-Hayes-2"
            },
            "answer_text": "It probably shows you relax to music. If your sleeping area is unusually noisy, for example, if you share housing with people who are loud at night, live on a street with a great deal of traffic, or in a busy urban area where trucks and sirens are audible, your headphones will block the external noise and lets your brain focus on the music. You run the risk of awakening to a louder track or commercial, however. Plus you're stimulating your brain all night. I haven't seen actual data on positive or negative effects of continual brain stimulus all night but it might have a negative effect on the quality of your sleep. There are several excellent sleep aid audio books that are more soothing than pop music that you might check out. The Solifeggio Meditations are very interesting. A form of light hypnosis, voiced by Glenn Harold, along with trance-music like compositions, the several volumes employ different Hz (frequencies) in music to sooth different pathways of the brain. Also employed are sleep suggestions, positive action suggestions and a meditation aid. They are available on Audible. As these are made specifically to assist the listener in dropping quickly into sleep, they don't send stimulus into your brain continually, thru the night. Personally, as someone who also used music as a sleep assist (mostly becayse my husband snored very loudly), I now prefer the Solifeggio Meditations. ",
            "date": "Answered August 20, 2017",
            "views": "232",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manas Tiwari",
                    "user_href": "/profile/Manas-Tiwari-18"
                }
            ]
        }
    ]
}