{
    "title": "I get no plays on SoundCloud is my music really that terrible? - Quora",
    "tags": [
        "SoundCloud (product)",
        "Social and Online Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen C. Hill",
                "href": "/profile/Karen-C-Hill"
            },
            "answer_text": "Dear, Ignore your music, the cause of your problem is that you need to boost your music on SoundCloud if you want to get more plays. SoundCloud is the largest and most important online music community. They’ve disrupted the way we understand online music distribution. They give independent artists the space they need for DIY music promotion. But there is a very useful music plays tool aiostream. Using it effectively will amplify your project and get SoundCloud plays from the SoundCloud followers that matter. Here is how to use the SounCloud App to increase plays organically:  SoundCloud play songs/albums/playlists: Play the songs/albums/playlists like a real human, let it bulk-play, set the playback time, play times, delay time, paly mode like 'play-pause-play ...' , cycle playback and schedule play etc.... SoundCloud Follow People: Auto-follow users; follow a user's followers/following; Follow back your followers; Follow users who liked or commented; Follow by follower to following ratio... SoundCloud Like/Unlike Tracks: Auto-like/unlike searched/imported tracks. Schedule Plays: Set a schedule time to auto play your song at the right time to get more plays ……………………………………………… In short, you need to promote your music more on soundcloud, so that your music exposure will have more opportunities, and the amount of playback you will get will naturally be higher. Good Luck!!! ",
            "date": "Answered August 19, 2020",
            "views": "757",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mahardika Adihertianto",
                "href": "/profile/Mahardika-Adihertianto"
            },
            "answer_text": "I don’t think that’s the problem. Your music just doesn’t get enough exposition, from yourself or from soundcloud. I uploaded my songs and it… well, it is heard by some people that I don’t even know (my IRL friends doesn’t count, because I already told them.) Not that many people heard it, but that’s because I wanted it that way. I posted my music album cover on instagram, and I think that’s what makes some people hear my songs. So in conclusion, I think you need to ‘promote’ your songs to your social media accounts, your friends, etc. If they like your songs, the information about it could spread faster than light, whether by WoM (words of mouth), social media, etc. Well… at least that works for me. ",
            "date": "Answered May 18, 2018",
            "views": "29",
            "upvotes": "0"
        }
    ]
}