{
    "title": "I have talent in both singing and rapping and I'm 25 years old which makes me feel too old to hit in the music industry, needless to say my friends still says my age is the problem, what should I do? - Quora",
    "tags": [
        "Talent",
        "Rap Music",
        "Singing",
        "20s (age)",
        "Music Industry",
        "Age",
        "Musicians",
        "Music",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Landstreet",
                "href": "/profile/Mark-Landstreet"
            },
            "answer_text": "I can't see why 25 years old is too old for a music career. Charlie Daniels of “The Devil Went Down to Georgia” game didn't get popular until he was twice your age. If you lead a healthy lifestyle, ie. don't even consider tobacco, eat smart, exercise, get some sleep, drink water, avoid alcohol and other drugs…you just made yourself more youthful. There are no absolutes, but there sure are tendancies! Practice, practice, practice! If you truly have a passion to rap and sing you have to do this, and with rare exception you should enjoy it anyway! Rockstar didn't just get a guitar, grow their hair long, and get on stage! I read Keith Richards autobiography, of Rolling Stones Fame. He played guitar all the time. If he got constipated he took his guitar with him to the toilet! He said he's been to parties where gorgeous women were all over him, there was every drug available (maybe piles of cocaine or whatever) you get the idea. Although these opportunities became available as he got famous, he said if he saw a guitar leaning on the wall in the corner, that got him the most excited. Passion! Good luck! ",
            "date": "Answered August 26, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Livia Young",
                    "user_href": "/profile/Livia-Young-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saleem Ullah",
                "href": "/profile/Saleem-Ullah-66"
            },
            "answer_text": "Hunny your never too old to chase your dreams I have seen old people probably 50+ who sing and loves doing it ur never old enough to do things u wanted to do ,go ahead sing ,rap , and mostly enjoy while doing it cause life is short enjoy while u can ,life is like an ice-cream it melts quickly so eat it before it melts and don't listen to ur friends listen to your heart ,follow what makes u think it's right and just go on don't hesitate be confident were here to cheer u up I'm here to cheer u up and never bring urself down bec of ur age ur a grown up and can make ur own life chosies u don't need anybody to do it for you so enjoy while u can and I say to GO UP THERE ANS SING AND RAP WHILE U CAN AND MOSTLY ENJOY …….. GOOD LUCK ♥️ ",
            "date": "Answered August 23, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Livia Young",
                    "user_href": "/profile/Livia-Young-9"
                }
            ]
        }
    ]
}