{
    "title": "I hate love songs. Do you hate love songs? - Quora",
    "tags": [
        "Love Songs",
        "Hate",
        "Songs",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Grunge",
                "href": "/profile/Amy-Grunge"
            },
            "answer_text": "I hate love songs too. I love Ed Sheeran, I love his vocals, his attitude, himself. But I just can’t get myself to put his songs on my phone because all of them are about stupid, bloody love. No, I’m not bitter. No, I’m not divorced and neither are my parents. And no, I’ve never been in a relationship before but I have liked people. I’m 18, and find it stupid when I turn on the radio to hear “NO. We are never, ever, ever, getting back together” or “she looks so perfect standing there…” *insert more romantic song lyrics* I might like the tune of the song, and the vocals, but I just hate the lyrics. I also hate songs about break ups, first loves, sexy someone, anything love. On the other hand, I like songs that explore deep meanings or try to encourage people. Songs like “Brave” by Sara Bareilles, and “Scars to your beautiful” by Alessia Cara. Even K-pop, songs by BTS like “Cypher pt 4”, “young forever” and “Pied Piper”. I don’t speak Korean, but I like the sound of their songs, and I like the meanings behind their lyrics when I google it, and I’m sold! ",
            "date": "Answered April 24, 2018",
            "views": "41",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhill K",
                    "user_href": "/profile/Akhill-K"
                },
                {
                    "user_id": "Xu Li Kim",
                    "user_href": "/profile/Xu-Li-Kim"
                },
                {
                    "user_id": "Jessica Rodriguez",
                    "user_href": "/profile/Jessica-Rodriguez-1296"
                },
                {
                    "user_id": "Zainab Jamshaid",
                    "user_href": "/profile/Zainab-Jamshaid-6"
                },
                {
                    "user_id": "Jared McCartney",
                    "user_href": "/profile/Jared-McCartney-6"
                },
                {
                    "user_id": "Anagha",
                    "user_href": "/profile/Anagha-62"
                },
                {
                    "user_id": "Rahul Prajapat",
                    "user_href": "/profile/Rahul-Prajapat-122"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/VenVann"
                },
                {
                    "user_id": "Sarah Rose",
                    "user_href": "/profile/Sarah-Rose-827"
                },
                {
                    "user_id": "Aditya Arora",
                    "user_href": "/profile/Aditya-Arora-238"
                }
            ]
        },
        {
            "author_info": {
                "name": "Idellah Ashlie",
                "href": "/profile/Idellah-Ashlie"
            },
            "answer_text": "That’s got to be tough! The majority of the songs recorded in any genre ARE about love from some kind of angle - falling in love, lost love, betrayed love, self-love, falling out of love, being in love, physical love, friendship love, toxic love, new love, long-term love, family love, love of nature, planet or ecosystem. You’re probably referring to the corny love ballad type of songs in which case, there are definitely some I could’ve done without! One that was popular in the 1980s was by the group REO Speedwagon called “I Just Wanna Keep On Loving You”. I can’t tell you how much I STILL cringe when I hear that! “I don’t wanna sleep, I just wanna keep on loving you” Cringing again. Pretty much anything by them has that effect! ",
            "date": "Answered July 11, 2019",
            "views": "912",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zainab Jamshaid",
                    "user_href": "/profile/Zainab-Jamshaid-6"
                },
                {
                    "user_id": "Rahul Prajapat",
                    "user_href": "/profile/Rahul-Prajapat-122"
                },
                {
                    "user_id": "Tanya Paul",
                    "user_href": "/profile/Tanya-Paul-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Olivia-1127"
                }
            ]
        }
    ]
}