{
    "title": "I have an idea. how I can find any investor? - Quora",
    "tags": [
        "Startup Investors",
        "Startup Ideas",
        "Investors",
        "Entrepreneur Advice",
        "Entrepreneurship",
        "Startup Strategy",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shashwata Samanta",
                "href": "/profile/Shashwata-Samanta-1"
            },
            "answer_text": "Ideas do not have any intrinsic worth. You need to create something that you can sell at an sustainable profit to your target customers alongside a plan to scale the business for your products. Note that investors are there to make money and not lend it. They are willing to spend a shit ton of money because they are aware about the rule of diminishing returns on traditional investment options. They are looking for a leverage. Can you convince that your product can return triple digits returns on their seed capital? Can your product provide that amount of value they are looking to capitalise on to yield returns? If you’ve reached this step, then I am sure you would know how to reach out to a venture capitalist. ",
            "date": "Answered July 2, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gaurav Chaudhari",
                    "user_href": "/profile/Gaurav-Chaudhari-209"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavishya Devgun",
                "href": "/profile/Bhavishya-Devgun-1"
            },
            "answer_text": "Well, I would say work on idea and find customer. that's the biggest investor without any stake.. Remember old saying “Already Filled vessels have more to be filled than the empty ones”. Moral is earning companies and paying customers are the only factor which will make you self sustaining. If you start business on other's money things might not start at all sometimes . No Idea remains disruptive till it is implemented and if it's more than 6 months then that Idea is not worth holding on to. Work on idea to create Business. Good luck ",
            "date": "Answered July 2, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gaurav Chaudhari",
                    "user_href": "/profile/Gaurav-Chaudhari-209"
                }
            ]
        }
    ]
}