{
    "title": "I have a crush and we listened to music together for the first time, the first song that came on was about falling in love. Does this mean anything? - Quora",
    "tags": [
        "Music Suggestions",
        "Advice On Crushes",
        "Listening to Music",
        "Advice About Love",
        "Crushes",
        "Love Life Advice",
        "Love",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Kurpas",
                "href": "/profile/Simon-Kurpas"
            },
            "answer_text": "let me tell you a story: There was this gall who I’d positively describe as “hot”… One day we just chilled around doing nothing in particular except for being your average douchebags and listening to music blaring from our phones while drinking a few beers. The fun part was, she actually was into industrial, ebm, elektro, such things. So, unsurprisingly with said genres, ’bout half the tracks were about (kinky) sex of just about any kind—the other half about death, destruction and the downfall of society… did that mean anything besides our taste in music at least partially overlapping? No, it didn’t, we just had fun being douchebags. Basically, what I am trying to get at, just because the music happens to fit any feelings you might or might not have towards someone is plain random happenstance. And especially with love songs seeing as there are so many of those that it allmost hurts. That does of course not mean that you shouldn’t tell her about your feelings if you wish to, just don’t interpret randomness as anything other then randomness. ",
            "date": "Answered May 17, 2016",
            "views": "51",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kanishka Dedha",
                    "user_href": "/profile/Kanishka-Dedha-1"
                },
                {
                    "user_id": "Elad Lending",
                    "user_href": "/profile/Elad-Lending"
                },
                {
                    "user_id": "Po Yee FONG",
                    "user_href": "/profile/Po-Yee-FONG"
                },
                {
                    "user_id": "Jacob Blagg",
                    "user_href": "/profile/Jacob-Blagg"
                },
                {
                    "user_id": "Marjorie Wang",
                    "user_href": "/profile/Marjorie-Wang"
                },
                {
                    "user_id": "Luis Arredondo",
                    "user_href": "/profile/Luis-Arredondo-3"
                },
                {
                    "user_id": "Nayyar Abbas",
                    "user_href": "/profile/Nayyar-Abbas-2"
                },
                {
                    "user_id": "Vishwathika Sitaram",
                    "user_href": "/profile/Vishwathika-Sitaram"
                },
                {
                    "user_id": "Cameron Horsburgh",
                    "user_href": "/profile/Cameron-Horsburgh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Cook",
                "href": "/profile/Sam-Cook-45"
            },
            "answer_text": "No it means nothing at all, and no matter what anyone tells you, human beings tend to romanticize relationships, so we like to “hype them up” so to say in order to feel like we’ve accomplished our life. Now, if you wanted to use that information it would mean that you listened to songs with a girl you happen to like weather that be for legitimate reasons or weather you know or not you know her well it means what you experienced was a coincidence, and purely one. If you really wanted to know if she was a good mate choice for you, then you would probably have to read lots and lots, and I will NOT explain anything because it is long, and tedious and down-right moronic at times. So if you know what to look for, then sure, but just using my assumption based knowledge, she doesn’t know you like her, you probably don’t know her too well. And statistically speaking it would be almost impossible for her to be compatible, so, sorry kid. But she (probably) isn’t the “one”. ",
            "date": "Answered May 27, 2016",
            "views": "559",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maria Angela",
                    "user_href": "/profile/Maria-Angela-29"
                }
            ]
        }
    ]
}