{
    "title": "I have a friend that does not like my Christian music. What do I do? - Quora",
    "tags": [
        "Christian Music",
        "Friendship Advice",
        "Christianity",
        "Friendship",
        "Social Advice",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leeman Cheng (鄭禮民)",
                "href": "/profile/Leeman-Cheng-1"
            },
            "answer_text": "I’m a tad confused as to why you need to particularly do something about this. If you’re into Christian rock, Christian pop and Fishbach, but your friend doesn’t, then you continue to listen to Christian rock, Christian pop and Fishbach, while your friend listen to something else that interests him/her. o_o What happens when your friend enjoy eating a triple patty hamburger with a mountain of onions and chopped up raw garlic, but you don’t? What do you do? Do you sit there in distress, wondering in panic what you should be doing about this OR do you order something else that you actually like eating? The answer, quite obviously is that you order something you like eating. I don’t see how what either of you like or don’t like warrants enough stress to need to particularly do something about it. Unless whatever you two like or dislike clashes significantly, like you’re into murdering baby rabbits and your friend loves animals, then yes, obviously, either of you would have to do something about it, but really, this is a extremely personal thing that has absolutely nothing to do with the other person. If you are so inclined to, perhaps you can listen to it less, while you two are in the same room, or simply tell him to put on headphones and listen to something else? ",
            "date": "Answered July 6, 2019",
            "views": "247",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin O'Connor",
                    "user_href": "/profile/Justin-OConnor-13"
                },
                {
                    "user_id": "Julia Doherty",
                    "user_href": "/profile/Julia-Doherty-6"
                },
                {
                    "user_id": "Naomi Green",
                    "user_href": "/profile/Naomi-Green-12"
                },
                {
                    "user_id": "J. Lind Whitby",
                    "user_href": "/profile/J-Lind-Whitby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Ort",
                "href": "/profile/Arthur-Ort-2"
            },
            "answer_text": "I'm a Christian and I don't like a lot of Christian music. If it's bad it's just bad. In unavoidable circumstances, I may stomach it though I may gracefully exit as well. Don't play it when they are around. Find something you both enjoy or don't play music. Or find a new friend. ",
            "date": "Answered July 7, 2019",
            "views": "7",
            "upvotes": "0"
        }
    ]
}