{
    "title": "I love singing. But I don't feel any progress in my vocal quality. Should I stop? - Quora",
    "tags": [
        "Music Suggestions",
        "Singing Voice",
        "Emotional Advice",
        "Advice About Love",
        "Voice",
        "Singing",
        "Love Life Advice",
        "Understanding Emotions",
        "Love",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peri Collins",
                "href": "/profile/Peri-Collins-1"
            },
            "answer_text": "I can guarantee that if you stop trying, you will never have a great voice. “Quitters never win” is often said in sports, but it applies to musicians and actors and students of any type. Let's assume that you want to be the best that you can be eventually, so place quitting into the trash can. Let's look at better choices. If you have not gotten lessons, read books about music or gotten into a regular daily or almost daily practice schedule, get that sorted out now. You cannot exercise your legs once per week for 20 minutes and expect to be a decent runner and the same is true as a singer. You are exercising parts of your body to produce sounds as a singer, so it will take dedication and training for years to get a solid base. It will require continued efforts to maintain your instrument and to grow in musicianship as your body changes through your life. I know professionals with multiple music degrees who still work at the music almost daily unless they are ill. Even when I cannot sing because of the need for vocal rest, I actively listen to recordings of upcoming pieces, or I read through sheet music, etc. I am an extremely busy judge, yet I still must find the time for the music almost daily to work technique and to keep my voice in shape. I sing vocal exercises while showering or during my drive to work most days. When I was a student, I had choir rehearsal for at least five hours per week in school or more plus ensembles plus church choir rehearsal plus practice time at home daily. I started performing in elementary school, yet I found my own voice barely adequate until my thirties! Ask yourself how many hours per week you have really invested and over how many years. Now, evaluate honestly if you should be hearing a bigger return on your investment now, or do you have more work to do to move to the next level? Do you truly want to reach the next level as a singer enough to keep working at it? Even if your goal is not a professional career in music, it still takes an investment in the study and practice to be good in other venues like church choir too. ",
            "date": "Updated August 14, 2019",
            "views": "16",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zo Marce",
                    "user_href": "/profile/Zo-Marce"
                },
                {
                    "user_id": "Mina Sheriff",
                    "user_href": "/profile/Mina-Sheriff-1"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                },
                {
                    "user_id": "Dani Goot",
                    "user_href": "/profile/Dani-Goot"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gideon Shavit",
                "href": "/profile/Gideon-Shavit"
            },
            "answer_text": "About five years ago I joined a choir (technically a chorus, though don't ask me what the difference is). I had never sung in any organized way before, but enjoyed singing in the shower and such, and I thought it would be fun. The first few months were really tough: I enjoyed the music and the company, but at the end of a 2.5 hour rehearsal, my voice would be shot and I would literally be in pain. Things got better, and I started improving. But after about 6 months I hit a wall. I knew that I wasn't very good, and that I wasn't getting any better, but I didn't know why, or how to get over the hump. About two years in I was about ready to give up and settle for a life of disappointment (well, singing-wise at least). But then our chorus got a new director, and that changed everything. You see, this new director is a teacher (middle school music) and a top-notch professional voice coach. He was able to give us the guidance we needed to start growing our skills. Even more importantly, I now have a much better idea of what I'm aiming for, and some of the work I need to put in to move in that direction. I also have better tools for analysing my own singing, so I know better what I'm doing well and what I'm still struggling with. So my advice to you is: find a good coach. You don't necessarily need weekly sessions or anything very regular, but get to the point where you know the direction, and have the tools, and can keep working on your own. You can go back for more help when you need it. Also, find a group to sing with. There's lots, and it really helps, not to mention it can be fun socially. ",
            "date": "Answered November 25, 2016",
            "views": "750",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dani Goot",
                    "user_href": "/profile/Dani-Goot"
                }
            ]
        }
    ]
}