{
    "title": "I love listening to classical music but I don't know anything about it. Where and how can I learn? - Quora",
    "tags": [
        "Music Suggestions",
        "Classical Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Hamacher",
                "href": "/profile/Jeff-Hamacher"
            },
            "answer_text": "It sounds as though you're already listening to a lot of classical music for the sheer joy of it and that's really the most important thing. Your next (and very easy step) is reading web resources (such as the one Collin suggested) aimed at providing basic background information on the pieces that you listen to. A quick web search dug up a couple of \"beginner listening lists\" such as the following that could help identify which pieces to try out:  The Secret to Classical Music: It's Just Music As soon as you come across something in your listening that you really get a kick out of, look up its title or composer in Wikipedia or go the extra step and check out the articles in the New Grove dictionary at a library near you that owns a set or subscribes to the online edition.  The New Grove Dictionary of Music and Musicians In addition, if you attend a paid concert in person, the program notes will almost without fail discuss historical and theoretical aspects of what is being played. Those basic discoveries should lead you to sources for more intensive reading on particular topics that catch your interest. As you delve deeper into the music that you enjoy the most, you could even consider spending some money on published music appreciation or musicology resources. However, there is so much free information floating around that you might as well make the most of it to start. Scale up your reading as you wish but no matter what, keep listening! ",
            "date": "Answered July 25, 2015",
            "views": "432",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Collin Bruey",
                "href": "/profile/Collin-Bruey"
            },
            "answer_text": "Kahn Academy has some good resources.https://www.khanacademy.org/humanities/music Also going to the symphony, if there is one in your area, or watching videos of symphonies on YouTube can be helpf ",
            "date": "Answered July 25, 2015",
            "views": "205",
            "upvotes": "0"
        }
    ]
}