{
    "title": "I need a name for my app, creative minds, help? - Quora",
    "tags": [
        "Mobile Application Advice",
        "Names and Naming",
        "Creativity",
        "Software and Applications",
        "Mobile Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stuart Cliffe",
                "href": "/profile/Stuart-Cliffe"
            },
            "answer_text": "Rules for naming apps - make it short, quirky (so it’s memorable), and easy to spell. It can also say what the app does. Your limitations may be - intellectual property; someone else owns/ uses a name - web names; is that word available for sites and social media handles? And language - does your chosen name mean something highly inappropriate (or just funny) in another language? And there are other oddities like the UK English speaking world lots of words are spelt with an ‘s’, while is US English, they use ‘z’. So. My suggestions would be something like this: Jiffy - the quick way to organize your time Punc Tool - (‘punctual’, geddit?) - always be on time HeadOffice - in charge of your schedule Honcho / Head Honcho - the guy (or app) in charge of a situation Straw Boss - again, the guy in charge You should also look for what terms people use in searching for the type of app you’ve built and see if one of those would do… What people search for: most popular trends, keywords, topics ",
            "date": "Answered July 1, 2016",
            "views": "394",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob McGough",
                    "user_href": "/profile/Bob-McGough-1"
                },
                {
                    "user_id": "Murareelal Meghwal",
                    "user_href": "/profile/Murareelal-Meghwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Storm",
                "href": "/profile/Jessica-Storm-2"
            },
            "answer_text": "I assume the app is something like a planner, keeping track of assignments and test dates. I would suggest something like~ Keep It Together PassPlan School Minder Or something fun that would draw users by the title~ iheartpassing Need~ the~ grade Hey phone, what's that assignment? I don't know if any of these are taken, or if this will help, but here they are! ",
            "date": "Answered June 30, 2016",
            "views": "164",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruno Duarte",
                    "user_href": "/profile/Bruno-Duarte"
                },
                {
                    "user_id": "João Sardinha",
                    "user_href": "/profile/João-Sardinha-4"
                }
            ]
        }
    ]
}