{
    "title": "I play guitar, and I can figure out songs note by note by ear, but I can't figure out chord progressions. How should I practice? - Quora",
    "tags": [
        "Chord Progressions",
        "Guitar Chords",
        "Music Suggestions",
        "Acoustic Guitars",
        "Music Theory",
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Warren Kramer",
                "href": "/profile/Warren-Kramer"
            },
            "answer_text": "Find the right key. A little music theory goes a long way here. Neil Johnson, is correct, most of the time, the bass will play the root note. There are exceptions, sometimes the chord will be D and the bass note A or F#. So here is another method (also not foolproof, but also works in most situations). If you observe keys and learn your major scales you will have the tools you need to figure out most songs. Assuming you can pick out a melody by ear, if you know your scales, you will be able to match that melody to the scale. Let's say you find the song's melody matches the notes from the G major scale.  Now, by \"observe keys\" I mean, look at other songs in G. You will find the same chords used in most songs in G, usually G, C, D and sometimes Em and F#m (perhaps a few others, but these are the most common). You've now narrowed down the choices considerably. It is likely the song uses these chords. ",
            "date": "Answered September 21, 2014",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Damniel",
                    "user_href": "/profile/Sam-Damniel"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Ritesh Singh",
                    "user_href": "/profile/Ritesh-Singh-53"
                },
                {
                    "user_id": "Zee Sternberg",
                    "user_href": "/profile/Zee-Sternberg"
                },
                {
                    "user_id": "Elliott Evers",
                    "user_href": "/profile/Elliott-Evers"
                },
                {
                    "user_id": "Eric Gauthier",
                    "user_href": "/profile/Eric-Gauthier-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kartikey V Hebbar",
                "href": "/profile/Kartikey-V-Hebbar"
            },
            "answer_text": "To be able to get the chord progression just by listening, you need to know the chord combinations( major and minor). A chord combination includes a set of chords which form a group and are mostly played together in a particular chord progression. For example, Em G C D and B7 form a chord combination which are mostly played together( apart from some typical songs). In general cases, if a song is in Em scale then the above mentioned chords are used in the whole song. Chord progression is according to the notes in the song when we hear it line by line. The next chord in the progression would depend on the next note that the singer catches. You will get comfortable with guessing the base notes and it's progression only by listening more songs and making an attempt to guess the chords each time. Cross check your guess by asking your mentor or using the internet. The more you play the chords, the more you'll be familiar with their sounds and when that chord is played somewhere in a song, you'll be like….ahh…I know that chord, that's an A !! Thank you. ",
            "date": "Answered September 2, 2017",
            "views": "946",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Monik Gupta",
                    "user_href": "/profile/Monik-Gupta"
                },
                {
                    "user_id": "Vijaykumar M.r.",
                    "user_href": "/profile/Vijaykumar-M-r"
                },
                {
                    "user_id": "Viv Pereira",
                    "user_href": "/profile/Viv-Pereira"
                },
                {
                    "user_id": "Nikhil Sharma",
                    "user_href": "/profile/Nikhil-Sharma-253"
                }
            ]
        }
    ]
}