{
    "title": "I used to sing very high notes in falsetto. Recently, it's been harder accessing the same falsetto. I've been trying to extend another part of my register. Am I doing something wrong? If so, how can I restore my falsetto? - Quora",
    "tags": [
        "Falsetto",
        "Vocal Performance",
        "Vocal Range",
        "Singing Voice",
        "Voice",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Chandler",
                "href": "/profile/Kim-Chandler-3"
            },
            "answer_text": "A2A: Loss of access to falsetto is often the first sign of vocal distress. If you’ve been trying to extend another part of your vocal range and this has been the result then perhaps you’ve been overdoing it. I’d suggest calming things right down in that regard and allow some time for the voice to recover. If your falsetto hasn’t returned to normal after a couple of weeks, then you may need to have your voice medically checked by an ENT (Ear Nose Throat) doctor and work with a reputable vocal coach in order to work on your technical development more safely & sustainably. ",
            "date": "Answered September 19, 2020",
            "views": "35",
            "upvotes": " Answer requested by Alejandro Ortiz"
        },
        {
            "author_info": {
                "name": "Kenneth Jaffe",
                "href": "/profile/Kenneth-Jaffe-1"
            },
            "answer_text": "I have read Kimberly’s responses to questions like these, and I again concur with her assessment. It is best to have an ENT (otolaryngologist) see what is happening, as this could be a medical issue that a voice teacher is not equipped to handle. Only after taking the ENT’s recommendations would I then go back to working with a voice teacher. ",
            "date": "Answered September 25, 2020",
            "views": "21",
            "upvotes": " Answer requested by Alejandro Ortiz"
        }
    ]
}