{
    "title": "I want to write my own music and sing it. How do I know what I'm good at vs what genre to be in? - Quora",
    "tags": [
        "Music Suggestions",
        "Music Genres",
        "Singing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Marshall",
                "href": "/profile/Jean-Marshall-2"
            },
            "answer_text": "I recently started writing some of my own songs while trying to deal with a break up and some other challenges. I wanted to write some of my own material as a bit of a challenge, but to also see whether it helped shift the way I was feeling. I was surprised how easily the song and lyrics flowed. I didn't make a conscious choice to write that first song in the blues genre, but I guess it just fitted what I was saying (and I do love singing blues). I wrote it while I was driving a couple of hours away and pulled over and pressed record on my mobile to help me hold onto it. The second song I wrote was really different in style. While it had some bluesy elements, it was a lot more modern in style. The writing process was really different too in that I wrote the lyrics, melody and piano accompaniment all at once because I was at home. This song feels more complete and finished. A respected muso friend of mine had the kindness to tell me it reminded him of some of Amy Winehouse’s songs. I have had to really force myself to play my own songs and seek feedback from people - some of which has been a struggle to take. It almost felt like someone has insulted your baby. I am getting used to feedback now though, as it is this that will make me improve. So play your songs for others, be brave, and it will help. I have written a couple of other songs now and have found that the style almost wrote itself. I didn't make a conscious decision about it. So maybe try and stay open about genre so that you're not limiting yourself. I hope this helps. ",
            "date": "Answered January 30, 2017",
            "views": "500",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Smith",
                "href": "/profile/Marcus-Smith-97"
            },
            "answer_text": "I don’t think its a good idea to pick a genre and work toward that. Its simply not genuine and you’ll lack originality. If you just want a nice record deal in a few years, sure just pick a genre and study the elements needed to make radio music. If you’re composing/producing your own music then, you’ll eventually just find yourself and your own style. If you’re just a singer and you need producers then you should go find them and work with them. You won’t really know whats good until its finished and its been heard. You should also have people around you that are honest and at least somewhat musical. People that will tell you your stuff sucks or if its good. ",
            "date": "Answered February 2, 2017",
            "views": "267",
            "upvotes": "0"
        }
    ]
}