{
    "title": "I want to learn to play a bass guitar. What should I look for when I am buying one? - Quora",
    "tags": [
        "Bass Guitar",
        "Learning to Play Musical Instruments",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Demke",
                "href": "/profile/John-Demke"
            },
            "answer_text": "Bass guitars are different animals from six-string guitars. They require more strength and in general a person with a bigger body. Bass guitars have longer necks, heavier bodies (in general) and much harder to fret. The stretch required from the fretting hand in the lower frets will kill you at first. Etudes and riffs that are easy on guitar will be much more difficult. I would first head over to a reasonably stocked music store. Ask the employee for several different makes and models of basses. Don't worry about price, color or electronics - all manufacturers make variations on their models that will appeal to your budget and style. You'll being paying particular attention to the way the bass fits your body. Stay away from 5 or 6 string basses. The necks are way too wide for a beginning bassist. Check out these basses:  Fender Precision Bass -  it is the quintessential bass guitar. You can play rock, pop, metal or just about every genre of music with it. It is a \"long-scale\" bass. The neck is long. It'll require a greater finger stretch at the lower frets. Also check out the width of the nut (the end of the fretboad that is a thin strip of plastic the strings go over). The width of the nut is quite wide for a 4-string. Fender Jazz Bass - it is the second \"standard\" bass guitar. This bass is typically used for jazz, pop and best of all - funk. The body is a little bigger and heavier than a Precision Bass. The scale length is equally as long as a Precision Bass also. Check out the width of the nut. It's much narrower than the Precision Bass. Ibanez SR Series Bass - an all around great bass. If you are of smaller stature I suggest you try one of these basses. They have a shorter scale length and also a narrow neck which make it perfect for teens and more petite individuals. The shorter scale length means that the strings are under less tension when tuned to pitch. That means it is easier to fret notes and play quicker runs. Also in the case of the bass pictured above you can have 24 frets or two compete octaves per string. That's four extra pitches over a Fender bass. They are great for all types of music and a lot of metal players love them too.After you give those a whirl grab any bass that suits your fancy. I'd stay away from ugly, pointy basses because it'll lock you into a genre that requires hairspray and who's got time for that?  ",
            "date": "Answered August 31, 2015",
            "views": "2",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katie Duran Garcia",
                    "user_href": "/profile/Katie-Duran-Garcia"
                },
                {
                    "user_id": "JayStarUlt",
                    "user_href": "/profile/JayStarUlt"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Avisie Kesiezie",
                    "user_href": "/profile/Avisie-Kesiezie"
                },
                {
                    "user_id": "Levent Topakoğlu",
                    "user_href": "/profile/Levent-Topakoğlu"
                },
                {
                    "user_id": "Aaron Boodoo",
                    "user_href": "/profile/Aaron-Boodoo"
                },
                {
                    "user_id": "Shankar Iyer",
                    "user_href": "/profile/Shankar-Iyer-5"
                },
                {
                    "user_id": "Peter Hand",
                    "user_href": "/profile/Peter-Hand-4"
                },
                {
                    "user_id": "Al Taylor",
                    "user_href": "/profile/Al-Taylor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Peede",
                "href": "/profile/Randall-Peede-1"
            },
            "answer_text": "If I tell you it doesn't matter, you will be unhappy. So let me talk about electric basses. A good bass is one that has been analyzed and set up by a good guitar shop. The neck must be straight. It must be in tune with itself (fret placement). The pickups must be functional and it would be nice to have more than 0ne, but not necessary. Not all necks are the same size. Your hand should fit around the neck easily so that you can reach all the strings easily, even though you may use your thumb sometimes. If you have large hands, you want a wide neck to keep from touching two strings at once. If your hands are small, a narrower neck will be more comfortable. Some necks are longer. Less movement equals more speed. Any instrument that makes you NOT want to play it for whatever reason, is garbage to you. The set up is critical. If you use heavy strings, but set them too high above the neck, you will have to push too hard as a beginner. The opposite is true. You can end up hitting unintended notes. Some music genre's lend themselves to different setups. For metal you want a hard-hitting and starting to distort effect. For jazz, you want a softer touch and speed. Choose your strings and set up accordingly. You may have heard of the Wrecking Crew. The record labels at the time found that they could save a huge amount of money in studio time if they used the same rhythm section every time. Many times, the bass players and drummers didn't play on their own albums. Think of it this way: You own A&M Records. You put a band in one of your recording studios and they turn out one cut every 8 hours. You replace them with the Wrecking Crew and you get 10 cuts in the same eight hours. To hear what the consummate studio bass player sounds like check out the works and lesson books of Carol Kaye. For jazz, there are a lot of greats as well, but Jaco Pistorius is right up there. If you can find someone to help you, get a pass to the NAMM (National Association of Music Merchants) Show in January in Anaheim, CA. They do Nashville, TN in June. There you can play every bass known to man (almost) and meet and hear the heavies who are endorsed by the various manufacturers from some of the greatest bands. Once you feel good with whichever bass you buy initially, you will be able to tell the differences right away when you play a different one. You WILL lust for a new toy and will probably sell your old one. Get a reasonable bass and get it set up by real luthier. You're ready. Training your muscles and your brain are the most important parts. ",
            "date": "Answered May 20, 2016",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jarek Michalski",
                    "user_href": "/profile/Jarek-Michalski"
                },
                {
                    "user_id": "Sai Goutham",
                    "user_href": "/profile/Sai-Goutham-19"
                },
                {
                    "user_id": "Edward Sherry",
                    "user_href": "/profile/Edward-Sherry"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Clinton Humphrey",
                    "user_href": "/profile/Clinton-Humphrey-1"
                },
                {
                    "user_id": "William Moser",
                    "user_href": "/profile/William-Moser-2"
                },
                {
                    "user_id": "Ameya Bandekar",
                    "user_href": "/profile/Ameya-Bandekar"
                },
                {
                    "user_id": "Ed Ardzinski",
                    "user_href": "/profile/Ed-Ardzinski"
                },
                {
                    "user_id": "Al Taylor",
                    "user_href": "/profile/Al-Taylor-1"
                }
            ]
        }
    ]
}