{
    "title": "I want to start making music but I can’t afford a producer. What do I do? Are there any who work for free? - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Baldwin",
                "href": "/profile/Jon-Baldwin-4"
            },
            "answer_text": "I want to start making music but I can’t afford a producer. What do I do? Are there any who work for free? “Producer” as in someone who will bring you into a studio, mic up your instruments, and record your songs? Or “Producer” as in someone who will build backing tracks for your songs and make them available to you? The title is a bit adrift in the new world of DAWs and basement beat builders.  One in every eight Americans are making music in some way. I produce, but it's rare that I ever touch a microphone or an instrument. I would suggest you determine what you need, then start looking on Craigslist, Facebook, etc for people to work with. There are people who will “collaborate” with you, but they will likely not be any more experienced than you are. But if you can't pay, beggars can't be choosers. I did a lot of “free work\" when I was getting started. Either because I liked the project and got involved, or I had time and needed the experience and body of work. The drawback seems to be that the less money is involved, the more flakey the participants are. If I want vocals on a track I've built, I might be able to find someone who will do it for free - eventually. I can probably find someone on Fiverr who will do the minimum. Or I can bite the bullet and pay someone a fair amount if I want it good, right, and now. Just like the vocalists I work with, I rarely work for free anymore. There's no percieved value in something that's free. So people will make me jump through hoops, complain a lot, and possibly not even use the track I built for them. At least if I get paid, it's somewhat worth my trouble. I do a lot of spec work on contract, but it's always paid off for me. Good luck, and have fun with it! PS, there are sites like sinimabeats, and a few others, where you can license complete backing tracks pretty cheap. ",
            "date": "Answered November 30, 2019",
            "views": "296",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Totti Vallinheimo",
                    "user_href": "/profile/Totti-Vallinheimo"
                },
                {
                    "user_id": "Dimitri Czapkiewicz",
                    "user_href": "/profile/Dimitri-Czapkiewicz"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "David Palmer",
                    "user_href": "/profile/David-Palmer-49"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alli-146"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fabian Palacios",
                "href": "/profile/Fabian-Palacios-1"
            },
            "answer_text": "is better that you start to produce your own music!! nowadays is easier than years ago where you need to rent or use a specialized music studio, now you can build your home music studio. 1. A budget pc with at least Core i5 2.6Ghz 4gb ram and 250gb 2. Audio interface: Behringer u-phoria um2 but you should go for focusrite or presonus audiobox usb 96 3. Daw(Digital Audio Workstation): this is very important because is the hub of your studio, Cakewalk is free and have the all the features that you need for music production, but as you advance you should upgrade to ableton live. Also you can install native instruments Komplete Start for sounds and other stuff 4. Monitors: Mackie CR3-x are very affordable, but try Krk rokit or presonus eris. this are the basics but if you want some add ons like a midi controller and a microphone. 5. Midi keyboard: Nektar Se25, other budget would be the native instruments m32 and Arturia Minilab 6. Microphone: usb Fifine metal condenser recording microphone Search some bundles that are sold that comes with hardware and software to save some money. This for the equipment and depends on your budget, and then follows the most important is to know how to use the daw of your preference, in youtube you can find a lot of tutorials for music production and basic music theory. Also now there is a lot of knowledge on the web you can find a lot of information and theory on youtube for free, and also there is a lot of online education for music and related topics, if you want to start to produce music this is a process. The most important practice, experiment, and create music consistently! ",
            "date": "Answered October 14, 2020",
            "views": "87",
            "upvotes": "0"
        }
    ]
}