{
    "title": "I want to build a telecaster out of spare parts. What are some great pickup suggestions for an awesome telecaster sound? - Quora",
    "tags": [
        "Telecaster",
        "Music Suggestions",
        "Guitars",
        "Musical Instruments",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Klossner",
                "href": "/profile/Philip-Klossner"
            },
            "answer_text": "There are many and I certainly haven’t tried them all. Seymour Duncan makes a great variety of pickups that generally tend to favor rock and Metal sounds. Their Web site has descriptions and sound clips for you to compare. Duncan pickups (US made if you care) also aren’t just very high end, expensive boutique models. You might also look at Lace. They made the original high end alternative pickups for Strats and have a decent variety now. Lace at least used to tend toward more classic/vintage sounds, but they’ve branched out. Of course there’s always Fender … they have some decent options if you’re looking for an authentic rather than alternative sound. I used a Fender Vintage 50s pickup in my P-bass because I was going for that old school sound. Several others came close but they tended to have higher output than Fender. That might be want you want except that as a Jazz player, I wasn’t looking for output that I could overdrive, etc. So that leads to deciding on the sound you’re going for before buying anything. Each maker will indicate what sound their pickup sets aim for. Sound clips on line are great but subject to the limitations of your computer’s sound system. On mine, that’s pretty limited. I more have to go by the target sound and by the reputation of the maker. That doesn’t mean good or bad, but other artists who use their pickups and what they sound like. ",
            "date": "Answered December 23, 2018",
            "views": "81",
            "upvotes": " Answer requested by Jared Voelker",
            "upvoters": [
                {
                    "user_id": "Jared Voelker",
                    "user_href": "/profile/Jared-Voelker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Anderson",
                "href": "/profile/Stephen-Anderson-15"
            },
            "answer_text": "Pete Biltoft with Vintage Vibe Guitars builds the best Tele pickups….coupled with his 5-way switch, they’re the best I’ve heard…. I asked him to build me a set with the same specs as a friend’s ‘53 Tele which were the best I’d ever heard….what he built for me are better! And best of all they’re reasonably priced! I would also recommend Warmoth for your body (I went with Tobacco sunburst) roasted maple neck (needs no finish and is smooth as butter)a Callaham bridge and Hipshot locking tuners. It’s my favorite Tele ever! ",
            "date": "Answered December 23, 2018",
            "views": "33",
            "upvotes": " View 1 Upvoter "
        }
    ]
}