{
    "title": "I want to join a marching band but my school doesn’t have one. What can I do? - Quora",
    "tags": [
        "Marching Bands",
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Betsy Megas",
                "href": "/profile/Betsy-Megas"
            },
            "answer_text": "Look around for other marching bands and drum corps in and around your community. Here in California, I’m in a community band that would love to have a couple more good members. My dad’s group doesn’t march, but he plays in a community band, too. The Sherriff’s department has a pipe-and-drum group that practices near the county offices on alternate Wednesdays. Any of these groups will get you into assorted local parades, at the least. For school-aged folks, under the age of 21, check if you have any DCI groups within commuting distance. I see you’re in Massachusetts, but not how close to Boston you may be. There is such a group as the Boston Crusaders. I don’t know if they have a feeder corps. The major groups around here do. Santa Clara Vanguard has the Cadets, and Blue Devils has both a B corps for teens who aren’t quite ready for the big leagues and a C corps, for junior high and even younger kids. It’s a huge commitment, but if you can hack it, I guarantee you will get the marching band experience in a big, big way. Or, for DCI on a much smaller scale, see if there’s a SoundSport team in your vicinity, or see if any of the other concert band members at your school would take an interest in starting one. If all else fails, stick with concert band and orchestra, and hold out for college, I guess. (Rather off-topic: my mother tells a story of when she was in college. I guess it was a thing there at that time, that the school did not participate in intercollegiate athletics. When some intramural teams started playing small-scale games against intramural teams from other schools, somebody staged a small scale protest by forming a “marching band” for these games. The rules were completely free-form. Bring a kazoo, wear what you want, march where you want, play what you want.) ",
            "date": "Answered April 30, 2018",
            "views": "667",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jae Starr",
                    "user_href": "/profile/Jae-Starr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Whalen",
                "href": "/profile/Jerry-Whalen-1"
            },
            "answer_text": "If you want to join a marching band and your school doesn’t have one, then it’s time to think outside of the box. Go online to see if there are any local marching bands in your area. Cross the river and see if band members from different schools might be interested. Summer is coming and you might have an independent band by then. You get access to free practice in a school. Depending on your skill levels you might find a niche. You can also use the web to find marching band musicians who are in the same boat. There must be many such musicians looking for something to do. Try to scope out an environment to practice in. In Pawtucket RI. There is a facility called Jamstage. They have different sized rooms for large and small combos and even private lesson rooms. They charge $20 an hour a my last inquiry. The fee is for the room, not how many people are in it. The price may be higher but for a marching band but a few bucks from each member won’t break the bank. Practice whenever you can, shop around, and be determined to succeed. Good luck! ",
            "date": "Answered April 18, 2018",
            "views": "305",
            "upvotes": " Answer requested by Grey Suchecki"
        }
    ]
}