{
    "title": "I want to learn music production, where do I get started? - Quora",
    "tags": [
        "Music Production",
        "Music Industry",
        "Learning New Things",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian C McCalla",
                "href": "/profile/Brian-C-McCalla"
            },
            "answer_text": "Honestly, the best way to do it is to first buy a MIDI controller keyboard for CHEAP (a first gen mpk mini or lpk mini for $20-$50 is MORE than enough), install a free DAW (LMMS, Tracktion 5, or limited “LE\" or “SE\" versions of Ableton, Cubase, Pro Tools, Logic, or even FL studio (Cakewalk has their Music Maker version of Sonar for about $40… and it's awesome, but even THAT is spending too much). Download synth1, free versions of battery, kontakt, u-he and Papen freebies, and then start learning music theory and play. … and by play, I don't mean “as an instrumentalist\" (you'll miss notes and be off time all of the time, that's not important). I mean “as a child”. Try to reproduce favorite sounds and songs. Try to remix older songs. Try to make your own “FM synth nursery rhyme\". Try to make an industrial gothic reggae track using only synthesized woodwinds and percussion parts beginning with the letter “c\" (lots of cowbells, claps, crash symbols, clicks, and creak samples). Try sampling your own voice and faithfully doing every instrument in a symphony to recreate your beat box version of Beethoven's fifth (bonus points for then using the same exact samples to do Samuel Barber's Adagio For Strings from School For Scoundrels ….or the Barney theme song. Whichever strikes your fancy). Slowly, you'll become proficient with your DAW, will have developed an appreciation of flexibility within a genre structure. Will have learned what works, what doesn't, and hopefully exposed yourself to a lot more music in the process. You'll also realize that some people just have talent doing this. You'll maybe see if you're one of them. Whatever you do, don't quit your day job just yet and fight the temptation to read, watch videos, install more plugins, and answer questions on Quora (speaking of which, I've got a date with Sonar Platinum to master a new remix, so I'll wrap up here quick). Production isn't nearly as much about learning by reading, watching, or listening…it's about learning by doing! From the day you start you should be making it a point to start and complete at least one new track per week… no matter how badly they suck (and they will… for a long time, everyone's tracks suck at first for a long time… until they don't so much anymore). Slowly but surely you'll be creating dozens and dozens of sucky, then just bad, then mediocre, then maybe even one or two “Hey! That didn't totally suck!” tracks. If you're lucky, this happens about 2–3 years in. Yes. Really. 2–3. If you're lucky and talented. …..but, the ride will have been great fun and by the time you graduate to consistently decent (5 years or more) you'll either have decided that producing isn't for you or the bug will have bit you and you won't care if you're ever commercially successful because that's not your focus. The sincere love of music will have become your focus. … and if you're good, without really even looking for it, that's when commercial success could come knocking. At that point, it'll just be icing on the cake! . . Make *music*. Do it with *love* . … and vice versa. ",
            "date": "Answered January 11, 2017",
            "views": "21",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christ Xena Octavia",
                    "user_href": "/profile/Christ-Xena-Octavia"
                },
                {
                    "user_id": "RyuJin Shiranui",
                    "user_href": "/profile/RyuJin-Shiranui"
                },
                {
                    "user_id": "Taliska Hollow",
                    "user_href": "/profile/Taliska-Hollow"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Gunhee Park",
                    "user_href": "/profile/Gunhee-Park-5"
                },
                {
                    "user_id": "Alex Childers",
                    "user_href": "/profile/Alex-Childers-1"
                },
                {
                    "user_id": "Dorian Bratanis",
                    "user_href": "/profile/Dorian-Bratanis"
                },
                {
                    "user_id": "Sriram Mrutyunjay Prusty",
                    "user_href": "/profile/Sriram-Mrutyunjay-Prusty"
                },
                {
                    "user_id": "Eternal Horizon",
                    "user_href": "/profile/Eternal-Horizon"
                },
                {
                    "user_id": "Tormod Guldvog",
                    "user_href": "/profile/Tormod-Guldvog"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reagan Kleinman",
                "href": "/profile/Reagan-Kleinman"
            },
            "answer_text": "I recommend the website Soundtrap - Make music online. I almost have the same problem as you do, and find that most music programs have you do some sort of programming to get a good beat or sound going. Soundtrap for me was very easy and actually fun to make music on. All I had to do was work out a way to type the beat in my head onto my keyboard. And if you don’t want to make your own beats or can’t for some reason, there are a ton of premade ones. Buuutttt most of them are premium. Other than that downside Soundtrap’s pretty neat. I hate how scripted I sounded there. ",
            "date": "Answered January 11, 2017",
            "views": "345",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dakota Hernandez",
                    "user_href": "/profile/Dakota-Hernandez-3"
                }
            ]
        }
    ]
}