{
    "title": "I want to try improvising more like Eddie Van Halen. Would it help if I knew Mixolydian mode? - Quora",
    "tags": [
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Improvisation",
        "Guitarists",
        "Playing Guitar",
        "Guitars",
        "Rock Music",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Taylor Crawford",
                "href": "/profile/Taylor-Crawford-56"
            },
            "answer_text": "You may be better off learning “The Eddie Van Halen Scale,” a symmetrical, three-notes-per-string, half-step/whole-step pattern that he frequently uses for both major and minor keys. The root note is circled. He’ll use fragments of this, maybe six notes, that get repeated or can be used in passing. Here’s one I found on the internet, essentially in the key of E:  However, using this pattern effectively will require using your ear. It has conflicting scale degrees - b3 and 3 (G and G# in the E scale) and b7 and 7 (D and D# also in the E scale). So, you’ll need to accentuate the b3 and b7 when playing in pentatonic minor context or the 3rd and the 7th in a major or diatonic context. Or, use all the notes in speedy passages, making sure you land on the root or a chord tone. He also uses other three-note symmetrical scales vertically up and down the neck. Try these: Frets 14–17–20 where the 6th string middle note is the root. A in this position. You play those three notes on every string. Frets 12–15–17 where the E at fret 12 is the root position. Again, play those frets on each string. You can move them around, but these three, widely-spaced notes will feel most comfortable high up the neck. Also, the same logic applies. It’s okay to pass through all of these notes quickly with alternate picking, hammer-ons, and pull-offs, but be sure to land on the root note or a chord tone. That is the quickest way to get to his frenetic sound. If you’re not ready to trust your ears though, another good practice for accomplishing his tapping technique is to combine two positions of the major scale. The first three notes of the scale can be played with normal fingering of your left hand. Then, using your right hand you can tap out notes from the next scale position on the fretboard. You’re basically using your two hands to combine scale boxes. You can apply this same technique in Mixolydian mode. Essentially, you are still playing the major scale, but simply treating the 5th scale degree as your root. So, that’s a good note to land on. Eddie played a lot in this mode, but because he liked symmetrical patterns, which are especially helpful when using a two-handed tapping technique, there’s a lot of extra stuff going on there. It’s pretty scrambled. He just learned which notes to emphasized. You’re best tool for that is listening. If it sounds good, it is good. Hope that helps. But, yes, learn the mixolydian mode whether you want to sound like EVH or not. It’s a good one. ",
            "date": "Answered October 19, 2020",
            "views": "201",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raphael Pervez",
                    "user_href": "/profile/Raphael-Pervez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Starstruck",
                "href": "/profile/Larry-Starstruck"
            },
            "answer_text": "Some would say that is a start. I ran across this channel earlier by a guy named Robert Baker that does guitar reviews and some playing lessons. With EVH’s passing, it seems like his playing is going to be more analyzed. I am going to share Baker’s video and a couple of others. I hope this helps you out. I find that other than gain, a good phaser would be a good effect to have out too.   ",
            "date": "Answered October 22, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raphael Pervez",
                    "user_href": "/profile/Raphael-Pervez"
                }
            ]
        }
    ]
}