{
    "title": "I will attend an audition - what songs do you suggest? - Quora",
    "tags": [
        "The X Factor (US TV series)",
        "American Idol (TV series)",
        "Music Suggestions",
        "Auditions",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlet Langford",
                "href": "/profile/Carlet-Langford"
            },
            "answer_text": "The overall purpose of an audition is to show the auditioners that you are capable of the vocal requirements they are expecting or requiring, and sound GOOD doing it. This is true for ANY audition: for a band, chorus, musical theater, whatever. So with that in mind, ask yourself these questions: What type of music will you need to sing? Choose your audition piece that reflects the type of music you are expected to sing. If it is gospel, find a song in that style. If classical, pick a classical song or aria. Remember the purpose is to show you can sing the music they will need you to sing. Auditioning with a pop song for a chorus that sings a lot of classical will probably mean you don't get selected. If they sing pop music, they don't want to hear music that is operatic. What is your comfortable range? Note I said \"comfortable. Don't pick music with notes that you don't have confidence you can sing well. The last thing you want is to sweat bullets during your audition about that one high note that has a 50% hit rate. Pay attention to the notes in the song, and ask yourself if you can sing all of the notes in the song without stressing or straining. What are your vocal strengths? Do you have a really meaty midvoice? Can you sing fast passages very well? Do you belt? Do you like ballads? Pick a song that shows that off. Do you like the song? Yeah, that's important. The more the song appeals to you and speaks to you, the better your performance will be. You want to showcase your musicality/ability to interpret music, and singing a song you like will help you to bring that out. If you hate the melody, or the lyrics embarrass you or are terrible to you, or you simple cannot relate to the song at all in any way, it'll show when you sing it-and that won't win you points. What's the accompaniment like? Usually you'll have to bring sheet music rather than a CD or taped accompaniment to the audition-the company or choir will have a pianist to play for you. So, take a look at the accompaniment-does it have a lot of accidentals (sharps or flats)? Does it require a concert level classical pianist to be able to play it? While the pianist may be technically able to play the song, having to navigate a piece of music where just about every note is flatted or sharped, or changes keys a lot, or has difficult passages like a lot of runs or weird rhythms can make it very difficult for the pianist to read on the fly-and if the pianist can't play it, your audition will suffer. For classical music, it might not be as big a deal since classical music tends to be written in a lot of bizarre keys and the pianist may be able to navigate it easier-but for pop and musical theater, where the music is typically not written with a lot of accidentals, the pianist may not be as deft at sight reading nightmarish key signatures like Db or Gb or B. So, try to pick a song that doesn't have a lot of accidentals or key changes or overly difficult passages if you can. Is the music from the show you are auditioning for? An unwritten rule for musical theater auditions is don’t choose music from the show as your audition piece. Unless the audition notice specifically SAYS they want to hear music from the show, it’s a real good idea to not use music from the show as your audition piece. If it doesn’t say, then assume that singing from the show is unacceptable. If you are called back, then you will be asked at that time to sing music from the show. Is everyone around you singing this song? If so, that is what we call “overdone”. If a show is very popular at the moment, like “Frozen” or “Hamilton” or any show like that where EVERYONE is singing something from it, that’s overdone and you need to steer clear of it. If you and your friends know the song and are fangirling over it, don’t sing it for your audition. Trust me. If you pick an overdone song you can count on 50 other people doing that song-and you want to stand out. You being the 51st person singing “Let it Go” will not accomplish that-there is only so much you can do with any song, and if you are that 50th person, you will not bring anything new to the table. There is a LOT of music out there so there is no reason other than laziness to pick a song that fifty other people will likely do. Spend a little time and pick something from a show that hasn’t been done in a while, sing it well, and you increase your chances of being called back. ",
            "date": "Answered May 16, 2017",
            "views": "23",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abaabu Nadia",
                    "user_href": "/profile/Abaabu-Nadia"
                },
                {
                    "user_id": "Fabiana Nava",
                    "user_href": "/profile/Fabiana-Nava"
                },
                {
                    "user_id": "Lacy Rouse",
                    "user_href": "/profile/Lacy-Rouse"
                },
                {
                    "user_id": "Angelina",
                    "user_href": "/profile/Angelina-197"
                },
                {
                    "user_id": "Mary Alex",
                    "user_href": "/profile/Mary-Alex-6"
                },
                {
                    "user_id": "Kasie Liang",
                    "user_href": "/profile/Kasie-Liang"
                },
                {
                    "user_id": "Pebbles Johnson",
                    "user_href": "/profile/Pebbles-Johnson"
                },
                {
                    "user_id": "Alexandra Picken",
                    "user_href": "/profile/Alexandra-Picken"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Russell",
                "href": "/profile/Christopher-Russell-35"
            },
            "answer_text": "That honestly depends upon the performer. Here are some guidelines to follow when searching for a good audition piece: How does it fit into your vocal range? You don’t want a piece that sits well outside of your range so that you’re clearly struggling to hit the notes, nor do you want a piece that shows very little of your range. It’s a fine line. The best rule to follow here is to find a song that feels doable but showcases your “money note(s).” For me, a baritone/baritenor (I hate that term, but what are ya gonna do?), I look for songs that go up to a G/A-flat/A(maybe).Is it well-known/overdone? When I was a student, one of the best bits of advice I received concerning well-known pieces was “unless you’re going to sing it better than anyone else in the world, find something else.” Basically, don’t sing “Defying Gravity” or “Waving Through a Window.” Anything that is hot right now, just stay away from it. Also, songs such as “I Could Have Danced All Night” or “Younger than Springtime,” while safe, are very overdone.Can you act it/do you fit the role? The former is far more important. If you don’t feel it’s a good acting piece for you, throw it away. As for the latter, if you’re caucasian and auditioning for “Ragtime,” please don’t sing “Wheels of a Dream.” :)Last bit of advice: Have a book! Don’t just take in one song. Have a multitude prepared. My university training ended with students having anywhere from sixteen to thirty-some songs prepared and ready to take into auditions. Have contemporary ballads and uptempos. Have the same for more classical music theatre literature. If you’re going in for a cruise ship audition, have pop/rock songs spanning decades!Hope this helped! ",
            "date": "Answered October 23, 2018",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hirai Momo",
                    "user_href": "/profile/Hirai-Momo-31"
                },
                {
                    "user_id": "Nameeta Rani Moharana",
                    "user_href": "/profile/Nameeta-Rani-Moharana"
                },
                {
                    "user_id": "Abhishek Nagarkar",
                    "user_href": "/profile/Abhishek-Nagarkar"
                },
                {
                    "user_id": "Julia Warren",
                    "user_href": "/profile/Julia-Warren-22"
                },
                {
                    "user_id": "Sebastian Müller",
                    "user_href": "/profile/Sebastian-Müller-51"
                },
                {
                    "user_id": "Anita Earnshaw",
                    "user_href": "/profile/Anita-Earnshaw"
                },
                {
                    "user_id": "Fabiana Nava",
                    "user_href": "/profile/Fabiana-Nava"
                },
                {
                    "user_id": "Brittany Green",
                    "user_href": "/profile/Brittany-Green-183"
                }
            ]
        }
    ]
}