{
    "title": "I would like to know the prospects of pursuing MS in music technology. What is the process? - Quora",
    "tags": [
        "Music Technology",
        "Master's Program Advice",
        "Master's Programs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randall Peede",
                "href": "/profile/Randall-Peede-1"
            },
            "answer_text": "As a startup employee, you want to get as much stock and equity (in writing) as you can and hope that someone big, like Apple, will buy you. You can starve while waiting. In the software area, you are not likely to be involved with the company building the next ProTools, Vienna Instruments, East-West/Hollywood Strings, etc. These people have serious money and will gleefully kill anything that comes near them (personal experience). So the content creation tools are pretty locked up. You either make something that makes something easier or do it better. You may create a plug-in or something for Ios or Android, but still might starve waiting for $3.99 downloads of something that has a very narrow niche. What's left is content creation.  As with any advanced work, there are two choices 1. teach (you will probably need a doctorate to teach this within an accredited university setting), or 2. do the actual work by entering into a highly competitive field crowded with people who know people and probably don't have your background. Their boss also probably doesn't have any background either and therefore only wants who's ever cheapest. I recommend that you research to find someone who is already proficient in the area that interests you (probably not John Williams, but someone that you respect who IS making a living doing what you want to do) - performance, game composition, film scoring, recording engineer, mastering. Find and if where this person teaches. Your goal is to learn everything this person knows, meet everyone that you can and wait for the inevitable overflow work. Work for free sometimes just to blow people away. Prove yourself by being a low maintenance (no hissy fits)/high creativity/attention-to-detail employee that gives the customer more than they paid for (and they know it). The next time your name comes up, everyone nods affirmatively. Join the AFM, and attend I3, CES, NAB, NAMM with samples of your work. My wife teaches Digital Copyright Law at the university level. Learn it and be the company expert. ",
            "date": "Answered March 26, 2016",
            "views": "382",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Christopher Lewis",
                    "user_href": "/profile/Christopher-Lewis-40"
                }
            ]
        }
    ]
}