{
    "title": "I write songs. Where and how can I safely sell my lyrics for a tidy sum? - Quora",
    "tags": [
        "Song Lyrics",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Jordan",
                "href": "/profile/Robert-Jordan-82"
            },
            "answer_text": "To safely sell your songs they need to be registered for copyright. Here in the U.S that can be done through the Library of Congress, and you can actually register quite a few under one price, kind of like a  record album. Your songs are copyrighted as soon as it is written or recorded onto something tangible. The registering is where you get a true case should you hear one of your songs on the radio and know that you weren’t part of the equation. To my knowledge the U.S copyright law is honored in most countries, you would definitely need to read the fine print. I was able to register 102 songs back in January for $55.00, using the aforementioned blanket method, and another 50 last month. Selling your songs online? there are some websites you can google for that, as there are quite a few doing it. Taxi I think does it, but you’ve got to pay about $300.00 to row their boat. You might try to find a musician to collaborate with, and put one out where it can be seen and heard. There’s a few sites doing that “Writers Link” “Song stuff” no cost. You are sailing in tricky waters here because the industry has changed so much, but you have your copyright so you’re protected. Here’s what I did and I can’t say it’s the answer, but it enables me to maintain ownership of my songs. I published my songs in 2 e-books, with another on the way, that’s why I’m registering so many for copyright at one time. In the not so distant past if you were writing, you almost always had to get a publisher, they would generally take 50%of your song ownership, if you’re not the musician, then there is still a band to pay, and there maybe a label involved. Based on that model the songwriter gets a very small percentage of the pie that he baked. I didn’t write my songs with the intention of playing them, they’re intended for those better than I. By doing what I did though, I should get a bigger portion of the pie when it gets served. If these books were selling like hotcakes, I would really be onto something, but they aren’t, so recording will have to wait a while. Good Luck! Robert ",
            "date": "Answered June 1, 2017",
            "views": "131",
            "upvotes": " Answer requested by Nnaa Nto",
            "upvoters": [
                {
                    "user_id": "Robert Jordan",
                    "user_href": "/profile/Robert-Jordan-82"
                },
                {
                    "user_id": "Nnaa Nto",
                    "user_href": "/profile/Nnaa-Nto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Otto Heather",
                "href": "/profile/Otto-Heather"
            },
            "answer_text": "Thank you for the A2A Well this is a tricky one, as I don’t know where in the world you are so I can’t exactly give you a step by step guidline on how and where to sell your music. The reason I say this is because here in NZ it works in a way I am familliar with. So I will try and answer practically so that you may see what works for you and how to apply and go about it. First what genre of music do you write? There is a site you can visit and set up a profile for free. It is a good place to start. Acting auditions, model jobs, music & extras casting They are global and im sure you will be able to set a profile up from where youre based. Set a profile up add photos, your skills and experience etc You would fall under the category of composer, A composer can also be a lyricist, songwriter and/or producer, however many composers are not lyricist and most do not produce at all. You can also (and I’ve seen this for myself on there) apply for lyrcist roles on there who are offering good money. Once you’re set up start looking for jobs that cater to what you’re good at. Which is writing music. Or you could place a listing and post it live for people to apply etc. There are always singers and musicians looking for good songwriters and will pay good money for the rights to your material. In saying all of this, get your work licensed and copyrighted so there is no issues down the track. Most importantly research the genre of music you specialise in. Look up and familirise yourself with copyright terms and licensing of your work. Some licenses allow you to keep the rights to your work and you get a fairly good cut from the sales of the song. I hope this can help. All the best ",
            "date": "Answered June 1, 2017",
            "views": "196",
            "upvotes": " View 2 Upvoters "
        }
    ]
}