{
    "title": "I'm a 13-year-old Filipina and I want to audition for JYP Entertainment. I am also 170 cm tall, I have pale skin, I sing, dance, and rap. Do you think I'll get accepted? - Quora",
    "tags": [
        "Kpop Audition",
        "JYP Entertainment",
        "Auditions",
        "13 (age)",
        "Dance (activity)",
        "Singing",
        "K-Pop",
        "Height",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carmen Lin",
                "href": "/profile/Carmen-Lin-29"
            },
            "answer_text": "I think there is a chance you will get accepted, only fig you show that you have the skills, talents, and most of all, passion and admiration the you hold for it. as much as people like to see you perform the basic fundamentals and the technicality, the passion is the most important, the way the music ays you feel when you dance along with it, if you can’t feel anything while you dance, then what’s the point? To dance, and sing, to be an idol. It is the exhilaration, the excitement, and ecstasy, that courses through you and floods through your system and just blocking out all other negative and disturbing feelings, and it just makes you feel in a calm and overcast headspace. It is also about how hard you work on those works, how you hone them in and improve upon them as well. If you can sing, dance, and rap, then that is great. But companies like JYP don’t just okay. They expect more. They expect something close to perfection, and if you have the seen the high standards that JYP himself holds for his trainees in tv reality show, then I am not lying about the difficulty attached with actually getting in, and the fact Twice was chosen by not only the people’s vote, but JYP himself through careful selection and surveying of the trainees shows that the path to becoming an idol is not an easy, and there is certain level uncertainty that always hangs in the air. there is no knowing when you will get accepted or if not, and there is this suspense in between, riddled with apprehension and nerves as they wait for their results. While they waited upon the arrival of news, they has to practice because they knew that if they wanted to continue being here, they had to at least keep trying to prove to them that they are worth being an idol and earning a place in this company. They know it is not the time to slack off, to loosen up and relax because there is still so much that it left unsaid, and slacking off means you have already accepted that you might lose and the possibility of elimination is inevitable in your eyes. So, what I am trying to say is to just work hard, and dedicate yourself to this passion because you are the only one who can love and admire this passion, and no one else can know or experience how much passion you feel for it. You have a name to make, and a future that is waiting to unfold in front of you, you have to prove your worth to the company and show your potential to being a strong member of the company and that you can contribute with your abilities. So, just work hard, don’t give up, and good luck. ",
            "date": "Answered September 29, 2020",
            "views": "535",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rei Lee",
                    "user_href": "/profile/Rei-Lee-19"
                },
                {
                    "user_id": "Kath Damian",
                    "user_href": "/profile/Kath-Damian"
                },
                {
                    "user_id": "Naomi Kim",
                    "user_href": "/profile/Naomi-Kim-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amy Xie",
                "href": "/profile/Amy-Xie-57"
            },
            "answer_text": "No. Why? Because you’re a foreigner. Unless you look like Irene, Tzuyu, Jisoo, or any other visual of a Kpop girl group, I can guarantee that your dreams will get crushed the moment you fly to SK and audition. I think, out of everything you have to offer, visuals are the most important. Knetizens won’t accept girls who don’t look Korean. Even Lisa of Blackpink got lots of hate for being Thai, and she has a pretty darn good face. It aligns very well with Korean beauty standards, but she still couldn’t avoid getting hate for being a foreigner. That being said, unless you’re just as pretty or even prettier than Lisa of Blackpink, you will have an unsuccessful career in Korea. Knetizens just won’t accept you. I think the most important part of the face is the face shape, jaw size and shape, and nose. Here is a chart of face shapes:  Koreans typically dislike girls with long, round, square, and diamond-shaped faces. The ideal face shape, in my experience, is an oval or heart-shaped face. Next comes to the jaw. I’m sure you’ve heard of the v-line.  In this picture, there were also some alterations done on the eyes and nose, but that’s beside the point. The point is — Koreans like v-shaped jaws, like the woman on the right. Larger jaws are seen as masculine and are not ideal for the female Kpop community. Next comes the nose.  Idols are expected to have straight, thin, slightly angular, and upturned noses. Bulbous, crooked, and overly-long or short noses are a big no-no. There are exceptions to every rule, but the people who go against these “rules” are usually Korean — not foreigners. You can see that the woman on the left has a downturned nose with little height to it. The tip of her nose is pointing downwards (hence the word downturned), and that is generally frowned upon in the Kpop industry. If you fit the criteria for South Korea’s visuals, you will have a better chance of being accepted. If you don’t, well… your chances were already low. Not looking the part will make those chances even lower. You also mention that you can sing, dance, and rap. But to what extent? What will set you apart from the thousands of other applicants? Is your singing good enough to make make a bankrupt man smile? Is your rapping good enough to hype the judges, and is your dancing good enough to get others to want to join you? If it isn’t, there will be little you can do to be accepted into JYP. Think about what I’ve said, but know that it’s your decision in the end. Audition if you must, but don’t be disappointed if the results aren’t what you expect. ",
            "date": "Updated October 2, 2020",
            "views": "234",
            "upvotes": " View 61 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Debbie Idk-",
                    "user_href": "/profile/Debbie-Idk"
                },
                {
                    "user_id": "Deeja Sarah",
                    "user_href": "/profile/Deeja-Sarah"
                },
                {
                    "user_id": "Kim JiMoon",
                    "user_href": "/profile/Kim-JiMoon"
                },
                {
                    "user_id": "Angie Parchomczuk",
                    "user_href": "/profile/Angie-Parchomczuk"
                },
                {
                    "user_id": "Lee Know's Butt",
                    "user_href": "/profile/Lee-Knows-Butt"
                },
                {
                    "user_id": "Taylor Smith",
                    "user_href": "/profile/Taylor-Smith-506"
                },
                {
                    "user_id": "Sakura Yamaguchi",
                    "user_href": "/profile/Sakura-Yamaguchi-3"
                },
                {
                    "user_id": "Srishti Singh",
                    "user_href": "/profile/Srishti-Singh-890"
                },
                {
                    "user_id": "Princess Starlight",
                    "user_href": "/profile/Princess-Starlight-1"
                },
                {
                    "user_id": "Parasmoni Das",
                    "user_href": "/profile/Parasmoni-Das"
                }
            ]
        }
    ]
}