{
    "title": "I'm a bisexual teen girl, but ever since getting together with my new boyfriend, I can't envision myself liking girls again. Is this possible? Could he have actually 'turned' me straight? - Quora",
    "tags": [
        "Bisexuality",
        "LGBTQ",
        "Sexuality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sadhbh Teh Great",
                "href": "/profile/Sadhbh-Teh-Great"
            },
            "answer_text": "Oh honey I've felt this way before. When I was young I proclaimed I was bi, cause I was ok with dating another girl, but I only envisioned myself dating boys. This doesn't mean you are straight, as I soon learned, it just means that a certain person of a certain gender has caught your attention, and your attached to everything about them. Later when I dumped my old bf, I found an awesome gf, a friend I had known for two years, and then it was flipped. I couldn't imagine myself with boys (or honestly anyone else) again. We broke up a while ago, to my dismay, and now my new love interest is focused on a boy yet again. Being bi is a great yet terrible roller coaster of flipping from side to side. Though from now and forever one I shan't date anyone in utter fear of getting my heart squished, but that's besides the point. So you probably aren't straight, but if you are, so what? Sexuality doesn't mean squat in my book. As long as you accept people for who they are and not what they are, same with yourself, everything will be fine. ",
            "date": "Answered July 5, 2018",
            "views": "11",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grady Cox",
                    "user_href": "/profile/Grady-Cox-3"
                },
                {
                    "user_id": "Matt Cutmore",
                    "user_href": "/profile/Matt-Cutmore"
                },
                {
                    "user_id": "Mitchel Littleton",
                    "user_href": "/profile/Mitchel-Littleton"
                },
                {
                    "user_id": "Chuckie Leung",
                    "user_href": "/profile/Chuckie-Leung"
                },
                {
                    "user_id": "Bailey Ryan",
                    "user_href": "/profile/Bailey-Ryan-12"
                },
                {
                    "user_id": "Alex Strand",
                    "user_href": "/profile/Alex-Strand-5"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                },
                {
                    "user_id": "Aaron Lau",
                    "user_href": "/profile/Aaron-Lau-44"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bubblegum-Bih"
                },
                {
                    "user_id": "Adam Hartline",
                    "user_href": "/profile/Adam-Hartline"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Reynolds",
                "href": "/profile/Paul-Reynolds-50"
            },
            "answer_text": "This is why I think people should slow way down with labeling, even for themselves. We have a lot of experiences in our teens and twenties (and even beyond) that change us, either in evolutionary or revolutionary ways. If we try to (and especially if we think we succeed) label ourselves early on in that process, so that we can feel safe and secure in “knowing” ourselves, well… We experience something like, well, like what you’re describing. We have a perfectly normal experience that has an effect on the way we think. Except instead of taking it in stride as the normal process of learning about ourselves, we may instead be shaken because the label we were so sure of before no longer seems to fit. Our sense of identity is lost.  Will you ever be attracted to women again? Maybe. Maybe not. Does it matter? Why should it? Is being bisexual better or worse than being heterosexual? If you’re not assigning value to one orientation versus the other, then it really shouldn’t make a difference. Why stress about a label? Feel how you feel now, and enjoy what you have with the person you’re with. Do your best with this relationship. Don’t worry about how you might or might not feel in the undefined future. ",
            "date": "Answered July 6, 2018",
            "views": "465",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janet Hodson",
                    "user_href": "/profile/Janet-Hodson"
                }
            ]
        }
    ]
}