{
    "title": "I'm trying to understand atonal music, but is there any that can be considered 'beautiful'? - Quora",
    "tags": [
        "Atonality",
        "Beauty",
        "Attractiveness and Attractive People",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gustavo Guardiola",
                "href": "/profile/Gustavo-Guardiola"
            },
            "answer_text": "I’m a musician who has worked in both sides of the playground and I think there are many beautiful pieces written with non tonal systems, but I understand your concern, there’s a huge repertoire of non-tonal crap which lacks artistic merit, beauty and intelligence. Non tonal systems have been omnipresent in the academic environment and the difficulty for the majority of the public to understand atonal music gave some musicians a blank check to write with frivolity awful music while still getting grants and funding and getting their music to be played when some sacred cow of the academic circle decided so. Many of those pieces are worthless, we have to admit it. At the same time many great musicians who didn’t share the enthusiasm of non-tonal music were condemned to oblivion. However, as you get familiar with modern music you find gems here and there and maybe one day you find that you really enjoy and recognize the talent of many or some non tonal composers. Try Schoenberg’s opus 11. I honestly think that they are beautiful. On the other hand, I don’t like Pierrot Lunaire. Try Messian. Try Giacinto Scelsi, who escaped serialism and conceived music from a very different perspective: tonal-non-tonal-microtonal-who-cares. Not all modernist art was atonal. By listening to some composers who kept some modal or tonal reminiscences, or who worked at the boundaries of tonality, you get familiar with modern ways of making music while still having some ground. Debussy, Bartok and many works by Stravinsky have many of the elements that defined non tonal systems, but they are not atonal strictly speaking (ok, Stravinsky has atonal works as well). This is Giacinto Scelsi - Quays for Alto Flute.  I think it's beautiful, what do you think? ",
            "date": "Answered November 7, 2017",
            "views": "249",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Ehle",
                    "user_href": "/profile/Robert-Ehle"
                },
                {
                    "user_id": "Rodney Chin",
                    "user_href": "/profile/Rodney-Chin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "David Skulski has pointed out that \"atonal\" is not necessarily synonymous with \"twelve note\" (dodecaphonic) - that is the systemised form of atonal composition that Arnold Schoenberg formulated in the early 1920s. Schoenberg himself was already writing \"atonal\" music in his \"Pierrot Lunaire\" (1912).The thing is, you may ALREADY like atonal music! For example, I've often quoted Ligeti's \"Lux Aeterna\" as an example where the music was widely praised as an effective soundtrack to Stanley Kubrick's \"2001 A Space Odyssey.\" Here's another Ligeti piece called \"Atmospheres\". Try to listen to it while watching this video:  I'm guessing that this music is completely unfamiliar to you. However, here's another experiment you could try. Pick a creepy film you already know, but this time concentrate on the soundtrack. It might well be at the eeriest moments the music goes \"atonal\". You may find a certain beauty in it, though. But here's a composer whose music I truly love and is exotically beautiful; you may not agree, but give it a try:  ",
            "date": "Answered November 7, 2017",
            "views": "407",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Ehle",
                    "user_href": "/profile/Robert-Ehle"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Smit Soni",
                    "user_href": "/profile/Smit-Soni-2"
                },
                {
                    "user_id": "Dave Gibson",
                    "user_href": "/profile/Dave-Gibson-9"
                },
                {
                    "user_id": "Rodney Chin",
                    "user_href": "/profile/Rodney-Chin-1"
                }
            ]
        }
    ]
}