{
    "title": "I'm a songwriter. How do I sell my songs or get people to sing it? - Quora",
    "tags": [
        "Songwriting",
        "Singers",
        "Singing",
        "Musicians",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Deats",
                "href": "/profile/Jeremy-Deats"
            },
            "answer_text": "After studying the craft of songwriting and the business associated with it I can provide a perspective. Aside from securing the copyright (and yes you should, it’s easy to do), you have a lot of hurdles to get through in order to get your song heard by the right people and then considered by the right people. The short answer- To get your song heard you’ll likely need to move to a music city, begin the long journey of networking with other musicians to meet the right people, continue to grow as a writer and hopefully land a Publishing deal which will provide a channel by which you can get your song heard by artist who might want to record it. The long answer- The truth is that even if you’ve written a commercially viable song that would be a good fit for several artist there is a gated system that will keep your song from getting to the right people. That system in this case would be the thousands of aspiring songwriters who have relocated to the music cities like Nashville to perform, co-write and network to meet the right people in order to get their music heard and maybe (just maybe) get a chance at a Publishing deal. The Publishing deal is a contract between you and an established Music Publisher who will shop your song to the artist. It’s how the recording artist find new material. Do Publishers ever sign one song deals to people outside music cities? Yes, but these are rare deals and usually one shot deals. I suspect favoritism for local songwriters exist for a few reasons (all of which make sense). The first is the importance of face to face networking/ Publishers want to develop their talent and build these relationships. Second would be the importance of co-writing. Look at the credits behind today’s hits and you’ll notice they all have multiple writers. This is part politics (record sales have gone through the floor, so more people want a cut of the songwriting royalties) but it also has to do with the diversity multiple writers can bring. Pairing a new writer with a few established writers is a common trend it brings some comfort to the record labels who are always taking a huge risk with each song they record. For a Publisher to shop a finished song written by a single outside writer to an artist is a hard sell for the Publisher. I would suspect in today's world it would just never happen. You may be thinking “why can’t I just send it to the record label or artist directly?” These do seem like the logical paths, but they are next to impossible because so many people would try this. Record labels do not take unsolicited material, meaning they will throw whatever you send them in the garbage or do return to sender and they will never listen to it. Artist are even harder to reach, but even if you did reach a major artist and they liked your song, the recording artist has a responsibility to their management team and record label to play their part. Part of that includes where they source their new songs from. Most write a few of their own and then turn to the trusted Publishers, it’s about paying respect to the system that made them who they are and all the hard working people who risk everything to go be part of that system. In Garth Brooks Anthology book he shares a story about how he moved to Nashville on a dream of getting George Strait to cut his song “Much Too Young…”, Garth knew he had written a great song and he thought if George could just hear this song he’d certainly record it and it would kick start his career as a songwriter. Well, he did move to Nashville and even after years of trying George’s team didn’t want the song (probably never even heard the song). But Garth networked, began showcasing his songs and eventually got signed as an artist. When he got signed he turned to some of the other songwriters who had met along his journey in Nashville to help him create hits. As with Country Music, Hip-hop and R&B have their networks. If your goal is mainstream success, you really have to be plugged into one of those systems, meet the right people and then find your place in it all in order to stand a chance. ",
            "date": "Answered March 24, 2018",
            "views": "91",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Chapman",
                    "user_href": "/profile/Robert-Chapman-9"
                },
                {
                    "user_id": "Endamix None",
                    "user_href": "/profile/Endamix-None"
                },
                {
                    "user_id": "Z T",
                    "user_href": "/profile/Z-T-149"
                },
                {
                    "user_id": "Coreen Pendergraff",
                    "user_href": "/profile/Coreen-Pendergraff"
                },
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Angela Tamayo",
                    "user_href": "/profile/Angela-Tamayo-16"
                },
                {
                    "user_id": "BubalooMC .",
                    "user_href": "/profile/BubalooMC"
                },
                {
                    "user_id": "Vince Gray",
                    "user_href": "/profile/Vince-Gray-1"
                },
                {
                    "user_id": "Atul Salgaonkar",
                    "user_href": "/profile/Atul-Salgaonkar"
                },
                {
                    "user_id": "Davis Gloff",
                    "user_href": "/profile/Davis-Gloff"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "This is a harsh business to try and break into and thousands of songwriters are asking the same question. I am a singer and songwriter myself i I can tell you from experience very few people ever get their music sold or to artist to sing their songs. I have been doing this for many years with little success but I do it more for the love of writing my music than trying to get rich and famous doing it. You do need to register your music as suggested and I have my songs registered with BMI but there are other sites to register like ASCAP and other as well. You really need to at least record a demo of the song. many music companies prefer an acoustic version because they have their own ideas on how a song should be produced so they want it is a simple form. I do full blown versions as well as acoustic versions because I am also a singer and want to promote myself as well as my my music. There are various websites like Reverb Nation, Number One Music to place your music on and even websites where you can submit your work for consideration like Music gateway. Long gone are the days where you can contact record labels and submit music directly to them I’m afraid. While I have seen someone mentioning Collaborating with others I am not a huge fan of doing this as you then have a partner that may have other ideas on what to do with the song than you do and unless you both agree on what to do with a song you are stuck and can end up doing nothing with it since you both have an equal say in the song. I have had this happen to me where a major label wanted our song for a major artist to release as a single. I was all for doing this but my partner only wanted to release our version of the song and so we were deadlocked and the song fell by the wayside because We couldn’t find a label to release our song. People often don’t want to take a chance on an unknown artist no matter how good the song may be. You can even create a simple video of the song and put it on You Tube. The more places you have it the better your chances of getting it heard are. You can also hype it on social media sites like Twitter as well. ",
            "date": "Answered March 26, 2018",
            "views": "48",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bazit Ishau",
                    "user_href": "/profile/Bazit-Ishau"
                },
                {
                    "user_id": "Jeune JL",
                    "user_href": "/profile/Jeune-JL"
                },
                {
                    "user_id": "David Smith Jr",
                    "user_href": "/profile/David-Smith-Jr-3"
                },
                {
                    "user_id": "Nikkiyu 魚毛",
                    "user_href": "/profile/Nikkiyu-魚毛"
                }
            ]
        }
    ]
}