{
    "title": "I'm a 14-year-old singer but I'm struggling to improve on my singing voice to hit higher notes. Does anyone know what can help? - Quora",
    "tags": [
        "Vocal Performance",
        "Singing Voice",
        "Singers",
        "Voice",
        "Singing",
        "Musicians",
        "Teenagers and Teenage Years",
        "Self-Improvement",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "Make sure that you are not trying to project sound from your throat. To reach higher notes, identify the area that in simplest terms, is in the belly, below the Sternum. The sound comes from there. To see it used, observe 13 year old Laura Bretan performing “Nessum Dorma”. (At the age of 12, she might not have been able to do it, but at 13, she was just able to bring it off in a phenomenal rendition of the operatic piece.) She was singing at the borderline between successful vocalization and the failure to vocalize. Fortunately, she developed the vocalization from her belly. Also, to understand this accomplishment, it should be noticed that she is “feeling” the emotion of the character (The Princess) in the story in the opera. In order to bring this off, she must become the Princess, who must make a soul crushing decision, and Laura Bretan brings all the power of that emotion, to the performance, as though people were going to die if she did not do it well. That is the story line in the play you see. Without performing as though this was a reality at that moment, Ms. Bretan would not have been able to bring it off. Her face shows the emotion of a Princess whose decisions and choices will bring people to their death.  ",
            "date": "Answered June 30, 2020",
            "views": "397",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phil Cabrera",
                    "user_href": "/profile/Phil-Cabrera-2"
                },
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                },
                {
                    "user_id": "Dagnia Caune",
                    "user_href": "/profile/Dagnia-Caune"
                },
                {
                    "user_id": "Jac Son",
                    "user_href": "/profile/Jac-Son-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dorothy Williams",
                "href": "/profile/Dorothy-Williams-11"
            },
            "answer_text": "I get a little nervous when you say “struggling.” Your vocal apparatus is still young and growing. At any age, it is a delicate instrument, vulnerable to damage. Sing easily, producing the voice with freedom. At every pitch, and especially on the high notes, hear every note in your mind before you sing it. ",
            "date": "Answered July 5, 2020",
            "views": "397",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Priya",
                    "user_href": "/profile/Priya-3096"
                }
            ]
        }
    ]
}