{
    "title": "I'm new to Star Trek. Where should I start with the TV shows and which ones should I avoid? Are the shows anything like the movie? - Quora",
    "tags": [
        "Star Trek (2009 movie)",
        "Star Trek: Enterprise (TV Series)",
        "Star Trek: Deep Space Nine (TV Series)",
        "Star Trek: Voyager (TV Series)",
        "Star Trek (TV Series)",
        "Star Trek: The Next Generation (TV series)",
        "Star Trek (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brianna Williams",
                "href": "/profile/Brianna-Williams-25"
            },
            "answer_text": "You say you love sci-fi, but it is a broad and wonderous genre. I think where you start with Star Trek depends on the things you like most within sci-fi. If you enjoyed the new movie (the 2009 one or Into Darkness? ST Beyond? Is that out yet?) you may expect a similar level of action in the other movies, if not the series themselves. But one of the complaints long-time Star Trek fans have of the reboot (post-2009) movies is they try to make Star Trek into action movies. If you like the action, big explosions, that kind of stuff about the new movies, try watching the new movies first. From there, I might suggest Enterprise. While lots of fans like to pretend Enterprise never happened, I’ve never minded the premise and actually enjoyed several episodes. I’ll admit, it’s hit-or-miss. But it’s the most recently produced series, so it was written most like modern TV series go. So if you liked the action-y side of the new movies, I might get into Enterprise as your first series. Other answerers have made specific episode suggetions. Instead, if it was really the characters and their relationships and personalities that drew you in, I would go for the Original Series movies (there are six of them) next. Same characters, but in a different timeline with different circumstances. The characters are much more mature in their relationships to each other and just age-wise. In fact, the last couple touch on aging and retirement and change in the universe - but it’s not dull or depressing at all. About the Original Series movies - it’s generally accepted that the odd-numbered ones are bad, and the even-numbered ones are good. The first movie (just called Star Trek: The Motion Picture) can pretty much be skipped. The second, third, and fourth movies are kind of a unit and can be watched together. The second movie, The Wrath of Khan, is absolutely classic. It builds on a character from a single episode of The Original Series called Space Seed. The episode is less than an hour long and totally worth watching right before the movie.The third movie, The Search for Spock is … a little weird. But it follows from the second and sets a few things up for the fourth. I won’t say skip it, but it’s not the best.The fourth movie, The Voyage Home is just pretty fun. It’s more lighthearted and has tons of fun scenes. The crew time-travels back to the present day of 1986 when the movie was released, so there’s a bit of added fun there …The fifth movie - The Final Frontier - is … terrible. I’ve only watched it twice (which is saying something, because I’ve lost count of how many times I’ve watched the other Star Trek movies). It has one redeeming scene at the end with Kirk, Spock, and Bones sitting around a campfire singing Row Row Row Your Boat. Sorry if I spoiled the ending.And finally, the sixth movie, The Undiscovered Country. This is my favorite movie of all the Star Trek movies. I could go on forever about how great it is, but I’d recommend it to anyone. As for a series, if you really liked the character aspect of the new movie(s), I would obviously recommend The Original Series (TOS for short). As with the movies that came after it, it’s the same characters in the original timeline. Of course, TOS was made in the late 60’s, so beyond the expected differences in special effects, costumes, and what was considered “high-tech,” the series was created at a time when people didn’t record the episodes and didn’t buy them on DVD or watch them on-demand. There was really no such thing as a multi-episode story arc like has become common in TV shows now. Each episode is much more stand-alone and sometimes things stated in one episode may contradict something stated in a previous episode. So if you’re looking for something more character-focused that has season-long story arcs … go for Deep Space Nine. It has a different set of characters than the Original Series and tends to be a bit darker. Since it’s set on a space station rather than a ship that can move around, there tends to be less action and fewer space battles, but tons of character and relationship development. Now, the ones I haven’t mentioned yet … The Next Generation is my favorite series and the one I grew up on. When I was 3, I had a little Picard action-figure and a plastic combadge! Maybe it’s just my experience growing up with it, but I feel it’s the most “family-friendly” Trek there is. Captain Picard is not the kind to throw punches (and get his shirt torn) like Kirk was. He’s much more the philosopher, and episodes tend not to have as much fighting and shooting. The first few seasons have the grand optimistic view of the universe, I’d say even moreso than TOS, but they also tend to be a little on the dull side. There’s even a rather terrible teenage character that ends up in many episodes, even. The last few seasons get better, there is more drama and deeper examination of the issues the episodes present. The Next Generation movies are a pretty good bunch. The first, Generations, gives a send-off to Captain Kirk and tries to tie the Original to the Next Generation. First Contact finally tells the story of one of the most important events in the Star Trek universe’s history, and while it can be watched as a starting point to get into Star Trek further, I think it’s best enjoyed with some understanding of the characters and of the Borg. Insurrection is a great combination of all kinds of elements - you have an idyllic planet setting with little technology, you have fun, lighthearted moments, a child with a tiny adorable pet, you have big explosions and space battles, and you have great examination of deep issues. Voyager is the other series fans tend to ignore. I personally don’t hate it, but I don’t think it’s that great either. I haven’t watched nearly as many episodes of Voyager as of other series, but I would describe most of it as another new, “never-before encountered” problem every single episode. Finally, The Animated Series. I have seen fewer episodes of this than even Voyager. It came from the 70’s, and, as the name implies, is animated. The episodes are half-hour-long instead of hour-long and it only lasted for two seasons. According to Wikipedia, it “was the first Star Trek series to win an Emmy Award.” The animation takes a bit of getting used to, especially for fans of a show that has been overwhelmingly live-action. Basically, if you’re already a sci-fi fan, you probably know how it goes to “get into” a show or franchise. If you’ve been through it with another already, you know all about wading through the groan-worthy episodes, or the episodes that fans like to ignore, just to enjoy every piece of it. Star Trek is no different in this matter. There are absolute brilliant masterpieces and there are ones that leave you wondering what exactly happened that this would make in on screen. But in the end, it’s all worth it. Hope it helps! ",
            "date": "Answered September 8, 2016",
            "views": "61",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Arches",
                    "user_href": "/profile/Harry-Arches"
                },
                {
                    "user_id": "David Holliday",
                    "user_href": "/profile/David-Holliday-27"
                },
                {
                    "user_id": "Arpit Gurjar",
                    "user_href": "/profile/Arpit-Gurjar-2"
                },
                {
                    "user_id": "Bob Helme",
                    "user_href": "/profile/Bob-Helme"
                },
                {
                    "user_id": "Dar Brewster",
                    "user_href": "/profile/Dar-Brewster"
                },
                {
                    "user_id": "TJ Wilkinson",
                    "user_href": "/profile/TJ-Wilkinson-1"
                },
                {
                    "user_id": "Steve Conrad",
                    "user_href": "/profile/Steve-Conrad-7"
                },
                {
                    "user_id": "Christi Robards Wood",
                    "user_href": "/profile/Christi-Robards-Wood"
                },
                {
                    "user_id": "James Fisher",
                    "user_href": "/profile/James-Fisher-199"
                },
                {
                    "user_id": "John Cooper",
                    "user_href": "/profile/John-Cooper-243"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Harris",
                "href": "/profile/Jake-Harris-61"
            },
            "answer_text": "It depends on what you want out of Star Trek. If you're looking for fast-paced action that's basically just Star Wars with a Star Trek veneer, then the JJ Abrams films and Star Trek Discovery are your place to start. And probably finish, because Star Trek is NOT about the action—or the drama. If you're looking for the real Star Trek experience, start with The Next Generation. It's a fan-favorite, and for good reason. I personally rate it lower than other series, but for newcomers this is absolutely the bread-and-butter series. Star Trek: The Next Generation is great because of its extremely-diverse cast and characters, it's got lots of interesting episodes, and it is the prime example of posing questions to the audience that makes us think. I like to see Star Trek as a show that explores space to explore our humanity. We learn lots of great things about ourselves. We learn appreciation of other cultures, and an appreciation for our own. We get to see a bright future for humanity. It's really great to sit down and talk about this future, talk about the hard things in this life, but in a science fiction setting. If I were to recommend one show out of all the others, it would be this one—even if it personally isn't my favorite. If you want more of a serialized series, my go-to is Deep Space 9. Very well-written, DS9 continues The Next Generation’s style of exploring humanity by exploring space, but without the same planet-of-the-week style storytelling. Most of the show takes place on one space station—but that by no means makes it any less of a show! It's really great as it fleshed out the universe barely touched on by Next Gen, and it creates a really great plotline involving several different factions in the galaxy, and Sisko is an awesome Captain. It's definitely worth a watch. I also enjoy Voyager, but I understand that this really isn't everyone's favorite. I loved the Lost-in-Space aspect of the series, but more than that, Captain Janeway is my hero. When I was in middle school, I was bullied and teased for being a Mormon nerd in a Baptist-hick community. My life was miserable as a kid, and the ONLY thing that kept me from killing myself at that age was watching Voyager reruns on PAX TV. Janeway taught me to stand up for myself and my beliefs, even if I stood alone. She taught me to do the right thing, even if it was the harder decision. While I'm not a woman, I also think she stands as a shining example to women everywhere, because she not only confidently leads the ship, but doesn't need to prove herself better than the men on the show. She was equal to them, even if she was the superior. The men on the show didn't need to be stupid or incompetent for Kathryn freaking Janeway to shine, and I LOVED that. Compared to Michael Burnham (the female lead in Star Trek Discovery), Janeway wins any day because of who she is and how she got to sit in the Captain's Chair. So my personal favorite is Voyager, despite its bad reviews. So in sum: JJ Abrams movies/Star Trek Discovery - if you want action and derivative storytelling. Next Generation - if you want a good starting point that offers more than just entertainment. Next Gen deals with political and military type interactions between factions planets governments and peoples. DS9 - if you want Next Generation but with far more storytelling and connected episodes. DS9 deals with socioeconomic issues including trade religion cultures and practices. Voyager - I don't really have an argument for you to watch this one other than it means a lot to me personally. lol. Voyager deals heavily with morality and ethics. Many episodes explore gray areas of right and wrong and ends justifying means. These are just generalizations of topics. All three have a few episodes that dabble into the focus of the others. Hope this helps! Welcome to Starfleet! ",
            "date": "Updated February 24, 2018",
            "views": "168",
            "upvotes": " View 143 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff York",
                    "user_href": "/profile/Jeff-York"
                },
                {
                    "user_id": "Lauren Marcus",
                    "user_href": "/profile/Lauren-Marcus"
                },
                {
                    "user_id": "Barry Short",
                    "user_href": "/profile/Barry-Short"
                },
                {
                    "user_id": "Rocio Quispe-Agnoli",
                    "user_href": "/profile/Rocio-Quispe-Agnoli"
                },
                {
                    "user_id": "Dar Brewster",
                    "user_href": "/profile/Dar-Brewster"
                },
                {
                    "user_id": "Sean Quinn",
                    "user_href": "/profile/Sean-Quinn-41"
                },
                {
                    "user_id": "Ralph Browning",
                    "user_href": "/profile/Ralph-Browning-1"
                },
                {
                    "user_id": "Katherine V. Masís Iverson",
                    "user_href": "/profile/Katherine-V-Masís-Iverson"
                },
                {
                    "user_id": "Brandon Griggs",
                    "user_href": "/profile/Brandon-Griggs-5"
                },
                {
                    "user_id": "Ali Ontherooftops",
                    "user_href": "/profile/Ali-Ontherooftops"
                }
            ]
        }
    ]
}