{
    "title": "I'm 15. What can I do to improve my chances of becoming an astronaut? - Quora",
    "tags": [
        "Astronauts",
        "Space Travel",
        "Teenagers and Teenage Years",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Chapman",
                "href": "/profile/Dave-Chapman-18"
            },
            "answer_text": "First and foremost, stay in school! Study your ass off because only top tier students have any hope of reaching a 2nd round. Get a Phd at a reputable University, one of the sciences preferably and if you can handle it, get at least a Degree in another field, the more you do in your education field, the better! Did I mention to study your ASS off? I will again because this is what gets you in the door to start with. Stay in shape, physically and mentally! The astronaut program is a gruelling series of tests that takes about a year or so and they are TOUGH TOUGH TOUGH!!! If you have any phobias, water, heights, enclosed spaces, etc., you better get over them because they will be brought to the surface and you will fail if you freak out. It’s also not about the strongest physically, yes you need physical strength, but your mental endurance is probably even more important, being a problem solver is a huge plus…nobody is perfect at everything but you have to figure out how to get a job done when problems come up. You can’t be a quitter when the going gets tough, astronauts tough things out no matter what…work the problem! I also suggest you watch a TV series called Astronaut: Toughest Job in the Universe to see what these candidates go through and it’s very interesting to see who makes the final cut, you never would have guessed in the beginning. Good Luck! Stay in School! Don’t do drugs or drink alcohol (excessively)! Stay out of trouble! ",
            "date": "Answered April 27, 2020",
            "views": "622",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elina Suska",
                    "user_href": "/profile/Elina-Suska"
                },
                {
                    "user_id": "Paul Harris",
                    "user_href": "/profile/Paul-Harris-345"
                },
                {
                    "user_id": "Gary Mertens",
                    "user_href": "/profile/Gary-Mertens-1"
                },
                {
                    "user_id": "Intisar Wasek",
                    "user_href": "/profile/Intisar-Wasek"
                },
                {
                    "user_id": "Oisin McAlinden",
                    "user_href": "/profile/Oisin-McAlinden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Sherwood",
                "href": "/profile/Terry-Sherwood-6"
            },
            "answer_text": "When my son was in 7th grade, he scored really high on the school math tests and had expressed an interest in a career in artificial intelligence as an adult. He is 42 now, so that was a long time ago, but what I did led him to his current role as a senior game designer at a major computer game company. His career dreams had evolved after I did what I did, but it still led him to the job he loves and he is well paid for his skills. I picked up the phone and called MIT. I asked for the math department and asked for 7 grade activities to enhance his math skills. Then I spoke to the robotics and engineering folks and got their take. Then I called Poly Tech and other universities known for their innovation in math-based design skills. There were no common math and science enrichment programs then. They all agreed that I should buy him computer-based simulation games that developed math, analytical, simulation and creative skills. At the time, Sim City had just come out and other games were following quickly. I upgraded my starter computer and bought simulation games that the whole family loved, to include his sister who now teaches school teachers how to integrate STEM into their programs at a school district level. Again, those calls were 30 years ago and so much has developed since, but they are both cutting edge and innovative now. I suggest you do the same. Call NASA. Google “Space Science Universities” and call them all, but ask for the department heads not the admissions staff. Look into NASA’s Space Camp. It says 3 of its alumni have gone into space as astronauts. I am sure that many other have found great jobs in the industry as well. Be sure to stay flexible, open, and respectful and remember that it took some 40,000 employees at a variety of companies to land our first man on the moon. I am proud to say that my father was one and that he led the computer test team for Rockwell for that flight during his 30 year industry career spanning the Minuteman Rocket to the Challenger series. Stay flexible because, as is shown with the movie Hidden Faces, it takes a lot of diverse mindpower to lift off and your interests might spin you into a new orbit of technological design and innovation for other types of space travel. My Dad loved to innovate and I grew up in a house building electronic devices before they were released at a consumer level (like my first home computer). If you love the science, always do what you can to pick up every skill or new angle that will expand your knowledge and ability to connect two dots that might seem totally unrelated but suddenly open the door to something totally unanticipated like teleportation or faster than (Fill in the blank here). Dive in and don’t limit the scope yet. But do immerse. And as I told my quiet math-based son… you can’t sell an idea if you don’t learn to communicate well. He then immersed into both Speech & Debate and ComedySportz and made lifetime friends with lots of humor. I am sure it also helped him with his interview skills while on his career path. ",
            "date": "Answered April 16, 2019",
            "views": "641",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Oisin McAlinden",
                    "user_href": "/profile/Oisin-McAlinden"
                }
            ]
        }
    ]
}