{
    "title": "I'm looking to get a MIDI controller for programming drums and to trigger samples. What's the best-for-value, cheap MIDI controller? - Quora",
    "tags": [
        "MIDI Controllers",
        "MIDI",
        "Keyboards (instrument)",
        "Electronic Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randy Maugans",
                "href": "/profile/Randy-Maugans"
            },
            "answer_text": "You did say cheap. Try an M-Audio Trigger Finger:  16 velocity and pressure-sensitive pads 8 assignable knobs 4 assignable faders Pre-programmed maps for Live, Reason, GM Drum, XG Drum, and iDrum Velocity control including fixed velocity mode Program/bank change capability Powered via USB connection or optional DC power supply 16 MIDI presets Programmable with free Enigma librarian software 3-digit LED display Class compliant with Windows XP and Mac OS X Both MIDI In/Out and MIDI over USB. They are discontinued by M-Audio, but lots around on Ebay used. I have owned mine for 5 years, used it for everything from actual drum programming to DJing clips in Ableton, pad triggers, even as a MIDI controller for sound recording. Very versatile, extremely durable and compact, and still enjoys driver support on OSX 10.9 (Mavericks) and Windows 8. Also shipped with M-Audio Enigma software, for custom presets. This was a great value new back in the day, and still remains a fairly unique instrument. ",
            "date": "Answered June 22, 2014",
            "views": "899",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Cheney",
                    "user_href": "/profile/Brian-Cheney"
                },
                {
                    "user_id": "M. Johnson",
                    "user_href": "/profile/M-Johnson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emiliano Grilli",
                "href": "/profile/Emiliano-Grilli"
            },
            "answer_text": "I can't speak for the other two but I own the lpd8, and while it's cheap and very small to carry, the pads are not very sensitive. You have to hit them quite hard and this limits somewhat the precision and range of velocities. There is a simple mod in which you put a layer of tape under the pads. It makes them slightly better. Later I bought an used korg pad kontrol and it has vastly better pads. I think however that it's no longer produced, but you can find it used. ",
            "date": "Answered July 3, 2014",
            "views": "389",
            "upvotes": "0"
        }
    ]
}