{
    "title": "I'm totally new at this. How can I develop Android or Windows apps? - Quora",
    "tags": [
        "Windows Phone App Development",
        "Android Application Developers",
        "Android Application Development",
        "Android Applications",
        "Android (operating system)",
        "Mobile Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandan Sinha",
                "href": "/profile/Chandan-Sinha-8"
            },
            "answer_text": "Welcome to the Developer's World! Disclaimer - Its good that you've decided to develop applications for different operating systems and look for earning money through it. May be you're genuinely interested in it or may be heard it from somewhere that making apps promises you hefty money. Whatever it be but just keep in mind - 'Whats most important is that you have genuine interest in whatever you do' because making apps could turn out to be tedious task as you go from bootstrapping to finalizing your product.  Having said that, here are some basic things to get you started. I'm addressing both you aspects of development and earning - 1. Android Apps- Android apps are generally made in JAVA language, though at advance level you can use Python or C#. So first get acquainted with JAVA and be good at it. Coming to Android App development, you need to have Java Runtime Environment (JRE) installed on your computer for running the Java bytecode on JVM. You can easily download it from Java website (Page on java.com). Moreover, you also need JDK (Java SE - Downloads) and android SDK (Download Android Studio and SDK Tools) that include ADT (Android Development Tools) bundle and text editors preferably Eclipse. 'Now that you've prepared you ground, you're ready to build upon it'. Since, explaining all the technical intricacies is not feasible here and its better that you go on their developer sites and start from the very basic. Website - Android DevelopersYou need not to have an Android phone to watch the development progress as SDK is provided with emulators for various android devices of different screen sizes so that you can keep check over the Responsive Design. I personally find that their developers site (or any developers site for that matter) surpasses any book in terms of details illustrated for the ease of newbies. Step by step, it will take you from displaying \"Hello World!\" on you android mobile to developing sophisticated graphic apps. After all this Android Enthusiasts Stack Exchange is always there to help you. 2. Windows Apps - Unlike Android apps, Windows Apps could be made in several programming language like C++, C#, Microsoft Visual Basic, etc. Moreover, you can also make JavaScript apps for windows using various frameworks and tools (WinJS - Windows app development). Since, its not a standalone programming language, so you'll have to use it with HTML and CSS. Also you will have to download their SDKs (sometimes specific if you're using any particular platforms like Ripple, BlueMix, etc.) and other softwares to start development. Get started - Windows app development3. Earning Money- Making apps out of self-interest would greatly help you through learning process. Once you get good at it, many doors get opened to provide you with remuneration for your hard work- 1. Hire Freelancers & Find Freelance Jobs Online - Develop apps according to specific need of others. Get your freelancing jobs involving app development like for a startup. Just search for it on Google and you would find various links e.g. Android App Development Jobs 2. Many programming platforms like topcoder or various Hackathons organize competitions for app development promising heavy sum of money. Constantly look through them for updated contests and put you whole-hearted effort in it. For example, for developing iOS apps, so far Objective-C was being used but recently Apple came up with a new customized programming language 'Swift'. Soon after release TopCoder held a contest Kicking Off our $500K Learn Swift Series with big prize money to develop applications in swift. 3. Make your own innovative apps and publish them on play store. Keep it free initially for testing, if its a hit then apply some nominal charges. But before you launch, why not go through a checklist to see if its perfect - Launch ChecklistLet alone users decide if its interesting! Hope it helps :) ",
            "date": "Answered January 7, 2015",
            "views": "791",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhavs Reddy",
                    "user_href": "/profile/Bhavs-Reddy"
                },
                {
                    "user_id": "Boopalan Cool",
                    "user_href": "/profile/Boopalan-Cool"
                },
                {
                    "user_id": "Suresh Kumar",
                    "user_href": "/profile/Suresh-Kumar-399"
                },
                {
                    "user_id": "Naveen Sn",
                    "user_href": "/profile/Naveen-Sn-1"
                },
                {
                    "user_id": "Stephen Yvonne",
                    "user_href": "/profile/Stephen-Yvonne"
                },
                {
                    "user_id": "Om",
                    "user_href": "/profile/Om-432"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sujay S Kumar",
                "href": "/profile/Sujay-S-Kumar"
            },
            "answer_text": "Android requires you to know Java and C# is needed to develop Windows 8 apps.The Android Developer site has detailed step by step instructions on how to set up the Development Environment on your machine and on almost all the features that you would like to implement in your app.I don't recommend using books in order to develop apps. It is an evolving area and I have found most of the books to be out dated at the least. Use Google or Stack Overflow. They are up to date and contain answers to most of your questions. If you cannot find your question, you can always ask one yourself and you can be assured that someone will help you out almost immediately.For Windows 8 app development, there are extensive videos and tutorials covering all the intricacies at msdn website. If you cannot find what you were looking for, there's always Stack Overflow.In order to make money out of your app, you can always make it paid. Although this approach is ineffective if you don't already have a brand image. You can make your app free but certain features can be paid, the strategy used by most apps.Or you can make money out of ads in your app. For this to work, your app should be smooth and flawless so that the user does not get frustrated at the lack of responsiveness of your app. Ads tend to make your app slow.Welcome to the world of app development. Best of luck! :P ",
            "date": "Answered January 9, 2015",
            "views": "596",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vinita Atre",
                    "user_href": "/profile/Vinita-Atre"
                },
                {
                    "user_id": "Shreyas Patel",
                    "user_href": "/profile/Shreyas-Patel-23"
                },
                {
                    "user_id": "Mahadeva S Sarma",
                    "user_href": "/profile/Mahadeva-S-Sarma"
                },
                {
                    "user_id": "Ankit Madaan",
                    "user_href": "/profile/Ankit-Madaan-5"
                },
                {
                    "user_id": "Pratik Mundada",
                    "user_href": "/profile/Pratik-Mundada-4"
                },
                {
                    "user_id": "Abhinav Dubey",
                    "user_href": "/profile/Abhinav-Dubey-7"
                }
            ]
        }
    ]
}