{
    "title": "I'm 15 years old, and I want to be an astronaut when I am old enough. What can I do to higher the chances now? - Quora",
    "tags": [
        "Astronauts",
        "Teenagers and Teenage Years",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Oshaughnessy",
                "href": "/profile/Mike-Oshaughnessy-7"
            },
            "answer_text": "Since you used astronaut, I’m assuming you are an American. Get into STEM immediately.Apply for one of the service academies. The US Air Force Academy or Annapolis seems to breed a lot of astronauts.Graduate school is a must. Again, something in the STEM field. Medicine is also another field to look into.Learn a foreign language. Due to our program shutdown and the need to use the Soyuz platform, learning Russian would be helpful.Check out astronaut profiles on NASA’s webpage. Not only read their biographies, but also check out their Twitter feed. They would be the best mentors to get you underway.Good luck! ",
            "date": "Answered June 22, 2019",
            "views": "914",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sha Ark",
                    "user_href": "/profile/Sha-Ark"
                },
                {
                    "user_id": "Qwerty Qwert",
                    "user_href": "/profile/Qwerty-Qwert-43"
                },
                {
                    "user_id": "Zac Jefords",
                    "user_href": "/profile/Zac-Jefords"
                },
                {
                    "user_id": "Burton Ruan",
                    "user_href": "/profile/Burton-Ruan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Sherwood",
                "href": "/profile/Terry-Sherwood-6"
            },
            "answer_text": "Call NASA and ask someone in Human Resources that question. Even ask to speak to an astronaut. The worse you can hear is a no. Ask them who else might be good people to talk to about it. Just don’t start locally. They will eventually refer you to your local colleges or some of the ones with heavy aerospace degrees. You asked to late to check out their space camp. That would have been fun! ",
            "date": "Answered June 29, 2019",
            "views": "261",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pete Laberge",
                    "user_href": "/profile/Pete-Laberge"
                }
            ]
        }
    ]
}