{
    "title": "I've been playing the violin for almost 5 years now but I still have four fine tuners. How long do you need to play the violin to only have one fine tuner? - Quora",
    "tags": [
        "Playing the Violin",
        "Violinists",
        "Learning Violin",
        "Violins",
        "Learning to Play Musical Instruments",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Streich",
                "href": "/profile/Rachel-Streich"
            },
            "answer_text": "Having fine tuners on your violin has nothing to do with how well you play and more to do with what kind of strings you have on your violin. Steel strings, whether they’re solid steel core or steel rope-core, are far more sensitive to small turns of the tuning pegs, and it’s difficult or impossible to get them precisely tuned using just the pegs on the peghead. That’s why violins strung with steel strings have fine tuners on all four strings. Perlon (nylon-core) or gut strings, on the other hand, require larger turns of the pegs to tune them, and can be tuned quite accurately using just the pegs, as long as the pegs are properly fitted and turn smoothly in the peghead. They don’t need fine tuners. But even on a violin with perlon or gut strings, the E string is almost always a steel string, and therefore has a fine tuner in the tailpiece. Most classical players use gut or perlon strings, with a steel E string, and therefore have just the one fine tuner on the tailpiece. Most country, bluegrass, old-time and folk players use steel strings, and therefore have fine tuners on all four strings. ",
            "date": "Answered October 18, 2020",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anthony Zbikowski",
                    "user_href": "/profile/Anthony-Zbikowski"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                },
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                },
                {
                    "user_id": "Saga Arola",
                    "user_href": "/profile/Saga-Arola"
                },
                {
                    "user_id": "Carl Mally",
                    "user_href": "/profile/Carl-Mally"
                },
                {
                    "user_id": "Elvin Sudiro",
                    "user_href": "/profile/Elvin-Sudiro"
                },
                {
                    "user_id": "Tamara Vardo",
                    "user_href": "/profile/Tamara-Vardo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Holmén",
                "href": "/profile/Robert-Holmén"
            },
            "answer_text": "Fine tuners are the way to go if you value your time (and care about tuning). Fine Tuners: To Use or Not to Use? I’ve tried playing a cello with no fine tuners. That was madness. I’ve often read people claim that fine tuners dampen the sound by adding weight to the tailpiece but i doubt that has ever been demonstrated in a blind test. Many accomplished violin players have gone to mechanical pegs which hide the fine tuner inside the peg and eliminate the need for any fine tuners on the tailpiece. mechanical violin pegs - Google Search ",
            "date": "Answered October 18, 2020",
            "views": "68",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                },
                {
                    "user_id": "David Ezell",
                    "user_href": "/profile/David-Ezell-9"
                },
                {
                    "user_id": "Elvin Sudiro",
                    "user_href": "/profile/Elvin-Sudiro"
                }
            ]
        }
    ]
}