{
    "title": "If a band is playing 5 consecutive nights in my town, which day should I attend? - Quora",
    "tags": [
        "Swing Dancing",
        "Live Music",
        "Concerts",
        "Bands (music)",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scot Morgan",
                "href": "/profile/Scot-Morgan"
            },
            "answer_text": "The one that is not sold out and is most convenient to you. If you are asking which one is going to have the best performance, only the band would know that, but they booked 5 nights because they are going to sell out at least 4 of them. Garth Brooks does that, he sets up 3–5 consecutive event dates at same location, but doesn’t open them for sales until the previous one has sold out. He does this to limit scalping, if there are enough shows available for the number of fans interested the resellers lose value on the tickets they bought meaning they wont be able to sell them as profitably as they could have. He is a unique case, as he personally attends all calls involving his shows, and is very active in making sure his fans get the best experience they can. I don’t listen to country music but I respect this man, and will actually be working his show in Gainesville this weekend. ",
            "date": "Answered April 16, 2019",
            "views": "211",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sameh Khan",
                    "user_href": "/profile/Sameh-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve-Irwin-Miller",
                "href": "/profile/Steve-Irwin-Miller"
            },
            "answer_text": "Not the first but definitely the last! (If you can get tkckets.) Inbetween is OK usually, if that's all you can get. (Of course some bands, were so great “live”, like the Who even after Moon died in the 80′s, I’d go see them consecutive nights! I had seen the original Who, incredible live, with the Clash before, in an “Oakland Colosseum, Day on the Green\"!) ",
            "date": "Answered April 15, 2019",
            "views": "19",
            "upvotes": "0"
        }
    ]
}