{
    "title": "If I want to listen to great classical music, what should I listen to? - Quora",
    "tags": [
        "Music Suggestions",
        "Classical Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Geiger",
                "href": "/profile/Erik-Geiger"
            },
            "answer_text": "I’m gonna skip listing any ‘hits’ here. I’m sure there are others that will list the warhorses of popular classical music, almost all of them symphonic, which upon listening will no doubt recall associations from pop culture. Beethoven: If you only listen to one set of works by Beethoven in your life, they should be the late string quartets, Opuses 127, 130, 131, 132, 133 (Grosse Fugue) and 135. This is some of the finest music ever written, and quite possibly that will ever be written. Not ‘easy’ pieces to get into initially, but your patience will be rewarded by insight into Beethoven’s sublime musical thoughts on the human condition. This is far more profoundly spiritual music than anything ever written for the church! Throw in the Opus 74 “Harp” quartet too for good measure. The Grosse Fuge Op.133 was so far ahead of its time musically, it confounded performers and listeners alike until the end of the 19th century. The composer Igor Stravinsky (who was never known to say nice things about any music other than JS Bach) stated, \"it is an absolutely contemporary piece of music that will be contemporary forever.\"  This set of recordings by the Tokyo Quartet is my favorite, and as fine a set of performances as you’ll find anywhere. Bartok: Bela Bartok seems to have suffered a lack of proper recognition in his lifetime, let alone most of the 20th Century, which is unfortunate, since he in some ways could be regarded as the Beethoven of the 20th century. A brilliant composer and musicologist, he bridged the realms of folk music traditions with modern compositional techniques and styles, providing the emotion and raw energy that keeps this very ‘modern’ sounding music relatable. His magnum opus “Concerto for Orchestra” is a must listen, as is the orchestral pantomime “The Miraculous Mandarin”.   Shostakovich: Finally, given the way the world is shifting again towards populism and authoritarianism these days, I think everyone owes it to themselves to get familiar with the works of Dmitri Shostakovich, in particular his 8th String Quartet and 4th Symphony. In each, he perfectly captures the terror and horrors of authoritarian abuse at the hands of totalitarian regimes. This is music devoid of ideology and simply the expression of the horror of the individual under the jackboot of the regime. Listen and take heed.   Next up: Debussy, JS Bach, Schubert, Stravinsky, Dvorak, and the lesser known likes of Zdenek Fibich and Joachim Raff! ",
            "date": "Answered October 19, 2018",
            "views": "472",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Turner Cheese",
                    "user_href": "/profile/Turner-Cheese"
                },
                {
                    "user_id": "Janeinar Slethei",
                    "user_href": "/profile/Janeinar-Slethei-1"
                },
                {
                    "user_id": "Terry Johnson",
                    "user_href": "/profile/Terry-Johnson-343"
                },
                {
                    "user_id": "Joris Visser",
                    "user_href": "/profile/Joris-Visser-1"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hongwan Liu",
                "href": "/profile/Hongwan-Liu"
            },
            "answer_text": "I particularly agree with Partin Pruthi's comment about good songs and bad songs in classical music. Unlike other genres of music, the overwhelmingly famous pieces aren't usually the ones that you come to like. In my opinion, pieces like Fur Elise or either one of the two most overplayed Chopin nocturnes do not represent the pinnacle of classical music achievement, and failure to get any profound experience out of them, well, isn't really surprising.  I guess what I'm saying is that great classical music is intensely personal, which makes it harder to come by. A great deal of patience is required to find what you like: sometimes you can listen to a piece in passing literally hundreds of times before you find something incredible about it.  To find your own set of great classical music, begin from the works of the most famous composers that anyone can name. These are composers who have written many works that many people consider great. Start with short works, or just segments of longer works. Don't worry if particular pieces, or even composers, don't do anything for you: I began listening with no appreciation whatsoever of Bach, Liszt and Brahms, as misguided as that sounds today. Find something you enjoy, for whatever reason, and then find more of the same. Begin with trivial reasons to enjoy classical music (you may even just like a few seconds out of several minutes of one piece), continue to listen to more music, and don't forget to re-listen to stuff you've heard before. Read about classical music and its composers: who they were, how they lived and why they wrote. Eventually (perhaps after years) you will become well-acquainted with a respectable set of classical works that you personally find moving, inspiring and profound. I personally think the effort is well worth it! ",
            "date": "Answered June 6, 2011",
            "views": "882",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shane Soo",
                    "user_href": "/profile/Shane-Soo"
                },
                {
                    "user_id": "Brady Chiu",
                    "user_href": "/profile/Brady-Chiu"
                }
            ]
        }
    ]
}