{
    "title": "If I use music (as background music) behind the my voice for my YouTube videos, does this make copyright issues? - Quora",
    "tags": [
        "Background Music",
        "YouTube Music (website)",
        "Music Videos",
        "Copyright Infringement",
        "Copyright Law",
        "Videos",
        "YouTube Videos",
        "YouTube",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Ruddick",
                "href": "/profile/Thomas-Ruddick-1"
            },
            "answer_text": "If the music is not public domain or used by permission, yes. If there are copyright issues, however, the only way it will bear consequences is if the copyright owner reports it to YouTube. Then YouTube is legally required to remove the infringing material and will put a copyright strike on your record—too many copyright strikes and you lose your account. Note that it also would be possinle for them to come after you with a lawyer, though I doubt they’d want to lose money like that. Now, if you use a recording of a public domain work, the recording itself is performance copyrighted, which is another level of complication. If you’re using a piece of classical music, it may be difficult for anyone to claim that it’s from a particular recording and so you’d probably not be reported. ",
            "date": "Answered July 6, 2020",
            "views": "15",
            "upvotes": " Answer requested by Ashloof Ahamed",
            "upvoters": [
                {
                    "user_id": "Staffan Vilcans",
                    "user_href": "/profile/Staffan-Vilcans"
                },
                {
                    "user_id": "Ashloof Ahamed",
                    "user_href": "/profile/Ashloof-Ahamed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Nistler",
                "href": "/profile/Michael-Nistler-1"
            },
            "answer_text": "Great question! Sadly, just because the background music was incidental, accidental, inadvertent or even unwanted “noise,” YouTube Content ID will find a match from its database and handle it exactly the same way as a dishonest YouTuber deliberately using copyrighted music or video to promote their channel. Sooner or later most everyone will innocently make this mistake. Five years ago I was filming a sunrise shoot for a hot air balloon event and got some great footage at sunrise when the balloons were launching right over my head (I actually had to duck when it started moving sideways at takeoff). It was a great shot and in the background among the thousands of spectators, the national anthem was playing. I was getting lots of views for the next several years, no problem at all. Then I get a notice from YouTube the distant background music was copyrighted - huh, really? And so the content “owner” instructed YouTube that when their music was played without licensing, YouTube should silence the music. Okay, that would have been fine, but now there was several minutes of dead space - no hot air balloon thrusting audio from the propane burners, no audience clapping, hooting and hollering - just silence. Of course, it could always be worse - no takedown, no copyright strike and a good lesson learned to be extra careful when you hear recorded music in the background! Happy Trails, Michael California Travel VideosBridgeHands ",
            "date": "Answered July 6, 2020",
            "views": "48",
            "upvotes": " View 2 Upvoters "
        }
    ]
}