{
    "title": "If I walk into Guitar Center, will they let me play their expensive guitars if I ask politely? - Quora",
    "tags": [
        "Guitar Center",
        "Acoustic Guitars",
        "Electric Guitars",
        "Guitarists",
        "Playing Guitar",
        "Guitars",
        "Musical Instruments",
        "Manners and Etiquette",
        "Music",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Mayer",
                "href": "/profile/Andrew-Mayer-45"
            },
            "answer_text": "Yes, they will. Nearly any guitar store will. If by “expensive”, you mean something that is actually cheap, anywhere from an $80–150 starter guitar, to a midlevel nice guitar, at $200–800, then, yes, they’ll let you play those. If you mean by “expensive,” a $1000 and above, really nice guitar, some of the most expensive models are set aside, in a particular spot, and some stores will only let you play those, only if you say you are “serious about buying them”. Then, expect a serious pitch to follow, for you to part with your cash, card or check, to buy it. Because it’s the greatest, and worth it, and you looked at it. Anyway, it really is cool to look at, and play, an expensive guitar, to see what the fuss is all about. In some cases, it can just be the inlayed pearls are very fancy and pricey. In most cases, though, it’s a really well made instrument, that sounds amazing, and plays beautifully. Some stores won’t let you play the really expensive models, without you proving you have the income to buy them, and are really serious about doing that. If you are, they will let you play them, usually supervised by an employee watching you, or even the owner. ",
            "date": "Answered October 31, 2019",
            "views": "769",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angela Chen",
                    "user_href": "/profile/Angela-Chen-135"
                },
                {
                    "user_id": "Paul Reynolds",
                    "user_href": "/profile/Paul-Reynolds-50"
                },
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Sinn",
                "href": "/profile/Eric-Sinn-2"
            },
            "answer_text": "Yes. It is a business. Dress a little bit like you can afford it - that would help. I don’t mean they are shallow. It is a business - they are trying to feed the family too. Their goal is to sell - or to induce a future sale by being nice to you in the hope you will buy - or you would recommend others to buy. Show some respect at your end to show you are serious about evaluating a guitar. Don’t wear clothes that would dimish the value of guitars. Big belt buckles, denim jackets with rows of metal buttons, and metal buttons on the end of the sleeves, sweaters with hard objects like pearls and beads and stuff; big scratchy metal watches and rings, giant scratchy necklace. Tank tops that allow you to get sunscreen all over the wood. You are asking for it. The best clothing is a plain sweater that cover the belt buckle. Show some legitimate interest. Don’t say, I want to touch a $6000 or $16,000 guitar or touch the most expensive one you have.. Can you show me the most expensive thing you have? Say I really want to see the Les Paul … whatever whatever reissue. etc. because I want to see if it sounds different enough from the standard Les Paul. I am trying to decide which one to get. In the end, it is a private business and they are trying to make money. They don’t have to show you if they think it will not produce a sale but it would be dumb for them not to show you. Because it may trigger a need - an impression - and one day you will save up to buy it. The staff have always been friendly to me. In fact, the staff in all the music stores have been friendly to me. They don’t care if you can play - they care if you can pay. The corollary is that it makes more sense to show it to a rich sincere buyer who cannot play verses to some talented but disinterested person. It is OK to say you cannot play but want to see one up close in case you want to buy one in the future. As a courtesy to the rest of us people interested in guitars, regardless of how the guitar sounds, say it sounds great and you wish to buy one in the future. A cheap shot will harden the salesman - and the rest of us will have a harder time trying an expensive guitar. I would add that for some guitars, there is really no reason to show it to you unless you have money. Like there is no reason to play the Beatles autograph guitar. There is no reason to play the Martin D50 with all the pearl inlays if there are plenty of Martin D35, D28 etc which should sound about the same. So you have to come up with a reason. “I heard the special edition has a hand-wound pickup that works with the special bleed circuit that gives it more twang, does it really sound different?” I am not involved in any way with the music or guitar business. ",
            "date": "Answered October 31, 2019",
            "views": "640",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amanjot International Music School",
                    "user_href": "/profile/Amanjot-International-Music-School"
                },
                {
                    "user_id": "Christopher Pellerito",
                    "user_href": "/profile/Christopher-Pellerito"
                },
                {
                    "user_id": "Peter Shearer",
                    "user_href": "/profile/Peter-Shearer-2"
                },
                {
                    "user_id": "James Brodski",
                    "user_href": "/profile/James-Brodski-1"
                }
            ]
        }
    ]
}