{
    "title": "If my band plays indie and alt rock, what music producers should I be checking out to work with? - Quora",
    "tags": [
        "Alternative Rock",
        "Music Producers",
        "Independent Music",
        "Music Suggestions",
        "Music Production",
        "Rock Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cameron Lister",
                "href": "/profile/Cameron-Lister"
            },
            "answer_text": "Me!  Hahaha... seriously though, Jeff has it right.  Look at the records you love and get in touch with the people who were involved in crafting them.  Maybe the producer is too busy/expensive but maybe the guitar player on the record is doing more production work and could be the right person for the gig.  Reach out, have a discussion, go for a beer or a coffee... you'll find out pretty quickly who would be a good fit and who wouldn't. ",
            "date": "Answered June 16, 2012",
            "views": "506",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jared Simcox",
                "href": "/profile/Jared-Simcox"
            },
            "answer_text": "A good start is to find an accomplished artist in a similar genre to you guys who you have a strong relationship with, ideally they would have some experience in the studio too. The role of the producer is to help you embellish your music, identify ways to make the final recorded product better and offer some creative input. Using someone who's music you like and feel is really well done is a good way (and cheap) to inject a 'producer' in to your next recording project. Alternatively you can search for career producers online (reverbnation.com is a good place to start) or, if you want to spend a little more you can approach high profile producers such as (in your genre) Greg Haver or Clint Murphy. Hope this helps. ",
            "date": "Answered April 4, 2011",
            "views": "720",
            "upvotes": "0"
        }
    ]
}