{
    "title": "If one majors in music in college, with the primary instrument being classical guitar, what are the best career choices? - Quora",
    "tags": [
        "Classical Guitar",
        "Classical Music",
        "Guitars",
        "Musical Instruments",
        "Career Choices",
        "Music",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Ruddick",
                "href": "/profile/Thomas-Ruddick-1"
            },
            "answer_text": "OK, let’s say you earn a BM in classical tguitar. If your program permits you to play only classical (with of course the customary piano proficiencyy requirement and probably classes in woodwinds, brass, percussion and other strings) then your employment prospects will be somewhat slim. You might get gigs playing at upscale events, but for most gigs they want an elecric guitar nowadays. I think most good conservatory programs will encourage you to learn classical and electric, and will encourage advanced right-finger technique but also plectrum. If you develop those skills toa professional level you’ll be eligible for employment in pit orchestras in musicals, wedding reception bands, rock and country groups, the whole spectrum. Most performing musicians alsupplement their incomes by teaching lessons or working in instrument repair or sales. If you go one to a Master of Music degree you might get on part-time at a college teaching in their music program. Now the question arises: do you think you’d enjoy a life where you devote hours evcery day to practicing classical and electric? Are you going to be happy no matter what music you get hired to play? The great jazz trumpeter Lester Bowie said that he always told his students “First, you must learn to feed yourself with your horn”—by which, he clairfied, you have to be ready and willing to take any paying gig you can land—play classical, rock, dixieland, country, TV commercials, auto shows, political conventions (even if you don’t like the party), what-have-you. After you have estab lished yourself and are working steadily as a professional, you may start to be choosy and focus on your personal vision of art. Some frew people cicumvent that process and get to start a career as a purely classical guitar virtuoso from the outset, but the odds of that happening are slightly less than the odds of any random high school quarterback getting to start in the NFL. I can testify that as a music majjor, I figured out that I would not enjoy that kind of career, so for that and other reasons I switched to a music history major, double-majored in theatre, and went on to a PhD in communication—having prepared myself as a generalist, I got into a mid-sized community college where my ability to teach a broad range of classes so they found me useful, if another faculty member suddenly was unavailable they could slot me in. I still got to perform music as an avocation and I got to be choosy about what I played. One more bit of unsolicited advice—music is one of the fewe degree programs where the quality of the school matters for a bachelor’s degrree (for the more common BA/BS degrees in, say, English or chemistry or psychology or math, the collerge really doesn’t matter—it does get important for grad schools). So if you can audition your way into Berklee or Julliart or Oberlin, it’s probably well worth the cost—but a program at a respected state university will generally be of good quality if that’s yor option. Whatever you do, avail yourself of as much financial aid in the form of grants and scholarships that you may, for you’ll want to avoid piling up more debt than you can manage. Hope you find this response helpful. ",
            "date": "Answered February 25, 2020",
            "views": "196",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AJ Crawshaw",
                    "user_href": "/profile/AJ-Crawshaw"
                },
                {
                    "user_id": "Daniel Yarritu",
                    "user_href": "/profile/Daniel-Yarritu"
                },
                {
                    "user_id": "Tom Gwilt",
                    "user_href": "/profile/Tom-Gwilt"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                },
                {
                    "user_id": "Timothy Heavner",
                    "user_href": "/profile/Timothy-Heavner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "Other than continually scrambling for paying students and trying to find whatever low paying classical guitar performance gigs you can? Starbucks has good employee turnover. With a bachelor’s degree in classical guitar performance, you can probably find a job making coffee at one, and they might even let you perform there when you’re not working. Stick around a few years, and you’ll be manager. I’ll just rehash what my guitar teacher (who has a PhD in classical guitar performance and a teaching gig in guitar at a known University program). Slight paraphrase: “Getting a degree in classical guitar is like taking a vow of poverty. You have to do it because you love it, with no expectation you’ll ever be able to make money at it”. I could go on, but I think I’ve made the point. You love classical guitar? Great. Get a degree in finance, become an accountant, then play as much classical guitar as you like. You probably won’t be as accomplished a guitarist as you would be with 4 years of study, but you will be able to pay your rent consistently. There is plenty of good information in Todd Tipton’s rant. . .(if you dig it out). Responding directly I’ll add one more point. My teacher (who is in a position to know) told me that last year there were a 4–5 posted jobs for PhD level guitarists IN THE ENTIRE UNITED STATES. That isn’t what you asked about, but it does say something about the marketability of a PhD in guitar. ",
            "date": "Answered February 25, 2020",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                }
            ]
        }
    ]
}