{
    "title": "If one person watches the same YouTube video twice, does it count it as one or two views? - Quora",
    "tags": [
        "Online Videos",
        "YouTube Views",
        "Streaming Video Content",
        "Online Video",
        "YouTube Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anshul Gumber",
                "href": "/profile/Anshul-Gumber"
            },
            "answer_text": "Yes, Let me explain you the simple rules of youtube count. Youtube treats a view as a count when you play video for 30 seconds or more. Now if a video is shorter than 30 seconds so youtube will treat it as count on complete video play . Like video is 20 sec long so have to watch for 20 sec to get a view. Youtube never stops anyone from viewing a video until its private or blocked in a country or or have +18 content. That means even owner can watch that video for 30 times . But it is against the ads clicking by the owner . Replaying a video would give a count . If you watched 50 times a video so 50 views would be added to the total count. One more thing that youtube keeps that 30 sec playtime to treat as a count is because no one could completely judge what a video contains with a thumbnail . In that case you need and according to a survey a normal user need 20–30 sec to judge whether to watch or not . And its total 30 seconds count if you skipped to the middle part and watched for 20 sec and then skipped to last part and watched for 10 sec so it will be treated as count. Update 2 Spam Note: If you continuously play a video alot on repeat in a row, youtube will stop counting views on that video after sometime to protect spam even though you are good there (This happens for sometime then like next day you watch again your views will count again) Hope this helps . Do Upvote if it was helpful. Update : Thank you guys for your upvotes :) ",
            "date": "Updated February 6, 2019",
            "views": "6445",
            "upvotes": " View 4K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jose Marte Toroy",
                    "user_href": "/profile/Jose-Marte-Toroy"
                },
                {
                    "user_id": "Breno Araújo",
                    "user_href": "/profile/Breno-Araújo-5"
                },
                {
                    "user_id": "Psy Surendhar",
                    "user_href": "/profile/Psy-Surendhar"
                },
                {
                    "user_id": "Harsh Modi",
                    "user_href": "/profile/Harsh-Modi-43"
                },
                {
                    "user_id": "Rakesh Sreeram",
                    "user_href": "/profile/Rakesh-Sreeram"
                },
                {
                    "user_id": "Andrea Freeblee",
                    "user_href": "/profile/Andrea-Freeblee"
                },
                {
                    "user_id": "Sally Sekgobela",
                    "user_href": "/profile/Sally-Sekgobela"
                },
                {
                    "user_id": "Paresh Pradhan",
                    "user_href": "/profile/Paresh-Pradhan-5"
                },
                {
                    "user_id": "Khan Tz",
                    "user_href": "/profile/Khan-Tz"
                },
                {
                    "user_id": "Riaz Uddin",
                    "user_href": "/profile/Riaz-Uddin-74"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Parker",
                "href": "/profile/Michael-Parker-331"
            },
            "answer_text": "This will be counted as 1 view. Contrary to the popular belief that YouTube will count multiple views if you keep playing the video and complete at least 30 seconds. YouTube's definition of a view is a viewer initiated intentional play of a video. ... When the video is below 300 views, the views are counted in the same old-school reloading system. Fewer than 300 views will not affect YouTube's website. This method of view counting is fine for low view counts. The easiest way to grow your channel is to build great content. But that content doesn’t always have to be built from scratch. Some of your best videos can be built from engaging, valuable, useful and actionable content you’ve already created. Promote Your YouTube Videos on Other Social Channels One of the beautiful things about social media is that you can cross-promote content on different channels. Promoting your YouTube videos on your other social channels is the easiest way to grow your audience. For me, I have been using Instant Views for a while & I highly recommend it to anyone who is serious about YouTube marketing. Your videos and channel may be temporarily published on blogs and exchanges until you receive the number of views, subs, likes or comments you ordered. ",
            "date": "Answered November 9, 2019",
            "views": "121",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Gardiner",
                    "user_href": "/profile/Lisa-Gardiner-25"
                },
                {
                    "user_id": "Dr.Subhash Mishra",
                    "user_href": "/profile/Dr-Subhash-Mishra"
                },
                {
                    "user_id": "Bipasha Choudhuri",
                    "user_href": "/profile/Bipasha-Choudhuri"
                },
                {
                    "user_id": "Mahsa",
                    "user_href": "/profile/Mahsa-53"
                },
                {
                    "user_id": "Nagraj Ankola",
                    "user_href": "/profile/Nagraj-Ankola"
                },
                {
                    "user_id": "VIRGO STUDIO",
                    "user_href": "/profile/VIRGO-STUDIO-1"
                },
                {
                    "user_id": "Shiki",
                    "user_href": "/profile/Shiki-18"
                },
                {
                    "user_id": "Ankita Sharma",
                    "user_href": "/profile/Ankita-Sharma-2659"
                },
                {
                    "user_id": "Caroline Writes",
                    "user_href": "/profile/Caroline-Writes-1"
                },
                {
                    "user_id": "JackDeez RetroDuo",
                    "user_href": "/profile/JackDeez-RetroDuo"
                }
            ]
        }
    ]
}