{
    "title": "If the Key of C major and the key of A minor have all the same notes, what is the advantage of using A minor? - Quora",
    "tags": [
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "Ethan Hein's answer here is excellent and comprehensive.  I'd just like to emphasize that a musical pitch in and of itself doesn't convey any meaning beyond the fact that it expresses a given frequency. It's the relationship of pitches to one another that counts -- so emphasis on the fact that two modalities may contain \"the same notes\" is rather inconsequential. It's the specific arrangement of the pitches that conveys musical content. C major, A (natural/Aeolian) minor, D dorian, F lydian, and G mixolydian all contain \"the same notes,\" but in different presentations. If you take F lydian and rearrange the sequence to begin with C rather than F, you no longer have F lydian but C major instead. The pitches C, E, G, and A, depending on which way we stack them and the context, can form either a C major chord with an added 6th or an A minor chord with an added 7. This may seem cryptic until you start to think of musical meaning as being generated by patterns rather than particles. Then it becomes easy to see. ",
            "date": "Answered October 8, 2014",
            "views": "34",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ethan Hein",
                    "user_href": "/profile/Ethan-Hein"
                },
                {
                    "user_id": "Andrei Deleanu",
                    "user_href": "/profile/Andrei-Deleanu-1"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Michael Wimer",
                    "user_href": "/profile/Michael-Wimer-2"
                },
                {
                    "user_id": "Miriam Townsley",
                    "user_href": "/profile/Miriam-Townsley"
                },
                {
                    "user_id": "Abdullah Al Zami",
                    "user_href": "/profile/Abdullah-Al-Zami-2"
                },
                {
                    "user_id": "Walter Erickson",
                    "user_href": "/profile/Walter-Erickson-5"
                },
                {
                    "user_id": "Tom Nelson",
                    "user_href": "/profile/Tom-Nelson-46"
                },
                {
                    "user_id": "Michael D. Hockenberry",
                    "user_href": "/profile/Michael-D-Hockenberry"
                },
                {
                    "user_id": "Matt Corriveau",
                    "user_href": "/profile/Matt-Corriveau-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharla Van Cleave",
                "href": "/profile/Sharla-Van-Cleave"
            },
            "answer_text": "They have a completely different sound or mood. Most teens and adults learning a new piece will generally choose the piece written in a minor key due to its sad, depressing or romantic qualities. Major keys should brighter or cheerful. Let me add that although the two keys are related to each other by sharing the same key signature; the whole and half step patterns are different for a major key and a minor key. There are also three forms of minor scales so only the natural minor form of the minor key shares the \"same notes\" of the major key. C Major and a minor may both use all white keys, but the patterns are not the same. There is no advantage or disadvantage of using one or the other except as I stated earlier. They produce very different sounds. ",
            "date": "Answered July 9, 2018",
            "views": "280",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chun Pun",
                    "user_href": "/profile/Chun-Pun"
                },
                {
                    "user_id": "Ruth Fitch",
                    "user_href": "/profile/Ruth-Fitch-1"
                }
            ]
        }
    ]
}