{
    "title": "If the Greek gods existed today what kind of music would they like? - Quora",
    "tags": [
        "Greece",
        "God",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Evangelos Mylonas",
                "href": "/profile/Evangelos-Mylonas"
            },
            "answer_text": "Oh, this is interesting. Zeus - Bro rock. Gets wasted listening to Godsmack and Pantera, then tries to stick it into anything that moves. Aphrodite - Commercial pop or rap about anacondas. Ares - Hardcore. Always itching for a fight. Apollo - Avant-garde and jazz. The god of music is into bands you’ve never even heard of, darling. Artemis - Punk. Because no one tells her what to do. Hephaestus - Industrial. Because he needs a good rhythm to pound metal to. Hermes - Chopper rap. The silver-tongued god of messengers and thieves has no time to waste. Hades - Blackgaze. A melancholic character who cares for the dead that inhabit his realm. Poseidon - Mykonos deep house. Island-life, baby! Demeter and Hestia - Folk. As the most earthly of deities, they’re into acoustic guitars and fiddles, dancing with bare feet and big smiles. Athena - Post-rock. Because when you are the living embodiment of wisdom and strategy, you need something equally brainy. Bonus: Dionysus - EDM he can rave to with the satyrs and the nymphs. Offers E to everyone at the party. UPDATE: I forgot Hera, because of course. Hera listens to “I Will Survive” and “Dancing On My Own” on repeat while crying herself to sleep. ",
            "date": "Answered February 1, 2020",
            "views": "637",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sundus Ansari",
                    "user_href": "/profile/Sundus-Ansari-3"
                },
                {
                    "user_id": "Shivang Agarwal",
                    "user_href": "/profile/Shivang-Agarwal-7"
                },
                {
                    "user_id": "Manolis Kornarakis",
                    "user_href": "/profile/Manolis-Kornarakis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Frost",
                "href": "/profile/Ed-Frost-4"
            },
            "answer_text": "I would assume they would still listen to their classic instruments , but by now would have assimilated other genres. My guess is that varying gods would have certain preferences in music . Zeus - Rock Hades - Death metal Etc . ",
            "date": "Answered January 3, 2017",
            "views": "521",
            "upvotes": " Answer requested by Clau Lore"
        }
    ]
}