{
    "title": "If the creator gave me full permission to use his song publicly but the song isn't marked as royalty free, does it count as use of copyrighted music? - Quora",
    "tags": [
        "Copyright Infringement",
        "Copyright Law",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Zollo",
                "href": "/profile/Paul-Zollo"
            },
            "answer_text": "ANY use of music which already exists, by which I mean music in a “fixed form” —(either a sound recording or musical transcription)- is considered use of music protected by copyright. The music creator does not have to register the music or song with the Library of Congress copyright department, or publish or have it published, to be considered protected under copyright. But is it legal, acceptable usage or not? If you have permission in writing from the songwriter or songwriters of the song, you are okay. This permission often is not granted for free. As for “royalty free” music, there is much music which creators have placed in what is called “public domain.” Which means the public has the right to use it for free. That choice is made by the music creator so that their music can be heard, although it generates no royalties. But any use of music or a song which is not royalty-free without permission is not legal. If this happens, usually the person using the song without permission is asked to remove it. The creator has every right to sue anyone using their material, especially if it was used on anything which made money, like a film or TV show. But unless the use has already been widespread - and used already in any media which is monetized (as opposed to a student film in a festival, for example, or a youtube video) in which case usage is already so egregious as to demand a settlement- one can rectify the situation usually by removing the music. All of which points to the right thing to do: Seek permission. Do not steal music! ",
            "date": "Answered July 7, 2018",
            "views": "232",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aleksandr Kochetkov",
                    "user_href": "/profile/Aleksandr-Kochetkov"
                },
                {
                    "user_id": "Marisa Damele",
                    "user_href": "/profile/Marisa-Damele"
                },
                {
                    "user_id": "Mary Hohulin",
                    "user_href": "/profile/Mary-Hohulin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Rosado",
                "href": "/profile/Christina-Rosado-1"
            },
            "answer_text": "Where are you using it? Even though the artist gave you permission, they may not have communicated that to their record label/publisher. Also, did the artist detail the permission? Did they say you can use it and monetize it, or will they want revenue? If you are using the music on YouTube, you may get a copyright claim. You can appeal and say you have permission from the artist and show a screenshot of the permission, but the label/publisher may choose to monetize off the portion with copywritten content. Hope that helps! ",
            "date": "Answered July 7, 2018",
            "views": "51",
            "upvotes": "0"
        }
    ]
}