{
    "title": "If you were to guess, what season would the Simpsons end on, and how would it end? - Quora",
    "tags": [
        "The Simpsons (TV series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Lilavois",
                "href": "/profile/Nick-Lilavois-1"
            },
            "answer_text": "If you were to guess, what season would the Simpsons end on, and how would it end? I would like the Simpsons to gradually end in a few more seasons, done by aging the characters. They have aged them before in individual episodes, but all are assumed to be non-canon, and contradict each other. I would like some official canon steps forward: One whole season where the kids are in middle and High school.Once season where Lisa is in college, and Bart is repeating his High school senior year.One season where they are 20-somethings starting their careers, and in their 30’s with kids of their own, same as their parents were for most of the series.One where they are in their 40’s, 50’s, 60’s, onward. Homer dies. then Marge dies. then Bart dies. In the end we see that Homer, Marge and Bart are in “Futurama” style heads in jars on a shelf in Maggie’s home, and we see them welcoming Lisa as she gets added to the shelf. Plus, perhaps some indication that Maggie might be related to a Futurama character, like a great-great-great grandmother for Leela.",
            "date": "Answered March 2, 2020",
            "views": "218",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jordan Hookings",
                    "user_href": "/profile/Jordan-Hookings"
                },
                {
                    "user_id": "Natalee Desotell",
                    "user_href": "/profile/Natalee-Desotell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ricardo Alanis",
                "href": "/profile/Ricardo-Alanis-4"
            },
            "answer_text": "They’ve had some close calls with Harry Shearer and other actors/writers, composers, leaving or potentially leaving. If I had to guess, I think they’ll go for a round number like season 35, maybe 40 and that would be pushing it. As far as how it would end, it’s hard because the characters have repeatedly gone through changes or even milestones (birthdays, end of school years, etc.,) but revert back again to keep the permanence of the settings and characters. They’ve also done future episodes but I don’t think they’ll go with something nutty like a huge event or everything being a dream, etc. If I had to guess, I would say that since the first episode aired was Simpsons Roasting On An Open Fire, it would be fitting to do another Christmas episode with all the family, have some basic storyline and end with them either adding to the family (like Santa’s Little Helper) or just ending in a similar sweet note. ",
            "date": "Answered November 10, 2017",
            "views": "512",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                }
            ]
        }
    ]
}