{
    "title": "If you’re an acoustic guitarist, what are the first signs that you need to change your guitar strings? - Quora",
    "tags": [
        "Guitar Strings",
        "Acoustic Guitars",
        "Guitarists",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "I play classical guitar mostly, but I’ll answer anyway. “Need” is relative, because it depends a bit on guitar. Classical guitar treble strings basically never break. So you can get away without changing those for a LONG time. Many classical guitarists change bass strings 2–3x for every set of treble strings. I have one practice guitar with horribly worn dead sounding strings on there that I play frequently. Strings are months past due for changing, but I just don’t feel like it, because the guitar doesn’t sound that good anyway. For guitars I care a little more about, first signs of wear would be loss of tonal quality of bass strings. Some string sets lose quality of treble strings really quickly (in a matter of days), but I won’t usually change them for just that. Changing strings on classical is a bit more work than acoustic, but much worse, the strings typically take a few days to settle in and keep tune well, so that’s a disincentive to changing them unnecessarily. Visible or palpable wear to windings on 4th/D string (which is the lowest wound string) is probably my best real sign I need to change strings. I rarely touch acoustic guitar any more, but when I did, wear of windings on wound 3rd/G string was a good sign to change them. ",
            "date": "Answered October 22, 2020",
            "views": "125",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "My best (direct) answer is when you see signs of wear, and/or tonal dullness and/or increased difficulty in maintaining tuning. Your personal hygiene, body chemistry, and playing environment and temeratuer and RH can/will all affect your string life. I have dry hands and my (always uncoated) strings always last well. I mostly use phos bronze D’addario EJ17s - mediums for dreads, “EJ16s - lights for 000 and smaller) and Ej37s. for 12 string, EJ22 for archtops, Martin Bronze for one ancient 12 string, and Dunlop pb for reso, and nickels for mandolin. Most of my guitars spend more time in their cases, during the plague (!) I used to change them every 2 months, but when prices went up, I decided to change to 3 months - made no difference. Checking on my “performance” instruments this weekend all felt fine although one has worn same EJ17s since April. I find that playing at home, I don’t perceive string deterioration as much as when I’m performing. I usually change them when they look coppery coloured rather than golden, but this doesn’t mean they are sounding dull. HOWEVER : I know people who can kill a set of uncoated strings in a matter of hours. ",
            "date": "Answered October 19, 2020",
            "views": "595",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jerry Cotter",
                    "user_href": "/profile/Jerry-Cotter-3"
                },
                {
                    "user_id": "Mike Lawrie",
                    "user_href": "/profile/Mike-Lawrie-3"
                },
                {
                    "user_id": "Mary Scott",
                    "user_href": "/profile/Mary-Scott-258"
                },
                {
                    "user_id": "Billy Rouse",
                    "user_href": "/profile/Billy-Rouse-5"
                },
                {
                    "user_id": "Bill Castello",
                    "user_href": "/profile/Bill-Castello"
                }
            ]
        }
    ]
}