{
    "title": "If you could put together a super group of musicians for an album and tour who would you choose (living or dead) and what would their role be? - Quora",
    "tags": [
        "Pop Singers and Musicians",
        "Music Albums",
        "Music Industry",
        "Musicians",
        "Music",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Sawyer",
                "href": "/profile/Thomas-Sawyer-55"
            },
            "answer_text": "I love this question! I had to go deep on this one because a lot of great musicians have already been selected by other writers on this thread! The musicians in my group are multi talented players, singers and songwriters and would bring so much refined talent to the studio it would be a sheer delight to hear what they could do together! If I could put together my super group it would be called “Full Measure” and look something like this: Lead Vocals: Chris Cornell - What a super voice with amazing four octave range! This former towering front man for Soundgarden and Audio Slave would bring stage presence and his signature voice to my super group! Guitar #1: David Gilmour - This guy is the real deal! Larger than life riffs, rich textural sound, and SO much space created with his style of play! I love his guitar solo’s more than any other player! Guitar #2: Prince - In an interview, Eric Clapton was once tritely asked, “What’s it like to be the best guitar player alive?” Clapton simply responded, “I don’t know, ask Prince.” It is not fair to say he was under rated as a performer. This guy could do it all! I would just hope he could enjoy being a part of something bigger than himself . . . like this supergroup! Keyboard / Piano: Christine McVie - my favorite part of Fleetwood Mac! I love her voice! She would already be accustomed to working with a large group of egocentric musicians! Her playing would bring so much depth and texture to the mix! Bass Guitar / Bass Pedals / Keyboard / Mellotron / Clavinet / Organ: John Paul Jones - A writer from Rolling Stone stated “John Paul Jones will forever be remembered as the musical Swiss Army knife who helped propel Led Zeppelin to some of the greatest heights that any rock band has ever reached.” What a rock solid super musician to anchor my super group with that killer bass! JPJ and Prince would also co - produce this album! Drums: Ginger Baker - Ginger Baker was so instrumental to the sound and success of Cream and Blind Faith so I would have every reason to expect the same thing with this band! His thundering heavy drum sound was achieved on a custom Ludwig set which was 1/3 of the size of most modern drum kits and I would want that same sound to define this band as well! He is a fabulous rock and roll drummer with just the right amount of jazz to keep it interesting! ",
            "date": "Answered September 19, 2018",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hunter Zeigler",
                    "user_href": "/profile/Hunter-Zeigler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faiz Marsad",
                "href": "/profile/Faiz-Marsad"
            },
            "answer_text": "Axl Rose on vocals. A lot of people seem to hate him a lot due to his attitude problems and the deterioration of his voice over time but he is a phenomenal vocalist with possibly the highest octave range. Axl Rose was a beast during his prime. Eric Clapton would be on my lead guitar. He's an innovator and a great blues guitarist. His work with Cream is a great example of how Clapton took the blues form and updated it and turned it into something new. He can also play both fast and slow and his guitar solos are well structured and built over time. On Drums i would prefer Mr Keith Moon. He is prolly the best Rock n roll drummer. Keith had amazing pair of wrists. He didn't use fingers, he had no technique, but some how his wrists were always fluid, and he could pull things off with just wrists that most trained drummers would use a combination of fingers and wrists to do. Keith Richards would be my ideal rhythym guitarist. He excels in it. He may not be technically that good but he combines rich knowledge of traditional blues, country and rockabilly rhythm patterns which makes his playing style fascinating. Lastly i would go with the RHCP bassist Flea. Flea has this ability to fuse Funk and Punk. The Funk is where we see Flea’s iconic slapping style come from. Before Flea, Funk bass lines were aggressive and quick. When Flea introduced the slap to Punk bass lines it changed the genre forever and went a long way in giving the Red Hot Chili Peppers their iconic sound. ",
            "date": "Answered September 17, 2018",
            "views": "544",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Radid Khan",
                    "user_href": "/profile/Radid-Khan"
                },
                {
                    "user_id": "Christian Clarke",
                    "user_href": "/profile/Christian-Clarke-32"
                },
                {
                    "user_id": "William Mealey",
                    "user_href": "/profile/William-Mealey"
                },
                {
                    "user_id": "Antony Pateman",
                    "user_href": "/profile/Antony-Pateman"
                },
                {
                    "user_id": "Hunter Zeigler",
                    "user_href": "/profile/Hunter-Zeigler"
                }
            ]
        }
    ]
}