{
    "title": "If you were an artist, which of the two kinds of art would you most likely do? Why do you say so? - Quora",
    "tags": [
        "Contemporary Art",
        "Artists and Creative Professions",
        "The Arts",
        "Fine Art"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sebastian Rimbaud",
                "href": "/profile/Sebastian-Rimbaud"
            },
            "answer_text": "What do you mean two kinds of art? There are seven traditional arts: Architecture, Sculpture, Painting, Literature, Music, Acting, and Film. I do mostly music because i have skills for it, i’ve always had musical sensibilities, ever since I was a child. It’s also the easiest way for me to make abstract concepts into a work that conveys the ideas that i feel the need to express efficiently, i’ve tried painting and drawing but i just can’t abstract ideas the same way ",
            "date": "Answered September 16, 2020",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angelyn Lobero",
                    "user_href": "/profile/Angelyn-Lobero"
                },
                {
                    "user_id": "Autumn Joy",
                    "user_href": "/profile/Autumn-Joy-30"
                },
                {
                    "user_id": "Lisa Collins",
                    "user_href": "/profile/Lisa-Collins-310"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jenn Ross",
                "href": "/profile/Jenn-Ross-9"
            },
            "answer_text": "I am an artist… and two of my worst weaknesses as such are my inability to focus on just one or perhaps two mediums and become more skilled at these specific tools and techniques. And my complete lack of artistic definition or recognizable style. I am a person who loves art and getting into all different types of creativity and styles while learning new ways and techniques along the journey. Sometimes I even create new techniques all together. It’s what keeps me coming back again and again… the excitement of trying new things and using new products. I do at times go through phases, like my illustration phase (which is a recurring event) but even then, none of my work looks the same or has a cohesive theme or style or artistic category. It’s not all that different from me in real life actually. I tend to fall somewhere in the middle gray area on most subjects, able to understand and feel empathy for both sides. Anyway, in art it can be a struggle… not knowing what your identity is. However, maybe that is my identity- I’m an eclectic, multi medium, style changing, open minded, unaffiliated with any type alone- artist! Woah, I think I’ll just stick with artist or maybe flexible artist. if I did have to pick my current two favorite or most used art details…. It would probably be illustration/line work and the medium would be fine liner. But that could very well change by tomorrow! Here’s a quick illustration I did using fine liner. Be well and stay safe.  ",
            "date": "Answered October 6, 2020",
            "views": "31",
            "upvotes": " View Sharers"
        }
    ]
}