{
    "title": "If you were starting music production today, would you pick Logic Pro of FL Studio? - Quora",
    "tags": [
        "Electronic Music Production",
        "Logic Studio",
        "Logic Pro (OS X app)",
        "Music Production Software and Apps",
        "Digital Audio Workstations",
        "Music Producers",
        "Music Production",
        "Music Industry",
        "Music",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Steinebach",
                "href": "/profile/Frank-Steinebach-1"
            },
            "answer_text": "Logic Pro.Fruity Loops doesn't stand a chance in comparison, and especially in MIDI editing, Logic beats it by far. Of course you can do anything with any DAW today. At least, that's what some people say. In fact, there's even some truth in that, because you can do the same thing, most of the time, only the way to do it is sometimes so different that the way of the second DAW is simply impassable, because it's too complicated or too complicated.To explain this succinctly with \"different workflow\", when functions are simply poorly reconstructed, does in now way cut it. Did you know that Fruity Loops had to be taught and trained later on in things like audio recording and MIDI? Fruity couldn't do anything with it, and it was only the sad cries of disappointed musicians who had been captivated by the look of this glamorous sample slingshot that forced the programmers to add a little musicality to their beloved fruity loops. ",
            "date": "Answered June 9, 2020",
            "views": "421",
            "upvotes": " Answer requested by Anthony Thomas"
        },
        {
            "author_info": {
                "name": "Phil Jones (He / Him)",
                "href": "/profile/Phil-Jones-He-Him"
            },
            "answer_text": "I can’t answer this question. I’ve never used Logic, and can’t speak to its strengths and weaknesses. I use FL Studio (and have done for getting on for 20 years). I think FL Studio is great and there is absolutely no reason to “look down” on it as inferior or not professional etc. So if you want to know if FL Studio is “good” and “good enough”, then emphatically yes. BUT … obviously, even though DAWs are pretty similar today, each has its strengths and weaknesses. And, more importantly, different workflows. And different people prefer different workflows. Maybe you’ll turn out to be a “Logic Person” rather than an “FL Person”. ",
            "date": "Answered June 9, 2020",
            "views": "489",
            "upvotes": " Answer requested by Anthony Thomas"
        }
    ]
}