{
    "title": "If you could listen to only one song, only one time, in your whole life, what song would it be? - Quora",
    "tags": [
        "Songs",
        "Music",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Destiel Ford",
                "href": "/profile/Destiel-Ford"
            },
            "answer_text": "Brother by NeedtoBreathe Ramblers in the wilderness we can’t find what we need We get a little restless from the searching Get a little worn down in between Like a bull chasing the matador is the man left to his own schemes Everybody needs someone beside em’ shining like a lighthouse from the sea Brother, let me be your shelter Never leave you all alone I can be the one you call When you’re low Brother, let me be your fortress When the night winds are driving on Be the one to light the way Bring you home Face down in the desert now there’s a cage locked around my heart I found a way to drop the keys where my failures were Now my hands can’t reach that far I ain’t made for a rivalry I could never take the world alone I know that in my weakness I am strong, but It’s your love that brings me home Brother, let me be your shelter Never leave you all alone I can be the one you call When you’re low Brother, let me be your fortress When the night winds are driving on Be the one to light the way Bring you home And when you call and need me near Sayin' where'd you go? Brother, I'm right here And on those days when the sky begins to fall You're the blood of my blood We can get through it all Brother, let me be your shelter Never leave you all alone I can be the one you call When you’re feelin' low Brother, let me be your fortress When the night winds are driving on Be the one to light the way Bring you home Brother, let me be your shelter Never leave you all alone I can be the one you call When you’re low Brother, let me be your fortress When the night winds are driving on Be the one to light the way Bring you home Be the one to light the way Bring you home ",
            "date": "Answered December 16, 2016",
            "views": "476",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nisha Gupta",
                "href": "/profile/Nisha-Gupta-29"
            },
            "answer_text": "A2A :) It has to be 'Lag jaa gale'. I have been in love with the original composition since the first time I heard it, ages ago. The song is pure melody to my ears and it always manages to have a soothing effect on me.  Moreover, it makes me feel loved. It's got that age old charm with it, you know, a fine example of 'Old is Gold'? My first time hearing it is another unusual story. A few years back, I had been to Inorbit Mall in Pune and Sanam Puri and Co. was at the venue, making an entry into the music industry. He sang most of his songs and then began with 'Lag jaa gale'. Not only did he look amazing that day but his voice too just blew me over. Everyone there just went crazy, hooting and shouting for him.  That day when I saw him singing, he was dressed smartly (jaw droppingly handsome, to me :P) in a white coat and a black trouser. Inside me this thought kept churning, a burning desire did arise in me to run to the stage and probably hug him or maybe even better kiss him. (Swooning in delight, fortunately I wasn't the only one there) This was the beginning of my addiction to this song, on a daily basis as of now. When I play it, I prefer to shut the outside world and then all I can visualize are the mesmerizing words and Sanam's equally spellbinding voice. So if ever I'm to listen to just one song and survive for eternity, it has to be this song.  Listen to any version of this song sung by anyone, be it Arijit Singh or Shreya Ghoshal, you’ll feel good. May be it is the composition or the lyrics, that makes it mesmerizing enough to be listened to, forever. ",
            "date": "Answered March 1, 2017",
            "views": "64",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eddie Rasberry",
                    "user_href": "/profile/Eddie-Rasberry"
                },
                {
                    "user_id": "Sumit Kshirsagar",
                    "user_href": "/profile/Sumit-Kshirsagar-18"
                },
                {
                    "user_id": "Afsar Imam",
                    "user_href": "/profile/Afsar-Imam-17"
                },
                {
                    "user_id": "Harsh Yogi Rajput",
                    "user_href": "/profile/Harsh-Yogi-Rajput"
                },
                {
                    "user_id": "Ganapathi Raju Kalidindi",
                    "user_href": "/profile/Ganapathi-Raju-Kalidindi-2"
                },
                {
                    "user_id": "Gaurangi Patel",
                    "user_href": "/profile/Gaurangi-Patel"
                },
                {
                    "user_id": "Judy Ndiritu",
                    "user_href": "/profile/Judy-Ndiritu"
                },
                {
                    "user_id": "Mohan Singh",
                    "user_href": "/profile/Mohan-Singh-644"
                },
                {
                    "user_id": "Adarsh Agarwal",
                    "user_href": "/profile/Adarsh-Agarwal-7"
                },
                {
                    "user_id": "Saranya J",
                    "user_href": "/profile/Saranya-J-7"
                }
            ]
        }
    ]
}