{
    "title": "If you buy a vinyl record for $25, how much do all parties involved (artist, record company, record factory, etc.) get paid? - Quora",
    "tags": [
        "Record Labels",
        "Vinyl",
        "Vinyl Records",
        "Records",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark S. Dunn",
                "href": "/profile/Mark-S-Dunn"
            },
            "answer_text": "The vinyl album is $25 at the record store. That price is marked up by the retailer maybe 50%, so the wholesale price is $12.50. This price is marked up from the label maybe 100%. The record company will pay about $4 per disk for 1,000 units to the pressing plant ($4,000). Artist pays for packaging, but gets 3% of retail price ($0.75). Album Producer gets 3% of retail ($0.75) If artist wrote all songs, artist will get mechanical at $0.091 per song. Maybe 12 songs ($1.092). This number reduces if outside writers are involved or a song is over 5 minutes for the outside writer. This will increase the statutory rate for the mechanicals paid on the songs. Sometimes, if the artist did not write any songs and the songs are over 5 minutes, the overage on the mechanicals is paid by the artist. So, there are a lot of variables with the process. You need to know the artist’s agreement and various stipulations about payments on albums to get a more exact answer. Hope this is helpful! Markd ",
            "date": "Answered September 3, 2019",
            "views": "475",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Henry Blum",
                "href": "/profile/Henry-Blum"
            },
            "answer_text": "As what has already been stated, it’s not easy to calculate since each artist and label come to agreements that differ from agreement to agreement. I can tell you traditionally, it typically breaks down like this. These are for commercially pressed records by a national label. (In order from least to most) Least received per record - Artist themselves. Next would be the song writers. Next would be store that sold the record. Next would be the pressing plant. The most typically goes to the label. This is because they carry the most risk by signing the artists in the first place and putting money up front. Remember, this is generally true but no always. Hope this helps. ",
            "date": "Answered August 31, 2019",
            "views": "352",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Spleen-Eck"
                },
                {
                    "user_id": "Sarah LaBelle",
                    "user_href": "/profile/Sarah-LaBelle-1"
                },
                {
                    "user_id": "Laraine Barker",
                    "user_href": "/profile/Laraine-Barker"
                }
            ]
        }
    ]
}