{
    "title": "If you had to describe yourself as a song lyric which lyric would it be? - Quora",
    "tags": [
        "Describe Yourself",
        "Self Description",
        "Descriptions",
        "Song Lyrics",
        "Songs",
        "Music",
        "Hypothetical Scenarios",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Moriah Lewin",
                "href": "/profile/Moriah-Lewin"
            },
            "answer_text": "Queen: “Bohemian Rhapsody” “Because I'm easy come, easy go, little high, little lowAny way the wind blows doesn't really matter to me, to me” Anyone that knows me thinks of me as a free spirit, because I am very wild at times and any time something happens, I always say something like, “go with the flow” or “Just keep swimming”. I like to let things, just, happen. City and Colour: “The Grand optimist” I fear I'll die from complications,complications due to things that I've left undoneThat all my debts will be left unpaid, feel like a cripple without a caneI'm like a jack of all trades who's a master of none I’m in Grade 10, and although I am good at several things and am considering several different careers, I fear that everything bad that can happen to a person, will happen to me. That I won’t do well as an adult. YunggTez, Rico Nasty and Big Tee: No Reason They gon' hate me regardless, that's why I do what I do (what I do)See me in person I'm flawless, I might just snatch up your dude (hahaha) Although I have many friends, I am always bullied in some form, no matter where I go. This has happened all my life, and I am so used to it, that instead of trying to pretend to be something that I am not, I roll with it. .I make the jokes I like to make, and I make a fool of myself to make people laugh. People will bully me anyway, so I might as well make it fun! :) And lastly, Benny: Little Game Bounded all thoughts\nand corrected common sense\nyou're raising suicidalswith your predetermined titleslike a mess, distressed\nI am unimpressed\nYour excess\nA dress\nIs all you'll ever be\nGender roles impose control\nAnd deceive progressive times\nWelcome, to the land of the broken mind All my life, People have imposing gender roles on me, even though some of them don’t realize it sometimes. Because of that, I am always advocating against gender roles and stereotypes, because I think that they’re really bad and prevent the world from progressing. ",
            "date": "Updated August 29, 2019",
            "views": "51",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Flower Lopez",
                    "user_href": "/profile/Flower-Lopez"
                },
                {
                    "user_id": "Steve Armas",
                    "user_href": "/profile/Steve-Armas"
                },
                {
                    "user_id": "Ula Douglas",
                    "user_href": "/profile/Ula-Douglas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristina Crilu Luciani",
                "href": "/profile/Cristina-Crilu-Luciani"
            },
            "answer_text": "Funny, I have a playlist called “This is me” that would be a perfect answer for this question. Since it would take too long to translate all the lyrics (most of the songs are in Italian) I’ll make a collage with those verses that describe me the most: Song: Fuori dall’hype (Far from the hype) — PTN Because we are far from the hype, far from the hype, far from the hype and however it ends I never cry This is how I felt (and to some degree I still feel) almost every day of my life: out of place, out of time, far from what everybody else was interested in at the moment. Song: Antartide — PTN When your friends talked about sex you raised walls and couldn’t breathe Some of them then got pregnant while you were still in your fortress Men, you see, are strange animals, just like your nanny said: they can forget holocausts But almost never a woman’s face I really don’t understand men, okay? I’m that shy, awkward girl who loses her ability to talk whenever her crush is around. Pathetic, I know. Song: Gun song — The lumineers Things I knew when I was young Some were true and some were wrong And one day I pray I’ll be more of my father’s son I’m twenty years old and I’ve made a few mistakes along the way, thinking — with all the arrogance only a teenager could have — that I knew better. Moreover, I thought that I could succeed where my parents had failed and while the first belief was surely naive and preposterous, I’m still holding onto this one. These lyrics are a bit of a slap in the face, like “omg, I was so stupid and I still am… But there’s also still time to make amend!” Song: La nostra pelle (Our skin) — Ex-Otago Sometimes it’s more difficult when you’re sober Sometimes self love gives space to a visceral hate Sometimes I fall in love with me and I start dancing again Sometimes I want to leave myself, but I don’t know where to go Sometimes I fall in love with me and I start playing again And even if between you and you there’s no understanding Even if you have no time to listen to yourself Even if you don’t have the answer Never. Betray. Yourself They may seem very sad lyrics (and I didn’t even get started!) but that’s exactly the point: it’s easy for me to love my bright side, my creativity and all the good qualities… That are there… Somewhere… And that are promptly evoked by an happy song. It’s much more difficult — when I’m sober and when I’m drunk too — to love the constant rage that lives beneath and has to be kept under control, the lack of social skills and self esteem, the regrets I carry around… They’re still part of me, though, and this playlist has been in a way therapeutic: listening to these song I realized I saw myself in what they were describing — and if I liked the song and the meaning, why shouldn’t I appreciate what I am? ",
            "date": "Answered July 7, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}