{
    "title": "In a band does the singer usually have the easiest part? - Quora",
    "tags": [
        "Bands (music)",
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeremy Sklarsky",
                "href": "/profile/Jeremy-Sklarsky"
            },
            "answer_text": "There is no single metric of how difficult an instrument is. The question being asked and the details given (e.g. does the singer have an easy part…bass parts are often easy) implies you’re asking about beginners. So there’s two things to think about - barrier to entry and barrier to mastery. In terms of being a beginner - yes, it’s easier to pick up a bass and play quarter notes on the root of the chord than it is to actually strum those chords on a guitar or keep time on a kit. It takes even less effort to be the singer, provided you can hit the notes and sing on pitch. Guitarists might not be able to play a chord progression for weeks or months of practice, but anyone can “sing” because most people have throats and can speak. When it comes to “mastery,” it takes just as much effort to become a competent drummer or bassist as it does a guitarist or singer. I’d argue that in many cases, it might even be more challenging. Guitar players screw up all the time, and no one really cares. Singers can go off pitch or run out of breath everyone now and then and life goes on. When a drummer or bass player screws up, you know it. Everyone knows a great guitar player or singer when they hear them. But an outstanding rhythm section (bass and drums) doesn’t always need to show off. Understanding when to be restrained, how to keep the band together without drawing attention to themselves, playing precisely with each other, playing tastefully without taking over the arrangement, deciding whether to play ahead or behind the beat, when to push the tempo - these are skills that take an insane amount of experience. To the untrained ear, you’d think “but they’re just playing a simple beat and an uncomplicated bass line.” More refined ears would understand that it took them years to able to pull that off, to know just what to play for the song while making it look easy. When I was working in the studio full time, my favorite session bass player and I would joke around about the bass - “how hard can it be, playing one note at a time?” It’s funny because its only true of bad bass players. Not that good bassists play more than one note, but that they recognize that their contribution to the song goes beyond playing one note. Watch this visualization of the bass part in “Ain’t No Mountain High Enough.” The bass part is essentially the entire arrangement. He’s carrying most of the rhythm of the song, and he has the only instrumental hooks. Honestly, when this song comes on I don’t even hear the singers anymore. But its just one note a time, how hard can it be? Very hard indeed. It’s a good song, but its a classic record because of the bass.  ",
            "date": "Answered January 6, 2017",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Lingren",
                    "user_href": "/profile/Eric-Lingren"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Malcolm Dunbar",
                    "user_href": "/profile/Malcolm-Dunbar"
                },
                {
                    "user_id": "Jerry Kegami",
                    "user_href": "/profile/Jerry-Kegami"
                },
                {
                    "user_id": "Kayden Macey",
                    "user_href": "/profile/Kayden-Macey"
                },
                {
                    "user_id": "Sayantan Venkatesh",
                    "user_href": "/profile/Sayantan-Venkatesh"
                },
                {
                    "user_id": "Joseph Li",
                    "user_href": "/profile/Joseph-Li-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Collette Mclafferty",
                "href": "/profile/Collette-Mclafferty"
            },
            "answer_text": "Hmmm, interesting question. I think we have it both the easiest and the hardest. The easy part, we travel with little to no gear. This gives us options for traveling and less time to set up. Singers have to take care of their instrument, which is themselves. Sometimes singers can't partake in the same lifestyle choices that can come with the territory of musician life. A bass player can break a string and replace a string. If a vocalist loses their voice, they can't sing. Talking over loud music and social drinking that sometimes occurs at gigs can wreak havoc on the voice. Singing over bad monitor mixes can also be challenging. Long/overnight drives can be tough on the voice. I remember when I used to tour, I always wanted to go straight to the hotel, while the band wanted to go to the bar. If a vocalist writes the music in their range, it can be easy… but alot of times the music can be equally challenging for a singer and instrumentalist. Also singers have to memorize lyrics. Memorizing lyrics has always been very challenging. Me personally, I have to repeat a song dozens of times before I memorize it. Nothing is more terrifying then the fear of forgetting words. And while I try to memorize songs, I often start fucking off, surfing the net and getting on Quora. It's hard to listen to the same song over and over again without getting bored. A singer has to entertain the audience and set the pace of the show. If there are technical difficulties they have to fill the dead air. There is this 5–10 second gap between songs where the instrumentalists are communicating with each other. It feels like nothing to the band and a life time of silence to the singer. Singers get the most praise, but also the most criticism. Being singer is pretty challenging. I’m not sure where it is in relation to the instruments though! ",
            "date": "Answered January 6, 2017",
            "views": "18",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M. Zurifadil Solichin",
                    "user_href": "/profile/M-Zurifadil-Solichin"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                },
                {
                    "user_id": "Lawrence Bowden",
                    "user_href": "/profile/Lawrence-Bowden-1"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Mena Ezzat",
                    "user_href": "/profile/Mena-Ezzat-1"
                },
                {
                    "user_id": "Jeff Kelley",
                    "user_href": "/profile/Jeff-Kelley-22"
                },
                {
                    "user_id": "Hajra Nad",
                    "user_href": "/profile/Hajra-Nad"
                },
                {
                    "user_id": "Michelle Paul",
                    "user_href": "/profile/Michelle-Paul-96"
                },
                {
                    "user_id": "Kayden Macey",
                    "user_href": "/profile/Kayden-Macey"
                },
                {
                    "user_id": "Tom Zicafoose",
                    "user_href": "/profile/Tom-Zicafoose"
                }
            ]
        }
    ]
}