{
    "title": "In contemporary rock music, why is the bass quieter than the guitar? - Quora",
    "tags": [
        "Bass Guitar",
        "Guitars",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Cox",
                "href": "/profile/Andrew-Cox-83"
            },
            "answer_text": "Partly because of the way the music is mixed, partly because of the way wattage is turned into apparent volume for different frequencies, partly a trick of the ear, and partly because of dynamics in the individual bands themselves. First the easy one: the mix. The bass is usually quieter in song mixes because of its role in the band-it's a rhythm instrument, not a lead instrument like vocals or guitar. It provides the foundation-in this case the harmonic foundation while the drums provide the rhythmic foundation-for the rest of the band to sing and play over to make the song their own. And while this is crucial for any song to be the best it can be, it's not where the action is, and not nearly as interesting for the listener as the lead voice(s) or instrument(s). So they make it quieter to emphasize the intentionally interesting elements more. Second, the dynamics of each individual band. Most of the time, the driving force of a band is either singing or playing an instrument where they are naturally prominent in the band’s sound. Joe Elliot of Def Leppard: driving force, singer. Dave Grohl of the Foo Fighters: founder, singer and guitarist (despite being an incredible drummer in his own right). Angus Young of AC/DC, founder, lead guitarist. There are notable exceptions of course: Steve Harris of Iron Maiden, Lemmy of Motörhead and Nikki Sixx of Mötley Crüe are notable bandleading (and band-founding) bassists. But for the most part the bigger personalities take the natural lead roles for themselves, leaving the less ambitious people in the band to play the supporting roles, and they tend to be more tolerant of being softer in a band mix. Third, a trick of the human ear. The human ear naturally selects for a) human voices, especially higher-pitched voice's like women and children, and b) noises in the same range as the human voice-what we call “midrange”. The bass isn't a human voice and it's not in the same range-that's the guitar. The bass is an octave below that, so it doesn’t take advantage of the human ear’s natural traits to hear midrange best. So the bass is harder to hear naturally. Finally, the physics of it all. The relationship between power and apparent volume, and the most involved and complex answer. As one goes up the audible frequency spectrum, the waveform itself has more inherent energy, and also more apparent volume for a given power level. This is how a small girl shrieking can get EVERYBODY in a crowded room (and the next one, and in the house next door) to notice her, despite her small size. To make this more concrete, I’m going to move into the realm of real measures of power, frequency, and volume, and start talking about watts, hertz, octaves and decibels. As any good musician knows, for any given note, a similar note an octave above it will have a frequency twice as high as the original note, and an octave below has half the frequency. For example, a regular guitar’s open G string is normally tuned to 196Hz. Go up by octaves and you also get G notes at 392, 784, 1568, and so on; go down and it’s 98, 49, 24.5, and that's about the lower limit of human perception of sound. Now as any good physicist knows, the volume scale-the link between energy put in and sound coming out-is logarithmic. So something that is 10 decibels (dB) louder than something else will sound twice as loud, but actually have ten times the energy behind it. Likewise, something 10dB softer will sound half as loud but only have one-tenth the energy of the reference sound. Something with twice the energy behind it will be 3dB louder (which is noticeably louder), while something with half the energy is likewise 3dB (noticeably) softer. Now let’s tie all of that in with octaves, waveforms and their own inherent energy. Remember how I said above that higher frequencies have more energy? They also sound louder too. For any given size of a sound wave, the higher frequency sound will have more energy, and be naturally louder. For every octave you go up you double the frequency, which doubles the energy in the wave, and makes it sound 3dB louder. And for bass purposes, for every octave you go DOWN, the apparent volume of the natural sound also goes down by 3dB. Now as every good sound guy and amplifier maker knows, the way to compensate for this is sound reinforcement. Simply put, you run your sound through an amplifier, which adds energy into your waveform by making it physically bigger. There’s all sorts of math, different quality components with different efficiencies and other things you can do here, but let’s keep the example simple and run our amplified signal through one speaker of average quality. And here’s where the rubber finally meets the road: an average quality speaker produces about 90dB of sound output when reproducing a test frequency of 1000Hz (1kHz) at a power input level of one watt. Now we can do some real-world math. Going back to our guitar’s 196Hz open G string, we have cut our frequency by just over 800Hz vs the speaker’s test tone, cutting our waveform energy by 80%, and our volume by just over 7dB. So right away our guitar is only getting 83dB out of that one watt of power, he’s getting drowned out by the sound of the 88dB blender in his kitchen, and that just won't do. To get it back, we have to amplify the guitar more to get enough energy into the guitar’s signal so that the speaker can push 90dB again. Doing the math, we now have to put 5 watts through the speaker. Now let’s go down to bass. Its open G string is tuned an octave below the guitar, at 98Hz. Here it has just 10% of the power of the 1k test tone, so one watt of power is going to yield just 80dB. To get it back to 90, you need to put 10 watts through the speaker. But as bass notes go, that's pretty high. They can go lower than that, and some players (sample quote: I don't play “treble”) prefer to settle down at the bottom of the sound. So let’s say he’s rumbling the floor playing the low 49Hz G on his bass. Now that one watt is pushing out just 77dB and he's barely louder than the 76dB radio across the room his girlfriend just turned on (they're fighting right now). To get his signal back to 90dB, he needs 20 watts. But let’s face it: 90dB isn't THAT loud. It's about the level of excited conversation in a crowded room. If just the loudest bits are that loud, it’s not very inspiring; you want the quieter bits to move people too. So to REALLY get people to start appreciating your music instead of talking amongst themselves, you need to be playing around 100dB. That requires 50 watts for the guitar and 200 for the low-riding bass player. Keep chasing volume like this and sooner or later you're going to run out of power available to make your bass that much louder. And when you do, it's the lowest frequencies that are going to go away first. ",
            "date": "Answered August 22, 2017",
            "views": "19",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dustin Vin",
                    "user_href": "/profile/Dustin-Vin"
                },
                {
                    "user_id": "Jonathan Read",
                    "user_href": "/profile/Jonathan-Read-2"
                },
                {
                    "user_id": "Keith Vincent Tucker",
                    "user_href": "/profile/Keith-Vincent-Tucker"
                },
                {
                    "user_id": "Phil Tomasone",
                    "user_href": "/profile/Phil-Tomasone"
                },
                {
                    "user_id": "Deus Paul",
                    "user_href": "/profile/Deus-Paul"
                },
                {
                    "user_id": "Diego Mesa",
                    "user_href": "/profile/Diego-Mesa-1"
                },
                {
                    "user_id": "Gary McAdam",
                    "user_href": "/profile/Gary-McAdam-2"
                },
                {
                    "user_id": "Gordon Dallas",
                    "user_href": "/profile/Gordon-Dallas-2"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Tamara Batty",
                    "user_href": "/profile/Tamara-Batty-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Castel",
                "href": "/profile/Chris-Castel-1"
            },
            "answer_text": "Several things are at work here. The bass isn't really substantially “quieter”. If you look at the multitracks of a recording you'll probably see the audio visually looks to be the same level. In some cases it may be mixed a little lower, especially in contemporary rock since it often serves a supporting role more than anything. In bands where this isn’t the case, such as the Red Hot Chili Peppers (which is probably the best contemporary example I can give), it’s mixed a little higher because Flea doesn’t play root notes and harmonies that follow the guitar, but rather does solos frequently. RHCP wants to showcase their bass player. It also has a lot to do with how contemporary rock has evolved. These days, power chords are often a good chunk of any song, and the bass usually follows with root notes with a couple of fills or deviations. It’s not really supposed to stand out, but rather fill out the lower end of the spectrum to give a “full” sound. When getting more into the physics of sound, humans are much more sensitive to mid and high range frequencies, peaking at around 2000 to 4000 Hertz. We are significantly less sensitive to bass frequencies, dropping off at 20 Hertz. This is a trait we’ve developed to better hear other humans, as the frequencies we hear best are the ones that correlate with the human voice. In addition, lower-end frequencies require more room to develop, as they have a longer wavelength. If you’ve ever seen the strings on a grand piano, you’ve seen this at work. The higher notes have shorter strings and the lower ones have longer strings. If you play a bass guitar out of an amplifier, it’s going to sound substantially louder the farther you get from the amp. So tl;dr: contemporary rock music doesn’t emphasize the bass as much and the style that many bands play doesn’t make it stand out in the mix as much. We’re not as good at hearing low notes and they sonically are more prone to getting muddied without the right stereo/mix. ",
            "date": "Answered August 24, 2017",
            "views": "494",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rosh Gupta",
                    "user_href": "/profile/Rosh-Gupta"
                }
            ]
        }
    ]
}