{
    "title": "In piano, where do you position your hands for G major versus C major? - Quora",
    "tags": [
        "Piano Performance",
        "Learning Piano",
        "Pianos",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "I’m not going to answer your question because I’m sure many people will chime in with detailed answers. However, Never position your hands on the keyboard. If you are not playing, rest your hands in your lap. To “rest” your hands hovering above the keys is called static loading. It is a form of tension. Many pianist start their playing already from a place of tension. That ain’t good. For true relaxation to occur, your hands must either be in your lap or you must be in constant motion. It does seem counter intuitive but when your hand is moving up, the down muscles relax and when you are playing down, the up muscles relax. That is why pianists appear to be graceful. They are relaxing the muscles they are not using. Another truth which is forgotten is that gravity can play down which requires no muscle at all. That is why pianists develop CTS because they are playing down and it is an unnecessary strain. Also, if a pianist is pressing down, they can’t move up and up is very important as it repositions the hand for the next effortless down, unless we are employing effort. Playing the piano is a constant juggle of activating and relaxing muscles. If a teacher merely tells you to relax because you have tension, you’ve got the wrong teacher. That is like calling Triple A and telling them you have a flat tire and they say “Don’t drive it. Call again if you have more problems.” The better answer is to sleuth out which muscle you are erroneously activating and learn not to use it for that specific movement. This is why mechanics and architects would make better piano teachers than the people we do have. Most piano teachers are like people who buy furniture before they build the house. ",
            "date": "Answered September 15, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Walter Erickson",
                    "user_href": "/profile/Walter-Erickson-5"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Augusto Lopetegui",
                    "user_href": "/profile/Augusto-Lopetegui"
                },
                {
                    "user_id": "Deepak Vasudevan",
                    "user_href": "/profile/Deepak-Vasudevan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "In the early stages of piano instruction, students are often taught certain five-finger hand positions corresponding to major triads in various keys. This is because the span of a triad in root position encompasses the first five notes of the major scale, and the hand can be placed on the keyboard such that one finger becomes assigned to each of those five notes. In the case of C major, that's C-D-E-F-G; for G major, it's G-A-B-C-D.  Pianists number the fingers of the hand 1 - 5 -- that's thumb (1) through pinky (5).  The hands are of course mirror images of one another, but the keys of the piano ascend in pitch from left to right in a symmetrical sequence. The five-finger hand positions for C major, then, look like this: l.h.                r.h.C D E F G | C D E F G5 4  3  2  1    1  2  3  4 5    For G major, they're: l.h.                r.h.G A B C D | G A B C D5  4  3 2  1    1  2  3  4 5   (photos: adultipianolesson.com) Five-finger positions such as these are very useful for teaching basic keyboard geography and getting students familiar with the hand shapes commonly used in playing chords and simple scale passages. But they are quickly outgrown, as real piano-playing requires smooth motion up and down the keyboard outside such closely contained positions. ",
            "date": "Answered November 7, 2014",
            "views": "62",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Lockwood",
                    "user_href": "/profile/Tim-Lockwood-3"
                },
                {
                    "user_id": "Mark Catoe",
                    "user_href": "/profile/Mark-Catoe"
                },
                {
                    "user_id": "Shrey Banga",
                    "user_href": "/profile/Shrey-Banga"
                },
                {
                    "user_id": "Dean Croshere",
                    "user_href": "/profile/Dean-Croshere"
                },
                {
                    "user_id": "Sam William",
                    "user_href": "/profile/Sam-William-1"
                },
                {
                    "user_id": "Britt Smith",
                    "user_href": "/profile/Britt-Smith"
                },
                {
                    "user_id": "Garrick Saito",
                    "user_href": "/profile/Garrick-Saito"
                }
            ]
        }
    ]
}