{
    "title": "Is 'Dixie' or 'Bonnie Blue Flag' racist songs? - Quora",
    "tags": [
        "National Flags",
        "Racism",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Franciscus Alex Rebro",
                "href": "/profile/Franciscus-Alex-Rebro"
            },
            "answer_text": "Some relevant commentary on “Dixie” from Wikipedia: The song originated in the blackface minstrel shows of the 1850s and quickly became popular across the United States. During the American Civil War, \"Dixie\" was adopted as a de facto anthem of the Confederacy. Since the advent of the Civil Rights Movement, many have identified the lyrics of the song with the iconography and ideology of the Old South. Today, \"Dixie\" is sometimes considered offensive, and its critics link the act of singing it to sympathy for slavery or racial separation in the American South. Emmett's lyrics as they were originally intended reflect the mood of the United States in the late 1850s toward growing abolitionist sentiment. The song presented the point of view, common to minstrelsy at the time, that slavery was overall a positive institution. In short, \"Dixie\" made the case, more strongly than any previous minstrel tune had, that slaves belonged in bondage. [16] This was accomplished through the song's protagonist, who, in comic black dialect, implies that despite his freedom, he is homesick for the plantation of his birth. For the sake of balance, I'll also pull out these remarks from the other side: Its supporters, on the other hand, view it as a legitimate aspect of Southern culture and heritage and the campaigns against it as political correctness. The song was a favorite of President Abraham Lincoln So, if this song is racist or not is somewhat a matter of contention. But if you ask me, taking historical context into account and not simply looking at the denotative meaning of the lyrics, one has to crane their neck at an extreme angle to not see the obvious racial subtext. Kind of a weird mixed metaphor there at the end, but I don't care to think of a better phrasing right now. ",
            "date": "Answered August 18, 2017",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                },
                {
                    "user_id": "Moi Wood",
                    "user_href": "/profile/Moi-Wood"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikey Ward",
                "href": "/profile/Mikey-Ward-2"
            },
            "answer_text": "Not really, “Dixie” is a folk song and “The Bonnie Blue Flag” is a song about the Confederacy’s first unofficial national flag and the fight for liberty ",
            "date": "Answered August 6, 2018",
            "views": "164",
            "upvotes": "0"
        }
    ]
}