{
    "title": "Is 'Dixieland' a racist song? - Quora",
    "tags": [
        "Racism",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Keenley",
                "href": "/profile/James-Keenley"
            },
            "answer_text": "I assume you’re referring to the song “Dixie,” or “I Wish I Was in Dixie,” composed in the early 1850s, which quickly became popular with minstrel performers, typically accompanied by banjos. These “blackface minstrels” were white performers who adopted songs from black — i.e. slave — culture and performed with their faces blackened and their lips exaggerated to form a parody of actual black performers. The cover of the sheet music for the song published in the 1890s gives a good idea:  When the southern states began seceding from the Union in late 1860 and early 1861, the song “Dixie” became the unofficial anthem of the Confederacy. A band played the song on February 18, 1861 as Confederate President Jefferson Davis took his oath of office, and it was played by bands and groups that traveled in the South and accompanied Confederate troops throughout the Civil War. “Dixie” was one of Abraham Lincoln’s favorite songs (he was, after all, “born in Dixie”) and he would have bands play it at his political rallies and campaign stops. After the Confederacy co-opted the song as its quasi National Anthem, he refused to have the song played. However, on April 10, 1865, after hearing of Lee’s surrender to Grant the previous afternoon, in a speech delivered from a White House balcony, Lincoln told the gathered crowd of well-wishers: I see you have a band of music with you. I propose closing up this interview by the band performing a particular tune which I will name. Before this is done, however, I wish to mention one or two little circumstances connected with it. I have always thought `Dixie’ one of the best tunes I have ever heard. Our adversaries over the way attempted to appropriate it, but I insisted yesterday that we fairly captured it. I presented the question to the Attorney General, and he gave it as his legal opinion that it is our lawful prize. I now request the band to favor me with its performance. The band quickly complied, and Lincoln listened with a smile on his face. So, back to the main question: Is the song “Dixie” racist? Answering the question is problematic, chiefly because by the end of the Civil War in 1865, and continuing on for several decades after the war as blackface minstrelsy remained very popular, dozens and dozens of different set of lyrics were applied to the basic tune of the song. Southerners added pro-Confederate and anti-Northern lyrics, and Union loyalists wrote anti-Confederate lyrics. The original lyrics were meant to be from the point of view of an escaped slave who had fled the South, who is looking back with fond reminiscence about his former home: Oh, I wish I was in the land of cotton,Old times there are not forgotten,Look away, look away, look away Dixie Land. In Dixie Land, where I was born in,Early on one frosty mornin', Look away, look away, look away Dixie Land.  I wish I was in Dixie, Hooray! Hooray! In Dixie Land I'll take my standTo live and die in Dixie. Away, away, away down south in Dixie. Away, away, away down south in Dixie These lyrics, especially viewed in the immediate aftermath of the war, play into the Confederate “Lost Cause” myth, which attempted to disassociate the Confederacy, and the South in general, from the issue of slavery. As part of that mythology, slaves were depicted as “happy” with their lot, treated well by their masters, and pleased to be where they were. (This myth also features prominently in the book and movie “Gone with the Wind,” with slaves depicted as “happy darkies.”) That point of view is racist, chiefly because it depicts black Americans — slaves, former slaves, and freedmen — as not being intellectually capable of realizing the horrifying conditions they lived in. And it’s an attempt to re-write history. And then there’s that picture on the front of the sheet music… ",
            "date": "Answered September 6, 2020",
            "views": "152",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jada Winters",
                    "user_href": "/profile/Jada-Winters-4"
                },
                {
                    "user_id": "Matthew Cowell",
                    "user_href": "/profile/Matthew-Cowell-4"
                },
                {
                    "user_id": "Teri Kamaunu",
                    "user_href": "/profile/Teri-Kamaunu-1"
                },
                {
                    "user_id": "Bob Juch",
                    "user_href": "/profile/Bob-Juch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Kurtzman",
                "href": "/profile/Jonathan-Kurtzman"
            },
            "answer_text": "Oh yes. It was also the popular song of the time and only became associated with the Rebel cause through the war. There are many stories of the troops singing to each other, meaning to their units and to the other side. It was entertainment. I cant count how many letters, diaries, etc. I’ve read talking about a fine Reb singer who entertained the men from across the river. They looked forward to things like that. And they cheered for good singers. (There’s a scene with singing to a unit in the movie 1917.) Both sides sang Dixie. Northern troops also sang a version of Glory Hallelujah still known as John Brown’s body lies a moulderin’ … and Julia Ward Howe was asked to write better lyrics. That became The Battle Hymn of the Republic, which Union troops adopted. The original glory, glory part is from the South, which I find funny. Dixie became the song of the Southern cause because of the chorus ‘In Dixie land I’ll make my stand, to live and die in Dixie’. There were dozens of alternate verses, including Northern ones about the land of traitors. But a lot of songs from the past are going to be racist because they use dialect. We dont hear a lot of the dialect songs from the Jewish or other traditions anymore, and those generally didnt become national. Camptown Races is an example: it’s in dialect but the content is not otherwise disparaging. We sang that in grade school. It’s very catchy Stephen Foster, arguably the greatest American songwriter. If you were ever a fan of sheet music of old songs - raise your hand! - you’d be amazed at the song titles and lyrics. Some were bluntly anti some group, but a much larger number were dialect songs. So you had Yiddishe style songs that played off Jewish accents, and Italian songs and Irish songs. The titles alone can make you cringe. The lyrics are ridiculous to the modern sense. Remember, in the era before records, pianos were everywhere so sheet music was everywhere. Very little of that music was Beethoven. The most popular song of the late 19thC was a blah tune called After The Ball. Easy to sing and easy to play in a world in which you provided entertainment for your family and peers. ",
            "date": "Answered September 6, 2020",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Teri Kamaunu",
                    "user_href": "/profile/Teri-Kamaunu-1"
                }
            ]
        }
    ]
}