{
    "title": "Is 'selective empathy' empathy? - Quora",
    "tags": [
        "Cognitive Empathy",
        "Empathy",
        "Emotional Intelligence",
        "Sociopathy and Sociopaths",
        "Cognitive Psychology",
        "Neuroscience",
        "Psychology",
        "Understanding Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajat Y",
                "href": "/profile/Rajat-Y"
            },
            "answer_text": "Empethy is an emotion. If the emotion is evoked for a selective person, it's still empathy. If the person does not have Empethy for everyone, the person has yet not realised equienimity. Equienimity considers that all of us are human beings and essentially the same. I will share with you something which will help you in understanding what is equienimity. Think of a person whom you love and who is very close to your heart. Picture this person in your mind. Now think of another person whom you consider as your enemy someone who has not been good to you. Picture this person in your mind. Now think of third person who is not close to you and and who is also not your enemy. Someone whom you consider as a normal person. Bring the image of this person to your mind. Now picture All the three people together in your mind. The one you love, the one whom you consider as enemy and the one for whom you don't have any love or hate. Slowly transform the person whom you love and the one you consider as your enemy into the person with whom you don't have any love or hate relationship. Convert the loving person and enemy into this neutral person. ",
            "date": "Updated May 4, 2020",
            "views": "321",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vinod Kumar Jyani",
                    "user_href": "/profile/Vinod-Kumar-Jyani"
                },
                {
                    "user_id": "Yashraj Singh Rathor",
                    "user_href": "/profile/Yashraj-Singh-Rathor"
                }
            ]
        }
    ]
}