{
    "title": "Is 13 too old to start learning piano or guitar? - Quora",
    "tags": [
        "Guitar Lessons",
        "Choice and Choices",
        "Learning Piano",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donna Taylor",
                "href": "/profile/Donna-Taylor-503"
            },
            "answer_text": "Is 13 too old to start learning piano or guitar Useful Roman James 's methods and ways to l_e_a_r_n pianno effectivly in 6 weeks.Thank Roman James 5 WAYS TO LEARN PIANO EFFECTIVELY IN 6 WEEKS: 1. Get your friend or relative or acquaintance to teach you piano. This is perhaps the cheapest and easiest method. You can learn fast because it is after all your friend or relative who is teaching you, and you can fix the time as per your requirements. Of course you will need the piano, and some resources, but if you are not planning to learn it to become a pro, then you can perhaps do away with the resource materials. You can also be quite sure of learning some good simple songs quite early and can show them off to your friends too! 2. Find some good online resources where everything related to piano is being taught. Find a website where there are lots of video lessons, ample resources and tips as well as some kind of a schedule-based learning curriculum. Stick to the site (which means do not keep switching sites and dropping them) and learn everything that it teaches. There are plenty of them today which have a very thorough and clear resources including lessons, exercises etc. Below are suggested resources to learn piano by Quorarian Jennife Lee: . Private teachers . Piano schools . Best 3 piano channels on YouTube: LearnPianoLive, HDpiano, PianoPig. . Best forums: Reddit piano (125k members) is the best place to discuss and learn piano. Alteratives: Pianostreet forum, Pianoworld forum . PianoHandbook365 .club/2019/free-ebook-31-tips-to-become-a-pro-piano-player.html . Best frree training site: 701PianoVideos .info 3. Get a piano learning software program. They might cost you a bit, but when they come with plenty of video lessons and resource manuals, as wells as thousands of lessons, exercises and even evaluating tools, you can almost think of it as a piano tutor! 4. Learning from a tutor. The first thing that may come into your mind if you are thinking of learning the piano is to find a personal tutor who can help you learn the instrument. This can mean allotting your time to a fixed schedule every week to be able to go to your personal tutor or have him come over for the tutorial. One advantage of course of a personal tutor is the fact that he can see you learn and correct you as soon as he finds you not doing it correctly. 5. Learning on your own. Yes, you can actually learn to play piano on your own. With a lot of resources you can find around you, learning the piano can be easy. You can find free tutorial videos online, or find websites and blogs of music enthusiasts who are generous enough to share their skills. However, it is important to keep in mind that learning on your own especially if you are a total beginner may not be the best way to learn piano. In learning the piano and any musical instruments, it is important that you have to learn it correctly right from the start and this may be a little difficult if you are on your own. In fact, one thing that can also be difficult with learning on your own is that, you may not be following the lessons step by step and errors that you may develop early on may not be corrected right away. ",
            "date": "Answered September 29, 2019",
            "views": "642",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5856"
                },
                {
                    "user_id": "Jennifer Garcia",
                    "user_href": "/profile/Jennifer-Garcia-1340"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5870"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5859"
                },
                {
                    "user_id": "Barbara Brown",
                    "user_href": "/profile/Barbara-Brown-550"
                },
                {
                    "user_id": "Ruby Hughes",
                    "user_href": "/profile/Ruby-Hughes-36"
                },
                {
                    "user_id": "Kathryn Brooks",
                    "user_href": "/profile/Kathryn-Brooks-48"
                },
                {
                    "user_id": "Margaret Rodriguez",
                    "user_href": "/profile/Margaret-Rodriguez-84"
                },
                {
                    "user_id": "Elizabeth Jones",
                    "user_href": "/profile/Elizabeth-Jones-848"
                },
                {
                    "user_id": "Linda Williams",
                    "user_href": "/profile/Linda-Williams-1626"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuan Chang",
                "href": "/profile/Chuan-Chang"
            },
            "answer_text": "As others have said, it is never too late.  However, level 8 within two years is ambitious, though possible if you can find the right teacher and immediately start researching and learning the most efficient piano learning systems, that are available free on the internet (see link in my bio, for example, and the books reviewed there, such as Humphries').  Instead of finding teachers first, do your internet research and read the necessary books first so that you know how to pick the right teacher.  If you pick the wrong teacher, they can lead you into dead ends that will completely stop your progress, by saying things like \"you can't learn piano from books\" or \"unless you have exceptional talent, you'll get nowhere\" or \"absolute pitch is an inborn talent\", etc., that sound so reasonable, yet are completely wrong.  Good luck, and email me with any questions.  Piano is great because it will teach you practically everything you need to know about music (how to memorize hours of repertoire, raise your IQ, compose music, learn absolute pitch. etc). Classical guitar is not easy, but popular guitar is much simpler and a lot of fun, plus it gives you more chances to socialize and perform in public. ",
            "date": "Answered July 4, 2015",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stefanie Mier",
                    "user_href": "/profile/Stefanie-Mier"
                }
            ]
        }
    ]
}