{
    "title": "Is 22 years too old to learn to play the guitar? - Quora",
    "tags": [
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Omar Baltuth",
                "href": "/profile/Omar-Baltuth"
            },
            "answer_text": "22? Oh, good grief. Somebody recently asked if 70 was too old, and I said, “No!” While some of the best guitarists started playing at an extremely young age, such early introduction to the instrument isn’t at all necessary to become fully competent after a few years of playing. The trick is that you’ve got to practice, a lot. Some people say that 5.000 or 10,000 hours is required to master any skill. OK. I don’t think that much is absolutely necessary to be reasonably competent, but 5,000 hours is a good benchmark to assess this metric. The question, then, becomes, “Have you got enough time left to put in 5.000 hours of practice before you’re still young enough to benefit from the skill you’ve acquired?” If you dedicated yourself full-time to studying guitar, that’s 40 hours a week. In a year, with weekends off and holidays or a short vacation, you might put in 250 8-hour days. That’s 2,000 hours per year. So, in 2.5 years (30 months), you would get your 5,000 hours in. But, as we all well know, very few people have that kind of dedication. Even if you use every spare hour to practice, most people have school and/or work, so 40 hours a week is unrealistic for nearly everyone. So, if you can only put in 500 hours a year, or 2 hours a day during the week, maybe it will take you about 10 years to be a guitar god. Actually, that seems about right. Most people I meet who can play well seem to have playing at least that long. What if you just put in a few hours a week, and you start being serious about playing guitar at 60? That was 10 years ago for me. I got my first guitar at 20 when I was in college and played a bit for 5 years until I graduated and ensuing military service. After bumming around Europe for the better part of a year, without a guitar, I came home and spent another 3 years in grad school. I didn’t play much, but I did a little. Then, I started working, full-time, as a professional with an advanced degree. I had married and was trying to build a life. That ended, but I married again and started a family, frantically working as much as I could to provide for my growing list of dependents. I hardly played at all for 30 years. About every 6 months I’d pull out a guitar and try to play one of about 20 songs I thought I knew. Every time I did that, I noticed that I had gotten a little worse. At my best, I hadn’t been that great a player, but by 60, I could barely play at all any more. Then, I quit working. I didn’t call it “retirement” for several years, but eventually accepted that that’s what I had done. Without a job, I did what I wanted to do every day, all day, and nothing else. Guitar playing began to interest me again. I started playing regularly again and within a year was leading an amateur guitar group at a senior center. After 10 years of the guitar group, and just a few hours of playing a week, I’m a lot better than I was at my best when I was young. This has caused me to reassess the 5.000-to-10,000 hour thing. I don’t think I’ve put in more than 2,000 hours playing in the last decade, but I’ve spent a lot of time studying on-line and learning how to work up guitar-oriented arrangements for songs that I and the other seniors play in our weekly group session. I understand things about music that I had never bothered with before because it was “too theoretical” and “I just want to have fun.” Maybe I have put in my 5,000 hours when you include study. If I spent anywhere from 5 to 20 hours doing research and drafting a lead sheet for a song, some of that must count toward the time total for mastering an instrument. Maybe it’s not as simple as sitting on the couch for 5,000 hours and practicing 3-chord specials and bluegrass licks. Maybe you can contract the learning curve a bit with academic study. It’s not just how long you practice, but what you practice. When I spend the better part of a week working out how to play some slick, jazzy piece that no neophyte would ever attempt, I usually have to learn anywhere from 10 to 20 chords, many of which are not trivial triads. Learning how to execute such complex chording, playing all up and down the neck, while staying on tempo, takes practice. It all counts toward your 5,000 or 10,000-hour goal. When you can finally reel off one of those “hard songs” as easily as some cowboy ditty, you’ve got it. You can play, and I’ll bet you have put in at least 5,000 hours in various activities directly related to playing guitar. In the end, you must surely agree, that 27 is a long way from being too old to start playing guitar and have a reasonable expectation of several years of playing at an advanced level after putting in the requisite hours. Of course, 60 may be a bit too old to start out as a total neophyte and expect to be good enough to play well for a few years before age takes its toll. I didn’t start from scratch at 60, so ramping up to reasonable proficiency didn’t take that long. At 70, though, I and a lot of others my age have started slowing down. People get arthritis and other maladies that impinge on one’s ability to play. One guy in his 80’s, who has been playing in the group as long as I have, has neurasthenia to the point where he says that he can’t really feel his fingertips. He isn’t very good, and probably never will be, but playing guitar once a week with us gives him a reason to keep going in life. Would you counsel him to quit playing because he’s clearly too old to ever be a rock star? Hmm? ",
            "date": "Answered November 29, 2018",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabrina Rocha",
                    "user_href": "/profile/Sabrina-Rocha-21"
                },
                {
                    "user_id": "Erin H",
                    "user_href": "/profile/Erin-H-61"
                },
                {
                    "user_id": "Pulasthi Amarasinghe",
                    "user_href": "/profile/Pulasthi-Amarasinghe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prateek Gautam",
                "href": "/profile/Prateek-Gautam-9"
            },
            "answer_text": "Definitely not. It all depends on you. Why it depends on you? Because, you are now 22, playing guitar is not the only thing you are going to do at this stage. The hardest phase of learning a guitar or any string instrument is the starting phase.Everything sounds boring, difficult, and sometimes very irritating during this period.Initially , you will be given some exercise where you will feel like quiting, and you will try take your interest  in the other important matters of your life.This is from my personal experiences, where I almost left playing.  All you need to do is, have patience,as I said already, starting few months will be boring, so don't put  yourself down by thinking that you are too dumb to play.You will do real good after four or five months. Next comes Practice, practice depends on what kind of guitarist you want to become.If it's just for a hobby,then fifteen minutes in a day is enough. If you want to perform on small occassions, or among small groups, practice a little more like thirty or forty-five minutes. Many teachers, and guitar institutions, after initial stages advice the students to focus on vocals, so that they can use the guitar as a supportive instrument to their vocals, which is good, but you won't be focused completely on guitar(I am just saying though). If you want to be real good and get the attention of everybody when you are playing on stage with a band, then practising even 2 hours is not enough.There are people who are satisfied by practising 20 minutes, and are people who practice 5-6 hours and are still not satisfied. Find a guitar teacher, who is good enough to teach you the basic things.Ask him to help you in buying the guitar of your level and need.Keep looking for good institutions, so that you can improve when you become better. Good Luck!!!!!!! ",
            "date": "Answered June 21, 2015",
            "views": "52",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishowjeet K Yaduv",
                    "user_href": "/profile/Vishowjeet-K-Yaduv"
                },
                {
                    "user_id": "Frank Reagas",
                    "user_href": "/profile/Frank-Reagas-1"
                },
                {
                    "user_id": "Nahid Hakimi",
                    "user_href": "/profile/Nahid-Hakimi"
                },
                {
                    "user_id": "Banty Chakraborty",
                    "user_href": "/profile/Banty-Chakraborty-1"
                },
                {
                    "user_id": "Robin Robinson",
                    "user_href": "/profile/Robin-Robinson-9"
                },
                {
                    "user_id": "Huzefa Hyderabadwala",
                    "user_href": "/profile/Huzefa-Hyderabadwala-2"
                },
                {
                    "user_id": "Ankit Mahajan",
                    "user_href": "/profile/Ankit-Mahajan-73"
                },
                {
                    "user_id": "Gurpreet Singh Kakar",
                    "user_href": "/profile/Gurpreet-Singh-Kakar"
                },
                {
                    "user_id": "Sandeep Kumar",
                    "user_href": "/profile/Sandeep-Kumar-207"
                },
                {
                    "user_id": "Ashish Jain",
                    "user_href": "/profile/Ashish-Jain-76"
                }
            ]
        }
    ]
}