{
    "title": "Is anyone else losing interest in BTS? - Quora",
    "tags": [
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sansa Park",
                "href": "/profile/Sansa-Park"
            },
            "answer_text": "Yes and No. Yes: I am sick of Bighit constantly trying to monetize the boys. They are massively popular around the world and they left no stone unturned when it comes to encashing it. Just tell me what was the need of introducing TinyTan, In The Soop, Bangtan Universe game, Repackaged edition of old albums, Extra Merchandise, Break The Silence Movie, Learn Korean with BTS and more. This is just pure nonsense and a way to empty the wallets of ARMY’s. They are already feeding fans with Run BTS, Bon Voyage, Summer/Winter Packages, Festas, Bangtan Bombs/Episodes and many other things. It’s like having a feast when you are already full. That’s why launching such meaningless ventures are nothing but money making schemes. And the more I see it the more I lose interest. Coming to music, sometimes their songs seems forced. That’s purely because they want to win through the international market, so they keep experimenting with their music style which sometimes doesn’t sits right. And the way boys are constantly on cameras 24x7x365 is just so annoying. The camera doesn’t leave boys even for single second. When you think they are enjoying their time alone, then also they are being filmed. Yes, I am glad to see boys playing games and goofing around but I definitely do not want to see how they brush, how do they sleep or what do they do when they are alone in their room. That’s what you call privacy invasion. Let the boys breathe. No: The only thing which lets me crawl my way back into fandom is the boys. The way they inspire me no one till now did. From being in a company on verge of bankruptcy to becoming mega titans of music world, their journey is nothing short of inspiration to me. Each one of them has motivated in some way or the other. The best thing I learned from them is to never give up and instead try to turn your struggle and hardships into your strengths, which is exactly what each of them does. Whenever I see their interviews I see some unique charm about them, which no other group of their generation has. They talk wisely and smartly and their words are always comforting and honest. They understand life really well and you can see that in their lyrics. They have touched the subjects which are often disregarded by many. And even after 7 years nothing changed, their lyrics still talk about mental health, self-love, and healing. Many groups tend to change their concepts to break into western markets but BTS always stick to their concept, although their music style changes. They use their skills and platform for right cause by promoting positivity and optimism and encouraging people all around the world to work hard and follow their dreams and passion, which other artists rarely does. Another thing which keeps me into BTS is their bond and teamwork. Often members tend to go solo once they realize their fame and popularity but in case of BTS even after each of them being insanely popular worldwide and at peak of their career, they continue to work as team of 7 and keep sharing the same bond they had at the time of their debut. I have said earlier that the boys keep experimenting with music and sometimes it doesn’t work. But if you see it had led them grow musically so well. So it takes me back to them time and again. I wish they continue to make music which can inspire and motivate not millions but billions of people. Thank You :) ",
            "date": "Updated October 17, 2020",
            "views": "29",
            "upvotes": " View 60 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sancia",
                    "user_href": "/profile/Sancia-9"
                },
                {
                    "user_id": "Khan Baliga",
                    "user_href": "/profile/Khan-Baliga"
                },
                {
                    "user_id": "Sayaka Kitamura",
                    "user_href": "/profile/Sayaka-Kitamura-2"
                },
                {
                    "user_id": "Nadia Świtańczyk",
                    "user_href": "/profile/Nadia-Świtańczyk"
                },
                {
                    "user_id": "Jenna Phull",
                    "user_href": "/profile/Jenna-Phull"
                },
                {
                    "user_id": "Iris Shi",
                    "user_href": "/profile/Iris-Shi-31"
                },
                {
                    "user_id": "Giraffe Qween",
                    "user_href": "/profile/Giraffe-Qween"
                },
                {
                    "user_id": "Dimpy Singh",
                    "user_href": "/profile/Dimpy-Singh-36"
                },
                {
                    "user_id": "Sio F",
                    "user_href": "/profile/Sio-F"
                },
                {
                    "user_id": "Rounak Sen",
                    "user_href": "/profile/Rounak-Sen-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jiya Modi",
                "href": "/profile/Jiya-Modi-2"
            },
            "answer_text": "Reasons I am losing interest In BTS:- The fandom, especially the toxic part of the fandom, I mean they will be fighting everyone who presents their opinion on BTS which is not suitable according to their thoughts, it's like nobody can say what they thought was something bad in their music video or line distribution or screen distribution. It's like if you an opinion on BTS it should be suitable which simply means praising them forever.Most part of the fandom doesn't believe in enjoying the music videos they just want to stream that bad that BTS reaches millions and millions of views, for example, when Dynamite released rather than listening to it armies are using multiple devices to stream hard that they reach millions of views and likes in first 24 hours.Most of the fandom doesn't even care about the Hyung Line and all they want to see is the Maknae Line, I appreciate the fact that the Maknae Line is very talented at such a young age but that doesn't mean you simply neglect the Hyung Line(which are extremely talented as them). The most armies do not even care about their music, vocals or dance they only care about looks.The amount of pressure that Big Hit Entertainment puts on them. I mean the boys released an album at the beginning of the year then they released the Japanese version then the bomb song “Dynamite” and now they already are releasing an album in November. Give them a break it's not like they didn't do the online concerts and In The Soop etc. GIVE THEM A BREAK PLEASEDuring the award shows( MAMA OR MMA) all the awards are just handed to them nobody even is trying to see other groups like GOT7, EXO, ATEEZ, AND STRAY KIDS. Some say they get these awards because they paved the way, I think they paved the way for themi rather than K-Pop. Even during the music bank shows if BTS songs are released all the music bank awards go to BTS( it's not their fault but the people don't want to see anyone else other then BTS; but then it same happens with Twice).The biggest reason would be everybody ignoring those groups are working hard and performing giving their best and are just simply being ignored; the hype has increased THAT MUCH for BTS which makes me lose interest in them more and more everyday, I guess.",
            "date": "Answered October 8, 2020",
            "views": "12",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dani Yuniar",
                    "user_href": "/profile/Dani-Yuniar"
                },
                {
                    "user_id": "Sayaka Kitamura",
                    "user_href": "/profile/Sayaka-Kitamura-2"
                },
                {
                    "user_id": "Tahura Afsheen",
                    "user_href": "/profile/Tahura-Afsheen"
                },
                {
                    "user_id": "Kira",
                    "user_href": "/profile/Kira-689"
                },
                {
                    "user_id": "Ling Xiao",
                    "user_href": "/profile/Ling-Xiao-40"
                },
                {
                    "user_id": "Jenna Phull",
                    "user_href": "/profile/Jenna-Phull"
                },
                {
                    "user_id": "Giraffe Qween",
                    "user_href": "/profile/Giraffe-Qween"
                },
                {
                    "user_id": "Nitrous Gaming",
                    "user_href": "/profile/Nitrous-Gaming"
                },
                {
                    "user_id": "Bleh Bleh-Bleh",
                    "user_href": "/profile/Bleh-Bleh-Bleh-10"
                },
                {
                    "user_id": "Pa Gabi",
                    "user_href": "/profile/Pa-Gabi"
                }
            ]
        }
    ]
}