{
    "title": "Is all piano music classical? That is to say, is any piece written in piano (whether its originally composed for a different instrument ex. violin, or not) considered a part of the 'classical' genre? - Quora",
    "tags": [
        "Classical Piano",
        "Violins",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Santosh Baynes",
                "href": "/profile/Santosh-Baynes"
            },
            "answer_text": "Theoretically, classical music refers to music created between 1775 and 1827. However, most people prefer clubbing other styles such as baroque, romantic, etc., under one umbrella term : Classical. These may be written for solo instruments including the piano. Sometimes, pieces were also reduced/transcribed for piano much much later, but are still considered classical pieces (although they were made available for the piano much later). For example, a keyboardist playing Fur Elise by reading sheet music, is still playing a classical piece, though this was notated for keyboard quite recently, regardless of what style/accompaniment he is using. However, music extends way beyond that time-frame, and the piano is quite relevant in other styles and genres of music, both as a solo instrument, and one that accompanies artists. The piano is very prominent in Jazz, Blues, etc., The use of notation heavily used in the classical period, doesnt necessarily mean that the piece is classical. ",
            "date": "Answered August 31, 2017",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sly-Young-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivaprasad P",
                "href": "/profile/Shivaprasad-P"
            },
            "answer_text": "All piano music isn’t ‘classical’. In the 19th and 20th centuries, the piano became instrumental (pun intended) in waltz, swing music, jazz and bebop. While the piano is usually accompanied by the bass, vocals, guitar and the trumpet, most piano-only instrumentals (that I know of) are of the jazz genre. Thelonious Monk is one great jazz pianist I am familiar with. Another pianist whom I admire is Freddie Mercury, but I guess he was more a singer than a pianist. Hugh Laurie plays great piano too; usually blues and a bit of jazz. Piano has also been used to some extent in blues and rock music. ",
            "date": "Answered August 30, 2017",
            "views": "168",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sly-Young-5"
                },
                {
                    "user_id": "Sarthak Rao",
                    "user_href": "/profile/Sarthak-Rao-2"
                }
            ]
        }
    ]
}