{
    "title": "Is a cheap upright piano still preferable to a digital piano at the same price? - Quora",
    "tags": [
        "Upright Pianos",
        "Electronic Pianos",
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blake Maras",
                "href": "/profile/Blake-Maras"
            },
            "answer_text": "It depends on your needs, if you need something portable and you are going to move around a lot a Digital Piano is the way to go. The technology has progressed nicely over the years and most modern digital pianos are as close to the real deal as you can get. That being said there is nothing better than the real deal if you don’t plan on moving around much then a cheap Upright maybe right for you but be careful and choose wisely, here are some tips on how to choose a descent upright piano. There are basically 3 types of Upright pianos: Spinet Piano: These are the smallest of the uprights and they don’t produce a lot of sound because they have small sound boards. However they are lighter and easier to move, still not as easy as a digital, but lighter than other pianos. If you plan on putting the piano in a small room a spinet will get the job done. However larger rooms you will regret getting a spinet and I would recommend a larger upright for larger rooms at least a Studio Upright or higher. There are also two different types of Spinets one has the hammers located below the keys, and the other has the hammer slightly above the keys. If you are going to get a spinet get the one with the hammers above the keys, not below. This shouldn’t be hard as most uprights have the hammers above or near parallel with the keys. You can usually tell by how high the piano is, a good rule of thumb is the higher the spinet the better. Studio Upright: This is a Mid size upright piano it will produce more sound than a spinet. It usually is about as high as Eye level when in a sitting position you see a lot of these in Schools and Churches. Full Upright: If you have the room and can find a cheap full upright then go for it! These usually tower from the top of your head or even higher from a sitting position and have nice big sound boards. Some big Full Uprights can compete with Grand Pianos from a sound standpoint because the soundboard is big enough. However a Grand will still have better control because of the natural Gravity action. The downside is these uprights are very heavy and hard to move and typically cost more. Make Sure Piano is in Good Condition: Make sure you don’t purchase what I call a “Firewood” Piano, meaning the piano is worth more as firewood than it is as a piano. Tuning: If the piano is relatively in tune this will give you a good idea of how well it was cared for. I compare tunings to Oil Changes to cars. If you are shopping for a car and check the oil and the oil is dirty the oil probably wasn’t changed much nor was the car well maintained. However a car with clean oil indicates the oil was changed regularly and well maintained. The same goes for tunings, if the piano is pretty well in tune the owner probably maintained it. You can check tuning by playing octaves all the way up the piano, if the piano is out of tune the notes in the octave will clash with each other a bit. Tuning Pins: Open the piano and check the pins, look for any loose or sloppy pins to make sure they are not stripped. A stripped pin can kill a piano and make it a “Firewood Candidate”. The pins hold the piano wire and there is a lot of tension on the pins. If one is stripped it will be hard for any tuner to tune the piano as the wire will easily pull the pin back out of tune. Cracked Sound Board: This is a little tougher to detect but definitely is a piano killer. If the sound board is cracked then off to the firewood pile it goes. You can usually tell if a board is cracked because the piano won’t produce much sound or vibration. It will feel like you are fighting it to get the sound out. Also some cracks are visible on the back of the piano. Inspect the back of the piano and look at the sound board for cracks. (On Grand Pianos look underneath and above the piano as the soundboard is more visible in Grands than Uprights.) Hammers: Make sure the hammers are not worn out, this isn’t necessarily a piano killer, but might be costly depending on the make of the piano. If the piano is an old Steinway or top brand it might be worth the investment to get new hammers, but most makes it won’t be worth it. How you can tell the hammers are shot? The piano will have “Tinny” or Harpsichord like sound to it. The hammers will also look like there is no felt left on them and look more like vibraphone sticks than piano hammers. Seeing string indentations on the hammers is quite normal, so don’t confuse that with a hammer being worn out. Even Action: Open up the piano and look at the hammers, if the hammers look more like a mountain top then the action needs a lot of work. The hammers should be relatively even inside the piano. This won’t kill the piano necessarily, but will make it difficult to control dynamics as some notes will play louder than others simply because the Action is off. Key Condition: Make sure all the keys play and are in relatively good condition. Any missing plastic or ivory will feel bad on your hands. If it is a very high note or low note that isn’t played much you can let it slide, but like tunings this can indicate a poor maintenance history. A key that doesn’t play can mean a snapped hammer, or a problem with the action. Sticky Keys: Play all the keys and watch for sticky keys. This usually means a problem with the action, or there is a problem with the front bezel that the key is getting stuck on. Sticky Dampers: Play all the keys on the piano without using a pedal if a note fails to stop playing when you release the key then this means there is a sticky damper. A damper is a Black Block with felt on it inside the piano that rests on top of the stings. When you play a key the damper goes up and the hammer hits the strings. When you release a key the damper comes down to stop the note. If the damper is sticky the note will continue to ring even after the key is released. The good news is if it is only a few dampers the repair will be relatively inexpensive. Pedals: Make sure all the pedals work, the Sustain Pedal or Damper Pedal (Right Pedal) should raise all of the dampers up on the piano. The Una Corda Pedal(Left pedal) should shift the keyboard over a little and make the notes softer. The Sostenuto pedal (middle pedal) should sustain only the note you just played. It is not a big deal if the Sostenuto pedal doesn’t work as many pianists barely use this pedal and some pianos don’t even have it. The good news is pedal repairs usually are pretty inexpensive as it is usually a matter of adjusting them to get them to work. If the pedal has a loud Knocking sound it usually means a piece of felt is missing between the wood and the pedal and just needs a new piece glued in place. Hopes this helps, though you can’t be too picky for a cheap piano, this will help make sure you don’t simply inherit somebody else’s problem. Most upright pianos are now cheap or even free because people don’t want to move or pay to move them. -Good luck! -Blake ",
            "date": "Answered June 11, 2017",
            "views": "25",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elaine Stewart",
                    "user_href": "/profile/Elaine-Stewart-26"
                },
                {
                    "user_id": "Fred Nicholson",
                    "user_href": "/profile/Fred-Nicholson-3"
                },
                {
                    "user_id": "Jim Hardy",
                    "user_href": "/profile/Jim-Hardy-10"
                },
                {
                    "user_id": "Michelle Huang",
                    "user_href": "/profile/Michelle-Huang-118"
                },
                {
                    "user_id": "Joachim Pense",
                    "user_href": "/profile/Joachim-Pense"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Smith",
                "href": "/profile/Benjamin-Smith-349"
            },
            "answer_text": "I don’t think so for a number of reasons. A cheap upright can just be a lot of headaches. It may not have a great sound. It may not keep in tune. Its volume may not be that easy to control. It may need regulating sooner rather than later. The maintenance cost may be high for it vs. next to no maintenance costs for the digital. It’s not the upright versus digital that is at issue. It’s quality. Digital pianos sample or model sound. Meaning, the actual sound of an acoustic piano is recorded and processed for the sound of the digital in the case of sampled or mathematically rendered for modeled. You may not have such a wonderful sound through speakers, although this can be enhanced, but it will sound something like a high-end concert grand piano through speakers. However, if you have a set of good to great headphones, it can sometimes sound better than an upright. You get more bass, for instance. What you don’t get as much of is tone sustain and tone variety. But on a cheap upright you may not get such a wonderful tone or articulation either. The quality of the upright matters. Not even necessarily the price but you have to pay a decent amount to get a good upright. And that’s usually more than the better digitals. I would take a number of things into consideration and my conclusion is it all depends. How much will you use headphones? How good is the action in the digital compared to the upright? For your fingers, you may like the digital better. I know a number of people who got good uprights and liked their digitals better. So, your mileage may vary is the caveat I’d offer for this. Usually people like uprights better, but not always. One more thing about portability. Some digital pianos are spinet or console sized and designed pianos. They are not portable. A higher-end digital piano, like say the Yamaha CLP685 or the Roland LX-17 look like console pianos or short uprights. The portable digital pianos are “slab” pianos, that way 55 pounds or less. These console pianos weigh way over 100 pounds. That’s not exactly portable. ",
            "date": "Answered May 21, 2018",
            "views": "844",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Samantha B H Tay",
                    "user_href": "/profile/Samantha-B-H-Tay"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                },
                {
                    "user_id": "Zeibura S. Kathau",
                    "user_href": "/profile/Zeibura-S-Kathau"
                },
                {
                    "user_id": "Julian Pinto",
                    "user_href": "/profile/Julian-Pinto-7"
                }
            ]
        }
    ]
}