{
    "title": "Is Axl Rose a narcissist? - Quora",
    "tags": [
        "Axl Rose (musician)",
        "Guns N' Roses (band)",
        "Narcissistic Personality Disorder",
        "Narcissism",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel McCrone",
                "href": "/profile/Rachel-McCrone-1"
            },
            "answer_text": "I don't think so. I think he has massive anxiety. Check out his respiratory rate in interviews. You can see its raised. He also tends to talk a little more than others if he is not being interviewed alone. I wonder if he was desperate to get out of Indiana and being a good singer with lashings of creativity gave him an edge to be successful. That anxiety may have given him significant drive. But when he got to the top… What do you do when you have global success thrust upon you? Who do you trust? Do people care about you as a human being? Or as a cash cow? Or fame junkies? And with all of that …anxiety. Horrendous. Desperately trying to keep it all together and not let people down and yet you are cornered by your own creativity. And the media loved that you got into rucks with people who wouldn't leave you alone or people who sold every encounter when you thought you could trust them. I am not saying he hasn't screwed stuff up but then haven't we all. There is no training for being a successful rockstar. He also has done a sterling job with AC/DC and hasn't been difficult at all because he gets that it isn't about him so not a narcissist. He seems to have a decent team round him that see him as a person which is all anyone wants. Hopefully they love him as anyone should be. I wish him and his well. Just crack on with the music as much as possible and do what makes him happy. Best of luck to him I say. ",
            "date": "Answered May 14, 2020",
            "views": "288",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melanie D",
                    "user_href": "/profile/Melanie-D-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katherine Michele",
                "href": "/profile/Katherine-Mueller-21"
            },
            "answer_text": "hell yes, he is. that's why he screwed up his tours by making people wait for long periods before he strolled out drunk and on drugs on the stage, the only talent that was GUNZ-N-ROSES, was their guitarist slash Axl is a somatic narcissist ",
            "date": "Answered February 21, 2020",
            "views": "170",
            "upvotes": "0"
        }
    ]
}