{
    "title": "Is a PC or Mac better for music production? Why? - Quora",
    "tags": [
        "Music Production Software and Apps",
        "Macs vs. Windows PCs",
        "Music Producers",
        "Music Production",
        "Mac (computer)",
        "Personal Computers",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberto Santocho",
                "href": "/profile/Roberto-Santocho"
            },
            "answer_text": "Q: Is a PC or Mac better for music production? Why? A: I own a tech consulting company in Silicon Valley for 40 years and surprisingly we do have music studios as clients Every music client we have uses Macs. Years ago many of them tried using Windows but they found that the Macs were so reliable and required virtually no maintenance that it made more sense to use MacsTheir Macs also lasted so many more years than the Windows clones that the Macs actually cost less than any and all Windows/Linux clones.Macs are resistant to viruses and hackers so my clients don't suffer any downtime.",
            "date": "Answered January 26, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Down",
                    "user_href": "/profile/Mike-Down-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Holt",
                "href": "/profile/Rodney-Holt"
            },
            "answer_text": "While you can use PC or Mac for production I feel Mac is better suited for music production. Macs were designed for handling music, photo, video and most creative applications. When it comes to plugins and software updates Macs will most likely be able to get the updates first while PC users will have to wait sometimes. This is because Macs are preferred by most professionals. Other than that PC is perfectly fine for music production. PC is the preferred standard for office and business. Mac is the preferred standard for Music, photo, and video editing. I hope this helps. ",
            "date": "Answered July 7, 2019",
            "views": "57",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-2"
                },
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                },
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        }
    ]
}