{
    "title": "Is a large speaker better than a small speaker to produce sound? - Quora",
    "tags": [
        "Sound Engineering",
        "Speakers (public speaking)",
        "Sounds",
        "Loudspeakers",
        "Audio",
        "Public Speaking",
        "Sound",
        "Audio Equipment",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Woodburn",
                "href": "/profile/Mark-Woodburn-1"
            },
            "answer_text": "A large speaker will always (obviously) move more air, which is the very basic of a bass (low frequency) sound wave. However when going for Bass, you also have to take into account the space in which the Bass is listened to in. This requirement was never ignored more than by automotive sound enthusiasts. When car sound “became a thing”, the big push was for better Bass. Major car Audio Manufacturers started marketing all kinds of bass “bins”, double-reflex, passive radiator, powered, and non-powered alike. 12″, 15″ in both singles and duals proliferated (and still proliferate) the market. Even some 30″ cabinets were available. The mistake made by almost every one of these major players was in overlooking (or blatantly) ignoring the fact that these were designed to be used in cars. The average capacity (volume/cubic foot) size of which is roughly an 1/8 as large as an average American Home's Living Room. The mentality overall was that “bigger was better”. NOT SO! Everyone has experienced a “booming” coming from a car (sometimes from several blocks away). It rattles YOUR car windows from half a block away! You can feel it in your gut. You can hear the metal skin of their trunk vibrating violently against the hinges/locks screaming to pop open. You can almost picture in your minds eye the guys ears bleeding from all that bass, but!, If you were to get into that car? You would notice that although the overall sound is loud, there is a distinctly different tonal quality, with a vastly reduced amount of bass, inside the car. Why? Back in the late ‘60s, and early ‘70s, my dad was an Altec-Lansing dealer. Altec-Lansing had a great reputation as, and a foundation in being a ‘purist' company. No frills, solid — physics based — not fad based products. One such product was their Model “A” Series. The A Series were beasts. Aka “The Voice of The Theater” Series. Some of these still survive some 40+ years later and sell (40 years old and used mind you), for several thousand dollars (USD). You can still find “bargains” for only a couple of thousand, but these are getting scarce. We had gotten in a new, unboxed A4 system in our store for demo. One of our installer's was also a “weekend warrior” bass player in a local band. He was drooling over the first chance to hook it into his bass guitar. He finally got his chance when his band was set to play a downtown bar one weekend a month, or so after we got one in. He, and two other fellow bandmates hauled it out one night to use that weekend. It took all they had just to move it (it weighed about 500 pounds). They took it, got it onto the stage, and hooked it up. I had told him, I would stop by to see them that night. The bar was about 4 blocks from our shop. About 8 that evening, they were to begin their first set, so I stayed to do some work I had to do, and went over about 8:30. I walked since it was so close (also bc I knew I could “accidently” imbibe a bit that night). As I walked, I started hearing a rythmic ‘thumping' about 2 blocks away from the bar. The speaker was indeed working well. I could easily hear it well even that far away! When I got there you could hear it very well outside the building, but it was considerably weaker inside. Mike (our weekend warrior) complained to me he kept having to turn it up, and it still wasnt enough. It sounded ‘ok', but wasnt really any more impressive than his custom-made speaker stack. We did the math, and found out why. The A Series was designed as being part of a “wall of sound” behind a movie screen, in a large (900 to 1,000 seat, or larger) auditorium/theater. This local back bar/stage area was an enclosed room with a size/capacity of about a third of that. The speaker cabinet/drivers were so large, the actual bass “wave” wouldnt fully form until it was some 75 feet outside the building. The best “car audio” system I ever had was in a Toyota “Le Van” (one of the first minivans) that incorporated 2 Yamaha Personal monitors (dual 6″ drivers) in a single reflex cabinet. The bass eminating from these (relatively) tiny pistons was impressive to say the least. They fit the enclosure well, and the bass wave formed well within the vehicle. Sometimes bigger is not better, and it can really piss off other drivers, pedestrians, and sometimes gathers noise violation tickets. ",
            "date": "Answered May 27, 2019",
            "views": "400",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matt Wallace",
                    "user_href": "/profile/Matt-Wallace-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Wawrzonek",
                "href": "/profile/John-Wawrzonek"
            },
            "answer_text": "Yikes!! I have not read all the answers, but I wish someone would take into account that there are other things than size that determine bass performance. Many (many) years ago Dr. Bose and I took a pair of the original 901 speakers to the Music Box in Wellesley, Massachusetts. We placed the 901s on top of a pair of Klipshorns and played an organ recording. The lowest pedal tones were clearly audible on the 901s and not audible on the Klipshorns. The low notes were simply below the low frequency cutoffs of the horns and the 901s (sealed box enclosure with a resonant frequency of about 150 Hz -a guess, memory fails me) were equalized (bad word) to be flat to about 30 Hz. One really nice thing is that below its resonant frequency a loudspeaker behaves perfectly: it rolls off at exactly 6dB per octave and so is easily equalized. Screams from the audiophiles in the audience. Equalizing is bad. Then let’s play some LPs. Everyone forgets that everything audio is equalized at some point and LPs have a recording and playback equalization curve. Another way to get better bass without changing enclosure size is a longer voice coil for the woofer and bigger magnets add money and efficiency. A downside of the 901s is that the small size (true of all smaller enclosures) is lower efficiency so early 901s often were used with 300 watt Crown amplifiers. Worked fine. Very loud and expensive. But then the 901-III appeared with all new technology (a long story) and efficiency came back up. In my day big boxes were cheap and often came with cheap woofers and the performance was dismal. But they looked nice and had a large profit margin. Dealers loved them. ",
            "date": "Answered June 14, 2020",
            "views": "146",
            "upvotes": "0"
        }
    ]
}