{
    "title": "Is a recording studio a good investment? - Quora",
    "tags": [
        "Specific Recording Studios",
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Investment Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "Generally speaking, no, a recording studio is not a good investment. With the ease of access of home recording equipment, many studios are struggling commercially, and adding another studio unless there is a clear hole in the market is just going to reduce the viability for everyone. You are unlikely to get your money back unless you have a clear business plan.  In 2001 I used my redundancy cheque from a previous job to put together a studio with treated walls, sound-proofing, and some good quality (but not premium quality) equipment. A little later I formed a band with a famous studio musician who gave me some very helpful advice about recording processes, and recorded with me in the studio. He felt it was a good setup, and he later built his own studio on the same basis. Over the ten years that followed, I stayed in regular work, but with a tax-registered business on the side for other jobs that came in. During that time, there was a steady flow of other income toward the studio. The studio did generate some money, but not a huge amount. At one point we were offered a recording contract, but the whole band was earning so much in their regular jobs that we couldn’t agree on a fair price with the people offering it, and the project didn’t happen. However, if it had done, we would have rented studio time in a commercial studio with a commercial engineer. In 2012 I set up my own business. The recording studio played a part in my commercial offering, but never a large one. I think, taking everything together, the studio may well have paid for itself over the years, but maybe not. It certainly hasn’t been a big drain. However, that’s a long way from being a good investment. The things in the studio, apart from the Neumann microphones which I bought in 2016, do not have a great resale value. For the price paid for the gear, we could have done a lot of recording in a commercial studio. In 2016 I invested in a Newtek Tricaster video system, including cameras and lights. I got back twice my investment within one year, based just on two contracts, which I knew were coming before I bought it. That might seem a reasonable investment, except that in terms of £s per hour, it still released less than I was getting doing regular work for which no investment was required.  One of the things I learned on the long journey of the last 20 years is that expertise is far more valuable than equipment. It took me eight years to learn how to record in a way that commercial engineers said ‘that’s a good recording’ rather than ‘I can see what you’re doing wrong there…’ If you want to learn to be a recording engineer, go on a course. If you want to make money out of being a recording engineer, get a job in a studio. If you intend to run a studio as a commercial proposition—which is the only way it is a ‘good investment’—then you need to do a business plan, you need building permits and all kinds of things. I loved having a studio. I could go up there any time I wanted and record anything I wanted. When we moved somewhere else, I wasn’t able to have a dedicated space any more, and you can hear the difference in quality of recordings. Where we are now, we are just about to renovate an old paper vat (with double thick walls) as a studio space. As a beautiful thing to have, I think I got far more out of the money I spent on the studio than if I’d bought a low-vintage guitar. But that low-vintage guitar would probably be worth more now than when I bought it, or at least as much. However, as an investment, putting the money in the bank or in shares in a commercial company would have been far better. ",
            "date": "Answered April 29, 2020",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Russell",
                    "user_href": "/profile/Matthew-Russell-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Brown",
                "href": "/profile/David-Brown-737"
            },
            "answer_text": "This question has been asked before but I won’t merge it because you didn’t differentiate between home and pro. Is it worth starting a professional recording studio as a business now? Is a home recording studio a good investment? If you are a musician who intends to work a lot, sure. Especially if you live in, say, a rural area and don’t have many choices in recording studios. Otherwise, as a pure business move. Absolutely not. The last 20 years of technological advances in Macs and PCs have effectively eliminated the need for a studio. Every month it seems there’s another famed studio closing. Sadly, they are going the way of the blacksmith. ",
            "date": "Answered May 2, 2020",
            "views": "17",
            "upvotes": "0"
        }
    ]
}