{
    "title": "Is an ESP Ltd. EC-10 a good guitar? - Quora",
    "tags": [
        "ESP Guitars",
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Moran",
                "href": "/profile/Tim-Moran-4"
            },
            "answer_text": "I don't feel that particular LTD is very good.   Its basically just riding on its name.  I would say anything over $300 in an ltd and you are starting to get into something worth while.  IMHO the best bang for the buck is in epiphone guitars.   I have a LP tribute plus that I paid $700 for and I sold all my high end instruments as I prefer the epiphone.  Either way the best guitar for  any player is the one he or she enjoys and is inspired to make music on.  If you have a $10,000 custom shop les paul and you hate the neck and never play it but you just absolutely love your $300 daisy rocks neck and tone then the daisy rock is the better guitar…….for that player.    If you are asking for a beginner remember this.  Buy the best guitar you can afford.   And by the best I mean a guitar that the beginner likes the feel of and wants to play.  Many guitarists give up due to crappy gear and teachers who want them to play marie had a little lamb.   Getting a halfway decent guitar right out of the gate motivates the player, and if in the event they decide to stop playing they have an instrument worth selling rather than tossing. ",
            "date": "Answered June 20, 2017",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gianfranco Zecchino",
                    "user_href": "/profile/Gianfranco-Zecchino"
                },
                {
                    "user_id": "Jackson Cmelak",
                    "user_href": "/profile/Jackson-Cmelak"
                },
                {
                    "user_id": "Will Rath",
                    "user_href": "/profile/Will-Rath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Ahola",
                "href": "/profile/Stephen-Ahola"
            },
            "answer_text": "Surprisingly so. I bought 2 last year just to experiment with (wiring tricks, etc.) Fairly large frets, good action right out of the box, sale price under $100. Pickups not that great but I was going to swap them out with inexpensive pullouts from eBay. IMO better than anything that Epiphone sells for under $200. Of course you need to play it to see if it is right for you but it was the first new guitar I bought for under $100 since 1967 - that was a $25 Winston I bought at Meniketti Music in Oakland… Y&T’s Dave Meniketti's father’s store. I broke the high E string messing around with the tremelo bar on the way home and had to beg my parents to stop at our local music store to get an E string. ",
            "date": "Answered July 11, 2018",
            "views": "836",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Hardin",
                    "user_href": "/profile/Daniel-Hardin-1"
                }
            ]
        }
    ]
}