{
    "title": "Is BTS’ upcoming album going to be a part of the MOTS series as well? - Quora",
    "tags": [
        "Music Albums",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Anthony",
                "href": "/profile/Luke-Anthony-108"
            },
            "answer_text": "[Edit]: Unfortunately, my timing was so freaking bad. I was going to post this yesterday, BUT of course BigHit announced BTS’s new album JUST when I wanted to predict what the new album would be about. Just read this answer as if you never found out about BTS’s “Be” album hehe. I did intend to post this yesterday, but apparently my luck is just so bad! But, I mean, my answer was PRETTY spot on and I did predict many things that would be in the album, so….. props to me I guess….? Still mad that I was late though… I actually can’t believe the timing was so bad😣😣😣😤😆😂 Anyways, here’s the answer that WAS SUPPOSED to be written and posted yesterday, but didn’t happen because BigHit decided to just ruin my timing because of their announcement of BTS’s new album, “Be.” I worked too hard on it and I’m not letting it go, so yeah… still posting it hehe oops….. 😊😊  No, I don’t think so. The Map of the Soul journey should have ended with the Japanese album that was released earlier this year—correct me if I’m wrong though. Either way, I’m going to discuss why I believe the MOTS journey is over and what this new album could be about.  To start, I want to just say that I have a feeling this new album will have to do with the next 7 years and the idea of starting fresh for the next few years. Before I jump into the conclusions, I just want to show you chronologically what I mean. What this new album is about should be something completely different. It was not actually planned beforehand because remember, BTS was supposed to go on a world tour for most of this year. It was supposed to be this big thing (7 year anniversary), but because of Covid, the entire plan BTS had was put on a hold. With that being said, BTS had to step back and put everything on pause… just like the rest of the world. They had a lot of time on their own. Each of the members went off on their own for a while before regrouping. When they came together, this was when the idea of Dynamite came into the equation. It was a song they came across that they really wanted to do. Now that they’re done with this single, they’re moving on to a new album, but remember all of these new projects were essentially “last minute” ideas since they had so much time on their hands now. So, with all of this being said, I don’t think this new album will be a part of the MOTS journey as it was never intentionally supposed to be a thing until Covid came around. The new BTS album coming out was really only a secondary option for now because of quarantine and all this free time each of the BTS members had on their hands. Not to mention, Jimin has revealed that this new album will be quite different with many different genres of music and such. I don’t think the meaning behind this new album will have anything to do with their MOTS journey just because the MOTS 7 album was the finale of their journey for those past seven years. Now, BTS is starting off fresh and with that comes a new story to it. Now, it’s a new decade and I’m hinting that this new album will have to do with re-starting and starting fresh for these next few years. I actually have a theory for this new album. Essentially, I believe it will have a lot to do with the pandemic and living on and not letting these dark times affect us. BTS loves to have meaningful stories behind their music and it just makes sense that it would be about the pandemic and how the entire world was affected.  Not to mention, every since this new album was revealed to be a thing, each of the videos on Bangtan’s youtube channel—that related to this new album—had the hastags,#StayConnected #CarryOn linked to the videos. There has to be some kind of connection there. The videos that didn’t have to do with this new album weren’t linked with those hashtags, and the videos that did have to do with this new album were linked with these hashtags: #StayConnected #CarryOn. To me, I feel like maybe their new album is either titled something similar to these hashtags or at least have to do with “moving forward” and “staying connected.” In addition, I’ve noticed that Bangtan has posted quite a few sit down videos that were livestreamed—of the BTS boys. In a recent video, they talked about the new album and a concept of a music video for one of these new songs in the album. It was all about coronavirus and how the pandemic has affected everyone—including them. This new video is going to have components of the BTS members having an online concert without an audience, the sadness to it, what life looks like in quarantine, and finally, memories back to when BTS was on tour and when life was normal.  You can watch the video above to get more details! Anyways, these are just my thoughts on the new album. If I were to bet on anything, it would be that this new album has to do with the pandemic and how everyone was affected. The message, I predict, may be about moving on and trying to live life fully even when you’re affected by this global pandemic. All of these clues just make me think that it will be along these lines. Well, what do you think? Leave your comments down below!! Stay safe everyone!💜 ~Luke ",
            "date": "Answered September 28, 2020",
            "views": "618",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tunazzina Busra",
                    "user_href": "/profile/Tunazzina-Busra"
                },
                {
                    "user_id": "Akshitha Appalla",
                    "user_href": "/profile/Akshitha-Appalla"
                },
                {
                    "user_id": "Kamiah Barcus",
                    "user_href": "/profile/Kamiah-Barcus"
                },
                {
                    "user_id": "Scarlett Hall",
                    "user_href": "/profile/Scarlett-Hall-25"
                },
                {
                    "user_id": "Liliana Iancu",
                    "user_href": "/profile/Liliana-Iancu-2"
                },
                {
                    "user_id": "Boi Indion",
                    "user_href": "/profile/Boi-Indion"
                },
                {
                    "user_id": "Siddhi Bochare",
                    "user_href": "/profile/Siddhi-Bochare"
                },
                {
                    "user_id": "Shelby Templin",
                    "user_href": "/profile/Shelby-Templin-4"
                },
                {
                    "user_id": "Anna Cara",
                    "user_href": "/profile/Anna-Cara-6"
                },
                {
                    "user_id": "Marvheen Theodore",
                    "user_href": "/profile/Marvheen-Theodore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shereena Davies",
                "href": "/profile/Shereena-Davies"
            },
            "answer_text": "No, it looks like that era is over. Originally, the Map of the Soul series was intended to be a trilogy like the Love Yourself era, with each album titled following the themes of Jungian psychology - Persona, Shadow, and Ego. RM confirmed that this was the plan until they went on their extended break in 2019 and decided to combine Shadow and Ego into one full album which would later be called 7. ",
            "date": "Answered September 29, 2020",
            "views": "50",
            "upvotes": "0"
        }
    ]
}