{
    "title": "Is Billie Eilish autistic? - Quora",
    "tags": [
        "Is Person X Autistic?",
        "Billie Eilish",
        "Autistic People",
        "Autism Spectrum Disorders",
        "Asperger Syndrome",
        "Autism",
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexandria Garcia",
                "href": "/profile/Alexandria-Garcia-78"
            },
            "answer_text": "Well autism shows itself very differently between boys and girls. In fact it might not show itself at all in girls who are good at “masking” which is the term used to describe when girls simply mimic the behavior of those around them to be socially accepted. Which is why so many girls are never diagnosed or misdiagnosed. Misdiagnosis happens so much more than people realize. Even if Eilish does have autism, she probably wouldn’t have to “mask” as much as the average child as she was homeschooled and might not have as much anxiety as she grew up in such a loving and supportive household. If she did have autism it would definitely be high functioning. It is known to some she has suffered from depression and has Tourette’s and synesthesia, she has made statements about low self confidence when she was younger, issues with her body image. It is not unknown that underneath her bold appearance might be a complicated young girl. looking at interviews of her in certain environments like her home, she does seem to have a very literal and self aware way about her. It is subtle however. And anyways none of these disorders would seem to effect her talent as an artist and performer. In fact they may only enhance her abilities as to some, autism is simply a different way of thinking or processing. Not always inferior to the standard way of processing. She’s definitely a very intelligent young woman. ",
            "date": "Answered May 16, 2020",
            "views": "804",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jami Ask",
                    "user_href": "/profile/Jami-Ask"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Shawn",
                "href": "/profile/Matthew-Shawn-8"
            },
            "answer_text": "No. Billie Eilish is not autistic. Her music videos and very bizarre and erratic, but she does not have any mental or physical impediment other than Tourette syndrome[1]. She confirms this in one of her interviews. If Billie Eilish was autistic, she would have lots of trouble engaging with a large group of people. Her eye contact and attention span would be very different and not average. I know this because I grew up having high functioning Autism. I have observed this side effect with all of my Autistic friends, no matter where we are on the spectrum. Footnotes[1] Billie Eilish Gets Candid About Tourette Syndrome",
            "date": "Answered September 6, 2019",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Blundell",
                    "user_href": "/profile/Sarah-Blundell-16"
                },
                {
                    "user_id": "Raven Alexandra",
                    "user_href": "/profile/Raven-Alexandra-2"
                },
                {
                    "user_id": "John Bueno",
                    "user_href": "/profile/John-Bueno-13"
                },
                {
                    "user_id": "Ashley Avallone",
                    "user_href": "/profile/Ashley-Avallone-1"
                }
            ]
        }
    ]
}