{
    "title": "Is BTS' Kim Taehyung dating Snoop Dogg? - Quora",
    "tags": [
        "Snoop Dogg (musician)",
        "Kim Taehyung (BTS Member)",
        "BTS Songs",
        "Hip Hop and Rap Artists",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luna Goodman",
                "href": "/profile/Luna-Goodman-3"
            },
            "answer_text": "you might hear the haters say no, but- yes, Taehyung is dating Snoop Dogg. it’s not even a secret and y’all just turn a blind eye to the actual proof we have. the right thing to do would be to force you to figure the truth out yourself but since you insistent rascals will beg me in the comments to spill the tea, i’ll give you a little taste- just a little taste tho. a sip at the most. let’s line up the evidence: #1. our first and earliest piece of evidence is what us Snoopyung shippers lovingly call the “Snoopy Deserves His Rights” movement, which is known by the nations as the Legalize It movement.  here we have a picture of Taehyung wearing a sweatshirt that says “Legalize It”, which is his merch for his movement to legalize marijuana, holding up his fist as he passionately speaks out for Snoop Dogg’s rights. as we all know Snoop Dogg loves his marijuana:  and the only right thing for a boyfriend like Taehyung to do is to fight for his boyfriend, Snoop Dogg, and to legalize his second favorite thing (first favorite thing is of course Taehyung) for him. #2. Our second piece of evidence, and one of the most revolutionary pieces of evidence for us Snoopyung shippers is the sharing of glasses. as everyone knows, both Taehyung and Snoop Dogg have 69/69 vision, so they can share prescriptions and glasses which is exactly what they did. Snoop Dogg wore these glasses at an award show:  and then exactly a week later, Taehyung wore the exact same pair of glasses at an interview:  (if you look closely, you can see that Taehyung’s shirt is green in silent support of the Legalize It movement) you can’t deny that this was an essential step in their relationship that brought them from just casual lovers to forever soulmates. #3. our next piece of evidence is a crazy one, and blows every new baby Snoopyung shipper’s mind when they first join the fandom. Snoop Dogg dyed his hair blonde:  a stunning transformation, but an even more stunning transformation was to come after. Taehyung dyed his hair blonde only four days later:  in conclusion, about six months into their relationship, both Snoop Dogg and Taehyung dyed their hair blonde to prove that they were connected in love and hair color. #4. about five months passed without any more signs of their relationship, and some Snoopyung shippers even lost hope in this ship, but the faithful ones (like me) truly believed that they would pull through. and they did. it was a very lowkey sign, but still a sign and that’s all that mattered. Taehyung wore this jacket at one of his concerts:  a gorgeous look that we all thoroughly enjoyed but then, three days later, we got this piece of art on Snoop Dogg’s Instagram:  Snoop Dogg was wearing the same jacket as Taehyung. the ship was once again a sail. slowly but surely. and then oh oh oh groundbreaking evidence appeared- #5. the Oscars happened. and oh did we get so many interactions at that award show. Snoopyung shippers now knew for sure that, yes, they were dating and had been dating for many months, perhaps even years, and are still going very strong. there’s too many interactions, too many shared looks, too many little smiles and lovey-dovey eyes to share, and we would be here all night, but i’ll for sure share with you one of my favorite interactions:  Taehyung in his beautiful award show wear (one of the best outfits of the night, if i do say so myself) exiting his limo, caught Snoop Dogg’s eye and couldn’t help but break into a smile-  Snoop Dogg couldn’t look away, and burst into his own cute little smile, and couldn’t even stop himself from throwing up a peace sign (a sign that Taehyung and Snoop Dogg would always be two and together). another gorgeous outfit of the morning as well, i must add. so there you have it, folks. actual proof so you can’t go for me in the comments. i truly believe that they are together and have been happily together for at least a year, and are still going strong.  here’s a nice little cute picture of Ash Island to empty your head of the trash i just filled it with. i legit want to cry because of how uncomfortable this made me feel after i spent over an hour trying to find nonexistent “relationship clues”. like imma probably delete this or something this cause like oh my gosh just no. plz. stop. no. ",
            "date": "Answered October 16, 2020",
            "views": "63",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Willow Brasch",
                    "user_href": "/profile/Willow-Brasch"
                },
                {
                    "user_id": "Kaoru Lockhart",
                    "user_href": "/profile/Kaoru-Lockhart"
                },
                {
                    "user_id": "Felix Lee",
                    "user_href": "/profile/Felix-Lee-211"
                },
                {
                    "user_id": "Faith Goode",
                    "user_href": "/profile/Faith-Goode-1"
                },
                {
                    "user_id": "Sophia Grace",
                    "user_href": "/profile/Sophia-Grace-149"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elise Goggins",
                "href": "/profile/Elise-Goggins"
            },
            "answer_text": "BITCH WHAT DA FUQ?! Let’s use our common sense and break this hard ‘riddle’. So first Kim Taehyung talks about his dating life alot out of all the seven members, and he said he is not gay he is a straight man, and he says he does not have time to date right now, am I correct? So basically we put all of our dead brain cells together, we figured out the logic, and we are quoting on what he said. The conclusion I have come to is….. YA’LL JUST BORED AND YOU SHIPPING A 49 YEAR OLD AND A 29 YEAR OLD?!  I have the perfect prescription… GET A HOBBY! No one has time for your conspiracy theories. Now just go get a hobby like knitting… or something. ~ A person who is done with your steroid ways 😘 ",
            "date": "Answered October 20, 2020",
            "views": "194",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kim Taehyung",
                    "user_href": "/profile/Kim-Taehyung-1251"
                }
            ]
        }
    ]
}