{
    "title": "Is BTS V dating Kim So Hyun? - Quora",
    "tags": [
        "V (singer)",
        "Jin (BTS Member)",
        "Kim Taehyung (BTS Member)",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liestiana Liestiana",
                "href": "/profile/Liestiana-Liestiana"
            },
            "answer_text": "We don’t know yet. Some of people think that now V is in relationship for sure towards his behaviour nowadays. Actually, the reason i love BTS at first was when i found a video about Kim So Hyun and Kim Tae Hyung on youtube. I don’t know who he is. After that i searching everything about V and he’s one of BTS. V made me loves BTS more and more. Thank you Kim So Hyun for introduced me people like V and BTS 🤣😁 when i saw their (V and So Hyun) video on youtube, gosh…. is Kim Tae Hyung have a crush on her?? But are they a friend?? Why an IDOL (like V BTS even greeting her on the stage “long time no see” and staring her like there is no day after tomorrow LOL) it’s kinda cute for me. It’s been 5 years i ever shipping Actress and Idol , my first shipping is Jang Wooyoung 2PM with Actress Park Se Young because of their variety show WE GOT MARRIED. It’s not easy to shipping an IDOL with Actress but only their feelings and their hearts will gonna make everything go easy after that. And now after 5years i feels like a same vibe between Kim Taehyung and Kim So Hyun 😍😁 there are so many videos or pictures about them on YOUTUBE and INSTAGRAM. Sometimes i feel “are they really like each other now???” , “are they really dating??” Or “gosh, how many coincidence they have if all of this JUST A COINCIDENCE” …. As long as i know for sure if Kim So Hyun always have a project with an IDOL , CF MODEL even DRAMA together. If someday So Hyun and V get a project together it would be awesome 😁 but if they really really REAL it will be hard situation to do a project together, right? 😅😂 we just can support no matter what and we have to protect them if they are REAL. but if they are impossible being a REAL. I hope someday watch their project together because their chemistry is on different level for sure 😜😜😋💜 ",
            "date": "Answered April 22, 2020",
            "views": "47",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Luisa Zarah",
                    "user_href": "/profile/Maria-Luisa-Zarah"
                },
                {
                    "user_id": "Sasuke Uchiha",
                    "user_href": "/profile/Sasuke-Uchiha-1363"
                },
                {
                    "user_id": "RAGESH K.P",
                    "user_href": "/profile/RAGESH-K-P-1"
                },
                {
                    "user_id": "Kim Sarah",
                    "user_href": "/profile/Kim-Sarah-36"
                },
                {
                    "user_id": "Drishya Ragesh",
                    "user_href": "/profile/Drishya-Ragesh"
                },
                {
                    "user_id": "Iin Only",
                    "user_href": "/profile/Iin-Only"
                },
                {
                    "user_id": "Dichen Bhutia",
                    "user_href": "/profile/Dichen-Bhutia-5"
                },
                {
                    "user_id": "Abhirami Rajesh",
                    "user_href": "/profile/Abhirami-Rajesh-11"
                },
                {
                    "user_id": "Kim Anjixx",
                    "user_href": "/profile/Kim-Anjixx"
                },
                {
                    "user_id": "Rebekah Kim",
                    "user_href": "/profile/Rebekah-Kim-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luu Choi",
                "href": "/profile/Luu-Choi"
            },
            "answer_text": "No, he's not dating. He doesn't want to even date a famous person as well. Although he was in a relationship last year/somewhere around 2018. They date, so before anyone says anything, just keep that in mind. They're grown men. ",
            "date": "Answered July 7, 2020",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sasuke Uchiha",
                    "user_href": "/profile/Sasuke-Uchiha-1363"
                },
                {
                    "user_id": "Shaik Reshma Farheen",
                    "user_href": "/profile/Shaik-Reshma-Farheen"
                },
                {
                    "user_id": "Michella Jones",
                    "user_href": "/profile/MichellaPrettylady-Jones"
                },
                {
                    "user_id": "Debabrata Guria",
                    "user_href": "/profile/Debabrata-Guria-1"
                },
                {
                    "user_id": "Jennie Park",
                    "user_href": "/profile/Jennie-Park-64"
                },
                {
                    "user_id": "Elen Mavridou",
                    "user_href": "/profile/Elen-Mavridou"
                },
                {
                    "user_id": "Tae Kookie",
                    "user_href": "/profile/Tae-Kookie-61"
                }
            ]
        }
    ]
}