{
    "title": "Is Bohemian Rhapsody by Queen the worst song ever made? - Quora",
    "tags": [
        "Bohemian Rhapsody (song)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Johnston",
                "href": "/profile/Alex-Johnston-39"
            },
            "answer_text": "This is actually a very, very interesting question. The excellent music theorist and YouTube educator Cory Arnold, who goes by the name of 12 Tone, addressed that very possibility in his video, ‘Can Music Be Bad?’  If you don’t want to watch it, although you should because it’s great, 12 Tone differentiates between, on the one hand, just not liking a piece of music, and on the other hand, attempting to argue that a piece of music or any music can be objectively bad. In the following article, the arguments themselves are derived from him: the specific musical examples come from me. First off, he rejects the idea that badness in music has something to do with the artist failing to communicate their intention. That would mean that we can only like or respect a piece of music that the artist considered a success; it doesn’t leave any room for our interpretation. Tchaikovsky didn’t think much of the ‘1812’ Overture (‘I wrote it without warmth and without love’), but people love that tacky, gaudy, bombastic pile of kitsch because, let’s face it, when the cannons kick in and the tune of ‘God Save The Tsar’ blares, aren’t you glad that we kicked Napoleon out of Russia? Next, he examines and ultimately rejects the idea that good music has something to do with musical proficiency and expertise. For this, he enlists The Shaggs, surely one of the most inept but also most appealing bands ever to have committed their ineptitude to magnetic tape. (Video is separate because I don’t want to interrupt the flow of the answer.) The Shaggs are undoubtedly not expert musicians, but when in later life they had become proficient enough to record respectable versions of other people’s songs, such as the String-A-Longs’ ‘Wheels’, they re-recorded some of their early songs and played them the same way they originally played them, only with more confidence. The Shaggs played their music the way they wanted to play it. Zappa called them ‘better than the Beatles’. So, we can connect even with inexpert and awkward music if it’s played with enough honesty and conviction. So then, 12 Tone talks about what he thinks is maybe the best and also worst basis for finding music objectively bad, which is a moral objection. Does a song openly endorse violence against women, or does it promote white supremacy, or other kinds of anti-social behaviour? If so, isn’t that bad? Well, yes, but what if the groove is good, the melody is catchy, the mood is stirring, the music itself moves us the way it’s supposed to move us? How can it still be bad, if the music works on us? The Geto Boys’ ‘Trigga Happy N****’ is for approximately two-thirds of its duration like a right-wing white guy’s caricature of a gangsta rap track, being a smirking celebration of what trigger-happy badasses Bushwick Bill and Willie D are, but then Scarface’s verse takes a slightly more reflective and less self-indulgent look at the reality of being a criminal—but for our purposes, if anything redeems it, it’s that the whole thing is set to a killer sample of King Curtis’s bubblingly joyful ‘Memphis Soul Stew’, so what is a person supposed to do with that? In the end, 12 Tone argues—and I agree with him—that it’s a waste of effort to argue that any music is objectively bad. Every way you come at it, an exception comes to mind. …Which brings us to ‘Bohemian Rhapsody’. This is certainly neither inexpert nor awkward. It shows evidence of great natural talent and learned skill. We have every reason to suppose that the band did what it wanted to do. But what is it about? As 12 Tone notes, Freddie Mercury preferred people to make up their own minds about it and indeed got the rest of the band to promise that they would never reveal exactly what private issue Mercury was dealing with when he wrote the song. From a 2005 New York Times piece by David Chiu: \"I have a perfectly clear idea of what was in Freddie's mind,\" Mr. May said. \"But it was unwritten law among us in those days that the real core of a song lyric was a private matter for the composer, whoever that might be. So I still respect that.\" So we will never know exactly what Mercury was on about. And it is impossible to argue that ‘Bohemian Rhapsody’ is the worst song ever made, because there are no solid grounds upon which one can do so. It is well made. It is performed with passion and conviction. And nobody can agree enough on what it’s about for anyone to find it morally objectionable. We can be reasonably sure that Adam Zachary, who asked this question, really, really hates the song. But as for the question of whether it is the worst song ever made, let our last words on Queen’s great mock-epic be those of the philosopher Ludwig Wittgenstein, who in his early battles against what he saw as the besetting tendency of philosophy to ask meaningless questions, wrote as the capstone to his 1922 magnum opus Tractatus Logico-Philosophicus: What we cannot speak about we must pass over in silence. ",
            "date": "Answered April 19, 2018",
            "views": "263",
            "upvotes": " View 746 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Gower",
                    "user_href": "/profile/Michael-Gower-29"
                },
                {
                    "user_id": "Revati Awasthi",
                    "user_href": "/profile/Revati-Awasthi"
                },
                {
                    "user_id": "Mateus Bez",
                    "user_href": "/profile/Mateus-Bez"
                },
                {
                    "user_id": "Dimitri Czapkiewicz",
                    "user_href": "/profile/Dimitri-Czapkiewicz"
                },
                {
                    "user_id": "Brian Abraham",
                    "user_href": "/profile/Brian-Abraham-45"
                },
                {
                    "user_id": "Robert Miner",
                    "user_href": "/profile/Robert-Miner-12"
                },
                {
                    "user_id": "Stefan Elekanic",
                    "user_href": "/profile/Stefan-Elekanic"
                },
                {
                    "user_id": "Phillip Gabriel Alcantara Mercado",
                    "user_href": "/profile/Phillip-Gabriel-Alcantara-Mercado"
                },
                {
                    "user_id": "Sahana",
                    "user_href": "/profile/Sahana-80"
                },
                {
                    "user_id": "Marian Bast",
                    "user_href": "/profile/Marian-Bast"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johanna Appelberg",
                "href": "/profile/Johanna-Appelberg"
            },
            "answer_text": "Is Bohemian Rhapsody by Queen the worst song ever made? As a fan of both Queen and classic rock who is pretty much clueless about music in general… If you think, so, it probably is. To you. There are plenty of so-called classic rock and pop songs that I find boring or grating as well. The thing about this particular song though, is that it doesn’t adhere to the standard format verse-bridge-chorus, verse-bridge-chorus, something-in-another-key, chorus-chorus. I like that it’s pretty much four songs in one, and the way that the band manages to link them all together. But I can also see how some will be annoyed by its very nature. Still, you can’t ever say that Freddie was a bad singer, Brian anything less than excellent on the guitar, Roger ever being off-tempo on his drums, or John a mediocre bassist. In less than twenty years, this band managed to fill up two and a half greatest hits albums, and every single one of those songs are ones that most people in the Western world know from the intro alone. They’re all distinct, and they’re all classic. Bohemian Rhapsody put the band on the map because it was different, because it grated on everyone’s sense of how a good song should be constructed. And if you so will, Queen became a household name due to the worst rock song in history. ",
            "date": "Answered April 19, 2018",
            "views": "54",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nelson Mandela",
                    "user_href": "/profile/Nelson-Mandela-71"
                },
                {
                    "user_id": "Rama Chandrashekar Guttula",
                    "user_href": "/profile/Rama-Chandrashekar-Guttula"
                },
                {
                    "user_id": "Beverlie Beck",
                    "user_href": "/profile/Beverlie-Beck"
                },
                {
                    "user_id": "Andrew Ong",
                    "user_href": "/profile/Andrew-Ong-32"
                },
                {
                    "user_id": "Monica Amoroso",
                    "user_href": "/profile/Monica-Amoroso"
                },
                {
                    "user_id": "Denis Lanza",
                    "user_href": "/profile/Denis-Lanza"
                },
                {
                    "user_id": "Alexander Straub",
                    "user_href": "/profile/Alexander-Straub-1"
                },
                {
                    "user_id": "Budiman Suharyono",
                    "user_href": "/profile/Budiman-Suharyono"
                },
                {
                    "user_id": "Alisha Scott",
                    "user_href": "/profile/Alisha-Scott"
                },
                {
                    "user_id": "Supraja Kumar",
                    "user_href": "/profile/Supraja-Kumar-2"
                }
            ]
        }
    ]
}