{
    "title": "Is BTS part of the Illuminati? - Quora",
    "tags": [
        "Illuminati",
        "Secret Societies",
        "Conspiracy Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bora Kim",
                "href": "/profile/Bora-Kim-90"
            },
            "answer_text": "I kinda feel they are a part of illuminati. Yeah they spread good messages through their music. They have beautiful, meaningful lyrics. But i have no idea about blood sweat and tears and boy meets evil. Why did they even write those? And they wrote those by theirselves. Lyrics reflect artists. So I think BTS are connected to illuminati or satan. Yeah positivity can be spread in many ways but don't you feel listening to their music you are obsessing over them and far from God? No matter what we always have to ask help from God. To be happy or the things we want. Listening to their music won't do to you anything unless you want. Music can't heal you. Actually nobody can. You yourself can do good to you. Ok. You listened pied piper but do you study hard keeping BTS aside? No. Many armys are obsessed with the boys rather than their music and don't concentrate to their real life. BTS have too many contents and armys are into those. And Armys are being over protective towards them. And sorry to the LGBTQ community, being homosexual or supporting homosexuality is against religion. But BTS do support LGBTQ. It's also a satanic work, normalizing prohibited things. I'm not a hater. I love BTS but I feel bad that they use satanic symbols in their music. Maybe it's because of bighit. But Taehyung always does v sign around his one eye. I don’t like it. It's like one eye middle of the pyramid. He's stage name is V so he can show v sign but why around one eye?! And I feel bad for him because he's my bias. I pray that they'd come to right path oneday.     (Save the cute pics 😂) You can say they're cute, hard working, talented and good people, they can't do satanic things. Bbut.. You are religious, so do you always pray and do good things all the time? Everyone leads a normal life. Religion part is usually not so used. But you worship God at least. Thus BTS also worship Satan and achieved so many things. Did you notice they got everything they wanted? Everything they mentioned with their mouth or lyrics, everything.. They even placed 1 in Hot100. Now you’ll see they'll get grammy. It's because of they worship satan. Now tell me why Jungkook drew one eye in this drawing. You all must have watched this bangtan bomb.  Oh again, did you notice the lyric of “Ego”? These lines..🙁 “Whenever I forget, I remember those days까마득 잊을만하면 생각나 그 시절 The touch of the devil and the recall of fate악마의 손길과 운명의 recall” My writing is not good. It may seem messy but I tried. I'll come back if they get grammy. Have good day or night. ",
            "date": "Updated September 22, 2020",
            "views": "43",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grace Mumia",
                    "user_href": "/profile/Grace-Mumia"
                },
                {
                    "user_id": "Ala Iranii",
                    "user_href": "/profile/Ala-Iranii"
                },
                {
                    "user_id": "Ruprekha Buragohain",
                    "user_href": "/profile/Ruprekha-Buragohain"
                },
                {
                    "user_id": "Sophia Montes",
                    "user_href": "/profile/Sophia-Montes-15"
                },
                {
                    "user_id": "Layleigh Lee",
                    "user_href": "/profile/Layleigh-Lee"
                },
                {
                    "user_id": "Sali Abdulkadil",
                    "user_href": "/profile/Sali-Abdulkadil"
                },
                {
                    "user_id": "Abiola Adedeji",
                    "user_href": "/profile/Abiola-Adedeji-4"
                },
                {
                    "user_id": "Siyana Jabin Karadan",
                    "user_href": "/profile/Siyana-Jabin-Karadan"
                },
                {
                    "user_id": "Yeon Mimin",
                    "user_href": "/profile/Yeon-Mimin"
                },
                {
                    "user_id": "Fati Ch",
                    "user_href": "/profile/Fati-Ch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nirvaè Na",
                "href": "/profile/Nirvaè-Na"
            },
            "answer_text": "!!!LONG ESSAY ALERT!!! NO FORCINGS,AND I WOULDN'T SAY I HAVE AN EXACT ANSWER TO THE QUESTION.BUT THOSE ARE MY PERSONAL FEELINGS ABOUT THE MATTER. Dear reader,if u did read it..please share it thoughts and ideas in the comments,it means a lot to me,and I would like to talk about this To be honest . Right now I am writing this answer with a very disturbed mind.Today I came across a video stating that BTS was part of the illuminati,or let's say as far as I saw and understood it,it says they serve Satan and that damn…they sold their souls to those hoodoo and black magic to achieve their fame and success they are having now. I started listening to kpop since 2011or 12 till present, My Bestie introduced me to this genre.and our first boycrush band was EXO. I used to listen to different bands too and BTS ranks 2nd..over the progressing years,I fell in love with them more and more especially after their Spring day MV; I swear it still gives me feelings and makes me cry! Blood, sweat and tears is one of my fav songs and concepts of their..and save me! Dna!ido!l,fake love! Those are the songs which has always related to my life always..and hence I adored them for the courage and confidence they gave me trough their music.and I need u girl is also quite my loved part. I mean all their songs do carry message that the world is not a very good place,but it has its own good and bad parts with it.and to live and maybe thrive and survive,we need to keep on moving and fighting..no matter what! That is one of the things I have understand so far,from being an Army. But the video that I just saw..made me feel very disturbed and bad.yeah..i don't know what to believe in now,there seems to be lots of proofs and things that show that the boys maybe do…but honestly I feel so broken and sad about it. I don't think spreading demonic ideals was their motive; I still pray it is not! And believing in a religion or being an atheist is completely an individual's choice,but I just don't want them to be what the others think they are!? U know what I am saying? Maybe,the boys were dragged on into this,when they dealt the contract with their company..who knows? We can't make petty assumptions and judge their lives,until they appear clean about this. I really do hope BTS oneday themselves can confirm this.because not just me,there are many people who love them for the wonderful work they have done and who supports them with all our heart and soul just like I do; Noatter what I will still love the boys because honestly to me, personally,they have thought me more good and useful things about life than any other useless shit. They taught me to love myself,speak myself,and that I am not alone-neither is anyone.And they taught m that,it is okay to feel not okay always..it is okay to feel sad, depressed, inferior,complex unloved and suicidal,but we are not alone!and we all don't have perfect lives..but we should live and fight..so we could make it better we are always loved! And we all do belong to the same universe!And love is not just a simple pep thing in ur life! Those are real pearls of wisdom from them to me. And hence I do support their hardwork and the journey they have travell so far.and I love them And please don't take this down. NO HATE OR DISCRIMINATIONS PLEASE! FIGHTING!✌️ ",
            "date": "Answered February 20, 2019",
            "views": "253",
            "upvotes": " View 77 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ala Iranii",
                    "user_href": "/profile/Ala-Iranii"
                },
                {
                    "user_id": "Choi Maha",
                    "user_href": "/profile/Choi-Maha"
                },
                {
                    "user_id": "Marceline Playz",
                    "user_href": "/profile/Marceline-Playz"
                },
                {
                    "user_id": "Whitney Stahl",
                    "user_href": "/profile/Whitney-Stahl-8"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-1000"
                },
                {
                    "user_id": "Reyhaneh Bozorgi",
                    "user_href": "/profile/Reyhaneh-Bozorgi"
                },
                {
                    "user_id": "Hermela Beraki",
                    "user_href": "/profile/Hermela-Beraki-1"
                },
                {
                    "user_id": "Harshini M",
                    "user_href": "/profile/Harshini-M-23"
                },
                {
                    "user_id": "Shantèl Kim",
                    "user_href": "/profile/Shantèl-Kim"
                },
                {
                    "user_id": "Fire Wolf",
                    "user_href": "/profile/Fire-Wolf-90"
                }
            ]
        }
    ]
}