{
    "title": "Is Cubase 7 better than Logic Pro X? - Quora",
    "tags": [
        "Cubase",
        "Logic Pro (OS X app)",
        "Audio Software"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kasper Maxmiling Bach Hjorth",
                "href": "/profile/Kasper-Maxmiling-Bach-Hjorth"
            },
            "answer_text": "5 DAWs rule the world these days: Apple Logic Pro, Avid ProTools, Ableton Live, Steinberg Cubase, PreSonus Studio One and Image-Line's FL Studio (Previously Fruity Loops). They all have pros and cons... Logic is available for Mac OS only and currently FL Studio is a Windows only application... although FL can be run on OS X with a so-called wrapper. Which DAW is right for you, greatly depends on individual taste. I have used Cubase since version 1 (back when it had a black and white interface). I have also used ProTools 10 for a while, but I find that Logic Pro suits pretty much all my needs perfectly. I have also flirted with Ableton Live a couple of times... Ableton is very popular - especially among producers of electronic music - and the workflow is somewhat different from Cubase, Logic and PT. Both Cubase 7 (actually 8 by now) and Logic Pro X are impressive pieces of software that likely would not let you down in any aspect of your production.If you'd like a DAW that is available on both Macs and PCs, then obviously Cubase is the way to go. However, if you're a Mac-only person, I find that Logic is a bit more intuitive and easy to work with. Finally Steinberg charges you more than double the price for Cubase Pro 8 than Apple charges for Logic Pro 10.Also Logic comes bundled with LOTS of gigabytes of free, downloadable sounds - I believe more than Cubase. But my recommendation would be to go into your local music store and get a comprehensive demo and some hands-on experience with both DAWs to better make your decision. ",
            "date": "Updated August 11, 2018",
            "views": "1",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nnaemeka Nwaiwu",
                    "user_href": "/profile/Nnaemeka-Nwaiwu"
                },
                {
                    "user_id": "J K",
                    "user_href": "/profile/J-K-2969"
                },
                {
                    "user_id": "Scott Roller",
                    "user_href": "/profile/Scott-Roller-5"
                },
                {
                    "user_id": "Belator Fox",
                    "user_href": "/profile/Belator-Fox"
                },
                {
                    "user_id": "Abe Wiz",
                    "user_href": "/profile/Abe-Wiz"
                },
                {
                    "user_id": "Doc Clegg",
                    "user_href": "/profile/Doc-Clegg"
                },
                {
                    "user_id": "Shail Shah",
                    "user_href": "/profile/Shail-Shah-35"
                },
                {
                    "user_id": "Ameya Gundale",
                    "user_href": "/profile/Ameya-Gundale"
                },
                {
                    "user_id": "Timothy Yip",
                    "user_href": "/profile/Timothy-Yip-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bennett",
                "href": "/profile/Matthew-Bennett-36"
            },
            "answer_text": "The best DAW is the one you know how to use. If you know how to record, mix, and master, you don't need to use one of the 5 ruling DAWs. People are creating amazing music on Reaper (free forever trial, $60 to buy) and before that even they were creating amazing music on Audacity (free open source). They aren't creating good music because of the software, but because they learned the software, and they know how to create and mix music.  So look around, see which one you like the best, but they all do just about the same things, and if they don't, you can always add a plugin that does do the same thing.  To answer your (personal) question, no, Cubase is not better. Because I don't know how to use it, and I've never even played with it. I know Logic Pro X, because I learned about it, use it constantly, and keep learning about it.  You can't make the wrong decision here. ",
            "date": "Answered October 19, 2015",
            "views": "23",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Tom Alexis",
                    "user_href": "/profile/Tom-Alexis"
                },
                {
                    "user_id": "Tracy King",
                    "user_href": "/profile/Tracy-King-65"
                },
                {
                    "user_id": "Chad Davis",
                    "user_href": "/profile/Chad-Davis-124"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Rick Holladay",
                    "user_href": "/profile/Rick-Holladay"
                },
                {
                    "user_id": "Doc Clegg",
                    "user_href": "/profile/Doc-Clegg"
                },
                {
                    "user_id": "Yuri Polchenko",
                    "user_href": "/profile/Yuri-Polchenko"
                },
                {
                    "user_id": "Yannis Manolessos",
                    "user_href": "/profile/Yannis-Manolessos"
                }
            ]
        }
    ]
}