{
    "title": "Is Coachella worth it? - Quora",
    "tags": [
        "Coachella Music Festival",
        "Music Festivals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eytan Elbaz",
                "href": "/profile/Eytan-Elbaz"
            },
            "answer_text": "Unquestionably, Coachella is worth the price of admission. It’s the best party in the world - literally. The combination of the musical acts (bigger budget = better lineup), the scenic background (sundown is ridiculously gorgeous against the mountains), the soft grass (not always a given for a music festival), and 100,000 fans who are, for the most part, collectively in their best moods, makes for an unparalleled experience. If you wanted to throw this party yourself, it would cost you $50M. But you can attend for just $500. It’s a great deal, and it’s worth every penny. But I imagine that you are really asking a different question, and that is: ‘Should I go to Coachella?’, ‘Will it be a worthwhile experience for me to spend these $500 on?’ The answer to that question is more complicated and a bit philosophical. The answer to that question is : “Maybe yes, maybe no, depends on a lot of factors, and you won’t know the answer until after you go.” While Coachella is just 3 days long, in some ways, it’s a lot like a mini-life. We have times in our life where we make new friends, or find a magical new love interest, run into your old friends, or just feel the intensity of the insanely hyper-charged party atmosphere. And then on the best Coachella days, we might hang/dance/party directly with those rock stars who also came for that same party that you did. Coachella is just like that — with 100,000 people, 88% of them drunk or high, and the world’s greatest musicians playing for you, there are literally a 100 trillion combinations of what can happen in your weekend. It’s like cramming 30 different parties, each party with 3000 different people, into a 72 hour period. Many of those combinations are going to be phenomenal — because you are surrounded by so many of the key requirements for a great time, this continuous dance party that never stops, because you can keep running from tent to stage, stage to tent, for another band, holding some random hand, ducking in and out of the crowd, laughing your face off. At the same time, it can also be the opposite. Cellphones don’t work well, and you might lose your friend(s) or maybe you didn’t come with any and you didn’t make any. It’s huge, so you might not find your friend(s) for the rest of the night once you lost them. The ‘meeting place’ didn’t work or nobody showed up there. You may not find a love interest, or you might be unhappy with them one you came with, and in the midst of 100,000 screaming people having the best times of their life, you might feel like ‘I am not having the best time of my life right now’, and looking out at the insane party around you, that moment may feel like an isolating, sad, and lonely experience. It even accentuates it. It’s not a big deal to have a bad time at a shitty party, but it feels like a big deal to have a bad time at the best party. And, like life, I think there is a very fine line between one and the other. A chance event experience might have milliseconds of sensitivity: He didn’t catch your eye, you didn’t catch his hand, she went to see the wrong band, they were in the Mojave tent, you couldn’t get the drug you wanted, the person you wanted to be with was in a different plane than you were at that precise moment, she was wearing a VIP wristband, and you couldn’t get through the gate, you lost your wallet or your pill or your bag, your friend bailed on you for some random they found, you didn’t get enough sleep last night, it’s too damn hot today, it’s too damn cold tonight, your friend isn’t a festival person, or simply you just weren’t feeling it yourself. Just like life…we have great days, we have difficult days. We don’t know going into a day/month/year whether it’s going to be good or bad. It’s not something any of us can predict with any degree of certainty. If you are thinking about going to Coachella, just Go. I can’t tell you whether you will have a good time or not because the world is a chaotic place. It might be great, it might suck, or maybe it will both be great and suck. If you really, really want to ensure you have that once-in-a-lifetime, worth the money, memory, then go 3 separate times, and I think there is a really great chance that at least 1 of them will be that for you. Have fun, and bring your best vibes with you. Everyone there just wants to have fun. ",
            "date": "Answered June 5, 2019",
            "views": "597",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farah Munirah",
                    "user_href": "/profile/Farah-Munirah-1"
                },
                {
                    "user_id": "Jason Whyte",
                    "user_href": "/profile/Jason-Whyte"
                },
                {
                    "user_id": "Daniel Law",
                    "user_href": "/profile/Daniel-Law-34"
                },
                {
                    "user_id": "GJ Coop",
                    "user_href": "/profile/GJ-Coop"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frazier Kecia",
                "href": "/profile/Frazier-Kecia"
            },
            "answer_text": "I’m ALL for a great CONCERT. It’s like a modern day WOODSTOCK. It’s what happened at COACHELLA that is alarming and NOT worth it! Can’t catch HERPES at HOME listening to those same artists in the COACHELLA line up. ",
            "date": "Answered May 3, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Allie Moore",
                    "user_href": "/profile/Allie-Moore-39"
                }
            ]
        }
    ]
}