{
    "title": "Is downloading music in India illegal? - Quora",
    "tags": [
        "Internet Piracy",
        "Downloading Music",
        "Copyright Infringement",
        "Laws in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Dunn",
                "href": "/profile/Mark-Dunn-64"
            },
            "answer_text": "Laws vary by jurisdiction. Some places don’t care what music you download.Some places have restrictions that stretch beyond the concerns of rights holders.Some places enforce “intellectual property” legislation or other forms of economic exploitation through artificial scarcity.So, legality depends on: where you are, how you are downloading something, where you are downloading it from, and what you are downloading. Each factor can potentially impact whether what you are doing is legal or illegal. The same content can potentially involve legal and illegal methods of transfer, even in the same jurisdiction. The bigger question is whether or not you should care what the law says. The government does not know whether or not it is better for you to download that music, nor whether or not it is better for anyone else. Make decisions based on their risks and benefits, not what some random person or group of people say. Keep in mind that “risks can entail legal as well as social consequences. ",
            "date": "Answered May 30, 2017",
            "views": "53",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Koraw Skatoula",
                    "user_href": "/profile/Koraw-Skatoula"
                },
                {
                    "user_id": "Anuj Kumar",
                    "user_href": "/profile/Anuj-Kumar-6680"
                },
                {
                    "user_id": "Kenneth Perinchief",
                    "user_href": "/profile/Kenneth-Perinchief"
                },
                {
                    "user_id": "Jack Wood",
                    "user_href": "/profile/Jack-Wood-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Woodcock",
                "href": "/profile/Mary-Woodcock-10"
            },
            "answer_text": "Yes if you’re downloading it without permission from the rights holders of that music. i.e. If an artist says, ‘download my track for free here’ then obviously that’s fine. However if you’re downloading music from people who don’t own the rights to that music, that’s illegal. Music is protected by copyright (rights to own and do a certain few things with that music). This is usually owned by the artist themselves, songwriters, or labels and publishers that represent them. People who don’t own these rights, yet take music and upload it online for people to download for free are doing so illegally. By partaking in this and downloading said music, you are also doing so illegally. Hope that clarifies! ",
            "date": "Answered June 26, 2019",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muskan Garg",
                    "user_href": "/profile/Muskan-Garg-54"
                },
                {
                    "user_id": "Anuj Kumar",
                    "user_href": "/profile/Anuj-Kumar-6680"
                }
            ]
        }
    ]
}