{
    "title": "Is Elton John alive or dead? - Quora",
    "tags": [
        "Elton John",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Ray Laemmle",
                "href": "/profile/Michael-Ray-Laemmle-1"
            },
            "answer_text": "If you mean physically, no. If you mean spiritually and emotionally, yes. He recently retired from touring. Sure, he’ll have comeback concerts and all that, but he’s just tired of playing all those hits he’s been playing for forty years. Playing Crocodile Rock for you night after night has killed him inside. A little bit more with each performance. Why have you done this to him? Made him dance for you? Made the light inside him dimly die so that, as a fan of his music, you could make this dancing, singing, piano-playing monkey amuse you? That’s vampirism! Also, he wears a lot of strange wigs. Also, he sends flowers to himself every day. Also, Trump used Rocket Man as a nickname for Kim Jong Un. This name came from Elton John’s song. That’s an interesting Fun Fact. Yes, Elton John is very, very tired. And he will be dead soon. And he can finally rest. He can finally stop performing. He can finally stop dancing. He yearns for this. His soul begs for the soundest slumber. The relief that only death and the grave can bring.  ",
            "date": "Answered January 26, 2018",
            "views": "267",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kosi Onwuamaegbu",
                    "user_href": "/profile/Kosi-Onwuamaegbu"
                },
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                },
                {
                    "user_id": "Jean O'Boyle",
                    "user_href": "/profile/Jean-OBoyle-2"
                },
                {
                    "user_id": "Acänixia Käuradénâka",
                    "user_href": "/profile/Acänixia-Käuradénâka"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Andy Walker",
                    "user_href": "/profile/Andy-Walker-145"
                },
                {
                    "user_id": "Ree Rudd",
                    "user_href": "/profile/Ree-Rudd"
                },
                {
                    "user_id": "Michelle Cano",
                    "user_href": "/profile/Michelle-Cano-20"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hannah-1445"
                },
                {
                    "user_id": "Dominic Wells-Cole",
                    "user_href": "/profile/Dominic-Wells-Cole-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Sheward",
                "href": "/profile/Mike-Sheward-1"
            },
            "answer_text": "Elton John….Dead ?….Information…. No…..His music may appear to be, but he is still thriving.  Elton John… Musician…And one of the leading “Glam Rock” artists…Certainly the most colourful of his kind.  Sir Elton Hercules John, CBE, is an English singer, pianist, and composer. He has worked with lyricist Bernie Taupin as his songwriting partner since 1967; they have collaborated on more than 30 albums to date. In his five-decade career Elton John has sold more than 300 million records, making him one of the best-selling music artists in the world.  Most famous for “Candle In the Wind”…Twice…First as song for the memory of Marilyn Monroe, and later for Lady Diana Spencer, after her death in a car crash in France.  “Your Song”… which originally appeared on John's self-titled second studio album.  And “Tiny Dancer”… from the “Madman across The Water” album. To find out more about Elton John…Please follow the link below… Elton John - Wikipedia Or please step into the Comments “Black Hole”….For more information…gathered from “Wikipedia”…The “Free encyclopedia”  ",
            "date": "Updated June 12, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shari Goldstein",
                    "user_href": "/profile/Shari-Goldstein-8"
                }
            ]
        }
    ]
}