{
    "title": "Is Eric Clapton racist? What proof is there of this? - Quora",
    "tags": [
        "Eric Clapton",
        "Blues Music",
        "Classic Rock Music",
        "Guitarists",
        "Rock Music",
        "Racism",
        "Musicians",
        "Race and Ethnicity",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Griffin",
                "href": "/profile/Thomas-Griffin-31"
            },
            "answer_text": "He certainly seemed to harbor some racist views back in the 70s, and maybe before. On a fateful night in Birmingham, England in 1976, an allegedly intoxicated Eric Clapton went on an onstage rant against immigrants, threatening that Britain was on the verge of becoming a “black colony” and started chanting “Keep Britain White!”, as well as citing support for then-British politician, Enoch Powell, a far-right conservative. Now, note what I said just before about him being “allegedly intoxicated”; Clapton himself later gave that excuse, and I`ll leave it up to you all to decide if that`s good enough. Personally, I think the only effect alcohol had on things was he otherwise may not have said it out loud or in such a way had he been sober, but I do think he really meant those words. However, people change. Clapton does have a history of severe substance abuse, and he went to rehab not long after that, after which his music promptly took a nosedive (sorry, Eric). Today, he plays songs with and written by black blues artists, and I feel like if he REALLY had a problem with people of other races, he wouldn`t have made an album with B.B King or let Gary Clark, Jr. into his Crossroads Festival. I`m willing to bet Eric Clapton has gotten his shit together a bit more these days, as evidenced by his frequent collaborations with black musicians. However, let`s not let him totally off the hook. Evidence suggests Clapton is still a political conservative, and while he backed off his racist remarks years later, he did maintain that Enoch Powell`s views and comments which inspired his own were relevant. In conclusion, maybe Eric Clapton is one of those “I have black friends” racists; not racist enough to actually not want to be around any black people at all, but subconsciously harbors the condition that they have to be successful and not too poor and sad. After all, that`s what a lot of western racism is all about today; disdain for the poor and the needy. ",
            "date": "Answered April 2, 2019",
            "views": "595",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                },
                {
                    "user_id": "Walt Kimbrough",
                    "user_href": "/profile/Walt-Kimbrough-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walt Kimbrough",
                "href": "/profile/Walt-Kimbrough-1"
            },
            "answer_text": "At one point, he made this statement at a concert in Birmingham (UK) in 1976: “I don’t want you here, in the room or in my country,” Clapton declared. “Listen to me, man! I think we should vote for Enoch Powell. Enoch’s our man. I think Enoch’s right, I think we should send them all back. Stop Britain from becoming a black colony. Get the foreigners out. Get the wogs out. Get the coons out. Keep Britain white. I used to be into dope, now I’m into racism. It’s much heavier, man. Fucking wogs, man. Fucking Saudis taking over London. Bastard wogs. Britain is becoming overcrowded and Enoch will stop it and send them all back. The black wogs and coons and Arabs and fucking Jamaicans and fucking … don’t belong here, we don’t want them here. This is England, this is a white country, we don’t want any black wogs and coons living here. We need to make clear to them they are not welcome. England is for white people, man. We are a white country. I don’t want fucking wogs living next to me with their standards. This is Great Britain, a white country. What is happening to us, for fuck’s sake?” He’s since apologized for the above statement. ",
            "date": "Answered April 1, 2019",
            "views": "43",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tara-M-204"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                },
                {
                    "user_id": "Jordan Lubus",
                    "user_href": "/profile/Jordan-Lubus"
                },
                {
                    "user_id": "Jean Willow",
                    "user_href": "/profile/Jean-Willow"
                },
                {
                    "user_id": "Shyam Kannan",
                    "user_href": "/profile/Shyam-Kannan-5"
                },
                {
                    "user_id": "Ronith Bhaumik",
                    "user_href": "/profile/Ronith-Bhaumik-1"
                },
                {
                    "user_id": "David Soler",
                    "user_href": "/profile/David-Soler-1"
                },
                {
                    "user_id": "David Attaway",
                    "user_href": "/profile/David-Attaway"
                }
            ]
        }
    ]
}