{
    "title": "Is Got7 gay? - Quora",
    "tags": [
        "GOT7 (K-pop group)",
        "Homosexuality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liv Smith",
                "href": "/profile/Liv-Smith-95"
            },
            "answer_text": "I think they’re all straight except for Bambam. Now, at first, I thought Bambam was straight. I didn’t want to generalize him simple because he has feminine mannerisms. I also assumed that he just liked skinship and he had to act like that towards the members for his job. While I do believe that kpop companies make these idols do fanservice, I do believe that Bambam is gay because now I noticed that he doesn’t seem into women and there’s this video of him dancing during a concert where he’s literally putting his hand to his mouth imitating giving a blowjob. That’s just not something straight men do. Here’s the link to the video (go to 0:20) to find the video of Bambam:  There is no heterosexual explanation for that. And no, I don’t believe JYP told Bambam to do this. Two of the other members are sitting to the right of Bambam. One of them is JB but I can’t tell who the other one is cause the vid is blurry. The other member laughs after Bambam imitates giving a blowjob while JB at first looks surprised and then laughs. ",
            "date": "Answered October 31, 2020",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fwink Chung",
                "href": "/profile/Fwink-Chung"
            },
            "answer_text": "Obviously, we shouldn’t make assumptions about one’s sexuality, but I’m going to do it anyways. In all honesty, I don’t think any of them are gay. For the most part, they all show pretty masculine qualities, except maybe BamBam. There has been dating rumors for BamBam though (like with Mina) and he shows a lot of cringy male-style moments, so I wouldn’t be surprised if he’s straight. But often the way he acts and is a fashionista might imply that he’s bisexual, but we don’t know. Also to note, I believe BamBam is the only member who doesn’t actually work out (to gain muscles) which is kind of a masculine type of desire. ",
            "date": "Answered May 21, 2020",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Bunduc",
                    "user_href": "/profile/Maria-Bunduc"
                },
                {
                    "user_id": "Yadeliz Rosario",
                    "user_href": "/profile/Yadeliz-Rosario-1"
                }
            ]
        }
    ]
}