{
    "title": "Is Guilliani's appearance in the new Borat movie the real October surprise? - Quora",
    "tags": [
        "October Surprise (politics)",
        "Borat (2006 movie)",
        "Rudy Giuliani (former politician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roland Temmerman",
                "href": "/profile/Roland-Temmerman-1"
            },
            "answer_text": "Hello! Yes! It most certainly looks like it! Here’s a pic that leaked:  So Giuliani was ringing the Devil’s doorbell aka his favorite snugglebunny… From The Guardian: In the film, [Rudy Giuliani], the former New York mayor and current personal attorney to Donald Trump is seen reaching into his trousers and apparently touching his genitals while reclining on a bed in the presence of...[an actress] posing as a TV journalist. Rudy Giuliani faces questions after compromising scene in new Borat film The actress, Maria Bakalova is the 24 year-old posing as a 15 year-old in the scene in which Giuliani touches himself on a bed while watching her (and being secretly recorded in *exactly* the fashion Russian intelligence would, and, we must now think, definitely *has* and many times).  I wonder what QAnon conspiracy loons—who are passionately \"anti-pedophilia,\" according to Donald Trump—will now have to say about Donald Trump's lawyer *on video* preparing to sleep with someone posing as a 15 year-old girl from a former Soviet republic… Here’s another pic:  And here’s the video so you can make up your own mind: So here's the newsworthy Rudy Giuliani Borat clip. You be the judge. pic.twitter.com/exidMLey6p— Tommy X-TrumpIsARacist-opher (@tommyxtopher) October 23, 2020\n Speaking about Soviets. It is inconceivable that such a…sexually compromising and embarrassing situation hasn’t happened before and orchestrated by Putin’s FSB and I bet they have the receipts to prove it. Rudy Ghouliani is a Russian asset and Trump’s top henchman/stooge, which makes this even more appalling, revolting, egregious. On the bright side, if you have “Rudy Nosferatu goes Toobin on camera with Borat’s teenage daughter” on your 2020 Trumpocalypse nutfuckery bingo card, you’re definitely a winner! So thank you Borat for trying to save our democracy by exposing these pervs for what they truly are… The movie will be released next Friday. ",
            "date": "Updated October 24, 2020",
            "views": "133",
            "upvotes": " View 3.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Terry Constanti",
                    "user_href": "/profile/Terry-Constanti-1"
                },
                {
                    "user_id": "Francisco Javier Bernal",
                    "user_href": "/profile/Francisco-Javier-Bernal"
                },
                {
                    "user_id": "Sakari Malinen",
                    "user_href": "/profile/Sakari-Malinen"
                },
                {
                    "user_id": "Judi Trotter",
                    "user_href": "/profile/Judi-Trotter"
                },
                {
                    "user_id": "Annmarie Preece",
                    "user_href": "/profile/Annmarie-Preece-1"
                },
                {
                    "user_id": "Rob Lewis",
                    "user_href": "/profile/Rob-Lewis-52"
                },
                {
                    "user_id": "Michelle Martin",
                    "user_href": "/profile/Michelle-Martin-245"
                },
                {
                    "user_id": "Joseph Lents",
                    "user_href": "/profile/Joseph-Lents"
                },
                {
                    "user_id": "Daniël Moltzer",
                    "user_href": "/profile/Daniël-Moltzer"
                },
                {
                    "user_id": "Tom Slijkerman",
                    "user_href": "/profile/Tom-Slijkerman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson McKeeby",
                "href": "/profile/Nelson-McKeeby"
            },
            "answer_text": "I need to make an answer that will not make anyone happy. I do have to use plain language in rather harsh terms because I find that the conspiracy set has problems understanding English. Maybe I type too fast for the. Here is statement number one: Every poster who yells about Hunter Biden when that gentleman was exonerated and shown to be a target of a foreign dirt operation is a low life Quisling America hater pissing on our flag and doing business for our implacable enemies and I hope when you meet the afterlife that my prayers aid you to find joy rather than damnation. There, I said it. But there is another side to this. I have met Sasha Cohen on numerous occasions. The man is a genius in his field, a once in a century mind, and has a unique sense about how to get hypocrites to be hypocrites. However, Unless I had access to the raw footage of what Cohen shot I would not trust his narrative any further than I would trust the same narrative handed to me by Mr. Giuliani . Sasha is an entertainer. He is not a journalist, is not a documentary maker, has no ethical requirement that he be anything but funny, and even that he can fail at, because hell, it's art. Now, Giuliani is a lawyer and an officer of the court and I am disgusted by his low life acts because he has a ethical guideline, and he takes so much joy in shitting on the constitution and wiping his ass on our flag that I have no skin in the game of blaming him for being Satans second child, but only if there was good evidence of it. His failure to show a birth certificate proving he was a live birth human being and not a partial birth abortion from a tunicate does not represent proof he is a sea scum. So far, a lot of people are yelling a lot about a few out takes when even when I see the final product I might stop and question its veracity. Giuliani is a foreign agent, a traitor, and a soon to be convicted felon, and there is a lot of proof for this, but lets not start getting on him for what is a clever setup. ",
            "date": "Updated October 24, 2020",
            "views": "261",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilya Taytslin",
                    "user_href": "/profile/Ilya-Taytslin"
                },
                {
                    "user_id": "Aaron Williams",
                    "user_href": "/profile/Aaron-Williams-243"
                }
            ]
        }
    ]
}