{
    "title": "Is GarageBand better than Fl Studio? - Quora",
    "tags": [
        "Garageband"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicholas Maximilian Dreyer",
                "href": "/profile/Nicholas-Maximilian-Dreyer"
            },
            "answer_text": "I don’t have as much experience with Garageband as with FL studio, and that experience was from whatever version of Garageband was in production back when FL studio was still Fruity Loops. (Good rebrand btw.) I would say that FL Studio is probably viewed as the more ‘professional’ option by some. It is also more geared toward electronic music production. It also costs money. So these are things to consider. Garageband is a fine piece of software, that I would use without a shred of embarrassment to record and produce were I in a position where I couldn’t use my normal setup. The thing is, in the end, a DAW is just a bunch of tracks, and volume knobs, and eqs. There are all kinds of features and tricks. Some are more intuitive. Sometimes you find that plugin that sounds great. But at the end of the day the tracks you record are the most important part of anything getting mixed down, and which DAW you choose doesn’t really have much to do with that. So you want to choose a DAW that just is fun and easy for you to use. Personally I use Reaper, which is excellent and quite cheap. I highly recommend it. However, it might not be the DAW I would choose to learn on. I guess it boils down to: I’d recommend FL studio if you are looking to produce electronic music, and Garageband if you are looking to record external sounds. Either DAW can also do the other task, but FL leans electronic and Garageband leans recording. ",
            "date": "Updated November 25, 2017",
            "views": "96",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bastiaan Van Zwieten",
                    "user_href": "/profile/Bastiaan-Van-Zwieten"
                },
                {
                    "user_id": "Kevin Maddalena",
                    "user_href": "/profile/Kevin-Maddalena"
                },
                {
                    "user_id": "Edward Ellis",
                    "user_href": "/profile/Edward-Ellis-36"
                },
                {
                    "user_id": "Matthew Davies",
                    "user_href": "/profile/Matthew-Davies-97"
                },
                {
                    "user_id": "Andrew Lee",
                    "user_href": "/profile/Andrew-Lee-1372"
                },
                {
                    "user_id": "Ric Flo",
                    "user_href": "/profile/Ric-Flo"
                },
                {
                    "user_id": "New Singer New Song",
                    "user_href": "/profile/New-Singer-New-Song"
                },
                {
                    "user_id": "Luděk Sévérine",
                    "user_href": "/profile/Luděk-Sévérine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall William Chettleburgh",
                "href": "/profile/Randall-William-Chettleburgh"
            },
            "answer_text": "Again, sounding like a broken record..no pun intended it really depends on what type of music your making. Garageband is more powerful than most people think and very very easy to use. It has fairly decent sounds….FL Studio is far better for both the onboard synths, beat creation and the ability to use delay, etc. for starting/stoping sounds at a certain point. I use Ableton and Reason, but I have used FL Studio. It’s a personal bias but I’ve had bad luck with the company that makes FL from buying VSTS and never getting them out of DEMO mode…total waste of money and I thought Native Instruments was difficult to get an answer from. This company - based out of Belgium NEVER answered anything, at LEAST NI answered me (it only took a YEAR about a Maschine 2 question) BUT in my experience and talking with others..for simple off the top of your head projects or ideas..GarageBand is great…for quick fix ideas, the use a heavier DAW like FL to expand upon it, as it gives you awesome beat making control, cool synths etc. This is HIGHLY subjective so it’s only my opinion, I absolutely guarantee you that one person will swear by Reason, one Ableton, one BB, one Fruity Loops etc. BUT have fun. and expect to spend a LOT of love snaps on this..as the TOYS are expensive and HIGHLY addictive and they should have meetings for ELECTRONIC MUSIC EQUIPMENT ADDICTS anonymous! ",
            "date": "Answered October 20, 2017",
            "views": "6",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Maddalena",
                    "user_href": "/profile/Kevin-Maddalena"
                },
                {
                    "user_id": "Matthew Zybala",
                    "user_href": "/profile/Matthew-Zybala"
                }
            ]
        }
    ]
}