{
    "title": "Is it true that record players have the best sound quality, as compared to cassettes and digital music? Comparatively analyze the various different digital sound formats. - Quora",
    "tags": [
        "Sound Quality",
        "Players",
        "Vinyl Records",
        "Audiophiles",
        "Audio",
        "Sound",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "JG McLean",
                "href": "/profile/JG-McLean"
            },
            "answer_text": "Is it true that record players have the best sound quality, as compared to cassettes and digital music? Short answer: NO, BUT: NO, Digital formats including CD can deliver significantly better sound quality than any \"record player\"BUT the best sound for a given recording is sometimes available only on a record. Be warned: This is a topic that will bring out the worst in many audiophiles and has been known to cause otherwise-reasonable men to come to blows. Here's the engineering perspective in a nutshell: Human range of hearing extends from 20Hz - 20,000Hz (note 1); The sampling rate for CDs is sufficient to fully capture sound in this range;Digital samples allow for perfect recovery of the original analog signal when properly decoded (via the Nyquist–Shannon sampling theorem ) (note 2);The Dynamic Range (difference between loud and soft sounds) capabilities of CD audio are greater than that of LP records.Therefore CDs can perfectly capture and recover sound beyond the capabilities of records. (Note 3). In other words, if an LP record and a CD are created from the same master source with no differences in settings, and each are played back on properly-designed equipment, the CD will deliver at least as accurate of a representation of the original as the LP (and will be immune to transmitted mechanical noise, surface noise and wear that can impact the sound of an LP). Now, here's where things get tricky. The above paragraph is a big \"if\", because the mastering processes -- those steps that are taken to move the master recording to the final product -- for LPs and CDs are inherently different, and these processes can result in significantly different-sounding recordings. I mentioned above that CDs can handle greater dynamic range; this is true but greater is not always better in this case. Early CD mastering engineers were determined to \"take advantage\" of all that range. So we got recordings whose quiet parts could only be heard when listening carefully with the volume turned up in a very quiet room while the loud parts -- at over 90 decibels above the audible baseline -- would damage your hearing and your relationships. Such recordings are OK for audiophile demos but are largely useless in \"normal\" listening environments such as cars or personal devices. (Note 4). As time went on digital mastering trends moved towards less and less dynamic range and higher and higher average levels of signals (a phenomenon known as the Loudness war ). This, too, results in bad recordings, since some amount of dynamic range is necessary to preserve the impact and realism of music. Interestingly, the dynamic range capability of an analog LP record (between 50-65dB depending on various factors chosen by the mastering engineer) seems to hit a sweet spot of having enough dynamics to be pleasing but not being so dynamic as to require constant volume adjustments to listen to comfortably. Moreover, LP mastering trends have been much less volatile and more consistent over the years. (Note 5). As a result many CDs out there are actually worse recordings (for one reason or another) than their LP counterparts. But note that this is not a function of the technology but the way it has been used (and abused). But there's another factor at work here. Digital music, in the form of CDs or MP3s, is optimized for mobile use. Most of us listen to digital music on the go -- through cheap earbuds at the gym or on a car stereo on a noisy road -- while traffic or other distractions compete for our attention. Playing a record, on the other hand, requires much more commitment and focus. You are, by definition, in one place (where the record player is). You are actively selecting and initiating the experience rather than \"letting it shuffle\". You are likely using the best equipment you own or have access to to do this listening and are less likely to be distracted. You have a big sleeve with cool artwork in your hands. Is it any wonder this has gained a reputation as a superior experience? In the end, though, you could take that same LP, use it to master a CD, pops, clicks, and all, play it on a decent CD player through the same stereo, sit down and listen and get the same audible experience. (Note 6). And sitting down with a really well-recorded and mastered CD and listening attentively will reveal details and subtleties that might easily be missed on a worn, dirty, or scratched LP. But I don't begrudge anyone their preferences; it's the music that's the thing and if vinyl brings you closer to it, more power to you.  Edit: at some point in its history, this question was edited to include a reference to cassettes as another alternative format. I’ve added some thoughts on this in Note 7.  NOTES: Note 1: LPs can contain signals of higher frequency than 20HKz; some recordings contain content as high as 35KHz. Most adult humans cannot hear nearly as high as 20KHz, however some audiophiles subscribe to theories that these \"supersonics\" can be sensed in other ways and/or can subtly interact with audible sounds to change the nature of the experience. None of these theories have been actually proven in double-blind studies. Note 2: This is why you can immediately dismiss anyone who blithely says \"analog is better\" on the basis that digital music somehow has \"gaps\" or less information than an analog signal -- the output of a properly-designed digital music player is an analog signal, and that signal is a complete and highly-accurate version of the original waveform (within the frequency limits dictated by Nyquist). It's math. Note also that nearly every new recording that makes it to vinyl today (for example the hipster-preferred LP version of the new Decemberists set) has been through many digital recording and processing steps prior to making it to those vinyl grooves. Note 3: I am limiting my discussion to CDs here rather than trying to cover both the lower-end of digital audio (ie. low-bandwidth MP3s) and the higher end (high-resolution formats such as SACD) which have had low adoption rates. Poor MP3s will indeed have artifacts and sound worse than records; higher end formats are mostly gilding the lily but are at least as good as the CD technology I'm focusing on. High-bandwidth MP3s (320 kB/s and better) and lossless digital formats have been shown to be indistinguishable from CD originals in double-blind studies, and therefore the analysis here applies to those cases as well. Note 4: Many early CDs had a multitude of other sins as well, including being sourced using the wrong types of master tapes (such as third-and-fourth generation duplication masters optimized for cassette production) and being mastered using very early equipment that did a poor job on the digitizing. These flaws -- often described with words like \"harsh\", \"grainy\", or \"metallic\" as opposed to the \"warm\" or \"smooth\" sound of LPs -- were largely corrected within the first 2 years of CD production but wound up damaging the reputation of the CD medium itself among many audiophiles, in some cases permanently. Note 5: There is the additional possibility that a record player -- the chain of signal from the stylus, cartridge, and phono pre-amplification -- can actually alter the sound in a pleasing way. This is an ironic possibility since the stated goal of audiophile reproduction is to avoid any opportunity for distortion or coloration of the original sound, but it may account for some of the preference for analog. Of course to the extent that artists want their music to sound a certain way, they can equalize or otherwise color their work to sound that way on CD too. Note 6: Of course one can have an active, focused listening experience regardless of the media. This is why double-blind studies (where by definition the listeners are fully engaged and not influenced by psychological bias) tend to disprove theories that analog formats sound inherently better than digital ones. Note 7: Cassettes don’t impact this discussion much for two reasons. First, commercial pre-recorded cassettes, produced on cheap tape stock run on high speed duplicators, are generally so low in fidelity as to be clearly inferior to nearly any point of comparison. Enthusiasts point to the excellent results possible with high-end cassette recorders (such as the fabled Nakamichi Dragon) using top-level tape stock; the issue with this as applied to this discussion is that making such cassettes requires an original source which is almost always either CD or vinyl, which takes us right back to the main discussion about those formats. ",
            "date": "Updated June 10, 2019",
            "views": "505",
            "upvotes": " View 607 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Gibson",
                    "user_href": "/profile/Nick-Gibson-7"
                },
                {
                    "user_id": "Ethan Hein",
                    "user_href": "/profile/Ethan-Hein"
                },
                {
                    "user_id": "Graham Cox",
                    "user_href": "/profile/Graham-Cox-18"
                },
                {
                    "user_id": "Kokoyo Villagomez",
                    "user_href": "/profile/Kokoyo-Villagomez-1"
                },
                {
                    "user_id": "Predrag Vasić",
                    "user_href": "/profile/Predrag-Vasić"
                },
                {
                    "user_id": "Vin Power",
                    "user_href": "/profile/Vin-Power"
                },
                {
                    "user_id": "Gino Llerena",
                    "user_href": "/profile/Gino-Llerena"
                },
                {
                    "user_id": "Phil Cabrera",
                    "user_href": "/profile/Phil-Cabrera-2"
                },
                {
                    "user_id": "J Norton",
                    "user_href": "/profile/J-Norton-7"
                },
                {
                    "user_id": "Dan O Brien",
                    "user_href": "/profile/Dan-O-Brien-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Howell",
                "href": "/profile/Dave-Howell-7"
            },
            "answer_text": "This reminds me of when Babylon 5 first aired. It was the first science fiction television series to use CGI for the spacecraft, rather than motion-controlled cameras and miniature models. \"I don't like their spaceships,\" a friend of mine said. \"They don't look real.\" \"You mean they don't look like little plastic space ships.\" Both CDs and vinyl involve huge compromises in terms of sound reproduction. Although notes that CDs are limited to (<22,000 Hz) are above the range of most human's hearing, the consequences of that do extend downward into the audible range. Those effects can be reduced with careful design of the electronics, but generally you won't find that kind of care in equipment that's less than a couple of thousand dollars. Vinyl, on the other hand, is seriously handicapped at the low end. A loud bass drum would cause the groove on a record to have to move so far that it would cut into the next groove over, so low frequencies are dialed way down for pressing onto vinyl, and then the home amplifier runs them through a filter that reverses the effect. I've performed with symphony orchestras, in marching bands, in large classical choirs and small jazz choirs. I don't think either CDs *or* vinyl sound especially 'real.' I think digital is much better than vinyl on really cheap equipment. On a system between, say, $400 and $2000 or so, I wouldn't be surprised if a $200 turntable and a really good record sounded more real than a CD in a $200 CD/DVD combo player. However, one of the things that makes actual live music sound so great is the dynamic range. That amazing downbeat for \"O Fortuna,\" the opening number of Carmina Burana? Wow. Then, just a few seconds later, the whisper of \"semper crescis, auf de crescis...\" Vinyl just flat out cannot do that. If you record it at a low enough level to keep the loud part from cutting into the neighboring grooves, the quiet is so quiet that it's almost impossible to stamp that subtle a wiggle into the vinyl. The CD audio standard has an amazing dynamic range. One of the first CDs I ever bought was a Telarc sampler that included an excerpt of the 1812 Overture, with real cannons. In the end, although the CD might have had the full dynamic range of that music, it didn't matter, because the stereo couldn't play it. I was in a science club in high school, and we were buying a new stereo to play music during the lunch hour, and I had a receiver with 1000 watts per channel. Trying to play the 1812 caused it to shut down. In order to actually play the cannon blasts, the volume had to be turned down to where the symphonic part was just way too quiet. Then there's the fact that both CDs and vinyl record, at most, two channels of sound (yes, even if you have Dolby 5+1 playback, if it's coming from a compact disc or a record, it's reconstructed from two channels). \"Real\" music, if it involves more than two performers, doesn't just come from two places. As an instrumentalist, I'm primarily a percussionist, and generally speaking, percussion instruments are the hardest to reproduce on recordings. To recreate a bass drum takes massive amounts of power; to get a cymbal or tamborine right requires extreme precision at the highest frequencies. I've heard a stereo play back a tambourine well enough to sound 'real' to me exactly twice in my life. The first time involved six-foot tall Magneplanar speakers that I think cost around $12,000 for the pair. I have no idea what the rest of the equipment attached to them cost, but it was probably between $20k and $30k. The other time a speaker actually sounded 'real' to me (with a drum set ride cymbal), it involved some JBL speakers with titanium tweeters, and once again, the whole stereo system was well over $20,000. (Both times, the sound source was a CD.) So why does vinyl sound more 'real' TO YOU than compact discs? Could be any one of a number of reasons. It's what you've grown accustomed to, or you listen to music that suits vinyl better than CDs, or you've got a better turntable than CD player, or you're less sensitive to the audio compromises typical of vinyl vs those common to CDs. Finally, please note that this entire essay was comparing compact disc digital audio and stamped vinyl records. On the analog side, 15 inches per second 1\" wide two-track magnetic tape will totally outperform both of those, but 96KHz sample-rate 24-bit digital recording would crush them all in terms of fidelity. Even then, you still won't be able to hear what I hear when I'm playing with an orchestra. Musicians on all sides of me, with every instrument's sound unaltered by anything besides the air itself? *That's* real. Enjoy and use which ever technology sounds better to you. As far as I'm concerned, they're both so far from 'real' that it doesn't really matter that much which one I listen to. Addenda: Since I originally answered this, the question was merged with another that includes cassettes. The Compact Cassette miniaturized reel-to-reel tape format definitely is much worse at reproducing music than either an LP or a CD. It was just sooooo much more portable than an LP, and even after CDs came out, it was quite a few years before you could ‘burn’ a CD with anywhere near the ease you could record onto a cassette. ",
            "date": "Updated May 24, 2018",
            "views": "97",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Graham Knight",
                    "user_href": "/profile/Graham-Knight-37"
                },
                {
                    "user_id": "Arya Manjhani",
                    "user_href": "/profile/Arya-Manjhani-1"
                },
                {
                    "user_id": "David Jenks",
                    "user_href": "/profile/David-Jenks-2"
                },
                {
                    "user_id": "Michael C. Goncalves",
                    "user_href": "/profile/Michael-C-Goncalves"
                },
                {
                    "user_id": "Damon Campagna",
                    "user_href": "/profile/Damon-Campagna"
                },
                {
                    "user_id": "Ribaldo Salvatierra",
                    "user_href": "/profile/Ribaldo-Salvatierra-1"
                },
                {
                    "user_id": "Mohd Nazri",
                    "user_href": "/profile/Mohd-Nazri-4"
                },
                {
                    "user_id": "Vin Power",
                    "user_href": "/profile/Vin-Power"
                },
                {
                    "user_id": "Joshua Merrill",
                    "user_href": "/profile/Joshua-Merrill-16"
                },
                {
                    "user_id": "Marie Lyn",
                    "user_href": "/profile/Marie-Lyn-5"
                }
            ]
        }
    ]
}