{
    "title": "Is it a sin or is it appropriate for Christians to make secular music? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Carlet Langford",
                "href": "/profile/Carlet-Langford"
            },
            "answer_text": "I think it depends, really. First, there is nothing inherently evil about secular things. Christians are in this world, and much of our lives is secular by necessity; we are not in heaven and that is really the only way we will be free of secular influences. We have secular jobs, people in our lives who are not believers, we read books, watch movies and TV, read newspapers, and engage in activites like going to the gym, going to the mall, restaurants. All these things are not inherently \"Christian\". However, there ARE guidelines for us that we strive to adhere to whenever we are deciding on what activities to engage in. We should look to stay away from any activities that are sexually explicit or glorify/celebrate sexual activity that God doesn't support, or that glorify activities that are damaging to us physically, can cause harm to us, usurp/destroy our devotion to God and His ways, or that can damage our witness to others. This can vary from person to person to some extent, and the Christian does depend on his or her own conscience to some degree, but for the most part, this would include the more obvious things like visiting strip clubs, downloading porn off the Internet, solicitation of prostitutes, illicit drug use, and books, movies, TV, and yes, music that are sexually explicit. Some people would also include the consumption of alcohol as well in this, as well as dancing and TV, movies, and the rest. Gambling would also fall under this as well. There is no explicit biblical injunction against alcohol or really gambling, but there is Biblical support for limiting or eliminating it since these activities can or will cause harm to you or your relationship with God, so many Christians simply eliminate it, especially if it is a problem for them. For example, there are Christians who can enjoy alcohol without getting drunk, but some cannot because of family history or an addictive personality. There are some people who can play the lotto every week, and not have any problems, but there are those that have real problems with gambling.  Not all secular music is evil or bad or something that God would frown on. Some secular music is very comforting and speaks to us about life experiences that we have had. I think, though, if the music has any explicit sexual lyrics or glorifies behavior that Christians know isn't acceptable to God, or has a lot of foul language in it/is blasphemous, the Christian musician or music lover should stand against making that a part of their listening or performing repertoire. Again, some judgement based on individual conscience helps to make that decision, but there are some pretty obvious cases. For example, I don't think even a nominal Christian who respects God's laws and wants to please Him could listen to, say, Prince's \"Darling Nikki\" or \"Erotic City\" without being VERY uncomfortable. But most Christians could probably listen to, say, any of Adele's songs without any heartburn. Note though, that whether something is \"Christian\" or not doesn't alone determine if what you are doing is pleasing to God-some Christian musicians, while performing Christian music, can be prideful or prioritize their success above worshipping and honoring God, and put themselves and their talents on a pedestal instead of the God that gifted them. In that case, it doesn't matter what they are performing-God doesn't respect it because of the sinful behavior/attitudes. In short, if an activity will cause you to sin, arouses lusts that are sinful, or takes preeminence in your life over the things and desires of God, it is an activity best avoided, even if it is on the surface not sinful. Becuase it takes your eyes off God, it is sinful to you. ",
            "date": "Answered August 1, 2013",
            "views": "51",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anigbedu Evidence",
                    "user_href": "/profile/Anigbedu-Evidence"
                },
                {
                    "user_id": "Ariel Doll",
                    "user_href": "/profile/Ariel-Doll"
                },
                {
                    "user_id": "Queen M",
                    "user_href": "/profile/Queen-M-96"
                },
                {
                    "user_id": "Rose Carmelle Germain",
                    "user_href": "/profile/Rose-Carmelle-Germain"
                },
                {
                    "user_id": "Maria Kahale",
                    "user_href": "/profile/Maria-Kahale-2"
                },
                {
                    "user_id": "Christopher Hudson",
                    "user_href": "/profile/Christopher-Hudson-49"
                },
                {
                    "user_id": "Joshua Samuel",
                    "user_href": "/profile/Joshua-Samuel-20"
                },
                {
                    "user_id": "Karen Essiane",
                    "user_href": "/profile/Karen-Essiane"
                },
                {
                    "user_id": "Vathsalya Poranki",
                    "user_href": "/profile/Vathsalya-Poranki"
                },
                {
                    "user_id": "Melissa Paul-Rotua",
                    "user_href": "/profile/Melissa-Paul-Rotua"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dayvid Victor",
                "href": "/profile/Dayvid-Victor"
            },
            "answer_text": "Yes and No. The Bible says: \"So whether you eat or drink or whatever you do, do it all for the glory of God.\". 1 Corinthians 10:31 If you are a Christian, you will identify yourself with christian songs. But what is a christian song? ... Songs that in some way mend the heart of a christian. If you think about U2, they are not a christian band, but they have strong christian themes and prayers, so why would not be appropriate to hear those songs? Off course, it is more appropriate to listen christian music than secular music, even because \"one thing leads to another\" and you might find yourself listening to a secular music talking about drugs and prostitution. So, I shouldn't search for secular bands if I have so many Christian bands options. So the trick is to find songs that Jesus would listen to. If you have peace and you feel that the name of G-d is being glorified with one song, you can listen to it. ",
            "date": "Answered May 12, 2013",
            "views": "37",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ariel Doll",
                    "user_href": "/profile/Ariel-Doll"
                },
                {
                    "user_id": "Melissa Paul-Rotua",
                    "user_href": "/profile/Melissa-Paul-Rotua"
                },
                {
                    "user_id": "Summer",
                    "user_href": "/profile/Summer-380"
                },
                {
                    "user_id": "Joshua Bus",
                    "user_href": "/profile/Joshua-Bus"
                },
                {
                    "user_id": "Holly Olver Hertig",
                    "user_href": "/profile/Holly-Olver-Hertig"
                },
                {
                    "user_id": "Jide Ajide",
                    "user_href": "/profile/Jide-Ajide"
                }
            ]
        }
    ]
}