{
    "title": "Is it realistic to pursue YouTube as a full-time career? - Quora",
    "tags": [
        "Digital Advertising",
        "YouTube",
        "Entrepreneurship",
        "Social Media",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rockney Briskey",
                "href": "/profile/Rockney-Briskey"
            },
            "answer_text": "It’s hard work I went at it and understand it now. Everyones a star in there own way. Be creative. Don’t make my mistakes . If you live stream do it because your having fun not because your trying to make money. Do what you do but show everyone maybe you will gain a audience and from there it just keeps growing. For example I have a animal channel and people like my videos where im just walking around with my dogs and talking to the fans. Im not real popular but they are nice videos and enjoyable to watch. If you get a sponsor you can also use from like 250k music themes for any emotions in the videos to. With a sponsor like famebit they pay you to show there products to. Like if i wanted to show a tent they send me one free i get to keep it and i review it and then i also get paid like $500 bucks. Or like little kid toys they pay $5000 for kids to open the box and play with them. ",
            "date": "Answered April 30, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mona Agrawal",
                    "user_href": "/profile/Mona-Agrawal-56"
                },
                {
                    "user_id": "Johan Ortega",
                    "user_href": "/profile/Johan-Ortega-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Malbrough",
                "href": "/profile/Michael-Malbrough-1"
            },
            "answer_text": "Making money with YouTube in 2018 and beyond is only going to get less lucrative. For the last few years they have changed their terms multiple times and it has always taken ad revenue from the smaller channels. However, if you want to make it a full time career you can… As long as you don't focus on the ad money from it as your only source of income. You need to have multiple sources of income if your goal is to be a full time YouTuber and you can do that by promoting affiliate products or you own products to you audience. The hard part is going to be promoting without being salesy and having a system in place to be able to control your business. You don't want your income to depend 100% on the survival of YouTube or any other platform for that matter. I go into a lot more detail about how to do that in my course, Starters Formula, but if you want to ensure your success without worrying about if YouTube changes the rules you need to focus on building your a list of prospects and customers who are interested in your stuff. That will help you to sell more stuff to them in the future, which is called repeat business. Without repeat business, you will struggle to make consistent income for a very long time ",
            "date": "Answered August 11, 2018",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mona Agrawal",
                    "user_href": "/profile/Mona-Agrawal-56"
                }
            ]
        }
    ]
}