{
    "title": "Is it possible to learn to play piano on my own? - Quora",
    "tags": [
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emma Nelson",
                "href": "/profile/Emma-Nelson-231"
            },
            "answer_text": "In 2017 I decided I was going to learn to play the piano. I tried by buying books and was ok - but I felt something was missing. After a few weeks, I searched online for local piano teachers, and found one who turned out to be very patient and very devoted to music. She was a former singer in New York at a major symphony (I’ve completely forgotten the name). She also played the piano professionally, as well as the guitar. It was with her guidance that I understood what was “missing” - I had no one to show me when I made mistakes, no one to show me proper methods, and no one to listen to me play and either encourage and praise - or gently show me where I went wrong. It is possible to teach yourself - it can be done. But muscle memory is hard to break once a mistake is set in. I was only able to continue my piano lessons with this wonderful teacher for 6 months. I had to have surgery and just never went back. In 2018, I tried again - but this time had to go to a different piano teacher because the first had no room. The second piano teacher was just plain not cut out for what she was doing. It was a nightmare, and I learned nothing. She’d get up and walk away when I played. Her piano was way out of tune. She was OCD and panicked if things were “out of place” - I could feel her tension rise and she’d burst out saying I needed to put my purse, which was on the floor beside me, a few inches over - or something like that. She’d get up in the middle of a lesson to take care of her toddler. I had to remove my shoes at a certain place before I could enter her home (I’m disabled and it’s impossible for me to stand and remove my shoes - or stand and put them on, which she expected. I explained my problem and she allowed me to sit on her couch to remove my shoes - but it really bothered her). I quit after four lessons. So - if you do go to a piano teacher, make sure they are a good fit and love their job! I’ll end this with: You can teach yourself because it’s been done - take Prince, for example. But, he was exposed to good piano playing by his father his entire life and first began playing at a very tender age. He also played in the school band so he acquired music theory - which is important. There are a plethora of very good books out there that teach from the ground up. I bought all of mine used on eBay or Amazon. Stay with it even when you reach points where you just don’t want to practice that day. The first day you decide to put off practice is the beginning of the end of practice and piano playing. I know - that’s what I did. My piano now sits forlorn and gathering dust. PLEASE don’t ever do that! Best of luck! ",
            "date": "Answered September 17, 2020",
            "views": "323",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "J. Lew",
                    "user_href": "/profile/J-Lew-7"
                },
                {
                    "user_id": "Steve Love",
                    "user_href": "/profile/Steve-Love-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danny Stoppenbach",
                "href": "/profile/Danny-Stoppenbach-1"
            },
            "answer_text": "I began playing 2.5 years ago at age 58. I played the guitar from age 17 but had to quit due to my chronic pain disorder. Anyway, back to the question. I have been learning through an online piano course called, Playground Sessions. I’m not trying to sell their product, but I can speak from experience that I’ve learned so much and can play way better than if I was to learn it like I did the guitar. Back in 1976 I bought a bass guitar and amp because my older brother who played the drums, begged me to so we could jam. I didn’t have any idea how to play, and there weren’t any websites in existence. The bass playing turned into a 6 string electric and the rest is history. I didn’t know how to read music, I would just put an album on that I wanted to learn and with enough practice I could play along. I became pretty good, but it’s nothing like the way I’m learning the piano. I am learning and playing the corrct way. I’m sure it would even be better if I had one on one teaching from an instructor, but I’m loving Playground Sessions. In just 2.5 years, I’m in the process of learning one of Bachs Canons at the Intermidiate/advanced level and that’s with having my disability and being limited to only being able to play for a max 2 hours per day, my body can’t handle anymore. I can’t speak for anybody else as far as the question asks, can “I” learn to play by myself, but I do know that I was able to and there are a lot of other people using this program as well. I hope this answer helps somebody make a decision. I’m so happy I was and am still able to learn a new instrument in my last 3rd of my life. ",
            "date": "Answered September 17, 2020",
            "views": "201",
            "upvotes": "0"
        }
    ]
}