{
    "title": "Is it possible to merge two YouTube accounts? - Quora",
    "tags": [
        "YouTube Accounts",
        "Merging",
        "User Accounts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Lee",
                "href": "/profile/Chris-Lee-786"
            },
            "answer_text": "You can bring different YouTube channels under one G+ account. See all my channels or create a new channelMove channel to your Google Account or different Google+ pageMerge YouTube channels (transfer data) YouTube Help Center: Move YouTube channel to or from a Google+ page  ——————————————————————————————————————— 1. Moving a YouTube channel from one Google+ identity to another: https://support.google.com/youtube/answer/3056283 Use a different name on YouTube than your Google Account If you want to use a name or photo on YouTube that's different from what you have for your Google Account, connect your channel to a Brand Account. You can do this to support your business or brand identity on YouTube without showing a connection with your personal Google Account. When you connect a YouTube channel to a Brand Account: Your Google Account is an owner/manager of the Brand Account connected with the YouTube channel. This lets you access the YouTube channel from your Google Account.There's no public association between your Google Account and the Brand Account, so viewers won't see your name or email address (unless you publicly link them yourself).You can manage multiple channels from one Google Account. This helps if you have more than one YouTube channel.You can add other managers and owners to your Brand Account. You and any teammates or collaborators can manage the channel without having to share passwords. Learn more about managing channels connected to Brand Accounts. Connect channel to a Brand Account You can connect a new or existing channel to a Brand Account. Create a new channel With a Google Account, you can watch, like, and subscribe. Google Accounts don't come with a YouTube channel by default. Without a channel, you have no public presence on YouTube. To upload, comment, or make playlists, create a public YouTube channel. Currently, this can't be done in the Android or iOS YouTube apps, but you can use the mobile site or a computer. Create a personal channel with your name Make sure you're signed in to YouTube.Try any action that requires a channel, such as uploading a video, posting a comment, or creating a playlist.If you don't yet have a channel, you'll see a prompt to create a channel.Check the details (with your Google Account name and photo) and confirm to create your new channel.Create a channel with a business or other name On a computer or in a mobile browser, make sure you're signed in to YouTube.Go to your channel list.If you want to make a YouTube channel for a Brand Account that you manage, choose the account from the list. Otherwise, choose Create a new channel to set up a channel with a different name than your Google Account name.Fill out the details to create your new channel.Learn more about using a channel with a business or other name on YouTube. Connect an existing channel Sign in to your YouTube account.Click your account icon > settings .Next to your profile picture, click Advanced.If you already have any Brand Accounts, you'll see them listed under \"Account information.\" When you choose one of these, your YouTube channel will be renamed to match the page. If the Brand Account has any other managers, they'll also be able to manage the channel from now on. If you don't see your Brand AccountIf your Brand Account isn't listed, your YouTube channel's Google Account is not a manager of that Brand Account. You have to first add your Google Account as a manager of the page.Note that some content can't be moved: All comments, sent and received messages, and automated filter community settings. You'll see a warning if your channel has this content. Note: When you're using the Brand Account, you may also see an unusual email address in some places, such aschannel-name-1234@pages.plusgoogle.com. This isn't a real email address and doesn't mean you have a Google+ page — it's just an identifier for the Brand Account. You can have a Brand Account without having a Google+ presence. Email notifications for the YouTube channel go to the notification address that you can set for the Brand Account. ——————————————————————————————————————— Disconnecting a Google+ page and merging an existing page with Youtube: The first step is to make a note of the email address and Google account which your Youtube channel is setup up with. 1. Make sure that the existing Youtube account is added as a Manager to your Google+ page (Which is done under the Managers section of your Page Settings) 2. If a duplicate or alternate page has been created by mistake via Youtube, you’ll need to disconnect that Google+ presence by clicking on Disconnect in Youtube Settings, in the Name section. 3. Google will take around 20 minutes to proceed through the disconnection process. It’s a good time to get a drink and relax! 4. Now go back into Youtube Settings, and click on Advanced. You should then have the option to link the Youtube account to a Google+ Page. Click on that link and you should be able to select the correct page. 5. Once that’s done, you should be able to click on Edit to be sent to the Page where you can click on Posts etc to check it’s the correct one. 6. Once that’s all done, you can then go into Google+ with your original Youtube account and remove the Page created in error. ",
            "date": "Answered January 9, 2017",
            "views": "188",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nischal Neupane",
                    "user_href": "/profile/Nischal-Neupane-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjun Burgula",
                "href": "/profile/Arjun-Burgula"
            },
            "answer_text": "While Google doesn't allow you to merge Google or YouTube accounts as of August 2011, it's possible to \"Link\" one YouTube account to a Google account other than the one you used to register it, which combines the content on both accounts from the viewer's perspective. Instructions  Log in to YouTube using your Google account credentials. Click \"Account Settings,\" then click \"Manage Account.\"Select \"Change Google Accounts\" from the \"Change Which Google Account is Linked to This Account\" pane. Enter the image verification string, then click \"Unlink My Accounts\" to unlink the YouTube account from your existing account.Input the username and password for the new Google account with which you want to link your YouTube account, enter the image verification string, and click \"Link My Accounts.\" Doing so merges content from the YouTube channels together, allowing subscribers and friends from both channels to view all the content via the same interface.",
            "date": "Updated February 11, 2018",
            "views": "1579",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manoel Vilela",
                    "user_href": "/profile/Manoel-Vilela"
                },
                {
                    "user_id": "Alberto Marcazzan",
                    "user_href": "/profile/Alberto-Marcazzan"
                },
                {
                    "user_id": "Motoor Muzammil",
                    "user_href": "/profile/Motoor-Muzammil"
                },
                {
                    "user_id": "Mathias Gallo Cassarino",
                    "user_href": "/profile/Mathias-Gallo-Cassarino"
                },
                {
                    "user_id": "Michael Reagan",
                    "user_href": "/profile/Michael-Reagan-15"
                },
                {
                    "user_id": "Jonathan Vardy",
                    "user_href": "/profile/Jonathan-Vardy-7"
                },
                {
                    "user_id": "Maddi Na",
                    "user_href": "/profile/Maddi-Na"
                },
                {
                    "user_id": "Anoop George Jacob (Aj)",
                    "user_href": "/profile/Anoop-George-Jacob-Aj"
                },
                {
                    "user_id": "Sarai Winkelman",
                    "user_href": "/profile/Sarai-Winkelman"
                },
                {
                    "user_id": "Aman Chhonkar",
                    "user_href": "/profile/Aman-Chhonkar"
                }
            ]
        }
    ]
}