{
    "title": "Is it better to be signed or a independent recording artist? - Quora",
    "tags": [
        "Record Labels",
        "Independent Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoff Arnold",
                "href": "/profile/Geoff-Arnold-2"
            },
            "answer_text": "That depends upon your perspective… and what you are trying to accomplish… and how much of your hard earned money you want the label to take away from you… and how much control they will have over you in your early recording career with the label. And they will control your content to some degree. Just as they will fleece you of money they think they deserve for promoting and “supporting” you… though they need YOU for them to continue to exist. Weigh this against being independent. You won’t necessarily get good advertising promotion, and if you’re self produced, unless YOU buy the advertising, it ain’t gonna happen. But you will control all your content, how it sounds, and the visual appeal of the record packaging, what it looks like. And you will need a manager to go out and get you gigs in good clubs and or concert venues. The concert venues you may have to pay for, including security and other things. Your manager can try to hook you into a tour with a “name” act as an opener. You can then get to the venue, wait for the main act to do their sound check, then set up and get a few minutes’ time to get levels. And if you don’t have a sound guy who knows his stuff, you will have to use the house or other band’s sound guy… who, if he is a jerk, will not work to make you sound good. But if he’s a square shooter (buy him coffee or dinner for helping you out ), he’ll make you sound good… as long as you’re not better than the main act! :O Anyway, either way you go, there is a price to pay. One lets you do it your way. The other requires you to kowtow to label demands… until or unless you prove to be capable of directing your own fate because you’ve proven you know what you’re doing and that you know your audience. ",
            "date": "Answered March 22, 2019",
            "views": "508",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anthony Lawrence",
                    "user_href": "/profile/Anthony-Lawrence-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Maxwell",
                "href": "/profile/Robert-Maxwell-134"
            },
            "answer_text": "In the beginning it’s probably best to be independent, if you can afford to cover your own studio time, mastering, packaging and release, which even done on a budget will be in excess of $20k ..but ultimate the goal is to get signed. An artist can’t do it all! Just be careful of contracts, just because you get a million dollar record deal doesn’t mean you will be grossing money, because that million will be paid off first to cover studio time, promotion etc. Get a good outside entertainment attorney of your own and never sign or agree to anything without their consent. I have seen artists being stubborn thinking they are worth way more than they really are, only to hold out and be left with nothing. I’ve also seen groups like N Sync, TLC, Back Street Boys falling into some pretty crappy deals, which only net them about $50k/year even after going platinum. ",
            "date": "Answered March 26, 2019",
            "views": "294",
            "upvotes": " Answer requested by Anthony Lawrence"
        }
    ]
}