{
    "title": "Is it normal for a teenager to like old music better than modern music? - Quora",
    "tags": [
        "Modern Music",
        "Music Industry",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Pulciani",
                "href": "/profile/Robert-Pulciani"
            },
            "answer_text": "The thing is, with older music, we have the advantage that time has sifted out the bad and mediocre stuff, so what has survived is the best of the past. With new music, we have to listen to all of it (the good and the bad) in order to find the few good songs. It has always been such. Personally, I am a fan of the Pop and Rock music of the entire second half of the 20th century, but I consider the ’60s and ’70s to be the most prolific period for great music. Some Big Band Swing-Era, Jazz and Blues music of the ’30s and ’40s is great too, as well as a lot of Classical music. No need to worry about what is ‘normal’ in musical preference. If you like it, listen and enjoy. ",
            "date": "Answered September 1, 2020",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Christofer",
                    "user_href": "/profile/David-Christofer-2"
                },
                {
                    "user_id": "Mark Brewster",
                    "user_href": "/profile/Mark-Brewster-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Stranc",
                "href": "/profile/Laura-Stranc"
            },
            "answer_text": "It's not normal or abnormal, it's a personal preference… If it's what you grew up with, then yes, to you it's normal. I myself grew up listening to 70’s rock music, because that's what my parents listened to in their teenage/young adult lives. My favorite band is RUSH(rip Neil!), I love the Beatles, ELO, Kansas, Cheap trick ect. As I grew older, I listened to other stuff, Nickelback, 3 days Grace, Godsmack, in middle/ high school. Now I'm a huge Katy Perry fan, I also love Emeniem! My hubby got me liking stuff like Calvin Harris, Avicii, ect. But I always fall back to my 70s rock and RUSH especially, when I'm depressed, want to rock out. It's weird to some people, and I'm in my 30s now! Is it normal, who cares?! Music is all about what you enjoy, what makes you happy and feels good. Be true to yourself, and keep loving music, whatever era or genre it is! ",
            "date": "Answered August 31, 2020",
            "views": "121",
            "upvotes": "0"
        }
    ]
}