{
    "title": "Is it OK for a Christian to have a beer? - Quora",
    "tags": [
        "Beer"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Hegwood",
                "href": "/profile/Robert-Hegwood"
            },
            "answer_text": "Short answer yes, it is. Over the centuries monks have brewed beer. Luther's beer mug was legendary for its capacity. It is not essentially different than having wine or a fruit brandy. This does not mean it is good for every person to do so, or that such consumption in any circumstance or setting is appropriate. It is not. What is not proper for Christians is drunkenness which is listed in more than one place in scripture as a sinful failing. ",
            "date": "Answered September 22, 2012",
            "views": "395",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinav Maurya",
                    "user_href": "/profile/Abhinav-Maurya"
                },
                {
                    "user_id": "Crowly Mathew Arackal",
                    "user_href": "/profile/Crowly-Mathew-Arackal"
                },
                {
                    "user_id": "Augustin Chiam",
                    "user_href": "/profile/Augustin-Chiam"
                },
                {
                    "user_id": "Daniel P Hurd",
                    "user_href": "/profile/Daniel-P-Hurd"
                },
                {
                    "user_id": "Tara Dockery",
                    "user_href": "/profile/Tara-Dockery"
                },
                {
                    "user_id": "Vy Ha",
                    "user_href": "/profile/Vy-Ha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Karding",
                "href": "/profile/Brent-Karding"
            },
            "answer_text": "The Bible nowhere commands Christians to drink alcohol. On the other hand, when taking its testimony as a whole, collated from many passages, we cannot say that the Bible forbids Christians to drink alcohol. There are many good reasons why an individual Christian may choose not to drink alcohol. The problem only comes when an individual claims Scriptural authority for their decisions, when Scripture actually does not support them. For even though drunkenness is certainly forbidden in Scripture in strong terms, and the dangers of alcohol consumption are described vividly, consumption of alcohol is not forbidden - and is even encouraged in Deuteronomy 14:22–27! That text reveals God encouraging his people to rejoice in his blessings by eating “oxen or sheep,” or by drinking “wine or strong drink, whatever your appetite craves” (v. 26, ESV). I explain further here on Biblearc’s forum, including a graphic that shows the logical construction of the text. ",
            "date": "Answered September 3, 2019",
            "views": "170",
            "upvotes": "0"
        }
    ]
}