{
    "title": "Is it possible to hear Jason Newsted's bass on “…And Justice For All”? - Quora",
    "tags": [
        "Technical Thrash Metal",
        "Jason Newsted",
        "Thrash Metal (music genre)",
        "Metallica (band)",
        "Sound Engineering",
        "Bass (sound)",
        "Bass Guitar",
        "Heavy Metal (music)",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Rimer",
                "href": "/profile/Michael-Rimer-2"
            },
            "answer_text": "Yes. Here's how: play the album (2018 re-master or original). Have a sub-woofer linked to your hi-fi. Turn the sub-woofer up louder than you normally would, but not so loud that the drums get muddy. Put your ear by the sub-woofer and you'll hear every bass note that Jason Newsted played with super clarity. What you'll notice is this: Jason Newsted perfectly matched every riff and note that James Hetfield played. One exception is in One, where a counter melody is played over the clean sections.  My new theory about why the bass is so low in the mix is that Lars Ulrich and James Hetfield were simply astonished at how amazing the bass playing was and they didn't want Jason Newsted to get too much of the limelight so soon after Cliff Burton's death. Releasing Garage Days Revisited just under 11 months after Cliff Burton died was a big show of strength that the band would continue. The bass on that recording was possibly the biggest bass sound Metallica had ever recorded. But it was an EP of quickly recorded covers, so no big deal. …And Justice For All was released just over a year later on 25 August 1988. Jason Newsted apparently had to learn the songs from demo tapes and from the drum and guitar tracks that were already recorded. The bass tracks took him about a week. No one else from the band was there with him when he recorded his parts. Hence my theory as noted above. Hetfield and Ulrich were expecting the bass tracks to be ok, or good enough. My guess is they were irritated that the bass playing was as good as or better than the rhythm guitar. So they turned it right down. This avoided any reviews lauding up the awesome bass playing. This is only a theory. I may be wrong. But my ears are telling me I'm right, and the monstrous rumble in my right ear from Frayed Ends Of Sanity while writing this hasn't changed my mind. ",
            "date": "Updated May 18, 2019",
            "views": "994",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wayne Chesser",
                    "user_href": "/profile/Wayne-Chesser"
                },
                {
                    "user_id": "Subhankar Das",
                    "user_href": "/profile/Subhankar-Das-12"
                },
                {
                    "user_id": "Juanma Pinkus",
                    "user_href": "/profile/Juanma-Pinkus-1"
                },
                {
                    "user_id": "Eunice Olave",
                    "user_href": "/profile/Eunice-Olave"
                },
                {
                    "user_id": "Alex McGrath",
                    "user_href": "/profile/Alex-McGrath-34"
                },
                {
                    "user_id": "Rich Sackett",
                    "user_href": "/profile/Rich-Sackett"
                },
                {
                    "user_id": "Santiago Tome",
                    "user_href": "/profile/Santiago-Tome"
                },
                {
                    "user_id": "Howard Aitchison",
                    "user_href": "/profile/Howard-Aitchison"
                },
                {
                    "user_id": "Niklas Tjitra",
                    "user_href": "/profile/Niklas-Tjitra"
                },
                {
                    "user_id": "Aishik Roy",
                    "user_href": "/profile/Aishik-Roy"
                }
            ]
        }
    ]
}