{
    "title": "Is it possible for a movie to gross $5 billion dollars at the box office? - Quora",
    "tags": [
        "Box Office Grosses",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Tobin",
                "href": "/profile/Robert-Tobin"
            },
            "answer_text": "Yes. It would be the highest grossing movie of all time, but since there are already two films that have grossed $3 billion, it is possible that a film could appeal to so many people, especially at today’s higher ticket prices, that it could gross $5 billion. And based on historical precedent, it would probably be directed by James Cameron, LOL! ",
            "date": "Answered March 31, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Slycord",
                    "user_href": "/profile/Brandon-Slycord"
                },
                {
                    "user_id": "Sania Mahem",
                    "user_href": "/profile/Sania-Mahem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brady Westwater",
                "href": "/profile/Brady-Westwater"
            },
            "answer_text": "Not yet. But that time might not be all that far off. Particularly if technology can develop an entirely new type of film going experience. An experience which could only be properly experienced in a new type of theater. Other than that, though, that gross should be reached a little later this century. And the rising fortunes of the middle class of India and Africa virtually guarantees that will happen. They are the last two regions of earth that still have rapidly multiplying - and highly youthful - populations. And India will pass China as the world’s largest country and Africa will pass Asia as the world’s most populous continent. And that will all happen at the same time the fastest growing language in both the country of India and the continent of Africa will be - English. ",
            "date": "Answered March 31, 2017",
            "views": "656",
            "upvotes": "0"
        }
    ]
}