{
    "title": "Is it possible to play the piano by memory instead of using sheet music? - Quora",
    "tags": [
        "Sheet Music",
        "Piano Music",
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ruth Power",
                "href": "/profile/Ruth-Power-2"
            },
            "answer_text": "Yes, you can memorise music and you should do so not just so you can play without the sheet music, but because by memorising the piece you form a picture of the music in your mind to better understand the song. Another advantage is that if you are playing at a piano competition and are very nervous and someone in the audience foolishly decides to open the exit door so that a huge gush of wind comes to blow your sheet music off the stand… then you can still carry on with your performance without missing a beat! P.S that totally happened to me and was the point where I had to admit to my parents and teacher that I only ever read the sheet music at the beginning, and instead always memorised the pieces - the books were just a RUSE! MWAHAHAHAHAHHAHA. *Evil laugh*. So HOW DO YOU MEMORISE MUSIC? I'll illuminate: Practise it until you can play it perfectly. The memorising part will come naturally as a result of having played it so many times.If you need to memorise something quicker than that, here are a few tips: Work on one section at a time. Separate the piece into sections (there should be obvious sections to the piece anyway, where the feel, melody or speed changes significantly. Work on that until you don’t need the music anymore.Gradually hide bits of the sheet music. So I bet when you think about that piece you can automatically play the first few bars? Well, each time you play it put a piece of plain paper or a sticky note in front of the first line. Then try the next line. Then the next. Gradually you will have a whole piece of plain paper hiding the first page of your music. Go from there.Concentrate on the melody first. When you learn a new piece you would normally start by identifying the melody first anyway so that you can understand that most important part and be able to bring it out more than the other elements. Try to use this technique to also memorise the melody first before the rest of the music. See if you can play the melody of an entire section (also be able to hum along with it). Then when you add the rest of the harmony the memorised melody should lead you.Think about the piece when you’re not practising. Even when you are not at a piano you can be humming the song to yourself, at least the melody, but you can also be thinking about how the rest of the song feels at certain points, it all helps to build up your memory of the song in your head.Listen to the piece (when you’re not playing it). Many pieces of music will have a recording available. Download it onto your MP3 player/phone/device and listen to it when you’re away from the piano. This will help you memorise the song as it is supposed to be played, even if it’s a slightly different version to your sheet music, it will still help you to remember the main melody, which usually doesn’t change with different arrangements.Can I be honest with you? I often forget complete songs that I learned off-by-heart years ago, even 1 year ago. I have learned so many pieces over the years that it’s as if my brain can only hold a few at a time. BUT, once you have played a piece enough times it becomes muscle memory. So even though in my head I can’t think how to play it, my fingers still remember how to if I played it on a bench top, it’s just my conscious mind doesn’t know where to put my fingers on the keyboard anymore. So what do I do? I sit at the keyboard and hum the song to myself for as long as it takes for a ‘spark’ to jog my muscle memory. Sometimes I will get most the way through humming a song and be convinced that I can’t remember how to play it, and then all of a sudden a certain passage will make my hands spring into action and for some completely unknown reason my hands will know what they need to do. It’s as if my mind subconsciously stores bits of the song that it really liked - then when I run through the song that particular passage will be there.From that one passage, I can usually work out the rest of the song with a bit of work. So that’s my advice for memorising songs and also remembering songs that you’ve forgotten how to play. If you like this advice, please come over to my Facebook group ‘LET’S TALK PIANO’. Here I have all sorts of free advice available for you to look through at your leisure. I also have a free piano course ‘Prepare To Play’ that gives you the BEST advice that no one else is telling new pianists, how to get through the big obstacles of learning piano, no sweat! ",
            "date": "Answered July 18, 2017",
            "views": "32",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon McKnight",
                    "user_href": "/profile/Simon-McKnight-6"
                },
                {
                    "user_id": "Georgia Gough",
                    "user_href": "/profile/Georgia-Gough-5"
                },
                {
                    "user_id": "Saumil Soni",
                    "user_href": "/profile/Saumil-Soni"
                },
                {
                    "user_id": "Jing Jun Ma",
                    "user_href": "/profile/Jing-Jun-Ma-1"
                },
                {
                    "user_id": "Reagan Rayford",
                    "user_href": "/profile/Reagan-Rayford"
                },
                {
                    "user_id": "Aditya Bhatia",
                    "user_href": "/profile/Aditya-Bhatia-9"
                },
                {
                    "user_id": "Marianne Miettinen",
                    "user_href": "/profile/Marianne-Miettinen"
                },
                {
                    "user_id": "VaTani Gia",
                    "user_href": "/profile/VaTani-Gia"
                },
                {
                    "user_id": "Susan Rose",
                    "user_href": "/profile/Susan-Rose-109"
                },
                {
                    "user_id": "Samuel Fairbrass",
                    "user_href": "/profile/Samuel-Fairbrass-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "There are about three ways to memorize. The first is by rote. You play the piece a bunch of times and you get it in muscle memory where the hands just know where to go. This method is not reliable and you will quickly forget your piece if you let it go for a few weeks. If you get lost in the middle of the piece during a performance, you will most likely crash and burn. The second is having a good ear and a small amount of theory knowledge where you can hunt and peck or play by ear. This is often combined with rote. This is still not a reliable method since a lot of actual playing may be guesswork. The third and most reliable method is to study the score away from your instrument. You will need a vast understanding of music theory. First, study the melody, its intervals and structure. This combined with your ear and knowledge of theory will make it so even if you can’t see the score in your mind’s eye, just knowing what the pitches sound like, you will just know. For instance, if I spilled a box of crayons on the floor and asked you for the orange one, you should be able to pick it right out. Hearing intervals (for a trained musician) is much the same. I know and can hear that the theme from STAR WARS goes 1543285, I don’t need to memorize anything for that. My brain hears it and just knows the intervals. Then study the chord progressions of the work and voicings if necessary. Finally, commit to memory a snapshot of any difficult passages such as counterpoint or expositions. Often in classical music, there are patterns which change keys, invert or mutate so once you learn them, it is just a matter of knowing your scales and going with the flow. If you would like to try the third method, start with a hymn. Download an easy one from Hymnary.org: a comprehensive index of hymns and hymnals such as ODE TO JOY and start with the melody. This one is easy because it is sort of an AABA form. Then study the base line as a counterpoint. Finally add the alto and tenor lines. Don’t worry too much about voicing or inversions at this point. It gets easier as your ear/brain get better. Just to get you started, ODE goes: 334554321123322 334554321123211 As an added bonus of using this method, you will be able to sight transpose. Try it with the numbers above. Those are not fingering numbers but it happens to work for this example. They are interval pitches. Start on the third pitch of any scale or key and play those numbers. Poof, instant transposition and it didn’t hurt your brain. WHY DON’T OUR TEACHERS TEACH US THIS METHOD INSTEAD OF CRIPPLING US WITH ABSOLUTE LETTERS? Ah, because our teachers don’t know, either. ",
            "date": "Answered July 17, 2017",
            "views": "58",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wang Yuan",
                    "user_href": "/profile/Wang-Yuan-7"
                },
                {
                    "user_id": "Joe Loffredo",
                    "user_href": "/profile/Joe-Loffredo"
                },
                {
                    "user_id": "Grace Gloger",
                    "user_href": "/profile/Grace-Gloger"
                },
                {
                    "user_id": "Hi There",
                    "user_href": "/profile/Hi-There-447"
                },
                {
                    "user_id": "Alex Ma",
                    "user_href": "/profile/Alex-Ma-64"
                },
                {
                    "user_id": "Jan Sen",
                    "user_href": "/profile/Jan-Sen-6"
                },
                {
                    "user_id": "Jackie Ryan",
                    "user_href": "/profile/Jackie-Ryan-54"
                },
                {
                    "user_id": "Marianne Miettinen",
                    "user_href": "/profile/Marianne-Miettinen"
                },
                {
                    "user_id": "James Breen",
                    "user_href": "/profile/James-Breen-23"
                },
                {
                    "user_id": "Samuel Fairbrass",
                    "user_href": "/profile/Samuel-Fairbrass-1"
                }
            ]
        }
    ]
}