{
    "title": "Is it easy to make a rap song? - Quora",
    "tags": [
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ieshitva Jain",
                "href": "/profile/Ieshitva-Jain"
            },
            "answer_text": "[A2A] It depends upon the artist. Anyone can do what you've mentioned and become a self proclaimed rapper but then do remember that he won't command the respect and fame Tupac Shahu or Eminem does. By doing what you've written how come anyone would be able to perform live ?Eminem in his song Rap God in the verse that begins at 4:26, raps 97 words in 15 seconds — an average of 6.5 words per second. This is the actual Wikipedia entry from the article. Eminem raps this verse in his concerts too. Live! How can a computer program help him out here ? It takes practice and control to do this. Rapping isn't only about speed either. Listened to Stan ? Saw how fluidly Eminem modifies his voice when he raps as Stan and himself ? This takes practice and hard work. It isn't just rap songs where computer can be an aid to write songs. Many top pop artists have professionals writing them lyrics with the help of computers. Same can be said for rap artists too but the point which you should understand is that mediocrity exists everywhere. If you take the top people of the field then only you'll see the real hard work. Eminem writes major portion of all his songs himself that too with a pen on paper and revises them till perfection. He then records it without the help of raising the tempo. You can watch of live recording sessions too on YouTube. He gives each song his everything that's why people love him. You can sure use a computer, enter random jibber-jabber and hit the tempo up button but then remember Nursery Rhymes are poems too and so is Daffodils by W.Wordsworth. ",
            "date": "Answered March 10, 2015",
            "views": "912",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pawan Kumar",
                    "user_href": "/profile/Pawan-Kumar-1247"
                },
                {
                    "user_id": "Peter Sheriff",
                    "user_href": "/profile/Peter-Sheriff-1"
                },
                {
                    "user_id": "Asclepius Paeon",
                    "user_href": "/profile/Asclepius-Paeon"
                },
                {
                    "user_id": "Anup Atre",
                    "user_href": "/profile/Anup-Atre"
                }
            ]
        }
    ]
}