{
    "title": "Is it really that hard to become a singer? - Quora",
    "tags": [
        "Singers",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Peattie",
                "href": "/profile/Mike-Peattie"
            },
            "answer_text": "Yes. It is. The quality and quantity of singers has exploded in the last 15 years, probably because of shows like American Idol, The Voice, Glee, and many others. When I was a teenager doing a musical here and there in the 90s, it was considered at least mildly weird to pursue singing as a hobby. It also was relatively rare. I see shows at the same company that I performed with today, and the talent level is night and day. They are so much better at 16 than I was. It’s astounding. Essentially, singing has been commoditized. It used to be a specialized skill that could fetch money, and if you are truly elite, it still does. But that bar has been raised, and a performer who can sing extremely well is the norm now, not the exception. I personally know several singers that have the actual singing ability of a top 20 to 50 performer on one of those reality shows. No joke. But it’s not nearly about your voice anymore. It’s your look, your angle, your repertoire, all that stuff. Singing cover tunes expertly is now the most common thing in the world. If you bust your ass and hustle, you can probably drum up a few bucks here and there, depending on where you live. You might even be able to squeak out a living only by singing. Making a good to great living on the strength of your voice alone is a thing of the past, you will need something else going for you. ",
            "date": "Answered May 4, 2017",
            "views": "64",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepanshu Sharma",
                    "user_href": "/profile/Deepanshu-Sharma-600"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Serenity Stewart",
                    "user_href": "/profile/Serenity-Stewart-7"
                },
                {
                    "user_id": "Sabrina Rocha",
                    "user_href": "/profile/Sabrina-Rocha-21"
                },
                {
                    "user_id": "Kaiden Felder",
                    "user_href": "/profile/Kaiden-Felder"
                },
                {
                    "user_id": "Eden Marc",
                    "user_href": "/profile/Eden-Marc"
                },
                {
                    "user_id": "Milni Wijesinghe",
                    "user_href": "/profile/Milni-Wijesinghe"
                },
                {
                    "user_id": "Coleman Roberts",
                    "user_href": "/profile/Coleman-Roberts-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Emvisha"
                },
                {
                    "user_id": "Marc Del Pilar",
                    "user_href": "/profile/Marc-Del-Pilar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wayne Hajas",
                "href": "/profile/Wayne-Hajas"
            },
            "answer_text": "I started clarinet lessons at the age of eight. I have been active amateur musician since then. I am currently in my fifties. I used to think that singing was something for people who aren't good at wiggling fingers. Now my daughter is taking singing lessons. I now realize that good singing takes a lot of training and skill. I can really notice the difference between trained and untrained singers. ",
            "date": "Answered May 4, 2017",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Milni Wijesinghe",
                    "user_href": "/profile/Milni-Wijesinghe"
                },
                {
                    "user_id": "Wendy Sheridan",
                    "user_href": "/profile/Wendy-Sheridan-2"
                },
                {
                    "user_id": "Elaina Maria",
                    "user_href": "/profile/Elaina-Maria-1"
                }
            ]
        }
    ]
}