{
    "title": "Is it harder to make a Musical than a regular movie? Why are there so few musicals these days? - Quora",
    "tags": [
        "Musical Movies",
        "Musical Theatre",
        "Movie Soundtracks",
        "Music Industry",
        "Movie Production",
        "Hollywood",
        "Movie Business and Industry",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-176"
            },
            "answer_text": "I do not know, but despite that, here’s my take on things: Top quality musicals are difficult to create. You need great songwriters, great songs and great performers, a fair storyline and facilities boasting massive sound stages (and the orchestra to fill them). So, they can be expensive when compared to a basic, no-frills (and no CGI) movie. Yet some of today’s films are made at enormous expense and these need to have a very good chance of making box-office money. When you compare with the sort of musicals made in the 1930s and 1940s - Fred Astaire vehicles with music by Berlin, Gershwin etc., , movies such as Sun Valley Serenade which featured the sure-fire draw of Glenn Miller’s band, these were black and white, eschewing expensive Technicolor yet they made lots of money for the studios. Why such movies are rarely made these days is hard to understand: after all, it isn’t all that long ago that ‘Grease’ became legendary and though of course in colour, little in the way of special effects so that must have kept the cost down. Perhaps today’s music doesn’t lend itself to that type of treatment. Or perhaps the studios prefer to make yet more endless sequels in the knowledge that there’s a ready-made audience for more of the same. Bond films. Marvel films. Star Wars films, etc.etc. Each similar to its previous incarnation. The comfort of the familiar versus the shock of the new? It doesn’t always work, at least not with musicals. Think about ‘Grease 2′ or ‘Stayin’ Alive’ featuring the main Character from ‘Saturday Night Fever’, Tony Manero. There is a law of diminishing returns but it appears studio bosses are not familiar with. ",
            "date": "Answered January 26, 2020",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Polo",
                    "user_href": "/profile/John-Polo-15"
                },
                {
                    "user_id": "Dmitri Vishnayev",
                    "user_href": "/profile/Dmitri-Vishnayev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Susman",
                "href": "/profile/Gary-Susman-1"
            },
            "answer_text": "It is harder. You have to find actors who can sing and dance, you may have to compose new songs, you need a large cast, you need extra time to film big production numbers, you need extra rehearsal time for actors to learn songs and dance routines, etc. Movie musicals are rare these days, not just because of the extra time and expense, but also because they’re just not as popular as they once were. 50-plus years ago, the country had more uniform taste in music, and Broadway was still a force on the pop charts and in terms of injecting songs into the cultural mainstream. In the rock and hip-hop era, taste is more fragmented and Broadway is increasingly reserved for the moneyed few. Plus, not having grown up with musicals, today’s audiences have a hard time with the suspension of disbelief required to accept speaking characters spontaneously breaking into song. The experience that works well when you’re immersed in a live theater setting and are bringing your own imagination to the table is hard to replicate in the relentlessly literal world of film. (Exhibit A: the recent failure of the “Cats” movie.) There are some exceptions (Disney cartoons, original movie musicals like “La La Land” and “The Greatest Showman”), but for the most part, it’s just very hard to sell a diverse contemporary audience on an old-fashioned movie musical. ",
            "date": "Answered January 31, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thasmai Automation Pvt Ltd",
                    "user_href": "/profile/Thasmai-Automation-Pvt-Ltd-1"
                }
            ]
        }
    ]
}