{
    "title": "Is it advisable to join a QI group that is into network marketing? How beneficial would it be? - Quora",
    "tags": [
        "Inbound Marketing",
        "Web Marketing",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashok Prabhu T",
                "href": "/profile/Ashok-Prabhu-T"
            },
            "answer_text": "*I have taken time to answer here, just to help a few people save their hard earned money. The answer is based on personal experience and upon seeing the plight of a few colleagues who lost their money listening to sweet talks. It's and absolute scam. It's a pyramid scheme, which is an unsustainable business model. Those fools who have already enrolled would act as if they are earning huge through this, just to entice and lure. Once in, you will figure out that you have been made a scape goat and will shamelessly lure people so as to recover the huge sum you paid. Besides losing money, you will eventually lose respect, self-esteem, confidence, become depressed and looked upon as a joker. Here is my experience after a few encounters: Scene 1: While I m casually browsing through books at Landmark or Crossword or while waiting for the bus, some guy would smile at me and start a conversation. He would flatter me and finally with the statement, \"let's keep in touch\", would ask for my mobile no. I m flattered and would end up sharing my mobile no. Scene 2: A few days later, I would get a phone call from this guy whom I met at the bookstore or bus stop. Ha ha ha... All these jokers who called me would exchange pleasantries and then make the next statement \"We are actually working on a wonderful business alongside a few people from IIT/IIM and are looking for likeminded people to expand. I think you have the potential and would be a great fit, besides you can make big bucks in a short while.\" When I ask, could you please explain in detail, the reply would be \"It's difficult to explain it on phone. I ll arrange for a detailed session where you can get all your queries answered\" Scene 3: By mistake I went one such session. The hall or the house where these sessions would be filled with people who had already fallen into the trap along with the newly found scapegoats they would have brought in. And those who had already fallen into the trap of MLM, though desperate inside to sign the next scapegoat would act as if they have made millions. Then, a guy would come on stage with an artificial enthusiasm and shoot out questions like, \"What do u do on weekends? Do you think u can survive on your meagre salary? Why not explore options to earn part time, while you continue your regular job? I will show you the way to earn big bucks. You just need to spend half an hour daily or a few hours on the weekend\" By falsely hyping all this, those desperate jokers would try to brainwash and make you the next scapegoat. If you don’t agree, 4-5 guys would join together, hype and put a mental pressure to sign up under them. - Do not budge under pressure. Scene 4: I finally escaped from one such useless session and come back home. A few days later, this guy who is supposedly making millions would call and ask if I have thought of the so called golden opportunity. When I say, I have thought of it, but can’t afford my time on these, the guy would then ask \"Well, you need not join us. But we ll give you our products, which are researched and developed (They say so) and you can get it on 20-30% discount.\"Ex. The idiot who spoke to me said, \"You are in IT. You do a lot of mental tasks. You energy gets drained. And of the food you eat, only 20% of it gets absorbed and the rest is all excreted. (Not sure which scientist found this 20% absorption rate. A basic internet search says that the efficiency of protein absorbed through food is around 60-80%). So we have a product, a protein powder, which has an absorption rate of 98% and your brain's efficiency would be improved manifold\" When I enquired the price, he said just Rs. 2000/can. I told him, I eat sprouts daily and meat frequently and get more than sufficient protein from these, the guy became even more desperate. And in the final stage, he started pleading with me, requesting me to buy at least any one product of theirs, which I feel are ridiculously, overly priced. Scene 5: This one is related to another ponzi scheme which used to sell gold and was subsequently banned in India. This has resurfaced as QNet or QI India. One of my colleague was telling that he is doing a business part time. I got curious and wanted to know about it. He said, they are into e-commerce, FMCG, tourism, healthcare, education, fashion and so on and that it is a big conglomerate. I asked him to explain in detail. This guy said it would take 2-3 hours and I need to meet his senior, who would be able to guide me better. I figured out that it’s going to be another MLM. This guy called me multiple times and I finally agreed to meet his senior, mainly to witness the fun of someone cajoling me. I was told to come to Brigade road. Scene 6: I land at the said location, only to find out that these folks operate out of coffee shops. In my case it was Starbucks. Cheap business in posh ambience...Grrrr....It's a long shameless story Observations: 1. All these folks who called me started their conversation like \"We are actually working on a wonderful business opportunity alongside a few people from IIT/IIM and are looking for partners to expand. I think you have the potential and would be a great fit, besides you can make big bucks in a short while.\"2. I met a doctor who earns well, but somehow fell into one such trap and she too told one story, which I also heard from so many others. The story goes like this: \"A guy joined this business a few years back. He built his next level team of people. A few days later, he committed a crime and had to go to jail. Upon getting released, he finds crores of Rs in his bank balance, because the folks whom he enrolled under him have increased the network manifold and as a result his kitty got filled\" Do you want me to believe this story? Seriously! Take away: Had I joined such a fraud/ponzi networks after getting tempted with their excessive hype, then: 1. I too would have developed a similar people pleaser, pleader attitude. 2. I too would have to artificially smile and initiate an unwelcome conversation with people at bookstores and bus stops. 3. I too would have to make follow up calls and lie with the statement \"We are actually working on a wonderful business alongside a few people from IIT/IIM ...\" 4. I too would have made my friends and acquaintances run away out of the fear of them being made the next scapegoat. 5. I too would have been desperate to recover the money I had invested and finally start pleading with people shamelessly, losing all the respect people had on me. 6. Guys in sales have to talk and impress prospects. But a smart salesman doesn't act like a shamelessly desperate guy. ",
            "date": "Updated October 2, 2019",
            "views": "489",
            "upvotes": " View 215 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaurav Agrawal",
                    "user_href": "/profile/Gaurav-Agrawal-194"
                },
                {
                    "user_id": "Uzman Fazmi",
                    "user_href": "/profile/Uzman-Fazmi"
                },
                {
                    "user_id": "Balu Balaji",
                    "user_href": "/profile/Balu-Balaji-7"
                },
                {
                    "user_id": "Jil Panicker",
                    "user_href": "/profile/Jil-Panicker"
                },
                {
                    "user_id": "Shashank Gupta",
                    "user_href": "/profile/Shashank-Gupta-829"
                },
                {
                    "user_id": "Santhiya Subbiah",
                    "user_href": "/profile/Santhiya-Subbiah"
                },
                {
                    "user_id": "Monisha Mohanan",
                    "user_href": "/profile/Monisha-Mohanan-20"
                },
                {
                    "user_id": "Spandana Bandi",
                    "user_href": "/profile/Spandana-Bandi-1"
                },
                {
                    "user_id": "Safitri Gu",
                    "user_href": "/profile/Safitri-Gu"
                },
                {
                    "user_id": "Nisarg Shah",
                    "user_href": "/profile/Nisarg-Shah-15"
                }
            ]
        }
    ]
}