{
    "title": "Is it true that there are no coincidences? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Dan Schmidt",
                "href": "/profile/Dan-Schmidt"
            },
            "answer_text": "No. Here's a good definition of \"coincidence\" from wikipedia (http://en.wikipedia.org/wiki/Coincidence):  A coincidence ... is a collection of two or more events or conditions, closely related by time, space, form, or other associations which appear unlikely to bear a relationship as either cause to effect or effects of a shared cause, within the observer's or observers' understanding of what cause can produce what effects. The key point is that coincidences exist in the perception of the beholders. When someone from a higher vantage point could see the logical train of events causing an occurrence that was perceived by others as a coincidence, it doesn't make the occurrence any less of a coincidence to people who experienced it as such. Even if one were to argue that every occurrence can be causally explained, it doesn't imply that there is no such thing as coincidences as long as there are individuals who do not know the logical underpinnings of every event. As long as human beings cannot predict the causal unfolding of the future the experience of coincidences will persist. ",
            "date": "Answered June 19, 2013",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Najmi",
                    "user_href": "/profile/Mohammed-Najmi"
                },
                {
                    "user_id": "Eric Martin",
                    "user_href": "/profile/Eric-Martin-78"
                },
                {
                    "user_id": "Khushpreet Singh",
                    "user_href": "/profile/Khushpreet-Singh-2"
                },
                {
                    "user_id": "Daria Lukina",
                    "user_href": "/profile/Daria-Lukina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Hampe",
                "href": "/profile/Barry-Hampe"
            },
            "answer_text": "No, it is not true. Certainly not in the sense in which this statement is usually made -- that things happening coincidentally is evidence of some sort of design or plan. That's just not so.  We live in an exciting world of never-ending random events. Sometimes two or more of these random events occur in close proximity to each other, such that we think, \"Well, that's a coincidence.\" And it is. In fact, that's all it is. Coincidences occur all around us all the time. But we tend to notice only those that affect us personally. And, of course, many things some people think of as coincidences really aren't. They just have a few similarities that attract our attention. For example: Lincoln-Kennedy coincidences urban legend. ",
            "date": "Answered June 19, 2013",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse Cohoon",
                    "user_href": "/profile/Jesse-Cohoon"
                },
                {
                    "user_id": "Danita Crouse",
                    "user_href": "/profile/Danita-Crouse"
                },
                {
                    "user_id": "Clare Celea",
                    "user_href": "/profile/Clare-Celea"
                },
                {
                    "user_id": "Michael Howard",
                    "user_href": "/profile/Michael-Howard"
                },
                {
                    "user_id": "John Savidge",
                    "user_href": "/profile/John-Savidge"
                }
            ]
        }
    ]
}