{
    "title": "Is it hard to get in the music industry? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amitabh Mukherjee",
                "href": "/profile/Amitabh-Mukherjee-27"
            },
            "answer_text": "Its harder than you actually think… Before getting into the music industry, let's think How much hard is it to make music?  I hope you have learned about the chapter Permutation and Combination in high school Mathematics. Music is just the arrangement of sounds one after the other which is done by some instruments or beat maker and sound producer applications. Lets assume you are working with 5000 sounds and out of that you have to produce a musical pattern of 3 minutes. Suppose, per minute you are using an average of 500 sounds so in 3 minutes you will use 500×3=1500 sounds So number of musical patterns of 3 minutes you can make are:- 5000×5000×5000…. 1500 times Which is 5000¹⁵⁰⁰ So you can form 5000¹⁵⁰⁰ musical patterns But You have to come up with the best musical pattern out of so many patterns which are very few in number… That is where musical intelligence comes into play. You have to have the sense of sound selection while creating a pattern and it takes a lot of time and practice to develop musical intelligence. Now let's get into the main topic that how much hard is it to get in the musical industry and make a career out of it… Its very hard to be honest.. After you have mastered to create your own musical pattern and developed your musical intelligence at a professional level, you have to contact with music production companies so that you can get a chance to work with them. Well if you are trying to make your own music production company at the very beginning or you want to start to publish your own musics on different sites, you have a high chance of failure in the music industry. You can do it after you have gained good popularity but not recommended to do at the beginning. Because, music is something which people listens from popular music productions and for background music in songs, the musical patterns are chosen to be made by someone who has good fame in the industry. Some musicians are naturally talented in this field and they are doing really great in the musical field which makes the competition very tough. But if you are passionate about this field and ready to work hard for it, you will may be the greatest musician next day :) ",
            "date": "Answered July 2, 2020",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlos Gutierrez",
                    "user_href": "/profile/Carlos-Gutierrez-198"
                },
                {
                    "user_id": "Dick Wolf",
                    "user_href": "/profile/Dick-Wolf-20"
                },
                {
                    "user_id": "Rakesh Dangi",
                    "user_href": "/profile/Rakesh-Dangi-43"
                },
                {
                    "user_id": "Pravakar Sharma",
                    "user_href": "/profile/Pravakar-Sharma-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnold Van Leeuwen",
                "href": "/profile/Arnold-Van-Leeuwen"
            },
            "answer_text": "The music industry is like other industry, is not so hard to get in, the problem is survive in it, there is a huge differences between other kind of industry,e.g. (computer media and internet industry) the difficulties to find the monies stream is so hard nowadays, there is a lots of professionals doing this business in records labels or bands like a (guitarist, managers, agents, singers, PR's, A&R, sound engineers, producers etc..) that have to have another jobs, and trying to be beyond of the difficulties that some huge companies and his business model  they have caused to the real music industry, like apple=Itunes, or Spotify, among many other similar, and all the computer media industry, app industry, that want a piece of the pie of the \"database=($)\", that provoque the music influence in ours societies. They have the administration and almost all the monies streams of the digital music incomes, the only field that still going beyond of this, is the live music, and this is so competitive field the most important its contacts and the social influences that you have. But, \"good music always be a good music\", and this is the key to be in this industry, if you have a good music try to sell it, try to put it in a movie, or netflix show, or try to create a viral product with it, so then, perhaps you start to get in this marvelous business.  i dont wanna be negative or pessimist, but the mission of all of us in this industry, is start to change the actual facts to build together a better future, for the next and future generations.  peace.  ",
            "date": "Answered May 9, 2016",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Wolf",
                    "user_href": "/profile/Dick-Wolf-20"
                },
                {
                    "user_id": "Angelo Alarcon",
                    "user_href": "/profile/Angelo-Alarcon-1"
                },
                {
                    "user_id": "James Grocutt",
                    "user_href": "/profile/James-Grocutt"
                },
                {
                    "user_id": "Israel James Cullett",
                    "user_href": "/profile/Israel-James-Cullett"
                },
                {
                    "user_id": "Kezi Harris",
                    "user_href": "/profile/Kezi-Harris"
                }
            ]
        }
    ]
}