{
    "title": "Is it bad if I don't like listening to music at all? - Quora",
    "tags": [
        "Listening to Music",
        "Hip Hop Music",
        "Music Recommendations",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Denis Costa",
                "href": "/profile/Sara-Denis-Costa-1"
            },
            "answer_text": "It’s not bad at all. Some people don’t like movies or books but that certainly doesn’t create a gap in their life as they are entertained and inspired by other forms of art and I’m sure you are as well. Contrary to what you might think, there are actually many people that don’t listen to music. It certainly makes you different as obviously it seems like the majority of people do but as long as you find other things that you love as much as people that listen to music love music, you won’t feel like you’re missing something in your life or anything. I personally don’t like movies and while I always get comments from people telling me that’s super weird and unusual, I really couldn’t care less. I love music and watching videos on YouTube and I certainly don’t feel the need to ever watch movies, or like my life is lacking something! ",
            "date": "Answered July 24, 2016",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohina",
                    "user_href": "/profile/Rohina-2"
                },
                {
                    "user_id": "Lif Strand",
                    "user_href": "/profile/Lif-Strand"
                },
                {
                    "user_id": "Justin Mendivil",
                    "user_href": "/profile/Justin-Mendivil"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Schaefer",
                "href": "/profile/Deborah-Schaefer-6"
            },
            "answer_text": "Oh!! What is unfortunate is that your question invites others to judge you. Or are you checking on your own self- judgement by ascertaining and evaluating the judgements other Quora members who may or may not respond? OR What if you elicit only my response? Will you decide that the answer is \"yes\" and that Quora is a super polite group, so do not respond in order not to offend you? OR What if the reverse occurs - how will you interpret that scenario? Will you tally the yes and no responses, leaving perhaps critical neutral judgemental positions on which to base your final self- judgement? or . . . or . . . etc Oh!! If I were to ever ask myself to judge myself as \"good\" or \"bad\" I would be inviting the instant release of a mental can of worms! I would not have a moment of serenity from that time onwards! Preferrably, if I was beginning to sense that I was unique in some way, then I would acknowledge to myself that I was now more aware of who I was at that time in my life. I practice allowing that time to pass into the distant memory, whilst retaining the filed awareness. Most often the awareness evolves into an inner celebration of my what makes me - me. Is that not what makes each of us an individual - our personal uniqueness? ",
            "date": "Answered April 18, 2018",
            "views": "618",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                }
            ]
        }
    ]
}