{
    "title": "Is it okay to use vibrato when beginning cello? - Quora",
    "tags": [
        "Vibrato",
        "Cellos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Fleury",
                "href": "/profile/Daniel-Fleury-3"
            },
            "answer_text": "Its fine to start practicing/learning vibrato under the supervision of your instructor. If you execute vibrato independently, multiple consequences may be undertaken due to a newly developed habit. In essentially any instrument, there is a peculiar uniqueness in technique. Every variable of your performance and playing can be severely flawed by a consistency of bad habits. Instruments, in contrast to many other activities, integrates muscular autonomy and memory. If you are generally adapted toward an individualized approach, than this will continue into your supposed musical career. Personally, I suggest receiving constructive feedback from your director. Vibrato holds great significance in intonation and complete quality of sound. Additionally, vibrato can influence your personal expression and articulation of music. Below are multiple consequences resulting from poorly developed vibrato technique. Flawed Technique and Articulation: As already mentioned, vibrato should be taken under the direction of a musical instructor. Since they have some professionalism, they will provide you with critical feedback and suggestions. Developed an initial understanding of vibrato will allow you to perpetuate it, eventually becoming automatic. If you take an individualized approach, you may flaw technique and expression of musical piece. Muscular Discomfort: The hand is a very hypersensitive (neurologically) of your body. Integrating a solid understanding of vibrato allows you to have gracefulness. However, if your vibrato is over-expressed, than you may sense discomfort in a musical passage. Conclusion: Yes, it’s fine to practice vibrato. However, it is critical that you do so under separate musical instruction or reliable resources. ",
            "date": "Answered October 11, 2016",
            "views": "174",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Willhoft",
                    "user_href": "/profile/Edward-Willhoft"
                },
                {
                    "user_id": "Brigitte Thorogood",
                    "user_href": "/profile/Brigitte-Thorogood"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Gene Breads",
                    "user_href": "/profile/Gene-Breads"
                },
                {
                    "user_id": "Igor Kuvychko",
                    "user_href": "/profile/Igor-Kuvychko"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kang",
                "href": "/profile/John-Kang-60"
            },
            "answer_text": "I started vibrato relatively early without supervision and now I have some difficulties in using vibrato past 6th position. Besides that, my vibrato is decent, so I guess I’m somewhat lucky. I would recommend that you, first, establish a base in terms of sound, contact, and form before you try using vibrato. If you still want to use vibrato (because who doesn't) always receive advice and proper form from an instructor. A firm base in vibrato will benefit you greatly in the future and an unsteady and incorrect usage of it early may haunt you in the future. ",
            "date": "Answered October 18, 2016",
            "views": "107",
            "upvotes": "0"
        }
    ]
}