{
    "title": "Is it okay to listen to rap music if you're a Christian? - Quora",
    "tags": [
        "Listening to Music",
        "Rap Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Burnett",
                "href": "/profile/Robert-Burnett-76"
            },
            "answer_text": "I think we tend to overgeneralize a lot when regarding music genres. I personally listen to metal. This obviously has a pretty big stereotype in most people’s minds. The first thing they think of is death or black metal, and they completely disregard the entire body of non-satanic music out there. There are many diverse genres within metal, ex: folk metal, power metal, thrash metal, Viking metal, even pirate metal (Alestorm). And there are even Christian metal bands. I’m saying this to reinforce the point that it depends on what specifically you listen to within that broad category of “rap music”. If the rapper is obviously a bad person, encouraging drug use, extreme language, then maybe don’t listen to them. But if someone isn’t like that, you should have no reason to think that you are a ‘sinful person’ because you listen to them. People tend to demonize what they don’t understand. To quote the author H.P. Lovecraft: “the oldest and strongest kind of fear is fear of the unknown.” As technology progresses at an ever-increasing rate. People will always have nostalgia about the past and criticize the youth. This generation of war has existed for centuries. The technical word for this fear is called Ephebiphobia. The criticism of rap music is part of this culture war between generations. This is just a natural part of being a human. However, it is important to step back and realize that some of this nostalgia that people have is not based on true reality. When this generation is old we are going to be looking back and talking about how we listened to good music when we were kids and how these teenagers nowadays are jus listening to garbage. So in conclusion, yes, a Christian can listen to rap music, just be careful what you listen to. (I personally don’t really listen to rap music, so I would not have a lot of good advice on what artists are ‘morally good’ and which are not, however, one of my friends who is also a Christian and likes rap music is a fan of Kanye West.) ",
            "date": "Answered February 1, 2020",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erin Quinn",
                    "user_href": "/profile/Erin-Quinn-24"
                },
                {
                    "user_id": "Julian Ross",
                    "user_href": "/profile/Julian-Ross-35"
                },
                {
                    "user_id": "Zander Tsadwa",
                    "user_href": "/profile/Zander-Tsadwa"
                },
                {
                    "user_id": "Javan Ekhalie",
                    "user_href": "/profile/Javan-Ekhalie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erin Quinn",
                "href": "/profile/Erin-Quinn-24"
            },
            "answer_text": "There are Christians who are rappers, both in the secular industry & in the Christian music industry. TobyMac is a hip-hop artist who’s been touring for over 20 years. Aaron Cole is a relatively new artist who’s opened for Toby on Hits Deep - very talented guy. NF tours mainstream, but a lot of his songs explore his faith. Jon Bellion isn’t a Christian, as far as I know - and he’s more hip-hop than rap - but his songs often touch on faith (and he also has some Christian dudes on his crew). twenty one pilots have some spoken-word elements, and have always openly discussed faith in their songs. There’s a lot of artists who are “safe” & others who are unoffensive, but thought-provoking. If your faith is strong, songs that encourage self-examination won’t hurt you. Your faith may even be strengthened, who knows? Bottom line - music in & of itself has no faith. Artists who are Christian (or searching) may write lyrics about their faith. But only you can decide what lyrics are safe & preferable for you. Check out Aaron Cole & NF :) ",
            "date": "Answered June 30, 2020",
            "views": "33",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ninja Nelson",
                    "user_href": "/profile/Ninja-Nelson"
                },
                {
                    "user_id": "Nnamdi Nzeduru",
                    "user_href": "/profile/Nnamdi-Nzeduru-2"
                },
                {
                    "user_id": "Theo Kukyuwa",
                    "user_href": "/profile/Theo-Kukyuwa"
                },
                {
                    "user_id": "Robert Bosca",
                    "user_href": "/profile/Robert-Bosca"
                },
                {
                    "user_id": "Shannon Monet’",
                    "user_href": "/profile/Shannon-Monet"
                },
                {
                    "user_id": "Javan Ekhalie",
                    "user_href": "/profile/Javan-Ekhalie"
                },
                {
                    "user_id": "Tonei Grossarth",
                    "user_href": "/profile/Tonei-Grossarth"
                }
            ]
        }
    ]
}