{
    "title": "Is Japan more like the UK or the US? - Quora",
    "tags": [
        "Japan",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Jones",
                "href": "/profile/Jon-Jones-219"
            },
            "answer_text": "Japan is like nowhere else on earth. Its streets are often smaller than an English medieval city's. Most of the housing stock is poorly constructed- who wants a concrete house in an earthquake. And you can't be in Tokyo a week and not feel at least one, and often several. So a lot of the building resembles mobile home type construction on a two storey steel frame. Everything is orderly. Hardly any litter. Unusual to see a vehicle driven recklessly. Very old people often doing apparently pointless tasks- directing traffic on supermarket carparks. There's a JCB (Komatso actually) digging up the road. With six people watching and two pensioners holding traffic lollipops- hint we use traffic lights! Young people often garishly dressed act as barkers for restaurants and bars- albeit fairly silently advertising their employers wares. Everything seems over manned. I've seen automatic tills in supermarkets with a girl packing your bag. 6 people stacking soap powder for a display was another overmanned wonder I recall watching. Trains are to the second and in rush hour you can be standing in carriage and the press of bodies lifts you off your feet. And I'm not a small guy. Recycling is a National obsession. There's bins, bags and nets. Plastic bottle caps are separated from the washed bottles. Tokyo by some measures is the world biggest city. The air is pristine. Due to the banning of small capacity diesels and after burners fitted to trucks. Truckers are well paid and work a 40 hr week WTF. They often wear suits and drive beautifully maintained and spotless trucks. Its also not unusual to see a smartly dressed guy in business attire quietly puking his ring up in say a train station. Not particularly discretely either. Japanese are often good natured drunks. And on the last train out of Tokyo home as it got out towards the burbs and the crowds thinned often drunks would accost me. ‘ Marveling' at my hands and feet- and no doubt thinking ‘ fucking simian giant' :-) The photo was taken in a Tokyo park 180kms from Mnt Fuji with a cheap phone. The air is crystal clear.  ",
            "date": "Answered March 1, 2020",
            "views": "396",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                },
                {
                    "user_id": "Jeffrey Troth",
                    "user_href": "/profile/Jeffrey-Troth"
                },
                {
                    "user_id": "Joe Wilder",
                    "user_href": "/profile/Joe-Wilder-10"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Joshua Reingold",
                    "user_href": "/profile/Joshua-Reingold"
                },
                {
                    "user_id": "Roger Fentiman",
                    "user_href": "/profile/Roger-Fentiman"
                },
                {
                    "user_id": "Rowan Males",
                    "user_href": "/profile/Rowan-Males-1"
                },
                {
                    "user_id": "Yeong Kim",
                    "user_href": "/profile/Yeong-Kim-3"
                },
                {
                    "user_id": "Edward Hodakowski",
                    "user_href": "/profile/Edward-Hodakowski"
                },
                {
                    "user_id": "Leopoldo Fernandez Suarez",
                    "user_href": "/profile/Leopoldo-Fernandez-Suarez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Reingold",
                "href": "/profile/Joshua-Reingold"
            },
            "answer_text": "Never been to Japan but worked with Japanese people and studied Karate. Japan has certain British tenets and certain American tenets. American Tenets in Japan Modern Japan is very capitalistic much like the United StatesJapan focuses on innovation and a great new inventions come out of Japan.Japanese workers work very hard and often work more than 40 hours a week. Japan has some of the longest working hours in the world. It's trying to changeBritish Tenets in Japan Modern Japan has a much bigger government safety net like Britain or Europe. They have government healthcare for example. Not saying this is good or bad just differentModern Japan values public safety over personal freedom. For example, Gun Laws in Japan are very strict. Not saying that this is good or bad just different.Maybe this is just in Karate, but Japanese interactions are come with mandated etiquette. Rudeness is always discouraged.Complaining isn’t common and others probably do not know a lot about personal hardships (which sounds very British to me). A Japanese person might have a family member in the hospital from an illness but will not discuss it so as to not burden others with their problems.",
            "date": "Answered March 1, 2020",
            "views": "66",
            "upvotes": "0"
        }
    ]
}