{
    "title": "Is Jason Derulo using BTS for clout in Savage Love? - Quora",
    "tags": [
        "Jason Derülo",
        "BTS Songs",
        "The BTS Fandom",
        "K-Pop Idols",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tara Jane",
                "href": "/profile/Tara-Jane-44"
            },
            "answer_text": "I didn’t even want to answer this. I didn’t. Because it uses the word ClOuT. Again. What I want to say is simply this. Automatically agreeing that Jason Derulo used BTS for clout is insulting. But here is why. It implies that people don’t trust members of BTS with their own career. That they are just walking around blind and practically begging to work with anyone. Being duped and used. Do you honestly think that they can’t sniff out a clout chaser?? Do you think they just go around letting people “use them”? Do you not trust them to make the best professional decisions in their own careers?? Can’t people ever think that maybe other artists WANT to work with them? Because they think they’re talented and they genuinely like them? Is everyone a clout chaser? I’m not here to argue, just offer a different perspective. All I do know is, some fans are making it REALLY hard for BTS to work with any other artist. Because they know they’ll be attacked if they say one wrong thing. Maybe Jason didn’t thank them or whatever. Ok. But does that automatically mean he didn’t enjoy working with them or think that they’re amazing artists? Even if you don’t trust Jason, don’t you trust them?  ",
            "date": "Answered October 21, 2020",
            "views": "19",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erin Moore",
                    "user_href": "/profile/Erin-Moore-229"
                },
                {
                    "user_id": "Denny Mack",
                    "user_href": "/profile/Denny-Mack-3"
                },
                {
                    "user_id": "Christina N",
                    "user_href": "/profile/Christina-N-84"
                },
                {
                    "user_id": "Areez Atif",
                    "user_href": "/profile/Areez-Atif"
                },
                {
                    "user_id": "Dee Dee",
                    "user_href": "/profile/Dee-Dee-1844"
                },
                {
                    "user_id": "Valentina Rodriguez",
                    "user_href": "/profile/Valentina-Rodriguez-149"
                },
                {
                    "user_id": "Deborah Ameh",
                    "user_href": "/profile/Deborah-Ameh"
                },
                {
                    "user_id": "Gigi Joy",
                    "user_href": "/profile/Gigi-Joy-7"
                },
                {
                    "user_id": "Kadelyn Zhao",
                    "user_href": "/profile/Kadelyn-Zhao"
                },
                {
                    "user_id": "Margaret G",
                    "user_href": "/profile/Margaret-G-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Destiny Jones",
                "href": "/profile/Destiny-Jones-451"
            },
            "answer_text": "I wasn’t gonna answer this just because y’all get mad at us when we say someone is using BTS for clout. But I don’t give a single fuck. Anyways yes I do. Mister Jason mentioned he only started respecting BTS when he heard about how powerful our fandom was because on voting we were beating mainstream artists like, Ariana grande, and some other big people it was and Ellen interview. Then he didn’t credit them. Now this is a big one for us… even other kpop stans are heated about it. Now just because it’s BTS doesn’t make it right if he did it to one of your favs I know you wouldn’t be happy so let’s not do the double standards thing. He didn’t even mention jawshy, the creator of the melody and I heard he also stole it and didn’t give him credit he just put lyrics on it and sang it. and before you say something like he didn’t need BTS that song was no where to be seen on the charts before he collabed with them and yeah it was remix but sir you and we both no they got you that no.1. The crazy thing about all of this is I bet he didn’t even know their names. and no we aren’t trying to make this seem like BTS are victims it’s just this has happened before so we get sick of it. Anyways what are your thoughts on this? ",
            "date": "Answered October 19, 2020",
            "views": "45",
            "upvotes": " View 186 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hosney Naznin",
                    "user_href": "/profile/Hosney-Naznin"
                },
                {
                    "user_id": "Tirumala Lolugu",
                    "user_href": "/profile/Tirumala-Lolugu"
                },
                {
                    "user_id": "Dinky Singh",
                    "user_href": "/profile/Dinky-Singh-2"
                },
                {
                    "user_id": "Adam Sduu",
                    "user_href": "/profile/Adam-Sduu"
                },
                {
                    "user_id": "Ervita Marviani",
                    "user_href": "/profile/Ervita-Marviani"
                },
                {
                    "user_id": "Lemme Goh",
                    "user_href": "/profile/Lemme-Goh"
                },
                {
                    "user_id": "Shruti Khade",
                    "user_href": "/profile/Shruti-Khade"
                },
                {
                    "user_id": "Manal Khan",
                    "user_href": "/profile/Manal-Khan-130"
                },
                {
                    "user_id": "Everleigh Lewis",
                    "user_href": "/profile/Everleigh-Lewis"
                },
                {
                    "user_id": "Luna Kim",
                    "user_href": "/profile/Luna-Kim-84"
                }
            ]
        }
    ]
}