{
    "title": "Is Kanye West intelligent? - Quora",
    "tags": [
        "Kanye West (musician)",
        "Celebrity and Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Intelligence",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Gerchik",
                "href": "/profile/Daniel-Gerchik"
            },
            "answer_text": "I'm a huge Kanye fan and I think he is very intelligent. He seems untethered by expectations and eager to follow his myriad of ever changing (dark and twisted) fascinations. These are traits of a very bright person. Sometimes I wonder if he is on the autism spectrum. He seems to think very conceptually and his interactions with people (at least in interviews) appear to have this far-away, inorganic quality. Even his facial expressions are often bizarrely disconnected to what's actually happening around him. I don't think this unearthly vibe is an affectation. A recurring answer to this question is that he's a \"Musical Genius\". I'm not sure if I'm ready to go that far, but he's very gifted and ambitious (within the relatively unambitious context of pop music). My issue with calling him a musical genius is that his music is largely sample based, which is more repurposing/curating other people's brilliance than \"pure\" creation. Also he's increasingly using a faceless team of co-producers that I think have been doing the heavy lifting in terms of making the actual beats to his songs the last handful of years/albums. I think it's likely that Kanye get's an idea or inspiration and sort of just tells his team, \"Make something that sounds like this\" and keeps prodding them until the finished product is to his liking. No doubt, he has impeccable taste but I consider someone like Stevie Wonder who has a preternatural understanding of music to be a genius. In my mind, Kanye is a gifted and ambitious, but his facility with music isn't in a Stevie, Brian Wilson, McCartney, Quincy Jones, Prince league.  In a way he's kind of like Andy Warhol but, again, I've seen no evidence of him being able to play an instrument and he's a truly atrocious singer. Kanye has so many great songs and it baffles me that he's often criticized as an MC. He's consistently hilarious, turns a phrase like Don Rickles, can be vulnerable in a way most rappers would never dare and has thought provoking, socially relevant lyrics. This alone makes him much more compelling to me than pretty much any other rapper out there and is further testament to his intelligence.  His artistic choices aren't cloistered by the aesthetic limitations of his native genre and, to me, that requires a great deal of intelligence. ",
            "date": "Updated January 28, 2016",
            "views": "82",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Toumazatos",
                    "user_href": "/profile/Anthony-Toumazatos"
                },
                {
                    "user_id": "Star Lord",
                    "user_href": "/profile/Star-Lord-448"
                },
                {
                    "user_id": "Michael Waters",
                    "user_href": "/profile/Michael-Waters-8"
                },
                {
                    "user_id": "Ali Dashti",
                    "user_href": "/profile/Ali-Dashti-19"
                },
                {
                    "user_id": "Gideon Marshall",
                    "user_href": "/profile/Gideon-Marshall"
                },
                {
                    "user_id": "Ashley Rodham",
                    "user_href": "/profile/Ashley-Rodham"
                },
                {
                    "user_id": "Spencer Nugent",
                    "user_href": "/profile/Spencer-Nugent-2"
                },
                {
                    "user_id": "T Prez",
                    "user_href": "/profile/T-Prez-1"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "David Lavish",
                    "user_href": "/profile/David-Lavish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Manie",
                "href": "/profile/Pranav-Manie"
            },
            "answer_text": "Musically? Kanye West is one of the best out there. The man made legendary beats for Jay-Z. His collaborations range from Daft Punk, to Bon Iver, to even Travis Scott, which goes to show not that his quality fluctuates, but that he knows what he has to do in order to make unconventional beats every time. He's tried straight-up bangers, jazz, industrial hip-hop, house music, trap, and classic hip-hop as well. Personally, I think that nobody else can do samples better than him right now. His music videos are great, too. He's one reason why AutoTune is used as much as it is today: to stretch boundaries. Every single album he's made, including 808 and Pablo, is good to say the least. He's used his angst and distress to make 808&H and “Through The Wire”. I don't really care for his fashion sense much. I just know about his rather expensive Yeezys, his Balmain campaign for which he shot the music video for Wolves (which is aesthically slick), and nothing else. Which brings me to his controversial parts. The whole Taylor Swift episode was bad. The Beck episode was bad. And the tweets. The tweets. I'm in splits. Man voices his support for Trump, that's fine by me. Then says things like “slavery was a choice\". I don't know US history much, but I know that that line there is problematic. I think he thinks everybody is a genius like him. Looking from an ivory tower does that, I think. He might be genuine in saying “Love Everyone”, but he's misinformed. It is also possible he's doing all this just to generate publicity. I'm eagerly waiting for both his albums to drop in June. I'm pretty sure they'll be good, as long as he does not collaborate with crap artists like Smokepurpp and avoids poop. ",
            "date": "Answered May 3, 2018",
            "views": "29",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Star Lord",
                    "user_href": "/profile/Star-Lord-448"
                },
                {
                    "user_id": "Lod Byai",
                    "user_href": "/profile/Lod-Byai-1"
                },
                {
                    "user_id": "Ujjwal Bhoria",
                    "user_href": "/profile/Ujjwal-Bhoria"
                },
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                },
                {
                    "user_id": "Laurel Black",
                    "user_href": "/profile/Laurel-Black-3"
                },
                {
                    "user_id": "Katyan Anshuman",
                    "user_href": "/profile/Katyan-Anshuman"
                },
                {
                    "user_id": "Vivek Anand",
                    "user_href": "/profile/Vivek-Anand-607"
                }
            ]
        }
    ]
}