{
    "title": "Is Kpop a bad influence on teens? - Quora",
    "tags": [
        "Influence",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maryam Madawi",
                "href": "/profile/Maryam-Madawi"
            },
            "answer_text": "During high school I hated myself. I despised my very being. At times, I still do. Puberty sucked for me. I didn’t realise it until I had passed it, but it was terrible. I had trouble finding ways to keep smiling, to keep laughing. It became a chore. I didn’t have a proper outlet from all the accumulated stress I was getting. Mental breakdowns were far too common. I would be sitting in my tears for hours before I had the strength to put myself back together. A friend introduced me to the group BTS. I thought nothing of it. Patiently, I would watch through the videos she would show me with glee and excitement. As corny as this may sound but her eyes were quite literally glistening every time she spoke of the group and their videos. You would think she won a million dollars from the way she spoke. One day we both sat down and simply started watching gag videos of BTS. I couldn’t stop laughing. I remember thinking that I hadn’t laughed that hard in a while - laughing without caring about anything else. Then she made me listen to a song - 2! 3! (Hoping for more good days). I sat there and cried while listening to it. The words I needed so desperately needed someone to say, they were saying it. As I began to look deeper into their songs, more and more of what they said were like cold truths and I found comfort in that. Western music, generally speaking, is usually centered around a romantic theme. I became tired of listening to songs about a love that I had never experienced. I wanted to listen to something I could relate to deeply. BTS sang those songs. They gave me the validation my thoughts desperately needed. They were the lifeboat I needed. For that, I am ever so thankful. No. Kpop isn’t a bad influence. Yes, there are stories of teens becoming obsessed or addicted to it in an unhealthy way. But looking at the root of why they started to like K-pop, the reason is almost always harmless. It’s managing this influence in a healthy way or in a way that doesn’t affect them that is key to preventing it from becoming a bad influence. ",
            "date": "Answered October 21, 2018",
            "views": "42",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vu Anh",
                    "user_href": "/profile/Vu-Anh-21"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-1000"
                },
                {
                    "user_id": "Zahin Rashid Faiza",
                    "user_href": "/profile/Zahin-Rashid-Faiza"
                },
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                },
                {
                    "user_id": "Iruzen Space",
                    "user_href": "/profile/Iruzen-Space"
                },
                {
                    "user_id": "Therese Borgaily",
                    "user_href": "/profile/Therese-Borgaily-1"
                },
                {
                    "user_id": "Banana Queso",
                    "user_href": "/profile/Banana-Queso"
                },
                {
                    "user_id": "Rosiecookie",
                    "user_href": "/profile/Rosiecookie"
                },
                {
                    "user_id": "Diana Grey",
                    "user_href": "/profile/Diana-Grey-13"
                },
                {
                    "user_id": "Iwana Izzah",
                    "user_href": "/profile/Iwana-Izzah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dasha Yu",
                "href": "/profile/Dasha-Yu-3"
            },
            "answer_text": "It depends on the person honestly. There are those who listen to K-pop for the music, and there are the delusional teenagers who think they’ll meet their idol and get married to them one day.  It’s not a bad influence as long as it doesn’t get to your head. If your child wants to become an idol and starts eating an ice cube for food everyday, no duh it’s a bad influence. But if your child only likes K-pop for the songs, visuals, aesthetics, dancing, etc, it can actually be really fun for them. Most idols also strongly encourage loving yourself and blah blah blah, instead of s*x/money, so the messages are probably better than most other celebrities. You can buy merch, have fun with your friends, fangirl over comebacks, and all that fun stuff.  Now, a lot of people say it’s a bad influence without looking at all the aspects first. You can judge K-pop based off the few bubblegum pop songs, childish music videos, crazy toxic stan Twtitter, getting defensive over anything relating to their faves. But that’s only the 20% of the community you’ve seen. The rest of us are actually really chill and laid back, and a lot of us come for the memes.  The media has stereotyped us as crazy delusional 14-year-olds with toxic fandoms. We all fall for that lie, even me. I used to hate Kpop with a passion for no reason at all, and now that I look back, I realize that we can be very ignorant to new trends.  But once you actually try to understand our music preference and respect our taste (it’s literally just music lmfao), you’ll see that you can avoid all that dumbness while having fun at the same time. All fandoms have toxic fans; it’s just that the Western media doesn’t really bring up those things, only highlighting K-pop as the weird colorful genre for toddlers. It’s really not. A lot of the songs are sad ballads, dark concepts, rap, pop, etc. It’s literally like any other music, just in a different language.  You might think I’m biased because I’m both Korean and a fan of Kpop so it’s easy to sugarcoat everything. But the thing is, I might have hated it more than anyone else in this universe. I regret being so narrow-minded back then, but if you get past that wall of ignorance, it doesn’t matter whether you dislike or love it. K-pop isn’t the taste for a lot of people and it’s fine as long as you don’t proclaim your hate to the universe. You might ask why I’m so focused and intent on making people understand my love for K-pop, it’s only because people judge me for my music taste. I want people to stop hating me just because I like a certain type of song. We’re all the same humans, we’re just born with different music preferences.  So overall, it’s not a bad influence on kids or teenagers or adults or anyone else. The situation may be different if you’re a 9-year-old with a crazy passion for stalking their idols, but other than that, we know what we’re doing. We’re not unintelligent bots with no brains who spend 24/7 streaming music videos lmao, most of us don’t even care about views and people shitting on us in the comment sections of something totally irrelevant to K-pop. So just keep in mind to not judge someone based on their music taste; it’ll help you earn their respect in the long run. Bai bai I hope this helpedDddDdd :D  ",
            "date": "Answered September 3, 2020",
            "views": "915",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lindsey Luo",
                    "user_href": "/profile/Lindsey-Luo-5"
                },
                {
                    "user_id": "Vu Anh",
                    "user_href": "/profile/Vu-Anh-21"
                },
                {
                    "user_id": "Kaitlyn Perkins",
                    "user_href": "/profile/Kaitlyn-Perkins-19"
                },
                {
                    "user_id": "Jamila Francis",
                    "user_href": "/profile/Jamila-Francis-10"
                },
                {
                    "user_id": "Daonie Young",
                    "user_href": "/profile/Daonie-Young"
                },
                {
                    "user_id": "Haeun Kim",
                    "user_href": "/profile/Haeun-Kim-49"
                },
                {
                    "user_id": "Zahin Rashid Faiza",
                    "user_href": "/profile/Zahin-Rashid-Faiza"
                },
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                },
                {
                    "user_id": "Liliana Iancu",
                    "user_href": "/profile/Liliana-Iancu-2"
                },
                {
                    "user_id": "Gimena Guerrero",
                    "user_href": "/profile/Gimena-Guerrero-1"
                }
            ]
        }
    ]
}