{
    "title": "Is learning guitar hard? How long did it take you to learn guitar? - Quora",
    "tags": [
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Knazek",
                "href": "/profile/Wayne-Knazek-1"
            },
            "answer_text": "When you say “to learn guitar” . . . well, no one ever finishes learning guitar. So how long did it take me to “learn guitar”? That’s really an interesting, and LONG story. But I’ll give you the short story. How long it takes anyone to get a good handle on the whole thing is different for everyone. For some, it’s easier. For other, it’s nearly insurmountable. What you probably mean in your question is, how long did it take go get to the point where other people said . . . Man, he can really play guitar! The first time I touched a guitar, I’d been watching our lead guitar player try to figure out the intro to the Byrd’s version of Mr. Tambourine Man. He set his guitar down to take a “can” break. I picked up his Strat, tinkered a bit, watching what he’d try to do. Thought about the song, and listened in my head . . . then figured it out. The next time I touched a guitar was months later. Shortened, our rhythm guitarist was gonna sing a song he wrote. Could not sing and play at the same time. He handed me his Strat and showed me the chords. Just a barre E form in 3 places. 12 bar thing. And I played it. The band then rehearsed it with me playing rhythm guitar on that song. So for me, barre chords have never been a problem. I could play them after a couple minutes, and could play the 12 bar progression after brief instruction. And I learned the open D and A while watching our other guitarist in the other band months before. That’s where it started for me back in the mid 60’s. My dad bought me a Fender guitar and Fender amp, and I took off from there. I started learning hooks and solos by ear, listening to records. But I plateaued. So I signed up for some lessons. Started learning theory. Got into Jazz. Took some Jazz lessons! Loved Blues, and also loved Surf. Also got into Santana and Latin Rock, and had to work to understand modes, and how they work, etc.. So if you ask me if it’s hard to learn to play guitar, only because I’ve taught so many people, and know what they went through, I can say yes it is. Maybe I could play barre chords with no previous guitar experience because 1). I WANTED to. and 2). because no one ever told me it was difficult. A LOT of it is in your head. Remember the old Hawaiian saying . . . Yagottawanna ! ! ! ",
            "date": "Answered March 18, 2020",
            "views": "230",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Todd Williams",
                    "user_href": "/profile/Todd-Williams-261"
                },
                {
                    "user_id": "Delmont Ribeiro",
                    "user_href": "/profile/Delmont-Ribeiro"
                },
                {
                    "user_id": "Esau Merino",
                    "user_href": "/profile/Esau-Merino-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig De Witt",
                "href": "/profile/Craig-De-Witt-1"
            },
            "answer_text": "I bought my second guitar at the tender age of 22. When I was 7 years old I begged my dad to buy me a guitar. He did. Times were tough for the folks then but he did. It was of course a cheapie, hurt the fingers like hell but I was determined to play. Folks quickly sent me to lessons. Lesson one, teacher opens the door to his apartment and he smells like feces. Seven years old and sitting with this guy who smelled like crap had a lasting effect on my guitar playing. I refused to go to lessons again, folks had to put up with me fumbling around with my guitar and Alfred’s chord chart 1970’s waay before anything remotely like internet). Not really knowing what I was doing, my folks had to put up with my guitar playing sounding like that guitar teacher smelled. Back to age 22 Bought guitar (guitar shop sold me a warped neck so action was crap, hurt every time I played, even after callouses formed) but while playing with mates learned some cool tunes, played some, messed around but life was in the way. When I was 29 I met my wife, she played beautifully with a classical finger style. I was motivated and we played together a lot. My playing improved no end. Along came the kids and a career and then retrenchment and a new own business etc and guitar was benched along with a lot of other dreams. I picked up the guitar again when I was around 44 years old. I struggled. I was asked to play one song in church which I practiced for, could play it fairly well. I did that but really struggled to get anywhere. I could not afford lessons at the time so I again just bumbled along with the internet, until I formed a church band. That poor congregation were saints, their ears bled, a lot!, however with regular playing and practice and learning from each other we got better and better and better. I struggled with Rhythm and dynamics (I hit those strings really hard). I was given a bass, we had too many guitarists anyway, and through the bass was able to slow down and learn the structures that make up the rhythm. That improved my guitar playing immensely and once over that hump my playing improved leaps and bounds. I suppose it’s also a confidence thing. I’m still learning and learning and learning. I know the above story was long but in answer to your question Yes it is hard, but how hard is up to you and how you approach it. Here are some tips . Where is your head? Are you up for the long haul? (decide how you want to play and its cool just to play a few camp fire songs, you will be better than approx 99.4% of other people in the world. Pretty special right?)Get a teacher if you can, even if it is for a few lessons. (just smell them before you pay :-)) No really, I often wonder how my playing would have turned out had that guy decided to use the bathroom after I left instead of before I arrived.Make sure your guitar is playable. A badly set up or cheap guitar that even after months of practice it hurts your fingers to play it will leave you uninspired.Playing alone takes dedication and talent. For me where talent was lacking I became frustrated by not having a measurement to see how I was progressing. Play with buddies or at least record your playing and review be as critical with yourself as your buddies would be.Find the right motivation. This helps hugely especially on those days when the the worlds weight of 13,170,000,000,000,000,000,000,000 pounds is sitting on your shoulders alone. Guitar is my happy place.Recognise your weaknesses and prioritise them. Don’t forget to reward yourself by having fun with your strengths. Find ways of working through your weaknesses. If a particular technique is not working for you then google every video that you can find on the subject, speak to every guitarist you can about it. Sometimes the right approach will make you wonder what all the fuss was about.If it’s not fun, choose something else that is.",
            "date": "Answered March 19, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chuck Mantell",
                    "user_href": "/profile/Chuck-Mantell"
                }
            ]
        }
    ]
}