{
    "title": "Is listening to English songs without knowing their meaning good? - Quora",
    "tags": [
        "English Songs",
        "Listening to Music",
        "Listening",
        "Song Lyrics",
        "Music Recommendations",
        "Learning English",
        "Songs",
        "Music",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angelita Hayes",
                "href": "/profile/Angelita-Hayes"
            },
            "answer_text": "I listen to songs in languages I don’t understand all the time. It’s definitely ok to do that. Sometimes you can understand the meaning or at least get a general idea of the meaning just because of the style, tone, and mood of the song. Of course it is better if you understand the lyrics too because then you get the full meaning and can sometimes feel all the emotions along with the singer. You definitely get the full experience of all the feelings that go along with listening to a particular song if you can understand the lyrics. That definitely doesn’t mean it’s only good to listen to songs in languages you understand though. There are so many good songs that might be in languages you don’t understand and you would be missing out by not listening to them, even if you can only listen to some of them as just catchy bops. ",
            "date": "Answered May 14, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bharat Hiranwale",
                "href": "/profile/Bharat-Hiranwale"
            },
            "answer_text": "Of course you can listen to other songs languages. Doesn't matter whether you understand the lyrics or meaning of the song. Song is made of two things, music and lyrics. Though you don't understand lyrics or meaning, you may still like the music or tune. And furthermore from my personal experience I can say that even though you get the words of a song, you may not understand the true meaning of those words as those are based on personal experiences of the lyricist and may seem unrelated. To summarize, just enjoy the songs you like. ",
            "date": "Answered May 14, 2020",
            "views": "18",
            "upvotes": " Answer requested by Abhishek"
        }
    ]
}