{
    "title": "Is listening to music good for you? - Quora",
    "tags": [
        "Listening to Music",
        "Listening"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cliff Miller",
                "href": "/profile/Cliff-Miller"
            },
            "answer_text": "Anything that relaxes you or puts you in a better frame of mind is good for you including music as it lowers the stress hormone cortisol and increases the pleasure hormone endorphin's. It is now known that excessive and continued stress weakens the immune system and is the catalyst for many chronic diseases such as cancer, allergies, colds flue and even diabetes. Cortisol mixed with insulin is now known to cause insulin resistance, a precursor to diabetes. ",
            "date": "Answered August 17, 2018",
            "views": "138",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anser Quraishi",
                    "user_href": "/profile/Anser-Quraishi"
                },
                {
                    "user_id": "Luke Yoder",
                    "user_href": "/profile/Luke-Yoder-9"
                },
                {
                    "user_id": "Andrew Wagenknecht",
                    "user_href": "/profile/Andrew-Wagenknecht-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Harris",
                "href": "/profile/Paul-Harris-220"
            },
            "answer_text": "All of the answers here seem to agree that listening to music is good for you. Some even point to studies that affirm this. The one factor that studies ignore is that it really depends on the music that you’re listening to. The studies that are often referred to mostly involve listening to calming, soothing music so… of course that’s going to be good for you. On the other hand, try listening to some loud punk rock or gangsta rap. Do you still feel soothed? Music is a stimulus, just like any other sensory phenomena. Some things sound good… Other things sound awful. The same thing can be said of all of your other senses. Hedonists try to take advantage of great feels, smells, sights, sounds, tastes. All of those sensations are “good for you”. ",
            "date": "Answered August 17, 2018",
            "views": "209",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anser Quraishi",
                    "user_href": "/profile/Anser-Quraishi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "Andrew Wagenknecht",
                    "user_href": "/profile/Andrew-Wagenknecht-1"
                }
            ]
        }
    ]
}