{
    "title": "Is listening to music haram in Islam or a sin? - Quora",
    "tags": [
        "Haram",
        "Sin",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Abd-Allah",
                "href": "/profile/Muhammad-Abd-Allah-2"
            },
            "answer_text": " Ruling on music, singing and dancing Praise be to Allaah. Ma’aazif is the plural of mi’zafah, and refers to musical instruments (Fath al-Baari, 10/55), instruments which are played (al-Majmoo’, 11/577). Al-Qurtubi (may Allaah have mercy on him) narrated from al-Jawhari (may Allaah have mercy on him) that ma’aazif means singing. In his Sihaah it says that it means musical instruments. It was also said that it refers to the sound of the instruments. In al-Hawaashi by al-Dimyaati (may Allaah have mercy on him) it says: ma’aazif means drums (dufoof, sing. daff) and other instruments which are struck or beaten (Fath al-Baari, 10/55). Evidence of prohibition in the Qur’aan and Sunnah: Allaah says in Soorat Luqmaan (interpretation of the meaning): “And of mankind is he who purchases idle talks (i.e. music, singing) to mislead (men) from the path of Allaah…” [Luqmaan 31:6] The scholar of the ummah, Ibn ‘Abbaas (may Allaah be pleased with him) said: this means singing. Mujaahid (may Allaah have mercy on him) said: this means playing the drum (tabl). (Tafseer al-Tabari, 21/40). Al-Hasan al-Basri (may Allaah have mercy on him) said: this aayah was revealed concerning singing and musical instruments (lit. woodwind instruments). (Tafseer Ibn Katheer, 3/451). Al-Sa’di (may Allaah have mercy on him) said: this includes all manner of haraam speech, all idle talk and falsehood, and all nonsense that encourages kufr and disobedience; the words of those who say things to refute the truth and argue in support of falsehood to defeat the truth; and backbiting, slander, lies, insults and curses; the singing and musical instruments of the Shaytaan; and musical instruments which are of no spiritual or worldly benefit. (Tafseer al-Sa’di, 6/150) Ibn al-Qayyim (may Allaah have mercy on him) said: The interpretation of the Sahaabah and Taabi’in, that ‘idle talk’ refers to singing, is sufficient. This was reported with saheeh isnaads from Ibn ‘Abbaas and Ibn Mas’ood. Abu’l-Sahbaa’ said: I asked Ibn Mas’ood about the aayah (interpretation of the meaning), ‘“And of mankind is he who purchases idle talks’ [Luqmaan 31:6]. He said: By Allaah, besides Whom there is no other god, this means singing – and he repeated it three times. It was also reported with a saheeh isnaad from Ibn ‘Umar (may Allaah be pleased with them both) that this means singing. There is no contradiction between the interpretation of “idle talk” as meaning singing and the interpretation of it as meaning stories of the Persians and their kings, and the kings of the Romans, and so on, such as al-Nadr ibn al-Haarith used to tell to the people of Makkah to distract them from the Qur’aan. Both of them are idle talk. Hence Ibn ‘Abbaas said: “Idle talk” is falsehood and singing. Some of the Sahaabah said one and some said the other, and some said both. Singing is worse and more harmful than stories of kings, because it leads to zinaa and makes hypocrisy grow (in the heart); it is the trap of the Shaytaan, and it clouds the mind. The way in which it blocks people from the Qur’aan is worse than the way in which other kinds of false talk block them, because people are naturally inclined towards it and tend to want to listen to it. The aayaat condemn replacing the Qur’aan with idle talk in order to mislead (men) from the path of Allaah without knowledge and taking it as a joke, because when an aayah of the Qur’aan is recited to such a person, he turns his back as if he heard them not, as if there were deafness in his ear. If he hears anything of it, he makes fun of it. All of this happens only in the case of the people who are most stubbornly kaafirs and if some of it happens to singers and those who listen to them, they both have a share of this blame. (Ighaathat al-Lahfaan, 1/258-259). Allaah says (interpretation of the meaning): “[Allaah said to Iblees:] And befool them gradually those whom you can among them with your voice (i.e. songs, music, and any other call for Allaah’s disobedience)…” [al-Israa’ 17:64] It was narrated that Mujaahid (may Allaah have mercy on him) said: “And befool them gradually those whom you can among them with your voice” – his voice [the voice of Iblees/Shaytaan] is singing and falsehood. Ibn al-Qayyim (may Allaah have mercy on him) said: This idaafah [possessive or genitive construction, i.e., your voice] serves to make the meaning specific, as with the phrases [translated as] “your cavalry” and “your infantry” [later in the same aayah]. Everyone who speaks in any way that is not obedient to Allaah, everyone who blows into a flute or other woodwind instrument, or who plays any haraam kind of drum, this is the voice of the Shaytaan. Everyone who walks to commit some act of disobedience towards Allaah is part of his [the Shaytaan’s] infantry, and anyone who rides to commit sin is part of his cavalry. This is the view of the Salaf, as Ibn ‘Abi Haatim narrated from Ibn ‘Abbaas: his infantry is everyone who walks to disobey Allaah. (Ighaathat al-Lahfaan). Allaah says (interpretation of the meaning): “Do you then wonder at this recitation (the Qur’aan)? And you laugh at it and weep not, Wasting your (precious) lifetime in pastime and amusements (singing)” [al-Najm 53:59-61] ‘Ikrimah (may Allaah have mercy on him) said: it was narrated from Ibn ‘Abbaas that al-sumood [verbal noun from saamidoon, translated here as “Wasting your (precious) lifetime in pastime and amusements (singing)”] means “singing”, in the dialect of Himyar; it might be said “Ismidi lanaa” [‘sing for us’ – from the same root as saamidoon/sumood] meaning “ghaniy” [sing]. And he said (may Allaah have mercy on him): When they [the kuffaar] heard the Qur’aan, they would sing, then this aayah was revealed. Ibn Katheer (may Allaah have mercy on him) said: Allaah says (interpretation of the meaning) “Wasting your (precious) lifetime in pastime and amusements (singing)” – Sufyaan al-Thawri said, narrating from his father from Ibn ‘Abbaas: (this means) singing. This is Yemeni (dialect): ismad lana means ghan lana [sing to us]. This was also the view of ‘Ikrimah. (Tafseer Ibn Katheer). It was reported from Abu Umaamah (may Allaah be pleased with him) that the Messenger of Allaah (peace and blessings of Allaah be upon him) said: “Do not sell singing slave women, do not buy them and do not teach them. There is nothing good in this trade, and their price is haraam. Concerning such things as this the aayah was revealed (interpretation of the meaning): ‘And of mankind is he who purchases idle talks (i.e. music, singing) to mislead (men) from the path of Allaah…’ [Luqmaan 31:6].” (Hasan hadeeth) The Messenger of Allaah (peace and blessings of Allaah be upon him) said: “Among my ummah there will certainly be people who permit zinaa, silk, alcohol and musical instruments…” (Narrated by al-Bukhaari ta’leeqan, no. 5590; narrated as mawsool by al-Tabaraani and al-Bayhaqi. See al-Silsilah al-Saheehah by al-Albaani, 91). Ibn al-Qayyim (may Allaah have mercy on him) said: This is a saheeh hadeeth narrated by al-Bukhaari in his Saheeh, where he quoted it as evidence and stated that it is mu’allaq and majzoom. He said: Chapter on what was narrated concerning those who permit alcohol and call it by another name. This hadeeth indicates in two ways that musical instruments and enjoyment of listening to music are haraam. The first is the fact that the Prophet (peace and blessings of Allaah be upon him) said: “[they] permit” which clearly indicates that the things mentioned, including musical instruments, are haraam according to sharee’ah, but those people will permit them. The second is the fact that musical instruments are mentioned alongside things which are definitely known to be haraam, i.e., zinaa and alcohol: if they (musical instruments) were not haraam, why would they be mentioned alongside these things? (adapted from al-Silsilah al-Saheehah by al-Albaani, 1/140-141) Shaykh al-Islam (Ibn Taymiyah) (may Allaah have mercy on him) said: This hadeeth indicates that ma’aazif are haraam, and ma’aazif means musical instruments according to the scholars of (Arabic) language. This word includes all such instruments. (al-Majmoo’, 11/535). Ibn al-Qayyim (may Allaah have mercy on him) said: And concerning the same topic similar comments were narrated from Sahl ibn Sa’d al-Saa’idi, ‘Imraan ibn Husayn, ‘Abd-Allaah ibn ‘Amr, ‘Abd-Allaah ibn ‘Abbaas, Abu Hurayrah, Abu Umaamah al-Baahili, ‘Aa’ishah Umm al-Mu’mineen, ‘Ali ibn Abi Taalib, Anas ibn Maalik, ‘Abd al-Rahmaan ibn Saabit and al-Ghaazi ibn Rabee’ah. Then he mentioned it in Ighaathat al-Lahfaan, and it indicates that they (musical instruments) are haraam. It was narrated that Naafi’ (may Allaah have mercy on him) said: Ibn ‘Umar heard a woodwind instrument, and he put his fingers in his ears and kept away from that path. He said to me, O Naafi’, can you hear anything? I said, No. So he took his fingers away from his ears and said: I was with the Prophet (peace and blessings of Allaah be upon him) and he heard something like this, and he did the same thing. (Saheeh Abi Dawood). Some insignificant person said that this hadeeth does not prove that musical instruments are haraam, because if that were so, the Messenger of Allaah (peace and blessings of Allaah be upon him) would have instructed Ibn ‘Umar (may Allaah be pleased with them both) to put his fingers in his ears as well, and Ibn ‘Umar would have instructed Naafi’ to do likewise! The response to this is: He was not listening to it, but he could hear it. There is a difference between listening and hearing. Shaykh al-Islam (Ibn Taymiyah) (may Allaah have mercy on him) said: Concerning (music) which a person does not intend to listen to, there is no prohibition or blame, according to scholarly consensus. Hence blame or praise is connected to listening, not to hearing. The one who listens to the Qur’aan will be rewarded for it, whereas the one who hears it without intending or wanting to will not be rewarded for that, because actions are judged by intentions. The same applies to musical instruments which are forbidden: if a person hears them without intending to, that does not matter. (al-Majmoo’, 10/78). Ibn Qudaamah al-Maqdisi (may Allaah have mercy on him) said: the listener is the one who intends to hear, which was not the case with Ibn ‘Umar (may Allaah be pleased with them both); what happened in his case was hearing. The Prophet (peace and blessings of Allaah be upon him) needed to know when the sound stopped because he had moved away from that path and blocked his ears. So he did not want to go back to that path or unblock his ears until the noise had stopped, so when he allowed Ibn ‘Umar to continue hearing it, this was because of necessity. (al-Mughni, 10/173) (Even though the hearing referred to in the comments of the two imaams is makrooh, it was permitted because of necessity, as we will see below in the comments of Imaam Maalik (may Allaah have mercy on him). And Allaah knows best). The views of the scholars (imaams) of Islam Al-Qaasim (may Allaah have mercy on him) said: Singing is part of falsehood. Al-Hasan (may Allaah have mercy on him) said: if there is music involved in a dinner invitation (waleemah), do not accept the invitation (al-Jaami by al-Qayrawaani, p. 262-263). Shaykh al-Islam Ibn Taymiyah (may Allaah have mercy on him) said: The view of the four Imaams is that all kinds of musical instruments are haraam. It was reported in Saheeh al-Bukhaari and elsewhere that the Prophet (peace and blessings of Allaah be upon him) said that there would be among his ummah those who would allow zinaa, silk, alcohol and musical instruments, and he said that they would be transformed into monkeys and pigs… None of the followers of the imaams mentioned any dispute concerning the matter of music. (al-Majmoo’, 11/576). Al-Albaani (may Allaah have mercy on him) said: The four madhhabs are agreed that all musical instruments are haraam. (al-Saheehah, 1/145). Ibn al-Qayyim (may Allaah have mercy on him) said: The madhhab of Abu Haneefah is the strictest in this regard, and his comments are among the harshest. His companions clearly stated that it is haraam to listen to all musical instruments such as the flute and the drum, even tapping a stick. They stated that it is a sin which implies that a person is a faasiq (rebellious evil doer) whose testimony should be rejected. They went further than that and said that listening to music is fisq (rebellion, evildoing) and enjoying it is kufr (disbelief). This is their words. They narrated in support of that a hadeeth which could not be attributed to the Prophet (peace and blessings of Allaah be upon him). They said: he should try not to hear it if he passes by it or it is in his vicinity. Abu Yoosuf said, concerning a house from which could be heard the sound of musical instruments: Go in without their permission, because forbidding evil actions is obligatory, and if it were not allowed to enter without permission, people could not have fulfilled the obligatory duty (of enjoining what is good and forbidding what is evil). (Ighaathat al-Lahfaan, 1/425). Imaam Maalik (may Allaah have mercy on him) was asked about playing the drum or flute, if a person happens to hear the sound and enjoy it whilst he is walking or sitting. He said: He should get up if he finds that he enjoys it, unless he is sitting down for a need or is unable to get up. If he is on the road, he should either go back or move on. (al-Jaami’ by al-Qayrawaani, 262). He (may Allaah have mercy on him) said: “The only people who do things like that, in our view, are faasiqs.” (Tafseer al-Qurtubi, 14/55). Ibn ‘Abd al-Barr (may Allaah have mercy on him) said: Among the types of earnings which are haraam by scholarly consensus are ribaa, the fee of a prostitute, anything forbidden, bribes, payment for wailing over the dead and singing, payments to fortune-tellers and those who claim to know the unseen and astrologers, payments for playing flutes, and all kinds of gambling. (al-Kaafi). Ibn al-Qayyim (may Allaah have mercy on him) said, explaining the view of Imaam al-Shaafa'i: His companions who know his madhhab (point of view) stated that it is haraam and denounced those who said that he permitted it. (Ighaathat al-Lahfaan, 1/425). The author of Kifaayat al-Akhbaar, who was one of the Shaafa’is, counted musical instruments such as flutes and others, as being munkar (evil), and the one who is present (where they are being played) should denounce them. (He cannot be excused by the fact that there are bad scholars, because they are corrupting the sharee’ah, or evil faqeers – meaning the Sufis, because they call themselves fuqaraa’ or faqeers – because they are ignorant and follow anyone who makes noise; they are not guided by the light of knowledge; rather they are blown about by every wind. (Kifaayat al-Akhbaar, 2/128). Ibn al-Qayyim (may Allaah have mercy on him) said: With regard to the view of Imaam Ahmad, his son ‘Abd-Allaah said: I asked my father about singing. He said: Singing makes hypocrisy grow in the heart; I do not like it. Then he mentioned the words of Maalik: the evildoers (faasiqs) among us do that. (Ighaathat al-Lahfaan). Ibn Qudaamah, the researcher of the Hanbali madhhab – (may Allaah have mercy on him) said: Musical instruments are of three types which are haraam. These are the strings and all kinds of flute, and the lute, drum and rabaab (stringed instrument) and so on. Whoever persists in listening to them, his testimony should be rejected. (al-Mughni, 10/173). And he said (may Allaah have mercy on him); If a person is invited to a gathering in which there is something objectionable, such as wine and musical instruments, and he is able to denounce it, then he should attend and speak out against it, because then he will be combining two obligatory duties. If he is not able to do that, then he should not attend. (al-Kaafi, 3/118) Al-Tabari (may Allaah have mercy on him) said: The scholars of all regions are agreed that singing is makrooh and should be prevented. Although Ibraaheem ibn Sa’d and ‘Ubayd-Allaah al-‘Anbari differed from the majority, (it should be noted that) the Messenger of Allaah (peace and blessings of Allaah be upon him) said: “Adhere to the majority.” And whoever dies differing from the majority, dies as a jaahili. (Tafseer al-Qurtubi, 14/56). In earlier generations, the word “makrooh” was used to mean haraam, then it took on the meaning of “disliked”. But this is to be understood as meaning that it is forbidden, because he [al-Tabari] said “it should be prevented”, and nothing is to be prevented except that which is haraam; and because in the two hadeeths quoted, music is denounced in the strongest terms. Al-Qurtubi (may Allaah have mercy on him) is the one who narrated this report, then he said: Abu’l-Faraj and al-Qaffaal among our companions said: the testimony of the singer and the dancer is not to be accepted. I say: if it is proven that this matter is not permissible, then accepting payment for it is not permissible either. Shaykh al-Fawzaan (may Allaah preserve him) said: What Ibraaheem ibn Sa’d and ‘Ubayd-Allaah al-‘Anbari said about singing is not like the kind of singing that is known nowadays, for they would never have allowed this kind of singing which is the utmost in immorality and obscenity. (al-I’laam) Ibn Taymiyah (may Allaah have mercy on him) said: It is not permissible to make musical instruments. (al-Majmoo’, 22/140). And he said: According to the majority of fuqahaa’, it is permissible to destroy musical instruments, such as the tanboor [a stringed instrument similar to a mandolin]. This is the view of Maalik and is the more famous of the two views narrated from Ahmad. (al-Majmoo’, 28/113). And he said: …Ibn al-Mundhir mentioned that the scholars were agreed that it is not permissible to pay people to sing and wail… the consensus of all the scholars whose views we have learned about is that wailing and singing are not allowed. Al-Shu’bi, al-Nakha’i and Maalik regarded that as makrooh [i.e., haraam]. Abu Thawr, al-Nu’maan – Abu Haneefah (may Allaah have mercy on him) – and Ya’qoob and Muhammad, two of the students of Abu Haneefah said: it is not permissible to pay anything for singing and wailing. This is our view. And he said: musical instruments are the wine of the soul, and what it does to the soul is worse than what intoxicating drinks do. (Majmoo’ al-Fataawa, 10/417). Ibn Abi Shaybah (may Allaah have mercy on him) reported that a man broke a mandolin belonging to another man, and the latter took his case to Shurayh. But Shurayh did not award him any compensation – i.e., he did not make the first man pay the cost of the mandolin, because it was haraam and had no value. (al-Musannaf, 5/395). Al-Baghawi (may Allaah have mercy on him) stated in a fatwa that it is haraam to sell all kinds of musical instruments such as mandolins, flutes, etc. Then he said: If the images are erased and the musical instruments are altered, then it is permissible to sell their parts, whether they are silver, iron, wood or whatever. (Sharh al-Sunnah, 8/28) An appropriate exception The exception to the above is the daff – without any rings (i.e., a hand-drum which looks like a tambourine, but without any rattles) – when used by women on Eids and at weddings. This is indicated by saheeh reports. Shaykh al-Islam (may Allaah have mercy on him) said: But the Prophet (peace and blessings of Allaah be upon him) made allowances for certain types of musical instruments at weddings and the like, and he made allowances for women to play the daff at weddings and on other joyful occasions. But the men at his time did not play the daff or clap with their hands. It was narrated in al-Saheeh that he said: “Clapping is for women and tasbeeh (saying Subhaan Allaah) is for men.” And he cursed women who imitate men and men who imitate women. Because singing and playing the daff are things that women do, the Salaf used to call any man who did that a mukhannath (effeminate man), and they used to call male singers effeminate – and how many of them there are nowadays! It is well known that the Salaf said this. In a similar vein is the hadeeth of ‘Aa’ishah (may Allaah be pleased with her), when her father (may Allaah be pleased with him) entered upon her at the time of Eid, and there were two young girls with her who were singing the verses that the Ansaar had said on the day of Bu’aath – and any sensible person will know what people say about war. Abu Bakr (may Allaah be pleased with him) said: “Musical instruments of the Shaytaan in the house of the Messenger of Allaah (peace and blessings of Allaah be upon him)!” The Messenger of Allaah had turned away from them and was facing the wall – hence some scholars said that Abu Bakr (may Allaah be pleased with him) would not tell anybody off in front of the Messenger of Allaah (peace and blessings of Allaah be upon him), but he thought that the Messenger of Allaah (peace and blessings of Allaah be upon him) was not paying attention to what was happening. And Allaah knows best. He (the Prophet (peace and blessings of Allaah be upon him)) said: “Leave them alone, O Abu Bakr, for every nation has its Eid, and this is our Eid, the people of Islam.” This hadeeth shows that it was not the habit of the Prophet (peace and blessings of Allaah be upon him) and his companions to gather to listen to singing, hence Abu Bakr al-Siddeeq called it “the musical instruments of the Shaytaan”. And the Prophet (peace and blessings of Allaah be upon him) approved of this appellation and did not deny it when he said, “Leave them alone, for every nation has its Eid and this is our Eid.” This indicates that the reason why this was permitted was because it was the time of Eid, and the prohibition remained in effect at times other than Eid, apart from the exceptions made for weddings in other ahaadeeth. Shaykh al-Albaani explained this in his valuable book Tahreem Aalaat al-Tarab (the Prohibition of Musical Instruments). The Prophet (peace and blessings of Allaah be upon him) approved of young girls singing at Eid, as stated in the hadeeth: “So that the mushrikeen will know that in our religion there is room for relaxation.” There is no indication in the hadeeth about the two young girls that the Prophet (peace and blessings of Allaah be upon him) was listening to them. The commands and prohibitions have to do with listening, not merely hearing, just as in the case of seeing, the rules have to do with intentionally looking and not what happens by accident. So it is clear that this is for women only. Imaam Abu ‘Ubayd (may Allaah have mercy on him) defined the daff as “that which is played by women.” (Ghareeb al-Hadeeth, 3/64). An inappropriate exception Some of them make an exception for drums at times of war, and consequentially some modern scholars have said that military music is allowed. But there is no basis for this at all, for a number of reasons, the first of which is that this is making an exception with no clear evidence, apart from mere opinion and thinking that it is good, and this is wrong. The second reason is that what the Muslims should do at times of war is to turn their hearts towards their Lord. Allaah says (interpretation of the meaning): “They ask you (O Muhammad) about the spoils of war. Say: ‘The spoils are for Allaah and the Messenger.’ So fear Allaah and adjust all matters of difference among you…” [al-Anfaal 8:1]. But using music is the opposite of this idea of taqwa and it would distract them from remembering their Lord. Thirdly, using music is one of the customs of the kuffaar, and it is not permitted to imitate them, especially with regard to something that Allaah has forbidden to us in general, such as music. (al-Saheehah, 1/145) “No people go astray after having been guided except they developed arguments amongst themselves.” (Saheeh) Some of them used the hadeeth about the Abyssinians playing in the mosque of the Prophet (peace and blessings of Allaah be upon him) as evidence that singing is allowed! Al-Bukhaari included this hadeeth in his Saheeh under the heading Baab al-Hiraab wa’l-Daraq Yawm al-‘Eid (Chapter on Spears and Shields on the Day of Eid). Al-Nawawi (may Allaah have mercy on him) said: This indicates that it is permissible to play with weapons and the like in the mosque, and he applied that to other activities connected with jihaad. (Sharh Muslim). But as al-Haafiz ibn Hajar (may Allaah have mercy on him) said: whoever speaks about something which is not his profession will come up with weird ideas such as these. Some of them use as evidence the hadeeth about the singing of the two young girls, which we have discussed above, but we will quote what Ibn al-Qayyim (may Allaah have mercy on him) said, because it is valuable: I am amazed that you quote as evidence for allowing listening to sophisticated songs the report which we mentioned about how two young girls who were below the age of puberty sang to a young woman on the day of Eid some verses of Arab poetry about bravery in war and other noble characteristics. How can you compare this to that? What is strange is that this hadeeth is one of the strongest proofs against them. The greatest speaker of the truth [Abu Bakr al-Siddeeq] called them musical instruments of the Shaytaan, and the Messenger of Allaah (peace and blessings of Allaah be upon him) approved of that appellation, but he made an exception in the case of these two young girls who had not yet reached the age of responsibility and the words of whose songs could not corrupt anyone who listened to them. Can this be used as evidence to allow what you do and what you know of listening (to music) which includes (bad) things which are not hidden?! Subhaan Allaah! How people can be led astray! (Madaarij al-Saalikeen, 1/493). Ibn al-Jawzi (may Allaah have mercy on him) said: ‘Aa’ishah (may Allaah be pleased with her) was young at that time; nothing was transmitted from her after she reached the age of puberty except condemnation of singing. Her brother’s son, al-Qaasim ibn Muhammad, condemned singing and said that it was not allowed to listen to it, and he took his knowledge from her. (Talbees Iblees, 229). Al-Haafiz ibn Hajar (may Allaah have mercy on him) said: A group of the Sufis used this hadeeth – the hadeeth about the two young girls – as evidence that singing is allowed and it is allowed to listen to it, whether it is accompanied by instruments or not. This view is sufficiently refuted by the clear statement of ‘Aa’ishah in the following hadeeth, where she says, “They were not singers.” She made it clear that they were not singers as such, although this may be understood from the wording of the report. So we should limit it to what was narrated in the text as regards the occasion and the manner, so as to reduce the risk of going against the principle, i.e., the hadeeth. And Allaah knows best. (Fath al-Baari, 2/442-443). Some people even have the nerve to suggest that the Sahaabah and Taabi’een listened to singing, and that they saw nothing wrong with it! Al-Fawzaan (may Allaah preserve him) said: We demand them to show us saheeh isnaads going back to these Sahaabah and Taabi’een, proving what they attribute to them. Then he said: Imaam Muslim mentioned in his introduction to his Saheeh that ‘Abd-Allaah ibn al-Mubaarak said: The isnaad is part of religion. Were it not for the isnaad, whoever wanted to could say whatever he wanted to. Some of them said that the ahaadeeth which forbid music are full of faults. No hadeeth was free of being criticized by some of the scholars. Ibn Baaz (may Allaah have mercy on him) said: The ahaadeeth which were narrated concerning music being haraam are not full of faults as has been claimed. Some of them are in Saheeh al-Bukhaari which is the soundest of books after the Book of Allaah, and some of them are hasan and some are da’eef. But because they are so many, with different isnaads, they constitute definitive proof that singing and musical instruments are haraam. All the imaams agreed on the soundness of the ahaadeeth which forbid singing and musical instruments, apart from Abu Haamid al-Ghazzaali, but al-Ghazzaali did not have knowledge of hadeeth; and Ibn Hazam, but al-Albaani (may Allaah have mercy on him) explained where Ibn Hazam went wrong, and Ibn Hazam himself said that if any of (these ahaadeeth) were saheeh, he would follow that. But now they have proof that these reports are saheeh because there are so many books by the scholars which state that these ahaadeeth are saheeh, but they turn their backs on that. They are far more extreme than Ibn Hazam and they are nothing like him, for they are not qualified and cannot be referred to. Some of them said that the scholars forbade singing because it is mentioned alongside gatherings in which alcohol is drunk and where people stay up late at night for evil purposes. Al-Shawkaani (may Allaah have mercy on him) said: The response to this is that mentioning these things in conjunction does not only mean that what is haraam is what is joined together in this manner. Otherwise this would mean that zinaa, as mentioned in the ahaadeeth, is not haraam unless it is accompanied by alcohol and the use of musical instruments. By the same token, an aayah such as the following (interpretation of the meaning): “Verily, he used not to believe in Allaah, the Most Great, And urged not on the feeding of Al‑Miskeen (the poor).” [al-Haaqqah 69:33-34] would imply that it is not haraam to disbelieve in Allaah unless that is accompanied by not encouraging the feeding of the poor. If it is said that the prohibition of such things one at a time is proven from other reports, the response to that is that the prohibition of musical instruments is also known from other evidence, as mentioned above. (Nayl al-Awtaar, 8/107). Some of them said that “idle talk” does not refer to singing; the refutation of that has been mentioned above. Al-Qurtubi (may Allaah have mercy on him) said: This – the view that it means singing – is the best that has been said concerning this aayah, and Ibn Mas’ood swore three times by Allaah besides Whom there is no other god, that it does refer to singing. Then he mentioned other imaams who said the same thing. Then he mentioned other views concerning the matter. Then he said: The first view is the best of all that has been said on this matter, because of the marfoo’ hadeeth, and because of the view of the Sahaabah and the Taabi’een. (Tafseer al-Qurtubi). Ibn al-Qayyim (may Allaah have mercy on him), after quoting this Tafseer, said: Al-Haakim Abu ‘Abd-Allaah said in the Tafseer of Kitaab al-Mustadrak: Let the one who is seeking this knowledge know that the Tafseer of a Sahaabi who witnessed the revelation is a hadeeth with isnaad according to the two Shaykhs (al-Bukhaari and Muslim). Elsewhere in his book, he said: In our view this hadeeth has the same strength as a marfoo’ report. Although their tafseer is still subject to further examination, it is still more readily acceptable than the tafseer of those who came after them, because they are the most knowledgeable among this ummah of what Allaah meant in his Book. It was revealed among them and they were the first people to be addressed by it. They heard the tafseer from the Messenger (peace and blessings of Allaah be upon him) in word and in deed. And they were Arabs who understood the true meanings of (Arabic) words, so Muslims should avoid resorting to any other interpretation as much as possible. Some of them said that singing is a form of worship if the intention is for it to help one to obey Allaah! Ibn al-Qayyim (may Allaah have mercy on him) said: How strange! What type of faith, light, insight, guidance and knowledge can be gained from listening to tuneful verses and music in which most of what is said is haraam and deserves the wrath and punishment of Allaah and His Messenger? … How can anyone who has the least amount of insight and faith in his heart draw near to Allaah and increase his faith by enjoying something which is hated by Him, and He detests the one who says it and the one who accepts it? (Madaarij al-Saalikeen, 1/485) Shaykh al-Islam said, discussing the state of the person who has gotten used to listening to singing: Hence you find that those who have gotten used to it and for whom it is like food and drink will never have the desire to listen to the Qur’aan or feel joy when they hear it, and they never find in listening to its verses the same feeling that they find when listening to poetry. Indeed, if they hear the Qur’aan, they hear it with an inattentive heart and talk whilst it is being recited, but if they hear whistling and clapping of hands, they lower their voices and keep still, and pay attention. (Majmoo’ al-Fataawa, 11/557 ff) Some say that music and musical instruments have the effect of softening people’s hearts and creating gentle feelings. This is not true, because it provokes physical desires and whims. If it really did what they say, it would have softened the hearts of the musicians and made their attitude and behaviour better, but most of them, as we know, are astray and behave badly. Conclusion Perhaps – for fair-minded and objective readers – this summary will make it clear that the view that music is permissible has no firm basis. There are no two views on this matter. So we must advise in the best manner, and then take it step by step and denounce music, if we are able to do so. We should not be deceived by the fame of a man in our own times in which the people who are truly committed to Islam have become strangers. The one who says that singing and musical instruments are permitted is simply supporting the whims of people nowadays, as if the masses were issuing fatwas and he is simply signing them! If a matter arises, they will look at the views of fuqahaa’ on this matter, then they will take the easiest view, as they claim. Then they will look for evidence, or just specious arguments which are worth no more than a lump of dead meat. How often have these people approved things in the name of sharee’ah which in fact have nothing to do with Islam! Strive to learn your Islam from the Book of your Lord and the Sunnah of your Prophet. Do not say, So-and-so said, for you cannot learn the truth only from men. Learn the truth and then measure people against it. This should be enough for the one who controls his whims and submits himself to his Lord. May what we have written above heal the hearts of the believers and dispel the whispers in the hearts of those who are stricken with insinuating whispers. May it expose everyone who is deviating from the path of Revelation and taking the easiest options, thinking that he has come up with something which none of the earlier generations ever achieved, and speaking about Allaah without knowledge. They sought to avoid fisq (evildoing) and ended up committing bid’ah – may Allaah not bless them in it. It would have been better for them to follow the path of the believers. And Allaah knows best. May Allaah bless and grant peace to His Messenger who made clear the path of the believers, and to his companions and those who follow them in truth until the Day of Judgement. Summary of a paper entitled al-Darb bi’l-Nawa li man abaaha al-Ma’aazif li’l-Hawa by Shaykh Sa’d al-Deen ibn Muhammad al-Kibbi. For more information, please see: Al-I’laam bi Naqd Kitaab al-Halaal wa’l-Haraam, by Shaykh al-‘Allaamah Saalih ibn Fawzaan al-Fawzaan Al-Samaa’ by Shaykh al-Islam Ibn al-Qayyim Tahreem Aalaat al-Tarab, by Shaykh Muhammad Naasir al-Deen al-Albaani (may Allaah have mercy on him) Islam Q&A Sheikh Muhammed Salih Al-Munajjid[1]  Footnotes[1] Muhammad Abd-Allah's answer to Is music prohibited in Islam? Why?",
            "date": "Answered May 17, 2017",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdus Sabur",
                    "user_href": "/profile/Abdus-Sabur-14"
                },
                {
                    "user_id": "Aulia Sheila Diba",
                    "user_href": "/profile/Aulia-Sheila-Diba"
                },
                {
                    "user_id": "Suhayel Issa",
                    "user_href": "/profile/Suhayel-Issa-1"
                },
                {
                    "user_id": "Brook Tekle",
                    "user_href": "/profile/Brook-Tekle-6"
                },
                {
                    "user_id": "Bim Bimaldo",
                    "user_href": "/profile/Bim-Bimaldo"
                },
                {
                    "user_id": "Ali Yalım",
                    "user_href": "/profile/Ali-Yalım-1"
                },
                {
                    "user_id": "Taza Gul Kamran Khattak",
                    "user_href": "/profile/Taza-Gul-Kamran-Khattak"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Ali",
                "href": "/profile/James-Ali-5"
            },
            "answer_text": "Is listening to music haram in Islam or a sin? I think in islam it was exactly meant to be in the middle of a pedestal exactly because it neither is Haram or Halal I mean if you realize almost 95% of all music we listen today espically (VeVo) have subliminal and satanic masseges when played backwards or with videos I personally love listening to Bob Marley Because he sings about good beautiful things for example in his song “Three little birds” And i have tried and there are a couple youtube videos where they show that even in backwards bob marley’s songs doesn’t have satanic masseges and are plain Zxcsgareihv when backwards no hidden meanings like other songs etc… And then you have the pure best classical music Like Jazz and etc… which don’t have lyrics and won’t mean anything backwards still some argue about the frequency of music having a role in changing mood of a person so i don’t know Atleast when you listen to music pick the songs that your sure are clean you see it might apper that islam saying that music is Haram is illogical and unfair and you see it might also appear that islam saying songs are halal Hope it helps ",
            "date": "Answered May 17, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajisafe Abdulbasit",
                    "user_href": "/profile/Ajisafe-Abdulbasit"
                },
                {
                    "user_id": "Shah Wasim",
                    "user_href": "/profile/Shah-Wasim-9"
                },
                {
                    "user_id": "Aulia Sheila Diba",
                    "user_href": "/profile/Aulia-Sheila-Diba"
                }
            ]
        }
    ]
}