{
    "title": "Is Logic Pro X workable on a MacBook (not Air or Pro)? - Quora",
    "tags": [
        "Logic Pro (OS X app)",
        "MacBook"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Thompson",
                "href": "/profile/Tony-Thompson-44"
            },
            "answer_text": "That depends on which generation you are talking about, how much RAM and which processor. You will also find an SSD helps. The newer the better, obviously. I have a 2012 MacBook Pro with an i5 processor and 8gb RAM. Logic works fine on this. I have a limited Logic install on this second system, but mostly because it has a 256gb SSD and I don’t have masses of room for plugins and sample library. 8gb or more will be very helpful, along with a decent audio interface, as others have said. Keeping the track count low and using freeze tracks where necessary will free up your processor cycles, especially with more complex synths and effects. It might be worth seeing how well GarageBand functions on the MacBook before paying for Logic Pro X. ",
            "date": "Answered December 14, 2017",
            "views": "2",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Coy",
                    "user_href": "/profile/Ron-Coy-2"
                },
                {
                    "user_id": "Peter Harris",
                    "user_href": "/profile/Peter-Harris-226"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Rogers",
                "href": "/profile/Chuck-Rogers-1"
            },
            "answer_text": "Thanks for the A2A. I’d say Logic Pro X is workable on a MacBook depending on how much heavy lifting you want it to do with equipment. So if you are collecting a lot of MIDI and audio information, it is going to be very taxing on it. But if you are just working with files, I think you’ll be fine. Again, not knowing the size of your projects is a factor here. There is a big difference between mixing and editing music for a quartet and a 10 piece band. In terms of storage and processing power. So carefully consider how you intend to use it. ",
            "date": "Answered January 30, 2018",
            "views": "956",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Andrea Rush",
                    "user_href": "/profile/Andrea-Rush"
                }
            ]
        }
    ]
}