{
    "title": "Is Logic Pro X good for making rap beats? - Quora",
    "tags": [
        "Beat Making",
        "Logic Studio",
        "Logic Pro (OS X app)",
        "Music Composition",
        "Music Production",
        "Rap Music",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Montgomery Moore",
                "href": "/profile/Montgomery-Moore-1"
            },
            "answer_text": "Short answer YES. Using the piano roll for kick and high hats, snare can take a little getting use to.. but you can do triplet (really fast high hats) and rolling your 808s with a little practice and a few YouTube lessons. But Logic Pro X is awesome for editing and also building great quality sounds with tons of built in sounds and a massive sound library. Here is a great tip: Get a subscription to splice. $9 per month and well worth it.. tons of sounds and getting better by the day. Use their beatmaker tool. It has a great template to create the “beat” part of your song and easy way to get a loop started. Then you can export that midi file to a logic project (you will need to edit the key trigger on your piano roll or you can drag the notes where you want). But that has been my go to now to get a loop started and use an FL studio like beat grid (which is more hip hop friendly) and move it to a powerhouse DAW like Logic Pro X that is a great “song production” software. Then you can build from there. ",
            "date": "Answered April 17, 2018",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aidan Hynes",
                    "user_href": "/profile/Aidan-Hynes"
                },
                {
                    "user_id": "Russell Jalal",
                    "user_href": "/profile/Russell-Jalal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clormo",
                "href": "/profile/Clormo"
            },
            "answer_text": "I think Logic Pro X is great for making rap beats. There are a few features that are “tailor made” to help in making rap/hip-hop music. I don’t know what type of rap beats you’re looking to make (old school, sampled, trap), but trust me, you can do them all. If you want to see some examples of good tools that Logic Pro X has for making rap beats, check out this tutorial (just for example):  Nowadays there’s also a lot of good, stock EQ plugins that give your music an “old school” feel. You should check it out if you have a chance! ",
            "date": "Answered April 7, 2018",
            "views": "16",
            "upvotes": "0"
        }
    ]
}