{
    "title": "Is my singing any good? - Quora",
    "tags": [
        "Voice",
        "Singing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Plante",
                "href": "/profile/Daniel-Plante-2"
            },
            "answer_text": "Not bad! You have pitch matching, which is by far the hardest thing for someone to overcome. the rest is physical habits that most of us (including myself) do through the course of regular speech, but aren’t the most efficient way to sing. Most laypeople think that singing is merely making your voice match pitch and rhythm. Not So! while you can technically get by at karaoke night with that or avoid weird looks from your friends, singing at it’s best is a full body, engaged and deliberate choice. after listening to your recordings, i would say your best one is the Fullmetal Alchemist clip (i know my anime!). the other two, while in tune and in rhythm, sound like you are straining to get the lower notes. while you might be physically able to sound the notes, if you have to strain and tense your throat to get them, it’s both unhealthy and unpleasant-sounding. that’s why i like the FMA recording: it has higher notes that allow you to sing with less tension (there is still some there, but not quite as obvious). you need three things to start singing like a pro: efficient breathing. most of us breathe pretty inefficiently when we speak, because regular speech does not require us to move vast amounts of air in a short amount of time. in fact, take a deep breath right now. do your shoulders and chest rise? that’s inefficient. the lungs work because of a muscle called the diaphragm. it pulls down on the underside of your lungs and elongates them, essentially creating a vacuum that air then fills . if you breathe by raising your chest and shoulders, the same effect is achieved, but with much poorer results. to give an example of what it should feel like, lie on your back and breathe normally. notice how your stomach expands? notice how you can breathe much deeper than normal? that is how you should breathe all the time, because in order to create a strong, supported sound that doesn’t waver in and out of tune, you need a constant, robust stream of air moving very fast, which brings me to my next point:relaxed, but purposeful singing. singing is a balancing act: be focused and intentional when singing (stand straight, no slouching, etc.) but there should be no tension in the chest and throat itself. remember, the goal is to use as much air as possible in a way that doesn’t hurt or fatigue your voice unnecessarily. while this is best addressed in personalized voice lessons, some things to watch out for are necking (straining your neck and head up on higher notes, and compressing them on lower notes.) and general tension in the throat.Voice lessons. training a voice is not a one-size-fits all process, it requires a personalized touch, much like a car cannot be fixed by email corresponence.you have the makings of a great instrument, and with regular practice and training, could sound incredible! keep up the good work! ",
            "date": "Answered March 14, 2017",
            "views": "460",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian Heckman",
                    "user_href": "/profile/Ian-Heckman"
                },
                {
                    "user_id": "Elizabeth O'Connor",
                    "user_href": "/profile/Elizabeth-OConnor-1"
                },
                {
                    "user_id": "Shradhanjali Sahu B.Tech., ECE, IT-BHU, Varanasi (INDIA)",
                    "user_href": "/profile/Shradhanjali-Sahu-B-Tech-ECE-IT-BHU-Varanasi-INDIA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaitsiri Mongkolsmai Lin",
                "href": "/profile/Gaitsiri-Mongkolsmai-Lin"
            },
            "answer_text": "There is nothing specific to critique, it is clear that you are untrained. Just as everyone has potential with training, you do also. If you want specific things to work on, you should find a teacher who can give you good direction about what to work on first. You sound breathy, you’re sometimes off rhythm, notes are shaky and there are pitch mistakes. You need a solid foundation in breath support first, and then you can work on tuning your diction for singing. Right now it sounds like you are talking on pitch, which is a good starting point, but you need training to move beyond this. Don’t worry about harsh comments, just brush it off and go for singing lessons if you can. Most people sound untrained because they’ve never learned how to sing, that’s why it sounds like speaking on pitch. This is more natural than trying to sing sounding like someone else, so it’s good that you are doing what comes natural to your voice. There’s lots to learn about singing, even learning a little bit will get you started in improving your singing ability. Don’t give up, that happiness you have with singing is apparent to me in your attempts and your guts to post it up for others to listen to. That’s the main reason I sing, and whether I please others doesn’t matter to me. I sing for myself, and my improvement means more to me than it will to anyone else. Keep that joy, keep singing, and keep learning. Thanks for sharing. ",
            "date": "Answered March 13, 2017",
            "views": "187",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Ryoush",
                    "user_href": "/profile/Maria-Ryoush"
                },
                {
                    "user_id": "Shradhanjali Sahu B.Tech., ECE, IT-BHU, Varanasi (INDIA)",
                    "user_href": "/profile/Shradhanjali-Sahu-B-Tech-ECE-IT-BHU-Varanasi-INDIA"
                },
                {
                    "user_id": "Jonathan Beck",
                    "user_href": "/profile/Jonathan-Beck-11"
                },
                {
                    "user_id": "Alex Weaver",
                    "user_href": "/profile/Alex-Weaver-29"
                }
            ]
        }
    ]
}