{
    "title": "Is music as popular in Africa as it is in the United States? - Quora",
    "tags": [
        "Africa",
        "Fame and Mass Popularity",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Love Bonez",
                "href": "/profile/Love-Bonez"
            },
            "answer_text": "Of course it is. That’s like asking do people need to sleep in Africa as they do in the United States! Music is a universal, cultural activity and since we all know that modern humans came from Africa, it’s also safe to say that music originated from Africa. As with most ancient civilizations, the role of music was much larger in African culture than it is today in Western culture. Music was used as an oratory tool, an oral scrapbook/history lesson, and more familiarly to signify celebrations. Before the written word, Africans were using music to record incidences in their history, tell stories to their children, and ring in a new harvest. Furthermore, most music that is popular today in the United States can find its origins in African music. Thanks to the forced displacement, kidnapping and slavery of millions, the US is home to many people of African descent who brought their traditions, music and dances with them many years ago. Hip hop, Jazz, and even Blues music are just a few genres that borrow heavily from traditionally African music. ",
            "date": "Answered June 27, 2017",
            "views": "85",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bheki Mate",
                    "user_href": "/profile/Bheki-Mate"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Alyssa Satara",
                    "user_href": "/profile/Alyssa-Satara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annette Blankenship",
                "href": "/profile/Annette-Blankenship"
            },
            "answer_text": "I think music is probably more popular in Africa than the United States--and it is more a part of people's everyday life. Some of the most incredibly beautiful, moving and unique sounds come from this continent. ",
            "date": "Answered June 27, 2017",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Fitzjohn",
                    "user_href": "/profile/Michael-Fitzjohn-1"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                }
            ]
        }
    ]
}