{
    "title": "Is Mick Jagger a good singer? - Quora",
    "tags": [
        "Mick Jagger",
        "Singers",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mallory McClanahan",
                "href": "/profile/Mallory-McClanahan"
            },
            "answer_text": "He won the pop music lottery. I’m not saying he’s not talented. He is. I’m also sure that he worked hard to be successful. So he’s both talented and industrious. But in the pop music world (and to some extent in all fields) just being talented and industrious is not enough for incredible success. In order to be at the top of the pack a performer has to be in the right place at the right time and be in touch with the zeitgeist of his or her generation. Which means there is a large element of luck involved in becoming a fabulously successful entertainer. It has been said that success occurs when preparation meets opportunity. For a lot of very talented people the opportunity never quite materializes. It’s unfair but that’s the way it is. You didn’t mention if you have any ambitions in music, but if you want to be a singer then by all means go for it. Dream big and work hard. Just keep your eyes open and keep things in perspective. Edit on 12–2–19: This answer originally answered a different question: how Jagger became a star or something to that effect. Since then it has been moved to “Is Mick Jagger a Good Singer?” and the answer doesn’t really make sense because it doesn’t address that question. My answer to the current question is that Mick Jagger does what he does very well. Frank Sinatra, Mick Jagger, Ray Charles, and Luciano Pavarotti have all been considered great singers, but their styles are so different that asking which one is best is like asking which is better: Europe, the color purple, aardvarks, or the planet Neptune? Trying to make comparisons among those entities just doesn’t make any sense. When it comes to singers, I tend to concentrate on recordings I like. I’m not a big Jagger fan, but I do like songs such as Miss You and Beast of Burden. Jagger is great at what he does. ",
            "date": "Updated December 2, 2019",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angie Flournoy",
                    "user_href": "/profile/Angie-Flournoy-1"
                },
                {
                    "user_id": "Alyce Minsky",
                    "user_href": "/profile/Alyce-Minsky"
                },
                {
                    "user_id": "Scott Marino",
                    "user_href": "/profile/Scott-Marino-8"
                },
                {
                    "user_id": "Randy Stanley",
                    "user_href": "/profile/Randy-Stanley-4"
                },
                {
                    "user_id": "Paul Murray",
                    "user_href": "/profile/Paul-Murray-37"
                },
                {
                    "user_id": "Jessica Bell",
                    "user_href": "/profile/Jessica-Bell-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joanne Boor",
                "href": "/profile/Joanne-Boor"
            },
            "answer_text": "If we compare Mick Jagger to Andrea Bocelli, I would have to say no. He is not a good singer. If I am comparing him to Ozzie Osborn, I'm going to tell you he's a fabulous singer. I will say he is the perfect front man for The Rolling Stones. Each member of that band fits with the style of music of The Stones. Most people don't know Mick Jagger has a nutritionist and a trainer. The group is notorious for having a wild lifestyle. But since the mid 1990s, Mick Jagger has lead a very healthy and quiet life. The other band members have adopted a healthier lifestyle as well. When the band tours, they employ approximately 200 people to keep them healthy and fit. Ever notice how straight he stands? His stamina on stage is remarkable. He is 75 and you would never know that if you saw him run around the stage the way he has forever. He is disciplined about what he eats. He keeps to a rigid exercise program. He swims, kick boxes, runs and runs. His trainers help with stamina and balance. Mick Jagger is an adequate singer. What he lacks is technical terms, he makes up for it with his incredible stage presence. He keeps the whole show very lively. He engages the audience. They have legions of fans devoted to them. That says a lot about Mick Jagger. ",
            "date": "Answered November 25, 2018",
            "views": "6",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angie Flournoy",
                    "user_href": "/profile/Angie-Flournoy-1"
                },
                {
                    "user_id": "Alyce Minsky",
                    "user_href": "/profile/Alyce-Minsky"
                },
                {
                    "user_id": "Cyrus Applesauce",
                    "user_href": "/profile/Cyrus-Applesauce"
                },
                {
                    "user_id": "Randy Stanley",
                    "user_href": "/profile/Randy-Stanley-4"
                },
                {
                    "user_id": "Scott Marino",
                    "user_href": "/profile/Scott-Marino-8"
                },
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Ryan Neo",
                    "user_href": "/profile/Ryan-Neo-7"
                },
                {
                    "user_id": "Victoria Nicholson",
                    "user_href": "/profile/Victoria-Nicholson-29"
                },
                {
                    "user_id": "Conrad Jamneck",
                    "user_href": "/profile/Conrad-Jamneck"
                },
                {
                    "user_id": "Robert Savage",
                    "user_href": "/profile/Robert-Savage-15"
                }
            ]
        }
    ]
}