{
    "title": "Is Marshmellow Shawn Mendes? - Quora",
    "tags": [
        "Marshmello"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Hancock",
                "href": "/profile/Rebecca-Hancock-13"
            },
            "answer_text": "No, it is not true. Marshmello likes to trick people and having Shawn collect that award for him was just one of his tricks. Also, later on, Shawn (wearing his Marshmello mask) and the actual Marshmello took a photo together, and that wasn’t even the first time they have both been in a photo together. Another piece of proof as to why Shawn is not the actual Marshmello is that Shawn has a very obvious tattoo on his hand, as you can see in the picture below, which Marshmello does not have on his hand.  All in all, Shawn going up to get Marshmello’s award was just a big joke and he is not the real Marshmello, and, although I can not confirm if this is true, there is a lot of evidence pointing to Chris Comstock being the real Marshmello. I’m not going to get into that here, but a simple YouTube search will come up with many videos of proof if you are interested. Hopefully this helps, sorry for having such a long answer. ",
            "date": "Answered August 31, 2018",
            "views": "291",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Divyansh Gautam",
                    "user_href": "/profile/Divyansh-Gautam-63"
                },
                {
                    "user_id": "Pratishtha Jajoria",
                    "user_href": "/profile/Pratishtha-Jajoria"
                },
                {
                    "user_id": "Ben Bodid",
                    "user_href": "/profile/Ben-Bodid-1"
                },
                {
                    "user_id": "Jesse Rivas",
                    "user_href": "/profile/Jesse-Rivas-16"
                },
                {
                    "user_id": "Parul Makkar",
                    "user_href": "/profile/Parul-Makkar-1"
                },
                {
                    "user_id": "Khali Hendry",
                    "user_href": "/profile/Khali-Hendry"
                },
                {
                    "user_id": "Dhanyata Byresh",
                    "user_href": "/profile/Dhanyata-Byresh"
                },
                {
                    "user_id": "Mom's Princess",
                    "user_href": "/profile/Moms-Princess-2"
                },
                {
                    "user_id": "Prem Gk",
                    "user_href": "/profile/Prem-Gk"
                },
                {
                    "user_id": "Shriya Verma",
                    "user_href": "/profile/Shriya-Verma-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karan Ahuja",
                "href": "/profile/Karan-Ahuja-186"
            },
            "answer_text": "I believe that as a audience it is either depend that is it true or not because I am not familiar with his tricks or his type of work which made him famous and it is the audience or some fans they believe that he is not. It is because whatever award he has taken has become jock for every fans. They are not satisfied that he has won the joke award and also some fans believe that it was misunderstanding. Also how they were shocked to see him wining the joke award. He might have a tattoo but that tattoo dose not match the marshmellow and also some youtubers believe that it was misunderstanding. I don't want to disrespect his all hard work which made him today where he always wanted to e there joining all the star who has won awards more and more ",
            "date": "Answered March 19, 2019",
            "views": "55",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jhoana Lala",
                    "user_href": "/profile/Jhoana-Lala-1"
                },
                {
                    "user_id": "Innfinity",
                    "user_href": "/profile/Innfinity"
                }
            ]
        }
    ]
}