{
    "title": "Is NCT's music weird? - Quora",
    "tags": [
        "NCT (KPop)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tae Yim",
                "href": "/profile/Tae-Yim-3"
            },
            "answer_text": "Someone who actually studied music should answer this, which I am not, but I will try to answer as a fan of various groups that just really likes music. I find NCT’s music the most unique, they use really interesting sounds, many of the songs were composed/produced by LDN Noise - which is a group of people, that made a lot of Shinee’s, Shinhwa’s, EXO’s, TVXQ’s and Red Velvet’s songs.They work under SM entertainment and are experimenting a lot with different sounds.You can hear some really interesting instrumental in some of Red Velvet’s songs too, for example Red flavor. Every one of these groups is known to come up with hits, but the most critised seems to be NCT, in regards to everything not just music. Most of these groups have sci-fi concept (I call it like that idk), when you look at EXO’s debut MAMA and Shinee’s older songs (Shinees were always known for being experimental group) now NCT with their Dream in a dream concept and milion members, you can see there is a certain way SM likes.Songs like Firetruck, Chain and Regular are on the first listen not liked by many people, newest Regular is not liked even by many NCT fans. When I heard Firetruck for the first time, I was amazed, surprised and felt like I won’t be able to listen to such a strong song regularly. Before being a k-pop fan, I used to listen to rock, j-rock, visual kei, metal, metalcore, a bit of pop and as a gamer dubstep. But there was just something that seemed to be too heavy in this song. As they released Limitless, I liked it and got another listen to Firetruck, surprisingly, I loved it. I have seen many fans to write that NCT’s songs somehow grow to them, that when they were starting with NCT, they didn’t like their music and as time went on, after few more listens, they couldn’t get enough of it. Empathy album is favorite album to the most fans, Boss and Baby don’t stop have similar if not the same beat, Boss is probably the first song that got such a positive response, it’s easier to listen to (?) I don’t even know how to put it into words, but now, there is new song called Simon says - which I believe is really unique song. I tend to watch reactions of people who studied music, to see their perspective and this song surprised them too. It’s weird since the beginning to the very end, but still somehow addictive and liked. Out of the k-pop fans that aren’t fans of NCT, I’ve seen the most of them to hate on NCT’s music, it is a known fact that their songs aren’t even that liked in Korea, people even call them a flop. Despite hate on their music, NCT’ Empathy sold 320 000+ copies, Regular-irregular 433 000+, while repackage Regulate with just 2 new songs, sold 140 000+ and to everynes surprise, NCT Dream We go up - 200 000+.  Despite not having a lot of youtube views, they keep selling more than some senior groups. They are now selling more than Monsta X, Nu’est, SF9, Up10tion, VIXX, Astro, Straykids and are as for 2018 one of the top 10 selling k-pop groups. I find weird a lot of their side tracks too. They made this song long time ago, but released it in Regular-irregular album 2–3 months ago,  NCT Dream side track Drippin from newest album We go up.  NCT japanese debut album Chain side track Dreaming.  There will be new NCT unit/group called WayV debuting soon, already expecting a lot.  Conclusion - their music is weird and experimental, but not in a bad way. Because of it, they have it harder to gain popularity/fans, but their fandom is constatnly growing, despite a lot of people hating on their music, there are even more people addicted to their songs. I always look forward to what will they come up with next. WayV’s debut will be amazing. This is just my opinion with limited knowledge. Also sorry for any mistakes, feel free to correct me if I am wrong, english is my second language. ",
            "date": "Updated January 9, 2019",
            "views": "79",
            "upvotes": " View 96 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniella Pérez Mofré",
                    "user_href": "/profile/Daniella-Pérez-Mofré"
                },
                {
                    "user_id": "Immortal Boy",
                    "user_href": "/profile/Immortal-Boy-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Han-601"
                },
                {
                    "user_id": "Uraiwan Buttaku",
                    "user_href": "/profile/Uraiwan-Buttaku"
                },
                {
                    "user_id": "Ayusha Shrestha",
                    "user_href": "/profile/Ayusha-Shrestha-24"
                },
                {
                    "user_id": "Stephanie Chan Chong",
                    "user_href": "/profile/Stephanie-Chan-Chong"
                },
                {
                    "user_id": "Utpala Shrestha",
                    "user_href": "/profile/Utpala-Shrestha-1"
                },
                {
                    "user_id": "Amea Zhao",
                    "user_href": "/profile/Amea-Zhao"
                },
                {
                    "user_id": "Lois Kirk",
                    "user_href": "/profile/Lois-Kirk-7"
                },
                {
                    "user_id": "Abigail Anderson",
                    "user_href": "/profile/Abigail-Anderson-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Phan",
                "href": "/profile/Linda-Phan-38"
            },
            "answer_text": "Yes. But that’s what makes it good. Anyone who is a fan of any SM group knows that the agency hires producers who create fresh and new to the ear music, with NCT it’s no exception. They are known for their strong, experimental and catchy bass notes. If you listen to the group’s first ever debut song called “The 7th sense” by unit NCT U, you would not think that it was a debut track since it was so modern and eerie (aka it’s a fucking good song go stream). It’s primarily NCT 127 who have the “weirder” songs, and they definitely sound strange coming from a non-kpop fan perspective. From what I’ve heard/read the main points of disliking NCT’s music are because: It sounds weirdIt sounds like shitIt sounds like they recorded a bunch of electric tool sounds and made a song out of it (yes I’ve actually seen a comment like this)Why don’t we just call it unique instead? 127’s recent comeback “Simon Says” got a lot of backlash from people calling it awful and shit, and of course people are objected to their own opinion but I found it strange since I liked it so much. And do you know why I liked it? Cause it was messy, unexpecting and nothing like you’ve ever heard before. Everyone obviously has their own tastes, but who wants to listen to the same type of music all the time? Eventually you’d crave for something different. In conclusion, those who find NCT’s music weird ain’t wrong and I’m in no way forcing anyone to like it. But I do feel like they do cater to a demographic who is open to listen to stuff that wouldn’t usually play on your local radio station, no wonder why I questioned why I was oddly intrigued by “Fire Truck” when I first listened to it. I guarrantee you’ll eventually start tapping your foot along with the strange rhythm. And on that note ladies and gentlemen, SIMON SAYS GO STREAM THEIR SONG  ",
            "date": "Updated January 6, 2019",
            "views": "25",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayman",
                    "user_href": "/profile/Ayman-103"
                },
                {
                    "user_id": "Utpala Shrestha",
                    "user_href": "/profile/Utpala-Shrestha-1"
                },
                {
                    "user_id": "Amea Zhao",
                    "user_href": "/profile/Amea-Zhao"
                },
                {
                    "user_id": "JuicyCzennie",
                    "user_href": "/profile/JuicyCzennie"
                },
                {
                    "user_id": "Emma Touthang",
                    "user_href": "/profile/Emma-Touthang"
                },
                {
                    "user_id": "Ava Peaches",
                    "user_href": "/profile/Ava-Peaches"
                },
                {
                    "user_id": "Anne Zen",
                    "user_href": "/profile/Anne-Zen"
                },
                {
                    "user_id": "Thiên Nhật",
                    "user_href": "/profile/Thiên-Nhật-5"
                },
                {
                    "user_id": "Jay M. Short",
                    "user_href": "/profile/Jay-M-Short"
                },
                {
                    "user_id": "Erina Han",
                    "user_href": "/profile/Erina-Han-1"
                }
            ]
        }
    ]
}