{
    "title": "Is Pete Townshend bisexual? - Quora",
    "tags": [
        "Pete Townshend (musician)",
        "Bisexuality",
        "Sexual Orientation",
        "LGBTQ",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kathryn Sanderson",
                "href": "/profile/Kathryn-Sanderson"
            },
            "answer_text": "It depends on your definition of “bisexual.” Is someone bisexual if they’ve had sex with both men and women? If they’ve wanted to have sex with both men and women? If they’ve had long-term romantic relationships with both men and women? If they identify themselves as bisexual? With this in mind… In his memoir, “Who I Am,” Towshend writes about having had sexual encounters with both men and women, but I don’t recall him actually describing himself as bisexual. His long-term relationships have been with women. I don’t have the book handy, so I can’t give page references, but I believe he names a few names. This is the book where he famously wrote, “Mick [Jagger] is the only man I have ever really wanted to f***,” and goes on to describe how good Mick’s equipment looked in pajama pants. As for the encounters with men, I believe he names one or two them (they’re not Jagger!), and says that he let one of them do “everything but f***” him. (I assumed that by “f***” he meant anal penetration.) So, he doesn’t hide the fact that he’s had sex with men as well as women, but doesn’t seem to identify as bisexual, either. ",
            "date": "Answered October 8, 2017",
            "views": "27",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gerardolopoly",
                    "user_href": "/profile/Gerardolopoly"
                },
                {
                    "user_id": "Ayesha K",
                    "user_href": "/profile/Ayesha-K-31"
                },
                {
                    "user_id": "Lucy Rey",
                    "user_href": "/profile/Lucy-Rey-3"
                },
                {
                    "user_id": "Helen Bryant",
                    "user_href": "/profile/Helen-Bryant"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                }
            ]
        }
    ]
}