{
    "title": "Is progressive rock 'dead'? What's your opinion? - Quora",
    "tags": [
        "Progressive Rock (music genre)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Hardy",
                "href": "/profile/Jennifer-Hardy-18"
            },
            "answer_text": "These days, good musical genres are immortal. We no longer have to limit ourselves to a handful of the most broadly popular genres. Musicians don't need to maintain a critical mass of millions of fans in order to avoid getting dropped by record labels. New bands don't need to fit neatly into trendy genres in hopes of getting airtime. I first started seeking out progressive rock in the eighties, and it was hard to find. I didn't even know the name “progressive,” and it wouldn't have helped if I had. There was no progressive radio station, no progressive section of Tower Records, and no clique of music nerds in my high school swapping progressive tapes. There was certainly no internet telling me if I liked Yes I should try Emerson, Lake, and Palmer. These days, if a band's music appeals to only one percent of the population, they can find each other with little trouble. So as long as there are musicians with the talent and desire to make progressive music, the genre need never die. I do find that the bulk of progressive musicians these days tend to lean towards metal, and if that's not your thing, it could be frustrating when your Spotify Radio mix keeps trying to veer in that direction. But if you can't find any progressive music from the last few years that appeals to you, either you're far pickier than I am or you're not trying very hard. It could be that progressive rock will never again grace the airwaves in any quantity, but that's no longer the measure of a thriving genre. ",
            "date": "Answered July 13, 2020",
            "views": "215",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maggie Theodore",
                    "user_href": "/profile/Maggie-Theodore"
                },
                {
                    "user_id": "Matt Maz",
                    "user_href": "/profile/Matt-Maz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Carss",
                "href": "/profile/Ian-Carss"
            },
            "answer_text": "Progressive Rock is certainly still a niche market compared to the big music genres but it’s certainly not dead, arguably its in better health now than over the last two decades. Whilst most of the original bands are dying out due to the age of their members there is a vibrant scene of good young bands in Europe and America. There are well over a dozen annual progressive rock festivals taking place globally. I personally attend ProgDay (North Carolina) and Rock In Opposition (Carmaux France) every year & have friends who attend Rites Of Spring, Eppyfest, Freakshow, Summers End, Night Of Prog, & Progtoberfest. Since the advent of the internet and sites like bandcamp its been very easy for bands to get their music out there. It’s true that very few of these artists are living the rock star lifestyle, Spotify and the other streaming sites has essentially dried up the income for everyone. But as long as there are artists out there putting out this type of music there’ll be a small but avid audience for it. Check out modern bands such as Knifeworld, North Sea Radio Orchestra, PoiL, Free Salamander Exhibit, Big Big Train, IQ. ",
            "date": "Answered August 6, 2018",
            "views": "398",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maggie Theodore",
                    "user_href": "/profile/Maggie-Theodore"
                }
            ]
        }
    ]
}