{
    "title": "Is playing bass the same as playing guitar? Do bass players play chords? - Quora",
    "tags": [
        "Most Popular Epic Ever Written",
        "Bass Guitar",
        "Playing Guitar",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Stone",
                "href": "/profile/Dan-Stone-13"
            },
            "answer_text": "I need to break this question into two parts in order to answer it correctly. For the sake of this being simpler, I’m going to assume that you’re referring to a bass guitar and not a double bass. Is playing bass the same as playing guitar?No, it is not the same; however, the two instruments have a substantial amount of overlap so when you’re practicing one you’re pretty much getting better at both. This pattern usually carries over heavily with instruments in the same family. At their core, all string instruments function on the same basic principles: move the string to play a noteadjust the length of the string to adjust the pitchGuitar and bass share a lot of similarities like they’re both fretted, use similar tuning (which can be adjusted), can be played with a pick, tapped, etc. They’re very similar instruments and what you learn on one almost always carries over to the other. However, each instrument has its own unique playing techniques that make them different. Guitar playing is heavily dependent on strumming and playing chords whereas bassists are usually playing only one note at any given time. Guitar arpeggio often runs alongside a chord, whereas bass playing is more about moving the fingering position around the neck. Bassists tend to be more focused on fast shifting and being able to “walk” several notes over a larger physical distance, which can make the same note sequence harder to play on a bass than a guitar. Bass strings are also much thicker and require a more firm grip to play than guitar strings. Guitarists tend to have an easier time learning bass compared to bassists learning guitar. I would attribute this difference to the chord “learning curve” that’s necessary to play guitar but isn’t for the bass. You can play bass well without understanding or knowing chords, but if you’re composing music instead of just performing music it can really hold you back. The two instruments are in the same family. I’d go as far as to say they’re like brothers or sisters very close in age with similar interests, but each have their own unique elements. When they work together, they work extremely well. Do bass players play chords?A chord is defined as playing three or more notes in harmony. It is very uncommon for bassists to play three notes at once (doubles are far more useful on the instrument) they can and do. What’s more important is not playing the chords, but understanding the chord forms to make your playing more interesting. For example, if the guitarist is playing a G-Major chord for four beats, the bassist can follow the notes the guitarist is playing and play quarter notes on G, G, C, D to add a little spice to their part. Because of this, it’s incredibly helpful for a bassist to understand how to play guitar. They don’t have to be great at it, but simply understanding how common chords are structured makes it easier to write bass lines that sound good alongside the guitar. My Experience: I played violin for five years before switching to the bass guitar. A year after I picked up the bass guitar I decided to learn guitar as well. I was primarily a bassist for about five years before changing my focus to guitar. I’ve been playing bass and guitar for 16 and 15 years respectively. I took lessons on violin, but am mostly self-taught for the other instruments. I took a few guitar ensemble and music theory classes to burn credit hours in college as well. Overall, I’ve been practicing, writing, and performing music for nearly 22 years. ",
            "date": "Updated October 23, 2019",
            "views": "101",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phil Tomasone",
                    "user_href": "/profile/Phil-Tomasone"
                },
                {
                    "user_id": "Alan Wake",
                    "user_href": "/profile/Alan-Wake-64"
                },
                {
                    "user_id": "Anti Matter",
                    "user_href": "/profile/Anti-Matter-23"
                },
                {
                    "user_id": "Mario Lapointe",
                    "user_href": "/profile/Mario-Lapointe-4"
                },
                {
                    "user_id": "Sushovan Shakya",
                    "user_href": "/profile/सुशोभन-शाक्य-Sushovan-Shakya"
                },
                {
                    "user_id": "Reyaan Hasaan",
                    "user_href": "/profile/Reyaan-Hasaan-1"
                },
                {
                    "user_id": "Fernan Mady",
                    "user_href": "/profile/Fernan-Mady"
                },
                {
                    "user_id": "Juan Kerr",
                    "user_href": "/profile/Juan-Kerr-3"
                },
                {
                    "user_id": "Freedom Solossa",
                    "user_href": "/profile/Freedom-Solossa"
                },
                {
                    "user_id": "Zulfiqar Firdaus",
                    "user_href": "/profile/Zulfiqar-Firdaus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Steinberg",
                "href": "/profile/Eric-Steinberg-5"
            },
            "answer_text": "I’ve been playing bass for 50 years so let me see if I can shed some light on this. First, I think bass players fall into two broad groups: 1) guys who are session players or play bass in a band say, like Benny Rietveld (Santana) or Pino Palladino, and 2) virtuosi like Victor Wooten, Steve Bailey or Michael Manring who pursue bass as a creative solo instrument. Assuming you want to be in the former group I would say: Bass is primarily a rhythm instrument and drives the band perhaps more than any other player. If the drummer stops, the bass player can hold it together; when the bass stops things tend to fall apart (unless it’s planned, of course).The bass is also a melodic instrument and serves to cement rhythm and melody together into a cohesive sound. To this end you need to have a really good sense of both rhythm and the harmonic structure of the song. You should have a solid understanding of basic music theory as well - it will inform you as to what works and doesn’t and help you to always know where you are and where you are going in a song - critical bass skills.Bass also rounds out the mix providing a solid sonic foundation/anchor. Not too much call for double-stops (chords) in band settings.While the mechanics are similar to the guitar, the skill set is different as are the plucking techniques and fingerings. If you want to make the change, I’d definitely suggest getting some lessons from a pro. Not sure if I’m allowed to suggest names here….Be prepared to never be noticed (unless like in #1 you stop playing). That said, there are usually a couple of bass aficionados in the audience - I always appreciate hearing from them.I fell in love with this instrument at the age of 14 and if anything, like it even more these days. Good luck if you decide to go ahead.",
            "date": "Answered January 5, 2017",
            "views": "45",
            "upvotes": " View 246 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Bennett",
                    "user_href": "/profile/Paul-Bennett-162"
                },
                {
                    "user_id": "Paul Ricketts",
                    "user_href": "/profile/Paul-Ricketts-37"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Reine",
                    "user_href": "/profile/Reine-7"
                },
                {
                    "user_id": "Nathan Maharaj",
                    "user_href": "/profile/Nathan-Maharaj"
                },
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-11"
                },
                {
                    "user_id": "Tommy Blunt",
                    "user_href": "/profile/Tommy-Blunt-2"
                },
                {
                    "user_id": "Dave Allsopp",
                    "user_href": "/profile/Dave-Allsopp-3"
                },
                {
                    "user_id": "Dave Haitch",
                    "user_href": "/profile/Dave-Haitch"
                },
                {
                    "user_id": "Joe Kennedy",
                    "user_href": "/profile/Joe-Kennedy-133"
                }
            ]
        }
    ]
}