{
    "title": "Is red velvet problematic? - Quora",
    "tags": [
        "Red Velvet (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lendl Alfred",
                "href": "/profile/Lendl-Alfred"
            },
            "answer_text": "Good question. No group is immune to controversy. It can be due to members wrong doings, situations which were blown out of proportion or circumstances beyond the group's control. For these reasons, people will find a group problematic. In my opinion, a group would be problematic on numerous wrong doings. Let's examine some of the scandals surrounding red velvet and see if they are indeed problematic in terms of wrong doings. Red Velvet’s comment about Kim Jong Un After the performance in Pyongyang, Yeri said that it was nice to meet Kim Jong Un. In another occasion, the girls describe the North Korean leader as warm. This off course, angered many South Koreans. In the eyes of Koreans, the girls were describing a brutal dictator who enslaved and murders his people for trivial crimes as warm. Yes , Kim Jong un polices goes against Human Rights, but the girls wasn't in North Korea for political reasons, but to deliver a performance. They were in the man's country and therefore was just being respectful. I don't see any wrong doings here. For me, this falls in to the category of situations which were blown out of proportion.Music video debut controversy. Red velvet’s debut song was happiness. The music video contains articles of the September 11 attacks and the Hiroshima atomic bombings. Some people who viewed this video was outraged, because these past events were very painful, especially for those who experienced them. Red velvet got some serious back lash for their debut music video. However, I must say that red velvet are not directing or producing their music videos. It's misguided anger. If is anything, SM entertainment are the ones to blamed and not the girls. Again, no wrong doings by the girls, I will put this in the category of circumstances beyond their control.Irene being a potential feminist. In a interview, Irene had revealed that she has been reading a book entitled Kim Ji Young, Born 1982. This is considered a feminist book and many male fans were dissatisfied with Irene for reading this book. Furthermore, they are many videos on YouTube which edits the encounters between Irene and men. It appears that Irene is uncomfortable among men. I can tell you, this is not the case, I don't believe Irene hates men. She is naturally a shy person, therefore among members of the opposite sex, she will come across awkward. Now when it comes to feminism, I have no problem, after all, it was a woman who gave birth to me and if I have a daughter, I will want her to have access to opportunities without discrimination. However, the extreme form of feminism where feminist hates all men, I have a problem with. They are good men out there and to labelled all men as oppressive and violent towards women is unfair. In this case, I don't see red velvet being problematic. Nothing wrong with Irene reading a novel about a woman’s life in Korean society. This was a situation which were blown out of proportion.Wendy's ignorant comments. On one of the episodes of TALKMON, Wendy was asked about different North American dialects. She did impressions of white and black women. The impression of a black woman generated the most outrage. Wendy gave a stereotypical impression with a black woman with attitude. This didn't sit well with a lot of people. Many people called her racist and ignorant. Unfortunately, this wasn't the first time Wendy made stereotypical remarks. In 2014, during a radio interview, Wendy did an impression of what you you called a black man being a thug. She said “What up? You wanna go, man? You wanna go?!” I will have to put this in the of category wrong doings. It was wrong. She has no excuse. Wendy grew up in Canada. She was exposed to people with different racial backgrounds. In addition, Wendy is extremely intelligent, she definitely knows better. Furthermore , being from Canada, Wendy is fluent in English. Language is part of a culture. She must of known that these stereotypical remarks would of beeen hurtful to North American fans, especially black people. I don't think Wendy made an apology for these comments. This is rubbing more salt in the wounds, because her lack of apology, suggest that she doesn't care. Apart from this incident, I wouldn't say Red velvet on a whole is problematic. The girls are talented and exceptional vocalists. Thanks for the question and for reading this somewhat long response.",
            "date": "Answered November 28, 2019",
            "views": "19",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andi Ward",
                    "user_href": "/profile/Andi-Ward-9"
                },
                {
                    "user_id": "Nabilah Faza",
                    "user_href": "/profile/Nabilah-Faza"
                },
                {
                    "user_id": "XxArcticFoxChanxX",
                    "user_href": "/profile/XxArcticFoxChanxX"
                },
                {
                    "user_id": "Juliana Ha",
                    "user_href": "/profile/Juliana-Ha-1"
                },
                {
                    "user_id": "Hazel Bradbury",
                    "user_href": "/profile/Hazel-Bradbury-1"
                },
                {
                    "user_id": "Savannah Olivia",
                    "user_href": "/profile/Savannah-Olivia-3"
                },
                {
                    "user_id": "Kashvi Kudupudi",
                    "user_href": "/profile/Kashvi-Kudupudi"
                },
                {
                    "user_id": "Wang Tzuyu",
                    "user_href": "/profile/Wang-Tzuyu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mentally-Disturbed-5"
                },
                {
                    "user_id": "Anitta L. Cara",
                    "user_href": "/profile/Anitta-L-Cara-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Medrano (에벨 린 메드 라노)",
                "href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
            },
            "answer_text": "No. ",
            "date": "Answered November 26, 2019",
            "views": "747",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlene Wan",
                    "user_href": "/profile/Charlene-Wan-4"
                },
                {
                    "user_id": "Lisa Xi",
                    "user_href": "/profile/Lisa-Xi"
                },
                {
                    "user_id": "Raghavaramananathane",
                    "user_href": "/profile/Raghavaramananathane"
                },
                {
                    "user_id": "Virginia Lorenz",
                    "user_href": "/profile/Virginia-Lorenz"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-Min-Yoon-Gi"
                },
                {
                    "user_id": "Edwin Maver",
                    "user_href": "/profile/Edwin-Maver"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Saoirse-25"
                },
                {
                    "user_id": "Gordon Clason",
                    "user_href": "/profile/Gordon-Clason"
                }
            ]
        }
    ]
}