{
    "title": "Is Rock the widest genre of music? - Quora",
    "tags": [
        "Genres",
        "Music Genres",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phil Jones (He / Him)",
                "href": "/profile/Phil-Jones-He-Him"
            },
            "answer_text": "Rock has a reasonable variety of formats : short, long, quiet, loud, energetic, laidback etc. But it’s pretty narrow in terms of instrumentation. You can’t go far from the basic drum-kit, electric bass, guitar, singer combo before you really stop being “Rock” in any meaningful sense. You can certainly augment the rock combo with keyboards, organs and synths or other instruments. But if you start taking instruments away … for example, that folky singer-songwriter who makes albums with just his voice accompanied by an acoustic guitar, but no drums, bass or electric amplification? I’d say it’s borderline whether he’s really playing “rock” at all. That’s different from, say, Jazz. You can play jazz on a single piano.  Or on a single guitar.  Or have a fifty musician “big band”.  Or an intimate piano, saxophone, bass and drums.  Or bring in a trumpet.  Or just scat  Or go crazy with harps and organs.  Or electronics  Or pop with accordions  And don’t let it get too close to Brazilian folk music in the hands of a serious experimentalist :  These days, jazz has even gone “doom”, taking atmospheric tips from stoner / sludge rock and avant-metal.  I’d say jazz is far wider in terms of instrumentation and soundscape. And a more flexible format. All you really need for something to be jazz is some sense of a, pulse, and the idea of a bunch of individual soloists each taking a turn to improvise over the pulse. And usually a fairly sophisticated / wide-ranging understanding of harmony. That’s a huge space to explore. ",
            "date": "Answered January 18, 2018",
            "views": "293",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elio Pastore",
                    "user_href": "/profile/Elio-Pastore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andreas Kielland",
                "href": "/profile/Andreas-Kielland"
            },
            "answer_text": "While genres change over time, and there are no definite, exhaustive omni-definitions to go by, I’d say “rock” and “pop” are the widest-encompassing genre names. But the two largely overlap. And there are so many variables, differing degrees of deviations from certain standards, and examples of musically evolving artists and entire (sub-)genres that it pretty much makes the question meaningless. While certain artists are good, clean examples of definitely being representative of certain genres, others straddle several genres, naturally experimenting and seeking out new musical territories and approaches. (I.e., Bruce Springsteen is definitely a rock artist, but David Bowie was so much more than simply “rock”.) ",
            "date": "Answered June 7, 2016",
            "views": "323",
            "upvotes": " Answer requested by J.R. Mallard"
        }
    ]
}