{
    "title": "Is rap a type of music? - Quora",
    "tags": [
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zander Tsadwa",
                "href": "/profile/Zander-Tsadwa"
            },
            "answer_text": "Short answer: Yes. This is not up for debate. Longer answer: a lack of traditional instruments in one of the six categories (brass, woodwind, bowed string, keyboard, percussion, guitar) or a lack of semitonic vocal performances does not mean rap/hip-hop music lacks instrumentalists, melody, or harmony. As I’ve answered before on Quora, rapping—the rhythmic speech-based style of vocal performance—in and of itself is full of melody. Not only is the human speaking voice inherently melodic, but rappers hit very intentional and effective patterns of notes. Here is my expanded explanation of how richly melodic rapping itself is, incorporating Ethan Hein’s research of a capella vocal tracks from famous rappers[1]—never mind the instrumentation, sampling, and singing that is also found in hip-hop. This answer of mine also takes down the “Three Element” argument against hip-hop as a genre of music (SPOILER: a form of music doesn’t need all the magical elements of rhythm, melody, and harmony to be considered a genre). There is also plenty of harmony—pleasing combinations of notes and chords—in hip-hop. I truly don’t know where the notion that rap music has no harmony comes from. Listen to any Kid Cudi[2], Bone Thugs-n-Harmony (apt), or A Tribe Called Quest and see the mental gymnastics it takes to deny the presence of harmony. If you want to look at more traditional rap performances that don’t blur the line between rapping and singing, you still get a catalog full of intentional artists talented enough to make their flows percussive and melodic, often strategically delivering certain syllables to change the mood of a lyric or artistically transition into the next line. Andre 3000’s opening verse on “Int’l Players Anthem” with UGK leapt to the front of my mind as an example for you to observe how musical a rap performance can be. So, here’s a wonderful gift for making it to the end of this answer.  Note: Andre 3K is not either of the two gentlemen (Pimp C and Bun B) pictured above Footnotes[1] Zander Tsadwa's answer to Is Ben Shapiro right about hip-hop not being music?[2] Kid Cudi- Man On The Moon",
            "date": "Answered April 15, 2020",
            "views": "607",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy O Matthews",
                    "user_href": "/profile/Timothy-O-Matthews"
                },
                {
                    "user_id": "Chad Robertson",
                    "user_href": "/profile/Chad-Robertson-63"
                },
                {
                    "user_id": "Andrew Deveau",
                    "user_href": "/profile/Andrew-Deveau"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Moore",
                "href": "/profile/Greg-Moore-15"
            },
            "answer_text": "Our own upbringing and feelings have a lot to do with what is considered music. “If it ain’t country, it ain’t music”, goes the saying, along with its corollary: “If it ain’t Bach, it ain’t muzik.” The ancient Greeks considered music as encompassing drama, song and poetry. The Bible has 150 “Psalms” right in the middle pages, every one of them considered to be a song, but not a single note anywhere; and their rhythms are originally Hebrew and don’t translate into English rhythms that well - but we still consider them music. Rap features strong, dynamic rhythm, as does its cousin hip-hop (much of which is rap with a musical background). It also may feature rhyming poetry, highly inflected speech and other concepts we associate with music. However, it’s a lot easier to just say “rap”, and sidestep the strict definitions. ",
            "date": "Answered September 19, 2019",
            "views": "266",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zander Tsadwa",
                    "user_href": "/profile/Zander-Tsadwa"
                }
            ]
        }
    ]
}