{
    "title": "Is S. P. Balasubrahmanyam the greatest Indian playback singer of all time? Who else can he be compared with? - Quora",
    "tags": [
        "Musicians",
        "Indian Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Han",
                "href": "/profile/Dennis-Han-1"
            },
            "answer_text": "With all due respect, this question just begs a war of words between different factions. S.P. Balu is one of the most beloved and prolific singers gracing his audiences from 1966. He has the distinction of working across 16 languages and has recorded over 40K songs. Listing his awards at a state, regional, industry and national level are just too numerous to count! He has the added fame of being listed in the Guinness Book of Records for the most film scores. You do not achieve this level of success without an incredible level of commitment, passion, skills and LUCK! Let us be very clear; there was a LOT of being at the right place at the right time and having the right connections to propel him to stardom. Consider that: He intended to be an engineer but had a fall-out due to a bout of typhoid.He is not a classically trained singer but still was selected for rendering the songs for Sankarabharanam (he did an amazing job, no doubt)Laxmikant-Pyarelal didn’t want him to render the songs of Ek Duje Ke Liye, but he was brought in by K. Balachander (with a good argument - the lead actor portrayed a non-Hindi speaking Tamilian). This hit propelled him to super-stardomFinally, he became the voice of Salman Khan in multiple hits - yes, he did a great jobConsider for a moment though. Would you generally select a non-classical singer to render highly classical oriented songs for a huge production? Would you select a newbie from South India to render the music for a Bollywood production? Would you select a middle-aged South Indian to render the music of a young heart-throb? If you answered yes to any of these, I can commend you on being a bigger risk taker than I am. As to the ‘greatest’ playback singer, in terms of purely the number of songs - OF COURSE SPB is #1. It is a fact! Could he render Carnatic songs more accurately than say, Dr. Yesudas? Come on…do you really believe he could?Could he render Hindustani music more accurately than the honorable Mohd. Rafi? Come on…Did he have to subjectively struggle to reach the top as much as the honorable Lata Mangeshkar? Come on…With that said, I would gladly listen to any of SBPs songs (he IS my favorite singer by the way) because he is versatile and much, MUCH better a singer than I am. Plus I just like the way he sings! :) So instead of asking “Who is the Greatest”, can we not sit back and just be delighted that there are so many greats that we have the honor of listening to? ",
            "date": "Updated October 3, 2020",
            "views": "83",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Visweswararao Panasa",
                    "user_href": "/profile/Visweswararao-Panasa"
                },
                {
                    "user_id": "Anfaal Ali",
                    "user_href": "/profile/Anfaal-Ali"
                },
                {
                    "user_id": "Beulah Srinivasan Potti",
                    "user_href": "/profile/Beulah-Srinivasan-Potti"
                },
                {
                    "user_id": "Pavan Kumar",
                    "user_href": "/profile/Pavan-Kumar-1772"
                },
                {
                    "user_id": "Yogesh Kumar",
                    "user_href": "/profile/Yogesh-Kumar-2886"
                },
                {
                    "user_id": "Sudhir Bonthu",
                    "user_href": "/profile/Sudhir-Bonthu-1"
                },
                {
                    "user_id": "Mihir Ojha",
                    "user_href": "/profile/Mihir-Ojha-4"
                },
                {
                    "user_id": "Athira D",
                    "user_href": "/profile/Athira-D-2"
                },
                {
                    "user_id": "Siva Sai",
                    "user_href": "/profile/Siva-Sai-23"
                },
                {
                    "user_id": "Anand Babu",
                    "user_href": "/profile/Anand-Babu-67"
                }
            ]
        }
    ]
}