{
    "title": "Is there a really good way to strengthen the diaphragm for singing? - Quora",
    "tags": [
        "Singing Techniques",
        "Diaphragm (human body)",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katarina Hornakova",
                "href": "/profile/Katarina-Hornakova-1"
            },
            "answer_text": "There are certainly diaphragm strengthening exercises that a singer could do but the question is if strengthening the exercise will make you a better singer. First, I believe that confusion around this topic stems from misunderstanding of what a strengthening exercises really is. To strengthen a muscle means to work against resistance to build strength and muscle mass. Does a singer really need a stronger and more muscular diaphragm? Second, you cannot feel your diaphragm. You cannot touch it, you cannot feel the movement of the diaphragm because there are very few nerve endings that would make us feel the movements. Instead, you can feel and observe the results of the moving diaphragm. So, how do you strengthen a muscle that you cannot feel. Third, strengthening exercises work during contraction of the muscle. That means that you can strengthen the muscle during inhalation (that is when the diaphragm contracts). During exhalation, the diaphragm relaxes so you cannot strengthen it during this phase. In summary, your diaphragm is strong enough for speaking and singing, given that you are not suffering from a serious respiratory illness. The goal of a singer is not to strengthen the diaphragm but to coordinate it with the rest of the body. Many of the suggested exercises here are not diaphragm strengthening exercises. They are breathing exercises improving the coordination of many muscle groups while singing. I made a video on this topic, in which I also talk about good breathing exercises to make you a better singer. You can watch it if you want:  ",
            "date": "Answered December 7, 2018",
            "views": "858",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reg Boyle",
                "href": "/profile/Reg-Boyle"
            },
            "answer_text": "Considering that you've been exercising your diaphragm at least six times a minute since your first emergency intercostal breath, coordination would seem be the order of the day. This has a very simple solution as long as you don't mis-interpret the instructions. Here are the bare-bones instructions; Take a quick breath and hold it with your slightly distended epigastric muscles . Two seconds later, release and repeat multiple times. You will notice you have no sensation of throat or neck muscle disturbance. Nor do you have any sensation of pharyngeal discomfort. Nor is your tongue lashing about with a frantic need to escape. You have just become aware of the first step of using your diaphragm to inhale rapidly and hand the control over to your support and manage mechanism. Take note of that which you did NOT feel and use it not, every time you sing. EDIT, Hey I've been looking for you. If your rib cage is not raised sufficiently, there will be insufficient space to expand the lungs to their greater capacity. This may give the impression that the diaphragm is weak. ",
            "date": "Updated July 10, 2019",
            "views": "611",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lartedris Baker",
                    "user_href": "/profile/Lartedris-Baker"
                },
                {
                    "user_id": "Martel Horton",
                    "user_href": "/profile/Martel-Horton-1"
                },
                {
                    "user_id": "Sanjeev Singh",
                    "user_href": "/profile/Sanjeev-Singh-2556"
                }
            ]
        }
    ]
}