{
    "title": "Is there such a thing as perfect rhythm? - Quora",
    "tags": [
        "Rhythms (music)",
        "Pianists",
        "Classical Composers",
        "Pianos",
        "Existence Question",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Mengel",
                "href": "/profile/Dave-Mengel"
            },
            "answer_text": "I'm not sure your question and description are asking the same question. Perfect Pitch is being able to either sing a pitch and know the note you are singing and/or hear a pitch and instantly know the note without any use of interval ear training from a single known pitch (referred to as relative pitch).  Likewise, perfect rhythm, or probably more accurately called perfect tempo, would be the ability to either instantly tap any tempo at will with perfect precision, or hear a tempo and instantly know the specific beats per minute. I'm not sure if anyone is capable of differentiating 120 bpm and 121 bpm. Relative understanding of tempo is common amongst conductors and musicians, sometimes using known melodies as a reference point, but a person with true perfect tempo probably doesn't exist.  Now for a different take on perfect rhythm as being the ability to hear a rhythm pattern for the first time and always repeat it back flawlessly.. I would imagine there are percussionists who would be pretty darn good at it. Some people may be able to pick drumming up quicker than others.. However this 'perfect rhythm' seems to be from a lot of practice, rather than from the supposed natural ability of having perfect pitch. ",
            "date": "Answered November 27, 2015",
            "views": "19",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Louis Frayser",
                    "user_href": "/profile/Louis-Frayser"
                },
                {
                    "user_id": "Luis Daniel Mora Matus",
                    "user_href": "/profile/Luis-Daniel-Mora-Matus"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Jim Ty",
                    "user_href": "/profile/Jim-Ty-1"
                },
                {
                    "user_id": "Dan Abreu",
                    "user_href": "/profile/Dan-Abreu-2"
                },
                {
                    "user_id": "Victoria Bennett",
                    "user_href": "/profile/Victoria-Bennett-12"
                },
                {
                    "user_id": "Mary Jane Tait",
                    "user_href": "/profile/Mary-Jane-Tait"
                },
                {
                    "user_id": "Ryan Smith",
                    "user_href": "/profile/Ryan-Smith-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Ehle",
                "href": "/profile/Robert-Ehle"
            },
            "answer_text": "I seem to remember that the American conductor, Alfred Wallenstein, was said to have perfect tempo. He could hit the same tempo every time. It can be a great problem if a conductor takes one tempo in rehearsals and another faster or slower tempo under the pressure of public performance. A lot of things depend on proper tempo: breathing in the case of wind instruments and singers, dancers’ rhythms, soloist’s technique, etc. You can use marching band tempo as a reference. Street marching is 120 bpm. Football bands typically go up to 132 bpm. Historically, 60 bpm is called the Tactus or the heartbeat rate of a person at rest. It was used as the reference tempo in Medieval music. Tempos below the Tactus are meditative while those above it are exciting. In my composition “A Trek Through The Himalayas” I used sub Tactus tempos to create a meditative effect. You can hear it on Audiomack under the title ”Trekking Music”. All the pieces are scored for chamber orchestra. ",
            "date": "Answered August 10, 2019",
            "views": "387",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Louis Frayser",
                    "user_href": "/profile/Louis-Frayser"
                }
            ]
        }
    ]
}