{
    "title": "Is the major scale the same as the pentatonic scale? - Quora",
    "tags": [
        "Pentatonic Scale",
        "Musical Scales",
        "Music Theory",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dwayne Jenkins",
                "href": "/profile/Dwayne-Jenkins-4"
            },
            "answer_text": " No. The pentatonic scale is a different scale. Although, it is taken out of the major scale. Like for instance, the major scale has 8 notes and the pentatonic scale is created from 5 of these 8 notes. The major scale is the Do Ra Me that is so familiar, and then 5 notes are taken out of that to create the pentatonic scale. Why 5? Because Penta means 5, and tonic means notes. A 5 note scale. Just like a pentagon (5 sides) and a pentagram (5 points) Make sense? Now if we look at the A minor pentatonic scale, this scale is 5 notes taken out of the A major scale. These notes are A B C# D E F# G# A. The A minor pentatonic scale is comprised of the A C (flat third note) the D E & G (flat 7th note) and it is these specific notes of this scale (any scale really) that give the pentatonic scale its character. I suggest you learn more about scales to use them in your guitar playing. They can allow you to play solos, and come up with some really nice guitar riffs. And if you need help getting started on how to use them for playing guitar solos, I suggest you grab my FREE training-guide Guitar Solo Secrets and get headed in the right direction. You can also check out the lesson I did on the minor pentatonic scale here on my blog Rock Guitar 101 Intro To Playing Lead Guitar - Dwayne's Guitar Lessons I hope this gave you a better understanding of the difference between the two scales. Dwayne Jenkins ",
            "date": "Answered January 26, 2020",
            "views": "49",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "David Ezell",
                    "user_href": "/profile/David-Ezell-9"
                },
                {
                    "user_id": "Jacob Allen",
                    "user_href": "/profile/Jacob-Allen-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colgan Bryan",
                "href": "/profile/Colgan-Bryan-3"
            },
            "answer_text": "This is a very common source of confusion because the word “major” can either refer to a category of scales and modes which relate to a major chord or what is often referred to as “the” major scale (as if there are no others). The category of the major scale is any scale which contains the notes of a major chord along with passing tones. As a result, you can have diatonic (seven tone) and pentatonic (five tone) scales and modes. “The” major scale is “the” diatonic scale which is used as the standard reference to define theory with regard to intervals and their used in scales, chords, progressions etc. What adds to the confusion is that the category of major scales includes “the” major scale but usually described as the Ionian mode (not Ionian scale) so that can cause hesitation when discussing the subject. Eamples: “THE” C major scale: C D E F G A B C “A” C major scale will include the notes of the C (major) chord C E G with passing (non-chord) tones. Ionian mode: C D E F G A B C (aka “the” major scale) Lydian mode: C D E F# G A B C (Notice the passing tone F#) Mixolydian mode: C D E F G A Bb C (Notice the passing tone Bb. Careful with this one because can also be a “dominant” scale as well. Major pentatonic: C D E G A C (skipping the F and B of “the” major scale) A couple with multiple names: C D E F G Ab B C C D E F G Ab Bb C C Db E F G Ab B C C Db E F G Ab Bb C etc So the more confusing answer to your question is…maybe :D I hope this helps. Believe me, you are not the only one who gets thrown off by this. ",
            "date": "Answered May 15, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}