{
    "title": "Is the Squier Bullet HS Telecaster any good? Is it good for punk rock? - Quora",
    "tags": [
        "Punk Rock",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "No it’s a piece of junk. actually. Most Squires and Epiphones are over priced for what you are getting and you can buy a guitar that sounds and plays much better for $150. Watch the video review below for a SX Liquid guitar. Scott Grove does the review. I actually agree with everything he says about them. They are much better than any other guitars in the $150-$400 price range and sound better than some really expensive guitars as well. Scott grove SX Liquid Guitar After you watch Scott’s video I would encourage you to check out this website where they sell them. I have owned 4–5 SX guitars and everyone has been a great playing and sounding guitar. I am really partial to the models with P-90s but my SX Nashville Tele actually sounded really good as well. Rondo Music Electric Guitars FYI I have been buying and selling guitars for over 40 years and have owned hundreds and hundreds of guitars and have played thousands of guitars. I base my opinion on the fact that I have tried so many different guitars and have owned and collected so many. After all this time I have learned that while fenders and Gibsons are good guitars there are many out there that are much better and cost much less. If you’ve never had a guitar with P-90s then you’ll be surprised. The SX Liquid with 3 P-90’s would be great for Punk and is only $150 and will spank any Squire out there. ",
            "date": "Answered June 15, 2017",
            "views": "237",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miotal Éan",
                "href": "/profile/Miotal-Éan"
            },
            "answer_text": "It looks to be a great guitar, Squier guitars are good for everything. But I would recommend from personal experience I would recommend a Les Paul Junior Special for punk. Its got some nice dual humbuckers in it. However, if you are looking to stick to the feel of a Fender, I recomend something from the Offset series. Like a Jaguar or Mustang. Another great guitar would be an Ibanez strat type guitar. All of these are under 250. Epiphone Les Paul Special ii Limited Edition (one of my guitars)  Ibanez GRX Series  Squier Jazzmaster Affinity Jazzmaster  ",
            "date": "Answered June 15, 2017",
            "views": "202",
            "upvotes": "0"
        }
    ]
}