{
    "title": "Is there a way to remove or attenuate reverb from a vocal track in Pro Tools? - Quora",
    "tags": [
        "Pro Tools (audio software)",
        "Audio Mastering",
        "Audio mixing (recorded music)",
        "Music Production Software and Apps",
        "Audio and Acoustical Engineering",
        "Music Producers",
        "Digital Audio",
        "Music Recording",
        "Audio Recording",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Bowyer",
                "href": "/profile/Mark-Bowyer-2"
            },
            "answer_text": "There are a couple of ways that don’t rely on expensive plug-ins. If the source material is a solo vocal or any other mono source you can often completely eliminate the reverb (assuming the reverb is stereo). You simply have to feed your track through a Mid/Side matrix and remove the Side elements. Voila! No reverb. It really depends on the effects, if the differences between L&R are minimal then it will be difficult to completely remove the FX. But in several cases I’ve been able to completely lose all traces of the effect. If you don’t have access to any M/S processing you can try phase extraction, which is essentially the same thing, just a little more broken down. This entails splitting the source to mono L & R channels and reversing the polarity on one side. This will eliminate all mono content in the centre. Replaying this against a polarity reversed version of the track will result in just your dry vocal. ",
            "date": "Answered December 9, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Meghan Gohil",
                    "user_href": "/profile/Meghan-Gohil-1"
                },
                {
                    "user_id": "Kenneth McLaughlin",
                    "user_href": "/profile/Kenneth-McLaughlin-3"
                },
                {
                    "user_id": "Bart Reardon",
                    "user_href": "/profile/Bart-Reardon"
                },
                {
                    "user_id": "Dave Samwell",
                    "user_href": "/profile/Dave-Samwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Watson",
                "href": "/profile/Tom-Watson-80"
            },
            "answer_text": "If you recorded it like that, you’re stuck with it. The best you can do is put a transient designer plugin on it like SPL transient designer and it can reduce it slightly but not enough to probably warrant not re-recording it properly. Other people have talked about mid-side effects/separation but that only applies if you’re doing a remix of an A Cappella or something as vocals are usually mono tracks and mid-side processing only helps stereo tracks. ",
            "date": "Answered July 29, 2019",
            "views": "208",
            "upvotes": "0"
        }
    ]
}