{
    "title": "Is the M-Audio Keystation 61II a good MIDI keyboard to buy? - Quora",
    "tags": [
        "MIDI Controllers",
        "MIDI",
        "Audio and Acoustical Engineering",
        "Keyboards (instrument)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian C McCalla",
                "href": "/profile/Brian-C-McCalla"
            },
            "answer_text": "It really all depends on what you'll be using it for. I'm not a fan of that line if controllers only because I use mostly software and hardware synthesizers and there's decidedly an insufficient number of “non key\" controls onboard for all of the knob twisting and tweaking that I require. For me, then, it's the M-Audio Oxygen or Axiom Pro controllers that make more sense (in truth, I'm partial to the Novation controllers and use a controller / synth…the 66 key X-Station as my primary master controller and even then I also use an Arturia Beatstep knob and pad controller / sequencer to add to the number of parameters that I can edit without picking up a mouse). If memory serves, the Keystation line is a USB-only controller. That rules out (essentially) using it to control other hardware gear directly (like all of my hardware synths). If, on the other hand, you're using it to play only piano or organ sounds on your DAW or you don't mind clicking your mouse all of the time to adjust your synth parameters or if you're using it just to learn to play a keyboard, then it's a very nice choice. I'm also pretty sure they don't have weighted keys, so if you're looking for the feel of an acoustic piano (as opposed to an electric piano or organ), you'll likely be very disappointed with it as well. But for what it is, it's a well-designed, reasonably durable, very affordable 66 key controller. I hope that helps! Oh, one last thing. Try to buy one used. They depreciate quickly and you can likely get one in perfect condition for 25%–50% of the retail price. They're always on Craigslist in my city and certainly always on eBay. ",
            "date": "Answered January 22, 2017",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Couture",
                    "user_href": "/profile/Andrew-Couture"
                },
                {
                    "user_id": "Andrei Neagu",
                    "user_href": "/profile/Andrei-Neagu-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Pederson",
                "href": "/profile/Eric-Pederson-6"
            },
            "answer_text": "What are you using it for? If you just need a keyboard controller to trigger MIDI events or samples, yeah, it will work just fine. If you need a lot of control over different parameters (using your hands), well, you might want to invest the money in a better device…like a Kurzweil SP4–8, Native Instruments Komplete Kontrol 88, or something similar. Also, more expensive keyboards also have very respectable samples built into them and can also be used as sound generators triggered by an external MIDI command, so that’s something to consider also. So like everyone else has said…it depends. You definitely don’t need to go bankrupt to get a MIDI controller though. ",
            "date": "Answered January 22, 2017",
            "views": "659",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deluca Music Academy",
                    "user_href": "/profile/Deluca-Music-Academy"
                }
            ]
        }
    ]
}