{
    "title": "Is the world’s most historic and revered classical music that different from a modern-day film score? - Quora",
    "tags": [
        "Contemporary Classical Music",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Johnston",
                "href": "/profile/Alex-Johnston-39"
            },
            "answer_text": "Absolutely. However, most people can’t tell the difference, because most people don’t listen to classical music and when they do, they’re not really listening to it. They just have it playing in the same room that they’re in. On that confrontational note, in order to answer this question, I’m going to temporarily remove my usual friendly, musically ecumenical hey-it’s-all-good hat, and put on my Classical Music Lover hat. Which, no doubt, someone will want to accuse me of talking through. So I figured I’d get that in there first.  A lot of people don’t realise this, but listening to classical music, so that you can hear what is truly going on in it, is a skill. It takes practice. There are levels. People who think that film scores are not that different from classical music do not have this skill. People who do have this skill, would never, ever ask such a question. I like and appreciate good film scores. I fancy myself that I have a longer memory for them than many people who think they like film scores, but whose memories go back no earlier than the 80s. I yield to nobody in my admiration for Jerry Goldsmith, Elmer Bernstein, Bernard Herrmann, Erich Korngold, David Shire, Henry Mancini, Georges Delerue, Lalo Schifrin (seriously, I was listening to the main title theme for Bullitt the other morning and it’s completely brilliant), Howard Shore, especially in his Cronenberg years, etc. Film scores are doing something completely different from most classical music. They shouldn’t even be talked about as if they were doing the same thing. It’s like comparing making your own furniture to building a house. We don’t say Is this chair as good a place to live in as this house? Likewise, we shouldn’t compare film scores to symphonies. They’re not made the same way, and they aren’t supposed to be experienced the same way.  Film scores consist of a number of discrete musical cues designed specifically to enhance the effect of a film scene. This music is written for the film; it’s not designed to be appreciated in its own right. Quite often, the music doesn’t make a lot of sense outside the context of the film; a music cue that consists of a barely moving shimmering cloud of harmony might have a devastating effect within the film, but outside of the film, it might sound like nothing in particular. People who love scores of specific films sometimes listen to the score apart from the film and enjoy it in its own right, but I think that most of the time they’re remembering how the music worked in context. I liked Hans Zimmer’s score for Dunkirk, but had I listened to it in advance of watching the film, I doubt I would have liked it, because it’s so well-integrated into that movie. I didn’t like it so much that I want to own the soundtrack. I would have recognised the use of Elgar’s Enigma Variations in the penultimate cue ‘Variation 15 (Dunkirk)’, and would have probably been able to guess the context, but I wouldn’t have enjoyed the music in itself. Zimmer’s score for The Lion King sounds superficially like classical music, but on its own, it’s revealed to be a fairly banal pastiche of classical music. Still, within the movie it works. However. A symphony, to take the most standard form of classical music that film scores generally get compared to, is not written to serve as accompaniment designed to enhance some other experience. It is that experience. The symphony is the movie, not the soundtrack to the movie. It is not meant to be ‘illustrating’ or ‘supporting’ anything else. The movie provides the structural and dramatic framework within which the score makes sense. The symphony, on the other hand, itself contains the structural framework which makes the listening experience intelligible. It’s just that most people lack the skill to perceive the structure. Why? Because we don’t teach people how to hear it.  Most people who don’t have the skill of listening to classical music tend to perceive it as snatches of melody separated by periods of incomprehensible rhetoric. This is why the most popular works of classical music are works which consist mostly of melody: Tchaikovsky is a popular composer for that very reason, because as Leonard Bernstein pointed out, he was a gifted melodist. The most popular works of Bach aren’t the fugues or the variations, but things like the chorale melody from Cantata BWV 147 Herz und Mund und Tat und Leben, or as most people know it, in a completely different arrangement, this:  The most popular work by Beethoven isn’t the huge and intricate Symphony No. 3, but the melody from the final movement of Symphony No. 9, here removed from the context in which it originally appeared:  Now, I bet that, by 1:10, when the melody starts to repeat, and other music starts playing around it, a lot of people start to go Oh, well, it’s just playing again, okay, well, I don’t know why it’s doing that. And by 1:55, when it repeats for the second time, some people start to get bored and tune out. Only if you know how to listen to classical music do you understand why it does this. Just as, at 3:16, when it stops being the melody anymore and starts to become something else, only those who know how to listen can hear how this ‘something else’ is in fact connected to, and an exploration of, what we’ve just been listening to. Removing the music from its context also means that, at 3:56, when the music explodes into a discordant blare, it comes out of nowhere. In the context of the original symphony, it doesn’t come out of nowhere. This moment is in fact a repeat of the very beginning of this entire movement, and the repeat serves to tie the entire movement into a whole. It’s not the only structural feature of the movement, but it’s one of them. When we listen to an extended work of classical music, or even a five-minute movement of a string quartet, we are hearing not just pretty melodies, or menacing ones, but an extended work of musical thought, which has its own structure and its own sense of beginning, middle and end. It may also have a sense of drama, especially if it’s Beethoven, or post-Beethoven; it may include irony and humour (Mahler and Shostakovich); it will use self-reference to create a sense of structure and may also refer to and incorporate other music (Mahler again, but really, loads of people—Schnittke does this a lot too.) But, again, most people can’t hear these things in the music. They just hear the melodies, and they get bored by the rest of it. The ability to perceive in detail the structure of long-form music is not innate: you have to learn it. Many people can intuit its presence, which is how they can become lovers of the music without ever really understanding how it works. But film scores are not built like this. They are not supposed to have a life outside the film they accompany. The presence of an orchestra should not seduce us into thinking that film scores are like works of classical music. Some film scores superficially resemble the sound of classical music, and a composer such as Howard Shore may take his film music and work it up into a symphony, as Shore did with his Lord of the Rings score. A film score composer may also write concert music without any connection to their film work, as John Williams has done, and Shore too: I’ve just been listening to his piano concerto Ruin and Memory, a perfectly pleasant work, if not as brilliant or original as his scores for movies such as Naked Lunch and Crash (the Cronenberg one, not the Paul Haggis one). Film scores don’t have to do the work that classical music does. They do their own thing, and at their best they can take a fine moment of moviemaking and make it unforgettable. But they are only ever part of some other endeavour: the making of a movie. Film music is subordinate to the film. Classical music is where the music stands on its own. The intricacy and complex motion of a work of classical music is basically foreign to film music: there’s a reason why Beethoven’s Third is practically never used as incidental music. There’s too much going on in it at any given time. Film music can involve complex harmony and interesting melodies, but it only works if it signals the right emotional response in the viewer, in conjunction with the onscreen action. David Shire’s dissonant score for the 1974 heist movie The Taking of Pelham One Two Three is one of my favourite movie scores, but it works because the dissonance conveys the seedy, run-down quality of the film’s setting, early 70s New York City. The classical composer has no such crutch to lean upon. Yes: classical music is absolutely different from a modern day film score. ",
            "date": "Answered February 4, 2020",
            "views": "72",
            "upvotes": " View 364 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                },
                {
                    "user_id": "Chintan Amrit",
                    "user_href": "/profile/Chintan-Amrit"
                },
                {
                    "user_id": "Ronald J Brown",
                    "user_href": "/profile/Ronald-J-Brown-1"
                },
                {
                    "user_id": "Preman Tilson",
                    "user_href": "/profile/Preman-Tilson"
                },
                {
                    "user_id": "Chris Rhyne",
                    "user_href": "/profile/Chris-Rhyne-4"
                },
                {
                    "user_id": "Mercy Booth",
                    "user_href": "/profile/Mercy-Booth"
                },
                {
                    "user_id": "Xuye Luan (栾旭业)",
                    "user_href": "/profile/Xuye-Luan-栾旭业"
                },
                {
                    "user_id": "Camille Boudville",
                    "user_href": "/profile/Camille-Boudville"
                },
                {
                    "user_id": "Kim McGarghan",
                    "user_href": "/profile/Kim-McGarghan"
                },
                {
                    "user_id": "Giota Detsi",
                    "user_href": "/profile/Giota-Detsi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Clamage",
                "href": "/profile/Marc-Clamage-1"
            },
            "answer_text": "Is the world’s most historic and revered classical music that different from a modern-day film score? Consider Beethoven’s Fifth Symphony. The iconic opening goes like this:  After that it goes  Now, imagine if instead it went like this:         That’s what Beethoven’s Fifth would look like if it were a movie score. The movie composer comes up with a few bars of striking music and uses them over and over and over and over again. The primary purpose of movie music is to embellish the visual narrative. It doesn’t need to stand on its own, in fact, it would be distracting if the music could stand on its own—the director wouldn’t allow it. If you were to sit down and listen to just the score of any movie you would soon be bored out of your skull. That’s why there’s no “Jurassic Park Symphony,” no “Toy Story Cantata.” There simply isn’t enough meat to cover the bones of a classical structure. Actually, Beethoven wrote his fair share of movie music. He wrote incidental music for a number of stage plays, the nineteenth century equivalent of a movie soundtrack. . The plays are no longer performed, the incidental music, despite being in the public domain, almost never. All we listen to now are the overtures: Coriolanus, Egmont, King Stephen, The Consecration of the House. And even those are not his best work (although I admit to a passing fondness for King Stephen). Movie music is to classical music as Baby Shark is to the White Album. ",
            "date": "Answered January 29, 2020",
            "views": "820",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ernie Black",
                    "user_href": "/profile/Ernie-Black-3"
                },
                {
                    "user_id": "Chris Hayes",
                    "user_href": "/profile/Chris-Hayes-341"
                },
                {
                    "user_id": "Holger Müller",
                    "user_href": "/profile/Holger-Müller-3"
                },
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                },
                {
                    "user_id": "Karim Heredia",
                    "user_href": "/profile/Karim-Heredia"
                },
                {
                    "user_id": "Ludger Starke",
                    "user_href": "/profile/Ludger-Starke"
                },
                {
                    "user_id": "Eliza Chin",
                    "user_href": "/profile/Eliza-Chin-2"
                },
                {
                    "user_id": "Edward Baugh",
                    "user_href": "/profile/Edward-Baugh-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teun-Meekel"
                },
                {
                    "user_id": "Brandon Malone",
                    "user_href": "/profile/Brandon-Malone-1"
                }
            ]
        }
    ]
}