{
    "title": "Is there anywhere in England that I can buy K-Pop music from a physical store? - Quora",
    "tags": [
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deeksha",
                "href": "/profile/Deeksha-169"
            },
            "answer_text": "If you live the London area, HMART is the place to go. They have a large selection of albums, posters and what not but beware! Only in selected stores! The tiny ones don’t contain a lot but if you find a big one, rush to the album section and take them quickly! Also, the selection is limited to the preference of the store. They usually have EXO, BTS, SEVENTEEN, EXID, APINK and TWICE as a popular trend. I’ve also had friend see Hyuna ones often (cry) but I’ve never seen them. UNDERRATED GROUPS ARE RARE UNLESS HMART LIKES THEIR MUSIC. thanks!  ",
            "date": "Answered March 14, 2018",
            "views": "51",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shanjida Afshan",
                    "user_href": "/profile/Shanjida-Afshan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Favour-17"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catherine Spencer",
                "href": "/profile/Catherine-Spencer"
            },
            "answer_text": "I’m in the states, specifically NY, and even in NYC Koreatown there’s only one shop where I can buy kpop albums! It’s definitely hard to find them in stores in any country other than Korea, unfortunately. I totally get what you mean about browsing but it’s just not an option for us with kpop! The good news is there are 3 GREAT sites to buy albums from! They have p much every group, the album prices are never inflated, and even with shipping from Korea to NY I’ve gotten albums for under $20. Sometimes there are even free posters if you preorder, and if the album has a photocard or photobook it’s always included in the price. Kpop Town Kpop Mart YESASIA My personal favourite is kpopmart, because they have really polite customer service (I made a mistake on an order once and they fixed it asap) and they package their items really well, which is important for such a long distance. But as I’ve said, all three are great for us international kpop fans! Happy shopping~ ",
            "date": "Answered September 4, 2016",
            "views": "58",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lydia Townsend",
                    "user_href": "/profile/Lydia-Townsend"
                }
            ]
        }
    ]
}