{
    "title": "Is this electric guitar good: Ibanez RG350EX? - Quora",
    "tags": [
        "Ibanez Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Curci",
                "href": "/profile/Jeff-Curci"
            },
            "answer_text": "If I was to answer strictly on specs/price point and reputation, I would say it's definitely a good value. I have had a few Ibanez's over the years and still have an RG series albeit a low level RG170 series. Has 2 single coil and 1 humbucker and a non-locking tremelo which I have blocked out to make it a hardtail. The Ibanez you are asking about has a nice system on it. Locking nut and fine tuners and is the typical Ibanez 24 frets. As an entry level guitar I give it an A+. I am not a fan of strat style guitars in general. That is personal preference and not a knock on them in the least. My main guitar is a Gibson Les Paul, second is an Epiphone Les Paul which I HIGHLY RECOMEND as an entry level guitar. They are built extremely well, highly playable, sound great and are very afforfable. Most of the LP style guitars are the standard 22 fret variety, so if the extra two frets are a must have, pass on them. The Ibanez I have generally obly gets used when I need to record a solo that needs those extra high notes, and it fares quite well. All that said...I could never buy a guitar without playing one. Others might disagree, but it has got to feel \"right\" to me or I will never enjoy playing it and it will just collect dust. Great example and it includes an Ibanez. About 10-12 years ago I needed a second guitar for gigs..my old Kramer wasn't reliable and desperately needed a rebuild. I am a huge Joe Satriani fan and was intent on buying an Ibanez JS series for the job. Went to the music store and saw several different models, thought this was gonna be an easy in and out..play a couple, pick the one that felt good and a color I can live with and out the door. Well that didn't happen. Every one I picked up felt awkward, tough to play and stiff as a board in my hands. The neck profile was not to my liking no matter which model I tried...from the most expensive, to the cheapest. I couldn't buy it and wouldn't. Like I said, I would regret it in the end. Ended up trying several different brands..Ibanez, BC Rich, Jackson, PRS, Gibson and Epiphone. Long story short, the Epiphone just felt \"right\", like an extension of my hands and fingers. On top of that it was goreous. Flame maple top in heritage sunburst. Bought it on the spot and still have it to this day. So, in my opinion the guitar you are asking about looks great on paper, now go play one and see if it fits YOU. ",
            "date": "Answered December 31, 2017",
            "views": "741",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jan Winters",
                    "user_href": "/profile/Jan-Winters-1"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Samuel Tan",
                    "user_href": "/profile/Samuel-Tan-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justice Långvall",
                "href": "/profile/Justice-Långvall"
            },
            "answer_text": "Good value, but not a “good guitar”. To get a good guitar, you need to pay more.It’s fine, don’t get me wrong. You can get by with that, but you’re still getting this because of budget limitation, not because it’s actually a good guitar, right? But Ibanez makes extremely good guitars, they’re great at what they do, and their budget stuff is still great value, so it’s always good choice to get an Ibanez, if it fits your playstyle/genre. I’ve had an RG470, in the 90’s, and I currently have an RG2620QM, since 2003. The RG2620 is a “good” guitar, but it also cost at least twice as much as that RG350. The RG350EX has the “INF” Ibanez pickups, and they’re not very good at all, in my opinion. Ibanze make great guitars, but apparently not great pickups, though their collaboration with DiMarzio are much better. The “INF” are not, though.If you can afford it, it’d be much better if you get some other pickups, such as EMG ones. ",
            "date": "Answered February 24, 2018",
            "views": "287",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Katie Atlas",
                    "user_href": "/profile/Katie-Atlas-1"
                }
            ]
        }
    ]
}