{
    "title": "Is there any white people's country which is underdeveloped? - Quora",
    "tags": [
        "Under-Developed Countries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ygor Coelho",
                "href": "/profile/Ygor-Coelho"
            },
            "answer_text": "White people as in “European light-skinned people”, as in “people with Caucasoid features”, or as in “people with any kind of light skin”? In the first case, I can cite Moldova, Kosovo, Albania, Ukraine, Bosnia-Herzegovina, Macedonia, Armenia, Georgia and Azerbaijan. Under the second and third premises, then I can add most of Turkey, Lebanon, Syria, Turkmenistan, Iran, Tajikistan and Kazakhstan, among others. In Latin America, white-majority countries like Argentina and Uruguay aren’t still exactly worthy of developed status, despite their relatively high levels of development. Oh, by this moment you’ll possibly want me to use the strictest definition of “white people” that could be possible, so that in the end “white people” mean only “very light-skinned people of Western and Central European ancestry and with little admixture with other non-European peoples”. But, of course, that’d be disingenuous, so I stick with this answer: if “white people” has still anything to do with “light skin” in a worldwide basis, then there are loads of underdeveloped white-majority countries. ",
            "date": "Answered August 2, 2017",
            "views": "15",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "E Powell",
                    "user_href": "/profile/E-Powell-4"
                },
                {
                    "user_id": "Denis Clancy",
                    "user_href": "/profile/Denis-Clancy-2"
                },
                {
                    "user_id": "William Owen",
                    "user_href": "/profile/William-Owen-12"
                },
                {
                    "user_id": "Peri Collins",
                    "user_href": "/profile/Peri-Collins-1"
                },
                {
                    "user_id": "Milos Zorica",
                    "user_href": "/profile/Milos-Zorica"
                },
                {
                    "user_id": "Michael Jacobs",
                    "user_href": "/profile/Michael-Jacobs-74"
                },
                {
                    "user_id": "Vijay Badhe",
                    "user_href": "/profile/Vijay-Badhe"
                },
                {
                    "user_id": "Sankhadip Chakraborty",
                    "user_href": "/profile/শঙ্খদীপ-চক্রবর্তী-Sankhadip-Chakraborty"
                },
                {
                    "user_id": "Denis O'Sullivan",
                    "user_href": "/profile/Denis-OSullivan-3"
                },
                {
                    "user_id": "Emily Grace Frost",
                    "user_href": "/profile/Emily-Grace-Frost-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Vianna",
                "href": "/profile/Daniel-Vianna"
            },
            "answer_text": "You don't get whiter skin than Korean skin.  In North Korea, they just went through a famine where people simply died of hunger. That's underdeveloped in my books. Meanwhile, just below the 38th parallel North, in South Korea, the same people, with the same ethnic makeup were busy overtaking Japan as the most developed country in East Asia…  But you might counter that only Europeans are to be considered “white”. OK, let's then talk about Eastern and Western Germany.  New York Times, 23 December 1970 East Germany is facing a new year of persistent food shortages and price rises for basic consumer goods, according to knowledgeable sources in East Berlin. All the while, on the other side of the Iron Curtain…  I guess you get my point. Politics, not skin colour, determine development. ",
            "date": "Answered August 2, 2017",
            "views": "26",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "M Rizky",
                    "user_href": "/profile/M-Rizky-3"
                },
                {
                    "user_id": "Michał Gawlas",
                    "user_href": "/profile/Michał-Gawlas"
                },
                {
                    "user_id": "Ivan Popov",
                    "user_href": "/profile/Ivan-Popov-48"
                },
                {
                    "user_id": "Robin Daverman",
                    "user_href": "/profile/Robin-Daverman"
                },
                {
                    "user_id": "Lina Kim",
                    "user_href": "/profile/Lina-Kim-23"
                },
                {
                    "user_id": "Namratha Tarigopula",
                    "user_href": "/profile/Namratha-Tarigopula"
                },
                {
                    "user_id": "Denis Clancy",
                    "user_href": "/profile/Denis-Clancy-2"
                },
                {
                    "user_id": "Daniel Witgen",
                    "user_href": "/profile/Daniel-Witgen"
                },
                {
                    "user_id": "Ygor Coelho",
                    "user_href": "/profile/Ygor-Coelho"
                },
                {
                    "user_id": "Jason Rolon",
                    "user_href": "/profile/Jason-Rolon-2"
                }
            ]
        }
    ]
}