{
    "title": "Is Tupac a good lyrical rapper compared to rappers like Eminem or Nas? - Quora",
    "tags": [
        "Nas (Lyricist) ",
        "Tupac Shakur (musician)",
        "Eminem (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Murphy",
                "href": "/profile/Jason-Murphy-360"
            },
            "answer_text": "Tupac was not a lyricist. Let’s be honest, he wasn’t as bad as some rappers lyrically, but lyricism is supposed to go beyond that. Tupac’s wordplay was pathetic, especially when compared to insane lyricists like Nas. Tupac was great at making the listener really feel what his song was about. His word choice was viable, not confusing and not overly simple. Nas on the other hand relays stories better than Tupac, has much better wordplay, uses many literary techniques, and is overall just a better rapper than Tupac. Tupac created the well-recognized diss track Hit ’Em Up, but Nas created the ultimate diss track Ether. Here are a couple of their tracks: Nas - NY State of Mind  Tupac - Brenda’s Got A Baby  Nas - Represent  Tupac - Thugz Mansion  Nas - Halftime  Tupac - I Ain’t Mad At’cha  Nas feat. Lauryn Hill - If I Ruled the World  Hopefully that answers your question. I tried to give examples ",
            "date": "Answered January 22, 2019",
            "views": "792",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joey Hensley",
                    "user_href": "/profile/Joey-Hensley-4"
                },
                {
                    "user_id": "Zack Dunn",
                    "user_href": "/profile/Zack-Dunn-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Fobbs",
                "href": "/profile/Don-Fobbs-1"
            },
            "answer_text": "Tupac Shakur is a legend in every sense of the word. But in the lyrical realm of Hip Hop, he was not considered very good. That was not his lane in Hip Hop. He was a poet and a Revolutionary, but wordplay, metaphors and such were not. ",
            "date": "Answered January 21, 2019",
            "views": "148",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zack Dunn",
                    "user_href": "/profile/Zack-Dunn-8"
                }
            ]
        }
    ]
}