{
    "title": "Is there a way to check for plagiarism in music? - Quora",
    "tags": [
        "Plagiarism",
        "Music Industry",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen Kitchen",
                "href": "/profile/Colleen-Kitchen-4"
            },
            "answer_text": "Depending on how blatant the plagiarism is, yes. It’s a spectrum. DIRECT COPY: If I directly use a © track as a background to a video I upload on youtube, they flag it right away (like within a minute.) Normally the © owners are OK with it because youtube gives them an opportunity to get a few more cents in royalties. That’s a bit by bit absolute comparison. DIGITALLY ALTERING A © TRACK: I’ve been told that some leeches make money on youtube by altering the pitch of a recorded track they don’t own and uploading it, in an attempt to foil the bit by bit matcher, which it certainly would. COVERS: Then there is “covering” a copyright piece, which is still acknowledging the original composers and still OK to do on youtube. It usually takes them a bit longer to find those, because it’s not a bit for bit copy, and it’s not a simple pitch transform on the original, it’s a new recording, with perhaps different instruments and a different voice, but listeners like Shazam are listening for an overall pattern of pitch and rhythm and they do an amazing job identifying music. PATTERN MATCHERS WITH AI: Shazam is a clever plot by BMI to find out what’s being played at venues by having the show-goers tell them. Did you know they pair GPS location data with song matches in Shazam to bust venues who have insufficient or non-existent licenses! UNCONSCIOUS PLAGIARISM: You THINK you wrote it, but you actually lifted it from something you heard. I did that at least once. I “wrote” a song, but it turns out the hook had the same melody as a popular song that was going around at the time. CHORD PROGRESSIONS: OK TO LIFT!!! In popular music, chord progressions are fairly mundane and standard, and used in a lot of songs. You’d be a fool, for example, to claim that you “owned” the 12 bar blues, or the “Flintstones” progression (I VI II V) because there are a million songs based on those. In jazz, the chord progression often IS iconic, but jazz is such a small fraction of music. It has been ruled in the courts that no one owns a chord progression. What this means for me as a jazzer is that I can take the © chart out to a non licensed venue and play the changes all I want, as long as I make up a different melody and don’t sing the copyrighted lyrics or the copyrighted melody. Scat and Improv, here I come!!! The essence of jazz anyway. To be on the safe side, though, I limit this to fairly obscure tunes that few people are likely to recognize anyway. MELODIC RIFFS AND PHRASES: Where it gets shaky is borrowing “riffs” or phrases. Those are much shorter and it’s arguable whether anyone “owns” them or not. If someone begins a famous song with a D Major arpeggio, for example, that doesn’t mean I can’t begin my song with that. It’s a subjective decision, and I would argue that the more music one knows, the LESS one is likely to assign “ownership” to a short phrase, or the longer it would have to be before you say, OK, that’s “Here comes the sun.” LYRICS: Lyrics are tricky for the same reason prose and melodic riffs are tricky. Does anyone own the phrase “broke my heart”? I don’t think so, but if you lift a whole verse, it becomes clear that plagiarism is happening. Anyway, with the gray areas, it gets decided in courts, with the decision generally going to whichever party has deeper pockets. ",
            "date": "Answered January 26, 2018",
            "views": "132",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lyla Wolfe",
                    "user_href": "/profile/Lyla-Wolfe-1"
                },
                {
                    "user_id": "Wu Daniel",
                    "user_href": "/profile/Wu-Daniel-11"
                },
                {
                    "user_id": "Nilesh Sharma",
                    "user_href": "/profile/Nilesh-Sharma-11"
                },
                {
                    "user_id": "Aadrsh Patel",
                    "user_href": "/profile/Aadrsh-Patel"
                },
                {
                    "user_id": "Kshitij Pandey",
                    "user_href": "/profile/Kshitij-Pandey-5"
                },
                {
                    "user_id": "Grayson King",
                    "user_href": "/profile/Grayson-King-1"
                },
                {
                    "user_id": "Alisha Jafry",
                    "user_href": "/profile/Alisha-Jafry"
                },
                {
                    "user_id": "Dylan Trevaskis",
                    "user_href": "/profile/Dylan-Trevaskis"
                },
                {
                    "user_id": "Arséne Z",
                    "user_href": "/profile/Arséne-Z"
                },
                {
                    "user_id": "Zeeg Nathen",
                    "user_href": "/profile/Zeeg-Nathen"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Swisher",
                "href": "/profile/David-Swisher"
            },
            "answer_text": "Short answer: Yes. I only know this because I have five YouTube channels (one personal, one family, one for the college where I work, and 2 for non-profit organizations whose media I manage) and I've been very impressed by the detection algorithm they utilize which can detect as little as 15 seconds of video or musical content which comes from another source and identify an exact content match to identify where it comes from, who the intellectual property rights owner is for it, and flag the exact moment in both the submitted video and the source where those appear. I also use the SoundHound app for iPhone which can listen to 15-30 seconds of a song and within a matter of seconds determine what song and artist it is and from what album (with the lyrics even sync'ed to the song's pace) with a very high degree of accuracy. How they do this with music is beyond my expertise, but I know it's the same basic idea as typing a sentence or quote in to Google to see where else it appears in the service's repository (which is similar to how other plagiarism-checking services like TurnItIn operate). But he details of how it works and what's available to various types of users, especially for music applications, is outside of what I know. ",
            "date": "Updated February 17, 2020",
            "views": "267",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lyla Wolfe",
                    "user_href": "/profile/Lyla-Wolfe-1"
                },
                {
                    "user_id": "Arief Rakhman",
                    "user_href": "/profile/Arief-Rakhman"
                },
                {
                    "user_id": "Diana Trimble",
                    "user_href": "/profile/Diana-Trimble"
                },
                {
                    "user_id": "James Jones",
                    "user_href": "/profile/James-Jones-3372"
                },
                {
                    "user_id": "Deadly Rider",
                    "user_href": "/profile/Deadly-Rider-4"
                },
                {
                    "user_id": "Aleksandar Puharic",
                    "user_href": "/profile/Aleksandar-Puharic"
                },
                {
                    "user_id": "Ritom Chakraborty",
                    "user_href": "/profile/Ritom-Chakraborty-4"
                },
                {
                    "user_id": "Jack Loomis",
                    "user_href": "/profile/Jack-Loomis-5"
                },
                {
                    "user_id": "Grayson King",
                    "user_href": "/profile/Grayson-King-1"
                },
                {
                    "user_id": "Scott B",
                    "user_href": "/profile/Scott-B-90"
                }
            ]
        }
    ]
}