{
    "title": "Is the Blue Oyster Cult the most underrated band ever? - Quora",
    "tags": [
        "Blue Öyster Cult",
        "Hard Rock Music",
        "Underrated Things or People",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Wasinger",
                "href": "/profile/Brian-Wasinger"
            },
            "answer_text": "Short answer no; I say there are far more underrated bands out there. BOC gets a lot of love by people old enough to really remember them… before they were reduced to a reference in an SNL skit. But having said that I think that they are underrated in certain contexts. I got into them back when I was in high school. But this was well after their prime (I was born in ‘74. I’m old but not that old). I was into much heavier stuff back then and most of the other bands I listened to back then don’t really resonate with me anymore. They are one of the exceptions to this. And I think that has a lot to do with their pop sensibility, which is largely overlooked. They’re also one of those rare bands that could pull off music that was all over the map, but it never sounded contrived or as though they were just trying to follow a trend. I made a mixtape of them back then and let one of my friends borrow it for a while. He was talking about how much he liked it, and eventually I realized that he had no idea that all the songs were by the same band. That’s a pretty impressive feat. One thing I never understood is why their fans seem to mainly be bikers. Granted I don't know a lot about biker culture, but I never could grasp why their music wasn’t more embraced by the masses. It always made me question why I like them so much. I’m about as far from a biker as one could be. ",
            "date": "Answered July 6, 2016",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chuck Finley",
                    "user_href": "/profile/Chuck-Finley-144"
                },
                {
                    "user_id": "Nathan Newhouse",
                    "user_href": "/profile/Nathan-Newhouse-1"
                },
                {
                    "user_id": "Flint Kontraryan",
                    "user_href": "/profile/Flint-Kontraryan"
                },
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Nanii Niini",
                    "user_href": "/profile/Nanii-Niini"
                },
                {
                    "user_id": "Patrick Flynn",
                    "user_href": "/profile/Patrick-Flynn-2"
                },
                {
                    "user_id": "Ricky Piliero",
                    "user_href": "/profile/Ricky-Piliero"
                },
                {
                    "user_id": "George Verykoukis",
                    "user_href": "/profile/George-Verykoukis-1"
                },
                {
                    "user_id": "Rohan Kohli",
                    "user_href": "/profile/Rohan-Kohli-2"
                },
                {
                    "user_id": "Sandeep Prasad",
                    "user_href": "/profile/Sandeep-Prasad-81"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishnan Parthasarathy",
                "href": "/profile/Ramakrishnan-Parthasarathy"
            },
            "answer_text": "The first three BOC albums constitute the most intriguing, singular and yet melodic and fun hard rock there is...what with the \"Hornswoop me bungo pony, dogsled on ice\" and more. They were a terrific confluence of King Crimson, Byrds, Grateful Dead and MC5, but even better.  The guitar pyrotechnics of On Your Feet Or On Your Knees (live) and the commercial Agents of Fortune were the beginning of the end, though there are minor gems to be found later like Buck's guitar playing in the extended \"Veteran of the Psychic Wars\" from Extraterrestrial Live or the vampire-like tuneage of \"Deadline\" and \"Unknown Tongue\" from Cultosaurus Erectus. They just kept Bad Company (pun intended) by positioning themselves with the AOR/bad hard rock crowd: Journey, Kansas, Rush, REO Speedwagon, Foghat, Foreigner. And all the bad sci-fi. In those first three albums can be found some of the best rock music has to offer...Tunes helped by artists and music critics. So, I'd say that they are underrated especially for those. And the Soft White Underbelly demos stuck in at the end of the remasters are cool, as are the Stalk-Forest Group recordings. I have seen them thrice, and it's a shame that it was mostly at washed-up biker shows, Six Flags kind of things and chili cook-off festivals. ",
            "date": "Answered January 7, 2016",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Stewart Hickey",
                    "user_href": "/profile/Stewart-Hickey"
                },
                {
                    "user_id": "Josh Franks",
                    "user_href": "/profile/Josh-Franks-2"
                },
                {
                    "user_id": "Karl Trollinger",
                    "user_href": "/profile/Karl-Trollinger"
                }
            ]
        }
    ]
}