{
    "title": "Is the C scale for the flute the best for beginners? - Quora",
    "tags": [
        "C Major Scale",
        "Learning Flute"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janet Romanishin",
                "href": "/profile/Janet-Romanishin"
            },
            "answer_text": "No, the C scale is not the best scale for a beginner, because the lowest octave of the C scale uses the foot joint key (low C) which may be difficult to reach for a young beginner, and the flute sound at the bottom takes a little more time to develop that the lower middle register. The middle octave of the C scale takes the player up into the upper middle register, which also takes some time to develop. (the top octave is definitely for later on!) The beginning flute range is generally the notes within the staff - from about low F or G to the F or G at the top of the staff. So an F or G scale would be excellent for a first major scale. If the student is participating in a band program, they are likely using a band method book which favors flats, since that fits with the band; therefore they will be introduced to either an F or Bb scale first. If they are studying on the outside, typical flute methods often introduce the B, A and G (middle of staff) as the first notes, and expand outward from there, introducing both flat and sharp keys. I recommend learning the chromatic scale (starting on any convenient note) as early as possible, along with starting scales when appropriate. Learning 5-note patterns in different keys (for example: C-D-E -F-G; G-A-B-C-D; F-G-A-Bb-C; Bb-C-D-Eb-F, etc.) is very helpful in preparing for learning major scales, as the bottom half of one scale becomes the top of another scale as you work around the circle of fifths. As students progress, they should learn all of the major and all of the minor scales. ",
            "date": "Answered August 22, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vikash Kumar",
                    "user_href": "/profile/Vikash-Kumar-311"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sang Young Noh",
                "href": "/profile/Sang-Young-Noh"
            },
            "answer_text": "Yes, it should be fine, with a single caveat - the low C and B (if you have a B-foot) is notoriously hard to make right, and when you are playing vivace or allegro/presto pieces, getting the C to sound right without sounding like a gurgle is going to be really hard. There’s a piece by Boehm - his caprice no 1 in C extensively forces you to work that C again and again and again, at allegro speed. 24 Caprices-etudes, Op.26 (Boehm, Theobald) If you can get that piece right, with all the patterns (slurred, dotted, double/triple tongue) then you are well on your way to mastering C major. Someone like James Galway makes the low C sound almost Clarinet-like, and people of the Rampal part of the school would simply settle for a middling tone. I’m personally not a huge fan of the lower sounds of the Flute and I believe it should be reserved for the Clarinet, but it really depends on your preferences. As with all the scale, the jump from middle C to D requires a change of 7 fingers - this transition is critical to get right for a beginner. I’d say overall, the easiest scale I find to play on Flute is A-Major. ",
            "date": "Answered May 27, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagacious Satyam",
                    "user_href": "/profile/Sagacious-Satyam"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                }
            ]
        }
    ]
}