{
    "title": "Is the Squier Bullet Stratocaster a good guitar? - Quora",
    "tags": [
        "Squier Bullet Stratocaster"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Vincent",
                "href": "/profile/Travis-Vincent-4"
            },
            "answer_text": "I have two Squier Bullets: a pink 2011 and a seafoam green 2015 Fat Strat which has a bridge humbucker pickup. The pink Strat is amazing. I bought it from a pawn shop for $63 and fans of my band absolutely love the look and the tone and it is totally stock. My Fat Strat is probably more typical. It looks and sounds good but it is a little harsh with tone and the neck is a little sensitive as it is easy to bend notes up and down if you pull or push on the neck too much. The frets needed some work as they get a little gritty unless you sand them down with 0000 steel wool. All that being said the things I like about Bullets is that they have a standard nut width of 1.68 inches versus 1.62 for the Affinity series, I like the thin body as it reduces weight, and for the price you can pick up a gem if you know what to look for. Bullets are buyer beware just in that if you know how to judge guitar quality you can find great looking, sounding, and playing Strats that are a real bargain. Hope this helps. ",
            "date": "Answered September 16, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lukas Artyom",
                    "user_href": "/profile/Lukas-Artyom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Unferdorfer",
                "href": "/profile/Andrew-Unferdorfer"
            },
            "answer_text": "They are quite decent. For the price, they are VERY decent. My girlfriend has a Bullet Strat, and she loves it. I have a Squier Telecaster and a Squier Jaguar. That Jag is one of my favorite guitars. The biggest concern with Squier is inconsistent build quality. If at all possible, it’s a good idea to inspect and play the guitar before you buy it (or, if you don’t have much experience with guitars, try to drag along somebody who does). If you want an authentic Strat and you don't want to pay $500 or more for it, then you're getting a Squier, plain and simple. And if you don't want to pay more than $200 for a guitar, a Squier is one of the best options available. In my opinion, other manufacturers of cheap guitars that I am familiar with, like Epiphone, aren't as impressive until you get more into the $300-$400 range. With that said, it IS a cheap guitar, and if you want a high quality instrument, you’ll need to spend quite a bit more. ",
            "date": "Answered September 16, 2017",
            "views": "19",
            "upvotes": "0"
        }
    ]
}