{
    "title": "Is there any person who can make karaoke of a song for free? - Quora",
    "tags": [
        "Karaoke",
        "Singing",
        "Music Industry",
        "Free Products",
        "Existence Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Mays",
                "href": "/profile/Michael-Mays-2"
            },
            "answer_text": "If you have the app Audacity for your Mac or PC, you can do it with any song you already have for free. They even tell you how to do it here: Remove the Vocals From a Song But Quora likes us to keep people local, so I’m going to shamelessly lift (but give proper credit) from that page. Bear in mind: as the author of this little recipe indicates, this won’t work with all tracks. The part you want to remove has to be in the exact center of the recording space—that is, not shifted or spread across the stereo. You’re about to cut a “hole” in the sound. Step 1: Open Audacity If you haven't downloaded it already, download it. It is free. If you have, then open it up to a new project. Step 2: Drag in the Song Drag in the song from your desktop, or any folder. You can also drag in the song straight from iTunes. Step 3: Split the Stereo Track Go to the upper left of the sound track and click on the drop down arrow next to the name of the song. Click on \"Split Stereo Track\". Step 4: Select the Bottom Track To do this, double click on the blue part of the lower track. It should turn a darker shade of gray than the other track. Step 5: Invert the Bottom Track Go to the Effects tab and click on \"Invert\". This flips around the lower track. Step 6: Set Both Tracks to Mono Next go back to the drop down arrow next to the name of the song, and click on \"Mono\". Do this for both tracks. This sets it so that each audio signal is routed through a single channel. Step 7: Export It Lastly, click the play button to make sure that the vocals are gone. If so, go up to the File tab and click \"Export\". Once you do this, a box or two may pop up asking you to choose what name you want to export it as. Type in the name you want and press either Ok or Export. Thanks to TJ Gascho for this succinct recipe. ",
            "date": "Answered May 14, 2018",
            "views": "19",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Martin",
                    "user_href": "/profile/Matthew-Martin-351"
                },
                {
                    "user_id": "Kathie Rost",
                    "user_href": "/profile/Kathie-Rost"
                },
                {
                    "user_id": "Prakash Vittal Raj Baskar",
                    "user_href": "/profile/Prakash-Vittal-Raj-Baskar"
                },
                {
                    "user_id": "Naima Montecinos",
                    "user_href": "/profile/Naima-Montecinos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhaaskar Desai",
                "href": "/profile/Bhaaskar-Desai"
            },
            "answer_text": "Can be someone you know very well who can do it for you without charge. But there is one question that arises in my mind. Why wouldn’t you want to pay for something that is exclusively done for you and which requires skill, knowledge, hard work, patience, lot of time and years of experience in making a karaoke song? It is a dedicated job for someone. It is only fair to pay him for the services that he is offering. Try asking yourself. Would you do anything for free for someone you don’t really know, which involves all the above mentioned points? Apart from that you can always Google for any karaoke songs that you might need. A lot of free karaoke can be found. ",
            "date": "Answered March 16, 2018",
            "views": "425",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hicham Chahidi",
                    "user_href": "/profile/Hicham-Chahidi"
                }
            ]
        }
    ]
}