{
    "title": "Is Zebronics a good brand for headphones? - Quora",
    "tags": [
        "Zebronics",
        "Sennheiser",
        "Product Recommendations",
        "Audiophiles",
        "Earphones",
        "Brand Strategy",
        "Headphones",
        "Audio Equipment",
        "Brands and Branding"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raj Hazel",
                "href": "/profile/Raj-Hazel"
            },
            "answer_text": "Zebronics are good brand for headphones. Built quality of Headphones are very good. looking awesome & compact size . all functions work nicely.The Brand has not any pairing issues, battery backups and noise cancellation features are good. Zebronics Headphones Can be used independently without using phone for listening to favorite music. The FM feature is currently one of a kind. And their wireless headphones have amazing audio Zeb-Duke/Zeb-Dynamic with 30 hours of playback. Zebronics provide vareity features like It has music player with micro SD card support without connect Bluetooth. u can listen songs like music player. ",
            "date": "Answered October 20, 2020",
            "views": "242",
            "upvotes": " Answer requested by Gyan R. Biswal",
            "upvoters": [
                {
                    "user_id": "Gyan R. Biswal",
                    "user_href": "/profile/Gyan-R-Biswal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amy Smith",
                "href": "/profile/Amy-Smith-777"
            },
            "answer_text": "Yes, It is a good brand for headphones since their products are updated so frequently and they have a new line up. Their wireless headphones have amazing audio Zeb-Duke/Zeb-Dynamic with 30 hours of playback. Their Just launched Active Noise cancellation wireless earphone is just something you will have to test to know the amazing sound quality of this wireless earphone. In the wireless earphone segment, they also have Zeb-Yoga, Zeb-Aika, Zeb-Lark amazing audio, and long battery backup. ",
            "date": "Answered August 27, 2020",
            "views": "672",
            "upvotes": " View 1 Upvoter "
        }
    ]
}