{
    "title": "It’s been over a week later and I'm still hearing non-stop Van Halen on the radio. Do you remember this happening when Michael Jackson, David Bowie, or Prince died? - Quora",
    "tags": [
        "Michael Jackson (Beer Writer)",
        "Van Halen",
        "David Bowie (musician, actor)",
        "Prince (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "W. Boutros",
                "href": "/profile/W-Boutros"
            },
            "answer_text": "Hey Quora, why is this answer appearing under “Where were you when MJ died?”? I answered this in response to a question about radio stations playing a lot of Van Halen after EVH’s death. Get it together Quora. What a bunch of oafs. The simple answer is yes, but I also believe you’re experiencing confirmation bias. The phrase “the radio” doesn’t mean what it did 2 – 3 decades ago, when it primarily meant a finite number of local or powerful broadcasters that played specific formats of music - like a classic rock radio station or a pop radio station etc. Today there are literally tens of thousands of so-called radio stations available via the airwaves, the Internet, satellite and other broadband services etc. My guess is that you’re into rock from the Van Halen era - the very late 70’s through the 80’s - or classic rock, more broadly defined. Because of that, that’s your definition of “the radio”. And because those are the radio stations you listen to, by default that’s the format of music they’re playing, with extra emphasis on musicians who recently died or were in the news for some other reason. If you were listening to most of the other thousands of radio stations out there, you would not be hearing non-stop Van Halen, or probably any Van Halen at all. That’s confirmation bias. But yes, when other famous musicians died, the radio stations which featured their genre of music in their formats did play their music extensively after their deaths. When John Lennon died in 1980, the number of radio stations was limited, as I described in the first paragraph, and many radio stations which didn’t normally play pop or 60’s - 70’s rock switched to playing a lot of Beatles and solo Lennon music for a few weeks. Or they slipped some of it into their usual formats. ",
            "date": "Answered October 16, 2020",
            "views": "50",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Wildman",
                    "user_href": "/profile/Stephen-Wildman-1"
                },
                {
                    "user_id": "Paul Clarke",
                    "user_href": "/profile/Paul-Clarke-314"
                },
                {
                    "user_id": "Henry Hrebien",
                    "user_href": "/profile/Henry-Hrebien"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Lehmann",
                "href": "/profile/Alexander-Lehmann"
            },
            "answer_text": "When Michael Jackson died the radio had an incredible amount of Michael Jackson music on, for David Bowie I am not sure, I think there was a lot played as well. When Prince died I was driving home in the evening after I went out with my wife and I noticed that they played 3 Prince songs in a row and I thought, ok that can only mean that Prince died today and it turned out to be the case. ",
            "date": "Answered October 16, 2020",
            "views": "35",
            "upvotes": "0"
        }
    ]
}