{
    "title": "I’ve never seen The Princess Bride. What is wrong? - Quora",
    "tags": [
        "The Princess Bride (1987 movie & 1973 book)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Lee Chadwick",
                "href": "/profile/Adam-Lee-Chadwick"
            },
            "answer_text": "You’ve never seen the Princess Bride. What is wrong? . Nothing is wrong with you by not ever watching the movie Princess Bride. You are basically not missing anything at all in this film except two things that are useless information. 1. If you know anything about this character. His name is Dread Pirate Roberts. He was a very famous fictional character inside the original Silk Road that happened in 2011 inside the Dark Web that was created by a very interesting and lively person named Ross Ulbricht. Dread Pirate Roberts was the creator and the mastermind of Silk Road 1.0. The interesting and unique situation was that a real-life human used his imagination to create a fictional character from Princess Bride to build his entrepreneur empire by buying and selling illegal substances with a bitcoin system inside the underground world of the internet.  2. The first 6 fingered man character that I never knew in any films until Princess Bride came along. This 6 fingered man is the nemesis to Dread Pirate Roberts and also Inigo Montoya. Count Tyrone Rugen (aka. Christopher Guest) is the character name in this film: Princess Bride.  Very silly useless information but maybe the first one can be a useful knowledge with how Ross Ulbricht created and organized the Dark Web of Silk Road 1.0. It all started with a fictional character (the main character) from this 1987 film: Princess Bride. ",
            "date": "Answered September 12, 2020",
            "views": "212",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zachary Siple",
                "href": "/profile/Zachary-Siple-3"
            },
            "answer_text": "I didn’t see Jurassic Park or Back To The Future until I was 18. Some people are just late bloomers with certain movies. Try catching it on TV or buy it on Amazon. Enjoy, it’s a great movie! :) ",
            "date": "Answered September 19, 2020",
            "views": "60",
            "upvotes": "0"
        }
    ]
}