{
    "title": "I’m 13 and I play the flute, the clarinet, the tenor saxophone, and the piano. I’m looking to get another one. I’m thinking about violin or trumpet. Are either of these a good idea? If not, what should I play? - Quora",
    "tags": [
        "Clarinets",
        "Trumpets",
        "Playing the Flute",
        "Saxophones",
        "Violins",
        "Pianos",
        "Learning to Play Musical Instruments",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Baranchik",
                "href": "/profile/Marc-Baranchik"
            },
            "answer_text": "Before I can answer the question, I have to ask you why you want to learn another instrument (not that you shouldn't)? Are you thinking of some kind of musical profession? Would you be better off trying to truly master one or more of the instruments you already play? Of the two instruments you mentioned is there one you are more interested in? Personally, I did learn both instruments and both are worthwhile and rewarding. Playing trumpet would require working on your embouchure, but learning the fingerings shouldn't take you very long. Violin is another story altogether. You would have to spend time learning how to hold the instrument and where to place the fingers of your left hand to get the correct pitches. Eventually, you need to learn the different left hand positions and how to shift between them. You also need to learn the correct way to pluck the strings with.your right hand and equally if not more important how to correctly use the bow to draw a pleasant tone from the strings. Violin would probably take longer to come close to mastering, than trumpet, but you have to make the final decision. If you have a music teacher at school, or study privately, I would recommend talking to them. If you can talk to them and answer the questions I asked you to consider, it might make it easier for you to decide. ",
            "date": "Answered April 9, 2020",
            "views": "122",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wout Snijders",
                    "user_href": "/profile/Wout-Snijders"
                },
                {
                    "user_id": "Ralph Percy",
                    "user_href": "/profile/Ralph-Percy-1"
                },
                {
                    "user_id": "Wayne Hajas",
                    "user_href": "/profile/Wayne-Hajas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Percy",
                "href": "/profile/Ralph-Percy-1"
            },
            "answer_text": "I think it’s great that at age 13 you are a multi-instrumentalist. I’ve taught a clarinet player to double on trumpet and she did a pretty good job. The difficulty there is learning a new and very different embouchure(your “band” face). Brass is played by buzzing the mouthpiece unlike wind instruments in which you cause the reed to vibrate or buzz. I would say you may be happier learning violin since you would not have to develop an entirely new embouchure and be expected to switch between brass and wind. We learn to play by muscle memory. As a young musician this can be tricky. NOT impossible, but it can be a challenge. I also believe that a violin will increase the control in your hands which is great. I’m not sure how long you’ve been playing the various instruments, but as a musician and middle school band director I’m very impressed. You are the kind of student I want in my band. Keep it up and let me know if you have any other questions. I’d love to know which you decided to pursue. I hope this helps. Guy ",
            "date": "Answered April 9, 2020",
            "views": "117",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Curt Hedges",
                    "user_href": "/profile/Curt-Hedges"
                }
            ]
        }
    ]
}