{
    "title": "I’ve heard that in order to play high notes on the trumpet, you need to loosen up your top lip. What are some exercises to learn this (I’ve been playing for 4 years now)? - Quora",
    "tags": [
        "Trumpets",
        "Learning to Play Musical Instruments",
        "Musical Instruments",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Freedman",
                "href": "/profile/Jerry-Freedman"
            },
            "answer_text": "I have never heard that particular story. Playing high in trumpet or any brass instrument is sort of like breaking boards in Karate demonstrations. Done right, the board breaks, done wrong, the hand breaks. Embouchures ( the lips, face, tongue, where the face meets the horn) are personal and free advice given here or facebook or some media is worth what you paid for. To stay out of trouble and get good results fastest you need a good teacher. I don’t know where you live but here are some resources to help you: Trumpetherald.com, BBtrumpet.com. TPIN ( a mailing list), Wilktone.com( mainly for trombones but a lot of good advice and information). A lot of very good teachers Skype. Off hand I can think of Jeanne Pocius, John Mohan, and Rich Willey ( not sure if Rich teaches but he would know where to find a good teacher). On youtube Greg Spence has some very good videos, some aimed beginners. Good luck. Trust me, if I can do it anyone can. It just takes work and a good teacher ",
            "date": "Answered July 31, 2019",
            "views": "110",
            "upvotes": " Answer requested by Cora Crone"
        },
        {
            "author_info": {
                "name": "Frederick Hill",
                "href": "/profile/Frederick-Hill-4"
            },
            "answer_text": "First, you can be led astray by thinking that there is a special technique for playing high. There is now “low” ‘middle” or “high” register on trumpet; the aim is to create as seamless a delivery as possible. As with singing the aim is to add a semitone to your register per week, or month, or as long as it takes until it becomes part of your “normal” range. The search for extended range on the trumpet appears to have begun with Louis Maggio who sought to rehabilitate himself following a devastating lip injury. Subsequent “high note” methods have been built on extending the lower end as well as the high “into the “pedal” register. To built a high-rise block you have to dig the foundations deep into the earth. Sound is what matters most of all. ",
            "date": "Answered July 30, 2019",
            "views": "118",
            "upvotes": " Answer requested by Cora Crone"
        }
    ]
}