{
    "title": "Just guys please —What do you think of WAP? Do you think Cardi B is attractive? I’m just curious how guys perceive her and the song. Like is she a major turn on or just the lyrics?  - Quora",
    "tags": [
        "Cardi B (musician)",
        "Attraction (interpersonal)",
        "Attractiveness and Attractive People"
    ],
    "response": [
        {
            "author_info": {
                "name": "François Paré",
                "href": "/profile/François-Paré-1"
            },
            "answer_text": "I’m sorry in advance if this is kind of a boring answer, but I’m neutral on the whole deal. I don’t mind it one way or another. I’m interested in her music in the same sense that I’m interested in Latvian free jazz or the lounge scene in 1960s Albuquerque. If it gets a bunch of close-minded ninnies to throw a fit, then that’s pretty nice, but otherwise, it’s a mega-shrug from me. I don’t dismiss it, I don’t dislike it, I would never say it’s not art. But it’s just not in my wheelhouse. If people like it, I’m happy for them. As for whether I find Cardi B attractive, yeah, sure, she’s a beautiful woman. A bit too young for me, maybe. In a general sense I prefer a more natural look, but what she’s doing is clearly working for her. Not quite my style, but then again, I’m probably not her style either, so it’s all good. Either way I wish her the best. ",
            "date": "Answered September 2, 2020",
            "views": "444",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ariana Grande Fan",
                    "user_href": "/profile/Ariana-Grande-Fan-19"
                },
                {
                    "user_id": "Charles Reach",
                    "user_href": "/profile/Charles-Reach"
                },
                {
                    "user_id": "Alex Jones",
                    "user_href": "/profile/Alex-Jones-853"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Carpet-Efwi"
                }
            ]
        }
    ]
}