{
    "title": "Just how edgy is Linkin Park's music? - Quora",
    "tags": [
        "Linkin Park Songs",
        "Linkin Park (band)",
        "Rock and Roll Music",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eli Cosgrov",
                "href": "/profile/Eli-Cosgrov"
            },
            "answer_text": "Depends what you mean by edgy. If you mean Edgy as in the stereotypical teenage sense yes and no. Their first two albums Hybrid Theory and Metoria yes they are definitely edgy like a solid 8 or 9 in terms of edgy. Minutes to miniute had a lot less edge to it but it was still edgy songs like Bleed it out and Given Up. However, albums like a thousand Suns and One More Light have literally no edge to them whatsoever. Those albums are literally just either experimental electronic music or straight up radio pop music with no intense edgy lyrics or instrumentation whatsoever. If you want songs of Linkin Park that are truely edgy listen to Numb,Crawling, One Step Closer or pretty much every song off Hybrid Theory or Metoria or some songs off of Miniutes to midnight . If you mean edgy as in the heaviest or darkest thing out there then no there are way heavier bands out there. To keep it simple band was extremely edgy from Hybrid Theory to Minutes to Midnight. After that they became a pop band. If you want to hear another band that are similar but heavier and edgier listen to Slipknot they've been around for longer and have the edgy lyrics but make amazing music and their sound is still established in one genre. But yeah Linkin Park was edgy up to minutes to miniute and stop being an edgy or even rock band for that matter after that so they technically sold out. Edgy Linkin Park 2000–2007. ",
            "date": "Answered July 20, 2020",
            "views": "370",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Siddhesh",
                    "user_href": "/profile/Siddhesh-64"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elijah Taylor",
                "href": "/profile/Elijah-Taylor-46"
            },
            "answer_text": "Edgy is nothing more than a now meaningless buzzword; a blanket term for anything even remotely dark, serious, or personal. Their music helps people. People usually direct this towards the first 2 albums, Hybrid Theory and Meteora, which are FANTASTIC albums. Very well-produced with heavy hitting riffs, and lyrics that again, help people. So it's not “edgy\", it's just music. I wish it were easy to ignore these people because they're obnoxious, but in the end, it doesn't even matter. ",
            "date": "Answered September 30, 2020",
            "views": "141",
            "upvotes": "0"
        }
    ]
}