{
    "title": "Music Production: What is the best PC alternative to Logic Studio? - Quora",
    "tags": [
        "Computer Applications",
        "Music Software",
        "Music Production Software and Apps",
        "Music Producers",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian C McCalla",
                "href": "/profile/Brian-C-McCalla"
            },
            "answer_text": "I've tried them all (and actually used 5 of them in and out…no easy feat) and if it's relative to the Apple prima Donna, then there really are only 3 DAWs that compare to Logic Pro in terms of workflow, depth, and capabilites: Steinberg’s Cubase Pro Cakewalk’ s Sonar Platimum Avid’s Pro Tools Honorable Mentions to MOTU’s Digital Performer and Cocko’s Reaper. Sure, Ableton Live and Studio One and Mixcraft and Sequoia and Bitwig and Tracktion are good and definitely capable DAWs (though probably more in the box than out)…and sure, LMMS and Audiacity are free and capable in their own rights, too… …but if you need the flexibility to be able to record and process live audio, mix it with vsti midi tracks and loops, and then also control and sequence live hardware synthesizers, drum machines, samplers, and effects units and then mix, master, and render product in variable file formats to various sources without turning to another piece of software or rely on somebody else, those 3 (or 5) packages are your best bet. If you're only working in the box, then you probably aren't using Logic Pro now, anyway, and I'd tell you to stick with Ableton (which you're almost certainly using). It's the same story as above with Ableton, except if you're 12, then use FL studio. If you are completely terrified of computers but can produce the hell out of a hardware rig, then sure…go ahead and use Reason. Otherwise, Cubase, Sonar, Pro Tools (and maybe Digital Performer and Reaper) are your best bets. ",
            "date": "Answered August 25, 2017",
            "views": "211",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Armira Nance",
                    "user_href": "/profile/Armira-Nance"
                },
                {
                    "user_id": "Fariz Fariz",
                    "user_href": "/profile/Fariz-Fariz-3"
                },
                {
                    "user_id": "Arron Phillips-Williams",
                    "user_href": "/profile/Arron-Phillips-Williams"
                },
                {
                    "user_id": "Mark Berry",
                    "user_href": "/profile/Mark-Berry-52"
                },
                {
                    "user_id": "Alvarris Swett",
                    "user_href": "/profile/Alvarris-Swett"
                },
                {
                    "user_id": "Levi Fuller",
                    "user_href": "/profile/Levi-Fuller"
                },
                {
                    "user_id": "Arda Bakan",
                    "user_href": "/profile/Arda-Bakan-3"
                },
                {
                    "user_id": "EL Segundo",
                    "user_href": "/profile/EL-Segundo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Richmond",
                "href": "/profile/Mark-Richmond-21"
            },
            "answer_text": "I’ve wondered this for years. For context, the last version I used was Logic Pro 7, which must seem hilariously outdated these days. Out of curiosity, I got my hands on Logic 4 I believe it was, the last version of Logic to appear in Windows. It was infuriatingly slow. Whether that was because of the age of the software, it not liking Windows 10, or a combination of many factors, I’m unsure. Frankly, I didn’t want to hang around with it long enough to figure it out. These days, I’ve gone for the cheaper solutions. If you’re also looking to keep costs down, Audacity and Reaper are the ones I’ve plumped for. That being said, Audacity is fairly limited, so I’d only recommend this if you want to go for something free and use it simply for tracking, looping and snipping. Reaper on the other hand is my little love. I mostly record, so don’t really need much in the way of sampling or anything like that. I haven’t really looked into this side, but I don’t think there is MIDI programming capabilities. If there are, by all means let me know. I’d be especially interested in using this if it resembles Logic’s Matrix Editor. This leads me on to the other program I have: PreSonus Studio One. Again, being a cheap bastard, I only have the free version. However, even for something free, it has a wealth of tools at your disposal, so you could do a hell of a lot worse. This does have something like the matrix editor, as far as I can see, but it doesn’t feel as user-friendly to me as Logic 7’s did. I’ve had a little bit of experience with Reason and FL Studio, but they’re ones I just couldn’t get on with. I’m a creature of habit, so I like having a familiar feel. If you’re unwilling to spend a lot of money, I would plump for Reaper for sure, and maybe get Guitar Pro as well if you fancy adding MIDI tracks either into the song or as a ghost instrumentalist to keep you in time. ",
            "date": "Answered December 20, 2018",
            "views": "35",
            "upvotes": "0"
        }
    ]
}