{
    "title": "Music Theory: Why does any sequence of notes from the pentatonic scale sound reasonably pleasant? - Quora",
    "tags": [
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashesh Nishant",
                "href": "/profile/Ashesh-Nishant"
            },
            "answer_text": "Pentatonic scale(mode, to be more accurate) is a selection of 5 notes out of 12 unlike the 7-note selection in Diatonic scales. You can include or exclude semitones in that selection of 5, making the Pentatonic scale a Hemitonic or an Anhemitonic scale. Regardless, you will be selecting consecutive 5 pitches on the Circle Of Fifth(cap-case because Circle Of Fifth has God-like magical qualities). Let's construct one with the same example that Ethan Hein has put forth. Five adjacent pitches on Circle Of Fifth starting with C - C G D A E. But you have just spanned two octaves. Transposing them on a single octave you have got - C D E G A - a major Pentatonic scale. Notice from the original C Major scale, we have removed the the fourth and the seventh - the dissonant intervals. If we omit the third and the seventh, we get F G A C D - 2nd anhematonic pentatonic scale. Remove the first and fourth - G A B D E - you got the 3rd anhematonic pentatonic scale. Notice something? There is no way you can play a dissonant sound in these scales no matter what sequence you play it in. That's the simplicity of Pentatonic scales. It also is its biggest constraint. There is no way to create friction or tension or meandering-away-from-home feel. Modern jazz, rock and pop very often use these scales for solo improvisations because of the same simplicity - pentatonic scales not only work very easily with chords diatonic to a given key, they are sometimes better than the parent scale. I would disagree with Travis Huff’s argument about the restricted appeal of Pentatonic scales. My counters. Jodies or US Miltary cadences use Pentatonic scales to keep steps synchronous in a march. Most of the religious hymns, perhaps the most famous being Amazing Grace, extensively uses Pentatonic scales. The Yo-scale used in Budhhist chants is an anhemitonic pentatonic scale. The five-hole Japanese shakuhachi flute plays only a minor pentatonic scale. Ethiopian music, characterized by long intervals between notes, uses a very refined Pentatonic modal system. Great highland bagpipe popularized by Scottish music, with its diminished seventh and augmented fourth, is an instrument that can play the most number of pentatonic scales with its nine-note arrangement. You will find hundreds of Rock-guitar solos on B minor Pentatonic. The appeal of Pentatonic scales is universal. Because of the simplicity of being centered around the interval of fifth, pentatonic scales should be applied to introduce beginners to music. It helps develop creativity through improvisation because there is little chance of making mistakes. I have a 9-year old daughter whom I teach music theory. Although she is learning the construction of scales theoretically, in practice she is only allowed to play pentatonic scales. Reasons are two-fold. Immediate gratification - she plays only consonant intervals wth five notes which helps her create pleasing melodic shapes rather quickly. Avoiding errors - it's impossible for her to make any harmonic mistakes with five consonant intervals. ",
            "date": "Answered July 13, 2017",
            "views": "45",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Rudin",
                    "user_href": "/profile/Steven-Rudin"
                },
                {
                    "user_id": "Walter Erickson",
                    "user_href": "/profile/Walter-Erickson-5"
                },
                {
                    "user_id": "Biswajeet Padhi",
                    "user_href": "/profile/Biswajeet-Padhi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "The notes in the pentatonic scale sound good in any order because there are no dissonant intervals between any of them. The major pentatonic scale is the same as the major scale minus the fourth and seventh notes. So you can get C major pentatonic by starting with the C major scale, and removing F and B. If you write the major scale on the circle of fifths, the notes in the pentatonic are conveniently grouped together. They’re the red ones:  F and B make up a dissonant tritone (http://www.ethanhein.com/wp/2010/the-mystical-tritone/), and they give the C major scale its tension. In addition to the tritone, B is a tense semitone below C, and E is a semitone below F. Removing the F-B tritone means there are no wrong or dissonant notes in C major pentatonic. Everything you play will sound good. That’s nice for beginners. But it also means there’s no risk, and therefore not as much drama. The same logic applies if you think of the collection of notes above as the A natural minor scale, with the notes in red as A minor pentatonic. You can make your pentatonics livelier by playing the \"wrong\" scale. Here's what you get if you play each of the twelve different minor pentatonic scales over an A root. This is especially easy on the guitar -- just let the A string ring while playing your pentatonics on the D, G, B and E strings. A minor pentatonic: A blues, natural minor, dorian and phrygianBb minor pentatonic: Nothing useful.B minor pentatonic: A sus, major or 7th. Also A dorian.C minor pentatonic: A7 altered. Resolve to D or D minor afterwards.C# minor pentatonic: A major seventh. Lovely.D minor pentatonic: A natural minor or phrygian.Eb minor pentatonic: Nothing useful.E minor pentatonic: A7sus, from mixolydian. Also natural minor.F minor pentatonic: Nothing useful.F# minor pentatonic: A major pentatonic.G minor pentatonic: A phrygian. Flamenco time!Ab minor pentatonic: A lydian. Awesome.For more, see my blog post about pentatonics. http://www.ethanhein.com/wp/2010/the-pentatonic-box/ ",
            "date": "Updated February 10, 2012",
            "views": "124",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Waltman",
                    "user_href": "/profile/Richard-Waltman-4"
                },
                {
                    "user_id": "Fred Hale",
                    "user_href": "/profile/Fred-Hale-2"
                },
                {
                    "user_id": "Vishann Raii",
                    "user_href": "/profile/Vishann-Raii"
                },
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                },
                {
                    "user_id": "Zachary Smith",
                    "user_href": "/profile/Zachary-Smith-183"
                },
                {
                    "user_id": "Sushovan Shakya",
                    "user_href": "/profile/सुशोभन-शाक्य-Sushovan-Shakya"
                },
                {
                    "user_id": "Steve Roberts",
                    "user_href": "/profile/Steve-Roberts-83"
                },
                {
                    "user_id": "David Ezell",
                    "user_href": "/profile/David-Ezell-9"
                },
                {
                    "user_id": "John Moffett",
                    "user_href": "/profile/John-Moffett-21"
                },
                {
                    "user_id": "Kaverappa MP",
                    "user_href": "/profile/Kaverappa-MP"
                }
            ]
        }
    ]
}