{
    "title": "My dream is to become a singer, my parents think it's a horrible idea and hate me for it. What should I do? - Quora",
    "tags": [
        "Singers",
        "Singing",
        "Hate",
        "Dreams and Dreaming",
        "Family Relationships and Dynamics",
        "Parents",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Megan Lewandowski",
                "href": "/profile/Megan-Lewandowski-5"
            },
            "answer_text": "forget your parents! this is your life, you decide what to do! if you have to tell someone how much you love singing (this will happen at least once) then tell somebody you know will respect your opinion no matter what.practice. practice, practice, practice. practice singing so much that you think about it when you wake up. sing whenever you want to! if your parents lecture you for singing, just walk away and lock the door.be patient. some people’s opinions can change in a matter of seconds, while others have to think about it for weeks before deciding what to do. i know my mom makes decisions on the spot, while my dad stops and thinks.know that your parents will still love you even if it seems like they don’t. when you stay with someone for years and years, and you love each other, then you’ll still love each other even if you fight! if it seems like they really hate you, then take 20 minutes to pout and whine and cry, and then think, “what should i do about this?” (this is easier said than done, by the way. remember, you can do this! i believe in you!)i’m probably younger than you are, so this advice might not be the best, sorry about that. anyways, i support you! singing is beautiful, and i hope that if you do become a singer, that you become famous! bye! -megan ",
            "date": "Answered August 28, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Elford",
                "href": "/profile/Eric-Elford-1"
            },
            "answer_text": "A lot of people dream of being a singer! Even in the privacy of my shower, I too, am a world famous singer. Or not. Nothing wrong with wanting to belt out a tune to soap suds. so go for it! Take lessons, learn from the best. Take on a few America’s best contests. Have fun with it, go with it. Enjoy yourself! But all look have a career education path. Go for a career in something tangible too, because you can do both! Sing your heart out!! ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}