{
    "title": "My mom is going to make me repeat grade because im failing. How do I convince her to not make me repeat? - Quora",
    "tags": [
        "Mother-Child Relationships",
        "Grades (education)",
        "Failure",
        "Mothers",
        "Family Relationships and Dynamics",
        "Parents",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Moline",
                "href": "/profile/Amy-Moline"
            },
            "answer_text": "The world has changed so I don’t know how if it’s possible, but what about taking summer school classes to catch up? Could you access home school curriculum and materials to catch up?Have you checked out learning resources - tutoring or GED prep classes or outreach programs? Notice that all of my suggestions involve gaining the knowledge necessary to be prepared for success in the next grade level. Starting out a new school year without the skills and base knowledge that you were meant to gain just makes it more difficult to be successful the next year. Difficult, not impossible. i don’t know what factors contributed to failing the current year, but do what you can to resolve those issues. Work on a list of changes that you can make now to get better results in the future. Your school guidance counselor should be able to help you with that. ",
            "date": "Answered April 29, 2020",
            "views": "74",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christine EveningsFall",
                    "user_href": "/profile/Christine-EveningsFall"
                },
                {
                    "user_id": "Clifford Mechels",
                    "user_href": "/profile/Clifford-Mechels"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Peaunut-Butter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Arienti",
                "href": "/profile/Mike-Arienti"
            },
            "answer_text": "If you’re failing, it has nothing to do with your mother. If you don’t earn passing grades, you can’t go to the next grade. ",
            "date": "Answered April 29, 2020",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christine EveningsFall",
                    "user_href": "/profile/Christine-EveningsFall"
                },
                {
                    "user_id": "Clifford Mechels",
                    "user_href": "/profile/Clifford-Mechels"
                },
                {
                    "user_id": "Kate Haas",
                    "user_href": "/profile/Kate-Haas-13"
                }
            ]
        }
    ]
}