{
    "title": "My vocal range is B2 to A4. What is my vocal type? - Quora",
    "tags": [
        "Voice Type",
        "Vocal Range",
        "Singing Voice",
        "Voice",
        "Singing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Palmer",
                "href": "/profile/David-Palmer-393"
            },
            "answer_text": "B2 to A4 I think would be a Bass voice. I would expect you to be able to extend that upwards to E5 if you started working on your voice. When people quote A2 to B6 or whatever I’m never quite sure we are understanding the same thing. B2 is an exceptionally low note to be able to sing with any quality of tone. Whereas A4 is not very high for a voice to stop. Here is a photo of my iPad piano app. Is this what we are talking about? Just under two octaves with middle C (C4) central . if you can sing B2 and make a good sound start looking for a good teacher. Basses are really quite rare and a good one can have a very good career in music.  ",
            "date": "Answered August 2, 2020",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wesley Ray Thomas",
                "href": "/profile/Wesley-Ray-Thomas"
            },
            "answer_text": "This Depends upon Many Factors beyond how low you may be able to growl or how High you can Scream. It also usually depends upon how close your voice is to puberty or maturity as there is about 25 years between the two. My own voice dropped from Mezzosoprano to Bass-baritenor as I neared my 14th birthday. As a grown man with a mature voice I am considered a Dramatic Baritone. Although the range you describe seems like a normal untrained tenor range, I can’t know without hearing some decent recordings. ",
            "date": "Answered January 18, 2020",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terrence Chua",
                    "user_href": "/profile/Terrence-Chua-2"
                }
            ]
        }
    ]
}