{
    "title": "Of the Les Paul, Stratocaster, and telecaster, which one does the best job of mimicking the other two in its traditional configuration? - Quora",
    "tags": [
        "Telecaster",
        "Les Paul",
        "Fender Stratocaster",
        "Fender Guitars",
        "Electric Guitars",
        "Guitarists",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Reeves",
                "href": "/profile/Scott-Reeves-54"
            },
            "answer_text": "Ah, see the key words in the question, “traditional configuration.” There’s the rub. In their traditional configuration, in other words with the components that were part of the original design and without any modifications, none of these guitars is capable of mimicking the other two. The two Fenders are closer since they both employ single coil pickups but the strat does a better job of mimicking the tele than the other way around because the tele lacks the middle pickup and the two switch positions which blend the middle with the neck and the bridge pickups. But neither of them can mimic the sound of a Les Paul, since it’s got humbucking pickups, and the traditional configuration of the Les Paul lacks the ability to split the coils of its pickups to have a single coil sound so it’s not able to mimic either Fender. That’s why back in the day, musicians would use all three in the studio, to have the broad range of sound that thankfully, we can achieve with just one guitar today due to modern improvements to the instruments. ",
            "date": "Answered April 18, 2019",
            "views": "232",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shawn Bailey",
                    "user_href": "/profile/Shawn-Bailey-16"
                },
                {
                    "user_id": "Iskender Sonmez",
                    "user_href": "/profile/Iskender-Sonmez"
                },
                {
                    "user_id": "Paul Reynolds",
                    "user_href": "/profile/Paul-Reynolds-50"
                },
                {
                    "user_id": "Cody C. Engdahl",
                    "user_href": "/profile/Cody-C-Engdahl"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Martin",
                "href": "/profile/James-Martin-2"
            },
            "answer_text": "None of them. If you want the sounds of all three, you’ll need all three. They can each cover a lot of ground. But, ain’t nothing like the real thing. ",
            "date": "Answered April 15, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                }
            ]
        }
    ]
}