{
    "title": "Pop Music: What is the longest song title of a contemporary hit song? - Quora",
    "tags": [
        "Music History",
        "Songwriting",
        "Pop Music",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Pennington",
                "href": "/profile/Jon-Pennington-1"
            },
            "answer_text": "I downloaded a spreadsheet of all hit songs ever to the US pop charts from bullfrogspond.com.  Then, I used the LENGTH function in Excel to determine what titles were the longest.  As you might have suspected, the longest song title in the rock & roll era (defined as 1955-2013) is a novelty song: \"Jeremiah Peabody's Poly Unsaturated Quick Dissolving Fast Acting Pleasant Tasting Green And Purple Pills,\" by Ray Stevens. Since I'm not sure what Quorans would define as \"contemporary,\" here are the longest non-novelty hit song titles for each decade from the 1950s to the 2010s. 1950s: The McGuire Sisters, \"Rhythm 'N' Blues (Mama's Got The Rhythm Papa's Got The Blues)\" 1960s: James Brown, \"I Don't Want Nobody To Give Me Nothing (Open Up The Door, I'll Get It Myself) (Part 1)\" 1970s: Talking Heads, \"Life During Wartime (This Ain't No Party..This Aint No Disco.. This Ain't No Foolin' Around)\" 1980s: R.E.M., \"It's The End of the World As We Know It (And I Feel Fine)\"  1990s: P.M. Dawn, \"Sometimes I Miss You So Much (Dedicated To The Christ Consciousness)\" 2000s: Panic! At the Disco, \"The Only Difference Between Martyrdom And Suicide Is Press Coverage\" 2010s: The Barden Bellas, \"Riff Off: Mickey/Like A Virgin/Hit Me With Your Best Shot/S&M/Let's  Talk About Sex/I'll Make Love To You/Feels Like The First Time/No  Diggity\" So except for Panic! At the Disco, it seems like the secret to having a really long song title is to either record a medley/mash-up of more than one song (like The Barden Bellas) or add some extra commentary in parenthetical phrases (like the McGuire Sisters, James Brown, Talking Heads, R.E.M. and P.M. Dawn). Update: Based on Steve Tamburello's answer, I updated my answer for the longest song title of the 1980s to include R.E.M.  My original spreadsheet of songs did not include the parenthetical \"(And I Feel Fine)\" that was included on the title of the original single. ",
            "date": "Updated December 14, 2013",
            "views": "27",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Jose Geraldo Gouvea",
                    "user_href": "/profile/Jose-Geraldo-Gouvea"
                },
                {
                    "user_id": "Lee Ballentine",
                    "user_href": "/profile/Lee-Ballentine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevi Holland",
                "href": "/profile/Trevi-Holland-1"
            },
            "answer_text": "The longest song title is “Regretting What I Said to You When You Called Me 11:00 On a Friday Morning to Tell Me that at 1:00 Friday Afternoon You’re Gonna Leave Your Office, Go Downstairs, Hail a Cab to Go Out to the Airport to Catch a Plane to Go Skiing in the Alps for Two Weeks, Not that I Wanted to Go With You, I Wasn’t Able to Leave Town, I’m Not a Very Good Skier, I Couldn’t Expect You to Pay My Way, But After Going Out With You for Three Years I Don’t Like Surprises” – Christine Lavin ",
            "date": "Answered October 12, 2017",
            "views": "852",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeroen De Wijn",
                    "user_href": "/profile/Jeroen-De-Wijn"
                }
            ]
        }
    ]
}