{
    "title": "Recently, I've realized that I love music, so much that I want to start writing music. Where should I start? - Quora",
    "tags": [
        "Music Appreciation",
        "Music Composition",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Harper",
                "href": "/profile/Todd-Harper-1"
            },
            "answer_text": "Jump in ! Maybe your instrument is your voice- sing some things and do your best to remember it. Maybe it’s piano. or…. when you mess around, and come up with a musical phrase, ( like a breathe, a sentence, a thought that isn’t too long, but not too short) figure out a way to remember it. Do it again, add to it. Listen to music you have never heard before, even if you don’t like it ! see what you can learn from it. Make up a notational system; then learn standard notation. It depends on your learning style… some folks want to be lead by the hand, others can jump in. Reading music is not that hard. It’s like reading words, but add pitch. left to right. mess around. then learn what you did, how to vary it, and complete it. Have Fun ! I have been at it about 60 years. I started singing before grade school. It’s a life long path,,, ",
            "date": "Answered October 21, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Guido Lois",
                "href": "/profile/Guido-Lois-1"
            },
            "answer_text": "Understand the genres and artists who influence what you would want to create yourself. Identify the instruments they use. Make a choice on one to start with and start trying to play some of their songs. Get tutorial help and routinely practice. When you feel comfortable enough with your instrument (depending on how dedicated you have been with your practicing) try to make your own songs. Then keep on creating more and more. Record them and learn how to produce recordings and over time your skills and knowledge will develop.  It takes years. The earlier you start the better.  Good luck :-) ",
            "date": "Answered January 30, 2014",
            "views": "445",
            "upvotes": "0"
        }
    ]
}