{
    "title": "Rishte Unhi Se BanaoJo Nibhane Ki Aukat Rakhte Hai? - Quora",
    "tags": [
        "Rakht (2004 movie)",
        "English Translation and Interpretation",
        "Hindi (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanya Verma",
                "href": "/profile/Tanya-Verma-136"
            },
            "answer_text": "Iska mtlb h ki rishte unhi se bnane chahiye jo hr kdm pr hmare sath khade ho. Na ki aise log jo samay k sath bdl jate h. Kyuki rishta k ye mtlb nhi ki aaj hmara waqt acha h toh ristedar hmare sath h aur agr bura waqt h toh log rishta bhool jay. Blki rishta toh wo hota h jaha log hr waqt ek dusre k sath khade ho…ek dusre ki madad kre…..samay bdle pr wo nhi….samay bura ho pr wo nhi. Wo sath hmare sath tb ho jb duniya hmare khilaf ho kyuki rishte k yhi mtlb hota h. Aise logo se rista rhkne k koi mtlb nhi jo samay k sath bdle…aur bure waqt m sath chhod de.Isliy rishta aise logo se rkho jo use nibha ske. ",
            "date": "Answered March 21, 2018",
            "views": "570",
            "upvotes": " Answer requested by Pradeep Sharma"
        },
        {
            "author_info": {
                "name": "Shikhar Jaiswal",
                "href": "/profile/Shikhar-Jaiswal-10"
            },
            "answer_text": "Ye question nhi lgta par agar dekha jaaye to kisi se rishta banna na hmare. As me nhi hota h ,hme lagta h ki hm ispe control kar sakte hain par agar imansaari se dekha jaaye to hm sirf apne aap se jhooth bol rhe hote hain… Aur rishte nibha e ki aukaat ha ya nhi isse farq nhi padta ,par koi rishte ko kitna jaruri samajhta hai usse farq padta ha ,hme kabhi kisi ke saath mazak nhi karna chahiye khaas kar inn cheezon me aur agar aap aisa kart hain to ek din aap ko aihsaas hoga aur tb tak bahut der ho chuki hogi.. Aap apni khud ki nazron me gir chuke honge ,iss liye ussi rishte ke liya haa karen jo aap nibhana chahte hon aur kabhi rishta jabardasti kisi oe force mt kariye balki usse jiye …. Hope u choose best… ",
            "date": "Answered March 21, 2018",
            "views": "214",
            "upvotes": " Answer requested by Pradeep Sharma"
        }
    ]
}