{
    "title": "Should I invest in Bitcoin? - Quora",
    "tags": [
        "Predictions",
        "Investing Advice",
        "Virtual Currencies",
        "Bitcoin",
        "Cryptocurrencies",
        "Investment Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Devin O'Keefe",
                "href": "/profile/Devin-OKeefe"
            },
            "answer_text": "When I first noticed Bitcoin, it was hovering around $11 in 2012. I tried to start mining, but quickly realized my Macbook Pro’s processing power wasn’t sufficient to justify the time and energy it would take to get up and running. I never mined a single Bitcoin, but I did quite a bit of research. I rapidly read articles on Bitcoin, its past and its future. I watched tutorials on how to mine Bitcoin and the mechanics of its payout system. I browsed all the major forums, for opinions from Bitcoin owners. This isn’t me trying to brag about my foresight in spotting Bitcoin before it became big. As a technology enthusiast, this was just one of the many tech crazes I explored. Many of these failed quietly or haven’t yet satisfied the hype (3D printing). If there was one consensus among Bitcoin owners in 2012, it was that they truly believed in Bitcoin. Enthusiasts foresaw the potential revolutionary impact of a de-centralized currency. Libertarians hoped for an end to the monopoly of the dollar. Despite its problems, the future looked bright, and early adopters invested on that premise. Today, many purchase BTC with no basis other than the gargantuan number beside the ticker and an exponential price chart. With every sharp increase, more and more speculators purchase BTC, with nothing but a hunch as vindication. Answers appear on Quora, where writers ‘guarantee’ BTC will rise to $25,000+. Yesterday, I talked to someone who purchased 1 BTC, at ~$12,500. He excitedly revealed that he had earned a 25% return within 24 hours, as BTC rose to $16,500. I interrupted to ask what had prompted him to buy BTC in the first place. His only response was that he saw the pattern of BTC’s growth and didn’t believe the profits would end anytime soon. My friend is normally a rational, intelligent person, whose opinions I seek and respect. As such, I was astounded to hear his speculation was based solely on a hunch. My response was simple. I showed him a chart of an even bigger growth stock than BTC, at the height of the tech bubble in 2000. At the height of its powers, Cisco was the largest company in the world. Like Bitcoin, for over a decade the stock had been exponentially rising, posting a 265,100% return between IPO and peak price.  But then the party stopped and the bubble burst. From 2000–2002, Cisco lost 88% of its value. The stock never fully recovered, and still lingers as a shadow of its former formidable self. Cisco isn’t an isolated example. History is filled with examples of ‘the next best thing’ with an astounding growth record but without the fundamentals to back up these crazy valuations. Tulipmania, the South Sea company and the Mississippi company are just some of these precedents. I then asked another simple question, to forget about the share price, and to imagine he could never sell the stock on an exchange. If he had to buy BTC at $16,500 and could never sell it on any exchange, would he be happy to hold BTC, as an investment which he could only use as a currency in shops, as he would the Euro or the US dollar? Would he be happy to use BTC for its intended purpose, not just to make a quick profit. I invite you to ask yourself the same question. BTC is currently worth a collective $267 billion. Do you believe that BTC could buy $267 billion worth of items, either online or in brick and mortar stores? You may strongly believe BTC will become accepted as a fiat currency, but even then what makes you believe each BTC will be worth more than it is today? Is it not already priced into the market? Considering the lack of assets or government guarantor to act as collateral, why is BTC worth more than the paper clip on my desk? These are all questions you have to ask before purchasing BTC. We’re in the middle of a 9 year bull market, the 2nd longest in history. Markets have been rising so long, they’ve all but forgotten the possibility of a crash. People are buying a ticker, without any consideration for the underlying asset. Ultimately, BTC is at its current price because no-one is certain it will go up or down. I believe it's grossly overvalued, and the underlying asset doesn't deserve a value of $267 billion. That's why I can't recommend investing in BTC. ",
            "date": "Answered December 9, 2017",
            "views": "2033",
            "upvotes": " View 2.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Riley",
                    "user_href": "/profile/Kevin-Riley-37"
                },
                {
                    "user_id": "Kelvin Kelvin",
                    "user_href": "/profile/Kelvin-Kelvin-198"
                },
                {
                    "user_id": "Sylvain Saurel",
                    "user_href": "/profile/Sylvain-Saurel-11"
                },
                {
                    "user_id": "MD SOBUJ ALI",
                    "user_href": "/profile/MD-SOBUJ-ALI-8"
                },
                {
                    "user_id": "Crypto Cribe",
                    "user_href": "/profile/Crypto-Cribe"
                },
                {
                    "user_id": "Zhen Rouroni",
                    "user_href": "/profile/Zhen-Rouroni"
                },
                {
                    "user_id": "Kanan Gupta",
                    "user_href": "/profile/Kanan-Gupta"
                },
                {
                    "user_id": "Tannaz Adib",
                    "user_href": "/profile/Tannaz-Adib"
                },
                {
                    "user_id": "Himanshu Bisht",
                    "user_href": "/profile/Himanshu-Bisht-393"
                },
                {
                    "user_id": "Sharon Dennison",
                    "user_href": "/profile/Sharon-Dennison-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Chetwani",
                "href": "/profile/Akash-Chetwani-1"
            },
            "answer_text": "Ahh Bitcoin. Buying one in 2010 at 0.08$ a coin would now make you 14000$ a coin for every coin that you bought. Which means if you invested 100$ into Bitcoins in 2010 they would be worth a whopping 17.5 million dollars today. Are bitcoins the future? Or are they going to crash and burn? Instead of telling you to invest in it or not, what I’m going to do is outline some facts about bitcoin as an investment and tell you about what happened with bubbles in the past. And then you can decide. Flashback no. 1 The Dot com bubble, 2000 Fueled by the rise of companies with a “.com” after their name, the “.com” bubble saw the price of the NASDAQ jump from 1000 to 5000 over 5 years. This was a 500% increase and was fueled by purely speculative investments. Fundamentals were thrown away. People were rushing to buy any internet based company, ignoring the fact that these companies wouldn’t be making any money for the next few years. Money was cheap. Funding was easy. A bubble was formed. And like all bubbles, it burst in 2001. Companies that had a market capitalization of hundreds of millions were now worth 0. The stock market rapidly declined. Trillions of dollars of investors money was lost. Flashback no. 2 The housing bubble, 2006/2007 After the recession the “.com” bubble caused, interest rates started to drop. Investors abandoned the stock market and turned to real estate. Lending requirements all but vanished. Housing prices started to go up. Speculators entered the market and made tens of thousands of dollars in weeks. A bubble was formed. And like all bubbles, it burst in 2007/2008 with the collapse of Lehmann Brothers, causing the largest recession in history since World War II. Millions of dollars were lost. Homes were destroyed. It took the economy years to recover. What is the definition of a “bubble” in finance? A “bubble” occurs when the price of a stock or investment is driven up to unsustainably high levels, substantially way more than what that item is worth. This bubble is usually caused by emotions of the masses, and not by logical investing or “looking at fundamentals”. And it always starts off as something that made sense in the beginning. Its exactly the same with Bitcoin. The price of Bitcoin has jumped 18,749,900% since 2010. It made sense to invest in it a few years ago. It was secure, unregulated and cryptocurrency seems like the future. But does it make sense to invest in it now? Yes, Bitcoin has its pros. It’s unregulated. Decentralized. Operates on Blockchain technology. But it’s also unregulated(see what I did there?). Has no intrinsic value. And it’s highly volatile. Look, I might even be wrong. There are people that have forecasted the price of Bitcoin to hit 100,000$ a coin in ten years. But I’m going to stay out of it. Warren Buffett has warned against it. Jamie Dimon has warned against it. Alan Greenspan compared it to gambling in Las Vegas. If you must invest in it, remember the golden rule of investing - Never invest more than what you’re willing to lose. If you absolutely must, no more than 10% of your portfolio must be invested in risky assets. Like the famous economist Paul Samuelson once said, “Investing should be like watching paint dry and watching grass grow. If you want excitement, take 100$ and go to Vegas”. EDIT: I seem to have gotten a lot of backlash for this answer. Guys, I understand were you all are coming from and I agree, 100%. Blockchain IS revolutionary. Cryptos are well designed to be the future of payments, and Blockchain is definitely not going away. But, this itself is not a reason to buy Bitcoin! This has happened in the past as well with Airline industries and tech industries. Yes, some of them have done well, exceedingly well. But that’s because they were good companies, with solid fundamentals and a good management team! It has nothing to do with the fact that they were “the future”. This answer is ONLY about whether you should make an investment in Bitcoin or not. Blockchain is an exceedingly innovative and futuristic technology, no doubt about that. I’m going to end this with a quote from Benjamin Graham, widely regarded as one of the best Investors of our time. “Obvious prospects for physical growth in an industry do not translate into obvious prospects for investors”. EDIT 2: For all the haters in the comments: This answer was first drafted when Bitcoin was at 14,000 USD a coin. The price of Bitcoin is now 6758 USD a coin. Once again - “Obvious prospects for physical growth in an industry do not translate into obvious prospects for investors”. Cheers. EDIT 3: Almost one year after writing this answer: The price of bitcoin is now 3704 USD a coin. It has fallen roughly 10,000 USD since this answer was written. ",
            "date": "Updated January 19, 2019",
            "views": "1427",
            "upvotes": " View 560 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emily Robert",
                    "user_href": "/profile/Emily-Robert-26"
                },
                {
                    "user_id": "Alice McCray",
                    "user_href": "/profile/Alice-McCray"
                },
                {
                    "user_id": "Ajay Malu",
                    "user_href": "/profile/Ajay-Malu"
                },
                {
                    "user_id": "Devon Lininger",
                    "user_href": "/profile/Devon-Lininger"
                },
                {
                    "user_id": "Akshay Mallya",
                    "user_href": "/profile/Akshay-Mallya-2"
                },
                {
                    "user_id": "Jane Gasslow",
                    "user_href": "/profile/Jane-Gasslow"
                },
                {
                    "user_id": "Sayak Bal",
                    "user_href": "/profile/Sayak-Bal"
                },
                {
                    "user_id": "Swapnadip Moni",
                    "user_href": "/profile/Swapnadip-Moni"
                },
                {
                    "user_id": "Anand Pierre Pakiam",
                    "user_href": "/profile/Anand-Pierre-Pakiam"
                },
                {
                    "user_id": "Miguel Nuno",
                    "user_href": "/profile/Miguel-Nuno-1"
                }
            ]
        }
    ]
}