{
    "title": "Should I become a music producer? - Quora",
    "tags": [
        "Music Producers",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Michuki",
                "href": "/profile/Michael-Michuki"
            },
            "answer_text": "Really simple bro, i am quite similar to you. I started the same way, and it was scary the first time. I didn’t even know how people record but i went out of my way to have fun with it. So i did a quick google search and found Audacity. I started by recording my first songs on Audacity and it was amazing because it felt so natural.Fear is there because its something you havent done before so your mind doesn’t have any reference what so ever of how to equate that you will have success. So start by defining what it is you wish to succeed with e.g. Like making 1 song, regardless of whether it sounds crappy and just do it. Here is me using my laptop to record my vocals over a beat.  It was really fun, i chopped up my vocals and just didn’t think too much about it. Once i was done, i put a small video of me having fun, the song is about recording music.  A few days later i downloaded Fl Studio and started messing around with it, just to see if i could make a beat, and just by trusting my intuition i was able to actually compose the beat that was playing in my head. Music is really easy, its just sounds stitched together like a sandwich. When you were small, you didn’t know how to do half of the things you are doing now even using a computer, there was a time it was hard but you learnt how to use it. So just do it, and do it and do it some more.  Recognize your fear and figure out why you are really scared are you afraid of what people with think about you? once you do : yell i dont give a fuck and just do it. You can follow me on my youtube channel if you are feeling discouraged, im learning too :D once step at a time. Finally after hours i produced my own songs  nothing will happen to you if you make a song, equally nothing will happen to you if you make a sandwich. So go ahead and make it. ",
            "date": "Answered November 25, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Pearson",
                    "user_href": "/profile/Scott-Pearson-123"
                },
                {
                    "user_id": "Albert Pop",
                    "user_href": "/profile/Albert-Pop-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Bowyer",
                "href": "/profile/Mark-Bowyer-2"
            },
            "answer_text": "I have a friend very much like you. He has an amazing natural musical ability, far beyond my own. It’s actually a little bit annoying to watch him pick up an instrument for the first time and be playing a recognisable tune on it in minutes! He is also an exceptional wood worker. He doesn’t really have any interest in making music despite this incredible natural talent, as he doesn’t experience the joy that others feel from playing, he gets that from his job as a cabinet maker. The point I’m making is, you shouldn’t feel obligated to do something, just because you are good at it. If you experience joy when playing around with music then you are extremely lucky, to have a natural talent at something you are also interested in! So do it! The term “producer” has evolved a little over the years and is often used in place of the correct term “composer”. Traditionally a Producer doesn’t actually write music, but assists others in making records. So maybe do a little reading and figure out which it is that you want to explore. You do need to be quite technically adept and naturally attracted to blinking lights to be a producer, so it could be that just playing an instrument would fulfil your needs rather than committing yourself to learning the broad spectrum of things that you need to master, to become a fully fledged producer. So, yes, if it’s something that interests you, then absolutely, start exploring and making music. DAWs can be downloaded for free, and beginner musical instruments are relatively cheap these days. All you need to do, is to get out there and do it. ",
            "date": "Answered January 18, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Connor Choong",
                    "user_href": "/profile/Connor-Choong-1"
                },
                {
                    "user_id": "Jesse Burch",
                    "user_href": "/profile/Jesse-Burch-1"
                },
                {
                    "user_id": "Superb Kang",
                    "user_href": "/profile/Superb-Kang"
                },
                {
                    "user_id": "Thomas Hammons Jr",
                    "user_href": "/profile/Thomas-Hammons-Jr"
                },
                {
                    "user_id": "Ashlyn Melody Ember",
                    "user_href": "/profile/Ashlyn-Melody-Ember"
                }
            ]
        }
    ]
}