{
    "title": "Should I write my own rap for a K-pop audition? If so, how can I tell it’s good enough? I will probably audition for YG Entertainment if it matters. - Quora",
    "tags": [
        "Korean Entertainment Agency",
        "Korean Entertainment Industry",
        "YG Entertainment",
        "Auditions",
        "Rap Music",
        "Entertainment",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Caitlin 맥킨지",
                "href": "/profile/Caitlin-맥킨지"
            },
            "answer_text": "I definitely think that’s a good idea, that will give you an advantage if you can write your own music, they will more likely be interested if you can show them something no one else has. Listen I know that people spend so long over analyzing and over thinking something that means a lot to them and it ends up being something different because we want to change it, it will never be perfect just like everything else in this world, the only way you can know if it’s good enough is if you believe it is, if you don’t thunk it’s good enough try again, when you are writing music make sure that it has meaning and that it connects with you in some way, don’t write about some random thing you know nothing about, make sure it has rhythm and that it stays on track and stays on pitch, make sure it’s catchy and preform with emotion, don’t look static and boring rap with emotion make the emotions come out of the judges, be yourself and don’t give up if you don’t succeed, I know that’s hard to follow but if you want to do this be strong and BELIEVE in you! ",
            "date": "Answered June 18, 2019",
            "views": "811",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daria Shipitsyna",
                    "user_href": "/profile/Daria-Shipitsyna"
                },
                {
                    "user_id": "Issy Huddleston",
                    "user_href": "/profile/Issy-Huddleston"
                },
                {
                    "user_id": "Helena Rachel",
                    "user_href": "/profile/Helena-Rachel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irene Ahn",
                "href": "/profile/Irene-Ahn-6"
            },
            "answer_text": "It’s definitely an advantage if you write your own music and/or lyrics since YG’s artists are known to be good with producing and writing. But, it is just as risky. If you can’t write good lyrics, then instead of getting plus points, you can be downvoted by the judges. So, if you’re a foreigner learning korean then I recommend that you don’t write korean lyrics. Writing good korean rap lyrics as a foreigner can get you major advantages but it’s not that easy. You can write the lyrics in English too if you want. It’s hard for Koreans to write good rap lyrics, but it’s even harder and riskier for foreigners. (And also never use a translator, they translate everything sound stiff and abnormal lol) And onto how you know if it would be enough.. you can show it to your friends or post it online to get opinions. Criticism from other people can improve your lyrics. Also, rhyming is good in a rap but make sure the lyrics actually makes sense when you just read it lol. ",
            "date": "Answered June 22, 2019",
            "views": "604",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amir Aviv",
                    "user_href": "/profile/Amir-Aviv"
                }
            ]
        }
    ]
}