{
    "title": "Should I change from clarinet to trumpet? - Quora",
    "tags": [
        "Band Directors",
        "Clarinets",
        "Trumpets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Kamp",
                "href": "/profile/Paul-Kamp-3"
            },
            "answer_text": "I only play trumpet, but from what my teachers and mentors have told me, brass is more difficult in general at the high school level. (to be fair, they all majored in trumpet performance) Brass players’ embouchure has to be maintained daily. Your lips and tongue are a whole new muscle that you’ve never worked out. (or at least, in the way that brass requires) At your level, you could easily catch up to your peers’ level of playing in months, if you really work at it. And you’ve just said that you find the music at your level easy. If you’re good at clarinet, use that to your advantage. You’re about to get to high school, and harder music. To me it seems like your problem is that you’re not being challenged. I felt the same way. Middle school is a time where the band is only as good as its worst member. High school brings a wider variety of bands and many new opportunities and challenges, as well as new music. As for your comment that there are only two trumpets, I wouldn’t look at that. I’m not sure how it stacks up to clarinets, but trumpet playing is very competitive. Everyone and their dog played trumpet in middle school. But I still wouldn’t factor that into a choice of whether to play any instrument or not. If you have a passion for it, you will want to work harder than the competition. Now, your choice depends on your plans for the future. Do you want to be a musician? Do you plan to continue to the high school level? Do you plan to play in college? My advice to you is not to quit anything. I quit piano as a youngster and regret it. I quit learning bagpipes and regret it. I still play trumpet and love it. Keep working on your clarinet, and challenges will come to you. If you want to try trumpet, go for it. It’s a beautiful instrument, with a wonderful history. ",
            "date": "Answered June 19, 2016",
            "views": "587",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/CwNplayz"
                },
                {
                    "user_id": "Aaron Hanson",
                    "user_href": "/profile/Aaron-Hanson-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Saulcy",
                "href": "/profile/Nick-Saulcy"
            },
            "answer_text": "As a first chair clarinet, you’re doing pretty well for yourself, congrats. I don’t think there’s a reason to switch for several reasons. My middle school band had 6th, 7th, and 8th graders in it, which meant that the music we played was pretty watered down so everyone could handle it. That won’t be the case in a year or two when you’re in high school.Concert bands are not the most fun groups to play in. They try to be like an orchestra, but they always seem like a lyrical marching band decided to sit down for awhile. Find a symphony-orchestra to play in, either at your school or in the community. A local community symphony restored my desire to play music. And created an abiding love for Dvorak. You’ll also have a marching band to be in too.If you stay on your instrument, you can get good. Think about all the muscle memory you’ve put into the clarinet fingerings. Now, trumpet isn’t the hardest thing in the world to learn, but you’d still have to start from the beginning. You’ll be better if you don’t switch.And if you must switch, try playing sax in a jazz group. Similar fingering, and the music is tons of fun (another restoration of my faith in performance music was from starting in the jazz band).You mentioned practicing over summer break. Find a community group to play in. I did a couple of performances one year with the Brass Band of Central Illinois over the summer just for kicks. It’s good experience.Now, as a trumpet player, I usually wouldn’t miss the chance to add a convert to our ranks (which are totally awesome, by the way), but I think that if you stick it out with the clarinet a little longer, get plenty of practice, and seek out opportunities to play in the community. Best of luck to you. References: a long time playing trumpet in more groups than I can remember (All State Orchestra, Illinois Symphony Orchestra, my collegiate symphony and concert band, as well as a handful of jazz groups and solo performances) ",
            "date": "Answered June 20, 2016",
            "views": "601",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cloe Talplacido",
                    "user_href": "/profile/Cloe-Talplacido"
                }
            ]
        }
    ]
}