{
    "title": "Should I audition for a K-pop company? - Quora",
    "tags": [
        "Auditions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Min-Hee Hwang",
                "href": "/profile/Min-Hee-Hwang"
            },
            "answer_text": "You should audition for a K-Pop company. Why? Because there is absolutely no harm in doing so. You seem just as qualified as any other girl auditioning is. Companies that I would suggest for you: Loen- They have a lot of sub-companies. This will increase your chances of debuting. For example, THE BOYZ are under a sub-company in LOEN. From what I remember, 2–3 out of their members are foreigners. Pledis- While PLEDIS is a terrible company, if you want a quicker and easier acceptance to be a trainee this is the company. They have multiple Chinese idols under their label. Who knows? Maybe if you make it on time, you might be able to replace Kyla.(who hasn’t actively participated in PRISTIN’s performances for a while). Yuehua- Yuehua is mainly a Chinese company but they also have global productions as well. There won’t be any ethnicity-based discrimination here. Yuehua is actually a pretty good company in general. Woolim- From what I remember, Woolim hasn’t debuted a new girl group in a while. There is a high chance that they are looking to take in trainees. Also, if you are accepted as a trainee, there is a high chance you will get to debut. Banana Culture- EXID is a very successful girl group. I wouldn’t be surprised if they would be trying to recreate EXID. Overall, try smaller companies when you debut. Try to learn BASIC singing/rapping. Honestly, if you’re not already a good singer, try to learn how to rap. AVOID BIG 3: SM: Already has enough girls to make a girl group. It’s not worth it to try to make that debut when they have so many girl trainees fighting for maybe 9 spots. JYP: They are already debuting a new girl group. Plus, they also have enough trainees to make a girl group. If you REALLY want to try a big 3 company, then you might as well try this one. YG: It’s not worth it. They take girl trainees and leave them out to dry. Just don’t. By the way, you might have a chance because they are looking for better looking idols. YG is slowly become a visuals company. ",
            "date": "Answered January 21, 2019",
            "views": "4",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kristy Huang",
                    "user_href": "/profile/Kristy-Huang-9"
                },
                {
                    "user_id": "Ljaneue Adibac",
                    "user_href": "/profile/Ljaneue-Adibac"
                },
                {
                    "user_id": "Rukhiya Sultana",
                    "user_href": "/profile/Rukhiya-Sultana-4"
                },
                {
                    "user_id": "Michelle Zeng",
                    "user_href": "/profile/Michelle-Zeng-15"
                },
                {
                    "user_id": "Dear Jeffery",
                    "user_href": "/profile/Dear-Jeffery"
                },
                {
                    "user_id": "Gaya Abergel",
                    "user_href": "/profile/Gaya-Abergel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hana-Song-69"
                },
                {
                    "user_id": "Lucas Chan",
                    "user_href": "/profile/Lucas-Chan-21"
                },
                {
                    "user_id": "Haru",
                    "user_href": "/profile/Haru-107"
                },
                {
                    "user_id": "Enya Wu",
                    "user_href": "/profile/Enya-Wu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Yates",
                "href": "/profile/Michael-Yates-165"
            },
            "answer_text": "Yes, yes you should. Companies are accepting more foreigners, especially East Asian, and you so happen to be Chinese. Why do I mention that? Well, they have a lot of Chinese idols and trainees, giving you a higher chance. Also, you clearly have the talent AND you’re learning Korean. You don’t need to know Korean when auditioning, but they consider a big bonus when a foreigner already knows it. A tip: Try learning at least some basic phrases in other Asian languages too. Especially Chinese and Japanese. Also, maybe learn sOMETHING on an instrument. They like trainees who know how to play one or two instruments. Anyways, with all of the reasons above, you should. Now, on to the second part: What companies should you audition for? I think JYP and YG are some good ones…but please..PLEASE don’t try for SM. SM treats their trainees and idols like crap, care too much about looks, have crazy diets, and makes most trainees/idols have plastic surgery. For you and your own mental/psychical health’s sake, don’t do it. Now on to why you should audition to JYP and YG! JYP: They treat their trainees/idols nicely, have people who are there if you need mental help, don’t do insane diets, don’t care about looks much, and have a pretty chill founder. YG: They also treat their trainees/idols pretty good, and they care about talent WAY more than they do looks. YG himself is also a nice guy. I would also like to note that they accept foreigners a lot more than other companies, especially YG. Also, if you don’t make it to either of them, try and try again (wait a little bit and improve, of course). JYP personally likes people who don’t give up too. And, if you feel like all hope’s lost with these companies, try Woolin or FNC. Woolin treats trainees and idols like family, FNC is pretty nice, and they’re both also more open to foreigners. Hope this helps! Maybe we can see each other as trainees if I somehow get in (I bet you will), and, even better- I hope I see you as a future idol jamming out to your groups’ songs XD Best of luck! ",
            "date": "Answered January 18, 2019",
            "views": "852",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristy Huang",
                    "user_href": "/profile/Kristy-Huang-9"
                },
                {
                    "user_id": "Ljaneue Adibac",
                    "user_href": "/profile/Ljaneue-Adibac"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Theodora-60"
                },
                {
                    "user_id": "Eulalia Voo",
                    "user_href": "/profile/Eulalia-Voo"
                },
                {
                    "user_id": "Sri Pramesti",
                    "user_href": "/profile/Sri-Pramesti"
                }
            ]
        }
    ]
}