{
    "title": "Should schools have an orchestra? - Quora",
    "tags": [
        "Symphony Orchestras",
        "Music Conductors",
        "Music Education",
        "Orchestral Music",
        "Classical Music",
        "Musicians",
        "Schools",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "JK Ramgem",
                "href": "/profile/JK-Ramgem"
            },
            "answer_text": "Yes. Schools should have an orchestra. Music is generally a stress releaser for kids. Orchestra time is time they are spending with their peers having fun, and also being productive at the same time. We were lucky that in our local high school the orchestra program was huge - about 1/3 of the entire school of about 900 was enrolled, and they had to break it up into multiple levels to keep it manageable. Which meant that there were the levels where beginner students with no musical background could experience being part of a musical ensemble, without getting in the way of more experienced players who were given repertoire that professional orchestras would play normally (maybe they were not as good, but they certainly reached for the sky). And then for the less musically inclined kids, there were all the other jobs that came with having an orchestra - managing the stage, sound, lights, recordings, - all of the auxiliary jobs that gave others some training in what it takes to run a stage. ",
            "date": "Answered September 24, 2020",
            "views": "24",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bobby Everson",
                    "user_href": "/profile/Bobby-Everson"
                },
                {
                    "user_id": "Priyambad Singh",
                    "user_href": "/profile/Priyambad-Singh-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helen Rupp",
                "href": "/profile/Helen-Rupp"
            },
            "answer_text": "Yes. …. oh, did I not say that loud enough? Y E S Playing an instrument at a young age has many benefits to the learning process, it’s scientifically proven that musicians are better at maths and english and are honestly just happier. I mean it seems strange considering how much we moan about practising but honestly music has thousands of health benefits, and also if you don’t have the orchestra at school you won’t have the orchestra in a concert hall. If we want to keep hearing orchestras playing film/game music or classical greats etc. the players need to start training asap, and at the moment they’re just not, and it’s a massive problem. When I was in the first year of my performing arts specialist school we had a full orchestra, a full big band, and several amazing ensembles. When I left several courses had been cut, the orchestra and big band had been combined to something much smaller, there were no new musicians, my year was the last year that had a reasonable amount of musicians coming into our college, and it’s only gotten worse since then. So yes, for the sake of classical music and the future musical geniuses, Schools should have an orchestra. Y. E. S. ",
            "date": "Answered September 24, 2020",
            "views": "81",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bobby Everson",
                    "user_href": "/profile/Bobby-Everson"
                },
                {
                    "user_id": "Chuck Collazzi",
                    "user_href": "/profile/Chuck-Collazzi"
                }
            ]
        }
    ]
}