{
    "title": "Should I buy Roland XPS10 or Korg Kross 61? - Quora",
    "tags": [
        "Roland Corporation",
        "Roland",
        "Korg Keyboards & Synthesizers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Satyen Sen",
                "href": "/profile/Satyen-Sen"
            },
            "answer_text": "There is no comparison between these keyboards. Roland XPS 10 is a programmable samble based synthesizer and its speciality lies with the Indian tones/voices and rhythms it provides. Korg Kross is a mobile synthesizer workstation. It also comes with 88 Keys with Natural weighted Hammer Action. Its Sound Engine outweighs Roland XPS 10. My Advice:- Choose Keyboard according to your usability and requirements.If you are beginner or performer xps 10 is just fine for you, But if you are into music creation and Sound editing Korg Kross is better.If you prefer Indian tones and rhythms or if you are (Bollwood) Cover Artist, XPS 10 would serve you better. If you need a keyboard for music production and creativity Korg Kross would be the right instrument to start with.It is slways better if you could lay your hands on one of them before buying, to see which of these suits you better.Happy Music ",
            "date": "Updated December 13, 2018",
            "views": "41",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "MANOJ PAWAR",
                    "user_href": "/profile/MANOJ-PAWAR-271"
                },
                {
                    "user_id": "Rogell Paradox",
                    "user_href": "/profile/Rogell-Paradox"
                },
                {
                    "user_id": "Madan Lal Ratan",
                    "user_href": "/profile/Madan-Lal-Ratan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alvaro Gregori",
                "href": "/profile/Alvaro-Gregori"
            },
            "answer_text": "The Korg Kross is a full featured workstation. That means it issues a sequencer and has some sound recording functions. While the Roland XPS10 is a basic rompler, with all the sounds but no sequencer at all. It you don’t need a sequencer to play live or recording your songs (i.e. you use a DAW) then choose the one you like the most. The XPS10 has oriental and latin versions (the Kross is plain western), so if that suits you. If you need to use sequences live and don’t want to carry a computer then choose the Kross. ",
            "date": "Answered September 1, 2017",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julian Abbott",
                    "user_href": "/profile/Julian-Abbott-2"
                },
                {
                    "user_id": "Felix FE",
                    "user_href": "/profile/Felix-FE"
                },
                {
                    "user_id": "Akshat Mishra",
                    "user_href": "/profile/Akshat-Mishra-90"
                }
            ]
        }
    ]
}