{
    "title": "Should I buy a semi acoustic guitar? - Quora",
    "tags": [
        "Acoustic Music",
        "Acoustic Guitars",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Russell",
                "href": "/profile/Matthew-Russell-5"
            },
            "answer_text": "The term \"semi-acoustic\" is deceptive- it's less confusing to call those guitars semi-hollow or hollowbody electric guitars, since that's a more accurate description of what they are. Fully hollow-bodied semi-acoustics are closer to acoustic guitars- semi-hollows have a solid wood block under the pickups and bridge that helps reduce feedback when used with an amplifier at high volume, but also reduces the effect of the hollow parts of the body on the guitar's tone. In most cases, semi-acoustics can't be used as acoustic guitars as their bodies don't generate enough volume. The sound and feel of a semi-acoustic is pretty much the same as an electric guitar. There's some tonal difference versus a solidbody electric- semis generally sound a little darker and more \"woody\", but you'll only hear it when the guitar is plugged in. So the question then becomes \"should I buy an electric guitar?\" No doubt that's already been tackled on Quora somewhere, but here's my take: Electric and acoustic guitars are very different animals. Yes, the basic principles are the same, but the instruments' capabilities are different and when you progress beyond the most basic elements, playing technique is quite different. If you aspire to play music that you've heard played on electric guitars, you're going to need an electric yourself, since a good deal of what you hear electric guitarists doing (wide string bends, long, sustaining notes, controlled feedback and distortion, fast runs and legato techniques- hammer-ons, pull offs, right hand tapping) can't be done- or can't be done anything like so easily- on an acoustic. Most guitarists I know play a little of both electric and acoustic. Many are much better at one than the other, a few are equally proficient at both. If you have the money to spend buying the gear and the desire, time and dedication to commit to learning, I say do it. You'll never \"master\" either instrument- there's always room to improve and new things to learn- but don't let your feeling that you haven't progressed enough on acoustic stop you trying electric guitar. Maybe you'll find that it comes more naturally to you... ",
            "date": "Answered September 12, 2013",
            "views": "69",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rick Entrikin",
                    "user_href": "/profile/Rick-Entrikin"
                },
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Anjani Kumar Singh",
                    "user_href": "/profile/Anjani-Kumar-Singh-26"
                },
                {
                    "user_id": "Amber Yadav",
                    "user_href": "/profile/Amber-Yadav"
                },
                {
                    "user_id": "Amit Pal",
                    "user_href": "/profile/Amit-Pal-1"
                },
                {
                    "user_id": "Bjorn Teo",
                    "user_href": "/profile/Bjorn-Teo"
                },
                {
                    "user_id": "Shaun Lee",
                    "user_href": "/profile/Shaun-Lee-9"
                },
                {
                    "user_id": "Sandra Lynn Mallo Adcock",
                    "user_href": "/profile/Sandra-Lynn-Mallo-Adcock"
                },
                {
                    "user_id": "Richard H. Schwartz",
                    "user_href": "/profile/Richard-H-Schwartz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence S. Joshi",
                "href": "/profile/Lawrence-S-Joshi"
            },
            "answer_text": "Yes, you should be buy a semi acoustic Guitar. The semi-acoustic guitar is like wise called the empty body electric guitar. Parts of the body are electric while others are empty like a conventional acoustic guitar. It has a sound box and one to a few electric pick-ups. Electric pickups are utilized to change over the picked mechanical sound into an electric sound which is then additionally intensified utilizing the instrument enhancer. Fabricated for the sole reason of improving the general volume of the guitar, semi-acoustics are exceptionally mainstream. Generally acknowledged as the crossover of electric and acoustic, semi-acoustic guitars can be played unplugged just as connected. Semi acoustic guitars deliver extraordinary symphonious lavishness a warm powerful with loads of support, adjusted midtones, and wonderful suggestions. The sound is more rich than a solidbody, while avoiding the input issues of hollowbodies on account of that middle square. It's an ideal sound for some jazz and blues performers, and they alongside numerous rockabilly specialists were among the first to grasp the ES-335. Esteeming their rich tonality, jazz guitarists, for example, Lee Ritenour and Larry Carlton just as blues artists like Otis Rush have reliably played semi acoustic guitars. ",
            "date": "Answered January 21, 2019",
            "views": "656",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joesph P. Tomlin",
                    "user_href": "/profile/Joesph-P-Tomlin"
                }
            ]
        }
    ]
}