{
    "title": "Should Eddie Van Halen be included with Jimmy Page, Steve Ray Vaughn, Eric Clapton, and Jimi Hendrix as one of the best of all time? - Quora",
    "tags": [
        "Jimmy Page (guitarist)",
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Eric Clapton",
        "Jimi Hendrix (musician)",
        "Guitarists",
        "Guitars",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Crutcher",
                "href": "/profile/Michael-Crutcher"
            },
            "answer_text": "Possibly. Eddie certainly influenced a legion of guitar players after him. He was pretty innovative in his approach. I would argue that Stevie Ray never played anything innovative, so I don’t know that he belongs in this list. Jimmy Page raised the playing field for guitar players, allowing for virtuosity and diversity which hadn’t been seen before in guitar playing. He played on lots of people’s records as a studio player, and could burn on the acoustic and in unique folk styles and unusual time signtures. Raised the bar. Clapton created the guitar hero. He certainly did his homework and stuck to his guns on wanting to play American Blues. He left a band on the verge of becoming world-famous because he wanted to play more obscure music and refused to bow to popular trends. He *left the music business* for about a year in order to practice and be better at playing the music he wanted to focus on. He then came back with John Mayall to help create one of the most influential blues records of all time, using recording techniques that were unheard of at the time in order to bring the guitar up in the mix and lead the way into the blues, even though he was not the lead singer of the group. His guitar playing led the way. Then creating the Power Trio with musicians from very different styles of music from his own, bringing them to new heights of improvisation, even though he may have been sometimes just trying to hold on during the ride. Turning into an above average vocalist, trying his hand at different styles of of playing, becoming a great songwriter, and putting together a band to record one of the most influential guitar records of all time alongside Duane Allman, recording orchestral movie soundtracks, leading the way to the Unplugged era with a groundbreaking record of live acoustic tracks, Clapton has had a career of innovation the likes of which no one else has come close. Hendrix took the Power Trio idea that Clapton spearheaded to new heights of sonic sensationalism. Hendrix played so much sound, he was an orchestra unto himself. With no real training, he learned the craft of brilliant songwriting, put it together with a head for live performance, Jimi discovered new and unusual recording techniques for what he heard in his head, lead the way for how effects pedals could be used in a musical way, defined using the jam as an artform(along with Clapton), while becoming the major influence not just on guitar players, but on all types of instrumentalists of all styles of music. He had plans to reach over the style barrier to create music with Miles Davis, Gil Evans, Paul McCartney, which never came to fruition. Stevie Ray didn’t do anything innovative. He rode on the shoulders of giants. He had great chops, but never defined a generation of music makers. A good portion of what he did that came across as “innovative” had been years before by Jimi. Eddie was certainly more innovative in his techniques of finger-tapping and sweep-picking. He allowed for guitar players to really focus on hot technique, but it really only affected rock players. Huge legions of rock players, but not more than the Jazz players that Pat Metheny influenced at about the same time. ",
            "date": "Answered April 26, 2020",
            "views": "696",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay S.Youngblood",
                    "user_href": "/profile/Jay-S-Youngblood"
                },
                {
                    "user_id": "Mark Chow Young",
                    "user_href": "/profile/Mark-Chow-Young"
                },
                {
                    "user_id": "Tim Hanson",
                    "user_href": "/profile/Tim-Hanson-4"
                },
                {
                    "user_id": "Lyle Hamer",
                    "user_href": "/profile/Lyle-Hamer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Curci",
                "href": "/profile/Jeff-Curci"
            },
            "answer_text": "Thanx for another A2A Jay ! I I am a classic lineup VH fan. Loved the DLR stuff…right up until Jump cam out. Eddie reminds me a lot of Jimi Hendrix. On the recordings he sound amazing..Live is another story. To my ears, the songs are just missing something. VH doesn’t do a lot of overdubs on their albums either. But I digress. Yes, Eddie needs to be included in those Greatest of all time arguments. He definitely inspired a generation to wanna pick up a guitar and play. To me that is a requirement to be included. He spawned a ton of new bands to overly use the righthand tapping technic and to use open chord phrasing's for rhythms. And let’s face it..the guy can rip. ",
            "date": "Answered April 27, 2020",
            "views": "326",
            "upvotes": " Answer requested by Jay S.Youngblood"
        }
    ]
}