{
    "title": "Should I learn how to play the cello or the viola? I have no car and maybe I intend to work with the instrument. - Quora",
    "tags": [
        "Violas",
        "Cellos",
        "String Instruments",
        "Violins",
        "Learning to Play Musical Instruments",
        "Classical Music",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Bingham",
                "href": "/profile/Steve-Bingham-1"
            },
            "answer_text": "Whether viola or cello, you should play what you love. Beyond portability, consider not only the sound of each instrument but the role each one plays in the orchestra, assuming orchestral playing is a goal. With both instruments, you will learn to play in more than one clef. And both instruments, like all orchestral strings, demand many hours of practice. About the sound, the viola is often described as “throaty” or “mellow.” By design it is an alto instrument, but capable of producing much higher, and somewhat lower pitches. Some claim it is difficult to stay in tune. The cello, on the other hand, is classically-speaking a bass voice, although it too may broaden its range into alto territory. The cello is described as most closely resembling “the male voice,” or more broadly, “the human voice.” Such descriptions are obviously quite subjective. About orchestral roles, the viola is almost always an inner voice, harmonizing with other strings. It is definitely not an instrument for one who seeks the limelight or aspires to dominate the melody. It is the quintessential “team-player” instrument. Compared to the cello, the solo repertoire is less extensive. The role of the cello was originally to play the bass line, doubled one octave lower by the “double” bass, a much larger instrument. In string quartet literature, the cello is always and only the bass. Many pieces have magnificent sections where the cello’s (more accurately, “celli”) are the melody, and more frequently still, the section that plays counter melody. About size and weight, obviously the viola is the smallest and lightest of the two. However, there are great backpack-style carriers manufactured for the cello that make long-distance walking quite comfortable. Good luck in your choice. You will not go wrong with either instrument. As I said: play what you love! ",
            "date": "Answered July 6, 2020",
            "views": "311",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Ezell",
                    "user_href": "/profile/David-Ezell-9"
                },
                {
                    "user_id": "James Miller",
                    "user_href": "/profile/James-Miller-1147"
                },
                {
                    "user_id": "Andrew Werner",
                    "user_href": "/profile/Andrew-Werner-5"
                },
                {
                    "user_id": "Pablo Santos",
                    "user_href": "/profile/Pablo-Santos-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Landy",
                "href": "/profile/Charlie-Landy"
            },
            "answer_text": "viola. unless you’re prepared to fork out a decent amount of money (several hundred to around a thousand dollars) for a hard shell case with wheels and quality backpack straps, cellos are a nightmare to transport. cases get more expensive with size, and the cheap soft shell cases will end up in damage to the bridge and bows during commute at the very least. keep in mind as well that cellos themselves are more expensive (for a broad comparison, your average student level violin costs around $450-$500AUD compared to $1500-$2000AUD for a student level cello) and therefore you’re risking more by settling on a lower quality case. viola costs tend to be more towards the violin end of this scale. while i prefer the bam cases for my violin while travelling on public transport (i wear mine like a backpack 99% of the time), there are more affordable, safer options for violas that don’t involve useless soft shells. you also need to bear in mind your aspirations with the instrument and what you want to play. there is significantly more repertoire for cello than viola, thanks to the fact that the viola only came into existence for the purpose of filling a pitch gap in the string section of the orchestra. the instrument itself is poorly designed, with the body actually not big enough to fully resonate the c string, and doesn’t have what we call a ‘dominant register’. without getting too complicated, you’d be able to clearly identify the dominant register in a violin (high, using e string) and on cello (low, using c string). if you’re looking for a solid source of everything from studies and etudes to concertos, cello is the way to go. most violists either start off as or have to learn violin, as that is the closest instrument with a breadth more resources (or they end up playing cello material transcribed to alto clef). the added bonus of cello as well is that you learn bass clef, tenor clef and treble clef within scores, and the ability to switch between them on sight, whereas viola sticks solely to alto clef. lastly, and this may not apply to you, but you might need to consider your body and its limits. i am a fairly small person at 4′9, and whilst my hands are hypermobile with long pinkies for their size i do struggle to reach the full fourth in first position on viola. i also struggle to hold them up, even with a quality shoulder rest, and find that any period of playing one longer than 5 or so minutes results in awful neck and shoulder cramps because the instrument is just too big and heavy to hold up with just my neck. cello largely negates the small hand issue because of its adjusted fingering pattern (1st, low 2nd, high 2nd, 3rd) and the posture allows for more sideways flexibility in the wrist. all in all, it’s a hugely personal decision that can’t be decided by some random on quora. weigh up your options and go from there. best of luck! ",
            "date": "Answered July 10, 2020",
            "views": "285",
            "upvotes": " Answer requested by Pablo Santos"
        }
    ]
}