{
    "title": "Singing is my passion- it's the only thing that lights a fire inside of me. It's my escape, but I'm horrible at it. I'm always out of tune and my voice just doesn't sound good in general. Should I just give up and move on? - Quora",
    "tags": [
        "Vocal Performance",
        "Singing Voice",
        "Passion",
        "Voice",
        "Singing",
        "Sound",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peri Collins",
                "href": "/profile/Peri-Collins-1"
            },
            "answer_text": "Singing is a skilled profession. The instrument is the singer's body, so it can be much more difficult to learn how to use it to make beautiful music than learning the piano, guitar or another instrument. How many hours do you think that great singers have invested in studying their craft and in practicing what they have been taught? Forget the 10,000 hour rule if you want to be great. Can most people learn the basics and carry a tune with that much time invested in working at it? Sure. Are they going to Amazon people with their voices, unlikely. How about the person who has not studied technique even a little, never sang in a choir and basically just Hope's that a good sound will come out of their body with minimal effort? Hello disappointment. If singing is someone's true passion, they don't have to ask strangers if they should continue. They work hard and learn everything that they can regardless of anyone who tells them to quit. My 7th grade choir teacher made me cry by telling me that I was never going to be a soloist and not even good enough to sing in an ensemble. My mother told me to work hard and prove that nasty old cow wrong. By the next year, I was in Germany with a much better choir teacher, and I was offered my choice of the two leading roles in our school musical. In 9th grade, I was selected to sing in a band. In 10th grade, I auditioned for a very prestigious choir and made it. I performed in all sorts of concerts around Germany. I continued to work at my craft and one of my scholarship offers after high school was to a prestigious university music program. I've sung with symphonies and bands, etc. If I had let myself quit trying because I got negative criticism after only three years of doing choral singing, I would have missed out on decades of amazing opportunities. ",
            "date": "Answered August 20, 2020",
            "views": "187",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alejandro Jusino",
                    "user_href": "/profile/Alejandro-Jusino"
                },
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Graham",
                "href": "/profile/Norman-Graham-6"
            },
            "answer_text": "NO! For one, when you sing with people who are better than you are, it makes you a better singer. So try to join a church choir. If you’re in school, see if the choir teacher will accept you into the school choir. 2. Pay for 1 voice lesson from a professional singer, and let them give you an honest opinion of whether they feel your voice can be trained to make it better. If it can, continue. If not, then it’s up to you whether you want to pursue it or not. 3. Don’t expect to get rich off of it. Many singers are star wannabes, but very few actually make it to stardom. Most people do not like their recorded voice. John Lennon of The Beatles said he never liked his. I’ve sang my entire life and never thought I was a good singer. Even when I recorded an album. I’ve won state competitions and sang with several groups over my lifetime and never thought I was a good singer. My advice to you is to never stop chasing your dreams, but get a regular job also and see where it goes from there. ",
            "date": "Answered August 20, 2020",
            "views": "38",
            "upvotes": " Answer requested by Bella Fay"
        }
    ]
}