{
    "title": "Singing: How do I develop vibrato fast? ( I want a personal experience ) - Quora",
    "tags": [
        "Vibrato",
        "Singing",
        "Understanding Self-Improvement",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlet Langford",
                "href": "/profile/Carlet-Langford"
            },
            "answer_text": "Well, they are right-vibrato comes in when the voice is well supported and fully relaxed. When the voice is well supported, and the mouth, jaw, tongue are relaxed, the more solid the vibrato. You shouldn't have to really \"create\" it. Based on my personal experience as a person who didn't have vibrato once upon a time, I would submit that you might not be as relaxed as you think you are. I know we all think we are, but we hold so much tension in our bodies in our day to day life, we aren't aware of what truly RELAXED feels like. I know, I've spent years training, and it is amazing what a truly relaxed feeling is. It took me a while to really understand what that relaxed feeling is supposed to feel like, and what proper support is supposed to feel like. I'm sure I drove my teacher crazy-but I literally couldn't at times tell I had tension in my throat or tongue or jaw because in everyday life, I carried it around unconsciously. If  your vocal apparatus is tensed up, and you aren't breathing correctly, you simply cannot produce a full sound-and that full sound will come with a vibrato. Part of singing is unlearning the tensions we carry around with us every day.  Your breath may not be as deep and as low as you think it is either. Now this is one area that is VERY hard to learn. Our everyday breathing habits tend to be shallow, and high up in the chest with very little support from the abdominal/intercostal muscles. Women, especially, tend to suck in their stomachs so they don't look fat, and we get used to walking around like that. But your abs have to be relaxed, which means, you have to get used to looking \"fat\".  But singing with support REQUIRES that the breathing be low, the throat be open, and that the abs are not tensed when inhaling.  The reason you probably aren't getting any results is because videos and books only go so far in helping you to diagnose yourself. If you truly want to do it right, you'll get a voice teacher. You need someone who can hear you and see you , and provide real time feedback and assistance, and that's what voice teachers do. A voice teacher will be able to help you to figure out what it feels like to sing correctly. He/she will look at how you're breathing. How your jaw looks. How your tongue looks. How you sound. And will give you feedback/help you figure out what the problem is. Books and videos don't do this. I too, went the books route. I have three books on singing technique and used them for years to try to teach myself. But I didn't make real progress until I got a teacher. I simply would not have been able to diagnose myself the way my teacher has been able to. Books and videos are great compliments if you are already using a vocal teacher. But by themselves, I don't recommend them, at least not if you are looking to REALLY learn to sing as well as you are capable of singing. ",
            "date": "Answered November 30, 2015",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                },
                {
                    "user_id": "Kevin Hernandez",
                    "user_href": "/profile/Kevin-Hernandez-309"
                },
                {
                    "user_id": "Hanna Dingo",
                    "user_href": "/profile/Hanna-Dingo"
                },
                {
                    "user_id": "Lucas Sebastião De Almeida Castro",
                    "user_href": "/profile/Lucas-Sebastião-De-Almeida-Castro"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Kerr",
                "href": "/profile/Rob-Kerr-3"
            },
            "answer_text": "A voice's natural vibrato tends to announce itself pretty unambiguously.  It will generally be when you are singing at the top of your voice, with  good technique and support, but are then asked for another 'f' on that 'fortissimo possibile'.  You relax and go for it, can belto.  Your voice is, after all, creating waves: soundwaves.  The oscillation that is part of every wave form simply becomes audible.  Then you learn to control it (or not, as the case may be). But you've asked how you can develop yours quickly.  Well, you can!  Currently you sing with a straight tone.  Imagine, instead of a continuous column of air flowing from you via your mouth, that instead that column pulses slightly, regularly.  Make the sound pulse.  It should do so in a musical way, of course, so don't make large, obvious pulses when the music you're singing is quiet.  And similarly, subtle, understated pulses will be lost in a loud, fast passage. Finally, pay attention to how string players use vibrato.  They do not do so indiscriminately.  Vibrato as a technique is most powerful when deployed sparingly, to heighten emotional climaxes.  Don't use it too early. Listen to Whitney Houston here singing I Have Nothing. Whitney was a mistress of judging vibrato.  Listen to how her vibrato changes from the soft shading of the verse, to straight tone in the bridge, ramping up as she gets to the chorus.  Listen in particular for when she starts a long note straight, only to add vibrato at the end.  And enjoy!   ",
            "date": "Answered November 25, 2015",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                }
            ]
        }
    ]
}