{
    "title": "The drum sounds by the Beatles sounds very unique. Did Ringo tune his drums to the band mates instruments, and did he change tune for different songs? - Quora",
    "tags": [
        "Ringo Starr",
        "Drums",
        "The Beatles (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ray Frigon",
                "href": "/profile/Ray-Frigon"
            },
            "answer_text": "Back then, toms were mounted by brackets attached to the shells and it constricted tone. Some lower lines of drums still use that method of mounting. His drums sound different than most recordings today but, back then his Ludwigs sounded pretty much the same as other manufactured drums of the same sizes and heads. Tunings were generally higher then. And Ringo used pretty light sticks, as well, compared to models today. He also had a very light touch, which is almost unheard of today in pop music. And he’s left handed but, played a right handed setup which he found ways to navigate but, that effected the sound as well - his attack and tone. He began with a four piece kit and went to five on later recordings. Ringo did something that changed the world of drumming. He took the bottom heads off his toms and kick and put towels on them, and stuffed his kick. For most it was a flannel strip on batter and reso head. That was standard then. It is claimed Ringo is responsible for that change. Hal Blaine had been using concert toms on recordings but, Ringo’s influence caused the era of ‘dead’ drums. I went through my concert tom phase. I disliked that sound and left it but, it brought on twin ply heads, Evans oil heads, all kind of muffling devices; anything to deaden the drums. The sound of muted, single headed drums was everywhere. Then, time passed and things went to a very open sound and doing everything possible to allow the drums to vibrate as freely as possible, which is the prominent sound today. Just the same, today it’s all the above - vintage sound, modern sounds but, for the most part Ringo’s drums sounded like most back in the 60’s for pop music. Hard Rock came in: Ginger Baker, Keith Moon, John Bonham, Ian Paice, and things got big sounding yet, Ringo made a move that effected just about every genre in music, save for straight jazz drumming. And even some jazz artists went with single heads. ",
            "date": "Answered January 27, 2018",
            "views": "199",
            "upvotes": " View 114 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeffrey Hiday",
                    "user_href": "/profile/Jeffrey-Hiday"
                },
                {
                    "user_id": "Denizhan Sarıhan",
                    "user_href": "/profile/Denizhan-Sarıhan"
                },
                {
                    "user_id": "RJ Holland",
                    "user_href": "/profile/RJ-Holland-6"
                },
                {
                    "user_id": "David Hathaway",
                    "user_href": "/profile/David-Hathaway-30"
                },
                {
                    "user_id": "Pat Crowley",
                    "user_href": "/profile/Pat-Crowley-15"
                },
                {
                    "user_id": "David Parsons",
                    "user_href": "/profile/David-Parsons-82"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Connor McCain",
                    "user_href": "/profile/Connor-McCain-1"
                },
                {
                    "user_id": "Nick Erb",
                    "user_href": "/profile/Nick-Erb-1"
                },
                {
                    "user_id": "Sami Jarbouh",
                    "user_href": "/profile/Sami-Jarbouh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Weinstein",
                "href": "/profile/Jeff-Weinstein-15"
            },
            "answer_text": "Mr. Frigon gives an excellent account of Ringo's drumming regimen. I'd like to add that: Ringo's sound was also affected by placing dampened towels on his toms and snare at times. The drum mic-ing techniques The Beatles experimented with in the studio also had a demonstratable effect on the overall sound as well. They would mic the individual drums, there would be an overhead mike to catch the total drum kit sound and then they'd have another overhead mike that was poised in a hallway of the studio or at a long distance away. The combined effect was a greater sense of realism of sound (that was more three-dimensional), which I find much more pleasurable than the over-dramatized sound created from today's digital recording, where the separation of each drum is so intimate sounding that, although much clearer and resonant sounding, is usually separated in a way that sounds like the drums do when they are played alone, without any other musical accompaniment. This is not natural because people never hear drums like this in a live performance. The specific drum sound and the ambiance is far too crisp and clean, which makes it sound artificial if not unnatural. This does not enhance the performance of the song, but is a distraction. The drums should blend with the overall sound, not stand out as if being played solo. The Beatles recordings enjoyed the realism of a live performance without the drums sounding blurred. It was the perfect medium. ",
            "date": "Answered February 2, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeffrey Hiday",
                    "user_href": "/profile/Jeffrey-Hiday"
                },
                {
                    "user_id": "Ray Fischer",
                    "user_href": "/profile/Ray-Fischer-3"
                },
                {
                    "user_id": "Jesse Burch",
                    "user_href": "/profile/Jesse-Burch-1"
                },
                {
                    "user_id": "Kelly Logan",
                    "user_href": "/profile/Kelly-Logan-10"
                }
            ]
        }
    ]
}