{
    "title": "The left side of my throat hurts after singing. Why could this be? - Quora",
    "tags": [
        "Otolaryngology (medical speciality)",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Chandler",
                "href": "/profile/Kim-Chandler-3"
            },
            "answer_text": "You really probably should see a doctor, but if it’s hurting only on one side you may have an infection that’s currently only affecting that side. Is the pain muscular in origin or does it feel acidy and infected? If it’s muscular, then the way you’re using your voice may be the culprit (and you may be hyper-functional on one side). Has your voice deteriorated along with this pain, i.e. husky, lower, reduced upper range, cutting in & out? If it has then honestly you’d likely be doing more harm than good to continue on with this performance, despite it being short. If your voice still sounds normal then perhaps you could rest it all day today and see how it is tomorrow. ",
            "date": "Answered September 4, 2016",
            "views": "101",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daryl Hopkins",
                    "user_href": "/profile/Daryl-Hopkins-11"
                },
                {
                    "user_id": "CG",
                    "user_href": "/profile/CG-83"
                },
                {
                    "user_id": "SakthiRam Shaggy",
                    "user_href": "/profile/SakthiRam-Shaggy"
                },
                {
                    "user_id": "Salman Haider",
                    "user_href": "/profile/Salman-Haider-63"
                },
                {
                    "user_id": "Destiney Creal",
                    "user_href": "/profile/Destiney-Creal"
                },
                {
                    "user_id": "Stephanie Hodgdon",
                    "user_href": "/profile/Stephanie-Hodgdon-1"
                },
                {
                    "user_id": "Mela Us",
                    "user_href": "/profile/Mela-Us"
                }
            ]
        },
        {
            "author_info": {
                "name": "Addison Clark",
                "href": "/profile/Addison-Clark-5"
            },
            "answer_text": "Most likely, you are straining either your larynx or your vocal folds are not closing properly. I suggest going to an ENT doctor (who specializes in singers) and get a clear understanding of anything anatomically incorrect. I also suggest going to a voice teacher, as well as looking up some vocal function excercises. Vocal health is incredibly important and you want to take every measure you can to ensure that you aren’t doing irreversible damage. Hope that helps :) ",
            "date": "Answered March 28, 2018",
            "views": "31",
            "upvotes": "0"
        }
    ]
}