{
    "title": "To those listening to music right now, what song and what artist? - Quora",
    "tags": [
        "Money (magazine)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angeli Alcovindas",
                "href": "/profile/Angeli-Alcovindas-1"
            },
            "answer_text": "“Someone To Stay” is an ethereal song by Vancouver Sleep Clinic. It talks about loving and the desire to have that love reciprocated. I love how the song is so vulnerable, it shows how open a person can be when loving — an exposure of the soul — it made the words Can you keep me close? Can you love me most? set a mood of yearning and a taste of love’s paradox. Vancouver Sleep Clinic The stage name of the indie act, ambient singer, songwriter and record producer Tim Bettinson, told The Guardian, “when I first starting [sic] writing for this project, I felt like it could be the type of atmospheric music that people could fall asleep to…”.  Hailing from Brisbane, Australia, Bettinson grew up jamming on his dad's Eagles and Fleetwood Mac records but he got his lightning bolt when he heard of Bon Iver's For Emma, Forever Ago and Sigur Ros' Valtari — from that moment, he knew he wanted to make music and not just listen to it. Below are the lyrics to his song “ Someone To Stay” You were alone, left out in the coldClinging to the ruin of your broken heartToo lost and hurting to carry your loadWe all need someone to hold You’ve been fighting the memory, on your ownNothing worsens; nothing growsI know how it feels being by yourself in the rainWe all need someone to stayWe all need someone to stay Hear you, falling and lonely, cry out:Will you fix me up? Will you show me hope?At the end of the day it will help usCan you keep me close? Can you love me most? You’ve drunk it down and you’ve spat it outAnd nothing tastes like the things you hadSo turn it off, why don’t you let them go?We all need someone to stayWe all need someone to stay Hear you, falling and lonely, cry outWill you fix me up? Will you show me hope?At the end of the day it will help usCan you keep me close? Can you love me most?Can you keep me close? Can you love me most?Can you keep me close? Can you love me most? You were alone, left out in the coldClinging to the ruin of your broken heartYou were falling and lonely, cry out:Will you fix me up? Will you show me hope?At the end of the day it will help usCan you keep me close? Can you love me? Hear you falling and lonely cry out:Will you fix me up? Will you show me hope?At the end of the day it will help usCan you keep me close? Can you love me most?Can you keep me close? Can you love me most?Can you keep me close? Can you love me most With a music that is soothing, rich vocals accompanied with deep and meaningful lyrics, nothing can get even better than this. Listen here: Vancouver Sleep Clinic - Someone to Stay (Audio) ",
            "date": "Answered June 3, 2017",
            "views": "18",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaivya Singh",
                    "user_href": "/profile/Shaivya-Singh-4"
                },
                {
                    "user_id": "Mark Sprinkle",
                    "user_href": "/profile/Mark-Sprinkle-4"
                },
                {
                    "user_id": "Selena",
                    "user_href": "/profile/Selena-270"
                },
                {
                    "user_id": "Arjun Mehta",
                    "user_href": "/profile/Arjun-Mehta-107"
                },
                {
                    "user_id": "Ilko Birov",
                    "user_href": "/profile/Ilko-Birov-1"
                },
                {
                    "user_id": "Joshua Adrian Sadaba",
                    "user_href": "/profile/Joshua-Adrian-Sadaba"
                },
                {
                    "user_id": "Shanto Mathew",
                    "user_href": "/profile/Shanto-Mathew-1"
                },
                {
                    "user_id": "Imaobong Enobong",
                    "user_href": "/profile/Imaobong-Enobong"
                },
                {
                    "user_id": "Krisha Beral",
                    "user_href": "/profile/Krisha-Beral"
                },
                {
                    "user_id": "Jomar Baquiran Salim",
                    "user_href": "/profile/Jomar-Baquiran-Salim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skyler Oaksen",
                "href": "/profile/Skyler-Oaksen-2"
            },
            "answer_text": "Well, right now I'm listening to a couple different songs. #1 is a cover of a song, performed by my favorite vocalist. The song is “\"Paper Hearts” by Tori Kelly, performed by Jeon Jungkook, a rather popular singer. Jung Kook - \"Paper Hearts\" (COVER) Lyrics Another is a song by one of my favorite bands. “\"Highlight” by SEVENTEEN. (Yes, there are 13 people in this band) [Choreography Video] SEVENTEEN(세븐틴)-HIGHLIGHT (13Member ver.) A third is a cover of an older song called Rainism, performed by my absolute favorite band, BTS 【TVPP】BTS - Rainism, 방탄소년단 – 레이니즘 @2016 KMF Last but most definitely not least, a rap mixtape by my favorite rapper, Suga/Agust D, that takes his namesake, Agust D Agust D 'Agust D' MV ",
            "date": "Answered February 24, 2017",
            "views": "306",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/l-e-y-a"
                },
                {
                    "user_id": "Luna Ice",
                    "user_href": "/profile/Luna-Ice"
                }
            ]
        }
    ]
}