{
    "title": "To what degree did composers from the Classical and Baroque periods express their own personal feelings in music? - Quora",
    "tags": [
        "Contemporary Classical Music",
        "Composers",
        "Music Composition",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "I think the perception that Baroque and Classical composers were categorically more emotionally sterile than their successors is in part an aberration. It’s a little like a heroin addict saying, “Yeah, pot just doesn’t do it for me anymore.” There is some seriously glorious affect in the music of the Romantic Era and beyond, thanks to looser construction, louder instruments, bigger ensembles, a closer relationship with dissonance, and socioeconomic change in the culture. I eat it up, truly—but it can be desensitizing. To place the Mozart Clarinet Concerto or the Haydn F minor Variations next to the Tchaikovsky B-flat minor Piano Concerto or the Rachmaninoff Rhapsody is like trying to stargaze from within Chicago’s Magic Mile. There is a difference between magnitude and apparent magnitude; it is chiefly one of distance. This is not to mention that the ambient noise in 2017 Chicago is a lot louder than that of 1767 Vienna, and I think this shows in the way that people experience music, and in what they now expect from it. Indeed, that difference is closely related to the whole thrust of Romanticism, not only in music, but in art and literature as well. Romanticism is in general a reaction to being unable to hear one’s own thoughts. There is certainly some truth to the idea that high Classicism entails an emphasis on restraint, on containment. But it is the mode and manner of expression which vary over time, not the very presence of emotion. One has only to loosen the corset a tad and tip an extra glass of wine, and the minuet becomes a scherzo—but if there had been no tension trapped in the dainty minuet, then the transformation would not have been potentiated at all. Keep in mind that, through history, these things tend to swing back and forth like a pendulum. In some of the dance music of the Renaissance and Baroque, there is some right vigorous sensuality up in here, up in here, clear the dance floor, pump up the volume. Writing in his Treatise on the True Art of Clavier-Playing (1753), Carl Philipp Emmanuel Bach has the following to say: A musician cannot move others unless he too is moved. He must of necessity feel all of the affects that he hopes to arouse in his audience, for the revealing of his own humour will stimulate a like humour in the listener. Constantly varying the passions, he will barely quiet one before he rouses another. Above all, he must discharge this office in a piece which is highly expressive by nature, whether by him or someone else. In the latter case he must make certain that he assumes the emotion which the composer intended in writing it. This from a Lutheran reared by the Cantor of Leipzig himself! Ach, Herr. The really interesting part of this question is the distinction of the composer’s own personal feelings. I see no reason that an expressive composer is necessarily always a sincere one, whether we are discussing Bach or Berlioz. The artist can (and should) be a bit of black box in this respect. Perhaps a great actress can get under your skin through sheer technique, you know? It might not be at all required that she viscerally live and wholly believe the emotions she is portraying—as much as it may comfort us to think so. It sometimes happens that we can see from the record of correspondence and secondhand anecdotes what a composer was going through in life at the time he was working on a particular piece of music. Given this, it seems certain that the agitated and plaintive A minor piano sonata of Mozart, K. 310, was intimately informed by the recent unexpected death of his mother, for but one example. In immature Mozart, the presiding sentiment often seems to be simply Yay me!, but this is not so at all in his later work. Are composers always really emotionally invested in their music, in any period of the literature? No. And we can’t reliably tell the difference. But I have always found the contained language and gentle sonorities of earlier eras extraordinarily appealing in a way that Debussy and Mahler are not, as much as I hardcore adore both of them—and this appeal is distinctly due to the expressive power of the old ways, not any lack thereof: the hoot of an owl and the crunch of a leaf underfoot in an otherwise silent woodland hollow. ",
            "date": "Answered May 23, 2017",
            "views": "13",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saul Tobin",
                    "user_href": "/profile/Saul-Tobin"
                },
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Chris Pert",
                    "user_href": "/profile/Chris-Pert-1"
                },
                {
                    "user_id": "Michelle Harris",
                    "user_href": "/profile/Michelle-Harris-159"
                },
                {
                    "user_id": "Katja Kaila",
                    "user_href": "/profile/Katja-Kaila"
                },
                {
                    "user_id": "Gilles Zimmermann",
                    "user_href": "/profile/Gilles-Zimmermann"
                },
                {
                    "user_id": "Mark Dundore",
                    "user_href": "/profile/Mark-Dundore"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-8"
                },
                {
                    "user_id": "Tom Higgins",
                    "user_href": "/profile/Tom-Higgins-20"
                },
                {
                    "user_id": "Jam Ba",
                    "user_href": "/profile/Jam-Ba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Fretwell",
                "href": "/profile/Dan-Fretwell-1"
            },
            "answer_text": "Pretty heavily, albeit differently to how composers would express their feelings in modern day music. You can see this in effect by listening to two very different composers (take Arcangelo Corelli and J.S.Bach) and you can see that their musical writing styles are clearly different. Despite coming from similar eras of music (Corelli having been born 30 years prior to Bach) you can see the influences and feelings expressed in their works, and indeed the types of arrangements written. In this example, Corelli helped to develop the string family, establishing the violin in place of the viol, whereas Bach was key for his adaptation of German styles, using those styles with other compositional tehniques from abroad. I might have strayed from the question slightly, but it’s not as easy as asking these people! Key influences and personal feelings can be ascertained from their compositional style and what techniques they developed or influenced. A strong, more modern example of personal feelings being expressed in music is that of Shostakovich, who was forced to unwillingly join the Soviet Union, and wrote his 8th string quartet after visiting Dresden to compose for a fictional Soviet film, and seeing the ruin there. ",
            "date": "Answered May 23, 2017",
            "views": "186",
            "upvotes": "0"
        }
    ]
}