{
    "title": "Was 'Mr. Roboto' by Styx popular in Japan? - Quora",
    "tags": [
        "Styx (band)",
        "Classic Rock Music",
        "Rock Bands",
        "Culture of Japan",
        "Bands (music)",
        "Rock Music",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Farr",
                "href": "/profile/Brian-Farr"
            },
            "answer_text": "I would say probably not. If it were, my internet research, ahem, should have turned up something, anything. Despite the opening sequence of the song being in Japanese, there's no evidence the song charted there, despite reaching #3 in the U.S. on the Billboard Hot 100 in 1983. Styx did not leave the continental U.S. on their supporting \"Kilroy Was Here\" tour that year, despite playing 59 dates. Having lived there in Japan, I do not recall ever hearing anyone mention Styx or this song, or hearing it played. Bands that toured regularly in the 1970s and 1980s are still mentioned and played often, and heard regularly. Groups such as Simon and Garfunkel, Deep Purple, and the Carpenters still enjoy this status there. Now, it is likely that some people are aware of or have heard this song at some point due to its Japanese lyrical content. As another answerer mentioned, it was used to open a 2005 TV show (though Wikipedia states only the first episode), and a little known Japanese band covered this song in 2002. Mr. Roboto known in Japan? Maybe. Well known? Doubtful. Popular? Highly unlikely, in my opinion. Edit: as further evidence, I asked my Japanese wife if she knew this song growing up there (born in 1967, so she'd have been 16 when it came out). She said she'd never heard it before listening to it on an American classic rock channel in the early 21st century. http://en.m.wikipedia.org/wiki/Mr._Roboto ",
            "date": "Updated April 25, 2020",
            "views": "22",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juan Carlos Duarte",
                    "user_href": "/profile/Juan-Carlos-Duarte-1"
                },
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                },
                {
                    "user_id": "Jay Dub",
                    "user_href": "/profile/Jay-Dub-15"
                },
                {
                    "user_id": "Haza Delano",
                    "user_href": "/profile/Haza-Delano"
                },
                {
                    "user_id": "Necia Dallas",
                    "user_href": "/profile/Necia-Dallas"
                },
                {
                    "user_id": "Sed Chapman",
                    "user_href": "/profile/Sed-Chapman"
                },
                {
                    "user_id": "Brome Inay",
                    "user_href": "/profile/Brome-Inay"
                },
                {
                    "user_id": "Sunderi Mehta",
                    "user_href": "/profile/Sunderi-Mehta-1"
                },
                {
                    "user_id": "Zhōng Jiăndān",
                    "user_href": "/profile/Zhōng-Jiăndān"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Wright",
                "href": "/profile/Steve-Wright-12"
            },
            "answer_text": "Among Japanese who paid close attention to US popular music in 1983, both Styx and Mr Roboto were known.  My cooperating teachers in Hokkaido all knew it when I suggested a few American tunes that our students might enjoy- this was back in 1996 and 1997. Please remember what was possible in 1983: no internet, much fewer J tourists in the US, and vice versa, and groups like Styx just didn't grab the attention of young Japanese as they did in America.  In the late 1990s the internet was coming into its own in Japan, Styx was a permanent fixture in American rock, and there had been all sorts of tourists both ways that had cross-pollinated pop music.   I bought my Styx Mr Roboto CD in Japan- CDs were still pretty new fangled when I got here. ",
            "date": "Answered March 8, 2015",
            "views": "873",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Dub",
                    "user_href": "/profile/Jay-Dub-15"
                },
                {
                    "user_id": "Haza Delano",
                    "user_href": "/profile/Haza-Delano"
                },
                {
                    "user_id": "Edison Garcia",
                    "user_href": "/profile/Edison-Garcia-3"
                },
                {
                    "user_id": "Brian Farr",
                    "user_href": "/profile/Brian-Farr"
                },
                {
                    "user_id": "Sunderi Mehta",
                    "user_href": "/profile/Sunderi-Mehta-1"
                }
            ]
        }
    ]
}