{
    "title": "Was Paul McCartney a good bass player? - Quora",
    "tags": [
        "Bass Guitarists",
        "Bass (sound)",
        "Bass Guitar",
        "Paul McCartney",
        "The Beatles (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kitchener",
                "href": "/profile/Jeff-Kitchener-1"
            },
            "answer_text": "Yes, Paul McCartney is a good bass player. Unfortunately, as most of the previous answers indicate, he is definitely not the best bass player of all time. Almost anyone who plays bass could tell you that. Playing an instrument and singing is perhaps not a simple task, but not beyond the grasp of pretty much anyone if they practice for a year or two to be comfortable at. Similarly, he does have some funky basslines, but nothing that’s really all that difficult. That said, it’s fine to be a huge fan of his. If you really enjoy his style and songwriting then cool. He certainly is someone with plenty of experience playing and composing with bass. He can certainly do interesting things while also providing a great accompaniment and complement to what the rest of a band is doing. Also he is clearly a huge influence for most of modern rock bassists. Even for those who do not see him as a direct influence, few would not be influenced by those who ere influenced by him. But any claiming he is the best is probably a huge fan of him or the Beatles. As one poster notes, the Rolling Stones bassist is also highly rated. These are popularity contests. ",
            "date": "Answered December 25, 2019",
            "views": "322",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ildaf Narfa",
                "href": "/profile/Ildaf-Narfa"
            },
            "answer_text": "Paul McCartney is ranked as 3rd greatest bassist of all time on bassplayer site, rolling stones, as well numerous others as one of the greatest. This should not even be a question. Many bass player recognized his influence and greatness as bass player.Especially his melodical approach, innovative, and unique walking bass line. You’ve got to remember, when Paul started using bass on early 60’s, electric bass only been around for 10 years, and playing bass kinda look down back then.Also bass playing is not as developed as now. Many bass playing back then is just elementary and complementary, just sticking to the root chord. So Paul didn’t have much to look up to, he mainly improvise. He did got some influence from James Jamerson. Paul play his part to changed this, and bass became more prominent instrument. Check this video.  ",
            "date": "Answered April 2, 2019",
            "views": "679",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                }
            ]
        }
    ]
}