{
    "title": "Was Freddie Mercury well endowed? - Quora",
    "tags": [
        "Freddie Mercury"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Meadows",
                "href": "/profile/Robin-Meadows-15"
            },
            "answer_text": "According to his PA he was huuggee. Lol. (That’s how he said it in an interview.) And according to former lovers who have been interviewed. Not offended by the question because apparently he would want you to know judging by his going commando at Live Aid—televised in over 70 countries and to upwards of a billion people. Found a way to be “outrageous” all right. But then he out-Freddied himself and gave such a spectacular performance that hardly anyone even thinks about this rather shocking display when recalling the performance. Some may have not even noticed as I didn’t until I watched it several times because all I could see is that beautiful face and smile showing us how much he loved performing and that he didn’t take himself seriously. He was unfairly accused of stuffing a hose or something else down his pants for concerts but that’s silly because there were too many former lovers to call him out if that were the case. Update: For those of you who are offended on his behalf, give me a break. Watch some of his interviews for heaven’s sake. He would love this and think this speculation over three decades later hilarious. If I didn’t feel certain about this I NEVER would have given this answer. Like his millions of other fans I adore the man. Update: Never dreamed this fun and frivolous answer would EVER be approaching 100k views! The downside is that no one is reading about this man’s heart. Trust me, it was hhhuuugggeeee! SO, I’m going to copy and paste a couple of other answers just to show you what Freddie was like. (Some of the answers have been shortened.) Many people know that Freddie Mercury was a cat lover, but what did he think about dogs? This is a quote from “This Was the Real Life” by a friend of Freddie’s named Cherry Brown: “I shall always remember him sitting on my sofa when he came over and having deep and loving conversations with my dog Scarlet, a delicate and ladylike red setter. He was just as spotty about his cats.” Freddie’s PA said he loved dogs but felt it better to stick with cats since he was gone so much touring and recording and cats are more independent. But apparently Freddie cared about all animals. When he got to his apartment in Montreaux the first thing he would want to do was visit and feed “his” swans which were actually wild swans at Lake Geneva/Leman. The big swan made of flowers seen at Freddie’s funeral was from Jim. Also from the same book: A memory by Gordon Atkinson who was Freddie’s doctor and became a good friend. He had brought with him some insecticide for Freddie’s roses which were being eaten by greenfly: “However, when death and destruction had been disbursed, he became stricken with remorse about the number of insects that must have died.” Perhaps he practiced organic gardening after that. From Mercury and Me: (These were just observations scattered throughout the book, it’s not like he was even trying to say that Freddie was a great animal lover.) He was horrified of spiders so Jim had to catch them and release them outside because Freddie wouldn’t let him kill them. He loved his koi fish and liked sitting by the pool watching them and hand feeding them. When he learned that Jim had put a hopelessly ill koi down by banging its head on a rock he got a powder from the vet so it could be done more humanely. In the studio filming I’m Going Slightly Mad, “There were also some penguins there for the shoot and in quiet moments Freddie took himself off to be with them and give them water. Under studio lights they were baking and, ill as he was, he was only concerned for their welfare.” Which photo of Freddie Mercury do you believe shows his true character? What has struck me most while learning about my favorite subject Freddie Mercury is what a loving person he was. This is actually surprising considering he spent much of his childhood in a boarding school away from the love of a family and his mother.  So my pick for the picture that shows his truest character is this one in which he is expressing his love and appreciation for his dear friend and opera soprano Montserrat Caballe who was no doubt somewhat of a mother figure for him. What a sweetheart he was to be a rock star and yet unafraid to show such affection and gratitude publicly during their performance. Do you think Freddie Mercury was a narcissist? Based on seven biographies Freddie was about the farthest thing from a narcissist. He is described as kind, considerate and caring so often that it simply cannot be in doubt. You might be under that impression because of the movie but the movie took great license with his character in order to create drama and follow the formulaic music biopic. Narcissist are not merely egotistical and selfish but see others as almost nothing but tools for their use with little to no real value or significance of their own. Freddie, like virtually all celebrities, had an ego. Like he said himself, having an ego, being at times arrogant and having an unshakable belief in yourself and your abilities is a necessity or you’ll never get anywhere—and curl up into a ball in the corner, I might add, because of the constant slings and arrows. But Freddie intentionally created an air of out-sized ego and arrogance—a big rock star persona—partly because his real personality was so the opposite and might even be deemed unacceptable for the role. Jacky Gunn Smith who worked for Queen’s fan club said that fans didn’t want to hear it when she tried to tell them what a sweet guy he was. “From thinking I was going to be working for a band led by an ogre, I was very pleased to be able to get to know a really great guy. People were incredulous when I said that the Freddie I knew was a very warm, kind and caring man. Fans often seemed not to want to know this.” Roger Taylor said, “In real life nobody knew Freddie. He was shy, gentle and kind. He was never the one he was on the stage.” This persona that he created not just for the stage but for public consumption in interviews, etc., was also like a coat of armor that protected him. It was a don’t mess with me bluster that did intimidate as was intended. In one interview you can see him say something like “What I hate is talking to reporters like you.” It’s no wonder since the press was awful to him. Yet after the interview Freddie accepted a business card from the reporter. He was called some months later and offered the chance to audition as director for a Queen video and ended up having a long, incredible career thanks to Freddie’s kindness. All bark, no bite. (The director’s name is Rudi Dolezal. He directed many Queen videos as well as other band’s. He is supposed to be coming out with a book later this year called “My Friend Freddie”. ) Narcissists don’t care how they affect others and will not only use people but step all over them to get what they want. He has been described over and over as very determined and ambitious yet unwilling to be ruthless. In all my reading the most conniving thing that I can recall is him telling each member of the band Ibex that the other members had already agreed to changing the band’s name to Wreckage when they hadn’t. (They cared so little that they didn’t even mind when they found out, but laughed. And, seriously, a band named after a wild goat? No wonder he was desperate to change it.) Friend David Evans said that EMI wanted Brian to be the face of the band rather than Freddie but as people noticed Freddie’s affect on the audience he had to be encouraged into accepting a greater role for fear of impinging on Brian’s territory. He wanted to be the lead singer for Brian’s and Roger’s band Smile since they were all great friends but waited around for over two years rather than try to run singer Tim Staffell off or instigate some sort of drama to insinuate himself into the band. Tim has said he was glad Freddie has such success because he was a great guy and left to join a band that by everyone’s account was far more likely to succeed. (You’ve never heard of them.) Narcissists are not caring and nurturing because they believe only themselves deserve such attention. Freddie was a mother hen personality type who constantly worried about and looked after others. He carried a book with everyone’s birthdays in it so he never missed them. He called his group of friends from NYC his New York Daughters. In Queen’s early days he sensed that Brian was worried that Queen would have to replace him when he spent so much time recuperating from hepatitis and an ulcer. Brian said, “Freddie, God bless him, was very kind, and said, ‘Don’t worry, darling. We can’t do it without you.’” When Brian was feeling down years later Freddie wrote a song praising him to the sky called “Soul Brother” and another time he stayed up all night making a montage of all of Brian’s great guitar solos for him. He worried about John and “took him under his wing” according to multiple accounts when he was new to the band. He encouraged him to write songs and has been described by record producers as being just as enthusiastic and hard working on the other band members’ songs as his own songs. He had a friend who managed a restaurant. He lived with his mother and was very close to her. When she suddenly died Freddie told him, “I’m your mother now.” The friend was invited to holiday celebrations and whenever he was sick Freddie sent his own personal doctor to his house and brought him food or had it catered. The examples of his caring about others are too many to share. ",
            "date": "Updated September 22, 2019",
            "views": "2364",
            "upvotes": " View 722 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daryl Herron",
                    "user_href": "/profile/Daryl-Herron"
                },
                {
                    "user_id": "Gabrielle Danielsson",
                    "user_href": "/profile/Gabrielle-Danielsson"
                },
                {
                    "user_id": "Vaishali Shukla",
                    "user_href": "/profile/Vaishali-Shukla-35"
                },
                {
                    "user_id": "Linda Turner",
                    "user_href": "/profile/Linda-Turner-21"
                },
                {
                    "user_id": "Marie Slugaski",
                    "user_href": "/profile/Marie-Slugaski"
                },
                {
                    "user_id": "Rumay Oosthuizen",
                    "user_href": "/profile/Rumay-Oosthuizen"
                },
                {
                    "user_id": "Gianna Fm.",
                    "user_href": "/profile/Gianna-Fm"
                },
                {
                    "user_id": "Laura Haggi",
                    "user_href": "/profile/Laura-Haggi"
                },
                {
                    "user_id": "Jill Knight",
                    "user_href": "/profile/Jill-Knight-31"
                },
                {
                    "user_id": "Mary Liberi",
                    "user_href": "/profile/Mary-Liberi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Rimmer",
                "href": "/profile/Matt-Rimmer-6"
            },
            "answer_text": "\"Was Freddie Mercury well endowed?\" Judging from photographs, ridiculously so, yes. It's difficult not to notice that armadillo in his trousers. You could be forgiven for thinking he had taken action to exaggerate what he had. It looks like surely he's put something down there. Maybe a cucumber, marrow or tree branch? :-) However this issue has been addressed by a statement he gave in 1974: \"by the way, I do not wear a hose. My hose is my own. No coke bottle, nothing stuffed down there.\" I doubt he would have lied about that, given the number of people he was getting naked with at the time. A lie would have been exposed fairly easily. It very much looks as if his c*** was equally as impressive as his voice! Apparently Frank Sinatra was similarly endowed. Maybe it's a musician thing? Remember, it's not the size of the nail. It's the ability of the musician that makes a song sound good. Nails and hammers have very little to do with it. ",
            "date": "Answered September 12, 2019",
            "views": "157",
            "upvotes": " View 77 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rumay Oosthuizen",
                    "user_href": "/profile/Rumay-Oosthuizen"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Rebecca Brown",
                    "user_href": "/profile/Rebecca-Brown-880"
                },
                {
                    "user_id": "Cherron Rotenberk",
                    "user_href": "/profile/Cherron-Rotenberk"
                },
                {
                    "user_id": "Darlene Sharts",
                    "user_href": "/profile/Darlene-Sharts"
                },
                {
                    "user_id": "Anne Hetu",
                    "user_href": "/profile/Anne-Hetu-2"
                },
                {
                    "user_id": "Maria Letizia D'Antonio",
                    "user_href": "/profile/Maria-Letizia-DAntonio"
                },
                {
                    "user_id": "Jody Marie",
                    "user_href": "/profile/Jody-Marie-27"
                },
                {
                    "user_id": "Stephanie Lobignat",
                    "user_href": "/profile/Stephanie-Lobignat"
                },
                {
                    "user_id": "Ralph Kramden",
                    "user_href": "/profile/Ralph-Kramden-33"
                }
            ]
        }
    ]
}