{
    "title": "Was Elvis Presley a great musician? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Connelly",
                "href": "/profile/Scott-Connelly-1"
            },
            "answer_text": "So this is the story I heard, but I don’t know how accurate it is: Sam Philips, owner/operator of Sun Studios in Memphis, Tennessee, knew Rock N Roll would be huge if only there were a few white guys singing the songs - most of the really early rock stars (Big Joe Turner, Chuck Berry, Little Richard, a few others) were not popular with the white parents of the white kids listening to, and really really liking that music. Those parents - and the various anti-Rock N Roll groups that formed - were trying to claim it as the Devil’s music. This is also the early 1950’s, about 5 or 6 years before the beginning of the Civil Rights movement. Philips thought what would make Rock more, say, presentable, to the citizens was to find a white guy who sounded like a black guy singing. One of Philips’ talent scouts told him to check out a little Baptist church in a predominantly black (and poor) side of town. There he saw and heard Elvis Presley for the first time, and realized this is The Guy. I also know for a fact Elvis auditioned at Nashville’s Grand Ole Opry, but was turned down. Elvis could play some guitar, and some piano, but as far as being “great” at either, I’m not sure. Most of Presley’s talent was his singing, and in how he put on a show - he was quite entertaining and even had a great sense of humor plus a lot of loyalty to his friends and a great love for his fans - for years before his death, anyone who eluded the many guards and bodyguards at Graceland would be invited in for a meal! Bottom line: Decent musician, extremely nice guy. ",
            "date": "Answered May 1, 2017",
            "views": "1643",
            "upvotes": " View 178 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George T. Vail",
                    "user_href": "/profile/George-T-Vail"
                },
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Richard Boucher",
                    "user_href": "/profile/Richard-Boucher-22"
                },
                {
                    "user_id": "Dimitri Czapkiewicz",
                    "user_href": "/profile/Dimitri-Czapkiewicz"
                },
                {
                    "user_id": "Liam Dougan",
                    "user_href": "/profile/Liam-Dougan-1"
                },
                {
                    "user_id": "Candy Knutson",
                    "user_href": "/profile/Candy-Knutson-1"
                },
                {
                    "user_id": "Richard Bending",
                    "user_href": "/profile/Richard-Bending-1"
                },
                {
                    "user_id": "Deana Waterdown",
                    "user_href": "/profile/Deana-Waterdown"
                }
            ]
        },
        {
            "author_info": {
                "name": "L. Olson",
                "href": "/profile/L-Olson-3"
            },
            "answer_text": "I am a 13 year old genius an also a musical genius. I write music on the piano, mostly improv. I am easily Elvis’s biggest fan. Thinking logically and without any emotion affecting my answer Elvis was truly a gifted singer and guitarist. Also he invented Rock and Roll so without him there would be no Beatles (as John Lennon once said), there would be no led zeppelin, ramones, chilie peppers, lynyrd skynyrd, Eric Clapton, Roy Orbison, ACDC, Hank Williams, dire straits, queen, John Lennon, Ringo Starr, Paul McCartney, or George Harrison by them selves either, and also many more rock musicians. Also being able to say \"hey guess what, I invented one of the most popular genres of music\" is an incredible and impressive thing to be able to say. He was also nicknamed the bot with the golden voice. He was such a gentleman and he was also one of the best musicians to ever walk the planet because after all he is \"The King\". I hope my answer helped ",
            "date": "Updated February 13, 2018",
            "views": "11",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Liam Dougan",
                    "user_href": "/profile/Liam-Dougan-1"
                },
                {
                    "user_id": "Ted McCartin",
                    "user_href": "/profile/Ted-McCartin"
                },
                {
                    "user_id": "Jeff Mellinger",
                    "user_href": "/profile/Jeff-Mellinger-3"
                },
                {
                    "user_id": "Gary Hiel",
                    "user_href": "/profile/Gary-Hiel"
                },
                {
                    "user_id": "Pamela Black",
                    "user_href": "/profile/Pamela-Black-1"
                },
                {
                    "user_id": "Gerry Hughes",
                    "user_href": "/profile/Gerry-Hughes-16"
                },
                {
                    "user_id": "Mario Celaya",
                    "user_href": "/profile/Mario-Celaya"
                },
                {
                    "user_id": "Hninzi Lwin",
                    "user_href": "/profile/Hninzi-Lwin-1"
                },
                {
                    "user_id": "Judy Bunnell",
                    "user_href": "/profile/Judy-Bunnell"
                }
            ]
        }
    ]
}