{
    "title": "Was Eddie Van Halen really the first to pot pickups in wax? - Quora",
    "tags": [
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Electric Guitars",
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "EVH has claimed in an interview with guitar magazine from Feb 2007, that he invented guitar pickup potting: \"I also couldn't stand the annoying feedback squeal that occurs playing at very high volumes. I thought maybe it was the actual coil windings vibrating that caused the feedback. I thought that if I dipped a pickup in molten wax, when the wax cooled, it would prevent the coil windings from vibrating. I took a coffee can, melted paraffin wax into it, dipped the pickup in the wax and pulled it out right before the bobbins would melt. I didn't always catch it in time. I ruined a lot of pickups that way. When I got it right... Voila! It got rid of the squeal. This process I stumbled onto is now known as \"potting,\" and it has become a standard process for manufacturing in the industry.\" Is that true? Definitely NOT true. One problem with EVH’s little “fib” is that electric guitar wax pickup potting was around before EVH was born. Fender started potting its pickups in wax in the early 1950s. Here is a description of vintage Fender pickups from that period: Fender, collecting vintage guitars fender stratocaster, strat, telecaster, tele 1950 to March 1964: all models had \"black bottom\" pickups and cast slug alnico magnets with rounded top edges. Pickups not dated. Pickup wire is usually a real rich cooper color. Pickups are dipped in hot wax to eliminate microphonics, and this wax is evident on the entire pickup. Also the pickup screw \"springs\" are made out of rubber surgical tubing cut into small 3/8\" long pieces.EVH probably learned the trick from Wayne Charvel, who claimed that he specifically taught it to EVH. Charvel, in turn credited Robert Luly in teaching it to him: \"In the early 1970's a young man came into my guitar shop in Azusa, CA, and introduced himself to me as Eddie Van Halen. He asked me if I could stop his Dimarzio pickup from squealing. I told him I could. ( a trick I had learned from an electronics genius, Bob Luly) The pickups would be soaked in hot wax, which is now known as \"potting\". To the best of my knowledge, we were the first to \"pot\" after-market pickups. Eddie was happy that the pickup didn't squeal anymore. Who was Bob Luly? Robert Luly, 65, audio inventor BTW, the idea that EVH was so sophisticated in pickup design that he independently invented wax potting sort of flies in the face of his other comments, where he admitted that the reason he wired up his original Frankenstrat with only a volume knob was because he didn’t understand wiring circuitry. ",
            "date": "Updated October 29, 2020",
            "views": "19",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lars Falk",
                    "user_href": "/profile/Lars-Falk-5"
                },
                {
                    "user_id": "Jonathan Ankin Dranoff",
                    "user_href": "/profile/Jonathan-Ankin-Dranoff"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Charles Bolton",
                    "user_href": "/profile/Charles-Bolton-5"
                },
                {
                    "user_id": "Ted Boucher",
                    "user_href": "/profile/Ted-Boucher"
                },
                {
                    "user_id": "Charles Beavers",
                    "user_href": "/profile/Charles-Beavers-5"
                },
                {
                    "user_id": "Larry Robinson",
                    "user_href": "/profile/Larry-Robinson-57"
                },
                {
                    "user_id": "Lance Cornish",
                    "user_href": "/profile/Lance-Cornish"
                },
                {
                    "user_id": "Paul Larsen",
                    "user_href": "/profile/Paul-Larsen-14"
                },
                {
                    "user_id": "Sam Steiger",
                    "user_href": "/profile/Sam-Steiger-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Wilson",
                "href": "/profile/Tom-Wilson-376"
            },
            "answer_text": "Rickenbacker Had some wax potted pickups as far back as the 40’s. Fender potted theirs in lacquer in the 50’s and went to wax in a few in the late 60’s I believe. Bill Lawrence and a few others started in the 70’s which is when it seems to get common. Although it wasn’t extremely common when EVH started potting his the idea had been around a while. I actually like the sound of unpotted pickups but it’s not always feasible if you play with distortion at stage volume. ",
            "date": "Answered October 12, 2020",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Grossman",
                    "user_href": "/profile/Joseph-Grossman-7"
                }
            ]
        }
    ]
}