{
    "title": "Was the music of UK Garage more influential than the music of Grime outside the UK? - Quora",
    "tags": [
        "Soulful House Music",
        "House Music",
        "Influential",
        "Dance Music",
        "Music History",
        "Electronic Music",
        "Music Industry",
        "Musicians",
        "The United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian C McCalla",
                "href": "/profile/Brian-C-McCalla"
            },
            "answer_text": "Unless they are explicitly involved with the production of (or are rabid fans of ALL forms of) dance music - at least here in the USA - people haven't even heard of UK Garage or Grime let alone listened to it in any way sufficiently to have been influenced at all from either genre. Hell, most people here haven't heard of Drum & Bass or Hardstyle and will naively group all varieties of House, Ambient, and Trance (incorrectly) into the catch - all descriptor of Techno - even though it's unlikely more than a handful of them have actually heard actual “Techno\" anytime in the last two decades. This is what happens to any society dominated nearly exclusively by Hip Hop, Heavy Metal, and Country since about 1990 while the rest of the world continued to evolve and mature musically. Oh, sure; they've had some flirtation with Brostep and Skrillex - mangled bass music (which they try to call “Dubstep\") and some really badly candy - coated House parodies. But here in the USA, you mention any anything else - even Progressive or Deep House or Uplifting Trance (hardly “exotic\" forms of dance music) and you'll get blank stares. Honestly, basically nobody here has even heard of Eric Prydz, Armin Van Buren, or Steve Aoki. Or course, we also elected Trump as our President…so, go figure! ",
            "date": "Answered January 3, 2020",
            "views": "101",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaquille Albertus",
                    "user_href": "/profile/Shaquille-Albertus"
                },
                {
                    "user_id": "David Yan",
                    "user_href": "/profile/David-Yan-53"
                },
                {
                    "user_id": "Sonia East",
                    "user_href": "/profile/Sonia-East"
                },
                {
                    "user_id": "Carl Brown",
                    "user_href": "/profile/Carl-Brown-28"
                }
            ]
        }
    ]
}