{
    "title": "Was Nietzsche in love with Cosima Wagner, Richard Wagner's wife? - Quora",
    "tags": [
        "Richard Wagner (composer)",
        "Friedrich Nietzsche (philosopher, author)",
        "Philosophers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henrik Sandström",
                "href": "/profile/Henrik-Sandström-6"
            },
            "answer_text": "Nietzsches writings and letters speak best for themselves. He always spoke very good about Cosima Wagner, for example in his autobiography, Ecce Homo. I will give you the German texts with sources, and make English translations. For more formal translations you’ll have to buy the English texts of they are available: “Die wenigen Fälle hoher Bildung, die ich in Deutschland vorfand, waren alle französischer Herkunft, vor allem Frau Cosima Wagner, bei weitem die erste Stimme in Fragen des Geschmacks, die ich gehört habe.” “The few cases of higher education that I found in Germany, all had French origin - especially Cosima Wagner, by far the greatest voice in matters of taste that I know of.” Nietzsche, Friedrich, Ecce Homo, Warum ich so klug bin In his letters: Nietzsche Source - Home 30) NF-1887,11[27] — Nachgelassene Fragmente November 1887 — März 1888. 11[27] (308) Frau Cosima Wagner ist das einzige Weib größeren Stils, das ich kennen gelernt habe; aber ich rechne ihr es an, daß sie Wagnern verdorben hat. Wie das gekommen ist? Er „verdiente“ solch ein Weib nicht: zum Dank dafür verfiel er ihr. “Cosima Wagner is the only woman of greater style that I have ever known. But I blame her for her corruption of Wagner. How could it happen? He didn’t deserve such a woman: because of it, he fell for her. “ 32) BVN-1888,1050 — Brief AN Karl Knortz: 21/06/1888. Mit Richard Wagner und Frau Cosima Wagner war ich einige Jahre, die zu den werthvollsten meines Lebens gehören, in tiefem Vertrauen und innerstem Einvernehmen verbunden… “With Richard Wagner and Cosima Wagner, I spent some years that I count as the most valuable of my life. They were of the greatest trust and agreement…” <Turin, etwa 25. Dezember 1888> Verehrte Frau, im Grunde die einzige Frau, die ich verehrt habe… lassen Sie es sich gefallen, das erste Exemplar dieses Ecce homo entgegenzunehmen… “Dear madam, the only woman that I have ever revered. Please receive this first print of Ecce Homo…” Turin, vermutlich 3. Januar 1889 Ariadne, ich liebe Dich! Dionysos “Ariadne, I love you! Dionysos” <Turin, 3. Januar 1889> An die Prinzeß Ariadne, meine Geliebte. “To princess Ariadne, my love.” In conclusion, there are certainly clues that he loved her, and he wasn't alone about it should it have been the case - Cosima Wagner was one of the most famous and respected women of the nineteenth century. ",
            "date": "Answered June 17, 2019",
            "views": "723",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emilio Cecconi",
                "href": "/profile/Emilio-Cecconi"
            },
            "answer_text": "I don’t think so.  The common consensus of why Nietzsche would possibly love Cosima Wagner was because he referred to her as Princess Ariadne in one his letters about the time of his mental collapse.  I don’t think he referred to her as a Greek goddess out of infatuation, but because he was making a metaphor to the myth of Theseus.  The myth itself is clear only in outline -- all versions say that Theseus arrives in Crete, kills Ariadne's half brother the Minotaur, finds his way out of the Labyrinth with the aid of Ariadne's ball of twine, escapes with Ariadne to Naxos and there abandons her. [1] Metaphorically, Richard Wagner is the minotaur, Cosima Wager is Ariadne, and Nietzsche is Theseus.  In this context, I don’t think there’s any evidence to suggest that Nietzsche was in love with Cosima. 1. The Will to Madness ",
            "date": "Answered September 17, 2015",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raul Nosal",
                    "user_href": "/profile/Raul-Nosal"
                }
            ]
        }
    ]
}