{
    "title": "Was Napoleon a ruthless or dictatorial leader? - Quora",
    "tags": [
        "Napoleon Bonaparte",
        "History of France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurent Cayre",
                "href": "/profile/Laurent-Cayre"
            },
            "answer_text": "He was both dictatorial and ruthless politicaly, the classical tyrant of old greece who old personnal power by fear. In the case of Napoleon he was supported by the bourgeoisie, those who owned some wealth, in reaction to the unpredicable revolution who sent probably too many people to the guillotine. He was also fanatically supported by the military, a decisive factor of his longevity. He failed in 1814 mainly because he was betrayed by a greatpart of the marshalls followed by their men. Just an example of his brutality : In France nowadays we are plagued in the south by bush fire in the summer who are started either by accident or by malevolent acts from pyromaniacs. There is no more pyromaniacs now than in Napoleon times and the news reached him that the French south was devastated by fire-starter. Here is his answer from his hand :  Translation : IMPERIAL MESSAGE TO THE PREFET OF THE VAR (Note : A prefet represent the state autority in a region and the VAR is a french department that still exist near the city of Toulon) \"I hear that various fires have broken out in the forests of the department whose administration I have entrusted to you. I order you to have the people convicted of having started them shot on the scene of their crime. Moreover, if they were renewed, I shall see to give you a replacement. \"Napoleon OUCH ! Note exactly the nice guy, isnt it ? But you know what ? There were far far less fire started during those years of Napoleonic rules. Law and order… ",
            "date": "Answered June 1, 2017",
            "views": "954",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Guillaume Guy",
                    "user_href": "/profile/Guillaume-Guy"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Dewar Gleissner",
                "href": "/profile/John-Dewar-Gleissner"
            },
            "answer_text": " He became that way, not in the military, but in his political dealings. The higher he rose the more dictatorial he became. Napoleon took over in a coup, pictured above. He fired, dismissed, jailed and sometimes killed his political opponents. It had to be done his way, and if not, there were problems for dissenters. To enforce the Continental System, he had English goods found in northern Germany burned, not just confiscated. He had a German publisher shot for writing against him, and captured a Bourbon prince and had him shot. ",
            "date": "Answered May 31, 2017",
            "views": "11",
            "upvotes": "0"
        }
    ]
}