{
    "title": "Was Pantelis Pantelidis the greatest Greek singer of all time? - Quora",
    "tags": [
        "Pantelis Pantelidis (singer)",
        "Greek Music",
        "Culture of Greece",
        "Greek Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katerina Portokalia",
                "href": "/profile/Katerina-Portokalia"
            },
            "answer_text": "How would you make that assumption? I would like some feedback here. I am not going to judge his personality. What happened to him is irrelevant to your question. What we are talking about here is the measurement to appoint “the greatest greek singer of all time”. What should we take into consideration? Talent, Creativity, Populatiry, Originality I think will do. Talent? Average. One can’t say he was bad per se, but definitely not the best. Creativity? None. Recycled material with little to no musical interest for people who care about music and not entertainment. Popularity? Yes. I’ll give him that. Although not widely accepted and respected, he was and still is very popular among his audience/taget group. Originality? Except for the fact that he was self made and came directly from social media - To me he does deserve the appraise for that-, there was nothing new or special that he brought to the table. Last but not least, I would like to remind you what you are asking for here. you are asking to put the above described person in comparison with some real legends of greek music that no doubt had so much more into them. My personal favourite is Nikos Xylouris for example. I know there will be people who will have different opinions, and I will accept them, but I am sure the alternatives they will provide will be just as respectable among the greeks, no matter their musical taste. But don’t f*****g compare Pantelidis to Xylouris. ",
            "date": "Answered October 14, 2018",
            "views": "725",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Panagiotis Kyriakopoulos",
                    "user_href": "/profile/Panagiotis-Kyriakopoulos-3"
                },
                {
                    "user_id": "Jerry Pagart",
                    "user_href": "/profile/Jerry-Pagart"
                },
                {
                    "user_id": "Nikos Papakonstantinou",
                    "user_href": "/profile/Nikos-Papakonstantinou-1"
                },
                {
                    "user_id": "Konstantinos Anastasiou",
                    "user_href": "/profile/Konstantinos-Anastasiou-5"
                },
                {
                    "user_id": "Ioannis A. Tsamis",
                    "user_href": "/profile/Ioannis-A-Tsamis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vangelis Denaxas",
                "href": "/profile/Vangelis-Denaxas"
            },
            "answer_text": "Not really. He started by himself through Internet and youtube, making his own songs and lyrics and it is true that himself worked hard for his arise, which honors him. On the other hand his style was just that of Greek pop folk style which is generally low in quality, lyrics and style. His music was a kind of commercialised and distorted Anatolian and Balkan folk music (the original Anatolian and Balkan folk music of course is of great value). He was idolized and heavily promoted by the local mechanisms of media and mass culture, becoming adorable by youths, many of them from lower and poorest social classes in cities and rural areas and who generally nowdays like this kind of music. His voice wasn’t bad but nothing so excellent and great ",
            "date": "Answered October 16, 2018",
            "views": "399",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jerry Pagart",
                    "user_href": "/profile/Jerry-Pagart"
                },
                {
                    "user_id": "Nikos Papakonstantinou",
                    "user_href": "/profile/Nikos-Papakonstantinou-1"
                },
                {
                    "user_id": "Konstantinos Anastasiou",
                    "user_href": "/profile/Konstantinos-Anastasiou-5"
                },
                {
                    "user_id": "Gregory Yama",
                    "user_href": "/profile/Gregory-Yama"
                },
                {
                    "user_id": "Ioannis A. Tsamis",
                    "user_href": "/profile/Ioannis-A-Tsamis"
                }
            ]
        }
    ]
}