{
    "title": "Was Freddie Mercury the only gay member of Queen? - Quora",
    "tags": [
        "Freddie Mercury"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Zander",
                "href": "/profile/Alex-Zander-53"
            },
            "answer_text": "There is a big argument about whether Freddie Mercury was gay or bisexual. I happen to think he was gay for a number of reasons. BUT: Freddie didn’t want to be remembered for his sexuality or his love life or any of that. He was a performer. That’s what he was and that’s what he was born to be. A legendary performer. And musician of course. I want to explain why I think he was gay and not bisexual because I know a lot of the responses are going to say how he married Mary Austin and all that. So before you do just hear me out. When he was 14 Freddie Mercury experienced his first homosexual relationship with his roommate in an all-boys boarding school. He never had a girlfriend until he met Mary Austin in 1969. They got engaged in around 1973. In an interview, Jim Hutton, Freddie’s lover until he died from lung cancer in 2010, confirmed that Freddie had confided in him that Bohemian Rhapsody was, in a way, a coming out song as homosexual. He’s killing his old straight self to make way for this fabulous gay man. This was the time when he met a man called David Minns. He’d been an assistant to Freddie but they began to date and sleep together. This was behind Mary’s back as they were still together at the time. They called each other “pudding” and “my tart.” Here is an example:  (The man next to him is obviously David). After David Minns, Freddie did some things with another assistant, Paul Prenter. He took advantage of Freddie and partly introduced him to the whole gay club scene and other drugs. Paul stayed by Freddie’s side until 1985 when he spread rumors about Freddie to the press. There are many closeted gay men who have had wives, children, grandchildren. It wasn’t really fully accepted until the 21st century. You wouldn’t be necessarily killed in the ’70s, ’80s, and ’90s for it but it certainly wasn’t as free as it is now. It’s true that Freddie had sex with women at his parties, but in comparison to the men, well, it’s definitely an uneven scale there. But now think about this. As described by Jim Hutton in his book ‘Mercury and Me,’ Hutton says that Freddie had a wild sex drive. And “Once he was in the mood there was no stopping him.” So, imagine this man, high, drunk, and in the middle of all this with this wild sex drive he had, he pretty much just had sex with anyone at those parties. There were plenty of men there to..er..turn him on. Anyway. In 1978 and 1979 Freddie started adopting a new look. PVC caps and night leather jackets with leather pants. White vests, or white undershirts but they called them vests. This is him on tour in either 1978 or 1979:  This is what the gay community was all wearing during the ’70s and ‘80s. He fit right in with them all. He was known for going to many gay clubs in any city he went to and began to have many male prostitutes or strippers come to bed with him during one of his many parties or after a concert. This is also how he met Jim Hutton by the way. He met him in a gay bar in England (Or Scotland I don’t remember exactly) in 1983 and tried to pick him up. Jim was with another man at the time and didn’t even know what Queen was, much less this guy. Well, Freddie saw him again a year later at the same bar and Jim let him take him out. And another thing, Freddie came out to his bandmates as gay around 1980. He said he was gay many times so, I dunno you guys. I know I just killed all of you by writing all this and I’m sorry for doing it but I felt I should justify my answer. Everyone thinks that just because of Mary Austin, he was bisexual. He may have loved her, but perhaps not in the way that he thought. When he came out to her as bisexual, she told him “No. Freddie, you’re gay.” I have a similar relationship with someone but not romantically. Just so close that I would spend all this time with them, I would leave them a ton of stuff in my will. I tell him I love him all the time and he knows I don’t mean in that way, as do other people. But, Freddie just wanted to be remembered as the legend he was and still is. His music lives on forever within us and he will always be a big part of my life. He will forever be remembered the way he wanted to be. A rockstar. A performer. A legend. To answer your question: Yes he was the only gay member. But, I dunno Roger sounded pretty attracted to that car. Vroom Vroom. We may have a car sexual on our hands. Anyway, yeah everyone else was straight. ",
            "date": "Updated May 16, 2019",
            "views": "162",
            "upvotes": " View 72 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Schuff",
                    "user_href": "/profile/Mary-Schuff"
                },
                {
                    "user_id": "Liesl Estrange",
                    "user_href": "/profile/Liesl-Estrange"
                },
                {
                    "user_id": "Sharon Neibert",
                    "user_href": "/profile/Sharon-Neibert"
                },
                {
                    "user_id": "Anne Pompa",
                    "user_href": "/profile/Anne-Pompa"
                },
                {
                    "user_id": "Theresa Kroll",
                    "user_href": "/profile/Theresa-Kroll-1"
                },
                {
                    "user_id": "Olivia Barron",
                    "user_href": "/profile/Olivia-Barron-18"
                },
                {
                    "user_id": "Petya Gancheva",
                    "user_href": "/profile/Petya-Gancheva-1"
                },
                {
                    "user_id": "Kathy Sharp",
                    "user_href": "/profile/Kathy-Sharp-9"
                },
                {
                    "user_id": "Karen Jensen",
                    "user_href": "/profile/Karen-Jensen-61"
                },
                {
                    "user_id": "Deborah Brady",
                    "user_href": "/profile/Deborah-Brady-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Perkins",
                "href": "/profile/Jennifer-Perkins-106"
            },
            "answer_text": "Oh Lawd. Here we go. My answer could possibly get me throttled but here goes. It’s really quite simple. in the 70s , 80s and most of the 90s, there was little discussion publicly about the differences of being gay, lesbian, bisexual, queer, transgender, plus Pansexual, Pangender , Asexual : hence LBGTQ+ or the longer version of LGBTTTQQIAA. (I’m not going into all those definitions, the information can be found other than google! ) Ok, so on to my answer: since these roles were not defined into the 21st century, we had very little ‘terms’ in which to determine whether someone was gay, bisexual or the huge fad, androgynous. Or more crass and closed minded bigots enjoyed words like faggots and queer. But I digress.I have no idea if Freddie Mercury was gay or bisexual and don’t give a damn. Who really knows? Those people closest to him and they ain’t telling. Therefore I conclude it’s absolutely none of my business. He sang like an angel and was extremely generous and kind often anonymously. He was a diva, loved and hated with a passion, quickly forgave, never found the peace he sought so desperately until the end of his life. This is what I care about. Not whether he was gay or not.Brian May loved women. He’s made no secret of this. He constantly fell in love. Roger Taylor— draw your own conclusions. John Deacon, a family man at heart, living the rock and roll dream and occasionally lost his way. They all did wild and typical rock and roll parties and to this day, no one gives specifics. Freddie was the one in the limelight. It’s natural that he was discussed more than the rest of the band.No one in Queen was gay. That’s my opinion but that’s like an azzhole, we all have one. In the 70s / 80s ? Freddie would have definitely been called Gay. I grew up to this so I do have a tiny bit of knowledge of these decades. The 90s improved and again, it wasn’t until the 21st century that we began to analyze the different kinds of sexuality. Today?? Hmmmm… I have my thoughts but will keep them private.Personally, we as the general public, will take this question to our resting place. Freddie was very private, Queen protected him, Mary Austin has protected him… so any conversation between Freddie and those who knew him best, (that didn’t sell him out posthumously) will never be known. And why does this even matter. He was a man. A genius. A legend. And a beautiful man who loved with his entire heart.Don’t kill me but these ‘place Freddie in a collective sexual box’ drives me crazy. He lived his life to the fullest and the most important thing is that his legacy lives on, stronger than ever 50 year later. Remember this man for his musical genius and his gentle spirit.Not his sexuality. ",
            "date": "Answered February 16, 2020",
            "views": "77",
            "upvotes": " View 127 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liesl Estrange",
                    "user_href": "/profile/Liesl-Estrange"
                },
                {
                    "user_id": "Autumn Epperson",
                    "user_href": "/profile/Autumn-Epperson"
                },
                {
                    "user_id": "Barbara Mendoza",
                    "user_href": "/profile/Barbara-Mendoza-19"
                },
                {
                    "user_id": "Ardis Smith",
                    "user_href": "/profile/Ardis-Smith-1"
                },
                {
                    "user_id": "Theresa Kroll",
                    "user_href": "/profile/Theresa-Kroll-1"
                },
                {
                    "user_id": "Alena Hronská",
                    "user_href": "/profile/Alena-Hronská"
                },
                {
                    "user_id": "Mary Anne Cooper",
                    "user_href": "/profile/Mary-Anne-Cooper-2"
                },
                {
                    "user_id": "Roz Barber",
                    "user_href": "/profile/Roz-Barber-1"
                },
                {
                    "user_id": "Penny Burnside",
                    "user_href": "/profile/Penny-Burnside-1"
                },
                {
                    "user_id": "Dee Romberger Hamrick Years",
                    "user_href": "/profile/Dee-Romberger-Hamrick-Years"
                }
            ]
        }
    ]
}