{
    "title": "We know the meanings behind the lyrics of 'Aqualung.' What about the meanings of the other songs on the album? - Quora",
    "tags": [
        "Song Meanings",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark R Frank",
                "href": "/profile/Mark-R-Frank-1"
            },
            "answer_text": "“Cross-Eyed Mary:” I’d guess she’s 14 or 15 but looks older. She goes to school but she’s also a prostitute and escort, going to lunch in Hampstead Village—nice place for lunch—with businessmen. They probably get a kick out of the fact that she dresses well and looks older but is under age. A “jack-knife barber” performs abortions. CEM might have needed one or at least knows where to get one in her line of work. Highgate is an expensive London suburb, but of course has its share of the homeless. As the “Robin Hood” of Highgate, CEM makes a lots of money from rich businessmen and “gives to the poor” probably by giving a few quid to a number of homeless men she runs into regularly. “Cheap Day Return:” Preston is in Lancashire, more city than country. A “Cheap Day Return” is a train ticket to be used to get to a destination and back in a day. I’ve seen Jethro Tull in concert four times, the last two in a smaller venue. Ian Anderson said the song came from a time he visited his father in a nursing home. The rest is pretty explanatory. “Mother Goose:” The references here appear to be to a country fair. It sounds like the foreign student thinks Picadilly Circus is actually a circus. Hampstead Fair is a summer fair on Hampstead Heath. The speaker takes on different characters—schoolboy, Long John Silver. He might be Aqualung, since Johnny Scarecrow is another homeless man (who nicked his raincoat from a snowman). “Wondr’ing Aloud:” A romantic little song, sort of a palate-cleaner after all the low-life narration. “And it’s only the giving that makes you what you are” rates up there with some of the other epitomes of love in rock songs. “And in the end, the love you take is equal to the love you make” from “Abbey Road” is the Beatles’ contribution. The Moody Blues—”It’s not the way that you say it when you do those things to me. It’s more the way you really mean it when you tell me what they’ll be” from “Question” is more wordy but epitomizes love. “Up to Me:” A “Wimpy Bar” is not a pub for the ineffectual. Rather, it’s the English equivalent of a MacDonald’s, not that they don’t have Macdonald’s restaurants in England. The one I ate in in Haymarket was two buildings and three stories. A “Wimpy” is a hamburger, named after the “I’ll gladly pay you Tuesday” character from “Popeye.” The last time I had a Wimpy was 1979. It was a hamburger patty on a bed of onions on a bun and it did awful things to my stomach. One good point about Wimpy’s is they seem to be open at all hours. I went on their site, chose “Morden” and they told me Indianapolis was “too far to deliver.” “Up to Me” has quite a jaunty melody to end side one. Of course, a “Silver Cloud” is a model of Rolls Royce. I used to try to connect the “yellow-fingered smoky girl” to Cross-Eyed Mary but without success. “A half of bitter” is of course English ale. “And if it pleases me I’ll put one on you man.” means he’ll buy the guy a beer. When I first heard it, I thought the lyrics were “And if it pleases me, I’ll put one on your fan,” even though”fanny” doesn’t refer to “butt” In England, but something even more embarrassing. Side one is entitled “Aqualung;” side two is entitled “My God.” Religion might seem to be a pretty off- putting subject for rock music, hence the dearth of other religious rock tunes, but Anderson embraces the subject. “My God” is moaning and melancholy. “The bloody church of England” is the Anglican church, found by that champion of religion King Henry VIII. I’ve been to Hampton Court every time I’ve been to England. It’s a short trip on the River Thames from Richmond, Surrey, where I stayed with my grandparents and survived Wimpy’s. I’ve been in the Maze, seen the Great Vine (I thought it was the “Grape Vine”), been passed all those gryphons, stared at the clock , etc. There’s a great clip of what appears to be a ghost opening a door at HCP—quite clear and spooky. The memory of Hampton Court that stays with me the clearest are the thresholds leading into (and out of) the great kitchens. They’re one piece of stone laid across the doorway. The stones are worn away to a depth of perhaps an inch and a half. Thousands of feet over hundreds of years. Stones older than Mick and Keith. “Hymn 43:” A quite personal hymn by Ian Anderson about Jesus Christ. Everything translates to American. “Slipstream:” “Slipstream” is 1:12 long, sort of a companion piece to “Wond’ring Aloud” in its brevity. It can stand alone as poetry, as can all of “Aqualung,” laying the groundwork for JT’s next album “Thick as a Brick.” “Locomotive Breath:” Pretty raunchy lyrics, still sort of religious. I’ve hear “LB” on the soundtrack at a drug store. “Old Charlie,” according to Anderson, is God. The song starts off with piano, a slow buildup, and features one of Anderson’s finest flute solos. Name another rock singer/musician who regularly plays the flute. “Locomotive Breath” has been covered by several bands (W.A.S.P., Helloween and Styx). I always think of Warren Zevon’s “Switchin’ Yard” as another classic rock representation of train noises (from “Excitable Boy”). “Wind-Up:” “Wind Up” again is religious and intensely personal, but I don’t think there were too many young men (and women) in 1971 who didn’t identify with the lyrics: “How’d you dare to tell me that I’m my father’s son/ When that was just an accident of birth?/ I’d rather look around me, compose a better song/ ’Cause that’s the honest measure of my worth/ In your pomp and all your glory you’re a poorer man than me/ As you lick the boots of death born out of fear.” Ian Anderson now farms in northern England but still tours with the newest incarnation of Jethro Tull. If you have a chance to see them, do. You won’t be disappointed. ",
            "date": "Answered July 23, 2020",
            "views": "89",
            "upvotes": "0"
        }
    ]
}