{
    "title": "Were you able to learn a musical instrument in school? - Quora",
    "tags": [
        "Learning Music",
        "Musical Instruments",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Johanson",
                "href": "/profile/Bruce-Johanson-1"
            },
            "answer_text": "Was I able to learn to play a musical instrument in school? Indeed i was. Our band program was offered to grades 5 and up and beginners got private lessons from a very capable and dedicated teacher. By 6th grade we were in the band program and the elementary band met twice a week from all coountry schools in our district (there were several) and the young musicians were dismissed from regular classes for band…yes, the teachers accommodated this because they too, felt that music was important, as did our administration. Throughout junior High and high school I had only private lessons, maybe 15–20 minutes, once a week, and we were dismissed from class on the scheduled time to have our lessons with the band director. We also had a summer program and got lessons and ensemble practice all summer on a regular schedule. (I should mention that part of our elementary school music training included sol feggio and part singing from grade 4 on up). Our school also had a string program and an orchestra in addition to wind band. Later on, I was taught string bass along with my trombone and other brass instruments. Now don’t get me wrong…our school also had a very fine athletic program, and interscholastic teams, but when the band played a pre-game field show, the football players suited up in their band uniforms, they changed in the locker room or field house, to play in the games. Athletics and music activities did not conflict…they worked together, and the administration kept active watch to assure balance. Our school was not a large district population-wise and the students wore a number of hats ie. student council, science club, band, chorus (we had an outstanding choral program as well), debate team, rifle team and gun safety, forensics and speech, and a host of others. I have to agree with Geoff Arnold’s comments, especially the part about many present-day school administrators. Unfortunately, many of them are often teachers who were not terribly successful in the classroom, so they were “Peter-principled” up to administration where they tend to follow what is popular rather than what is right. I came through a smaller school district that kept a good balance, so I know it is possible. Unfortunately, many “professional” administrators of today indeed, just don’t get it. Principals and Superintendents should be EDUCATORS, first and foremost, and not just pencil pushing crowd followers. When athletic boosters shout louder than band parents, they will get the support of the weaker administrators. You will know when things are even when the football team has to hold a bake sale to pay for the bus trip for an away game! ",
            "date": "Answered April 10, 2019",
            "views": "343",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hannah Lock",
                    "user_href": "/profile/Hannah-Lock-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Arnold",
                "href": "/profile/Geoff-Arnold-2"
            },
            "answer_text": "Yes. I went to school when schools still offered music programs. I was in the school band and played percussion instruments into High School. Today, music programs are or have been shut down all across America. And this to our collective shame. Music is a very important part of learning. It teaches patience.It rewards persistence.It encourages group activities (playing with other musicians).It helps math skills (yes… music IS math).It teaches a language (yes… music IS a language).It teaches tactile skills.It teaches co ordination skills. And that’s just for starters. I had begun piano two years before joining the school band in grade 5. So I was already ahead of most kids. And my whole career has centered around music as well. Music is more important in our lives than administrators and politicians understand. Which is a shame that they don’t get it. ",
            "date": "Answered April 10, 2019",
            "views": "174",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bob Mason",
                    "user_href": "/profile/Bob-Mason-20"
                }
            ]
        }
    ]
}