{
    "title": "Were is the band Green Day now? Why are they not active on the scene? - Quora",
    "tags": [
        "Green Day (band)",
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yash",
                "href": "/profile/Yash-267"
            },
            "answer_text": "They just released their new album titled Revolution Radio.  Green Day's first album in four years is vibrant punk rock, uncluttered by outsize grandiosity or conceptual overthink. \"Revolution Radio\" sets the tone with its Clash-like police-siren guitar, Tré Cool's combustible drum tumult and Billie Joe Armstrong snarling about cherry bombs and gasoline as if he's looking around his garage for stuff that might set the world on fire. And so he does: The explosive American-angst autopsy \"Bang Bang\" hits as hard as anything on their Nineties classics Dookie and Kerplunk; when Armstrong sings, \"I want to start a rager,\" it doesn't matter that he's appropriating the voice of a power-mad school shooter. You'll wanna rage right along. But Revolution Radio isn't just hot nostalgia. It reflects decades of accrued emotional and musical wisdom. \"Somewhere Now\" is a call for personal and political clarity with a ringing R.E.M. brightness, and \"Outlaws\" is like an anarcho-thrash Seventies soft-rock ballad. Armstrong's lyrics are colored by his struggles with addiction and fears about our Trump-y future. \"If this is what you call the good life/I want a better way to die,\" he rants over the contusive mosh-pit bounce of \"Forever Now,\" before demanding a revolution on his radio as the song lifts toward Who-huge triumph. It's a noise built to push him through darkness and into the next scary dawn. ",
            "date": "Answered February 4, 2017",
            "views": "4",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vandan Agrawal",
                    "user_href": "/profile/Vandan-Agrawal-1"
                },
                {
                    "user_id": "Aditya Nandi",
                    "user_href": "/profile/Aditya-Nandi-11"
                },
                {
                    "user_id": "Aitana Penalosa",
                    "user_href": "/profile/Aitana-Penalosa"
                },
                {
                    "user_id": "Vivek Moghe",
                    "user_href": "/profile/Vivek-Moghe-1"
                },
                {
                    "user_id": "Shonal",
                    "user_href": "/profile/Shonal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Lukas",
                "href": "/profile/Kevin-Lukas-1"
            },
            "answer_text": "They're doing mainly side projects now. Billie Joe and Dirnt were in a live band called The Coverups with a different bassist and drummer and Jason White, who is no longer in Green Day. Dirnt played rythm guitar in the band while Billie and Jason played lead guitar. There are live videos of them on YouTube. Tre Cool made an appearance as the drummer in one of the videos. Tre Cool is currently the lead singer in a metal band called Dead Mermaids. Billie Joe was also part of a band called The Longshot. He released an album with them earlier this year. Live videos of them on YouTube as well including their album. They're not gone, just sort of “underground.” I'm sure they'll be back in a few years to make another album as Green Day. These side projects are sort of a getaway for them. A break from the main scene. ",
            "date": "Answered October 11, 2018",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lily Dante",
                    "user_href": "/profile/Lily-Dante-1"
                }
            ]
        }
    ]
}