{
    "title": "What are some reactions on Rolling Stone placing Marvin Gaye at the top of its new, less rock heavy list of the best albums ever? - Quora",
    "tags": [
        "Marvin Gaye",
        "Rolling Stone (magazine)",
        "Music Albums",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Russell Spear",
                "href": "/profile/Russell-Spear"
            },
            "answer_text": "I think that when it comes to Rolling Stone magazine and what their critics think are “the best”, Gene Simmons put it very well when he said: “I’m really not too interested in what some aging hippies think.” I feel the same way about it as Gene Simmons does and the funny thing about is, when he described them as “aging hippies” that was somewhere around twenty years ago. Whenever someone mentions music critics, I’m also instantly reminded of a quote by Phil Anselmo from the interview he gave at Loyola: “Most writers and media people are wannabe musicians anyway, that can’t do it. That’s the truth”! I know what music I like. You know who you like to listen to. Why would I read a magazine written by some wannabe musicians who have the gall to judge the talent of people who actually became rock stars? That would be kind of silly wouldn’t it? Music has no “best” anyway because the word they’re looking for but are too arrogant to use is ”favorite.” That list in Rolling Stone is nothing more than a list of their favorites. That’s what it is! “The best” is an objectively evaluable qualification! What objectively evaluable criteria are they using? None. It’s sheer opinion and that’s all it is. ",
            "date": "Answered September 29, 2020",
            "views": "238",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Jimmy Killackey",
                    "user_href": "/profile/Jimmy-Killackey"
                },
                {
                    "user_id": "Jim Clem",
                    "user_href": "/profile/Jim-Clem-4"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Mrak Damir",
                    "user_href": "/profile/Mrak-Damir"
                },
                {
                    "user_id": "Daragh Malone",
                    "user_href": "/profile/Daragh-Malone"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                },
                {
                    "user_id": "Ravinder Arora",
                    "user_href": "/profile/Ravinder-Arora-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rocci Disopa",
                "href": "/profile/Rocci-Disopa"
            },
            "answer_text": "I was never the biggest Jan Wenner fan anyway, but the list seems to have “culturally changed” significantly lately. With Lauryn Hill, Wu-Tang, Public Enemy, Kanye, Kendrick Lamar, The Notorious B.I.G., Dre, D’Angelo, and more fully entrenched in The Top 50 LP’s OF ALL TIME. But then, Jan Wenner no longer owns Rolling Stone, he is only the publisher now. Penske Media acquired the final 51% of Rolling Stone from Wenner in 2017. Jay Penske’s group also own Variety, The Robb Report, and IndieWire.  above: ‘What’s Going On’ But, Marvin Gaye and the Funk Brothers musicians who played on “What’s Going On”, are top-notch! And that LP was the first by a black artist to address social concerns, suffering, injustice, and inner city problems. It was also the first “concept album” by a black artist and the first record that mentioned the ecological movement, then in its seminal stage. It was also Gaye’s first credited role as producer. “What’s Going On” was always considered a Top 10 album anyway, since it’s debut in May of 1971. In 1985, the NME considered it the best album ever. ",
            "date": "Answered September 23, 2020",
            "views": "557",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sharon Weiss",
                    "user_href": "/profile/Sharon-Weiss-6"
                },
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Anastasios Theodorou",
                    "user_href": "/profile/Anastasios-Theodorou"
                },
                {
                    "user_id": "Karen Shuttleworth",
                    "user_href": "/profile/Karen-Shuttleworth-1"
                },
                {
                    "user_id": "Charlotte Hills",
                    "user_href": "/profile/Charlotte-Hills-10"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Thom Harmand",
                    "user_href": "/profile/Thom-Harmand"
                },
                {
                    "user_id": "Alex Neuenfeld",
                    "user_href": "/profile/Alex-Neuenfeld"
                },
                {
                    "user_id": "Paul Matthews",
                    "user_href": "/profile/Paul-Matthews-108"
                }
            ]
        }
    ]
}