{
    "title": "What do I need to know in buying a new violin for a beginner? - Quora",
    "tags": [
        "What Do I Need to Know Before Buying X?",
        "Violins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dean Wang",
                "href": "/profile/Dean-Wang-1"
            },
            "answer_text": "Hi there! Thanks for the ask. In the beginning, it doesn't really matter what the quality of the instrument is, short of obvious defects in the instrument. Elizabeth Davis brings up a good point in that you should avoid \"ebonized\" fingerboards where a generic wood has been painted black instead of real ebony being used. Probably the only consideration that you'd need to pay attention to other than the aforementioned things is the size of the violin. However, judging the best size for the beginner violinist may be difficult unless... ...you have the trained opinion of a professional violinist. Getting a teacher will help so much with choosing the right first instrument and getting your beginner's playing off the ground. Good luck and happy music-making! ",
            "date": "Answered August 1, 2015",
            "views": "394",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julie Slama",
                "href": "/profile/Julie-Slama-2"
            },
            "answer_text": "The smartest thing you can do is to avoid eBay. I can’t emphasize that enough. The next smartest thing to do is consult with your teacher before purchasing an instrument. A local violin teacher will be able to make recommendations through experience, and may know local shops that offer good deals, or recommend certain brands they are familiar with and know are a good value. Simply doing a “blind pick” based on price or appearance in a photograph online is a good way to wind up very unhappy. Many are what we call VSO’s -Violin Shaped Objects - and will come with a variety of structural and tonal defects that will cause problems and necessitate expensive repairs. I usually recommend that beginners rent an instrument before buying, especially if it’s a young child that will outgrow a fractional-sized instrument, or if you aren’t sure they will stick with it. The cost is quite low (generally less than $20/mo), and you can often get a better quality instrument than you would get for under $200 new. ",
            "date": "Answered December 10, 2016",
            "views": "431",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepu Thomas",
                    "user_href": "/profile/Deepu-Thomas-8"
                }
            ]
        }
    ]
}