{
    "title": "What was the first Beatles album to be recorded in true stereo? - Quora",
    "tags": [
        "Sound Systems",
        "Paul McCartney",
        "John Lennon",
        "Music Recording",
        "The Beatles (band)",
        "Music Albums",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Spinelli",
                "href": "/profile/Gary-Spinelli-2"
            },
            "answer_text": "Actually, the first Beatles album with a true stereo mix,( apart from the twin-track instruments in the left, vocals in the right, which is true stereo, but incomplete mixes. George Martin and the Beatles did not want them released that way) was A Hard Day’s Night. It was recorded on 4 track, and George Martin and crew was able to make decent true stereo mixes. The bulk of the Beatles recorded output was done on 4 track. The way they got around the limitations of only having 4 tracks was to “bounce” down, or mix down the 4 tracks into one, opening up three additional tracks for more instrumentation. That’s how they did Sgt. Pepper, and that is what makes it the incredible sonic masterpiece it is for its time. It was painstaking work. But even before Pepper, they were able to get good stereo mixes on their records. Revolver, to me, is every bit a great sounding stereo recording as Pepper. Their final three albums, the White Album, Abbey Road and Let It Be were recorded on 8 track, and were even better stereo recordings. Also, Abbey Road was mixed on a solid state mixer instead of tube, which also gives it the different sound from the others. I believe that is why many people mistakenly think it is their first true stereo album. As Michael Lisko and Kevin Richards correctly point out in their answers, Abbey Road WAS the first and only true stereo album, because it was the first time the Beatles themselves were involved with the stereo mix. See their answers for further details. ",
            "date": "Updated December 22, 2019",
            "views": "75",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Bell",
                    "user_href": "/profile/David-Bell-879"
                },
                {
                    "user_id": "Dan Wozniak",
                    "user_href": "/profile/Dan-Wozniak-5"
                },
                {
                    "user_id": "Steven Flack",
                    "user_href": "/profile/Steven-Flack-6"
                },
                {
                    "user_id": "Lisa Labua",
                    "user_href": "/profile/Lisa-Labua"
                },
                {
                    "user_id": "David Caldwell",
                    "user_href": "/profile/David-Caldwell-133"
                },
                {
                    "user_id": "Kevin Paez",
                    "user_href": "/profile/Kevin-Paez"
                },
                {
                    "user_id": "Knut A Brandal",
                    "user_href": "/profile/Knut-A-Brandal"
                },
                {
                    "user_id": "Victoria Ortega Garrido",
                    "user_href": "/profile/Victoria-Ortega-Garrido"
                },
                {
                    "user_id": "Jack Wells",
                    "user_href": "/profile/Jack-Wells-140"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Lisko",
                "href": "/profile/Michael-Lisko"
            },
            "answer_text": "That would be Abbey Road [1969]. Sadly, it was the last album they recorded as a band. As legend has it, The Beatles were only concerned with the mono mixes of their albums and singles but the label wanted mono & stereo mixes of the albums (the singles were released in mono only up until 1969). So George Martin quickly mixed the album tracks in stereo which took about half the time and the Beatles were never involved in those mixes. But by 1968 stereo started to supercede mono and the record-buying public preferred the stereo mixes. The White Album was the last to be mixed in mono (with a few of the songs sounding different from their stereo counterpart). The mono and stereo mixes were only in the U.K. and the U.S. only got the stereo version. The next single “Get Back” was the last to be mixed in mono (only in U.K.) while the U.S. only had stereo. The next single after that, “The Ballad Of John And Yoko” was the first single to be issued in stereo only (both U.K. & U.S.). Unfortunately, it only featured John & Paul. So the next album “Abbey Road” was never mixed in mono and the first album to be released in true stereo. ",
            "date": "Answered May 9, 2019",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                },
                {
                    "user_id": "Kenneth McLaughlin",
                    "user_href": "/profile/Kenneth-McLaughlin-3"
                },
                {
                    "user_id": "Andrew Gaines",
                    "user_href": "/profile/Andrew-Gaines-6"
                },
                {
                    "user_id": "Orlando Vega",
                    "user_href": "/profile/Orlando-Vega-2"
                },
                {
                    "user_id": "Loring Chien",
                    "user_href": "/profile/Loring-Chien"
                }
            ]
        }
    ]
}