{
    "title": "What are the top Hindi Lori lyrics? - Quora",
    "tags": [
        "Hindi Songs",
        "Song Lyrics",
        "Hindi (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reshma Andani",
                "href": "/profile/Reshma-Andani-1"
            },
            "answer_text": "I am listing here some of the best Lori lyrics which almost every child has heard during his childhoood days. so read it and recollect your old memories……. Nanhi Kali Sone Chali Nanhi Kali Sone Chali Hava dheere aana neend bhare, pankh liye, jhula jhula jaana nanhi kali sone chali hava dheere aana neend bhare, pankh liye, jhula jhula jaana nanhi kali sone chali Chaand kiran si gudiya naajon ki hai pali (2) aaj agar chaandaniya aana meri gali gun gun gun geet koi haule haule gaana neend bhare pankh liye, jhula jhula jaana Resham ki dor agar pairon ko ulajhaae (2) ghungharu ka daana koi shor macha jaae daane mere jaage to phir nindiya tu bahalaana neend bhare, pankh liye, jhula jhula jaana nanhi kali sone chali hava dheere aa Dhirese Aaja Re Akhiyan Me Dhire se aaja ri ankhiyan me nindiya aaja ri aaja, dhire se aaja dhire se aaja ri ankhiyan me nindiya aaja ri aaja, dhire se aaja chupke nainan ki bagiyan me nindiya aaja ri aaja, dhire se aaja Lekar suhane sapno ki kaliya sapno ki kaliya lekar suhane sapno ki kaliya aake basa de palko ki galiya palako ki chhoti si galiyan me nindiya aaja ri aaja, dhire se aaja dhire se aaja ri ankhiyan me nindiya aaja ri aaja, dhire se aaja chupke nainan ki bagiyan me nindiya aaja ri aaja, dhire se aaja Lalla Lalla Lori Lalla lalla lori doodh ki katori Doodh mein bataasha munni kare tamaasha Choti-choti pyari sundar pariyon jaisi hai kisi ki nazar na lage meri munni aaisi hai shehad se bhi meethi doodh se bhi gori chupke chupke chori chori chori lalla lalla lori Kaari raina ke maathe pe chamke chaand si bindiya munni ke chhote-chhote nainon mein khele nindiya sapanon ka palana aashaaon ki dori chupke chupke chori chori chori lalla lalla lori Chandaniya (Lori lori) Lori lori lori x (4) Chandaniya chhup jana re Chhan bhar ko luk jana re Nindiya aankhon mein aaye Bitiya meri so jaaye Nindiya aankhon mein aaye Bitiya meri so jaaye Leke goad mein sulaaoon Gaoon raat bhar sunaoon Main lori lori, ho main lori lori Lori lori lori x (4) Kardhaniyan chhun chhun bajein Palkan mein sapna saje Dheeme dheeme, haule haule Pawan basanti dole Dheeme dheeme haule haule Pawan basanti dole Leke goad mein sulaaoon Gaoon raat bhar sunaoon Main lori lori, ho main lori lori Meri muniya Rani bane Mehlon ka Raja mile Dekhe khushiyon ke mele Dard kabhi na jhele O dekhe khushiyon ke mele Dard kabhi na jhele Leke goad mein sulaaoon Gaoon raat bhar sunaoon Main lori lori, main lori lori Lori lori lori x (8) Chanda hai Tu chanda hai tu, mera suraj hai tu o meri aankhon ka taara hai tu) jeeti hun main, bas tujhe dekhakar is toote dil ka sahaara hai tu tu khele khel kai, mera khilona hai tu jisse bandhi har aasha meri mera vo sapana salona hai tu nanha sa hai kitana sundar hai tu chhota sa hai kitana pyaara hai tu chanda hai tu, mera suraj hai tu munne tu khush hai bada, tere gudde ki shaadi hai aaj main vaari re, main balihaari re ghoonghat men gudiya ko aati hai laaj yunhi kabhi hogi shaadi teri dulha banega kunvaara hai tu chanda hai tu, mera suraj hai tu ",
            "date": "Answered July 24, 2018",
            "views": "233",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Santosh Upadhyay",
                    "user_href": "/profile/Santosh-Upadhyay-187"
                },
                {
                    "user_id": "Shama Praveen",
                    "user_href": "/profile/Shama-Praveen-2"
                },
                {
                    "user_id": "Kapil Sharma",
                    "user_href": "/profile/Kapil-Sharma-240"
                },
                {
                    "user_id": "Bunty Chachidak",
                    "user_href": "/profile/Bunty-Chachidak"
                },
                {
                    "user_id": "Durgesh Singh",
                    "user_href": "/profile/Durgesh-Singh-98"
                },
                {
                    "user_id": "Sahithya Aladakatti",
                    "user_href": "/profile/Sahithya-Aladakatti"
                },
                {
                    "user_id": "Nitish Beck Bhagat",
                    "user_href": "/profile/Nitish-Beck-Bhagat"
                },
                {
                    "user_id": "Santanu Das",
                    "user_href": "/profile/Santanu-Das-251"
                },
                {
                    "user_id": "Devashish Gupta",
                    "user_href": "/profile/Devashish-Gupta-42"
                },
                {
                    "user_id": "Sharmila Bhatt",
                    "user_href": "/profile/Sharmila-Bhatt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankita Roy",
                "href": "/profile/Ankita-Roy-83"
            },
            "answer_text": "I love this LORI since the first time, I have ever heard it. Movie name - Sadma(1983) Surmayee Ankhiyon MainNanha Munna Ek Sapana De Jaa ReSurmayee Ankhiyon MainNanha Munna Ek Sapana De Jaa ReNindiya Ke Udate Paakhi ReAnkhiyon Maon Aaja Saathi ReRaa Ree Raa Rum O Raaree RumRaa Ree Raa Rum O Raaree Rum I would love to sing this for my child in future as well. :) And as I am from Odisha. I have known another Odia Lori. Aa Janhamamu saraga shashiMo kanhu haatare padare khashi Thank you.Keep Smiling :) ",
            "date": "Answered October 24, 2018",
            "views": "68",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nalin Mehra",
                    "user_href": "/profile/Nalin-Mehra-1"
                },
                {
                    "user_id": "Aditya Roy",
                    "user_href": "/profile/Aditya-Roy-113"
                },
                {
                    "user_id": "Shashi Raj",
                    "user_href": "/profile/Shashi-Raj-9"
                }
            ]
        }
    ]
}