{
    "title": "What is the longest song ever played on the radio? - Quora",
    "tags": [
        "Radio Stations",
        "Radio",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Todd",
                "href": "/profile/Jason-Todd-137"
            },
            "answer_text": "Well there’s lots of jazz stations that have probably played songs 20m + in length There are also indie stations that have played live cuts from bands like the Grateful Dead, Phish, et al. In fact SiriusXM has a Jam Band channel. But if you’re speaking of songs that were nominal hits on broadcast radio then it has to be the full, 17-minute-version of “Inna-Gadda-Da-Vida” by Iron Butterfly. Rock fans loved it because it was a great song to drop acid to. DJs loved it because it was long enough to let them go to the john, roll a fattie and flirt with that cute-sounding chick on the phone. One classic rock station in Baltimore used to — well into the 90s — have a weekly Friday night feature where they played the song. (By that time, it wasn’t a song you just plop in anywhere on an FM playlist — it was always quite polarizing — but late on a Friday night was the perfect time for it.) Now, the band Yes, has some long ones: “Close to the Edge” (18 mins); “The Gates of Delirium” (21 mins); and all four side-long-songs from the snozzzzzzzzzzzzzze-fest Tales of Topographic Oceans (ranging 18 mins - 21 mins) ; but none of those, IIRC, were regularly played on FM radio. ",
            "date": "Answered September 2, 2018",
            "views": "47",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-91"
                },
                {
                    "user_id": "David Harden",
                    "user_href": "/profile/David-Harden-9"
                },
                {
                    "user_id": "Michael Crowley",
                    "user_href": "/profile/Michael-Crowley-22"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Lenny Rothbart",
                    "user_href": "/profile/Lenny-Rothbart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francisco Jiménez",
                "href": "/profile/Francisco-Jiménez-1"
            },
            "answer_text": "I cannot answer this from outside my experience. I worked in 2 of my local radio stations (not my real job, both radios are owned by one of my best friends) and the longest songs I have played myself are also the longest songs I have ever heard being aired. These are a few I recall from the top of my head: BURZUM - Det Som Engang Var (14:21) IRON BUTTERFLY - In a Gadda da Vida (17:03) OPETH - Black Rose Immortal (20:14) PAYSAGE D’HIVER - Der Baum (24:34) GRETA VAN FLEET - Lover Leaver, Taker, Believer [live] (26:35) (this one I suggested/requested my friend to air in the midnight show and continues to be aired very often) JEAN MICHEL JARRE - Waiting for Cousteau (46:56) ",
            "date": "Answered August 17, 2019",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Carrier",
                    "user_href": "/profile/Jacob-Carrier-2"
                },
                {
                    "user_id": "David Harden",
                    "user_href": "/profile/David-Harden-9"
                }
            ]
        }
    ]
}