{
    "title": "What is the best song you have ever heard? - Quora",
    "tags": [
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suhas Isloor",
                "href": "/profile/Suhas-Isloor"
            },
            "answer_text": "I have not one but several favourites: Hotel California - The EaglesPride - U2Stairway to Heaven - Led ZeppelinUntil the end of the world - U2Cocaine - Eric ClaptonOl’ 55 - The EaglesPaint it Black - Rolling stonesThe River - Bruce SpringsteenVertigo - U2Wind of change - ScorpionsI’m a believer - The MonkeesHey Jude - The BeatlesSmells like teen spirit - NirvanaBohemian Rhapsody - QueenI want you back - The Jackson 5Careless Whisper - George MichaelStaying Alive - The Bee GeesBaker Street - Gerry RaffertyViva La Vida - ColdplayIf tomorrow never comes - Garth BrooksHey, Soul Sister - TrainCandle in the wind - Elton JohnCalifornication - Red Hot Chili PeppersOceans - Pearl JamSeems like tonight - DaughtryMull of Kintyre - WingsLove is all around - Wet Wet WetEverything I do - Bryan AdamsImagine - John LennonEye of the tiger - SurvivorRadioactive - Imagine DragonsNumb - Linking ParkHere without you - 3 Doors downBlack Magic woman - SantanaBack in Black - AC/DCBoulevard of broken dreams - Green DayMy Hometown - Bruce SpringsteenI’d love you to want me - LoboThe Game of Love - Santana with Michelle BranchInto the Night - Santana with Chad KroegerWhile my Guitar gently weeps - George HarrisonDance the night away - Van HalenSunshine of your love - CreamTonight’s the night - Rod SrewartDowntown Train - Rod StewartWhen I need you - Leo SayerHave I told you lately - Rod Stewart’s versionWelcome to the Machine - Pink FloydSpace Oddity - David BowieStarman - David Bowie.Still got the blues - Gary Moore.Do it Again - Steely DanNumber of the beast - Iron MaidenSound of Silence - Simon and GarfunkelBridge over troubled water - Simon and GarfunkelMoney for Nothing - Dire StraitsBitter Sweet Symphony - The VerveWith or without you - U2Clocks - coldplayMagic - ColdplayBad Moon rising - CCRRollin’ on the river - CCRMy sacrifice - CreedSultans of swing - Dire StraitsHeavy Fuel - Dire StraitsPink - AerosmithBoulevard of broken dreams - Green daySin is a good man’s brother - Grand funk railroadEstranged - Guns and RosesHair of the dog - NazarethBand on the run - WingsHeart of Gold - Neil YoungAmerican Pie - Don McLeanRockstar - NickelbackBark at the Moon - Ozzy osbourneJeremy - Pearl JamEvenflow - Pearl JamAnother day in Paradise - Phil CollinsSorrow - Pink FloydAnother brick in the wall - Pink FloydSnow - Red Hot chili peppersBy the way - Red Hot Chili PeppersDon’t fear the Reaper - Blue Oyster CultBat out of hell - Meat LoafAll right now - FreeHighway to Hell - AC/DCAngie - The Rolling Stones19th Nervous Breakdown - The Rolling StonesDrops of Jupiter - TrainWalk this way - Aerosmith. These are the ones that came to mind. There are a lot more numbers that I love. The above list is in no particular order.",
            "date": "Updated February 20, 2017",
            "views": "96",
            "upvotes": " View 70 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yasaswini",
                    "user_href": "/profile/Yasaswini-16"
                },
                {
                    "user_id": "Debjyoti Sarkar",
                    "user_href": "/profile/Debjyoti-Sarkar-14"
                },
                {
                    "user_id": "Indu Boro",
                    "user_href": "/profile/Indu-Boro-1"
                },
                {
                    "user_id": "Hitesh Singh",
                    "user_href": "/profile/Hitesh-Singh-155"
                },
                {
                    "user_id": "Lidia Bober",
                    "user_href": "/profile/Lidia-Bober"
                },
                {
                    "user_id": "Prince Bhargav",
                    "user_href": "/profile/Prince-Bhargav-19"
                },
                {
                    "user_id": "Kamal Soni",
                    "user_href": "/profile/Kamal-Soni-164"
                },
                {
                    "user_id": "Mulaxo'ja Xo'jayev",
                    "user_href": "/profile/Mulaxoja-Xojayev"
                },
                {
                    "user_id": "Kevin Rafferty",
                    "user_href": "/profile/Kevin-Rafferty-23"
                },
                {
                    "user_id": "Denim Carter",
                    "user_href": "/profile/Denim-Carter-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Kemp",
                "href": "/profile/Randy-Kemp-14"
            },
            "answer_text": "What is the best song you have ever heard? My answer will defy the other answers, since I’m a professional musician. Since age 12, I am not actually able to just sit down and listen to a song. Instead, since I know the “language” of music, from the start of a song, my brain analyzes it theoretically. This is like listening to someone swear in Greek softly and sweetly. If you don’t know Greek, it sounds nice. If you do know Greek, it doesn’t. Because of that, it’s very difficult for me to narrow any category (i.e. favorite band, favorite musician, favorite song) to just one example. There are plenty of well written songs out there, with well written lyrics too. Thus, the more theoretically complex a song is, the more I appreciate it, but the song has to make musical sense and not be atonal or serial. Serialism - Wikipedia As far as composition goes though, I feel one of the best composers is Rachmaninoff. Many say his third piano concerto (although very similar to the second) is the height of 20th century composition.  (Rachmaninoff playing Piano Concerto #3) When I listen to this, there’s so much more to it than other 20th century styles of music. This has more counterpoint and role changing (i.e. piano plays theme, then orchestra plays theme while piano plays what the orchestra played during the first bars). The best part is we have a recording of the composer himself playing it as he intended it to be played. I’ve heard this piece played by many gold medal pianists often, but none capture its soul as much as its original creator. Typically when I listen to a pop song, for example, “Hey Jude”, I’m listening to the chord progression and melody, which are typically repetitive in popular music. This leads essentially to musical boredom for me, although I have nothing against pop music. Since this question has been merged with a question about motivational songs, I can tell you during my high school years I tried to emulate his writing style as well as I could. Listening to his music made me write a bunch of “classical” pieces for piano and other instruments. Another favorite composer of mine is Antonio Carlos Jobim, who’s work inspired my second album, Jobimesque. Although not as obviously complex, Jobim was subtle. His chord progressions and simple melodies are incredibly pleasing to the ear. At the time, there was more improvisation in (pop) music as well, which brakes away from modern pop music where we hear the same form continuously.  (Jazz Samba is now called Bossa Nova.) On the other end of the spectrum, you have people like Bob Dylan who are more poetic than musical. His voice, in my musical opinion, is terrible, but the lyrics are wonderful. For example his song “Like A Rolling Stone” has a very limited musical form. (Verse, Pre chorus, Chorus)  What’s better, to me, is when other artists cover his songs, for example the first version of this song to come out commercially was Jimi Hendrix cover.  It’s a lot more musically complex than the style of Dylan himself in its arrangement. Not to mention, Jimi can actually sing well. So, to me, the criteria for “the best song I’ve ever heard” is incredibly complex, and as you can see, I have no answer to it :P ",
            "date": "Answered February 12, 2018",
            "views": "61",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Connor Scott",
                    "user_href": "/profile/Connor-Scott-93"
                },
                {
                    "user_id": "Susan Foster",
                    "user_href": "/profile/Susan-Foster-35"
                },
                {
                    "user_id": "Alessandra Liverani",
                    "user_href": "/profile/Alessandra-Liverani"
                },
                {
                    "user_id": "Jaymin Sabean",
                    "user_href": "/profile/Jaymin-Sabean"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "Andi Straum",
                    "user_href": "/profile/Andi-Straum"
                },
                {
                    "user_id": "Akash Mukherjee",
                    "user_href": "/profile/Akash-Mukherjee-34"
                },
                {
                    "user_id": "Vani Srikanth",
                    "user_href": "/profile/Vani-Srikanth"
                },
                {
                    "user_id": "Jae Bryson",
                    "user_href": "/profile/Jae-Bryson"
                },
                {
                    "user_id": "Christel Yeo",
                    "user_href": "/profile/Christel-Yeo-1"
                }
            ]
        }
    ]
}