{
    "title": "What's a good way to teach a six year old how to play the piano? - Quora",
    "tags": [
        "Learning Piano",
        "Pianos",
        "Learning to Play Musical Instruments",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Klarqvist",
                "href": "/profile/Martin-Klarqvist"
            },
            "answer_text": "The way me and my siblings first learned from our parents were \"by color\".(Though, I guess we were all younger than six) The first songs we learned to play were music we listen to or sang, like \"twinkle, twinkle little start\", \"itsy-bitsy spider\" and so on...- so what our parents did, was giving each (white) key on the C-gradation in the middle of the piano a color (by putting a small colored sticker on the key)Then, in our song book, they added the same color to the corresponding note. (In some cases - if there were no book with the particular song - they took a blank sheet, wrote the lyrics of the song, and the corresponding colors for the melody.) This way, we learned pretty fast that:Pink = C, Green=D, Red = E, Yellow = F, Blue=G, Brown=A, Purple = B, Light blue =  C- and in the same way, we also learned the corresponding notes for each color....so after a while, we could also play songs that was not color coded, since we learned the notes for each key. We never had a private piano teacher - though we all have been playing at public \"music school\". (In Sweden, it's free for children to learn an instrument at school, when you are between 9 and 18. So in a way you have a private teacher, since you have a lesson once a week)But our parents are musical and plays plays the piano and guitar - so, we got a lot from them. Most important though: Make it fun to play! ",
            "date": "Answered March 1, 2016",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paula Wagoner",
                    "user_href": "/profile/Paula-Wagoner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jenny Leigh Hodgins",
                "href": "/profile/Jenny-Leigh-Hodgins"
            },
            "answer_text": "You have lots of good responses here. Having taught (and still teach) MANY children in that age range, the idea of several diverse activities as opposed to the traditional notation-based hour-long private piano lesson is usually better received by young students. Sitting for more than twenty minutes at a piano is usually torturous for young children who by nature need to move and play.   I taught private piano through traditional, classical-based notation methods for many  years, but when I discovered MusikGarten's curriculum, I found it to be highly effective for younger children especially (5-8 years of age ).  MusikGarten's curriculum uses a mixture of games, theory and aural training, drumming, movement, listening assignments and finally, keyboarding to teach piano . From my personal experience, it works really well.  Students I've taught via MusikGarten curriculum stayed focused longer, were engaged, and because of the diversity of approaches, well-prepared for developing piano-playing skills.  I highly recommend searching for a local MusikGarten instructor.  Of course, the curriculum itself is pretty useless if the teacher does not connect with the student.  That is a subjective, personal issue, so keep teacher shopping until you find the right fit.  But don't be hesitant to express any concerns to the teacher, who may be able to accomodate a positive, workable change once enlightened to any particular issues. ",
            "date": "Answered March 3, 2016",
            "views": "257",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John McDonald",
                    "user_href": "/profile/John-McDonald-55"
                }
            ]
        }
    ]
}