{
    "title": "What attracts someone to noise (music)? - Quora",
    "tags": [
        "Industrial Music",
        "Noise (music)",
        "Perception",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Doucet",
                "href": "/profile/Jacob-Doucet"
            },
            "answer_text": "Well, I'm only really into the depraved-themed noise music types such as power electronics groups(groups like Bizarre uproar, SNUFF, Chloroform Rapist, Anal Mayonnaise, Albert Fish Is My Hero, etc.) so I suppose I can only state what attracts me to that specifically. Anyways, I strongly believe that music interacts with the inner and deeply personal world of living things. This means that if someone is (genuinely) attracted to a certain type of music, then it's because it complements and amplifies their inner feelings, desires, spirituality, etc. For example, my inner world is chock full of what a lot of people refer to as synesthesia and my spirituality and fascinations all lean towards the more evil-minded ways and preferences. I also enjoy obsessive repetition and harsh, inhuman sounds due to how those sounds make me feel(inside). Thus, noise music and power electronics in particular is a perfect soundscape for my personal enjoyment; it is depraved in motifs and sound(screams, pitch-shifted distortions, orgasm noises, sharp feedback, etc.), it is often repetitive to a psychotic degree and the harshness of the noise gives it thick textures I can feel. It's a wonderful amplifier to fantasies. Just listen to Bizarre Uproar's song \"Amputaatio\" and imagine sprinting through Rwanda in '94; ah how the colours and shapes and bony forms of bodies twist and snap and spasm against the living grass and slithering marsh! The static is smoke of grilled cows' meat and the deep breathing and growls are the evil laughter of spirits! Beautiful. Beautiful. Chaos inside paired with chaos in the ears? Irresistible...well for me, anyways. Really, an attraction to this form of music is no different than any other; you like the way it makes you feel and dream and breathe.        ",
            "date": "Answered January 12, 2016",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Fahey",
                    "user_href": "/profile/John-Fahey-7"
                },
                {
                    "user_id": "Ennis Nortey",
                    "user_href": "/profile/Ennis-Nortey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keef Rob",
                "href": "/profile/Keef-Rob"
            },
            "answer_text": "Some listen to it because they think it will make them more arty.Some listen to it because they think it will validate their own idiosyncracies.Some just have the artifacts to appear cool and with it. I listen to it because it sounds to me like sounds I hear in nature, and I truly like it.  I never discuss it with anyone unless they ask first.  I do not care who is making the music, and am a fan of nobody.  I never bothered with magazines or books about it, and am completely uninterested in that aspect.  I am not an artist either.  I'm just a regular joe with a regular job. I'm very synaesthetic (sound, smell, taste, shapes, and texture of shapes are all linked, and I do have perfect pitch).  For me it's like being out in nature and watching that.  The so-called harsh stuff smells and tastes like the air at the beach to me.  It doesn't strike me as extreme or harsh at all.  Shapewise it suggests things like mahogany furniture, or marble sculptures.   It didn't take any work to appreciate it.  I heard it, thought \"that sounds good\" and just started acquiring it, just like I would any other music.  There is nothing special about it being composed blocks of sound as opposed to having rhythm and melody centered around a few pitches -- in fact in almost all noise I perceive rhythm and melody, but I also perceive timbral shifts.  The \"tunes\" in the music are in the motion from moment to moment. I don't like the transgressive way a lot of it is packaged and prefer it to be on its own, unhampered by transgressive titles or photos to go with it.  When I see any of the transgressive nature of it, I see parodic representations of punk, or direct mimicry and one-upmanship directed toward Throbbing Gristle, and I think all that is incredibly stupid. Out of the several hundred hours of the stuff I have, I'd say about 60-75% of it is through composed, and not improvised ... it does develop like other music does.  I like it best when dynamics and timbres are fully developed, and like it less when it's just a slab of loud sound. Metal Machine Music is the most lied-about album I know of.  Almost everything that has been said about it in pop culture demonstrates a total misunderstanding of it.  Lou Reed did indeed make that in part with ordinary playing gestures of the guitar, and it has a form.  To me that album is firmly rock music because it sounds much like the guitar work on \"I Heard Her Call My Name\" to my ears.  It just doesn't have the rest of the band with it. It is what it is, and I find many people who profess to like it do so to validate their own idiosyncrasies, and I think that's stupid as well.  . ",
            "date": "Answered October 18, 2011",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mert-Han Harry",
                    "user_href": "/profile/Mert-Han-Harry"
                },
                {
                    "user_id": "Adam Holquist",
                    "user_href": "/profile/Adam-Holquist"
                },
                {
                    "user_id": "David Wright",
                    "user_href": "/profile/David-Wright-834"
                },
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                },
                {
                    "user_id": "Ennis Nortey",
                    "user_href": "/profile/Ennis-Nortey"
                },
                {
                    "user_id": "Ryszard Pietrzak",
                    "user_href": "/profile/Ryszard-Pietrzak"
                },
                {
                    "user_id": "Seelan Palay",
                    "user_href": "/profile/Seelan-Palay"
                }
            ]
        }
    ]
}