{
    "title": "What are the bases for bass playing? - Quora",
    "tags": [
        "Playing and Performing Music Live",
        "Bass (sound)",
        "Bass Guitar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben White",
                "href": "/profile/Ben-White-12"
            },
            "answer_text": "As you already have a technical familiarity with guitar, I won't get into the mechanics of the bass (where the notes are, how it's tuned, etc.), so I would say your most important \"base\" is to know the role of the instrument. The role of the bass is rhythmic support. You are the bridge between the drums and the rest of the band. \"Glue\" is an overused metaphor here, but it's accurate; bass connects the band to the rhythm section, but glue is also a fluid, and the bass fills all the little cracks and crevices in the space between the drums and other melodic and harmonic instruments. Different from the more melodic instruments, however, it does so with larger, often longer notes, rather than lots of smaller notes.  Imagine a stew; if the drums are the protein (meat, tofu, beans, whatever) and the guitar/keys/vox/what-have-you are the flavor components (vegetables, spices, etc), envision the bass as the broth that brings them all together. It has its own flavor, it only rarely steps out on its own, though it can, but usually it acts to bring the other components together so that the entire dish shines.  Your role, as a bass player, is to create the foundation, the platform from which the entire band will shine. Best advice I can give: Know your role. Best of luck. ",
            "date": "Answered November 23, 2015",
            "views": "150",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joshue Romo",
                    "user_href": "/profile/Joshue-Romo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Garhartt",
                "href": "/profile/Justin-Garhartt"
            },
            "answer_text": "The bassists job is to translate what the guitarist is doing onto the beat. The best bass lines and bassists do this in a way that you don't even notice that it's happening unless you're looking for it. That's not to say that you should do exactly what your guitarist is doing.  If you check out some songs that you think are great try removing or finding a bass free version. That song will now be hollow. The bass fills a song with warmth and mood.  Playing with a good guitarist and drummer is like the best three-way in the world and when you get it right you'll know it. The best way to get the right feel is to just try, flail around a bit and fail. You will learn to pick out the key parts of the line and focus on and build from that. All I can really say is that playing with your friends and band mates is the best thing you can do. ",
            "date": "Answered November 13, 2015",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshue Romo",
                    "user_href": "/profile/Joshue-Romo"
                },
                {
                    "user_id": "Chris Strasser",
                    "user_href": "/profile/Chris-Strasser"
                }
            ]
        }
    ]
}