{
    "title": "What are the dark secrets of Lata Mangeshkar? When lata through out of studio? - Quora",
    "tags": [
        "Lata Mangeshkar (singer)",
        "Indian Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chetan Vinchhi",
                "href": "/profile/Chetan-Vinchhi"
            },
            "answer_text": "Thanks for A2A Ashish Pandey The kind of things mentioned in the linked video, and being thrown out of studio, being rejected etc. hardly comprise dark secrets. There were fairly public spats with music directors, other singers (most notably Mohammad Rafi), but they too don’t really qualify as dark. Specifically the Rafi spat was due to their disagreement about royalty, and in this particular case Lata was unambiguously right. Regarding these spats, there seems to be an adamant streak in Lata’s personality, partially due to the severe struggle during her early career where she was mistreated by a lot of people, which she made her break off professional relations with different people at different times. Perhaps a case of overcompensation, but not really “dark”. Leaving aside professional relations, there are many rumors and a something more than rumors about her personal relations. There are many alleged dark secrets (and some open secrets) about her personal life. I would not want to dwell on them. They add nothing to her musical persona, and take nothing away from her achievements. Unfortunately, in our great land, the woman is always handed the shorter end of the stick in such cases, so please take any rumors, claims and abuses with a pinch of salt. Make that a truck-load. ",
            "date": "Answered January 20, 2019",
            "views": "43",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "ExE Bhai",
                    "user_href": "/profile/ExE-Bhai"
                },
                {
                    "user_id": "Barkha Parihar",
                    "user_href": "/profile/Barkha-Parihar"
                },
                {
                    "user_id": "RAHUL ROY",
                    "user_href": "/profile/RAHUL-ROY-1092"
                },
                {
                    "user_id": "Sushil Ganeshpure",
                    "user_href": "/profile/Sushil-Ganeshpure"
                },
                {
                    "user_id": "Santosh Zade",
                    "user_href": "/profile/Santosh-Zade-1"
                },
                {
                    "user_id": "Aayushi Sachdeva",
                    "user_href": "/profile/Aayushi-Sachdeva"
                },
                {
                    "user_id": "Vandana",
                    "user_href": "/profile/Vandana-320"
                },
                {
                    "user_id": "Abdul Hingwala",
                    "user_href": "/profile/Abdul-Hingwala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Pandey",
                "href": "/profile/Ashish-Pandey-923"
            },
            "answer_text": " 5 unknown facts about Lata Mangeshkar Fondly termed as Didi and the Nightingale of India, Lata Mangeshkar rules a million hearts. Mangeshkar does not need to be in the news to create a stir. She's a name in herself and second to none! Here are a few unknown facts about India's most talented singer and legend. Lata Mangeshkar, as most know, is the daughter of Pandit Deenanath Mangeshkar, (a theatre actor and classical singer) and Shevanti (Shudhamati). Born on 28th September 1929, Lata was not her original name. She was born as Hema but rechristened later as Lata after a famous character Latika from her father's play Bhaaw Bandhan. 2. It is said that she moved India's first Prime Minister Jawaharlal Nehru to tears when she sang the song Aye Mere Watan Ke Logon, Zara Aankh Me Bhar Lo Pani. This was in 1962 when India lost the war to China and Pandit Ji apparently said to her that she had moved him to tears. As her popularity soared, everyone wanted to associate with India's nightingale.  3. In 1999, the perfume Lata Eau de Parfum was launched. The same year, she was nominated as a Member of Parliament. However, due to ill health the noted singer could not attend the sessions in Rajya Sabha which drew a lot of flack. Interestingly, Lata didi did not take a single penny or a salary or a house in Delhi for her services an MP 4. In a shocking state of controversies, the gentle, shy and soft spoken Lata did was in the news once again but for different reasons.  She was allegedly romantic linked to noted musician Bhupen Hazarika. In a shocking statement to Zee News, the late musician's estranged wife had stated that the two would spend nights together and her husband apparently told her that if a musicians wants to come up, he has to have his songs sung by Lata Mangeshkar. This statement is said to have enraged Hazarika's partner Kalpana Lajmi and all the Mangeshkars. As per reports in the media, it was Lata didi's alleged decade long love affair with the late Raj Singh Dungapur that came to light. 5. 5th secret is explain in 3 min video attached above, it is regarding some ups and down in Lata’s life. When she was scolded badly and got Away from studio transactions. Watch Video ",
            "date": "Answered November 24, 2018",
            "views": "178",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "RAHUL ROY",
                    "user_href": "/profile/RAHUL-ROY-1092"
                },
                {
                    "user_id": "Shreya Yadav",
                    "user_href": "/profile/Shreya-Yadav-233"
                },
                {
                    "user_id": "Omkar Tendulkar",
                    "user_href": "/profile/Omkar-Tendulkar-1"
                },
                {
                    "user_id": "Abdul Hingwala",
                    "user_href": "/profile/Abdul-Hingwala"
                },
                {
                    "user_id": "Women Talk",
                    "user_href": "/profile/Women-Talk"
                },
                {
                    "user_id": "Aksh Chandrakant",
                    "user_href": "/profile/Aksh-Chandrakant"
                },
                {
                    "user_id": "Carmel Luby",
                    "user_href": "/profile/Carmel-Luby"
                },
                {
                    "user_id": "Last Minute Travel Insurance",
                    "user_href": "/profile/Last-Minute-Travel-Insurance"
                },
                {
                    "user_id": "Vibha Pandey",
                    "user_href": "/profile/Vibha-Pandey-92"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/P-K-1497"
                }
            ]
        }
    ]
}