{
    "title": "What aspect of certain K-Pop idols would you merge to make the perfect K-pop idol? - Quora",
    "tags": [
        "ATEEZ (K-pop group)",
        "IZ*ONE",
        "Stray Kids",
        "Red Velvet (K-pop group)",
        "NCT (KPop)",
        "TWICE (K-Pop Group)",
        "Idol",
        "BLACKPINK",
        "K-Pop Idols",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marker Lee",
                "href": "/profile/Marker-Lee-1"
            },
            "answer_text": "K-POP Male Idol Dance- Taemin SHINEE  Vocal- Ryewook Super Junior  Rapping- Changbin Stray Kids  Visual- Legit any visual from a group. Taehyung, Eunwoo, Taeyong, Lucas… The possibilities are endless. Personality- Personally for me, it’s Haechan NCT   Female K-POP Idol Dance- Hyolyn  Vocal- Ailee  Rapping- CL  Visuals- Literally any group’s visual like Irene, Tzuyu, Jisoo, Nana… The possibilities are endless. Personality- I prefer Jessi’s personality. You either like it or you don’t.  I was searching up ‘Best K-POP…’. I was looking at the lists and found out that for vocals, legit BTS was ranked first. Now I not trying to hate on them or anything. They have amazing vocals, but far from the best. For dancing, Jimin was first, but like ‘huh?’ For rapping, it would be understandable how they would be some of the best rappers in K-POP. Same thing goes for Black Pink. Lisa and Jennie are not the best rappers in K-POP. Their vocal line is not the best in K-POP. Lisa’s dancing may be amazing, but in comparison to people like Chunga, Hyolyn, and Chaeyeong, I think tf not. I guess it all comes down to opinion, but…",
            "date": "Answered September 21, 2020",
            "views": "167",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Autumn Her",
                    "user_href": "/profile/Autumn-Her-1"
                },
                {
                    "user_id": "Clara Jones",
                    "user_href": "/profile/Clara-Jones-88"
                },
                {
                    "user_id": "Kym Ladell",
                    "user_href": "/profile/Kym-Ladell"
                },
                {
                    "user_id": "Peko Peko",
                    "user_href": "/profile/Peko-Peko-14"
                },
                {
                    "user_id": "Elizabeth N. Ebbertt",
                    "user_href": "/profile/Elizabeth-N-Ebbertt"
                },
                {
                    "user_id": "Hwasa",
                    "user_href": "/profile/Hwasa-5"
                },
                {
                    "user_id": "Minnie Chae",
                    "user_href": "/profile/Minnie-Chae"
                }
            ]
        }
    ]
}