{
    "title": "What are some good songs where the lyrics don’t rhyme? - Quora",
    "tags": [
        "Rhymes",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diana Weissend",
                "href": "/profile/Diana-Weissend"
            },
            "answer_text": "Listen to Morrissey and the Smiths. Morrissey's lyrics rarely rhyme, but he always makes them work. As in one of my favorite songs; not just by the Smiths, but of all time: “How Soon Is Now”? Just shut your mouth, how can you say I go about things the wrong way? I am human and I need to be loved Just like everybody else does. “Lover, You Should've Come Over” by Jeff Buckley: Looking out the door I see the rain fall upon the funeral mourners … Parading in the wake of sad relations as their shoes fill up with water. Maybe I'm too young to keep good love from going wrong .. But tonight you're on my mind, so .. You'll never know .. Just 2 examples of beautiful songs that don't rhyme .. The lovely poems of Leonard Cohen, once Poet Laureate of Canada; his songs rarely rhyme either, yet he's the greatest songwriter (and poet) ever! One more .. “The Royal Scam” by Steely Dan: And they wandered in from the city of St. Johns without a dime .. Wearing coats that shine, both red and green colors from their sunny islands .. Give me songs that don't rhyme .. anytime! Oops, didn't mean to do that .. yeah I did … ",
            "date": "Answered October 6, 2017",
            "views": "84",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "O E",
                    "user_href": "/profile/O-E-5"
                },
                {
                    "user_id": "Ian Anderson",
                    "user_href": "/profile/Ian-Anderson-86"
                }
            ]
        },
        {
            "author_info": {
                "name": "Romy Robles",
                "href": "/profile/Romy-Robles"
            },
            "answer_text": "Get Down Tonight-KC and the Sunshine Band (1975) Silly Love Songs-Paul McCartney and Wings (1976) Tainted Love/Where Did Our Love Go medley-Soft Cell (1982) Need You Tonight/Mediate medley-INXS (1988) Stairway To Heaven-Led Zeppelin (1970) Everything She Wants-Wham! (1985) Rocket Man-Elton John (1972) Deck Of Cards-Wink Martindale (1959) Abraham, Martin, and John-Dion Dimucci (1969) These are just a few examples right off the top of my head, but I'm sure there are many more pop and rock songs that have little to no rhyming in the lyrics. ",
            "date": "Answered October 8, 2017",
            "views": "56",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Evermore",
                    "user_href": "/profile/Stephen-Evermore"
                },
                {
                    "user_id": "Tony Green",
                    "user_href": "/profile/Tony-Green-272"
                },
                {
                    "user_id": "Michael Wigren",
                    "user_href": "/profile/Michael-Wigren"
                },
                {
                    "user_id": "Ian Anderson",
                    "user_href": "/profile/Ian-Anderson-86"
                }
            ]
        }
    ]
}