{
    "title": "What is your least favorite song? What is your most favorite song? - Quora",
    "tags": [
        "Songs Recommendations",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zenon Kogut",
                "href": "/profile/Zenon-Kogut"
            },
            "answer_text": "1 of my favourite songs: Kayah & Bregovic - 100 lat młodej parze  Hundred years to the young couple* No, I don't cry anymore, cause today I don't have more tears Why should I cry, if you get married anyway You've already vowed to her The same words, which you promised to me And if (people) start to shout: \"Bitter!\"** You will kiss her Hundred years to the young couple We wish you both your dreams come true Hundred years for myself Full of pain and tears No, I don't cry anymore, cause today I don't have more tears How could I cry, if today is a wedding They play marvelously to dancing Guests are filling bellies But none of them knows, that It's a funeral Hundred years to the young couple We wish you both your dreams come true Hundred years for myself Full of pain and tears No, I don't cry, but I can only laugh inwardly 'Cause I poisoned today two goblets What a pity that you've already forgotten, What you promised me once a time You will feel right away What means the revenge Hundred years to the young couple We wish you both your dreams come true Hundred years for myself Full of pain and tears *Hundred years! (Sto Lat) - the same as Many Happy / Here's to...**Bitter! (Gorzko!) - wedding guests shout it, when they want to young couple kiss each other. Passionate revenge song sung by a spurned lover who’s poisoned her ex’s wedding feast. Song I dislike the most: American Pie American Pie (song) - Wikipedia Pathetically sentimental, far too simple, far too repetitive. ",
            "date": "Answered February 22, 2018",
            "views": "485",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Chamness",
                "href": "/profile/Jerry-Chamness-2"
            },
            "answer_text": "I can't say what my least favorite “song” is, because I love music… all music. I Like everything from Seventies and older Rock N Roll, Country, Pop, and on. Even Rap. I just love music. My least favorite music is Opera. My favorite music is Classic Rock. My favorite band is the MonaLisa-Twins. My favorite song of theirs is “Close to You” or “Count on Me” both from their album “ORANGE.” Or, “When We're Together” from their album titled “When We're Together.” I love so many other songs of theirs, plus “Covers” they have done like “While My Guitar Gently Weeps” and “Drive My Car” or more recently David Bowie’s “Starman.” ",
            "date": "Answered December 3, 2019",
            "views": "68",
            "upvotes": " Answer requested by Crystal Waters",
            "upvoters": [
                {
                    "user_id": "Rahat Poudel",
                    "user_href": "/profile/Rahat-Poudel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syed Isamuddin",
                "href": "/profile/Syed-Isamuddin-1"
            },
            "answer_text": "Hi! I’m a hardcore hip-hop fan… I don’t have any favorite song in particular, but a few of my most liked songs are below: Same Old Shit - MC Ren  Arm Yourself - Chino XL feat. Immortal Technique, DV Alias Khryst  Rebel Music (Remix) - MC Ren feat. Ice Cube  Burn Radio Burn - MC Ren feat. Redd tha Rsonist  When I B On tha Mic - Rakim  A few songs I hate below: Gummo - 6ix9ine  Gucci Gang - Lil Pump  Enjoy! ",
            "date": "Answered February 22, 2018",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Linardi",
                "href": "/profile/A-Linardi"
            },
            "answer_text": "Least favorite? Most pop garbage on the charts (except for Lil Pump songs, those are great). And there's also a lot of shit to be had with Metallica's Bon Jovi period (Load to Reload). Most favorite? Bastard (Not one of my better days/Girl from Blue city) Devin Townsend - Bastard (720p) The last 3 minutes (Girl from Blue City) cannot be expressed in words. Its the climax the whole of the Biomech album (as well as the first part Not one of my better days) has been building up to. Absolutely magical ",
            "date": "Answered February 23, 2018",
            "views": "181",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pratik Mainali",
                "href": "/profile/Pratik-Mainali"
            },
            "answer_text": "My favorite song is I want love by Elton John. It’s my favorite song because it’s filled with impractical, unrealistic, desperate longing for love. The song encapsulates the mindset of a hopeless romantic. A man who wants something so impossible that he suffers uselessly in his endeavor. I like analyzing and sympathizing the life of romantics. My least favorite song is Yellow by Coldplay. The thing that I hate about it is the fact that they’ve wasted great vocals on such a meaningless lyrics. And in the process garnered unprecedented popularity. It shows how dumb and gullible the masses can be. ",
            "date": "Answered February 22, 2018",
            "views": "192",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mimi",
                    "user_href": "/profile/Mimi-228"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abbey Zugzda",
                "href": "/profile/Abbey-Zugzda"
            },
            "answer_text": "My least favorite song is Sweatshirt by Jacob Sartious, although many others enjoy it. My favorite song is either Police Station by the Red Hot Chili Pepper, or Meet Me at the Corner also by the Red Hit Chili Pepper. These songs have made me so happy when I was feeling down. I think you should listen to the full album, I’m With You, because these songs are so amazing. ",
            "date": "Answered February 3, 2017",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Summer-Morales-10"
                },
                {
                    "user_id": "Silvio Canziani",
                    "user_href": "/profile/Silvio-Canziani"
                },
                {
                    "user_id": "Evelyn Griffon",
                    "user_href": "/profile/Evelyn-Griffon"
                },
                {
                    "user_id": "Shivani Singh",
                    "user_href": "/profile/Shivani-Singh-721"
                },
                {
                    "user_id": "Ezra Fabrick",
                    "user_href": "/profile/Ezra-Fabrick-2"
                },
                {
                    "user_id": "P Bee II",
                    "user_href": "/profile/P-Bee-II"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alynn Plato",
                "href": "/profile/Alynn-Plato-2"
            },
            "answer_text": "my fav song is Paralyzed by nf why because i love the song and it describes how i feel Where are my feelings?I no longer feel thingsI know I should this part at least least type of music prob pop least fav song:don’t have Kitty out~cya ",
            "date": "Answered November 24, 2019",
            "views": "123",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Genius Turner",
                    "user_href": "/profile/Genius-Turner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Haris",
                "href": "/profile/Muhammad-Haris-111"
            },
            "answer_text": "Least favourite song? Must be a song that I really like but I listened to least. Hmm, probably What This World is Coming To by Nate Ruess ft. Beck Hansen. Most favourite had to be Fade to Black by Metallica no doubt about that. ",
            "date": "Answered January 19, 2017",
            "views": "266",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Chemwor",
                "href": "/profile/Eric-Chemwor"
            },
            "answer_text": "Spectrum from Zedd is my favorite. The tone and chords of the songs have some mystery in them. The song is an EDM song but it also translates nicely on other instruments. The Piano version is on of my favorite version of the song.  The Song I dislike the most Pills and Automobiles from Chris Brown  ",
            "date": "Answered February 22, 2018",
            "views": "131",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Seidel",
                "href": "/profile/Michael-Seidel-6"
            },
            "answer_text": "Most favorite - The Who, “Won’t Be Fooled Again”, because we’re fooled so often. Hell, we want to be fooled and find the golden satisfaction of the perfect, government, intimate relationship, or job. Least favorite - Ohio Express, 1968, “Yummy Yummy Yummy”. It’s all personal; the song is just too sweet and shallow for me. There are others, but this comes first to mind. ",
            "date": "Answered May 8, 2019",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raj Bajrange",
                    "user_href": "/profile/Raj-Bajrange"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vanda Roberts",
                "href": "/profile/Vanda-Roberts"
            },
            "answer_text": "What is my favorite song??? I love Louis Armstrong his songs are just pure joy to my heart. My favorite song is “What a wonderful world”. I love this song because as I listen to it I can feel his happiness and love for everything he's singing about..My most hated song??? Not really sure but I guess it would be country music that talks about cheating,dogs dying just chronic complaining etc. Music is good for the soul. ",
            "date": "Answered May 8, 2019",
            "views": "109",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Phillips",
                "href": "/profile/Sarah-Phillips-155"
            },
            "answer_text": "My favorite song changes on a very regular basis. A month ago, it was ‘Hurricane’ by Panic! At the Disco. Right now it’s ‘Can’t be Saved’ by Senses Fail. They’re very different songs in different genres. I don’t care for country music on a general basis. The occasional song appeals to me. I can’t think of any song I actually hate. ",
            "date": "Answered May 8, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Waters",
                    "user_href": "/profile/Crystal-Waters-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mina Sons",
                "href": "/profile/Mina-Sons"
            },
            "answer_text": "My fav song is What is love ? By Twice. The type is kpop. This song is so meaningful. As you read it, it is about love. I'm still looking for love so probably when I'll fall in love, it won't be my favorite song but for now it is. You should read the lyrics (translation, cuz it's in korean) and you'll relate to them (if you're single ofc). The music videos has so much movie references that you might catch it. I don't have song that I don't like. I mean if I don't like a song, I don't listen to it. ",
            "date": "Answered November 24, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raj Bajrange",
                    "user_href": "/profile/Raj-Bajrange"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Vega",
                "href": "/profile/Vincent-Vega-178"
            },
            "answer_text": "Favorite song is impossible to answer. Too many options. But, if necessary, on the “desert island” scenario, then anything by AC/DC. Esp Thunderstruck. Hated song? Also impossible to answer. Again, too many to mention. But if forced, that fucking “baby shark” crap. Is that really a song? My version of Hell - listening to Baby Shark over and over. And over and over. GAHHHHHH ",
            "date": "Answered May 8, 2019",
            "views": "86",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashland Olson",
                    "user_href": "/profile/Ashland-Olson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melia Janssen",
                "href": "/profile/Melia-Janssen"
            },
            "answer_text": "My most favourite song is ‘The Mission’ from Ennio Morricone.  My least favourite song is anything from the manufactured pop artistes so abundantly present online nowadays. ",
            "date": "Answered February 22, 2018",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Kap",
                "href": "/profile/Sarah-Kap-1"
            },
            "answer_text": "My favorite song is obsessions by Marina and the Diamonds. I just really relate to it. My least favorite is any song by Cardi B. I just hate her rap. It super mediocre, but people act like it’s the best thing they’ve ever heard. ",
            "date": "Answered February 22, 2018",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wendy Mayorga",
                    "user_href": "/profile/Wendy-Mayorga-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabe Andrews",
                "href": "/profile/Gabe-Andrews"
            },
            "answer_text": "Let’s go with Lately by K-Ci & Jo Jo for favorite song. The voices match the musical score and the mood of the song perfectly. Least is far too difficult to select just one. I will pick the entirety of the new age rap genre. There is not a single acceptable song or artist in my opinion ",
            "date": "Answered February 22, 2018",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Xiao Hu",
                    "user_href": "/profile/Xiao-Hu-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hogie",
                "href": "/profile/Hogie"
            },
            "answer_text": "Tbh my favorite song changes from time to time, so I will answer my latest one. It is Symphony covered by Angelica Hale (the 10y.o talented girl on American Got Talent). I don’t really hate any song, since I always skip a song at once if I don’t feel like it. ",
            "date": "Answered February 22, 2018",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Hayward",
                "href": "/profile/Josh-Hayward-15"
            },
            "answer_text": "My all-time favourite song is Awake and Alive by Skillet. A few of my current favourites are Take it Out on Me by Thousand Foot Krutch, Angel With a Shotgun by The Cab, and Erase by Discple. As for what song(s) I dislike, there are a few. I hate White Christmas and Silver Bells. I also dislike most pop songs. ",
            "date": "Answered February 23, 2018",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Hinklin",
                "href": "/profile/Robert-Hinklin"
            },
            "answer_text": "Love a lot of tunes, can’t pick a favorite. Hated? Not sure about the titles or artists, but Green Eyed Lady and Mandy (You’re A Fine Girl)… They make me consider how far I can throw a radio. ",
            "date": "Answered May 8, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "George Lally",
                "href": "/profile/George-Lally"
            },
            "answer_text": "There are a couple of Doo wop songs that annoy me, though I can’t remember their names at the moment. ( BTW, I like a lot of Doo wop)Favorite songs:‘I’ll be Seeing You’‘Here’s That Rainy Day’‘The Rainbow Connection’ ",
            "date": "Answered June 13, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanjeev Srivatsan",
                "href": "/profile/Sanjeev-Srivatsan-1"
            },
            "answer_text": "Favorite - “Khudaaya” from Shanghai 2013. Always gives my goosebumps when hearing. Least Favorite - Oru Aadar Love (sorry to say this) ",
            "date": "Answered February 22, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Team Sway",
                "href": "/profile/Team-Sway"
            },
            "answer_text": "There is nothing like a favorite and least favorite of ours, it all just depends upon the mood. And us being positive enthu cutlets at Team Sway, are always in a dance mood. Head over to our website and find all that you are looking for with respect to dance <3 Front Page - SwayTheStage ",
            "date": "Answered February 24, 2018",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Haku Judas",
                "href": "/profile/Haku-Judas"
            },
            "answer_text": "My favorite song is Dark Red by Steve Lacy and my least favorite song is anything Taylor Swift, SZA or Selena Gomez has made. Not to mention Haysley. ",
            "date": "Answered February 22, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dwight Cummins",
                "href": "/profile/Dwight-Cummins"
            },
            "answer_text": "My favorite song would have to be Bohemian Rhapsody and my least favorite song would be anything techno. ",
            "date": "Answered February 22, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pradeep Vyas",
                "href": "/profile/Pradeep-Vyas-31"
            },
            "answer_text": "Actually, I love the song ‘Chiggy wiggy ‘ from Bollywood movie ‘Blue(2009)’ forever. As well its version by sonu nigam live in Netharladnd in 2010. ",
            "date": "Answered February 22, 2018",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Morgan",
                "href": "/profile/Joseph-Morgan-101"
            },
            "answer_text": "Bruno Mars - That’s what I like is the best one for me ",
            "date": "Answered February 22, 2018",
            "views": "10",
            "upvotes": "0"
        }
    ]
}