{
    "title": "What are the pros and cons if Yena from IZ*ONE joins Everglow after IZ *ONE disbands? - Quora",
    "tags": [
        "IZ*ONE",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Teana Chan",
                "href": "/profile/Teana-Chan"
            },
            "answer_text": "Note: this is just my opinions. Pros: Yena is an allrounder performer so she can fill any role in Everglowtheoretically speaking, IZ*One Yena stans will follow her over to EverglowShe’d fit their concept perfectlyYueHua can use her popularity to their advantage by “debuting” her in the group now rather than holding her back to “trainee” status waiting for the next group to debut.Yena trained with the other Everglow members so she knows them well and how to work with them.7 member formation often looks nicer than 6.Cons: No matter what, there will be some Everglow stans who would hate the idea of another member being added, even if Yena was originally supposed to be part of the group from the start. I mean, look at what happened when Red Velvet’s Yeri was added to the group, she was faced with ALOT of hate in the beginning.One more person = Less lines/screen time for everyone elseIf they perform any of their older songs, they’re going to have to rework the choreography and lines in order to include Yena.- Ok. Personally, I think its a very safe bet that Yena was initially part of the debuting Line-up for Everglow. Kpop groups are often planned pretty far ahead in advance with members sometimes spending a year preparing for debut and since Everglow debuted about 6 months after Produce 48 ended, I think its entirely possible Yena was part of the group. But because she placed within the Top 12 for PD48 and thus under contract for IZ*ONE for 2 1/2 years, they obviously debuted without her. It seems like theres a good shot they’ll add her to Everglow, I’ve heard people say a a lot of Mia’s parts she’s had for the past 2 comebacks were meant for Yena (Idk if that’s actually true) and someone once pointed out that Everglow’s dance formations looks like there’s a space set for a 7th person. Though I do think its entirely possible they can hold her off for either another group later on or debut her as a soloist, I have no problems with her being added to Everglow. ",
            "date": "Answered August 27, 2020",
            "views": "181",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Lily Suzann",
                    "user_href": "/profile/Lily-Suzann"
                },
                {
                    "user_id": "Md Yeamin",
                    "user_href": "/profile/Md-Yeamin-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Junghwa' 'Maindo",
                "href": "/profile/Junghwa-Maindo"
            },
            "answer_text": "When Choi Yena thinks joinned EVERGLOW after IZ*ONE disbanded. “<2_”  *E:U answered in advance; She encouragement to Yena but But may be a bit worried.* Some WIZ*ONE thinks Yena was joinned the group EVERGLOW. But Someone may have both agree and disagree. Perhaps this is a good news and rumor. Ok I Search on Overall for Choi Yena. Let’s Go!!! Pros : All rounder member. (Her talents similar likes Mia and E:U.)Its suitable for Everglow Especially Concept and Perfectly All Position members.Yena was same Yuehua trainee with Sihyeon and Yiren. Maybe she looks easily for planned.Has some WIZ*ONE fans supported after joinned the group. For someone agreed for her.Cons : Concern after joinned in the group. she could possibly receive hate when she joins the group. (similar likes Red Velvet Yeri)Line/Screen Disbrutions for EVERGLOW hard to get more fairs.Returned the choreography from an older song. (Started to Debuted songs)Choi Yena can’t make different vibes. Mostly EVERGLOW members have strong for make different vibes. But Yena looks cuter than mature made hard for different vibes. *Thanks for requested. And I hoped Duckling Yena was possible at the future.* ",
            "date": "Answered August 27, 2020",
            "views": "697",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dorothy",
                    "user_href": "/profile/Dorothy-234"
                },
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Day Lilac",
                    "user_href": "/profile/Day-Lilac"
                },
                {
                    "user_id": "Luna Goodman",
                    "user_href": "/profile/Luna-Goodman-3"
                },
                {
                    "user_id": "Diya Bommala",
                    "user_href": "/profile/Diya-Bommala"
                }
            ]
        }
    ]
}