{
    "title": "What song do you first think of when you wake up in the morning? - Quora",
    "tags": [
        "Waking Up Early",
        "Mornings",
        "Waking Up"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Klugman",
                "href": "/profile/Rick-Klugman"
            },
            "answer_text": "I had my playlist running as I did my paperwork right before lights out. When I got up to pee, it was still rattling around up there in the ol' skull cavity. That's because there's nothing up there to stop it. So, I guess it should come as no surprise that it was still an ear worm when I got up this morning. I hesitate to play it because I'm getting ready to turn in which means it's going to be stuck in my head again all night. Dreadlock Holiday by 10cc , The song, written by frontman and bassist, Graham Gouldman, is losely based on a misguided vacation by Moody Blues frontman Justin Hayward in Barbados as he's confronted by four locals.  ",
            "date": "Answered August 2, 2017",
            "views": "12",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-10646"
                },
                {
                    "user_id": "Muhd Fitri Mohamad Fauzi",
                    "user_href": "/profile/Muhd-Fitri-Mohamad-Fauzi"
                },
                {
                    "user_id": "Brooks Hooper",
                    "user_href": "/profile/Brooks-Hooper"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Heather Crawford",
                    "user_href": "/profile/Heather-Crawford-15"
                },
                {
                    "user_id": "Alexander Goodwill",
                    "user_href": "/profile/Alexander-Goodwill"
                },
                {
                    "user_id": "Cassandra Sullivan",
                    "user_href": "/profile/Cassandra-Sullivan-2"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikayla Smith",
                "href": "/profile/Mikayla-Smith-49"
            },
            "answer_text": "I just got into kpop recently.... So when u woke up I had the song “baby” by ASTRO in my head when I woke up this morning, and what was funny is. I had a friend stay the night with me that night and we stayed up till 5 in the morning listening to kpop, but we listened to this one song so much I sung it in my sleep. My friend laghted so hard she woke me up and I started laughing after she told me why she was laughing. I don't know why, but at that moment I thought that was the worlds funniest thing and the lauhting lasted about 6 minutes. Lol!  ",
            "date": "Answered August 5, 2017",
            "views": "84",
            "upvotes": "0"
        }
    ]
}