{
    "title": "What is your opinion on music nowadays, and how has it changed? - Quora",
    "tags": [
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Schmidt",
                "href": "/profile/Nathan-Schmidt-2"
            },
            "answer_text": "Being attached to the music industry, I’ve actually spent a lot of time thinking about how musical tastes change. I’ll come back to that in a moment, but what I’d really like to point out is how access to music and entertainment has changed. I’ve always heard, and I was guilty of it myself when I was young, that if you can get access to your favorite music, without paying, why pay? The problem is that, if you like the artist and they’re not getting paid, then what incentives do they have to keep playing. It’s hard to eat on ‘likes’. Now while you didn’t come here to hear a lecture on paying for music, it fits into the equation. Music is something you can enjoy over and over. It’s generally not long, and can be the background to all sorts of situations in your life. The accessibility to that music continues to grow exponentially. This accessibility drives exploration, it doesn’t cost anything to try out other artists, song, genres…people can explore music in a way they’ve never been able to before in the history of mankind. Let that sink in for a moment. Now that you really absorbed the meaning and scope of music accessibility, we can start to talk about the genres and styles of music. This is really the most organic thing about the music industry, that try as they might to terraform the popularity of an artist or a type of music, they can’t. Music has inertia and it flows. It’s a flow of human expression and that human expression, just like water, is both a force and a reflection of those experiencing it. The music flows from the human experience like a river over time. And at no other time in history has the river been as big as it is with currents and tributaries jutting off in every direction, with the water of it’s flows so easily attainable by the average global participant. Just like rivers, you think about how they change the landscape around them. Rivers are a force in and of themselves, sometimes they cut away a piece of land and isolate a part of itself, like an oxbow, where maybe it keeps water in it, but it’s isolated in time, and gets rain water, like new artist to feed it, but the form/genre may evolve slowly, if at all, and could dry up, never to be heard from again. The headwaters that blaze new paths through time are muddy and full of debris, and sometimes hard to discern what is the water, but when they form some clear areas for people to enjoy, those areas of the river could become an offshoot, build a current with everyone being in it, or another river system of its own. Always running through time. That’s the thing about time. Time changes things, just like the river. Time is. The river is. Music is. It just flows and that we get to experience it at all, and now so much, and over time, it’s easy to look forward and to look back. But how it affects you is how it affects you, not me, or your friend. You can shares those experiences. Music unites. Music divides. Music bonds. Music separates. Music is what you want it to be. It’s easy to say I like genre X or genre Y…maybe it’s not the music, maybe it’s the reflection of the culture it was written for that you can’t understand, or won’t. Maybe it’s the sounds of an instrument that you don’t like or that you’re not familiar with. Maybe it’s a language you’re not used to or a way of expression that goes against your sensibilities. They are all OK and will exist, perhaps, whether you like them or not, but what is good music and what music lives on, captured in these massive silos of accessibility, is completely and totally up to you as the listener — the consumer — not the musicians. The musicians, you see, will keep making music, it’s up to you to decide what is good an what is bad but your vote of a listen. Listen responsibly. Don’t be passive. Share what you like with others. Go see shows! ",
            "date": "Answered April 4, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Saifuddin",
                    "user_href": "/profile/Sarah-Saifuddin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taylor Stacy",
                "href": "/profile/Taylor-Stacy-6"
            },
            "answer_text": "I’m a lot more picky than I used to be, even though I’m still a teen. Let me explain. At my high school, I am a part of one of the best performing arts programs in the state of Michigan. I, like many other musicians at my school, take private lessons. Mine happen to be in voice. This fact will be important later. All of this being so, I have a fairly adequate music education. My learnings have definitely contributed to how I view music, especially “radio music” (rock, pop, hip-hop, etc.) A good friend of mine (who has been taking lessons much longer than I have) once told me that once I started lessons, I would never hear the radio the same way again. She was right. I hear a lot of technical issues in voices, like bead breath support, strain, etc. I lost respect for many singers I thought were great. At the same time, however, I gained respect for artists that I never batted an eyelash toward before. I’m also very into literature, so poor lyrics “Gucci Gang, ahem) are something else I have an issue with. It’s not as “painful” to me as poor technique, but it’s something else that waves my opinion. In all, some artists I really like (purely music based): Lana Del Rey Lady Gaga Harry Styles Prince Halsey (lyric based love) Some artists I don’t like as much as I used to (musically): 5 Seconds of Summer Hey Violet Taylor Swift Melanie Martinez Adele (I still enjoys these artists’ songs, I just don’t hold them on as high of a pedestal as I used to.) I hope this answers your question! ",
            "date": "Answered April 4, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Colella",
                    "user_href": "/profile/Chris-Colella-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leland Shenfield",
                "href": "/profile/Leland-Shenfield"
            },
            "answer_text": "I am a classic rock and jazz fusion fan, and I hate music today. My daughter, however, has shown me a glimmer of hope. I grew up with music as a celebration of talent, skill, and originality. A way truly creative people made amazing music from nothing, crafting it fearlessly with skill, bravado. These musicians enjoyed their money and fame, but the music was what drove them. The Who, Led Zeppelin, Creedence Clearwater Revival, Janis Joplin, Weather Report, Yes, Rush, Stevie Wonder, The Rolling Stones, Bruce Springsteen (early), The Grateful Dead, David Bowie, The Clash, The Police … and many more. I find rap and hip-hop to be a commercialized wasteland of stolen music and repetitive garbage, and pop has been on the decline since Madonna dealt it a mortal wound. However, my daughter has introduced me to Sia, Adele, Imagine Dragons, Lady Gaga, the Chainsmokers, and others who, while not my cup of tea, at least deserve respect. ",
            "date": "Answered April 4, 2018",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Felipe Guerrero",
                    "user_href": "/profile/Felipe-Guerrero-1"
                },
                {
                    "user_id": "John Timpson",
                    "user_href": "/profile/John-Timpson"
                },
                {
                    "user_id": "Robert Douglas",
                    "user_href": "/profile/Robert-Douglas-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Timpson",
                "href": "/profile/John-Timpson"
            },
            "answer_text": "I am currently a college student, but I do not hold my generation’s typical taste for music. Not being able to appreciate more modern, electronic music prevents me from offering an unbiased response to this question, but I truly do think the digitalization of music will eventually kill all soul in music. The electronic drum beat forever changed music for the worse, in my opinion. I also think the digitalization of music tends to kill creativity as copying and sampling music are far easier to pull off today (this is not to say that copying and sampling haven't existed for decades). Furthermore, new alternative methods of paying for/accessing music have changed the way a lot of artists pursue commercial success and popularity. With the rise of hip-hop, EDM, and online platforms for sharing music (often for free), artists are less inclined to reach fame through live performance; popularity on the internet is a lot more important for making a break in the music industry for rappers, producers, and DJs. Thus, live music has a reduced role in our society. ",
            "date": "Answered April 4, 2018",
            "views": "1",
            "upvotes": "0"
        }
    ]
}