{
    "title": "What caused Dr. Dre and Tupac's beef? - Quora",
    "tags": [
        "Rap Feuds",
        "Dr. Dre (musician, business person)",
        "Tupac Shakur (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Corrigan",
                "href": "/profile/Andrew-Corrigan-13"
            },
            "answer_text": "Tupac and Dre never really knew each other; the opportunity of working with Dre was a major factor in Tupac’s move to Death Row records; but the timing was off - Tupac was joining as Dre was on his way out. The bit that everyone knows about is that when Dre had beef with Suge, Pac sided with Suge (I mean, Suge was Pac’s boss, so what did you expect?). However, back in 92/93 ish Pac started to have a few issues with Dre. Now, these issues are mainly rumoured, as far as I’m aware - there was an instance when Dre supposedly took some content from Pac’s notes, forcing Pac to scrap an entire album. Howeber, one thing that seems bigger than others revolves around one dude in particular: Snoop Dogg… When Snoop got charged for murder in 93 (later acquitted); Dre didn’t testify. That is apparently what made Pac so mad with Dre. Suge’s beef with Dre was the catalyst for the beef, but it had been simmering within Pac since the early 90s; the main fuel for the fire being Snoop’s trial. ",
            "date": "Answered April 29, 2019",
            "views": "278",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Owen Holland",
                    "user_href": "/profile/Owen-Holland-10"
                },
                {
                    "user_id": "Johnny B. Goode",
                    "user_href": "/profile/Johnny-B-Goode-20"
                },
                {
                    "user_id": "Nick Iulianelli",
                    "user_href": "/profile/Nick-Iulianelli"
                },
                {
                    "user_id": "Hamza",
                    "user_href": "/profile/Hamza-490"
                },
                {
                    "user_id": "Connor The Legend",
                    "user_href": "/profile/Connor-The-Legend-1"
                },
                {
                    "user_id": "Yash Vagal",
                    "user_href": "/profile/Yash-Vagal-1"
                },
                {
                    "user_id": "Anatolii Lichman",
                    "user_href": "/profile/Anatolii-Lichman"
                },
                {
                    "user_id": "Khanyiso Kameni",
                    "user_href": "/profile/Khanyiso-Kameni"
                },
                {
                    "user_id": "Dan Baker",
                    "user_href": "/profile/Dan-Baker-98"
                },
                {
                    "user_id": "Kollin Zullo",
                    "user_href": "/profile/Kollin-Zullo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khanyiso Kameni",
                "href": "/profile/Khanyiso-Kameni"
            },
            "answer_text": "There was no real beef between Dre and Pac. There was tension borne of the business discord between Dre and Suge. Pac, being the rebel rouser that he was, and because of his loyalty to Suge (for paying his bail bond) took sides and that put him at odds with Dre. After Murder Was The Case, Suge started feeling like he should be getting the recognition that Dre was getting. He felt that the artists of Death Row weren't giving him enough respect as the man who put the label where it was, and he made sure that Pac *knew* it was him who'd paid his bail, and as a result, Pac felt endebted to Suge. And with Pac's status, Suge didn't think he needed anybody else. All he needed was Pac. And it would have worked too. But Pac and Dre would have eventually settled their differences. I'm sure of it ",
            "date": "Answered March 2, 2020",
            "views": "51",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Johnny B. Goode",
                    "user_href": "/profile/Johnny-B-Goode-20"
                },
                {
                    "user_id": "Ryder Wright",
                    "user_href": "/profile/Ryder-Wright-1"
                },
                {
                    "user_id": "Jorjah-Kourtney Roberts",
                    "user_href": "/profile/Jorjah-Kourtney-Roberts"
                }
            ]
        }
    ]
}