{
    "title": "What type of government does Myanmar have today? - Quora",
    "tags": [
        "Politics of Myanmar",
        "Myanmar (Burma)",
        "Politics and Government",
        "Southeast Asia",
        "Classification Question",
        "International Travel",
        "Government",
        "Countries of the World"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asif Reza",
                "href": "/profile/Asif-Reza-8"
            },
            "answer_text": "Myanmar now has a dysfunctional democracy where a hybrid arrangement with the Tatmadaw (Myanmar Armed Forces) heavily tilt the state machinery to favor military’s vested corporate interests. The constitution is written with sole purpose to keep Myanmar as it is, ‘A government of the Military, by the military and for the Military’. The Myanmar’s government and military (one and the same) is infamous for it’s greed for looting nation’s resources and mating out extreme brutality on any person or group or ethnicity who could not agree to the unjust system. This is the sole reason why the legitimacy of that government suffers in the eyes of the masses and national unity and democratization is not achieved. ",
            "date": "Answered June 9, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aung Thant Kyaw",
                "href": "/profile/Aung-Thant-Kyaw-3"
            },
            "answer_text": "To be Frank, Myanmar(Burma) is not a fully democratic country yet because of its 2008 constitution that was drawn by Former Military Government. According to 2008 constitution, Myanmar has three main legislative parliaments and Union Parliament (Pyidaungsu Hluttaw) is the highest legislate parliament among them. 75 percents of seat (75% of MPs) in each parliaments are elected by results of the general election and other 25 percents of seat (Military's representatives) in each parliaments are appointed by Commander in Chief of Myanmar (Current Senior General Min Aung Hlaing) who is the head of Myanmar Militarity. He appoints Minister of Home Affairs, Minister of Defence and Minister of Border Affairs. Elected civilian government can't appoint those three Ministers. But On the other hand, President or State Counsellor can appointee other ministers such as Minister of Health, Minister of Education, Minister of Finance, Minister of Foreign Affairs. Current President- U Win Myint is the head of State and Current State Counsellor- Aung San Suu Kyi is the head of Government. ",
            "date": "Updated June 8, 2020",
            "views": "695",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyaw Ye Lynn",
                "href": "/profile/Kyaw-Ye-Lynn"
            },
            "answer_text": "If I say clean government, many people will laugh and make a joke about me. However, I have to answer that Mr.president is not that bad what the others think. He is always trying to clean the shit of his fellows. Many burmese always sit oppsite side of military. They don't find out what the reasons are. They just did the opposite of military men. Disunity is like a disease among us and contagious. You can see evidence on social media such as fb. I concede that it is our burmese weakness. Whatever the others say that the government is good or bad, I will always stand with the government because as you know, it is the only way to overcome our burmese disunity. ",
            "date": "Updated August 24, 2018",
            "views": "58",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyawzaya Htwe",
                    "user_href": "/profile/Kyawzaya-Htwe"
                },
                {
                    "user_id": "Ayushman Shukla",
                    "user_href": "/profile/Ayushman-Shukla-8"
                },
                {
                    "user_id": "Albarsun Salam",
                    "user_href": "/profile/Albarsun-Salam-1"
                },
                {
                    "user_id": "Nemish Emrald",
                    "user_href": "/profile/Nemish-Emrald"
                },
                {
                    "user_id": "Theta Aye",
                    "user_href": "/profile/Theta-Aye"
                },
                {
                    "user_id": "Trixie Dzyre",
                    "user_href": "/profile/Trixie-Dzyre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hlwan Moe",
                "href": "/profile/Hlwan-Moe-1"
            },
            "answer_text": "Due to 2008 constitution, we have lame government, A tiger without teeth. On the other-hand, Myanmar military still have a power to dominate the internal and external affairs. Well, of course, majority of Myanmar Parliament members are lame brain too. This is why most of policies are failed and fucked up. They even approved underage marriage. They don’t know how to build economy instead implementing garbage new regulations and laws which either burdens or complete useless for citizens. ",
            "date": "Answered December 3, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ye Naing Soe",
                "href": "/profile/Ye-Naing-Soe"
            },
            "answer_text": "Myanmar Government call it as discipline-flourishing democracy. But it actually is quasi-military democracy where 25% of members of parliament in so-called upper and lower houses are directly appointed by commander in chief of military. Hence, amendment of constitution and enacting bill/laws etc which require votes from more than 75% of MPs is hard to achieve. ",
            "date": "Answered March 16, 2015",
            "views": "55",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaleen Shrivastava",
                    "user_href": "/profile/Shaleen-Shrivastava-1"
                },
                {
                    "user_id": "Hein Wai Yan Kyaw",
                    "user_href": "/profile/Hein-Wai-Yan-Kyaw"
                },
                {
                    "user_id": "Ayushman Shukla",
                    "user_href": "/profile/Ayushman-Shukla-8"
                },
                {
                    "user_id": "Htay Khaing",
                    "user_href": "/profile/Htay-Khaing"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mir Ahmed Siddiquee",
                "href": "/profile/Mir-Ahmed-Siddiquee"
            },
            "answer_text": "The Myanmar is a so call democratic govt but hammer on her head “Military.” Therefore it is nothing rather than worse than dictatorship. Suu Kyi’s sweet words are almost covering the pressures of the world for Democratization but for ethnic cleansing issue is wide spread to the UNSC. Suu Kyi’s fascism is even worse than BSPP’s dictators. ",
            "date": "Answered June 3, 2018",
            "views": "893",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anupam Kumar",
                    "user_href": "/profile/Anupam-Kumar-346"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mya Juliet",
                "href": "/profile/Mya-Juliet"
            },
            "answer_text": "It’s a “representative democracy”. I put air quotes because it is not a true democracy. There is 25% guranteed seats for the military. Also the NLD party is so dominant. ",
            "date": "Answered May 21, 2018",
            "views": "363",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerhard Reus",
                    "user_href": "/profile/Gerhard-Reus"
                }
            ]
        }
    ]
}