{
    "title": "What are fretless bass guitars for? - Quora",
    "tags": [
        "Fretless Bass",
        "Bass Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Pavlik",
                "href": "/profile/Derek-Pavlik"
            },
            "answer_text": "Fretless bass guitars are mainly to cover the lower end of the tonal spectrum in a band or song, similar to how a fretted bass does. However, they can add extra dimensions of playing that a fretted bass can not. These extra dimensions really come to the forefront in certain genres of music where expression of playing can stick out a little (i.e. more in jazz as compared to your basic drop-C nu-metal tune where you don’t hear anything except drums and the fuzz of the guitar distortion). However, many people think of only jazz when it comes to fretless, so to answer the question more fully I’d like to point out some other uses others might have heard already. Disclaimer: I answer from the perspective of someone who didn’t used to like the sound of the fretless bass. It always sounded too warbly and it detracted from the power of the bass note. Furthermore, it was much more difficult to play in my own hands than a fretted bass was. A few millimeters off and your note sounded terrible. Who needed it? Of course, one can grow… Now I realize that to understand the greatness of the fretless bass you have to appreciate subtlety. For instance, they say that the great guitarists aren’t players who can just play the notes, but add all sorts of inflections and bends and whatnots, thereby enhancing the emotion of whatever it is they are playing. Now you can have a MIDI program pound out 64th notes to your heart’s content (and there are players who play in the same manner) but it doesn’t generally doesn’t elicit a whole lot of feeling (nor sound as good) into the song as say, bending or glissando-ing into a note versus playing the note outright. However, you have to be able to appreciate the added textures, otherwise it does sound like just a regular old boring note. So, if you can’t tell the difference between a string of notes played by, say, Dave Gilmour and a old-timey 8-bit Nintendo machine, the fretless isn’t for you. But with that idea in mind, the fretless bass allows the bassist all sorts of additional methods for which they can add to the song (but yes, it is much more difficult to hit the right notes, especially when play higher notes). For starters, with fretless basses you are never playing a single note like you are on a fretted bass (since you are playing the note at the fret, which is at a fixed position). On a fretless, no matter how still you think your fingers are on the note, re you are still playing a multitude of notes that are a fraction of a semi-tone off from each other. It is too minimal for the ears to pick up on other than it creates a thicker tone. If you let your fingers move at all, you create some lovely vibrato, which can be done on a fretted bass as well, but vibratos on the fretless sound much different and thicker on a fretless. For me, the most obvious beauty of the fretless come in slides. When you slide down to a note on a fretted bass, you must move in semi-tones. While this still sounds pretty cool, on a fretless you are literally moving through the entire tonal spectrum down to that new note. Depending on the context of how it is done within the song, it adds so much more than the fretted bass slide. It is even more beautiful when you play harmonics and then slide those (this is actually much easier on a fretless). Finally, there is something about higher pitched notes played on a bass that can sound so lonely and beautiful, coated in the extra overtones that only it’s thicker string can create. It is the sound of a powerful warrior’s gentler side (imagine Conan the Barbarian caring for a baby rabbit? - I don’t know, it is hard to explain). Anyway, this effect is greatly amplified on a fretless given the previously explained thicker notes. Okay, some proof. Hmmm, Jaco was great, sure, but there are many more great songs/players which featured the fretless, which I proffer in hopes that whoever is reading this doesn’t make the same mistake I made in not appreciating the fretless sooner. Pink Floyd - “On the Turning Away”. Tony Levin plays a tasty little fretless bit after the rest of the band cuts away (at about the 2:30 mark) which segues into a more powerful repeat of the chorus. This is also kind of an example of those sad and lonely notes I was referring to on the bass. Can’t do that on a fretted bass.Victor Wooten - normally Vic is playing a fretted Fodera, but one especially tasty use of the fretless is on the song Hall of Mirrors where he plays a 5-string fretless and makes great subtle use of the low B string along with all sorts of integrated little slides.The Police - “King of Pain”. Probably should have led with this one as it was a huge hit in the 80s. I don’t think Sting used a fretless often, but if you’ve got the ear you can tell it is a fretless in the beginning due to the thickness of the tone (although bass chorus can also produce that tone, to be fair) but the beauty starts in the prechorus at about the 50 second mark (starting with the lyrics “I have been here before in the pouring rain) where every line ends on a tasty little slide. Does it make you more sad than a fretted bass? I am guessing yes. Again, it is all about subtly, but you can’t put that kind of emotion into a fretted slide.Michael Manring - outstanding solo bass player who uses a variety of Zon fretless basses. His playing is so brilliant just listening to him taught me how to do sliding harmonics. My faves tend to be more cerebral such as Selene and Blue Orleans but the first song I’d recommend is the more upbeat Monkey Businessman. Can’t do that stuff on a fretted bass.Gordian Knot (Sean Malone) - GK was spearheaded by bassist Sean Malone which features a collection of fabulous musicians making some fantastic progressive rock characterized by masterfully created peaks and troughs within the same song (fast and slow parts). Sean’s oft-played fretless bass sounds good the whole way, but really shines in the slow parts. I’ve never met anyone who has even heard of Gordian Know and that makes me sad. But, for a great example of the power of the fretless, check out the song Muttersprache or even Rivers Dancing or Some Brighter Thing (both include little fretless solos in the middle). The ending of Some Brighter Thing is a great example of how a fretless bass can sound so sad and lonely, at least to me.Shadowfax - I regret I never got into these guys as much, but a particular song by the name of “Road to Hanna” always stuck out to me just for the mastery of the fretless bass. I literally listen to the song just for it.I could go on but should already apologize for the length here. ",
            "date": "Answered September 14, 2018",
            "views": "536",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                },
                {
                    "user_id": "Dillon Fornia",
                    "user_href": "/profile/Dillon-Fornia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nickus",
                "href": "/profile/Eric-Nickus"
            },
            "answer_text": "For more jazz and r & b sounds and any styles where you don’t want a hard kind of electric bass sound. After all the first bass was an upright bass, so they have no frets. If you want to learn to play fretless, you have to reinvent your fretting position, as you need to place your fingertips down ON the lines where the frets would be , NOT right up to them almost on top of it , like on a fretted instrument . It takes extra effort at first to know where to put your fingers, and it makes kind of a different sound, like you can play around with the note and make it go slightly up or down without bending the string by moving your fingering position. These guys that are good at fretless have practiced for hundreds of hours to know where the lines (frets) are . Luckily for most of us, some fretless instruments have the lines painted on them now. ",
            "date": "Answered September 11, 2018",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Philip Klossner",
                    "user_href": "/profile/Philip-Klossner"
                }
            ]
        }
    ]
}