{
    "title": "What is the best way to mix and master your music without monitors? - Quora",
    "tags": [
        "Audio mixing (recorded music)",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyler Michaelson",
                "href": "/profile/Kyler-Michaelson"
            },
            "answer_text": "There are a few points to cover so bear with me. First it is advisable to have a different person master the song than the person who mixed it. The reason for this is the same as the reasoning behind getting a friend to proof read your essay before you hand it in. Their ears may hear something that you have become oblivious to through repeated listening to the same song. They will also offer their own unique perspective on the mix and make some adjustments that you may never think of. If you have to master it yourself that is ok. Just realize that you will be missing out on the opportunity to get fresh ears on the project at a crucial phase. Second, if you have decided to mix and master your own song then there are some good practices to be aware of. If you have no monitors then you need some good headphones. Use these to mix your tracks, but keep in mind that mixing in headphones will often cause your mix to be bass heavy and over saturated with reverb and delay effects. These effects sound different in headphones than they do on monitors. This is why it is important to listen to your mix in your car, on your earbuds, on a small radio, and on as many other listening devices as you can. You will hear different problems on each different system that you can fix in the mix. Third, it is important to use a reference song. Choose a song that sounds close to the way you want your song to turn out. Go back and forth from your song to the refernce song. Look at both on a spectrograph. Try to determine what makes the reference sound the way it does. Last, trust your scopes and meters. During mastering you need to use your eyes as well as your ears. Your monitors (or lack there of) are less than ideal, and as such can't be trusted wholeheartedly. You need as many other points of reference as you can get. Use your scopes and meters as a second guide. It might sound great in the headphones, but the meter shows a big soike around 40hz. That is because the headphones have a dead spot in that range. Trust your eyes to guide your ears in this situation. Listening to it in the car and everywhere else will also help with this. The goal in the mastering phase is to get your mix to translate to as many different types of stereos and speakers as possible. ",
            "date": "Answered August 10, 2019",
            "views": "84",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Porro",
                "href": "/profile/Chris-Porro-1"
            },
            "answer_text": "first off the biggest hurdle for you is going to be learning how to mix. but without monitors…get some good headphones. i’m not talking about the consumer stuff which has a hyped/distorted freq response. i’m talking about studio monitors. i have some really old akg 240s and newer beyerdynamic dt880 pros. both were between 200–300 when i bought them. they are both open headsets which i recommend because of resonances. the point is you want headsets that accurately reflect what you recorded. that’s the point of all monitors. you need to hear what was recorded…not a distortion of it. here is the deal. i think with enough time, mistakes, frustration, and workarounds you can mix on some $10 earbuds. so how much is your time and sanity worth? i think my dt880s were well worth it. even with the dt880s you are still going to have to listen in a few different environments, use reference mixes, and probably visually check the low end (, 50hz) with software. i think a lot of people don’t understand what mixing engineers actually do. there is a lot of skill involved. it’s not just pushing faders. you might want to consider hiring a pro. spend your time writing music…not pulling your hair out. : ) ",
            "date": "Answered August 11, 2019",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Reece Surreal",
                    "user_href": "/profile/Reece-Surreal-1"
                }
            ]
        }
    ]
}