{
    "title": "What song did you love but now hate? - Quora",
    "tags": [
        "Song Identification",
        "Hate",
        "Songs",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ezra Fabrick",
                "href": "/profile/Ezra-Fabrick-6"
            },
            "answer_text": "tw//nsfw Freaky Friday by Lil Dicky and Chris Brown. I’ve watched a lot of movies since the pandemic hit. Recently though, I’ve watched some of the Freaky Friday movies (the Disney ones, I think there’s more movies than the Disney ones? I digress). And needless to say, I have learned a couple of things from watching these: I’ll never wish to be someone else unless I can be Obi Wan Kenobi in Mandalorian armor. Then I’ll wish to be Obi Wan Kenobi in Mandalorian armor.This song got the entire premise of Freaky Friday wrong. Very, very, wrong.I’m going to summarize the Lindsay Lohan one and compare it to the song (the music video is based off the Chinese restaurant thingie, plus I think this one is the most well known), and I’ll then explain what they got wrong. Freaky Friday movie: Anna and her mother switch bodies after arguing in a Chinese restaurant the night before her mom’s wedding rehearsal and eating a magic fortune cookie. They have to pretend to be each other (obviously), and while doing that they learn about each others struggles (Anna’s band and her school life, her mom’s patients and being on a show unannounced, etc.) and begin to understand each other. They then switch bodies back at the end because Anna’s mom tells her to postpone the wedding she was having to make Anna happy, but Anna decides to get “married” to him because he made her mom happy. The song (I’m also going to use a part from the music video because it’s connected to the song and is important) Lil Dicky is upset that he’s not more famous. Chris Brown is upset that he’s too famous. They both wish to be someone else for a day, so they switch bodies. Lil Dicky is like “cool, I’m Chris Brown now and fucking famous so I cAn sAy tHE n wORd nOW”, plus posting his dick on Twitter because apparently consent doesn’t exist? Meanwhile, Chris Brown is in Dicky’s body, and enjoys white privilege, not being famous and being able to wear blue now even though he’s a blood, before freaking out because he realizes Lil Dicky has his body and he’s being an idiot in it (i.e. shouting “I’m Chris Brown”, posting his dick on Twitter, wondering if he even sent his kid to school, etc), before showing up to a club where Dicky in his body is at. He doesn’t want to let Chris in, so Chris goes full psycho mode and tries to attack Dicky, before they realize they shouldn’t kill each other and apparently they need to “love each other more” before switching back? Oh yeah, and then Lil Dicky jumps into Ed Sheeran’s body, saying it’s not as cool as being Chris Brown, shouts “I’m DJ Khaled!” in DJ Khaled’s,and violates Kendall Jenner’s body while in hers.  Let’s review what’s wrong with this: In the Freaky Friday movie, Anna and her mom learn to appreciate each other and understand their struggles. In this song, we learn it’s awesome to be Chris Brown and that Lil Dicky doesn’t understand the concept of consent.A ton of things go wrong in the movie. Like, a ton. (Examples: Anna being on a show about her mom’s book, and as she hasn’t read it, she goes off on a funny tirade. Her mom performing with Anna’s band and not knowing how to play guitar, so Anna in her mom’s body plays guitar from backstage.) Nothing other than “oh shit Dicky put my dick on Twitter and my daughter may or may not be in school” goes wrong in this song. I know it’s a song, and won’t be as long as a movie (for obvious reasons), but they could both at least learn to understand the struggles of being famous/trying to get famous or something.If the song wanted to parody the movie, cool. But try to keep it accurate, a tiny bit, or at least make it make sense if you’re going to deviate. The message made no sense. Why would Chris Brown need to love himself more? Also, having stuff go wrong is interesting. It’s funny.  Another thing: why is Lil Dicky such a creep? I was 11 when this song came out, and didn’t really understand that what Lil Dicky was talking about was creepy and wrong but I’m 14 now and fucking understand now. Apparently, he thinks it’s okay to post Chris Brown’s dick on Twitter without his consent,and jerk off in Kendall’s body, again, without her consent. I know, I’m getting fucking heated over a song, but why is this in the song? (Also, I’m sure Lil Dicky wrote that part. If Chris and Kendall did, fuck them too. How did that even get approved as lyrics for the song?)  Finally, why Chris Brown? Why, out of all the people Dicky could’ve wanted to trade places with, did he choose one of the most terrible people in music? (Note: I like Chris Brown’s music, so Chris Brown stannies in the comments, don’t accuse me of being a jealous hater or whatever you want to come up with. I just don’t agree with his actions and can’t condone them.) Remember the part where Dicky is in Ed Sheeran’s body, and he thinks it’s not as cool as being Chris Brown? Bitch. Ed Sheeran Is Fucking Cool. He’s one of my favorite singers, isn’t in fucking legal trouble all the damn time, and was in one of my favorite movies of all time, Yesterday. (If you haven’t seen this movie: Even if you don’t like The Beatles or Ed Sheeran,watch the movie. You will not regret it. It’s one of the funniest, most wholesome movies I’ve ever seen.) Speaking of Yesterday, I have a better idea for how this song could’ve gone: What if Dicky was jealous because Ed gets to be in a movie that isn’t even about him, playing himself, and Ed was stressed because of the movie? What if they switched bodies, and Ed kinda got bored being Dicky or not being used to not being famous and getting upset because of it? What if Dicky had to figure out his lines in the movie, and just came up with his own? Better yet, what if the idea of Debra (Ed’s manager in the movie) or something like that didn’t exist, and Dicky came up with it? That’d be a cool song. But of course, we’re stuck with this mess. Sigh. ",
            "date": "Answered October 27, 2020",
            "views": "176",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elyssa Chao",
                    "user_href": "/profile/Elyssa-Chao"
                },
                {
                    "user_id": "Anthony Anderson",
                    "user_href": "/profile/Anthony-Anderson-528"
                },
                {
                    "user_id": "Madigan Spence",
                    "user_href": "/profile/Madigan-Spence"
                },
                {
                    "user_id": "Destiny Rivers",
                    "user_href": "/profile/Destiny-Rivers-27"
                },
                {
                    "user_id": "Rachel Levin",
                    "user_href": "/profile/Rachel-Levin-25"
                },
                {
                    "user_id": "Olie Turner",
                    "user_href": "/profile/Olie-Turner"
                },
                {
                    "user_id": "Dani Sofnar",
                    "user_href": "/profile/Dani-Sofnar"
                },
                {
                    "user_id": "Talia Sabbath",
                    "user_href": "/profile/Talia-Sabbath"
                },
                {
                    "user_id": "Victoria Hutt",
                    "user_href": "/profile/Victoria-Hutt-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hirak Ghosh",
                "href": "/profile/Hirak-Ghosh-13"
            },
            "answer_text": "Originally Answered: What song did you love but now hate? I once found Swalla(By Jason Derulo) quite catchy.. You know that Swalla la la part… Until recently.. I re-heard the song and interpreted the song the way it was meant to be. . Hate dat song now. ",
            "date": "Answered December 27, 2018",
            "views": "117",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anjali Sharma",
                    "user_href": "/profile/Anjali-Sharma-2609"
                },
                {
                    "user_id": "Akshita Agarwal",
                    "user_href": "/profile/Akshita-Agarwal-123"
                },
                {
                    "user_id": "Ankit Srivastawa",
                    "user_href": "/profile/Ankit-Srivastawa"
                }
            ]
        }
    ]
}