{
    "title": "What do you hate about modern music? - Quora",
    "tags": [
        "Modern Music",
        "Hate",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna Thomasson",
                "href": "/profile/Anna-Thomasson-2"
            },
            "answer_text": "Oh my lord. I’m so, so, sorry to people that wrote some of these answers. I truly am. But y’all are making yourselves into something that gen z has been mocking for years now. And hey, if you wrote a rational, calm, answer, congratulations! This isn’t meant towards you. So, onto who was meant towards: And are you capable of writing an answer without being nasty towards female artists that are *gasp* sexually promiscuous? The slut-shaming seems to be very one sided here… We get it. You probably listen to cool underground vintage bands that this dumb generation has probably never heard of, like Queen or Nirvana. You either miss the way the eighties were or you were “born in the wrong generation”. Look, lots of people like to reminisce about times past, and there are certainly tons of things to miss about the eighties: music, movies, celebrities, fun hair, mom jeans, scrunchies, the AIDS epidemic, artists like ACDC, Michael Jackson, Van Halen, the increasing racial discrimination during the “war on drugs”, Ronald Reagan, Baywatch, Michael Jordan. And I am LAUGHING out loud for the first time ever because of Quora answers. You can criticize people ALL day long and think whatever decade of music was better- sixties, seventies ,eighties, nineties. But holy crap y’all are sour! Even with such a charged question! Oh, the humanity! A lot of these answers seem fueled by vitriol of everything modern and mainstream, especially when it pertains to women & expressing their sexuality. Sorry, but is what y’all look like. The memes write themselves.    Caroline on TikTok Ben Ulmer on TikTok and yes, I put tiktoks as examples. Cry.   congratulations, you played yourself.  EDIT** Ladies and gentlemen, we are at 200 upvotes and about thirty comments, so if you’re wondering what being famous is like, just ask me. And I mean…I was a…tiny bit…snarky…in the answer. Just a little. Certainly not wound up from all the other answers at all. Reading this answer makes me realize I have become the very thing I swore to destroy: overly salty answers. It was rather cathartic. However, when asked to pick between my newfound fame and my moral code, fame wins out by a large margin. So I’ve decided to let the answer remain in all it’s divisive glory. EDIT 2** I cropped the name off, but if you find this answer please don’t harass! I really only included this because it is exactly the type of response or mindset that I wrote about. (this is not intended to bully anyone. I just think it’s a really weird coincidence) Let’s just play a “spot the difference” game between the first image I’ve posted and this answer.   Now look at the first image I posted on this answer. Corporate wants you to find the difference between the two pictures. They’re the same picture. ",
            "date": "Answered March 23, 2020",
            "views": "327",
            "upvotes": " View 1.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samuel Marik",
                    "user_href": "/profile/Samuel-Marik"
                },
                {
                    "user_id": "Mystic CraneGod",
                    "user_href": "/profile/Mystic-CraneGod"
                },
                {
                    "user_id": "Thn Mints",
                    "user_href": "/profile/Thn-Mints"
                },
                {
                    "user_id": "Shristi",
                    "user_href": "/profile/Shristi-73"
                },
                {
                    "user_id": "Valdina Fuller",
                    "user_href": "/profile/Valdina-Fuller"
                },
                {
                    "user_id": "Quan Nguyen",
                    "user_href": "/profile/Quan-Nguyen-143"
                },
                {
                    "user_id": "Wahid",
                    "user_href": "/profile/Wahid-37"
                },
                {
                    "user_id": "Rishi Chava",
                    "user_href": "/profile/Rishi-Chava"
                },
                {
                    "user_id": "Oluwadara",
                    "user_href": "/profile/Oluwadara"
                },
                {
                    "user_id": "David Ciske",
                    "user_href": "/profile/David-Ciske-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lea Sing",
                "href": "/profile/Lea-Sing-1"
            },
            "answer_text": "There are multiple things I hate about modern music, so I am just gonna split this answer into multiple sections. As this answer would get too long otherwise, I am solely going to concentrate on today’s pop music (which undoubtedly is the genre with the most problems in today’s times). (Most) modern music lacks individuality Especially while listening to today’s pop music, I always hear the same instrumentals, the same voices, the same theme. Individuality is important to me when it comes to music, because music should be used to express yourself, but today’s music industry doesn’t care about all that. It’s just about the money you can make with a specific artist, that’s why there are literally no differences in lyrics. Let’s be honest here, most popular music of today has one of the following themes: LoveBreak-upSexDrugsHeartbreakIt feels like people nowadays only think about these things, when there’s so much more you could express in music. Hell, lyrics aren’t even really necessary to make great music. I love to listen to some instrumental music, especially piano music. Overrated artists Another one of my personal pet peeves about modern music is that many of these “artists”, are completely overrated and get all the hype without being any better than others. You can tell me what you want but this girl:  doesn’t have anything about her that differentiates her from other pop artists besides being edgier than average. Obviously, I don’t personally know her, she might be a great person, but her music just feels…bland. And I really don’t like her way of singing. I didn’t listen to all of her songs (simply because the genre in itself doesn’t interest me), but her voice in “bad guys” was just really off-putting to me. She sounded like she was on drugs or just really tired while singing. I know that that’s probably intended, but it doesn’t make it any better. I am not saying she doesn’t have talent, because she definitely has potential, but the way she presents her music just isn’t my cup of tea at all. She obviously tries to be different than other artists, but makes a fool out of herself while at it. And Billie Eilish is only one example of many. I can’t stand most pop artists, but it all comes down to the themes of their songs, the way they sing or how they present themselves. Most of them aren’t that talented to justify the hype. Song writers get almost no recognition at all There’s also the problem that many artists of today don’t write their own music, yet they still earn more than many artists that do so. What’s even worse is that they practically get the fame for something another person did. Imagine putting all of your effort into writing a song just so your younger sibling (or a friend, it doesn’t really matter) gets famous for it just because they happen to sing it, while you remain completely unnoticed. I would feel underappreciated and ignored and almost like a “slave” to the singer. I know it’s their job most of the time, and the song writers might not even be bothered, but it’s still a very lame system if you ask me. Profit =/= Effort Another pet peeve of mine is how unfair the whole profit system of modern music is. There was another great answer to this question in which the author criticized how people like Eilish earn more than people who studied years to play in musical orchestras. They undoubtedly put more effort into their work, yet they remained completely unnoticed, while some 17 year old girl just sings something she hasn’t even written completely by herself and gets all the fame and money for it.  So what do I hate about modern music? lacks individuality (same themes, same lyrics, same music all over again)overrated artistsmany singers profit from the creative work of another personpeople that put more effort into their music don’t get as much fame as people who do much less",
            "date": "Updated October 19, 2019",
            "views": "285",
            "upvotes": " View 713 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Intan Nurani",
                    "user_href": "/profile/Intan-Nurani-1"
                },
                {
                    "user_id": "N. Engelika",
                    "user_href": "/profile/N-Engelika"
                },
                {
                    "user_id": "Maru Garelli",
                    "user_href": "/profile/Maru-Garelli"
                },
                {
                    "user_id": "Scarlett E. Peach",
                    "user_href": "/profile/Scarlett-E-Peach"
                },
                {
                    "user_id": "Ashwin Ashu",
                    "user_href": "/profile/Ashwin-Ashu-12"
                },
                {
                    "user_id": "Jeez Lazeez",
                    "user_href": "/profile/Jeez-Lazeez"
                },
                {
                    "user_id": "Penny Lane",
                    "user_href": "/profile/Penny-Lane-246"
                },
                {
                    "user_id": "ARI ELIAS ZAMORA MARTINEZ",
                    "user_href": "/profile/ARI-ELIAS-ZAMORA-MARTINEZ"
                },
                {
                    "user_id": "Lilani van Deventer",
                    "user_href": "/profile/Lilani-van-Deventer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Baby-Girl-1440"
                }
            ]
        }
    ]
}