{
    "title": "What is the meaning of the Donovan song lyrics “They call me mellow yellow“ in the song Mellow Yellow? - Quora",
    "tags": [
        "Mellow Yellow",
        "Donovan",
        "Song Interpretation",
        "Music and Lyrics",
        "Song Meanings",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry Hrebien",
                "href": "/profile/Henry-Hrebien"
            },
            "answer_text": "There was a rumor circulating in the counterculture of the mid-1960s that smoking dried banana peels could get you a mellow high. The supposed psychoactive substance in the banana skin was bananadine, and there was a recipe in the Berkeley Barb, an underground newspaper of the San Francisco/Berkeley/Bay counterculture scene, on how to extract this substance from the skins. It appeared in the paper in March of 1967. It was, of course, a hoax. But the hoax was perpetrated as a tongue-in-cheek protest against the ethics of a government clampdown on the use of psychoactive drugs and hallucinogens by the youth of America, and by extension, the rest of the world that was tuning in, turning on, and dropping out, and in turn criminalizing a whole segment of the population that was using these drugs for the purposes of raising and expanding consciousness. LSD was in the works of being declared illegal that year, 1967. The CIA had been using LSD in experiments all through the 1950s and early 1960s on unwitting test cases in the military, in mental hospitals on patients and on volunteers and students on university campuses for the purposes of mind and behavioral control. But now, the experiment was running amok as more and more young people were turning on. The drug had leaked out of the laboratory, in a manner of speaking, and people like Ken Kesey were having their acid tests at Grateful Dead concerts. A clandestine chemist by the name of Augustus Owsley Stanley III was synthetically producing LSD and handing it out like candy to anyone and everyone at Grateful Dead shows and counterculture events. It didn’t help matters that people like Dr. Timothy Leary was advocating for LSD use among the masses and coming out with his book, The Psychedelic Experience, a manual on how to trip on LSD based on the Tibetan Book of The Dead. Dr. Leary was scaring the bejeezus out of parents with his advocacy for the drug because their kids were listening to him. So, the government was trying to put the genie back in the bottle, so to speak. The bananadine hoax was created to raise questions and spur discussions, ‘’what if banana skins have hallucinogenic properties, what is the government going to do, declare bananas illegal and prosecute people for having bananas in their possession?’’ This was the thinking behind the hoax. It caught on and the straight media fell for it. A New York Times Magazine article even appeared, Cool Talk About Hot Drugs. There were banana ‘’smoke outs’’ held in Berkeley, California and at a Be-In in Central Park in New York so-called hippies and beatniks chanted banana-banana while carrying around a wooden replica of a banana. This hoax happened about a few months after Donovan had recorded and released his song, Mellow Yellow, earlier in 1966. It got a lot of radio airplay and people hearing it as 1966 morphed into 1967, believed that the song was about this very thing, smoking banana skins gave you a psychedelic high. The lyrics even seemed to fit this notion. People just assumed that this was what the song was about and it rode on the crest of this wave. Part of the song lyric goes, ‘’Born-a high forever to fly, Wind-a velocity nil, Born-a high forever to fly, If you want, your cup I will fill.’’ Well, if that doesn’t suggest taking a trip by filling a pipe bowl with this mellow yellow stuff, then what does? But earlier in 1966, the Velvet Underground had released their debut album, The Velvet Underground & Nico, which featured on its cover sleeve a yellow silkscreen banana created by Pop artist and the impresario/manager of the Velvets, Andy Warhol. The original album’s banana was a sticker and the rumor was that the banana sticker could be peeled off and licked as the glue was laced LSD. Of course, this too was a hoax. But both, the Mellow Yellow song and the Velvets album sleeve were just chance coincidences. Both were happening before the bananadine hoax was perpetrated. Weird how they seemed to slip with ease into the zeitgeist of the times. Donovan says that the Mellow Yellow of the song was about being cool and mellow and the ‘’electrical banana, is gonna be a sudden craze, electrical banana is bound to be the very next phase’’ mentioned in the lyrics was about a new sex toy that had just appeared around that time, the vibrator. He also references a like for all things yellow. After all, yellow is a very sunny and warm, comforting color. For instance, the song starts with the lyrics saying, ‘’I’m just mad about saffron, saffron is mad about me.’’ Saffron is a spice that adds a distinct yellowy-orange color in food preparation. Who hasn’t had saffron rice in an Indian restaurant? In his late teens, Donovan and his friend Gypsy Dave hitchhiked and vagabonded around the U.K. and he has recalled fondly in his biography how when he and Dave found themselves penniless, hungry, and far from home, a kind lady that ran a bakery shop fed them with saffron cake. This experience could be what he is referring to in the song lyric. Donovan admits that he first heard the rumor of smoking banana skins about three weeks before Mellow Yellow was released as a single. The source of the rumor, according to him, was Country Joe McDonald of Country Joe & The Fish, a Bay area psychedelic band. So, there you have it, the song was written and recorded before he even heard the rumor. It is just happy trippy hippie synchronicity that all of this occurred at about the same time and that Donovan’s lyrics seemed to fit neatly into the hoaxer’s purposes before he even heard the rumor about smoking banana peels. Of course, there were gullibles who followed the Berkeley Barb recipe and did not get high. The U.S. Food and Drug Administration even conducted its own investigation into the supposed psychoactive properties of banana skins and have since debunked the whole myth. ",
            "date": "Updated June 28, 2020",
            "views": "671",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jerome Cohen",
                    "user_href": "/profile/Jerome-Cohen-6"
                },
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "Thomas Alan Bishop",
                    "user_href": "/profile/Thomas-Alan-Bishop"
                },
                {
                    "user_id": "Allen Thompson",
                    "user_href": "/profile/Allen-Thompson-3"
                },
                {
                    "user_id": "Richard Bold",
                    "user_href": "/profile/Richard-Bold-3"
                },
                {
                    "user_id": "Louis Costa",
                    "user_href": "/profile/Louis-Costa-6"
                },
                {
                    "user_id": "Michael Uzar",
                    "user_href": "/profile/Michael-Uzar"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Davis",
                "href": "/profile/Phil-Davis-24"
            },
            "answer_text": "Many people thought the song was drug related. Donovan said it was just about being calm.The yellow reference and “electrical banana” lyric is about a yellow vibrator. Sure ruins the song for me since I was 8 years old and just thought it sounded cool! ",
            "date": "Answered February 4, 2020",
            "views": "191",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "Jim Grimes",
                    "user_href": "/profile/Jim-Grimes-4"
                },
                {
                    "user_id": "Michael Uzar",
                    "user_href": "/profile/Michael-Uzar"
                }
            ]
        }
    ]
}