{
    "title": "What would past people think of modern music? - Quora",
    "tags": [
        "Ancient Music",
        "Modern Music",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Conrad Gachne",
                "href": "/profile/Conrad-Gachne"
            },
            "answer_text": "If we go back 50 years, that puts us in 1967. The Beatles put out Sgt. Pepper and change pop music, the Stones are finding their sound and quickly growing as more than the anti-Beatles, The Beach Boys are still relevant, The Who are turning into a proto-Prog band, Motown is putting out their best material, Pink Floyd releases their first album when Syd Barret was still around, Otis Redding puts out his last work, Sly and the Family Stone are busy inventing funk, and psychedelic music and socially conscious music make up a significant portion of new music. Most importantly, a “pop” radio station plays everything popular, so Johnny Cash, the Supremes and the Beatles might all get played in a row. Take a person from 1967 and put them in 2017, and they will notice a few things right away. First, music today is much louder than in 1967. Modern recording and storage allow music to be extremely loud. This applies to all genres; country and pop singers are as loud as hard rock bands on recordings. Second, modern recording allows for a clarity that the equipment of the 60s wasn't really able to achieve. If mixed poorly, modern recordings can sound harsh and have unpleasant artifacts in the sound. Done well, every aspect can be heard. Pop music is now a genre itself, and not a description. An entire song may have no humans except the singer, everything else can be synthesized on a computer. Radio stations now play specific types of music. You are unlikely to hear Taylor Swift and Lamb of God on the same station. Fairly quickly, our time traveler would notice that modern artists stay within boundaries. Artists that challenge the listener rarely get mass exposure today. Given the resources, our listener might find that there is more music than ever, and the most creative artists rarely find the success of more typical artists. Going back to 1967 is a little unfair, as so much incredible music came out in such a short time. 1987 or 1947 listeners might consider 2017 to be very diverse and creative. Interestingly, you can get an idea of what listening to music was like in 1967 without much effort. Radio stations playing 50s/60s/70s playlists usually play a little of everything from those decades, giving a glimpse into the times. I am more familiar with 1960s music and history. If I find the ambition, I'll come up with something for a 1917 listener. ",
            "date": "Answered June 20, 2017",
            "views": "18",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angelique Nunya",
                    "user_href": "/profile/Angelique-Nunya-1"
                },
                {
                    "user_id": "Jon Tron",
                    "user_href": "/profile/Jon-Tron-15"
                },
                {
                    "user_id": "Georgine Perino",
                    "user_href": "/profile/Georgine-Perino"
                },
                {
                    "user_id": "Bret Dop",
                    "user_href": "/profile/Bret-Dop"
                },
                {
                    "user_id": "Eric Montoya",
                    "user_href": "/profile/Eric-Montoya-15"
                },
                {
                    "user_id": "Marc Kerkmann",
                    "user_href": "/profile/Marc-Kerkmann"
                },
                {
                    "user_id": "Uditangshu Chakraborty",
                    "user_href": "/profile/Uditangshu-Chakraborty"
                },
                {
                    "user_id": "Grant Oscarson",
                    "user_href": "/profile/Grant-Oscarson"
                },
                {
                    "user_id": "Himal",
                    "user_href": "/profile/Himal-6"
                },
                {
                    "user_id": "Justin C. Erysthee",
                    "user_href": "/profile/Justin-C-Erysthee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Greif",
                "href": "/profile/Michael-Greif-2"
            },
            "answer_text": "I see some people got the question in the wrong direction. I think that past people would be shocked about how far music have come in only 50 years from their perspective if we take them from 1967 to now. Yet I secretly believe - since this can not be proven - that they would wonder about the amount of genres to chose from and how many musical genres seem so familiar. Yet we even re-discover music from the 60s and 70s. And then I think they would be thrown off a bit by more electronic music genres like techno or trance, the pumping beats and gadgets in trance and the monotonous rhythm of techno. Going 50 years farther and have those people come to 2017, I guess they would be shocked. Think how things were in 1917. And I really have to concentrate to just stay on the music argument. They would be shocked about the lack of conservatism and the diversity of music, let alone all the different ways to express music now. I believe playing some 90s heavy metal can inflict heart attacks in some decent 1917 people. Overall the more you go back in time to pick some individuals to listen to music from our times, the more you would find them to disagree with it. That is also my argument why we today should stop focusing on dead peoples music as well. The times have changed so much and so did the music. ",
            "date": "Answered June 21, 2017",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angelique Nunya",
                    "user_href": "/profile/Angelique-Nunya-1"
                },
                {
                    "user_id": "Jon Tron",
                    "user_href": "/profile/Jon-Tron-15"
                },
                {
                    "user_id": "Bret Dop",
                    "user_href": "/profile/Bret-Dop"
                },
                {
                    "user_id": "Justin C. Erysthee",
                    "user_href": "/profile/Justin-C-Erysthee"
                }
            ]
        }
    ]
}