{
    "title": "What is the best rock bass guitar sound ever recorded? - Quora",
    "tags": [
        "Bass Guitar",
        "Guitars",
        "Rock Music",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cody Bunting",
                "href": "/profile/Cody-Bunting"
            },
            "answer_text": "Oooooh, there are a lot of answers to this one, thanks for the A2A, I’m excited to weigh in. Being that there are TONS of amazing bass lines in the rock genre, I’m going to try to think of my favorites and give you a couple links. They’re going to be based on memorability, infectiousness, and creativity. These are in no particular order. Black Sabbath - Hand of Doom As far as I recall, I think this was the first time I heard bass in a rock song and remember thinking “Wow, bass can actually be really cool”, I think I was 11. Slow, brooding, but still groovy. Listening to/Playing this bassline is very soul satisfying. As we all know, Geezer Butler is a king of making truly catchy lines.Memorability: 10Infectiousness:10Creativity:8 2. Truckfighters - Momentum  This song is a long standing favorite of mine. The minimalism and indifference of the music is so wonderfully calming, and the bass in this song is no exception. It’s harmonized with the guitar, and panned left I believe. The combination results in this silky, mellow, almost sleepy vibe. Not a well known song by any extent of the imagination, but it’s in been in my playlists consistently for at least 4 years. Memorability: 10Infectiousness: 10Creativity: 10( I’m a little biased ;) ) 3. Blind Melon - Tones of Home  Usually not a band people think of when someone says bass guitar, but Brad Smith was an extraordinarily groovy player. The bass in the background of this song is catchy in and of itself. The first few seconds of the song have a really nice pseudo-solo, and there’s something to be said for playing bass lines that really meld the rest of the song together, which he does with flying colors.Memorability: 6Infectiousness: 8Creativity: 10 I’m going to cut myself off at 3, I don’t want to over load you on good music to listen to, but I could go on all day. :) Thanks again! ",
            "date": "Answered March 10, 2017",
            "views": "33",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Elliott",
                    "user_href": "/profile/Joseph-Elliott-64"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Julian Gallagher",
                    "user_href": "/profile/Julian-Gallagher"
                },
                {
                    "user_id": "Michael Vaughan",
                    "user_href": "/profile/Michael-Vaughan-21"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "Roger WIlcox Cloud",
                    "user_href": "/profile/Roger-WIlcox-Cloud"
                },
                {
                    "user_id": "Daniel Sena",
                    "user_href": "/profile/Daniel-Sena-4"
                },
                {
                    "user_id": "Jeremy Bloch",
                    "user_href": "/profile/Jeremy-Bloch"
                },
                {
                    "user_id": "Daniel Ruffin",
                    "user_href": "/profile/Daniel-Ruffin-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonny Fourie",
                "href": "/profile/Jonny-Fourie"
            },
            "answer_text": "Since the touchstones have been covered, I’m gonna pretend you said Since the touchstones have been covered, I’m gonna pretend you asked “What is the best rock bass guitar sound ever recorded this Millennium?” A dark horse. Fantastic bass tone. Different tones. It’s almost hard to pick the BEST bass recorded. His work on their 4th album Suck it and See is P bass into Ampeg B15 bliss and his work on their 2nd album Favourite Worst Nightmare is post punk tone and playing heaven. But… Nick O’Malley’s sound on Arctic Monkeys 5th album AM is absolute perfection. He takes the best of Geezer, the best of JPJ, and the best of the stoner rock movement. Using a combo of tools as old as rock (66 Fender Precision, pushed SVT) with a Skychord Truck Loud OD, a ZVEX Woolly Mammoth and a EHX Micro POG, he captures some magic along with the rest of the band. Track 1- Do I Wanna Know  Track 2- R U Mine?  Track 4- Arabella (Particularly epic scene at ACL, with a big nod to Geezer)  ",
            "date": "Answered September 8, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pelin Demirci",
                    "user_href": "/profile/Pelin-Demirci-1"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "Dave Haynie",
                    "user_href": "/profile/Dave-Haynie"
                },
                {
                    "user_id": "Reinier Post",
                    "user_href": "/profile/Reinier-Post"
                },
                {
                    "user_id": "Tom Smith",
                    "user_href": "/profile/Tom-Smith-575"
                }
            ]
        }
    ]
}