{
    "title": "What music genre is more likely to make a comeback, 'emo' or 'grunge'? - Quora",
    "tags": [
        "Grunge",
        "Grunge Music",
        "Emo",
        "Punk Rock",
        "Genres",
        "Music Genres",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Larsen",
                "href": "/profile/Michael-Larsen-1"
            },
            "answer_text": "Generally speaking, musical styles don’t so much as make a comeback as they have an echo effect on subsequent generations. A perfect example of this is ska. To date there have been three waves of ska music (mid-late 60s, late 70s-early 80s, and then mid-late 90s). Each one sounded and looked somewhat different from what had come before but you recognized the elements present in each from the preceding generations. Grunge and emo are still, relatively speaking, around in the styles of a number of bands today and if you look at metalcore or other styles of hard rock/metal, you can see their influence actively in play. I don’t see grunge making a comeback as much as I see it infusing hard rock and metal with primary DNA and just being there. Grunge as a style had its day. So did emo. So did glam. Interestingly, those tropes are still present in a lot of groups but they are also taking in more current musical attributes as well. Ska as a style, much like reggae is very distinct. If a band decides to do ska, it is plainly evident and it's hard to disguise it as anything else. Grunge and emo are really not in the same category outside of how they look and looks are co-opted all the time. Consider this a long way of saying I don’t think we will see a resurgence of grunge or emo the way we have had resurgences of ska, reggae or rockabilly. Instead, expect those two genres to infuse what goes forward with genetic material and developing newer hybrids. Also, to reflect Alex Nejako’s answer, bands that play that style are still around. ",
            "date": "Answered December 13, 2019",
            "views": "225",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chase Dallin",
                    "user_href": "/profile/Chase-Dallin"
                },
                {
                    "user_id": "William Cleveland",
                    "user_href": "/profile/William-Cleveland-3"
                },
                {
                    "user_id": "Lyle Hamer",
                    "user_href": "/profile/Lyle-Hamer"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                }
            ]
        }
    ]
}