{
    "title": "What are the best folk songs? - Quora",
    "tags": [
        "Best of X",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranabesh Mondal",
                "href": "/profile/Pranabesh-Mondal-2"
            },
            "answer_text": "There's lots folk songs I love. But if you want only one song that is ‘Where have all flowers gone?’ By Pete Seeger. Where Have All the Flowers Gone? ########################## Where have all the flowers gone, long time passing? Where have all the flowers gone, long time ago? Where have all the flowers gone? Young girls have picked them, every one Oh when will they ever learn, oh when will they ever learn? Where have all the young girls gone, long time passing? Where have all the young girls gone, long time ago? Where have all the young girls gone? Gone for husbands, every one Oh when will they ever learn, oh when will they ever learn? Where have all the husbands gone, long time passing? Where have all the husbands gone, long time ago? Where have all the husbands gone? Gone for soldiers, every one Oh when will they ever learn, oh when will they ever learn? Where have all the soldiers gone, long time passing? Where have all the soldiers gone, long time ago? Where have all the soldiers gone? Gone to graveyards, every one Oh when will they ever learn, when will they ever learn? Where have all the graveyards gone, long time passing? Where have all the graveyards gone, long time ago? Where have all the graveyards gone? Gone to flowers, every one Oh when will they ever learn, oh when will they ever learn? ",
            "date": "Answered March 11, 2019",
            "views": "187",
            "upvotes": " Answer requested by Ved Prakash (वेद प्रकाश)"
        },
        {
            "author_info": {
                "name": "Brian O'Sullivan",
                "href": "/profile/Brian-OSullivan-23"
            },
            "answer_text": "Actually a true story sung like an ancient folk song. Scapegoats E. Cowan/C. Moore Hugh Callaghan, Paddy Hill, Gerry Hunter, Johnny Walker,Billy Power, Dick McIlkenny that’s their names. Five men playing poker on the Heysham trainFate was dealing them a cruel handHugh Callaghan walked home through the evening rainNot knowing what lay in store for him There’s traces of nitro on cigarettes and matchesOn Formica tabletops and on decks of playing cardsWhen forensics found traces on the hands of these six men,The police drove up from BirminghamHoping the case was closed Have you ever seen the mug shots that were takenAfter 48 hours in custodyBattered and bruised, haunted looks upon their facesThe judge accepted they confessed willinglyPlease take another look at what you see If you tell me my family are being terrorisedKeep me awake for six days and nights confused and terrifiedIn the lonely dark of night I will swear that black is whiteIf you’ll just let me lay down and close my eyesIll sign anything if you let me close my eyes Scales of justice balance up your actAm I talking to myself or to the wall?Hugh Callaghan, Paddy Hill, Gerry Hunter, Johnny Walker,Billy Power, Dick McIlkenny scapegoats all For 16 years they were taking to the wall   7 DigitalBookings & EnquiriesLinks4711ers listeners forumNewsletterShopPrivacy Policy© Christy Moore 2020 / Created and hosted by Point Blank ",
            "date": "Answered August 11, 2020",
            "views": "79",
            "upvotes": " Answer requested by Hanna"
        }
    ]
}