{
    "title": "What was the point of making The Hobbit after LOTR? - Quora",
    "tags": [
        "The Hobbit (1937 book)",
        "The Hobbit (creative franchise)",
        "Tolkien's Middle-earth (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shalon Hutchison",
                "href": "/profile/Shalon-Hutchison"
            },
            "answer_text": "I think there's an easier answer than what was said before. The point was that the movies were made as a labor of love.  They loved the books.   The only reason lord of the Rings got made first is because the bigwigs felt that story had more monetary potential and they wanted to go with the better gamble first.  The Hobbit was a children's book super focused on one small group, but the Lord of the Rings was written in an adult style, with a smaller group and an epic storyline.  Big wars, and worldwide destruction.  Epics are guaranteed to make money even if the fans of the book don't like the adaptation, so the money men pushed Peter Jackson to make the epic first and put off the earlier story until they were sure it would make a buck.    But he made the whole series out of love, and he was always going to make all 4 books into movies.   Wierdly 6 movies, but that was a style choice he made when he decided to include more  of the silmarillian  and the the appendices in his adaptation.  He added in parts of the story that only Gandalf, of the dwarves party, had access to.  The Point is,  he was always hoping and planning to make all of the books into movies. He's even toyed with the idea of making the Harrowing of the Shire it's own movie.  But officially decided not to just before beginning production on the Hobbit. ",
            "date": "Answered March 15, 2016",
            "views": "355",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siddharth Bhat",
                "href": "/profile/Siddharth-Bhat-1"
            },
            "answer_text": "The point is that The Hobbit came out in 1937, while The Lord of the Rings came out in 1954. LotR isn't about the War of the Ring. It is simply a story in a more complete mythology. Nor is The Hobbit a suspense/thriller/mystery book. It is also simply a story. Even if you hadn't already known, you would've known as soon as you picked up the book/film, in the same way that you know Batman is not going to die in any of the films. Is a TV series spoiled and hence rendered meaningless if it is named The Adventures of Batman? If they're his adventures, of course he's got to live! The book is about an adventure of Bilbo. It's like a traveller's account in third person perspective. The enjoyment is not in knowing whether he lives, we already know that he does (Tolkien was a very happy ending sort of person, and it's a children's book). The enjoyment is in finding out how a simple little hobbit went on an adventure, found amazing and strange things in lands foreign to him, how he helped a bunch of dwarves reclaim their kingdom, how a massive and powerful dragon was dealt with and killed, how he found the ring (which is the more important part of it as far as mythology is concerned), about the different kinds of people in different lands - the Elves, Dwarves, Trolls, Orcs, Wizards, etc. I don't see the point of this question. ",
            "date": "Answered October 6, 2014",
            "views": "484",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shalon Hutchison",
                    "user_href": "/profile/Shalon-Hutchison"
                },
                {
                    "user_id": "Jordan Shank",
                    "user_href": "/profile/Jordan-Shank-2"
                },
                {
                    "user_id": "Orgulas Maggot",
                    "user_href": "/profile/Orgulas-Maggot"
                },
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Kireeti Akkunuri",
                    "user_href": "/profile/Kireeti-Akkunuri"
                }
            ]
        }
    ]
}