{
    "title": "What's the best song to describe loneliness? - Quora",
    "tags": [
        "Loneliness",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Branch",
                "href": "/profile/Adam-Branch-2"
            },
            "answer_text": "Astronaut Simple Plan LYRICS Can anybody hear meOr am I talking to myselfMy mind is running emptyIn the search for someone elseWho doesn't look right through meIt's all just static in my headCan anybody tell me why I'm lonely like a satellite? 'Cause tonight I'm feeling like an astronautSending SOS from this tiny boxAnd I lost all signal when I lifted offNow I'm stuck out here and the world forgotCan I please come down, come down'Cause I'm tired of drifting round and roundCan I please come down? I'm deafened by the silenceIs it something that I've doneI know that there are millionsI can't be the only one who's so disconnectedIt's so different in my headCan anybody tell me whyI'm lonely like a satellite? 'Cause tonight I'm feeling like an astronautSending SOS from this tiny boxAnd I lost all signal when I lifted offNow I'm stuck out here and the world forgotCan I please come down, come down'Cause I'm tired of drifting round and roundCan I please come down? Now I lie awake and scream in a zero gravityAnd it's starting to weigh down on me, whoaLet's abort this mission nowCan I please come down? So tonight I'm calling all astronautsAll the lonely people that the world forgotIf you hear my voice, come pick me upAre you out there?'Cause you're all I've got And tonight I'm feeling like an astronautSending SOS from this tiny boxAnd I lost all signal when I lifted upNow I'm stuck out here and the world forgot 'Cause tonight I'm feeling like an astronautSending SOS from this tiny boxTo the lonely people that the world forgotAre you out there?'Cause you're all I've got Can I please come down?'Cause I'm tired of drifting round and round(Can I please come down?) Songwriters: Pierre Bouvier / Charles-Andre Comeau / Julian Emery / James Lawrence Irvin Astronaut lyrics © Warner/Chappell Music, Inc https://www.google.com.ng/search?client=ms-android-hmd-rev2&q=Astronaut&stick=H4sIAAAAAAAAAOOQUeLRT9c3LDYwLTMoyS2OkkksLinKz0ssLVEozswtyElVKMhJzFPIqSzKTC4-xYii-BQjp36uvoFhhqGhMUKqJC_ZsgzKLTTNKDTPKShHyBYVFSQbwGWzqpIyktPhsmZmRul5FghZw2RD80okS5ONKisQ3EIjM5OcX4yCyO4szs9LLwYAqnCIk9UAAAA&sa=X&ved=0ahUKEwikqI3g7sDZAhVJW8AKHTXCC0gQs9oBCHooADAO&biw=360&bih=616 ",
            "date": "Answered February 25, 2018",
            "views": "612",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nkwebi Dube",
                    "user_href": "/profile/Nkwebi-Dube"
                },
                {
                    "user_id": "Cara Blackmon Song",
                    "user_href": "/profile/Cara-Blackmon-Song"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cyndi Rodgers",
                "href": "/profile/Cyndi-Rodgers-1"
            },
            "answer_text": "Eric Clapton Lonely Stranger I must be invisibleNo one knows me.I have crawled down dead-end streetsOn my hands and knees. I was born with a ragin' thirst,A hunger to be free,But I've learned through the years.Don't encourage me. [Chorus:]'cause I'm a lonely stranger here,Well beyond my day.And I don't know what's goin' on,So I'll be on my way. When I walk, stay behind;Don't get close to me,'cause it's sure to end in tears,So just let me be. Some will say that I'm no good;Maybe I agree.Take a look then walk away.That's all right with me. Or Alone Again Naturally By Gilbert O’Sullivan I change the station whenever this song comes on. I wasn’t left at the alter but had tardive dysphoria for two years that cause constant suicidal thoughts. In a little while from nowIf I'm not feeling any less sourI promise myself to treat myselfAnd visit a nearby towerAnd climbing to the topWill throw myself offIn an effort toMake it clear to whoeverWants to know what it's like When you're shattered Left standing in the lurch at a churchWere people saying, My God, that's toughShe stood him upNo point in us remainingWe may as well go homeAs I did on my ownAlone again, naturallyTo think that only yesterday I was cheerful, bright and gayLooking forward to who wouldn't doThe role I was about to playBut as if to knock me downReality came aroundAnd without so much as a mere touchCut me into little piecesLeaving me to doubtTalk about, God in His mercy Oh, if he really does existWhy did he desert meIn my hour of needI truly am indeedAlone again, naturallyIt seems to me thatThere are more hearts broken in the worldThat can't be mended Left unattendedWhat do we doWhat do we doAlone again, naturallyLooking back over the yearsAnd whatever else that appearsI remember I cried when my father diedNever wishing to hide the tears And at sixty-five years oldMy mother, God rest her soulCouldn't understand why the only manShe had ever loved had been takenLeaving her to startWith a heart so badly brokenDespite encouragement from me No words were everAnd when she passed awayI cried and cried all dayAlone again, naturallyAlone again, naturally ",
            "date": "Answered January 29, 2017",
            "views": "450",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria E",
                    "user_href": "/profile/Maria-E-13"
                },
                {
                    "user_id": "Sharon Stadtmiller",
                    "user_href": "/profile/Sharon-Stadtmiller"
                }
            ]
        }
    ]
}