{
    "title": "What are some songs, or a song, that makes you sad or feel very emotional? - Quora",
    "tags": [
        "Sadness",
        "Poems",
        "Understanding and Improving Mental Health",
        "Songs",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Lackey",
                "href": "/profile/Stephen-Lackey"
            },
            "answer_text": "These are a few of my favorite emotional songs. Chandelier--Sia This one is hard for me to hear, because I knew so many of these party girls in high school and college. I watched as they ruined their bodies, hearts, and futures chasing moments of joy like a gambler's high. The line \"I'm going to fly like a bird through the night, feel my tears as they dry\"--Sia's voice cracks as she half screams the words in desperation... how someone could, in their own desperate escape attempt and by virtue of the extent of its desperation, hide the fact that they were dying inside... It gets me every time. Hurt--Johnny Cash version It's a very good song when sung by Trent Reznor; it's soul-crushing when song by Johnny Cash. It changes from being an addict's self-revelatory explanation/ apology to an allegory/apology for ill-timed choices and bad luck. That, combined with knowing Johnny's life story--especially the end of it--is just devastating. Flames – VAST Cello and acoustic guitar, very simple melody and harmony, and a sublime vocal that speaks of magnetic, desperate, obsessive love. \"When I am with you, there's no reason to pretend that when I am with you I feel flames again.\" Oh... the cello... and the sweet barely-more-than-whispered opening stanzas... Whether the narrator and subject are alone together doesn't matter; the world has melted away in that moment. And So It Goes – Billy Joel Solo piano and vocal that pays tribute to the hopeless romantic. The narrator wants to be loved with ardent reciprocation, but his hesitation (due to prior losses) proves to be his undoing yet again... though he never gives up. Sometimes It Snows in April--Prince If you've lost a family member, close friend, or lover recently, I'd suggest listening to this with tissues handy. As most Prince music can't be found anywhere but his albums, I'd suggest purchasing the soundtrack to Under the Cherry Moon. It's definitely worth the purchase, as this is only one of several amazing songs on the album, this song being the highlight. From the lyrics, you can't tell if the narrator and the subject were lovers or deep friends, but it doesn't matter--you'll feel the love and anguish, or you're a heartless monster. Love Remembered/Mina and Dracula--Bram Stoker's Dracula soundtrack (Tracks 7 and 11, respectively.) This movie, while at times accidentally funny, is one of my favorite gothic horror films. The soundtrack is a sumptuous feast of modalities mixed with bits of electronica. These two tracks function as a statement and reprise. Musically speaking, swelling and rising strings represent love, but the motif of simultaneous swelling and falling strings here represent the doomed love between Mina and Vlad. Heavy in Your Arms – Florence and the Machine When your love is too much for your beloved to handle, you at once wish for them to never let go AND to be unburdened by you. Then if they DO let go, is it that you forced them away, or were they drawn away by something easier? Florence's voice... (ohmygod) Children Will Listen--Barbra Streisand Truth bomb after truth bomb. I have children now, so I am more affected by this song every day. Knowing that I'm trying to do my best, knowing that my parents did their best, knowing that there were failures from my parents and myself that have shaped my life and the lives of my children... it's just so much in such a short song. Mad world--Gary Jules This was voted one of the most depressing songs ever written, but as with most things that bring me to tears, I am empowered by it. Each verse is an example of \"If only…\" The first verse is about the bleakness of the human condition, the next strongly reminiscent of my school days and the upbringing of my best friend. The chorus is a plea for understanding that will never come. ",
            "date": "Answered February 2, 2017",
            "views": "48",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farah Ramadhanti",
                    "user_href": "/profile/Farah-Ramadhanti-1"
                },
                {
                    "user_id": "Matias Sebert",
                    "user_href": "/profile/Matias-Sebert"
                },
                {
                    "user_id": "Beth Landon",
                    "user_href": "/profile/Beth-Landon-1"
                },
                {
                    "user_id": "Taressa Riazzi",
                    "user_href": "/profile/Taressa-Riazzi"
                },
                {
                    "user_id": "Don Hawkins",
                    "user_href": "/profile/Don-Hawkins-12"
                },
                {
                    "user_id": "Silvia Torres",
                    "user_href": "/profile/Silvia-Torres-37"
                },
                {
                    "user_id": "Anna May",
                    "user_href": "/profile/Anna-May-152"
                },
                {
                    "user_id": "Emily Dinah",
                    "user_href": "/profile/Emily-Dinah"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-240"
                },
                {
                    "user_id": "Margarita Politte",
                    "user_href": "/profile/Margarita-Politte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendi Tibbets",
                "href": "/profile/Wendi-Tibbets"
            },
            "answer_text": "George Michael- One More Try This song gets me. It always has, but especially since George Michael's recent passing on Christmas day. I had some tears when I listened to this song this morning. His music isn't for everyone, but back in the day there wasn't the variety of current music you could choose from as there is today. There were only so many record labels representing so many acts, and therefore we all pretty much shared the same music. Nearly everyone knew who George Michael was when I was young. His music was very popular. It was played at my prom. It was on the television. It was piped into the PA system at grocery stores and made into terrible versions of elevator music. It was on commercials and his appearances on t.v. made him a superstar, a sensation, especially during the days when you could count the number of networks on your fingers; All eyes were focused on him. Today there are millions of YouTube stars and Indy labels and bands to choose from. Back then there were merely a handful of mega stars, and George Michael was one of them. Now he's gone. I'm listening to his music and feeling pretty blue. Please be gentle with the 80's kids (and fans of music from the time) if we express our grief at losing yet another icon. This year, 2016, has been hard on all of us.  One More Try (George Michael) I've had enough of dangerAnd people on the streetsI'm looking out for angelsJust trying to find some peaceNow I think it's timeThat you let me knowSo if you love meSay you love meBut if you don't just let me go 'Cause teacherThere are things that I don't want to learnAnd the last one I hadMade me crySo I don't want to learn toHold you, touch youThink that you're mineBecause it ain't no joyFor an uptown boyWhose teacher has told him goodbye, goodbye, goodbye When you were just a strangerAnd I was at your feetI didn't feel the dangerNow I feel the heatThat look in your eyesTelling me noSo you think that you love meKnow that you need meI wrote the song, I know it's wrongJust let me go And teacherThere are thingsThat I don't want to learnOh the last one I hadMade me crySo I don't want to learn toHold you, touch youThink that you're mineBecause it ain't no joyFor an uptown boyWhose teacher has told him goodbye, goodbye, goodbye So when you say that you need meThat you'll never leave meI know you're wrong, you're not that strongLet me go And teacherThere are thingsThat I still have to learnBut the one thing I have is my prideOh so I don't want to learn toHold you, touch youThink that you're mineBecause there ain't no joyFor an uptown boyWho just isn't willing to try I'm so coldInsideMaybe just one more try ",
            "date": "Answered December 27, 2016",
            "views": "6",
            "upvotes": " View 45 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gail Farina",
                    "user_href": "/profile/Gail-Farina"
                },
                {
                    "user_id": "Margarita Politte",
                    "user_href": "/profile/Margarita-Politte"
                },
                {
                    "user_id": "Pam John",
                    "user_href": "/profile/Pam-John-3"
                },
                {
                    "user_id": "Ondari Bonareri",
                    "user_href": "/profile/Ondari-Bonareri"
                },
                {
                    "user_id": "Sue Condon",
                    "user_href": "/profile/Sue-Condon"
                },
                {
                    "user_id": "Samuella Karche",
                    "user_href": "/profile/Samuella-Karche"
                },
                {
                    "user_id": "Gregor Bolt",
                    "user_href": "/profile/Gregor-Bolt"
                },
                {
                    "user_id": "Helen Bryant",
                    "user_href": "/profile/Helen-Bryant"
                },
                {
                    "user_id": "Linda Roper",
                    "user_href": "/profile/Linda-Roper-1"
                },
                {
                    "user_id": "Brooke Schwartz",
                    "user_href": "/profile/Brooke-Schwartz"
                }
            ]
        }
    ]
}