{
    "title": "What was the last US number 1 hit by a Beatle? - Quora",
    "tags": [
        "The Beatles (band)",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Lopez",
                "href": "/profile/John-Lopez-70"
            },
            "answer_text": "\"The Long and Winding Road\" is a ballad written by Paul McCartney (credited to Lennon/McCartney) that originally appeared on The Beatles' album Let It Be. It became The Beatles' last number-one song in the United States on 23 May 1970, and was the last single released by the quartet. The song was recorded in Jan 1969 and written by Paul McCartney during the White album sessions. After recording the song was left untouched as part of the ill fated Get Back album tapes that was not released. John Lennon provided the Get Back tapes to Phil Spector who added choir and strings to the song “The Long and Winding Road” that angered Paul McCartney and was used as evidence when McCartney sued to terminate the Beatles contract with manger Allan Klein. ",
            "date": "Answered October 5, 2020",
            "views": "61",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun K Shukla",
                    "user_href": "/profile/Arun-K-Shukla"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Reese",
                "href": "/profile/David-Reese-12"
            },
            "answer_text": "Not answering your question, but the last #1 single the Beatles had was “Free As A Bird” which hit #1 in Scotland in late 1995. Their last US #1 was the 2019 version of the Abbey Road album. But I am going to assume you meant song in your question. ",
            "date": "Answered October 5, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        }
    ]
}