{
    "title": "What is the most played instrument in the world? - Quora",
    "tags": [
        "Statistics (collected data)",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Rossi",
                "href": "/profile/Rick-Rossi-7"
            },
            "answer_text": "Right now in 2019 the piano/keyboard is the most requested instrument to play by young musicians at least in the U.S. It’s the number one instrument in most music schools with the guitar a close second. It’s probably the most versatile of all musical instruments and is used in every style of music. It can be played or accompany other instruments and is often played as a solo instrument. It also covers a range from the lowest of bass instruments to the highest piccolo sounds. In addition, many musicians who’s main instrument is a woodwind, string, brass or percussion learn the piano because it is a very visual instrument that makes it easy to learn theory and work out compositions. Many composers think of it as “having the orchestra in their hands,” therefore most of the great composers for hundreds of years were pianists and used the piano to compose and that remains the same currently in contemporary music. The electric keyboard makes it possible for more parents to be able to afford to buy a piano because electric keyboard companies are able to make them for as low as 50.00 and even good 88 key electric keyboards with weighted keys are less than 500.00. ",
            "date": "Answered April 2, 2019",
            "views": "47",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Romero",
                    "user_href": "/profile/John-Romero-21"
                },
                {
                    "user_id": "Mario Stradale",
                    "user_href": "/profile/Mario-Stradale"
                },
                {
                    "user_id": "Kirsten Mellgren McKeon",
                    "user_href": "/profile/Kirsten-Mellgren-McKeon"
                },
                {
                    "user_id": "Sandra D. Acevedo",
                    "user_href": "/profile/Sandra-D-Acevedo"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Christian Vennemann",
                    "user_href": "/profile/Christian-Vennemann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gemma Seymour",
                "href": "/profile/Gemma-Seymour"
            },
            "answer_text": "Answering this open-ended question most accurately requires a global perspective. Globally speaking, the most popular instruments are those which are most commonly used for modern popular music, jazz, and classical music. Those would be, in rough order of popularity: voice guitar (and bass guitar) piano/keyboards drums (both hand drums and \"trap\" kits) tuned percussion (marimba, xylophone, vibrophone, etc) orchestral strings (violin, viola, cello, double bass) woodwinds (flute, saxophone, clarinet, etc) brass (trumpet, horns, etc.) There is a second category of culturally-specific traditional and folk music instruments that are also still popular, like zithers (guqin/koto/gayageum, dulcimer), sitars, pipa, biwa, shamisen, bagpipes, banjo, mandolin family instruments—just to name a few off the top of my head with which I am familiar, but for the most part, instruments in the Western popular, jazz, and classical traditions have become globally the most popular. ",
            "date": "Answered September 7, 2019",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mario Stradale",
                    "user_href": "/profile/Mario-Stradale"
                },
                {
                    "user_id": "Khang Nguyen",
                    "user_href": "/profile/Khang-Nguyen-18"
                }
            ]
        }
    ]
}