{
    "title": "What would life be like if we lived in a world where everybody sang like in High School Musical or Rock Of Ages? - Quora",
    "tags": [
        "Rock of Ages (2012 movie)",
        "High School Musical",
        "Musical Theatre",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter J Casey",
                "href": "/profile/Peter-J-Casey"
            },
            "answer_text": "It would be a nightmare, chiefly because of a lack of editing. In movies, you can cut from one scene to another, and place numbers only at points where they’d be dramatically effective. In stage shows, scenes end, then transition to another scene, carefully tailored to start at the next effective point in the story. In real life, by contrast, whole swathes of time pass by without incident or point, and long stretches of nothing interesting happen. Seemingly unimportant events occur, only to be revealed later as significant, with the benefit of hindsight. So, you’d be living in this real world, but a musical number would happen 9–15 times every couple of hours, regardless of events. Three or four of these numbers would be huge choreographic spectacles, with dozens of cast members, even if you were only changing a light bulb or cleaning the toilet. No guiding intelligence would shape this story. No artistic vision would weigh and evaluate, prune and highlight. It would all just happen, mindlessly, over and over, every day. In such a world I would wish to be a very, very minor character in the background, possibly in some sort of coma. ",
            "date": "Answered June 11, 2016",
            "views": "287",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joseph Fernandez",
                    "user_href": "/profile/Joseph-Fernandez-17"
                },
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-63"
                },
                {
                    "user_id": "James Adamick",
                    "user_href": "/profile/James-Adamick"
                },
                {
                    "user_id": "Liana Lang",
                    "user_href": "/profile/Liana-Lang"
                },
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Lopez",
                "href": "/profile/Robert-Lopez-39"
            },
            "answer_text": "Well, since not everyone has the same singing voice or ability to write lyrics and music, I think it would be an uncomfortable musically poor situation. Imagine a karaoke bar, but 24/7. Imagine how hard it would be to have sex with a girl while trying to come up with sexy lyrics or tunes. The human race would probably just die out. ",
            "date": "Answered June 5, 2016",
            "views": "74",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-63"
                },
                {
                    "user_id": "Peter J Casey",
                    "user_href": "/profile/Peter-J-Casey"
                },
                {
                    "user_id": "Ivan Braun",
                    "user_href": "/profile/Ivan-Braun-1"
                },
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-19"
                }
            ]
        }
    ]
}