{
    "title": "What is the single most difficult piece of music to play? And why? - Quora",
    "tags": [
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kent Reed",
                "href": "/profile/Kent-Reed-2"
            },
            "answer_text": "This question cannot be answered as posed. Here are two reasons why: 1) There is no objective standard by which we can judge whether a piece as been \"played\" or not. Is it recognizable? Does it lack any wrong notes or rhythms? Is it effectively interpreted? Is it artful? Does it exhibit the highest levels of musical mastery? 2) What is difficult depends on the requirements of the piece and the background of the performer. Different genres have different requirements.  You could take one of the best classical violinists, ask him to play some simple jazz tunes and the results would be disappointing at best.  Here's Itzhak Perlman attempting to play 'Summertime', one of the absolute simplest, easiest jazz tunes there is.   He manages to sound OK because he is a good violinist and is being accompanied by some of the best jazz players in history, but his playing is very weak and below the level of an the most average working jazz musician you never heard of.  If a jazz musician did a classical rendition at this level, the establishment reaction would be between contempt and disgust.In order to play 'Summertime' at a serious level, Perlman would have had to spend years of devoted practice on getting a decent sense of jazz aesthetic requirements.   I've seen accomplished classical musicians spend years trying to play simple Arabic songs and fail, when a moderately talented 10 year old kid from Ramallah could do it. I've heard top-notch jazz musicians do a terrible job on very simple rock tunes.   Etc.  If you rephrase your question more narrowly (e.g., what is the most difficult song out of the Opera repertoire for a singer, or the most difficult piece for classical piano, etc.), you can maybe get some somewhat useful answers.  You still have the first problem to contend with, though—what is most difficult to play 'correctly' and what is most difficult to play 'masterfully' are not necessarily the same thing. ",
            "date": "Answered February 5, 2016",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                },
                {
                    "user_id": "Demian Rebollo von Düben",
                    "user_href": "/profile/Demian-Rebollo-von-Düben"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dongle-Mailbags"
                }
            ]
        },
        {
            "author_info": {
                "name": "Claire Callahan Goodman",
                "href": "/profile/Claire-Callahan-Goodman"
            },
            "answer_text": "I'm not sure why this question became a reason to criticize Perlman especially now since the videa is not available.  OTOH, this is another one of those crazy questions generated by who knows who, on Quora.  As per usual, anonymous.  The word \"Music\" includes all kinds of music from the most basic chord on a guitar to a Paganini showpiece only attempted by the most accomplished violinists.  The answer to your question is different for every musician in every genre.   My answer would be that the most difficult music I have had to play has been music which does not have any intuitive aspect to it - no regular tempo, no regular number of beats per bar, no discernable melody or harmony.   I have played music like this, in a chamber or orchestral setting.  The composition is usually conducted By the composer, because no one else can do it.   I have rehearsed and performed things like this for composition recitals mostly.  There are orchestral works which require virtuoso playing on the part of many orchestra members, and there are works with seemingly millions of notes which test musicians both in difficulty and in physical endurance.  Still, the hardest music to play is that which is not really music; but more like people making various noises at various seemingly random times.  One piece I remember required horn players to speak numbers into their mouthpiece, while at the same time string players were to stand and walk around their chairs several times.    This silliness mostly went out with the '70s.  Still, trying to play in an ensemble where the parts have no connection with each other, or with anything else we associate with \"music\" is just making noise, IMHO, and it's much more difficult than playing anything else. ",
            "date": "Answered February 16, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Soizic De St John Rosse",
                    "user_href": "/profile/Soizic-De-St-John-Rosse"
                },
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                }
            ]
        }
    ]
}