{
    "title": "What do people love about going to concerts? - Quora",
    "tags": [
        "Live Music",
        "Concerts",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Pampling",
                "href": "/profile/Chris-Pampling"
            },
            "answer_text": "The credential gives you the clue. When I set up my therapy centre 4 years ago, I knew it was going to be the biggest thing I’d ever done and would take all my waking hours, energy and resources to do. I would have to give up a lot of things, including any chance of a holiday or time away from home in order to make a success of it. So my husband and I created a “kick the bucket list” of acts that we want to see in concert before we or they die, or kick the bucket. This started on Monday 1st May 2017 when we went to see Steve Hackett in Birmingham, and our series of micro-holidays finished on Saturday 13th April with “The Book of Genesis” also in Birmingham. I’m due a shoulder replacement op in the next couple of months, and hopefully I’ll have recovered enough to go to see Justin Hayward in September. I’ve won a couple of tickets to a prog festival in October in Sheffield which I’m looking forwards to, and I already have tickets to see Steve Hackett again in November. So the why, is that if I can’t have a long holiday then I might as well have lots of little ones! ",
            "date": "Answered April 21, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lou Coury",
                    "user_href": "/profile/Lou-Coury"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maureen Brennan",
                "href": "/profile/Maureen-Brennan"
            },
            "answer_text": "I love the music, that’s it. Seeing my favorite performer/musician live is an incredible way to spend a couple hrs. If you love the artists music, going to see them live is amazing. I remember very well all the concerts I’ve been to. For me, I think it’s because I love music so much. Saw The Who, Ryan Adams, Ed Sheeran, Bon Iver, and others live (individually not together) and would spend the $100+ to see them live a second time. Money well spent. ",
            "date": "Answered November 2, 2016",
            "views": "67",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "JAYAPRAKASAN KUNNIKKAL",
                    "user_href": "/profile/JAYAPRAKASAN-KUNNIKKAL"
                },
                {
                    "user_id": "Babette Plitz",
                    "user_href": "/profile/Babette-Plitz"
                },
                {
                    "user_id": "Sara Toppher",
                    "user_href": "/profile/Sara-Toppher"
                },
                {
                    "user_id": "Lisa Bryan",
                    "user_href": "/profile/Lisa-Bryan-13"
                }
            ]
        }
    ]
}