{
    "title": "What are your opinions on the stars in the music industry such as Cardi B, Nicki Minaj, Iggy Azalea, and other similar artists? - Quora",
    "tags": [
        "Iggy Azalea (musician)",
        "Nicki Minaj (musician)",
        "Cardi B (musician)",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "Celebrities",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phil Jones (He / Him)",
                "href": "/profile/Phil-Jones-He-Him"
            },
            "answer_text": "I think Nicki Minaj is extremely talented, and was, within her genre, pretty innovative in her heyday. Sure, she sells herself on sex, and that, while obviously attracting one fan-base, can be very off-putting to others, because it feels manipulative. And right now, she’s sort of trying to get back into the game by hanging out / guesting on people like 6ix9ine and Doja Cat etc. and she’s not really shining there. Doja Cat is obviously the new Nicki Minaj and seems to be doing that job pretty well by herself. But Nicki is a great artist who has made really good, standout tunes in her genres. Starships was great. She killed it on Monster. Beez in the Trap is brilliant. Say what you like about Stupid Ho and Anaconda but these became cultural icons with good reason, they are really striking and attention grabbing. And most importantly, have a sense of over-the-top humour and fun. Finally, I think there’s no doubt that Nicki can rap. Cardi B, I’m a bit mystified by. She’s presumably good at the game of celebrity woman rapper. She can rap. But I’ve yet to hear a track by her that excited me or that I’d want to hear again. I’m not sure why people like her so much. I’m guessing it’s more for her social media than her music. As I said, Doja Cat seems to me to be Minaj’s natural successor, who does what Minaj has done, and does it well and enjoyably. Say So is a huge tune. I put it on a mix I did a couple of weeks ago and it’s a blast. Iggy Azalea hardly crosses my radar. But maybe I’m not sufficiently immersed in the scene. ",
            "date": "Answered August 25, 2020",
            "views": "120",
            "upvotes": " Answer requested by Farzam Mousavi"
        },
        {
            "author_info": {
                "name": "Len Anglin",
                "href": "/profile/Len-Anglin"
            },
            "answer_text": "I know I'm old so my opinion doesn't matter too much but these 3 are barely artists. I don't know much about them but I assume that their music is all artificial (no one actually playing instruments) and their singing is Auto tuned or otherwise enhanced. If their music was good enough to stand on it's own they wouldn't need to be tramps. Now don't get me wrong, I luv a slut as much as the next guy but I also luv music. Titties, pussy and a big booty doesn't make the music better, just like great music doesn't make Neil Young, Dylan or Janis better looking. Let great music be it's own advertisement, and pussy doesn't really need any promo…it has been at the top for centuries… ",
            "date": "Answered August 28, 2020",
            "views": "45",
            "upvotes": " Answer requested by Farzam Mousavi"
        }
    ]
}