{
    "title": "What is the most expensive thing ever destroyed for a movie? - Quora",
    "tags": [
        "Expensive Things",
        "Destruction",
        "Pricing",
        "Movie Production",
        "Entertainment",
        "Hollywood",
        "Movie Business and Industry",
        "Costs",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mert Toker",
                "href": "/profile/Mert-Toker-1"
            },
            "answer_text": "It might be the actors… Each leading actor injured on the set delays the production timeline and cost of production increase rapidly. The problem with working people , a director can not replace them like a car or plane. Lawsuits or compensation demands might follow in some cases… The acting contract will also certainly detail the actor's compensation. There are plenty of examples… ‘’ Jim Caviezel, known for his portrayal of Jesus in The Passion of the Christ, was struck by lightning during one of the film’s famous scenes. While filming the Sermon on the Mount, Caviezel noticed lightning coming toward him. Luckily, Caviezel did not suffer any injuries from this particular scene – but he did sustain skin infections, pneumonia, hypothermia, and lung infections during the course of filming.’’ Source of the quoted paragraphs: 9 Actors Who Were Injured While on Set Brandon Lee’s Death By Accident … Human Life is Priceless…  Source of the picture: What Exactly Happened to Brandon Lee While Filming 'The Crow'? Brandon Lee’s death was a horrible on-set accident. ‘’ With just eight days left of filming, Brandon Lee walked on to the set of The Crow on March 31, 1993, ready to work, as always. The young actor had gotten the role after big names like Christian Slater and Johnny Depp hadn’t worked out and had been working himself to the literal bone every day doing his own stunts and enduring long days along with a harsh working environment. But Brandon remained in good spirits throughout filming. The Crow was going to provide a career-redefining role that would allow him to break free of only being known as Bruce Lee's son. And just a week after filming was scheduled to end, Brandon was set to marry his girlfriend, Eliza Hutton. But that day during filming, fellow actor Michael Massee, who played the character Funboy, aimed and shot a gun directly at Brandon, as the script called for. However, once the director yelled \"cut,\" everyone realized that Brandon was not moving and was rapidly losing blood from a small hole in his abdomen. ‘’ Source of the quoted paragraphs: What Exactly Happened to Brandon Lee While Filming 'The Crow'? Art Scholl’s Death and overweight camera impact on the plane (Real Goose)  Source of the picture: Tragedy of the real Goose who died making Top Gun ‘’ Much of the fancy flying you see in Top Gun is performed by skilled stuntmen. But even for experienced pilots, there’s always an inherent risk. Art Scholl was one such pilot. He died on set while attempting to execute a move with his plane known as a flat spin. Tragically, the camera equipment mounted on the plane added too much unexpected weight, causing it to spin out of control and crash into the ocean below. Scholl, a seasoned flight instructor with his own aviation school, was 51 years old.’’ Source of the quoted paragraphs: 12 Actors Who Died During Production ",
            "date": "Answered August 6, 2020",
            "views": "133",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Francis",
                    "user_href": "/profile/James-Francis-215"
                },
                {
                    "user_id": "Thomas Miller",
                    "user_href": "/profile/Thomas-Miller-72"
                },
                {
                    "user_id": "Jimmy Bibs",
                    "user_href": "/profile/Jimmy-Bibs-1"
                },
                {
                    "user_id": "André Crutcher",
                    "user_href": "/profile/André-Crutcher"
                },
                {
                    "user_id": "Zachary Abelardo",
                    "user_href": "/profile/Zachary-Abelardo"
                },
                {
                    "user_id": "Jeff Light",
                    "user_href": "/profile/Jeff-Light-3"
                },
                {
                    "user_id": "Kimeng Wu",
                    "user_href": "/profile/Kimeng-Wu"
                },
                {
                    "user_id": "David Park",
                    "user_href": "/profile/David-Park-15"
                },
                {
                    "user_id": "Gareth Swales",
                    "user_href": "/profile/Gareth-Swales"
                },
                {
                    "user_id": "Russell Jones",
                    "user_href": "/profile/Russell-Jones-138"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghul",
                "href": "/profile/Raghul-88"
            },
            "answer_text": "The destruction in the 'Fast and Furious' movies would have cost more than $500m in real life  Scene from the Fast and the Furious Source: Fast and Furious | Facebook Let's be honest: If the \"Fast and Furious\" series were real life, the team would have demolished many of our cities and caused insurance companies and taxpayers a pretty penny. In case you were wondering what the price tag would theoretically be, , which is run by Halo Insurance Services, watched all seven movies to figure out the total cost. (No word if they included the short films.) The tally came up to $527 million in damaged property. Considering the eighth and not-yet-final installment \"The Fate of the Furious\" is coming out on April 14 and takes place in New York, the costs will only increase. It also discovered: 169 regular cars were damaged, 142 regular cars were destroyed and 37 \"special\" cars — including custom cars, helicopters and, at one point, a tank — were destroyed. Let's also not forget that the upcoming trailer for \"The Fate of the Furious\" features a submarine, which we are betting will also be wrecked. Source: Fast and Furious The most expensive car that was destroyed was a Lykan Hypersport by W Motors during \"Furious 7.\" (Spoiler alert: It was used to jump buildings in Abu Dhabi.) It costs about $3.5 million.53 buildings were damaged, 31 buildings were destroyed and an additional 432 items were damaged.Though Dom (Vin Diesel) and his crew are superhuman wrecking machines for the good guys, they caused way more financial damage than the bad guys.So far, villain Deckard Shaw (Jason Statham) has caused the most mayhem of any individual. During his opening sequence in \"Furious 7,\" he blasted his way through a hospital — and he didn't stop there. He is responsible for $187 million in damages to date.As the stakes got higher throughout the film series, so did the total cost of damages. However, since the films are not in chronological order, it could be argued that the team got less reckless over time.",
            "date": "Answered September 13, 2020",
            "views": "525",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Trutt",
                    "user_href": "/profile/Michael-Trutt-1"
                },
                {
                    "user_id": "Kshitij Kumar",
                    "user_href": "/profile/Kshitij-Kumar-89"
                }
            ]
        }
    ]
}