{
    "title": "What are the disadvantages of playing a musical instrument? - Quora",
    "tags": [
        "Learning to Play Musical Instruments",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allison Dang",
                "href": "/profile/Allison-Dang-6"
            },
            "answer_text": "You have to keep your finger nails short if you play violin, for instance. Guitar players, on the other hand want a certain length of finger nails for their playing. Sometimes you get calluses in certain places. One time when I was on the subway with my instrument, there was a drunk who came and sat next to me, saying, “Is that some kind of musical instrument you have there? Hey, I said is that a musical instrument? Why don’t you take it out and play us a little tune? Oh, come on, just one little tune, how about it?” Airline personnel sometimes hassle you about carrying it onto the plane. People for some reason don’t regard it as work, despite all the hours of practice, lessons, rehearsal, and experience,—maybe they think if you enjoy it they shouldn’t have to pay you to do it so they want you to do it for free. Or maybe because there are a fair number of “amateurs” who do it, they don’t want to pay very much, feeling they could get someone for a cheaper price. It does give you a certain distinctness from the general population, so they notice you, maybe recognize you when they see you on the street, from having seen you perform, so they could have ideas about you that are not necessarily true—think they know you from your playing, think they know how you think or what your political opinions are, or that you’re a flake or that you probably have some kind of artistic temperament—or any kind of fool idea they’ve decided is a stereotype of musicians. If you’re a woman and they like what they see, you could attract a stalker. You have to think about taking it places late at night and not getting mugged. You have to take it with you rather than leaving it in the car, and think about how to ensure it won’t get stolen. We do buy instrument insurance but every instrument is individual and irreplaceable plus these days the insurance companies will blacklist you if you try to make more than two claims in your lifetime, for theft. You have to take care of an instrument: again, every instrument is unique so cannot be replaced and should be maintained. ",
            "date": "Answered November 18, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Toomey",
                "href": "/profile/David-Toomey"
            },
            "answer_text": "The main disadvantage (and I’m grasping for straws) is that you have to have an instrument in your hands to play it. This means that you can’t play while driving, taking a shower, or working. Upkeep sort of sucks. Guitar techs are a unique breed of human, somehow more flaky than the musicians they service. In guitar tech language, “three days” means “I’m going on vacation tomorrow, and when I get back from Arizona, I’m attending my sister’s wedding and my birthday is two days after that. I’ll be gone and then too hung-over to work on your instrument until next year.” I almost missed gigs because my guitar was on the bench for over 2 weeks. Money for strings, amps, cables, cases, and other things that break with no warning. Things break at the most inopportune times. The search for Excalibur. I’m a lefty so my search is much harder. A beater can get me through, but darn. I love musicians, obviously. We are all bound at the hip, but working with them is a totally different story. It’s extremely difficult to find collaborators you click with. Imagine interviewing a prospective employee that knows something or the other about this or that, but didn’t bother reading your job ad, and once you explain that yes, this is in fact a sales job, they say “Oh, I was planning to hammer nails.” Of course, if I wanted to build a cover band, I wouldn’t have this issue, but if I’m going to deal with people that don’t show up, don’t call, and spend more money on tattoos than bass strings, the effort should be worth it. It requires practice and study, and it turns out that it’s often no more fun than studying all the boring stuff at school. It’s hard for me to passively listen to music. I have to actively listen to and dissect everything I’m listening to. I don’t like to have music on in the background because I’m not giving it attention it deserves. ",
            "date": "Answered March 16, 2018",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/NAFISA-KHAN-38"
                }
            ]
        }
    ]
}