{
    "title": "What would happen if a 20-year-old Medal of Honor recipient tried to buy a beer at a military bar? - Quora",
    "tags": [
        "Medal of Honor",
        "Military Medals, Awards and Decorations",
        "Beer",
        "20s (age)",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Edward Street",
                "href": "/profile/Edward-Street"
            },
            "answer_text": "Contrary to some of the answers, here is the USAF take on the matter: “3.1.9. Military personnel 18 years old or older may purchase, serve, sell, possess, and consume alcoholic beverages outside the United States, its territories, and possessions unless a higher drinking-age requirement exists in accordance with applicable status of forces or country-tocountry agreements. A higher drinking age requirement (up to 21 years) may also be imposed based on the local situation as determined by the installation commander. (T-3). Coordination with host nation commander is required. (T-3). Establishment of a drinking age over the age of 21 years requires Air Force Services concurrence. (T-1).” https://static.e-publishing.af.mil/production/1/af_a1/publication/afi34-219/afi34-219.pdf “AIR FORCE INSTRUCTION 34-219 30 APRIL 2019 Services ALCOHOLIC BEVERAGE PROGRAM” The other service branches follow suite. Presuming such an event happened, anyone selling that person an alcoholic beverage that would violate the above would be subject to10 USC 892, Article 92 of the Uniform Code of Military Justice. Whoever was serving should refuse service. https://jsc.defense.gov/Portals/99/Documents/Arts9293Jun15.pdf Basically it depends on the base commander as to age within the stated parameters, If you want the universal reg (DoD Instruction), Enclosure 9 states: “2. AGE RESTRICTIONS a. Drinking Age (1) The minimum drinking age on a DoD installation located in a State (including the District of Columbia) shall be consistent with the age established by the law of that State as the State minimum drinking age. (2) For DoD installations located in more than one State or in one State but within 50 miles of another State, Mexico, or Canada, the Secretary concerned may establish and enforce as the minimum drinking age on that military installation the lowest applicable age, which means the lowest minimum drinking age established by the law of the State in which the DoD installation is located, or a State or jurisdiction of Mexico or Canada that is within 50 miles of the installation (section 2683 of Reference (xw)). (3) The minimum drinking age on a DoD installation located outside the United States shall be 18 years of age. A higher minimum drinking age shall be based on international treaties and agreements and on the local situation as determined by the installation commander. (4) The commander of a DoD installation may waive the requirements of subparagraphs 2.a.(1) through 2.a.(3) of this enclosure if it is determined that the exemption is justified by special circumstances. Special circumstances are those infrequent, non-routine military occasions when an entire unit at a military installation marks a uniquely military occasion such as the conclusion of arduous military duty or the anniversary of the establishment of a Military Service or organization. The event must be held on a military installation and the commander must ensure that appropriate controls are in place to prevent endangering Military Service members or the surrounding community.” DoD Instruction 1015.10 dated July 6, 2009 Incorporating Change 1, May 6, 2011. https://www.cac.mil/Portals/53/Documents/DODI-1015.10.pdf ",
            "date": "Answered October 11, 2020",
            "views": "17",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yosef Mordechai Coleman",
                    "user_href": "/profile/Yosef-Mordechai-Coleman"
                },
                {
                    "user_id": "Richie Forbes",
                    "user_href": "/profile/Richie-Forbes-2"
                },
                {
                    "user_id": "Ben Waldock",
                    "user_href": "/profile/Ben-Waldock-2"
                },
                {
                    "user_id": "Barry Moss",
                    "user_href": "/profile/Barry-Moss-1"
                },
                {
                    "user_id": "Kevin Keefe",
                    "user_href": "/profile/Kevin-Keefe-26"
                },
                {
                    "user_id": "Alyssa Gosche",
                    "user_href": "/profile/Alyssa-Gosche"
                },
                {
                    "user_id": "Luke Zhuo",
                    "user_href": "/profile/Luke-Zhuo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "What would happen if a 20-year-old Medal of Honor recipient tried to buy a beer at a military bar? Name the living individual who received a MOH at age 20 or younger when it wasn’t posthumous. The question is a non starter. the MOH takes years to be studied, and awarded. Not a lot of 16 year olds in combat for the US, to have received and expedited MOH and be 20. ",
            "date": "Answered October 11, 2020",
            "views": "34",
            "upvotes": " View 115 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tj Adams",
                    "user_href": "/profile/Tj-Adams"
                },
                {
                    "user_id": "Rip Reichenbach",
                    "user_href": "/profile/Rip-Reichenbach"
                },
                {
                    "user_id": "Ben Emmich",
                    "user_href": "/profile/Ben-Emmich"
                },
                {
                    "user_id": "Andrew Woodson",
                    "user_href": "/profile/Andrew-Woodson-2"
                },
                {
                    "user_id": "Kabir Ghai",
                    "user_href": "/profile/Kabir-Ghai-1"
                },
                {
                    "user_id": "Ron McPhetrige",
                    "user_href": "/profile/Ron-McPhetrige"
                },
                {
                    "user_id": "Roger Scott",
                    "user_href": "/profile/Roger-Scott-110"
                },
                {
                    "user_id": "Kendall Lowe",
                    "user_href": "/profile/Kendall-Lowe"
                },
                {
                    "user_id": "Billy Cardin",
                    "user_href": "/profile/Billy-Cardin-1"
                },
                {
                    "user_id": "James Pittman",
                    "user_href": "/profile/James-Pittman-14"
                }
            ]
        }
    ]
}