{
    "title": "What are the easiest things to do in life? - Quora",
    "tags": [
        "Tips and Hacks for Everyday Life",
        "Important Life Lessons",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aarti Gandhi",
                "href": "/profile/Aarti-Gandhi-3"
            },
            "answer_text": "Boy: She cheated on me. She slept with his senior. They are having an affair for 3 months. Girl: Just Move on dear. She does not love you anymore. Boy: Thanks for being my supportive friend always. I promise I will be with you whenever you need me. Girl: I want you to be happy! You are my best friend. After Somedays Boy: See I have feelings for you. You are a girl whom I can trust for my life. Most important you are a Loyal girl. Girl: But we are friends. You are confusing it. It’s not love. Don’t be so stupid. We know you still love her. Boy: Believe me I have suffered a lot and moved on. Though I loved her so much but I can’t trust her now. Even if she realizes her mistakes, I will never be with her again. Trust me. I am so sure about this. I love you. I promise you, I will never hurt you in any way. Girl: I love you as a friend. I don't want to lose you. But I can't do this. I am really not ready for this relationship stuff now. Boy: You too love me otherwise you won't be allowing me to hug you. You have feelings for me but you are just not ready to accept it. Let’s spend some time together and then decide. May be it can work out. I have strong feelings that we have something more than just friendship. I promise I'll never do anything without your permission. I will protect you, I will care for you, I will be my best. And will always be open for you to take out the best of best in me. I will never let you go without a goodbye kiss on your forehead. Will always stand beside you, for you. You matter to me, you are very important to me. I am into you. I love you. After 3–4 months of continuous drama, girl is attracted/confused/convinced to give him a chance. Girl: Okay give me some time. Let’s understand each other first. If it works we will think about it. If not, promise me you will accept my decision and it will not affect our friendship. First week - They started spending time. He was so affectionate, planning dates (restaurants, movies, malls), hugs, promises, future plans. She was avoiding plans being not able to reciprocate with 100% efforts. Arguments and Fight Started. Second week - After a heated argument Boy: I want to talk. We can talk and sort it out. I am booking a room. Let’s go and talk comfortably. We have whole day. Girl: We can talk here also. Why need to go to a room? I can’t. I am going home. Boy: You don’t trust me? I won’t do anything without your consent. I am really not feeling well. I will be comfortable there and we will talk. No-yes-no-please…….After 2 hours of discussion without coming to any conclusion Girl: Okay. The ax asked the tree for its handle, and the tree complied…! Boy: I am sorry I was talking to you like that. I want to hug you. I love you. Girl: Okay take rest. You were not feeling well. Boy: I am just hugging you. Girl: Okay Stop! Boy: Please allow me. I want to make love I am not doing anything wrong. He was making love, she was resisting. He wanted, she didn't…He seduced, she couldn't make it happen. Boy: Listen sweetheart! Thanks for today. Though it was not planned, whatever happened it matters a lot for me. You have made our bond stronger today. You have earnt a huge respect from me. I am all over with my doubts. I promise I will respect your feelings and every decision you come up with. I will wait until you are ready and comfortable for any kind of physical intimacy. I love you. He is still the loving and caring. She is even more confused about her feelings now. There is something wrong with her. He is constantly making efforts, she is also trying. (It seems that the boy didn't want to go into her pants. He wants her to fall for him. He wants her to forget his ex and move on. He wanted to move on too taking her help.) Soon it became frustrating and toxic for both. Again arguments, expectations, complaints, fights, Doubts, boy checking her phone etc. Boy(After another fight): Listen it will not work this way. You keep your privacy, hide your messages, keep your comfort and everything with you. I can't be in such a relation where girl does not love me. How long is it going this way? Don’t talk to me again. Tu padi reh usi ke paas. Mai khud ye rishta khatam kar raha hu. Deleted everything of yours. Aaj se tu mujhe nahi jaanti...or na mai tujhe. Stay happy. Bye. Blocked Girl (text message): But I was not doing anything wrong. My ex texted me because he was shocked from our relation. He was thinking that I broke up with him because we were having something at that time. I was explaining him. I can’t let him suffer. I am 100% loyal to you. Pick Up the calls. No Response. After 3 days…Guess what happened? Boy: Hi, I wanna tell you something. She came back. She is apologizing for her lies, her affair. I believe in second chances. Everybody can change. She promised she will change. I said Yes to her. Girl: You are talking to her day and night…And I am here thinking that you are hurt and upset because of me. Why did you not tell me when she texted you? Boy: I wanted to tell you but we broke up. There was no point of letting you know then. I was so upset. Now we won’t be able to talk. She has asked me to block you. Sorry. Bye. Girl: What about your promises, commitments, love? Boy: You kept talking to your ex. You were cheating on me. You were playing with both of us. You have told me n number of times you don't love me and it is not going to work anyway. I think I should be with her only. Bye.  What, according to me, easiest things to do? To start feeling for someone who is emotionally supporting youTo think that “A good friend will also be a good lover”To take advantage of somebody's breakup phaseTo pretend that you are trying to help them improve their relationTo take rejection to your fragile egoTo make someone feel lovedTo make n number of promisesTo comfort a girl with your presence, words, hugs, timeTo start a new relationship on reboundTo rush into thingsTo get someone laid. (because you think that this way you can get her love)To break trustTo complicate situationsTo get abusive and voilent out of frustrationTo blame othersTo leave someone in angerTo block in just two clicksTo cut off connectionsTo ruin relationshipsYou know what’s hardest thing to do? For selfish people - To think about others' happiness. For emotional & empathetic people - To STOP at the right time. Peace!   ",
            "date": "Updated May 21, 2020",
            "views": "1078",
            "upvotes": " View 726 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikhil Rajput",
                    "user_href": "/profile/Nikhil-Rajput-54"
                },
                {
                    "user_id": "Hillary Anthony",
                    "user_href": "/profile/Hillary-Anthony"
                },
                {
                    "user_id": "Megh Patel",
                    "user_href": "/profile/Megh-Patel-2"
                },
                {
                    "user_id": "Simranjeet Kaur Tind",
                    "user_href": "/profile/Simranjeet-Kaur-Tind"
                },
                {
                    "user_id": "Aarya Medhekar",
                    "user_href": "/profile/Aarya-Medhekar"
                },
                {
                    "user_id": "Vihar Yelgaonkar",
                    "user_href": "/profile/Vihar-Yelgaonkar"
                },
                {
                    "user_id": "Kuheli Dutta",
                    "user_href": "/profile/Kuheli-Dutta-18"
                },
                {
                    "user_id": "Anupam Khargharia",
                    "user_href": "/profile/Anupam-Khargharia"
                },
                {
                    "user_id": "Chandrahash Singh",
                    "user_href": "/profile/Chandrahash-Singh-2"
                },
                {
                    "user_id": "Azhar Qureshi",
                    "user_href": "/profile/Azhar-Qureshi-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manas Bundele",
                "href": "/profile/Manas-Bundele"
            },
            "answer_text": "REACT rather than RESPOND!! Few days back, a friend of mine told me this incident. A small child of nearly 10 years, broke a beautiful vase, bought just a few days back. His uncle on seeing the broken , started shouting on the small innocent guy for breaking such an expensive and lovely vase. He cursed the small boy for his carelessness. Few moments later, my friend asked the the small boy the details of the incident. The boy told that somebody had put a chocolate wrapper inside the vase due to which there were ants running on the vase. When he tried to take that piece out of the vase, few of the ants bit him on his hand because of which he jerked and as the floor was wet, he tripped off, thus accidently hitting the vase. The boy got few injuries on his hand as well as on the head. All of them fell silent. His uncle felt sad for shouting on the innocent boy who was trying to do something good but himself got hurt in the process and on that, even got a scolding for it. Well, reacting suddenly to whatever happened took no time for the man and it is very common reaction too but carefully analyzing the whole situation  and then acting accordingly would have required hell lots of patience.  Though a small incident, made me realize many other moments when we react quickly rather than responding calmly. When someone cuts us off in traffic, how many of us just let it go without getting pissed off? Or how many of us let go the anger without getting offended when someone does something against our wish? Well mostly, we just get angry and refrain from taking the effort to see the other side of the picture. It takes less than a second for us to react to a situation and speak out whatever comes to our mind. We see things as we want to see and fail to see the real reason behind it, most of the times. It takes a great amount of self-control and wisdom to respond positively in the same situation and very less of it to react to it. As it is rightly said, a moment of patience in a moment of anger saves us a hundred moments of regret.  So, stop reacting and start responding, although its not that easy but not that tough too! Always remember, a glass half-empty or half-full depends on the way we see it. :) ",
            "date": "Answered July 18, 2015",
            "views": "29",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sufiyan Ahmed",
                    "user_href": "/profile/Sufiyan-Ahmed-106"
                },
                {
                    "user_id": "Huma Beg",
                    "user_href": "/profile/हुमा-Huma-Beg"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-1070"
                },
                {
                    "user_id": "Divya Naval",
                    "user_href": "/profile/Divya-Naval"
                },
                {
                    "user_id": "Manish Jaiswal",
                    "user_href": "/profile/Manish-Jaiswal-5"
                },
                {
                    "user_id": "Nishant Mishra",
                    "user_href": "/profile/Nishant-Mishra"
                },
                {
                    "user_id": "Diksha Gupta",
                    "user_href": "/profile/Diksha-Gupta-26"
                },
                {
                    "user_id": "Swarup Ghadiali",
                    "user_href": "/profile/Swarup-Ghadiali"
                },
                {
                    "user_id": "Ashish Kumar",
                    "user_href": "/profile/Ashish-Kumar-559"
                },
                {
                    "user_id": "Arpit Agarwal",
                    "user_href": "/profile/Arpit-Agarwal-15"
                }
            ]
        }
    ]
}