{
    "title": "What are the best ways to get people to try your music online? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "David Cooper",
                "href": "/profile/David-Cooper-237"
            },
            "answer_text": "You know what? A lot of my clients are musicians and one of the most common questions that I get asked is how you can get people to listen to their music. And my answer is that you need to find out how to effectively promote your music. Well, promoting your music can be tricky when there are so many other talented artists and bands out there. But if you know how to promote yourself online and learn to make connections in person, you can be on your way to sending your music out into the world like a professional. If you want to know how to promote your music, just follow these steps. 1. Make sure you're ready to share your music with the world. This is the most important point. If you promote a bad track, or even a bad album, it'll be hard to bounce back. It's better to wait until you're absolutely ready to share your music with the world than to put out some music you'll regret making later. Here are some tips for knowing when you're ready to share your music:  If you can, get feedback from respected people in the industry first. Build relationships with producers and ask them if they like a track. Once at least 60% of them think it's worth sharing, take that as a go-ahead because producers will be more critical than your fans. Remember that you have to take the time to build these relationships first.Check out a music feedback service, which can help you share your music with other listeners and get feedback just a few days later. This is a great resource if you don't have as many connections in the professional world, or if you care more about getting in touch with potential fans than producers. Soundcloud is a platform where artists, bands, and producers can host their music for free and compete with one another, with the top liked song in each genre being showcased weekly.2. Discover your brand. Though promoting your music is the most important thing, you have to realize that you're promoting yourself as well. You should see that you're not just a musician or a band member but that you are a product. This product has to be as appealing as possible, so you have to find a way to make your brand as unique and exciting as you can so that fans are excited about you and your music.  Think of yourself as Jessica Simpson or Kim Kardashian. These women understand that they are brands and can put their names on a product, from shoes to lotion, knowing that it will sell big just because of who they are.3. Know your target audience.  Even the best music can get the worst response if it's in the hands of the wrong fanbase. Understand what type of music you're really creating and who that type of music appeals to most of all. This will help you reach out to fans, book the right venues, and sell your music the right way. 4. Raise your likes by the fastest and most effective way Why? Because nobody will spend their time listening to your music if there’s only a few likes on there. Most of them think that a good soundtrack has to get a lot of likes thanks to its quality, but they don’t know that the quality of soundtrack is not the only main reason for the growthof their popularity, there’s also another element that plays an important role in their success. That’s their number of likes.  We all know that you’re not the only one on social-network, and the first thing that will impress audiences is definitely your big number of likes. So finding the fastest and most effective way to raise your number of likes is one of the most necessary steps to complete. And as an expert in this field, I highly recommend that you should Buy SoundCloud Likes from Sell Real Likes, one of the top companies on market. You know why I recommend Sell Real Likes to you? Because they will never let you down, from their high-quality and non-drop likes to their special guarantees such as 100% money back guarantee and 90 days retention guarantee. Well, those are some advices that I gave to my clients, and they were very successful thanks to these. Hope you will be the next successful musician, just like my clients! ",
            "date": "Answered November 25, 2016",
            "views": "369",
            "upvotes": "0"
        }
    ]
}