{
    "title": "What are some top 80's album title tracks by any metal bands? - Quora",
    "tags": [
        "Heavy Metal (music)",
        "1980s",
        "Bands (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Hower",
                "href": "/profile/Ken-Hower"
            },
            "answer_text": "Judas Priest - Screaming For Vengeance - Screaming For Vengeance  Motley Crue - Girls, Girls, Girls - Girls, Girls, Girls  Motley Crue - Dr. Feelgood - Dr. Feelgood  Metallica - Master Of Puppets - Master Of Puppets  Metallica - Ride The Lightning - Ride The Lightning  Black Sabbath - Heaven And Hell - Heaven And Hell  Dio - Holy Diver - Holy Diver  Dio - Last In Line - Last In Line  Dokken - Breaking The Chains - Breaking The Chains  Scorpions - Blackout - Blackout  Iron Maiden - Number Of The Beast - Number Of The Beast  Ozzy Osbourne - Diary Of A Madman - Diary Of A Madman  Ozzy Osbourne - Bark At The Moon - Bark At The Moon  Queensryche - Operation Mindcrime - Operation Mindcrime  Racer X - Street Lethal - Street Lethal  Riot - Born In America - Born In America  Saxon - Denim And Leather - Denim And Leather  Stryper - To Hell With The Devil - To Hell With The Devil  Warrant - Cherry Pie - Cherry Pie  Whitesnake - Slide It In - Slide It In  Y&T - Meanstreak - Meanstreak  ",
            "date": "Updated March 24, 2019",
            "views": "161",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guy Coniglio",
                    "user_href": "/profile/Guy-Coniglio-1"
                },
                {
                    "user_id": "Daniel Botes",
                    "user_href": "/profile/Daniel-Botes-5"
                },
                {
                    "user_id": "Sigal Gurman",
                    "user_href": "/profile/Sigal-Gurman"
                },
                {
                    "user_id": "Sushovan Shakya",
                    "user_href": "/profile/सुशोभन-शाक्य-Sushovan-Shakya"
                },
                {
                    "user_id": "Derek Frost (フブキ)",
                    "user_href": "/profile/Derek-Frost-フブキ"
                },
                {
                    "user_id": "Paul Di Vinci",
                    "user_href": "/profile/Paul-Di-Vinci"
                },
                {
                    "user_id": "Connie Christian",
                    "user_href": "/profile/Connie-Christian-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Di Vinci",
                "href": "/profile/Paul-Di-Vinci"
            },
            "answer_text": "Many answers give me a trouble (but in a good way!, because we had many in commons and I'll trying my best for less repeat 555), Here're mine In no particular order, And this is the welcome track to everyone!. W.A.S.P. - …. Inside the Electric Circus’ 86  Queensryche - the Warning’ 84 Dokken - Tooth and Nail’ 84 Dio - the Last in Line’ 84 Savatage - Hall of the Mountain King’ 87 Accept - Metal Heart’ 85 & Russian Roulette’ 86 Black Sabbath- Born Again’83, Seventh Star’ 86  Judas Priest - Screaming for Vengeance’ 82 Kiss - Creatures of the Night’ 82 Def Leppard - High ’n’ Dry’ 81 Ozzy Osbourne - Bark at the Moon’ 83, the Ultimate Sin’ 86 Iron Maiden - the Numbers of the Beast’ 82, Powerslave’ 84 Megadeth - Peace Sells …. But Who's Buying?’ 86  Motörhead - Another Perfect Day’ 83 Lizzy Borden - Visual Lies’ 87 …. … . . . .. …… …….., .. Additional : Metallica - Ride the Lightning’84, Master of Puppets’ 86 Warrant (Germany) - the Enforcer’ 85 Fifth Angel - Time will Tell’ 89 Liege Lord - Master Control’ 88 Riot - Thundersteel’ 88. ",
            "date": "Updated August 7, 2017",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ken Hower",
                    "user_href": "/profile/Ken-Hower"
                }
            ]
        }
    ]
}