{
    "title": "What do you think of progressive rock? - Quora",
    "tags": [
        "Progressive Rock (music genre)",
        "Rock Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ray Frigon",
                "href": "/profile/Ray-Frigon"
            },
            "answer_text": "I used to get amused at critics who felt progressive rock was some kind of attack on rock and roll, some kind of betrayal; as though genres have boundaries that are chiseled in granite or something. If something goes longer than three minutes, it is something to be rejected. If soloists are featured beyond a guitar segue, it is bombastic. Was Sgt. Peppers the first Prog Rock album? Could be. Most think of Prog as ELP, YES, and bands that had decided elements of Classical in their music or players with Classical backgrounds. Kansas was a favorite of mine. Great musicians and vocalists and story lines. Sometimes elements of Jazz came in, as well. This was music generally played by trained musicians. It showed. I don’t really listen to it anymore. Back in the day it just seemed an attempt, and a successful one, to make rock more sophisticated and introduce time and key changes and elements of composition just not found in pop rock as it was back then. Today, I really don’t know what Prog is. It began to fade in the 80s, and became more Top40 oriented, in the sense of bands trying to create “hits” and all. It seemed to lose the edge it had. It also seemed to become a lot more complicated, same as Fusion became, and it lost its listenability, as bands tried to recoup that edge. It wasn’t fun anymore. Prog today, what little I have heard, just sounds more like Metal, to me. But, these are things that interweave with time and culture and as is generally the case, what used to be comes back around again sooner or later. There is no accounting for taste. Some people love genres I absolutely dislike, if not hate, and vice versa. And neither side understands why the other has such a passionate love for what they listen to and enjoy. “Genre,” itself, is almost meaningless today. New genres are created seemingly every year to account for bands intertwining different elements into their sound. The music I record now … we don’t know what to call it. Miledge Muzic is multi-genre, improv. Like a sound track without a movie. Musical/rhythmic interpretation of terrestrial and extra-terrestrial nature? IDK. It is what it is, and when CD Baby asks for genre, we put Jazz first, but, it isn’t. We could say Rock as primary but, it isn’t. We could say … whatever. So, whatever Prog Rock is today, I appreciate the direction of any music to keep things positive, even if it raises questions or engages protest. Don’t just complain. Produce a better alternative. If music/lyrics just reflects anger and rebellion and destruction, if not outright evil, I couldn’t care less what the genre or talent level is. ",
            "date": "Answered May 8, 2018",
            "views": "922",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mario Tello",
                    "user_href": "/profile/Mario-Tello-4"
                },
                {
                    "user_id": "Kyle Licht",
                    "user_href": "/profile/Kyle-Licht-1"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Parsonage",
                "href": "/profile/Eric-Parsonage-1"
            },
            "answer_text": "I was 13 when King Crimson released ‘In the Court of the Crimson King’ in 1969. It’s widely regarded as a starting point for progressive rock in England although the term didn't become widely used until a few years later. At that age I didn't really ‘get’ it and to be honest, 50 years later, I still don't. Around the same time, Yes had recorded more accessible tracks but they were gradually writing longer and ever more complicated and impenetrable pieces of music rather than songs. Greg Lake’s stint with King Crimson was short lived as he joined up with Keith Emerson and Carl Palmer and it was, by and large, these 3 bands that were termed progressive rock by the media. There were a host of other bands around at the time that were often described as prog because of the complexity of their songs (Stairway to Heaven springs to mind) but Zeppelin were never really prog. Improvisation was the big difference. While King Crimson, Yes and ELP were happy to improvise on albums under the guise of ‘experimentation’, Zeppelin had almost everything worked out before they hit the studio. My view was and still is, don't experiment on the general public. Experimentation is what bands do when they're jamming and from that, hopefully come the ideas for actual songs. By all means improvise live, but don't put it out as your latest album. Genesis were regarded as progressive at that time, presumably because of the length and complexity of tracks like Supper’s Ready from ‘Foxtrot’. In reality, this was a large number of excellent songs, all cleverly linked and it became one side of a vinyl album. So prog could be brilliant (Supper’s Ready) or boring, almost anything by ELP. I recently heard someone say Queen's early albums were progressive and I won't disagree although at the time they weren't regarded as such. As with everything, it's personal taste. For me, if it's well played and memorable there's a good chance I'll play it again. If it's boring, I won't. ",
            "date": "Answered February 10, 2019",
            "views": "668",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Joe Mariani",
                    "user_href": "/profile/Joe-Mariani-4"
                },
                {
                    "user_id": "Kyle Licht",
                    "user_href": "/profile/Kyle-Licht-1"
                }
            ]
        }
    ]
}