{
    "title": "What screams 'I'm pretending to be upper class'? - Quora",
    "tags": [
        "The Upper Class",
        "Middle Class (social class)",
        "Social Class",
        "Wealthy People and Families",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jen Higgins",
                "href": "/profile/Jen-Higgins-13"
            },
            "answer_text": "I am middle class. I grew up in an “rich town” in which a lot of the residents could be considered in the 1% range. My grandparents were lucky enough to purchase their house when the town was first being developed before people were priced out. I went to summer camp and school with these kids. Most did not go to private school, because the public school system was superior. For example, when we were being taught cursive, they brought in a teacher whose sole profession was to go to different schools and just teach handwriting. I still get compliments today how beautiful my handwriting is. The majority of the kids were from “old money” and yes, there is a huge difference. Old money thinks new money people lack manners, are uncouth and flashy. They do not respect new money. They will associate with them, but they are never deemed good enough. Old money doesn't have designer names flashed all over their clothes. They are designer labels, but you won't see the Gucci label all over their chest. They don't purchase items purely because they are a designer brand. They look for quality (fit, cut, material). They don't talk about money. You will never hear old money discussing their fianaces. It's an unspoken rule and would be considered extremely rude, if you ever asked someone how much they made or how much they paid for something. It's just not done. Old money is not driving around town in a million-dollar sports-car. They don't name drop when in conversation. They use first names, where as new money uses first and last name because they want you to know they are important, old money expects you to know. Old money when talking about vacations would simply say, “I went to France and had a lovely time. The hotel was wonderful.” New money would say “I had a few days off and thought, I'll just jet to France. First class was horrid! They didn't have (insert over priced, over hyped wine name here). When we got to the Ritz Carlton, we specifically told them to have caviar (insert over hyped name here) in our room. It wasn't in our room, so of course we told them to get some right now.” This is just an example- it could be anything in which they can complain how horrible service was so they can name drop brands, flight class etc to let you know how rich they are. To put it more in perspective, my best-friend’s father owned a global, name brand company that had been around since the early 1900’s. They have a yearly revenue of several billion dollars . His father's company was so important that my friend got free VIP concert tickets sent to him all the time. Michael Jackson, Madonna etc etc. They owned several yachts and four houses within a seven- mile radius of each other. They had homes all over the US and internationally as well. They never bragged or really brought any of this up in conversation. They would say, “oh today we were at the blue house”. That's it. New money would go on and on about their homes how many they had, who designed them, furniture etc etc. Old money rarely tells you about what they have. In fact, I didn't even know my friend’s family had so many homes until years later. I only knew about four of them and only because those were the ones that they lived in the most and that I had also visited. They never spoke down to me about my clothing, possessions or my parents jobs. When I was with them, they always treated people with respect and were polite. His father actually made my friend start from the ground up in his company. First starting on the production floor. Yes, they took some things for granted. He would wear $500 flip flops around the beach and not think twice about salt water ruining them. I would make a comment and he would just give me a blank stare (it was just beyond his comprehension, since $500 was like $5. ) They would suggest expensive restaurants etc not realizing it wasn't necessarily in my price range. But see, new money would tell you how much the resturaunt is. Old money isn't concerned with it and it wouldn't even occur to them that it might be an issue. New money has to show off. I knew a new money couple whom had four chefs kitchens, all white, fully stocked with restaurant-quality ovens, fridges etc. This couple never cooked and always ate out. The kitchens were purely for show. Old money isn't concerned with flaunting wealth because they have had it for so long. You wouldn't find four kitchens in their homes. They would find it tacky. Old money can be surprisingly frugal as well. They realize they have their money because their relatives before them were stewards of their money and didn't spend it willy nilly. ",
            "date": "Updated June 3, 2020",
            "views": "453",
            "upvotes": " View 1.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jung Ran Kim",
                    "user_href": "/profile/Jung-Ran-Kim"
                },
                {
                    "user_id": "David",
                    "user_href": "/profile/David-7445"
                },
                {
                    "user_id": "Nanette Dario",
                    "user_href": "/profile/Nanette-Dario"
                },
                {
                    "user_id": "Ana Linares",
                    "user_href": "/profile/Ana-Linares-26"
                },
                {
                    "user_id": "Aparna Sinha",
                    "user_href": "/profile/Aparna-Sinha-9"
                },
                {
                    "user_id": "Colin Jung",
                    "user_href": "/profile/Colin-Jung-1"
                },
                {
                    "user_id": "Steven Burrows",
                    "user_href": "/profile/Steven-Burrows-17"
                },
                {
                    "user_id": "C. Allen",
                    "user_href": "/profile/C-Allen-15"
                },
                {
                    "user_id": "Lexie Sni",
                    "user_href": "/profile/Lexie-Sni"
                },
                {
                    "user_id": "Khyla Avorque",
                    "user_href": "/profile/Khyla-Avorque"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Lee",
                "href": "/profile/Anna-Lee-1072"
            },
            "answer_text": "i’m a very observant person and here are my thoughts on a wannabe rich person. New iphone but the cheap version. If you are talking about iPhones they would have the 11 over the 11 pro or the pro max. The pros are way more expensive than the budget iphone. Iphone 11 is $700 over the pro max which is $1100. $400 is a pretty big amount cause its about 57% more than the 11.designer with flashy logos. This is a big show off to the lower classes but honestly you probably saved up for months for it and real upperclass do not wear logos like supreme or gucci written right on the front. A rich person thinks i don’t want to show off and stay humble and i don’t wanna be robbed. People always bragging have a higher percent of get pick pocketing.this ones like the iPhone thing but technology. They might have and apple watch but have like the series 1 or the more popular one the 3 going for 199 unlike the other models where it gets more expensive saying for instance the 4 and 5. Also for laptops they would have a cheap laptop like hp or chromebook cause people don’t show off the computers they are usually in the house and will never leave the house.bragging in general. I’m going to cali this summer no one cares. Actual rich ppl. I’m going to france but doesn’t tell anyone or tells close friends.Looking down on poor people is another one. Rich ppl have better values and education most likely and treats everybody equallyracism- you are tend to be less racist if you have been in contact with the other ethnic group. Which if you have no idea on culture of the ethnic group it can come off as racist. Which rich ppl tend to be less racist cause they have met and been to a lot of places normal ppl can’t. (our president trump is a great example btw🙄) but i said most. Edit: since I’m getting comments that some of these are not right. Its from a high schoolers pov on other high school students. ",
            "date": "Updated October 30, 2020",
            "views": "275",
            "upvotes": " View 84 Upvoters",
            "upvoters": [
                {
                    "user_id": "C. Allen",
                    "user_href": "/profile/C-Allen-15"
                },
                {
                    "user_id": "Brian Kinney",
                    "user_href": "/profile/Brian-Kinney-46"
                },
                {
                    "user_id": "JD Crystal",
                    "user_href": "/profile/JD-Crystal"
                },
                {
                    "user_id": "Scarlett E. Peach",
                    "user_href": "/profile/Scarlett-E-Peach"
                },
                {
                    "user_id": "Emma Wesner",
                    "user_href": "/profile/Emma-Wesner"
                },
                {
                    "user_id": "Jessica Wang",
                    "user_href": "/profile/Jessica-Wang-508"
                },
                {
                    "user_id": "Kelly Wang",
                    "user_href": "/profile/Kelly-Wang-281"
                },
                {
                    "user_id": "Marley Lang",
                    "user_href": "/profile/Marley-Lang-6"
                },
                {
                    "user_id": "Leanna Rosenthal",
                    "user_href": "/profile/Leanna-Rosenthal"
                },
                {
                    "user_id": "Glauco Vinicius",
                    "user_href": "/profile/Glauco-Vinicius-1"
                }
            ]
        }
    ]
}