{
    "title": "What is the meaning of the lyrics to '21 Guns' by Green Day? - Quora",
    "tags": [
        "Green Day (band)",
        "Song Meanings",
        "Song Lyrics",
        "Meaning (philosophy)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Neville",
                "href": "/profile/Tom-Neville-3"
            },
            "answer_text": "In my opinion 21 guns is an anti war song and goes into the horrors of war which scar everybody. „Do you know what‘s worth fighting for, When it‘s not worth dying for?“ What‘s at stake in this war? Is it important enough that I should give my life for it? What greater good does it serve? „Your faith walks on broken glass, and the Hangover doesn‘t pass, nothings ever built to last, you‘re in Ruins.“ These lines seem to go into PTSD that soldiers face when returning from war, ie The Hangover doesn‘t pass. Also, Soldiers may tend to question their religion, ie your faith walks on broken glass. The Anti-War sentiment is brought out in the chorus: „1, 21 guns, lay down your arms, give up the fight. 1, 21 guns, throw up your arms into the sky.“ A 21 gun salute is usually used in the military to honor those who have fallen. Here, the pause between the 1 and the 21 shows the 1 who has died and the 21 gun salute fired in his honor. It‘s also supposed to show that Peace should be encouraged, and that perhaps these people dying isn‘t worth it when peace is an option. So yeah, that‘s my opinion on this. Overall I love this song, and the message behind it makes it even better. ",
            "date": "Answered September 19, 2020",
            "views": "34",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shrey Patel",
                    "user_href": "/profile/Shrey-Patel-67"
                },
                {
                    "user_id": "Jane Brown",
                    "user_href": "/profile/Jane-Brown-435"
                },
                {
                    "user_id": "Han Chen",
                    "user_href": "/profile/Han-Chen-170"
                },
                {
                    "user_id": "W Matsubuchi",
                    "user_href": "/profile/W-Matsubuchi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadia Rahman",
                "href": "/profile/Sadia-Rahman-48"
            },
            "answer_text": "I think this song wants to convey how worthless war or revenge can be. There comes a time when one realises the futile point of fighting carrying all the unbearable pain of his own sins and wrath towards others as u see “does the pain weigh out the pride and u look for a place to hide”…. therefore the singer is calling for the end of the fight “ONE, twenty one guns” …I think before 21 guns the one has a deeper meaning means ‘United’ as after the line he says “lay down ur arms give up the fight”…. basically giving up the fight after giving the dead the proper burial with honour of 21 guns for which they died for ….my favorite line “like a liar looking for forgiveness from a stone” represents a very worthless act …the liar isn't sorry and still asking for forgiveness which has no point and that also from a stone (maybe a heartless person) who isn't going to forgive the liar anyway so more worthless ",
            "date": "Answered April 5, 2019",
            "views": "196",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Morgan",
                    "user_href": "/profile/Sarah-Morgan-673"
                },
                {
                    "user_id": "Zyl",
                    "user_href": "/profile/Zyl-12"
                },
                {
                    "user_id": "Alexis Delos Reyes",
                    "user_href": "/profile/Alexis-Delos-Reyes-1"
                },
                {
                    "user_id": "Han Chen",
                    "user_href": "/profile/Han-Chen-170"
                },
                {
                    "user_id": "Jose Alejandro Gomez",
                    "user_href": "/profile/Jose-Alejandro-Gomez-2"
                },
                {
                    "user_id": "Sky Hylands",
                    "user_href": "/profile/Sky-Hylands"
                },
                {
                    "user_id": "Laminar Flow",
                    "user_href": "/profile/Laminar-Flow-3"
                },
                {
                    "user_id": "Christine Schmittauer",
                    "user_href": "/profile/Christine-Schmittauer-1"
                },
                {
                    "user_id": "Marcus James",
                    "user_href": "/profile/Marcus-James-187"
                },
                {
                    "user_id": "Gunjan Sarkar",
                    "user_href": "/profile/Gunjan-Sarkar-1"
                }
            ]
        }
    ]
}