{
    "title": "What is the easiest type of song to write? - Quora",
    "tags": [
        "Songwriting",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brett Jackson",
                "href": "/profile/Brett-Jackson-33"
            },
            "answer_text": "I was trying to think of some pithy answer for this that would blow your mind and cause people to re-evaluate their lives, but you are essentially right. The blues, as long as you are familiar with the genre, would be the easiest to write because it's mostly written for you. The Blues, 1-4-1-1-4-4-1-1-5-4-1, or some variation on that is a set form and you can only deviate so much from it before you are essentially crossing into another genre. I say that you must be familiar with the genre because if you are not it would be as foreign to you as me trying to write Indian Classical music. Perhaps the Blues is easiest because we are most familiar with it and because it is a relatively simple format. That being said, I don't think your experiment will yield anything anyone would want to listen to. If your approach is, \"how do I write a song with the least amount of effort\" you will be frustrated by the results as they will only be listenable in the academic sense. Perhaps the easiest song to write is the one that is most familiar or already written for you. To counter, I would say the hardest type of song to write is the one you are least familiar with. If I tried to write, as one of my teachers did, four songs representing four different periods of European classical music such as Baroque, Classical, Romantic & Impressionistic using the same melodic theme, I would have a hell of a time because, although I can tell you a few things about what makes those genres different, I don't have a strong enough grasp of the fundamentals of the harmonic and melodic rules that dictate those styles to really pull it off. I would have to do some serious research and spend a lot of time listening and writing before I came up with something that would fool a serious lover of those styles. And I don't like to bag on the blues either. While the genre may be somewhat simple and repetitious, it is no more than most other popular genres and so the beauty and complexity come from the subtle differences of each song. That's how people can keep coming up with songs and the genre still is interesting. Howlin' Wolf doesn't sound quite like Stevie Ray Vaughn for many reasons. And that's because one of the essential things about the Blues is that it is designed to be a platform for soloing. So much of what makes a great Blues song is the mastery of musicianship evident in the performances on each song as the master takes a solo. So I would have to say, if you want to write a crappy song with no appeal them write a crappy Blues song, but if you want to write a great Blues song you are going to need to get some awesome musicians to turn your song into something worth listening to. Why not write and EDM song? Once the bass drum is laid down you are pretty much done. But would you feel satisfied that you have written a song? How do you know when you are done? The easiest song to write is the one that just comes out of you with little effort. It grows naturally and effortlessly from who you are and all the music you have listened to you whole life. That is why when I tried to write a classical song it ended up sounding like me and not Mozart. I can't say that one genre is intrinsically easier than another any more than a type of painting style is easier. With each style comes different challenges and different ways to express yourself. The real trick is to make something good. Something you can be proud of or that others can take pleasure in. It doesn't matter what genre. ",
            "date": "Answered May 10, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                },
                {
                    "user_id": "Emir Radoncic",
                    "user_href": "/profile/Emir-Radoncic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Ellis",
                "href": "/profile/Sean-Ellis-14"
            },
            "answer_text": "All genres are easy to write songs for if you are talking about formulaic examples of the genre. It's incredibly easy to pick a key and follow the standard I-IV-V progression all the way to the end with some inane blues-like lyrics over the top and a standard blues scale solo, but it's something else entirely to infuse it with unique and interesting lyrics, key changes or bridges and soulful fills and solos. The same could be said of rap, electronic music, rock, jazz, classical, etc: following the formula to create what can be considered a song is just a matter of knowing the recipe. To be good it has to transcend the recipe in some way with an interesting flavor. ",
            "date": "Answered November 3, 2014",
            "views": "434",
            "upvotes": "0"
        }
    ]
}