{
    "title": "What do you think about the new Star Trek Discovery series? At first, I thought it was the worst Star Trek series in history, even worse than the so misjudged Star Trek Enterprise? Do you think the sacred Prime Directive would be respected? - Quora",
    "tags": [
        "Prime Directive",
        "Star Trek: Discovery (2017 TV series)",
        "Science Fiction TV Series",
        "Star Trek: Enterprise (TV Series)",
        "Star Trek: Voyager (TV Series)",
        "Star Trek (TV Series)",
        "Star Trek: The Next Generation (TV series)",
        "Star Trek (creative franchise)",
        "Science Fiction (genre)",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naman Kumar",
                "href": "/profile/Naman-Kumar-189"
            },
            "answer_text": " I find it pretty meh. I'm sure a lot of people like it, but it never really clicked with me for a few reasons: I dislike Michael Burnham, mostly because she's a really bland character and the show still keeps putting her on a pedestal - Spock's sister, Red Angel, savior of the multiverse - it's hard to buy when we haven't ever heard her name before. This is already a little shady, since before this Sisko was the only character who was destined to do something (and even his actual prophetic role was relegated to the last 10 minutes of the finale). Almost every character apart from her has to earn their role through their actions. In fact, the character who was the prime example of nepotism in the Federation, Tom Paris, was an absolute failure until he redeemed himself in a situation in which his father could do nothing. This is also somewhat of a specific problem in her case because she's not a captain; this leaves her reacting rather than taking action, and naturally it appears that the show seems to be weaving around her. Also the actress cannot emote, they should've tried to get someone like Zazi Beetz or Danai Gurira instead. This is important because sheer star power or good acting can usually elevate poorly written characters (like Dirty Harry or Molly Ringwald in the Breakfast Club) - imagine Zendaya in the role, I highly, highly doubt people would be complaining about Burnham if she was better casted.The actual science is insane. Not only did the spore drive never make an ounce of sense to me, but it makes so much of DS9 and Voyager irrelevant - you're seriously telling me that the bloody DOMINION never tried to utilise this shit? Plus, why wasn't the idea ever brought up in Voyager? Even if it took a few years to make, you have to be kidding me that they'd choose normal warp travel over hurting a few mushrooms; Janeway would be on board in like a second. And since the Federation already knew about this, Sloan and the others could simply rig the Defiant with one of those babies and DS9 would be theirs in all of ten minutes.The show is afraid to take risks. When they went into the future I thought the show might finally make something of itself, but of course it went the post-apocalyptic wasteland route. Saying 'All the dilithium exploded' is like saying 'All the quartz exploded,' ie. it doesn't make any sense within the established framework of Star Trek. Apart from that, we actually do know that in the 29th century Federation ships were not running on dilithium (VOY: Future's End) and that Romulans have never used dilithium. So what sense does it make that warp travel doesn't exist? Literally none. Anyway, the reason the show went this route is because it's easy to write that kind of story compared to an actual 31st century future. This can also be seen in the fact that the show chose to make stories out of Section 31, the Mirror Universe, Klingons and Spock's Sister (instead of a new character), all previously established tropes; the other series all had completely new premises.Speaking of premises, what is the premise of this show? Discovery has gone through plotline after plotline, but I still can't find its defining feature. Loosely it's about the adventures of the Starship Discovery, but the actual storylines are not really adventures at all, which makes me think that there never was any real consensus of what it was about in the writer's room. This is why the series so far has been muddled and confused, with forced conclusions, little allegory and just terrible twists. Off the top of my head, I can think of the following premises for the other shows, but I have no clue what a similar logline about DIS would be like:TOS: A weekly adventure following Captain Kirk and the Enterprise through the stars.TNG: A weekly adventure following Captain Picard and the Enterprise through the stars.DS9: Examines the Cardassian-Bajoran conflict (and later the Dominion war) through a Federation space station which houses the Emissary of the Bajoran religion.VOY: Stranded light-years from the Federation, the starship Voyager attempts to get back to Earth through the Delta Quadrant.ENT: A prequel to the original Star Trek dramatizes the very first years of the Federation, covering the adventures of Captain Archer of the original Enterprise.The dialogue is cringe. No legit Starfleet officer would say 'The power of math!’ (and this is coming from an 18-year old in love with math), they'd say 'Well, that's [complicated term] for you,' in the least. Plus, what's with everyone acting like they're teenagers? Voyager was pretty successful at showing a young crew - Tom, Harry, B'elanna, Kes, 95% of the officers and really even the Doctor was practically a teenager - and what they used to do was hang around bars with small-scale parties, which seems like something actual teenage nerds (believe me, I know) would do instead of whatever weirdo American frat parties the Discovery crew gets up to. Remember Chakotay telling off Harry every second of his day? Remember Jellico relieving Riker for being a baby? Remember Sisko going crazy over Nog’s application, rejecting him until he truly proved that he could be a model officer? Remember Tuvok disciplining the Maquis through actual military exercises? I recall them going on a 10-mile run inside the ship with 10% extra gravity for weeks. People on the USS Discovery could really use some of that famed Star Trek discipline. And don't even get me started on the speech-of-the-day; yuck, just yuck. Even Picard couldn't justify the stupidity they put into those scenes. The days are gone of Sisko ranting about how the Federation has no clue what paradise is or Picard explaining to Worf just why witch-hunts are so dangerous or why speech must be protected.The pacing is really off, and this is particularly jarring because I don't think Trek has ever got it wrong before. Every moment of every episode is full of tension and zoom-ins of Michael crying with little to no time for relaxation. Remember back when the cold opens of the episodes were usually the crew just having some fun? Janeway in the Holodeck, Data reciting poetry, Dukat calling Kira to tell her that he banged her mother… well, maybe not the last one. But still, it always seems like Discovery is caught in some universe-destroying problem or the other, and since we know next to nothing about the crew, we just don't really care. So all in all, I don't like watching the show, and I find it extremely mediocre because of the writing. I won't call it outright bad because: The acting (apart from Green) is very good, not Stewart-level but better than the vast majority of TrekThe VFX is absolutely gorgeous, best in class for surePikeBut apart from that, the show isn't very good, and I don't think I'd recommend it to anyone at all. ",
            "date": "Updated October 22, 2020",
            "views": "222",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frazer Harrison",
                    "user_href": "/profile/Frazer-Harrison-3"
                },
                {
                    "user_id": "John Sokic",
                    "user_href": "/profile/John-Sokic-1"
                },
                {
                    "user_id": "Paweł Kłopocki",
                    "user_href": "/profile/Paweł-Kłopocki"
                },
                {
                    "user_id": "Aadi Prasad",
                    "user_href": "/profile/Aadi-Prasad-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gail Everett",
                "href": "/profile/Gail-Everett"
            },
            "answer_text": "I like Naman Kumar’s answer very much, though I don’t agree with every single point. For one thing, special effects honestly don’t impress me (well, I’m old enough to have watched the broadcast original, so cut me some slack). One thing that does drive me crazy, enough to want to scream at somebody, is the awful camera work. For a while they were circling round and round every scene, to the point that it made me nauseous and I couldn’t watch. Thank God they’ve eased up on that a bit, but there are still these stupid high-overhead shots that in my opinion add nothing at all; and in the previous episode (S3E2), the camera was literally wobbling as if it was being held by an amateur. Why?? It’s just distracting. This isn’t arty, people, it’s a TV show. If you want to show how good you are, WRITE GOOD DIALOG. DIALOG CONQUERS ALL. (Hint: there’s a reason I’m telling them that.) Also, enough with the lens flare. In fact, in general I find the special effects “busy” and distracting. I guess they’re easier to produce than good writing and directing. But I don’t watch a show for special effects. I agree 100% about Burnham. I detest everything about her, from her stupid and unnecessary name (Hey, for a cool sci-fi type name, how about Sonequa?) to her constant whispering, to her unbridled arrogance, to her suddenly discovered and totally unnecessary relationship to Spock. In this last episode I believe she just appointed herself First Officer. I was glad that Saru said something (weirdly put) about not trusting her. IMO she will always be a mutineer at heart. I do love her new hairdo, although how it grew that long in one year is a mystery. And yes I agree, Martin-Green can’t act her way out of a paper bag. The others are uniformly good and carry her. In fact, Jason Isaacs carried season 1 all by himself and Anson Mount carried season 2. I guess Doug Jones is it for season 3? To me, the big problem is the writing. It’s lazy and cliched. I’m willing to give the technobabble a pass in most cases, but they sure could have put at little more thought into it. I’m sure they think they’re trying to please the longtime Trekkies, but I’m not sure they really understand them. Trekkies like science. However, it’s clear that warp travel does exist in the third season; it’s just rare. I’m hoping some Romulans show up. There’s also WAY too much violence for my taste. In the last episode, we even had to start out with a holographic training session, just to get some extra stuff in. I have no interest in this at all. There have been episodes where I just skipped up to 10 minutes of the plot because it was nothing but fighting. I don’t care! Overall, it just feels like the show is there for the special effects, not the SFX for the show. I know they’re thinking of this as a season-long movie every time, and I’ve accepted that, but they need to focus on character development more. Remember Airiam? Who barely spoke a word until the episode where she sacrificed herself, and then there was a big sad funeral for her? You can’t do that and expect me to care. Showing some family pictures for 5 minutes isn’t enough. I see improvement so far this season. Burnham in the first episode was fairly interesting - she should do more of that happy dust. And Book was given some good lines in Eppie 3. And I very much like the subtle issue with Detmer, which I’m convinced is going to pop up at some point. It’s being handled much the way the Lorca arc was handled, with very small hints that they should just put a little more emphasis on. I’m a fan of subtlety, but it can’t be so subtle that you completely miss it. Once again, better writing is needed. And fewer Big Speeches. Show, not tell. Personally, I do think the show is worth watching, but you definitely need to refresh your Suspension of Disbelief button before every episode. ",
            "date": "Answered October 29, 2020",
            "views": "44",
            "upvotes": "0"
        }
    ]
}