{
    "title": "What are some really good film score tracks? - Quora",
    "tags": [
        "Movie Soundtracks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yvette Renshy",
                "href": "/profile/Yvette-Renshy"
            },
            "answer_text": "Gone With The Wind - Max Steiner Gone With The Wind is largely considered to be one of the best movies of all time, a civil war drama which focuses on the story of Scarlett O’Hara and her love affairs with Ashley Wilkes and Rhett Butler. In the end Scarlett ends up alone. The soundtrack was produced by Max Steiner who is one of the era’s film composing greats.  Rapsodia Satanica This film goes way back. Rapsodia Satanica was made in 1915 and was directed by Nino Oxilia. The storyline followed a female version of Faust, a popular legend where the main character (Faust) makes a pact with the devil. In the end she dies. The music was by Pietro Mascagni, an Italian opera composer. The piece is notably in the style of Western classical music as was the norm for early films. Early film composers tended to be classically educated.  Once Upon A Time In The West - Ennio Morricone I could list several Ennio Morricone tracks worth mentioning. Once Upon A Time In The West is a spaghetti western movie by the one and only Sergio Leone. It also contends the title one of the greatest films ever made. I pity the girl who tries to hit that high note…  Hateful Eight - Ennio Morricone Whilst Hateful Eight isn’t the most ‘new’ thing Morricone has done, it’s not dissimilar to his older work, I appreciate how much more original Ennio Morricone sounds than other composers today. I like the fact that he uses the more traditional woodwinds and tries not to slip into “Zimmerisms” like other modern composers by adding loads of blaring horns, stabby strings, and heavy drums.  Navajo Joe - Ennio Morricone I promise this will be the last Morricone track however it deserves a mention. Morricone was the most influential composer in creating the stereotypical ‘western’ sound in film music. He made western music gritty and raw, it wasn’t polished like previous western film soundtracks which were far more heroic and grand, more influenced by Copland’s music.  Vertigo - Bernard Herrmann Another composer on which you coul dhave a field day on his music. Bernard Herrmann is widely considered one of, if not the best composers in film. He was certainly the most famous of his era.  Psycho - Bernard Herrmann He was also responsible for the Psycho theme which is the most famous horror film soundtrack to date.  Cape Fear - Bernard Herrmann  The Day The Earth Stood Still - Bernard Herrmann Lastly, we cannot forget the famous soundtrack which bought the iconic ‘alien’ sound to cinema. Herrmann made use of the theremin and its ethereal sound qualities to produce a truly mystifying, eerie soundtrack. A lot of composer take inspiration from this guy. It was too bad he fell out with Hitchcock. Bernard’s inability to adapt to the changing times and introduction of pop music lead Hitchcock to hire someone with more experience in popular music, among other reasons like Herrmann’s diva personality.  Planet Of The Apes - Jerry Goldsmith Jerry Goldsmith is notable for the inclusion of more avant-garde styles into his music. The Planet Of The Apes soundtrack was a perfect way to introduce ethnic instruments and non-standard instruments and effects into the orchestra to create an otherworldly sound. Jerry Goldsmith would go on to produce numerous other famous soundtracks.  A Streetcar Named Desire - Alex North Produced in the fifties during a time when popular music was making more of an appearance in cinema music. It represents a changing sound in cinema music adapting to suit young teenage audiences.  The Ipcress File - John Barry Before the James Bond theme, there was this piece by the same composer. John Barry used very intimate orchestration and jazz instruments to achieve the ‘spy sound’. The sound has synonymously become associated with old school spy movies and all things ‘cool’.  ",
            "date": "Answered August 8, 2017",
            "views": "372",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tristan Fernandes",
                    "user_href": "/profile/Tristan-Fernandes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deb Snyder",
                "href": "/profile/Deb-Snyder-4"
            },
            "answer_text": "For me, two favorites are the score from the most recent remake of Pride and Prejudice with Keira Nightly and the soundtrack to Memoirs of a Geisha. On P&P, the music is like another character of the film, framing scenes and evoking emotion. For Memoirs, the music is a counterpoint, or an underscore to the transitions of time and place, as well as enriching the dialogue or lack thereof with emotive orchestral sounds. Chairman’s Waltz is a particular favorite. ",
            "date": "Answered August 8, 2017",
            "views": "45",
            "upvotes": "0"
        }
    ]
}