{
    "title": "What is the difference between sound design, sound mixing, sound engineering and sound editing? - Quora",
    "tags": [
        "Sound Mixing",
        "Sound Editing",
        "Sound Design",
        "Audio mixing (recorded music)",
        "Audio and Acoustical Engineering",
        "Sound Engineering",
        "Sounds",
        "Music Production",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Clem",
                "href": "/profile/Martin-Clem-1"
            },
            "answer_text": "Sound design= you create sounds using various equipment like synths or record and sample sounds from the environment etc. sound mixing = basically you are controlling the levels of various inputs to make the best quality possible. This could be a room with people talking to a rock band to an orchestra. You could use various equipment or computer software to add effects as well sound engineering = This is stuff like setting up microphones , plugging in equipment , running cables etc. sound editing = this is removing or moving about bits of audio , years ago you would literally use a razor blade to cut tape , now you would normally use DAW software. ",
            "date": "Answered April 19, 2019",
            "views": "227",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Natsuki Han",
                    "user_href": "/profile/Natsuki-Han"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hardy",
                "href": "/profile/Bob-Hardy-19"
            },
            "answer_text": "Sound design could be for movie soundtracks or meditation music. It’s about creating something that’s not exactly a song, but creates a particular kind of audio space and something to fill it that paints a kind of emotional or mental picture. It can set a mood, adding to the impact of the visual presentation that accompanies it, if any. Sound mixing has mainly to do with recording or live performances. A number of sources - microphones, electrified instruments, or whatever - are combined to make a pleasing blend in stereo (most often), mono or surround. This often includes adding any processing, like EQ, compression, and any effects. Sound engineering is most often used to describe the process of putting down the tracks that the sound mixer will eventually combine. The engineer could also be the mixdown person, or it could be a separate person. Sound editing has nothing much to do with making sounds or mixing them, but rather with taking out what is not wanted, and placing what is wanted into the correct point in time or in sequence. This could be any kind of music or soundtrack. It can be more about cleaning up sounds already “in the can” (recorded) or about getting the pacing and sequence right. It is the audio counterpart to film/visual editing. ",
            "date": "Answered April 18, 2019",
            "views": "370",
            "upvotes": " Answer requested by Natsuki Han"
        }
    ]
}