{
    "title": "What do Berklee College of Music graduates do after school? - Quora",
    "tags": [
        "After School",
        "Berklee College of Music",
        "Recent Graduates"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grey Arney",
                "href": "/profile/Grey-Arney"
            },
            "answer_text": "I graduated in the last 10 years and have seen classmates do the following: Enjoy wild success and go on tour with major performing actsPlay on late night TV showsWrite music for video games, television and moviesWork at music software companies designing soundsBuild instruments (requires further training, though)Teach private lessonsTeach at colleges (further education is preferred; masters degree or more)Pivot dramatically and go into medicine, dentistry, law, computer science (requires going back to school)Busk for money on the streetStruggle for years and years to build a career as a performing artist, scraping by with whatever income is availableThere are few “safe” paths in music, but hardworking and enterprising individuals can carve out a niche for themselves. This is not something you should do unless you’re absolutely certain. For more information, check out this PDF published by Berklee’s own Career Development Center. It’s extremely informative. ",
            "date": "Answered May 10, 2018",
            "views": "21",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Tarang Joseph",
                    "user_href": "/profile/Thomas-Tarang-Joseph"
                },
                {
                    "user_id": "Pista",
                    "user_href": "/profile/Pista-2"
                },
                {
                    "user_id": "Srishti Sharma",
                    "user_href": "/profile/Srishti-Sharma-40"
                },
                {
                    "user_id": "Beatriz Canaan Lopes",
                    "user_href": "/profile/Beatriz-Canaan-Lopes"
                },
                {
                    "user_id": "Sanskar Vaidya",
                    "user_href": "/profile/Sanskar-Vaidya"
                },
                {
                    "user_id": "Abigail Zocher",
                    "user_href": "/profile/Abigail-Zocher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Fox",
                "href": "/profile/Michael-Fox-188"
            },
            "answer_text": "Berklee is a truly wonderful music school - especially if the student takes full advantage of the knowledge, joy and wisdom they'll find in the faculty and their fellow students. For me, I hired a band on a cruise ship after leaving Berklee in 1983, played with The Ringling Bros Circus, The Ice Capades, Gladys Knight and the Pips, The Spinners, O'Jays, and others, and taught lessons in a Texas schools system. Since then, I've played at the Kennedy Center, and many other notable venues.I made a career in Telecommunications (as it is more suitable to me from many perspectives), while continuing to study and play music since I left Berklee! Many of my classmates (Diana Krall, Terri Lynne Carrington, Franck Amsallem, Tony Gorruso) have made great careers in music since then; some (like those above) are (in varying degrees) famous, but many are not, even though they are exceptional musicians. Musicians make music their whole lives, regardless of where they go to school. The one thing that matters to us all is continuing to learn about, love, and play/write/rehearse/share/listen to music in a way we never would have if we hadn't been to Berklee. ",
            "date": "Answered July 15, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srishti Sharma",
                    "user_href": "/profile/Srishti-Sharma-40"
                },
                {
                    "user_id": "Beatriz Canaan Lopes",
                    "user_href": "/profile/Beatriz-Canaan-Lopes"
                },
                {
                    "user_id": "Abigail Zocher",
                    "user_href": "/profile/Abigail-Zocher"
                }
            ]
        }
    ]
}