{
    "title": "What are the names of weeks in Javanese and Balinese cultures? - Quora",
    "tags": [
        "Balinese Ethnicity and People",
        "Balinese Culture",
        "Javanese Ethnicity and People",
        "Javanese (language)",
        "Culture of Indonesia",
        "Bali, Indonesia",
        "Indonesia",
        "Ethnic and Cultural Differences",
        "Culture (social science)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madyaswanto Budi Wicaksono",
                "href": "/profile/Madyaswanto-Budi-Wicaksono"
            },
            "answer_text": "You mean the name of the weeks in Pawukon (210 days calendar)? Both cultures are using same pawukon. In one pawukon, there’s 30 Wuku or weeks (30 names). These are the names of the wuku/ weeks : Wuku Sinta - Batara YamaWuku Landep - Batara MahadewaWuku Wukir, Ukir - Batara MahayaktiWuku Kurantil, Kulantir - Batara LangsurWuku Tolu, Tulu - Batara BayuWuku Gumbreg - Batara CandraWuku Wariga alit, Wariga - Batara AsmaraWuku Wariga agung, Warigadian - Batara MaharesiWuku Julangwangi, Julungwangi - Batara SambuWuku Sungsang - Batara Gana GanesaWuku Galungan, Dungulan - Batara KamajayaWuku Kuningan - Batara Indra.Wuku Langkir - Batara KalaWuku Mandasiya, Medangsia - Batara BrahmaWuku Julung pujut, Pujut - Batara GuritnaWuku Pahang- Batara TantraWuku Kuru welut, Krulut - Batara WisnuWuku Marakeh, Merakih - Batara SurangganaWuku Tambir - Batara SiwaWuku Medangkungan - Batara BasukiWuku Maktal - Batara SakriWuku Wuye, Uye - Batara KoweraWuku Manahil, Menail - Batara CitragotraWuku Prangbakat - Batara BismaWuku Bala - Batara DurgaWuku Wugu. Ugu - Batara SingajanmaWuku Wayang - Batara SriWuku Kulawu, Kelawu - Batara SadanaWuku Dukut - Batara Sakri.Wuku Watu gunung - Batara Anantaboga.It used for Javanese and Balinese Astrology Primbon Djawa Pawukon - 1972 ",
            "date": "Updated September 18, 2020",
            "views": "54",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ali Aulia Ghozali (علي اولياء غزالي)",
                    "user_href": "/profile/Ali-Aulia-Ghozali-علي-اولياء-غزالي"
                },
                {
                    "user_id": "Ayu Desy Wahyuni",
                    "user_href": "/profile/Ayu-Desy-Wahyuni"
                },
                {
                    "user_id": "Bagus Indra Dermawan",
                    "user_href": "/profile/Bagus-Indra-Dermawan"
                },
                {
                    "user_id": "Bayu Riyadi",
                    "user_href": "/profile/Bayu-Riyadi"
                },
                {
                    "user_id": "Denie Kasan",
                    "user_href": "/profile/Denie-Kasan"
                }
            ]
        }
    ]
}