{
    "title": "What is the difference between an active pickup and passive pickup? - Quora",
    "tags": [
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Animesh Srivastava",
                "href": "/profile/Animesh-Srivastava-20"
            },
            "answer_text": "Hello,I think I have a pretty good idea about that, and I will try to keep it as simple as I can. Passive Pickups have magnets. They magnetize the nickel in the strings.The Magnetic Lines of Force move through the winding of the coil(s) of the pickup inducing a current, as the string vibrates.This signal is sent through a cable to your amplifier.The guitar's controls and the input of the amplifier it's connected to, load the pickup.variation of this load greatly affects the tone. (harmonic content) Active Pickups are built like passive pickups, but they also have a built-in preamp.Because of the preamp, active pickups have a much lower output impedance than passives.This low impedance output makes the cable less susceptible to hums and noises.Active pickups can also use weaker magnets and fewer winding on the coil.and the coils in the active pickups see a predictable load: the preamp.This means the load and the coils can be optimized for best match.Variations in the load the preamp is connected to, has little effect on the tone. Bottom Line:Passive pickup = Coil + Magnet.Active pickup = Coil + Magnet + Preamplifier (+Battery) Advantages and disadvantages: So, why would you use a powered circuit when you could use a passive one?Well, the problem with passive pickups is that the many coils of wire involved can transmit a lot of hum and background interference (this was the main reason that humbuckers were developed). In addition, the magnets used in passive strings can pull them inwards, and occasionally cause intonation issues. Passive pickups are also pretty sensitive to feedback, when pushed hard. The lower number of coils on an active pickup means that they have a lower natural output (i.e. before the pre-amp), are less susceptible to background noise, and are naturally much quieter in this regard. However, the active pre-amp means that these pickups generally have a far higher output gain than passive models, too. Add in the ability to EQ the tone beyond a simple tone control, and you have a pretty impressive pickup.So, why aren’t all pickups active? Well, passive pickups, despite their drawbacks, have a greater dynamic range. If you’re the kind of player that likes to be able to move from whisper quiet, to a screaming wail, then a passive set-up is likely to suit your playing style best. Plus, these types tend to lose high frequency detail, and enhance lower frequencies, giving them a warmer tone. Some notable guitar players who preferred passive pickups:Jeff Beck, Darrell Abbott, Eddie Van Halen and Jimi Hendrix. Some notable guitar players who preferred active pickups:James Hetfield, Kirk Hammett, Dimebag Darrell and Kerry King. ",
            "date": "Answered November 26, 2015",
            "views": "521",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Varela",
                    "user_href": "/profile/Mark-Varela"
                }
            ]
        }
    ]
}