{
    "title": "What is the best electric guitar under 20k INR? - Quora",
    "tags": [
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elton Edgar",
                "href": "/profile/Elton-Edgar-1"
            },
            "answer_text": "Oh, another A2A. Thank you, thank you, indeed. Well, firstly, from the substance of your question, it's hard to ascertain what kind of music you'll be playing...hahaha, I'm just kidding, it doesn't matter, you can play anything on anything.  Seriously, I once muddled my way through the song 'Autumn In New York' with a B.C. Rich Mockingbird and nary an eyebrow was raised. Secondly, you probably want to purchase this in or have it sent to India or thereabouts. Thirdly, I can infer that you're looking for a entry level/mid-range guitar because of your price point and plan to dominate (again assuming) the Indian music world with it, as you want \"the best\". A lofty goal, my friend. Well done.  It is in that spirit to submit three choices all are around the 20k INR/$300 price price point you're after, one will be a given, another a viable option and the other, I'll try to make it weird...so as not to bore you. Choice one... Squier Vintage Modified Stratocaster '70s Electric Guitar   That versatile beauty will set you back roughly 16,642.50 INR or $250 (for those dollar spenders playing at home).  Though not really ideal for some metal, it's a solid entry level Strat that is a work horse in it's own right.  It'll get you through most major college parties, 80's tribute bands, impromptu jazz forays after hitting the \"naughty\" hooka and late night boozy jam sessions without a hitch and it might even turn you into a rock star if you play your chords right.   I promise nothing. Choice two... Go used.  By that I mean, hunt down a guitar in a pawnshop or even eBay.  You'll get a lot more bang for your buck going that route.  I would suggest something with either a humbucker and single coil pickup configuration like so...  Or...  The humbucker will help you get those beefier sounds (should you so desire) Or maybe just two humbuckers...  That's your call and depends on what sound you're going after.  If you're going to a brick and mortar store, play them first and see which configuration you fancy and don't be afraid to haggle a bit.  It may or may not work but, you never know.  The saying \"nothing ventured nothing gained\" has never held more truth, than in the world of guitars and the buying of them. The estimated price could be, just about, any amount you'd be willing to spend.  For your price point...aim for Squiers or Epiphones as they are usually available in copious amounts for right around 20k INR. If you're really adventurous, you can go with an off brand copy, but, that can be a gambling, risky endeavor. If you're very, very adventurous may I suggest... Choice 3... Make your own. Many an enterprising guitarist (myself included) have taken it upon themselves to build their own. There are many ways to do it: You can do it piece by piece buying the parts separately and assembling as you go Buy a kit of the style you want (like these:   with hardware and electronics included...of course) I've built kit guitars (cheap and expensive) and piece by piece (again both cheap and expensive), all with varying amounts of success (from exquisite to fantastically awful) but, always gaining more knowledge of their workings, how to improve them and what will ultimately create the sound I'm forever hunting, which is invaluable for any guitarist. The Pro: You get the guitar you want for LOT less money than you'd normally spend on one and the lessons learned can be applied to later buys or finds regarding quality, \"is it fixable\", etc. The Con: You build it yourself, it takes a LOT of time and the build quality is largely in the hands of an amateur. I enjoyed building the guitars I did, whether you will is something you'd have to ask yourself and be comfortable with failing at. (loads of cursing and humbling defeat await but, the pay off can be a one of a kind guitar that people may envy. You can ask Brian May of Queen about that...  He built his own. The average kit on eBay will run you roughly 13,288.10 INR (or $200) not including the screwdriver, soldering iron, paint (or stain), clear coat and clamps (in some cases).  Oh, and in some error filled cases...a drill. (what a horrific experience that was...but, it turned out amazing afterward) So, to recap: You could buy a new Squier all tags and new guitar smell (not a bad way to go about it) that can be played professionally and become a guitar god. OR Buy a used, second hand guitar and possibly get some better options or even slightly better than entry level build quality(depending of course) and become a guitar god. Or build your own, get a guitar you want for pretty cheap and learn things about them to apply to future guitar related...things (forum discussion, band practice, banter for drunken nights on a dimly lit stage in a dive bar outside of Omaha , etc.) and become a guitar god. All of which hit your price point...more or less. The choice is yours. Just remember that whatever guitar road you take to musical supremacy (to rule over the Indian musical landscape and pop culture now emblazoned with your likeness and whimsy)...toss a thankful nod to the little guy on Quora that pointed you in that general direction, huh?  I hope this helps. ",
            "date": "Updated January 19, 2016",
            "views": "10",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sudipta Tuktuk",
                    "user_href": "/profile/Sudipta-Tuktuk"
                },
                {
                    "user_id": "Naishadh Sutaria",
                    "user_href": "/profile/Naishadh-Sutaria-3"
                },
                {
                    "user_id": "Kshitij Baiga",
                    "user_href": "/profile/Kshitij-Baiga"
                },
                {
                    "user_id": "Shreyansh Swarnakar",
                    "user_href": "/profile/Shreyansh-Swarnakar"
                },
                {
                    "user_id": "Ridham Patoliya",
                    "user_href": "/profile/Ridham-Patoliya"
                },
                {
                    "user_id": "Jigmee Bhutia",
                    "user_href": "/profile/Jigmee-Bhutia-2"
                },
                {
                    "user_id": "Anmol Engandula",
                    "user_href": "/profile/Anmol-Engandula"
                },
                {
                    "user_id": "Chanchrik Bhardwaj",
                    "user_href": "/profile/Chanchrik-Bhardwaj-1"
                },
                {
                    "user_id": "Pranjal Jharkharia",
                    "user_href": "/profile/Pranjal-Jharkharia"
                },
                {
                    "user_id": "Sayantan Mukherjee (সায়ন্তন মুখার্জী)",
                    "user_href": "/profile/सायंतन-मुखर्जी-Sayantan-Mukherjee-সায়ন্তন-মুখার্জী"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Singh",
                "href": "/profile/Vishal-Singh-374"
            },
            "answer_text": "I have pretty much no experience in playing an electrical guitar, but finding me at a similar stage to upgrade from my acoustic to electric guitar, I want to share my experience searching for an appropriate guitar in Delhi.  The one I found most appropriate under the 20k Range is the Cort X6-VPR Black Snakeskin Electric Guitar which was available for 19k in Delhi  Yes it looks gorgeous and the in hand feel is awesome, beside it offers a decent sound in this range. But if you are into more stage performances, cleaning it might be an issue. If you want to consider a slightly over-priced guitar beyond your range Ibanez GRG250DX Electric Guitar will be suitable which is priced at about 28k.  The one that takes the crown is Ibanez RGKP6-WK Guitar with built in Korg Kaoss Pad if you like experimenting with music.  It is priced at 33k and comes with the Kaoss Pad 2. The Kaoss Pad in India costs around 10k, all in all the net price for this guitar becomes 23k with inbuilt space for the Kaoss Pad to fit in. So these are some of the guitar I found suitable. Yes obviously the choice of guitar depends upon your personal preference, the style you play and the one you feel more comfortable with. So sit around with some of them and test your compatibility with it. ",
            "date": "Answered December 25, 2015",
            "views": "41",
            "upvotes": "0"
        }
    ]
}