{
    "title": "What is the most epic guitar solo ever? - Quora",
    "tags": [
        "Guitar Solos",
        "Guitars",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Lentz",
                "href": "/profile/Jeff-Lentz"
            },
            "answer_text": "The opinions below are those of the author and do not necessarily reflect the opinions of this station. For the \"just staggered through the door drunk with the blues\" award - Rolling Stones \"Bitch\".It takes pure genius to be that sloppy and amazing at the same time. The \"blow out your speakers\" award has to go to David Gilmore's solo on Pink Floyd's \"Money\" as well as the \"overdose\" award for the closing solo of \"Comfortably Numb\". On the hypno scale the guitar work on the Beatles \"She's So Heavy\"  takes the \"can't listen to it when I am operating heavy machinery\" award. The \"I just can't believe it's possible\" award goes to Carlos Santana on \"Soul Sacrifice\" and of course Jimi on \"Voodoo Child\". \"Working Man\" by Rush and \"Mean Street\" by Van Halen split the air guitar champion award. If there's a broom around, you'll be playing it. On the technical scale, all 45 minutes of \"La Villa Strangiato\" by Rush is undeniable. The \"Play Some Skynyrd\" award goes to both \"Call Me the Breeze\" by who else, Lynyrd Skynyrd and \"Flirt'n with Disaster\" by Molly Hatchet. In the \"songs-chicks-still-dig-category\" the solo in \"Concrete Jungle\" by Bob Marley and Wailers seems to keep the volume from getting turned down. The \"just plain old ass kicking\" award has to go to both Metallica for \"Whiplash\" and Bad Brains for \"Big Takeover\". I wind up hurting myself every time I listen to either of those songs. Representing the not-so-modern-rock genre. The guitar solo on the Red Hot Chili Pepper's \"Turn It Again\" and \"My Lovely Man\" are guaranteed to touch your heart. Also Jane's Addiction's \"Nothings Shocking\" and \"True Nature\" always have me turning my i-Tunes up. On the all-around amazing scale, I have always thought Jimmy Page's solo on Led Zeppelin's \"In the Evening,\" took the crown and \"Dazed and Confused\" is quite simply in a league of its own. ",
            "date": "Answered June 12, 2012",
            "views": "84",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sydney Gouveia",
                    "user_href": "/profile/Sydney-Gouveia-2"
                },
                {
                    "user_id": "Steven Lachick",
                    "user_href": "/profile/Steven-Lachick"
                },
                {
                    "user_id": "Danny Panettieri",
                    "user_href": "/profile/Danny-Panettieri"
                },
                {
                    "user_id": "James Lee",
                    "user_href": "/profile/James-Lee-2271"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Jeremiah Okakwu",
                    "user_href": "/profile/Jeremiah-Okakwu-1"
                },
                {
                    "user_id": "Will Holroyd",
                    "user_href": "/profile/Will-Holroyd-3"
                },
                {
                    "user_id": "Kaustubh Puranik",
                    "user_href": "/profile/Kaustubh-Puranik-2"
                },
                {
                    "user_id": "Eric Steinmetz",
                    "user_href": "/profile/Eric-Steinmetz-3"
                },
                {
                    "user_id": "Alex Highfield",
                    "user_href": "/profile/Alex-Highfield-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Peterson",
                "href": "/profile/George-Peterson-13"
            },
            "answer_text": "In my humble opinion, all of the solos listed are great, but the only two that really matter are missing. On the morning of August 18, 1969 at approximately 10:45am, the single most important version of the Star Spangled Banner was played by the most explosive rock guitar player in history; Jimi Hendrix. It was an exclamation point to the guitar virtuoso that was created in the 60s. His soaring feedback, harmonics, whammy bar acrobatics and amazing performance has never been duplicated. What Jimi did for the guitar, the style he created and the importance he brought to the instrument have not been seen since. On February 10, 1978, a classic rock album was released in the midst of disco. When the needle hit the vinyl and the car horns began to blare, you just knew it was different. It was the second track on side 1, 1:41 of adrenaline, slurred triplets, open string madness, the most recognizable tapping passage ever recorded and a never ending dive bomb at the end, that announced to the world the arrival of Edward Van Halen. What made this track amazing was he played it all on a guitar he built, thru a modified Marshall plexi with a tone that was utterly amazing. Sprinkle in an MXR Phase 90 foot pedal and you have the tone now known as the \"brown sound\". There are entire forums dedicated to modifying your amp to get this tone. If you were a guitar player when you heard Eruption for the first time, it was absolutely terrifying. It couldn't be real, it must be studio magic, he couldn't be playing that. But, guess what? He did play it, in one take, no overdubs and no studio magic, other than pushing the record button on the tape machine. (1) Jimi Hendrix - The Star Spangled Banner (2) Edward Van Halen - Eruption. These are the two most important solos in the history of rock guitar. Without them, Hendix doesn't influence players of the 70s and beyond such as Jimmy Page, David Gilmore, Joe Perry, etc, and Van Halen doesn't influence players in the 80s and beyond such as Satriani, Slash, Vai, etc. Both Jimi and Ed continue to influence everyone today. Because I can somewhat play, I feel maybe a little qualified to give this opinion.   ",
            "date": "Updated October 5, 2017",
            "views": "278",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sydney Gouveia",
                    "user_href": "/profile/Sydney-Gouveia-2"
                },
                {
                    "user_id": "John Mutler",
                    "user_href": "/profile/John-Mutler"
                },
                {
                    "user_id": "Jacob Thomas Potts",
                    "user_href": "/profile/Jacob-Thomas-Potts"
                },
                {
                    "user_id": "Cars Ten",
                    "user_href": "/profile/Cars-Ten-3"
                },
                {
                    "user_id": "Craig Rosa",
                    "user_href": "/profile/Craig-Rosa-1"
                },
                {
                    "user_id": "Michael Criswell",
                    "user_href": "/profile/Michael-Criswell-7"
                },
                {
                    "user_id": "Cameron Floyd",
                    "user_href": "/profile/Cameron-Floyd-3"
                },
                {
                    "user_id": "Jeshua Posey",
                    "user_href": "/profile/Jeshua-Posey"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                },
                {
                    "user_id": "Shane Traveller",
                    "user_href": "/profile/Shane-Traveller"
                }
            ]
        }
    ]
}