{
    "title": "What bands still record live in the studio? - Quora",
    "tags": [
        "Music Production",
        "Bands (music)",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Judson Gordon",
                "href": "/profile/David-Judson-Gordon"
            },
            "answer_text": "Recording live in the studio is still done - but the technical disadvantages tend to outweigh the advantages. And, to be blunt, there aren't a lot of bands that can pull off an album-quality recording in one take (eg: How did your favorite band sound when they played live on this or that TV show. Unless they are one of those bands that prefer fairly spare arrangements and are VERY polished, probably a bit disappointing.) One band that did a great job recording live and in one take was the Joe Jackson Band - the album was Big World, it was recorded in front of a small group of invitees, and it was masterfully performed and mixed. A friend of mine's production company was hired to film the session as well... if I remember correctly they used film rather than videotape (not the norm in the early 90s), and the resultant video is pretty impressive as well. More recent live Jackson performances, although in more traditional venues and with much larger audiences, stand up very well against his studio work. Joe's standards are very high and he always has a great ensemble and crew. ",
            "date": "Answered May 30, 2015",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Bryan",
                    "user_href": "/profile/Bruce-Bryan-9"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Willem Joseph",
                    "user_href": "/profile/Willem-Joseph"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Seith",
                "href": "/profile/Ed-Seith"
            },
            "answer_text": "Some of it started with the Beatles, and even earlier, but it didn't get really serious until probably the mid-70s and later, as multi-track recording studios kept getting more and more complex, and the desire for cleaner recordings increased.  I'm not aware of ANY modern bands that record FULLY live - all instruments, melodies, and vocals, but there are some, especially more old-school bands, that record their rhythm tracks live. Iron Maiden springs to mind. The drums are in one room, and each instrumentalist has an isolation room or chamber for their amp cabinet. They record drums, bass, and rhythm guitars at once, and then overdub lead, acoustic and some harmony guitars, and the vocals. They usually use a \"scratch\" vocal recorded as part of the live recording, so no one loses their place. Later, they may overdub any small mistakes, add fills and leads, and record the final vocals. ",
            "date": "Answered May 27, 2015",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Bryan",
                    "user_href": "/profile/Bruce-Bryan-9"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Jim Ghivizzani",
                    "user_href": "/profile/Jim-Ghivizzani"
                }
            ]
        }
    ]
}