{
    "title": "What is the easiest karaoke song to sing (if you can't sing)? - Quora",
    "tags": [
        "Karaoke",
        "Singing",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Smith",
                "href": "/profile/Karen-Smith-139"
            },
            "answer_text": "Good Question! I'll give some tips for choosing a song and then list a few songs I think would be good for men and women.  1) know your register. are you more comfortable singing high, or low? for example,when you sing \"happy birthday,\" do you naturally start higher or lower than everyone else? Pick a song by a singer who sings lower (like Adele) or one who sings higher (like Freddy Mercury) 2) pick a song you are familiar with, and like. if you can't carry a tune what will save you is your enthusiasm and bravery! there are plenty of professional musicians who have mediocre voices, but we remember them for their energetic or creative performances. the point is that the crowd has fun. 3) no Beyonce. no Christina. 4) don't be fancy. chances are you won't have the option of singing any Neutral Milk Hotel, but if you do, don't. people don't know that shiz. Here are some songs which i think are melodically simple, easily recognizable, and use a comfortable vocal range. check them out! Rock:-\"All These Things That I've Done\"-- The Killers-\"Start Me Up\" --The Rolling Stones-\"Gold on the Ceiling\" The Black Keys-\"Renegades\" -The X Ambassadors-\"Walkin' on the Sun\"-Smash Mouth-\"Mother and Child Reunion\" -Paul Simon-\"Cherry Bomb\" John Mellencamp-\"Born in the USA\"-Bruce Springsteen-\"The Beat Goes On\" -Sonny and Cher Pop:-\"Classic Man\" --Jidenna-\"Good for You\" --Selena Gomez-\"That Girl\" Justin Timberlake-\"Body Language\"-Jesse McCartney-\"Closer\" Tegan and Sara-\"Last Friday Night\"-Katy Perry-\"A Family Affair\"-Mary J. Blige-\"Electric Feel\"--MGMT- Country/Blues/Other:-\"Amie\"--Pure Prairie League-\"Wagon Wheel\" Darius Rucker-\"I Need A Dollar\" Aloe Blacc-\"Dibs\" Kelsea Ballerini-\"Boondocks\" Little Big Town Break a leg guys!-Karen ",
            "date": "Answered November 22, 2015",
            "views": "85",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "Christiana Celestine",
                    "user_href": "/profile/Christiana-Celestine"
                },
                {
                    "user_id": "Cansu Cey",
                    "user_href": "/profile/Cansu-Cey"
                },
                {
                    "user_id": "Christine Leigh Langtree",
                    "user_href": "/profile/Christine-Leigh-Langtree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donnie Fontaine",
                "href": "/profile/Donnie-Fontaine"
            },
            "answer_text": "First, try to pick something that will make people sing along. The more help you can get, the better you sound. Friends In Low Places by Garth Brooks is GREAT for that. Doesn't require a ton of range, and everyone knows/loves it. Even people who have never before heard Why Don't We Get Drunk by Jimmy Buffett will be singing along by the 2nd chorus. Especially if they've had a few. Country, in general, always seemed less demanding to me. There are quite a few songs with fun/clever lyrics and the vocal range is usually not very taxing. Just throw on your best good ol' boy Texas drawl and yeehaw up to the mic. Rap is another genre where no one is really going to judge your singing because, hey- there wasn't any singing in the original. Check out Because I Got High by Afroman. Funny song, easy rap, crowd-pleasing sing-along. In the end, it really comes down to what you're familiar with. The better you know it and the more times you've belted it out in the shower or in the car on the way to work, the easier it is to sing. Unless it's in a bad key for you and/or has upper and/or lower parts that you can't reach. Last but not least, remember that this is all for fun. Nobody is going home with a trophy for sounding like Sinatra — and nobody is getting thrown out of the joint for singing like a cat in heat. Don't expect to be the best but also know that you're not the worst. (Notice all the people who didn't even get up to do a single song?) One last major tip - try to be as relaxed as possible when you step up to sing. Get there by any means necessary but if you're nervous it messes with your breathing — and breathing is everything when singing. Remind yourself that half the people there won't have the guts to get up and sing. You're already better than them. And the best guy/girl in the place… they're not exactly on tour with some band, right? You haven't seen them recently (EVER?) on American Idol or The Voice, right? ",
            "date": "Answered April 18, 2018",
            "views": "54",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "Iffy",
                    "user_href": "/profile/Iffy-3"
                },
                {
                    "user_id": "Phanindra Purighalla",
                    "user_href": "/profile/Phanindra-Purighalla"
                },
                {
                    "user_id": "Rhonda West",
                    "user_href": "/profile/Rhonda-West-4"
                }
            ]
        }
    ]
}