{
    "title": "What are the main differences between classical voice and jazz voice? - Quora",
    "tags": [
        "Vocal Performance",
        "Jazz Music",
        "Passive Voice",
        "Singing Voice",
        "Classical Music",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Freeman",
                "href": "/profile/Patrick-Freeman-58"
            },
            "answer_text": "A lot. Classical is a very structured medium. There are specific “rules”, for lack of a better term, and accepted practices. A classical singer is expected to be schooled, not just through formal education, usually a masters degree or higher, but also privately trained. It’s a specific style of singing that accepts little or no variation in tone quality, volume, breath control, even down to physical posture. This is not a medium in which there is no right or wrong way to do it. Each and every note must be sung precisely at the correct pitch, the precise duration, with the exact tonality and and volume. Each and every syllable must be pronounced correctly. Even if you don’t speak the language in which the song is written you’re expected to sound as if you do. Jazz singing, on the other hand, is much more fluid, more forgiving, more experimental and less rigid. The first rule of jazz is that you have to learn the rules before you can break them. But you are not only allowed to break the rules but you are expected to. Many, if not most, great jazz singers have been classically trained and can sing in that medium if need be. The reverse is not necessarily true. Jazz is a constantly evolving medium as it adapts to changes and variations that are introduced by new artists from time to time. The jazz singer is free to take liberties with the notes with respect to their duration, their tonality, even, to some degree, the pitch. ",
            "date": "Answered August 24, 2019",
            "views": "300",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nicolas Rabelo",
                    "user_href": "/profile/Nicolas-Rabelo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Jaffe",
                "href": "/profile/Kenneth-Jaffe-1"
            },
            "answer_text": "Classical singing often requires the highest level of physiological prowess, and frequently exploits the extreme ranges of the voice, as well as great physical stamina, all within a fairly limited stylistic framework known as the \"vocal formant\", a specific sound signature particular to classical singing. Finally, one is expected to be faithful to the intention of the composer's musical intentions. Within these clear limitations one's excellence (vocal strength, individual vocal quality, musicianship and artistry) is judged. Jazz singing allows for a much greater freedom - both in terms of individual sound and interpretation of the pieces of music. Adhering too close to a specific standard would be seen as merely aping someone's style, and would be seen more similar to being part of a tribute band than a true artist. Also, being a part of the musical creation and re-creation is a definite requirement as a jazz singer. Your covers of songs need to express a truly individual perspective. Finally, great vocal prowess from a sheer athletic standpoint is not necessarily a requirement, unless you are going to specialize in scat singing! ",
            "date": "Answered April 27, 2016",
            "views": "18",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Morris Nelms",
                    "user_href": "/profile/Morris-Nelms-1"
                },
                {
                    "user_id": "Andi Alexander",
                    "user_href": "/profile/Andi-Alexander"
                },
                {
                    "user_id": "Kitty Gibby",
                    "user_href": "/profile/Kitty-Gibby"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                }
            ]
        }
    ]
}