{
    "title": "What is your best Bengali romantic movie? - Quora",
    "tags": [
        "Romantic Comedy Movies",
        "Bengali Cinema",
        "Romantic Movies",
        "Bengali (language)",
        "Bengali Ethnicity and People",
        "Romance (love)",
        "Movie Recommendations",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dola Ray",
                "href": "/profile/Dola-Ray"
            },
            "answer_text": "Oh Bengalis and their romance. Can't say about the current generation, but our generation, which grew up with Neellohit and Neera, it is difficult to select one single romantic movie. Still, some definite candidates will be (in random order): Basanta Bilap - Soumitra-AparnaTin Bhuboner Pare - Soumitra-TanujaBalika Bodhu - Partha-MousumiHarano Sur - Uttam-SuchitraChaoya Paoya - Uttam-SuchitraI am sure I am forgetting some gems though. But to me (snd surely to many more) the best romantic movie will be the cult love story Saptapadi - Uttam-Suchitra.  The sublime Suchitra Sen as Reena Brown and all time best romantic Bengali hero Uttam Kumar as charming Krishnendu is forever etched un Bengali mind. Who can forget Suchitra's crisp retort “o amake touch korbe na” or the iconic song “ei poth jodi na sesh hoy”. The chemistry between the two was electric. Their hate and love, their joy and despair, their “milna-bichharna” have swayed all including me. This movie (also many other old movies) proves that a beautiful love story can be romantic and endearing even with really bad makeup, painted props and lack of technology. The true love story takes you beyond these nitty-gritty and all you care about is whether the two loving souls lived happily ever after.  Saptapadi (1961 film) - Wikipedia ",
            "date": "Answered November 25, 2019",
            "views": "743",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sum Ry",
                    "user_href": "/profile/Sum-Ry"
                },
                {
                    "user_id": "Arnab Das",
                    "user_href": "/profile/Arnab-Das-438"
                },
                {
                    "user_id": "Atmaja Bandyopadhyay",
                    "user_href": "/profile/Atmaja-Bandyopadhyay"
                },
                {
                    "user_id": "Surya Kiran Tiruvuri(సూర్య కిరన్ తిరువూరి)",
                    "user_href": "/profile/Surya-Kiran-Tiruvuri-సూర్య-కిరన్-తిరువూరి"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siddhartha Sarkar ( সিদ্ধার্থ সরকার )",
                "href": "/profile/Siddhartha-Sarkar-সিদ্ধার্থ-সরকার"
            },
            "answer_text": "The MOST romantic Bengali movie will always be the Uttam-Suchitra starrer SAPTAPADI. No other movie has ever come close. I like the following too : The Soumitra-Aparna Sen starrer SAMAPTI, which is a part of Satyajit Ray’s TEEN KANYAThe Soumitra-Aparna Sen starrer BAKSHO BODOL, which was also a Satyajit Ray scripted movie.",
            "date": "Answered November 25, 2019",
            "views": "296",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Arnab Das",
                    "user_href": "/profile/Arnab-Das-438"
                }
            ]
        }
    ]
}