{
    "title": "What's the scariest theory about death you've ever heard? - Quora",
    "tags": [
        "Scariest",
        "Theory and Theories",
        "Fear",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julián Vásquez",
                "href": "/profile/Julián-Vásquez-1"
            },
            "answer_text": "The thought of reincarnation is a sad and depressing one. Because it means you’re going to be living a lot of life times filled with suffering. Imagine living as a cow in a slaughter house or a peasant in the 1300s. The chance of living a good, 1% life where you’re the heir of a billion dollar inheritance is statistically low and you’re statistically more likely to live an unhappy life, just think of all the billions of unhappy, suffering people and animals that have lived throughout history. Reincarnation is hands down one of the most depressing afterlife theories out there. People praise it and feel happy at the thought of reincarnation without realizing that the whole point of the religions that push the idea of reincarnation is to permanently escape it so that it can never happen again. People say that suffering can be a good thing because it develops your identity and gives a purpose and meaning to life and I agree. There’s so many stories of people out there who go through hard times and think it will never end but they come out better people. But those are the select few happy stories. For every one of those stories, there’s a story where the suffering is completely mindless and pointless and in vain. What’s the point of getting cancer and fighting it to the last breath only to wind up dead? What’s the point of a cow getting slaughtered in a slaughter house? What’s the point of living a life with extreme chronic pain where your only chance of escape is suicide? What’s the point of a slave working their whole life and dying from an accident? What’s the point of someone getting tortured for a long time and then killed? I shudder at the thought of reincarnation. It is a special type of hell. ",
            "date": "Answered October 19, 2018",
            "views": "393",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebecka Elizabeth",
                    "user_href": "/profile/Rebecka-Elizabeth"
                },
                {
                    "user_id": "Avanindra Jha",
                    "user_href": "/profile/Avanindra-Jha"
                },
                {
                    "user_id": "David Kariu",
                    "user_href": "/profile/David-Kariu"
                },
                {
                    "user_id": "Vicki Pickering",
                    "user_href": "/profile/Vicki-Pickering"
                },
                {
                    "user_id": "Jere Renlund",
                    "user_href": "/profile/Jere-Renlund"
                },
                {
                    "user_id": "James Stabler",
                    "user_href": "/profile/James-Stabler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francis O'Neill",
                "href": "/profile/Francis-ONeill-4"
            },
            "answer_text": "Probably the one presented by our orthodox religions that believe in heaven and hell. In my view these are both states of mind. Unlike the rigid view that they are for keepers - i.e. you go to state of heaven forever or go to the state of hell forever - I see them as states in transition. We are, as I see it, all on our respective journeys to Love and consciousnsess, to become a part of the bigger whole, like a drop of water is to the ocean. No soul can be left behind in a state of hell, and heaven has to be earned repeatedly. I would suggest that our religions have a lot to answer for with regards to our fear of death. Most of it has been erected for, and driven by, political gain rather than a sincere search for, or understanding of, the truth. I would further suggest that over the centuries this “fear” has probably left a lot of souls in limbo, hanging around the physical Earth, too scared to move on.  I've written a book, Life and Death: Making Sense of It, dealing with this matter. If interested, you can get it off this Amazon link in paperback or eBook. ",
            "date": "Answered October 23, 2018",
            "views": "137",
            "upvotes": " Answer requested by Christopher Abbey"
        }
    ]
}