{
    "title": "What is the difference between New Eminem and old Eminem ? - Quora",
    "tags": [
        "Eminem (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhavin Shah",
                "href": "/profile/Bhavin-Shah-283"
            },
            "answer_text": "Eminem’s albums reflect his growth as a human. Earlier his songs were about drugs and girls. I'm talking about songs like Hello, Ass Like That, Must Be The Ganja.To be honest, there were even songs like FACK & Insane (if you've heard them you know what i mean)Some songs like Kim, Stan, When I'm Gone etc reflected his personal life issues and it was the slow transition from old Eminem to new Eminem.Then came Not Afraid, Going Through Changes. He talks at a level where people going through tough times in life can relate. His songs try and help people who have no where else to go to.During the transition he made songs like Sing For The Moment which is one of my favorites! ",
            "date": "Answered February 3, 2017",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratik Rai",
                    "user_href": "/profile/Pratik-Rai-16"
                },
                {
                    "user_id": "Ilayda Bilgesoy",
                    "user_href": "/profile/Ilayda-Bilgesoy"
                },
                {
                    "user_id": "Kaitlyn Karcher",
                    "user_href": "/profile/Kaitlyn-Karcher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siddharth Vinze",
                "href": "/profile/Siddharth-Vinze"
            },
            "answer_text": "Are you kidding me? How the hell can you not like his rap in No Favours. Both, Big Sean and Eminem killed it! “I'm basically 30, amazingly sturdy, zany and wordyBrainy and nerdy, blatantly dirtyInsanely perverted, rapey and scurvy” Eminem describes his personality in a few words, all of which correlate with the moments that have happened throughout his career as a rapper. How can you not find the rhyme amusing? Are you even human? Well, and the difference between new and old Eminem? He himself stated in an interview in 2010 that he never imagined in his entire career, that he’d make a song like “Not Afraid”. People change, circumstances change! ",
            "date": "Answered February 5, 2017",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kaitlyn Karcher",
                    "user_href": "/profile/Kaitlyn-Karcher"
                }
            ]
        }
    ]
}