{
    "title": "What made 'The Doors' such a good band? - Quora",
    "tags": [
        "The Doors (band)",
        "Jim Morrison (musician)",
        "Classic Rock Music",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Camden Rafftery",
                "href": "/profile/Camden-Rafftery"
            },
            "answer_text": "You tell me, sorry if that came off a bit rude, but seriously, think of all the things they did that were super rebellious/savage/funny/cool: The best is the first At a performance on The Ed Sullivan Show, they were told for Light My Fire at that line “Girl we can’t get much higher” sounded inappropriate so they had to say ‘Girl we can’t get much BETTER’ Jim said alright, once the guy left them to prepare for the show Jim said “F*ck that Bullsh*t, That was the line that took me almost an entire day to think up” as you guessed it, Jim Morrison sang “If I was to say to you, Girl we can’t get much higher” it was national tv so the guys got pissed at The Doors.The reason Elektra wanted The Doors is when at a concert Jim was making out with a woman (that was not Pam, oh no) then, some officer that hated Jim came in when Jim started to smart mouth at the officer, he maced Jim in the eyes, and so during Break On Through (To The Other Side) at the organ solo, Jim started telling that story to the audience, officers got pissed, told Jim while on stage to leave, they then had to mace all of The Doors, audience members started running up to the stage to save Jim, people were maced, and the officers threw all of The Doors out, destroyed John’s kit, kept Robby’s guitar, and smashed Ray’s Keyboard, Jim. Was. PISSED. The managers of Elektra laughed their arses off, because of how funny of a scene it was from in the audience and took The Doors along. Altogether The Doors ended up getting most of those officers that participated in a write-up. Jim personally got eye-macer fired.All of their stuff sounded really original, especially L.A. Woman, the song, It starts with a creepy riff, going into a more bright sound, otherwise, take Riders On The Storm, that one is my favorite, it has the most calming mood while being rock music, it was the best and last of Jim Morrison’s work before “Paris occurred”On Thanksgiving 1969, Jim cooked Pam’s pet chicken as the turkey, Ray Manzarek asked Jim “Dude, where’d you get a turkey this late on thanksgiving?”, Jim simply stated, “I Didn’t Get a TURKEY.” Ray knew right away what the “turkey” was. When Pam found out about her pet chicken, she pulled a GOD DAMN KNIFE ON JIM!!! Things quickly escalated up until Jim told her “Fine if you wanna stab, then stab me!” She didn't go through with the threat, that really impressed Ray Manerak, John Densmore, and Robby Krieger.Before Vinyl reissues, Doors albums in a somewhat good condition go for +$200At “Whiskey A-Go-Go”, 1967, The Doors were playing The End, things were going great up until Morrison said the line “Mother, I Want To…F*CK YOU!” (originally “Mother, I Want To…”) and he kept going on, “I’m gonna F*ck you, and f*ck you, and f*ck you, oh, mother, will I wanna f*ck you forever”, let's just sum up the events that went down after the show and say…FIRED.If you still don’t know what makes The Doors awesome, Waiting For The Sun, or Riders On The Storm are the basic description of The Doors and what makes them awesome, just take a listen for yourself.  ",
            "date": "Updated October 28, 2020",
            "views": "76",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Toby Callaway",
                    "user_href": "/profile/Toby-Callaway"
                },
                {
                    "user_id": "Igor Zbitnoff",
                    "user_href": "/profile/Igor-Zbitnoff-1"
                },
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "William DeVore",
                    "user_href": "/profile/William-DeVore-1"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                },
                {
                    "user_id": "Kristjan Arnason",
                    "user_href": "/profile/Kristjan-Arnason"
                },
                {
                    "user_id": "Christopher Stanton",
                    "user_href": "/profile/Christopher-Stanton-7"
                },
                {
                    "user_id": "Richard Creaner",
                    "user_href": "/profile/Richard-Creaner"
                },
                {
                    "user_id": "Art Manikas",
                    "user_href": "/profile/Art-Manikas"
                },
                {
                    "user_id": "Coen Heydenrych",
                    "user_href": "/profile/Coen-Heydenrych"
                },
                {
                    "user_id": "Debra Oz",
                    "user_href": "/profile/Debra-Oz"
                },
                {
                    "user_id": "Larry Sellers",
                    "user_href": "/profile/Larry-Sellers-6"
                },
                {
                    "user_id": "Rick Adams",
                    "user_href": "/profile/Rick-Adams-111"
                },
                {
                    "user_id": "Randall McGrew",
                    "user_href": "/profile/Randall-McGrew-3"
                },
                {
                    "user_id": "Paul Blumentritt",
                    "user_href": "/profile/Paul-Blumentritt"
                },
                {
                    "user_id": "Allen Thompson",
                    "user_href": "/profile/Allen-Thompson-3"
                },
                {
                    "user_id": "Terry Johnson",
                    "user_href": "/profile/Terry-Johnson-434"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                },
                {
                    "user_id": "Miles Kessler",
                    "user_href": "/profile/Miles-Kessler"
                },
                {
                    "user_id": "Robert Pulciani",
                    "user_href": "/profile/Robert-Pulciani"
                },
                {
                    "user_id": "David Bell",
                    "user_href": "/profile/David-Bell-879"
                },
                {
                    "user_id": "Ed Tywoniak",
                    "user_href": "/profile/Ed-Tywoniak"
                },
                {
                    "user_id": "Todd Lynwood",
                    "user_href": "/profile/Todd-Lynwood"
                },
                {
                    "user_id": "Joe Fazio",
                    "user_href": "/profile/Joe-Fazio-7"
                },
                {
                    "user_id": "Mark Taylor",
                    "user_href": "/profile/Mark-Taylor-493"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thom Harmand",
                "href": "/profile/Thom-Harmand"
            },
            "answer_text": "I think it was their sound. No one had ever heard a sound like Ray Manzarek’s organ coupled with his left hand playing bass on a Fender keyboard. He even sang all the vocals for shows Jim Morrison missed due to his alcohol problem ( very sad). Each musician had a very unique way of approaching a song; Manzarek was a great player, very underrated. He set the mood of most of the songs with his playing. The guitarist, Robbie Kreiger ( who wrote “Light My Fire” at the tender age of 19) played with his fingers, and had studied classical and flamenco guitar; he brought that style and sound to the band. And John Densmore, one of my favorite percussionists (don’t call him a drummer!) adding drama and great syncopation and fire to the band’s sound. Jim, of course was Jim, certainly a unique and individualistic guy. He was brilliant in his knowledge of literature. It was said he collected books and was able to recite from them on the spot. His poetry, while sometimes shocking could also be very sensitive. Great band! I wan t to add that it crossed my mind while writing this answer that there were so many bands of the mid- late sixties that formed in a serendipitous way, that fell together by fate, The Beatles, The Who, Led Zeppelin, The Doors, The Byrds, The Buffalo Springfield ( look up their formation - mind blowing karma!) all formed in such a way that fate intervened. OK, enough from this old guy. ",
            "date": "Answered June 3, 2020",
            "views": "312",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "TowserNYC",
                    "user_href": "/profile/TowserNYC"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Burton",
                "href": "/profile/Robert-Burton-9"
            },
            "answer_text": "A very close friend of mine loves The Doors, has been to Morrison's grave in Paris and introduced me to them. I even got us tickets to see a tribute act last November. Yes I know about Riders on the Storm being about Jim believing a soul of a native American who died on route 66, as he passed in the car as a child became a part of him. Love street being where his girlfriend lived and he climbed a tree and sang to her. The End being about his knowledge that he was somehow going to die soon. Etc. My friend tells me the Doors are based on the Doors of perception. Jim Morrison was a poet who looked beyond everyday life and normality, and he described it in the best way. I was asked by my friend as we sat one evening to look around his living room and tell him what I saw. Now I had a few drinks, but was able to point out the TV, the coffee table, the bookshelves, the couch etc. I pointed at every object. Once finished my friend told me I missed something, and recalled the list including the couch, the TV, the bookshelves and all that. He pointed to the door that entered the hallway, it was halfway open and the darkness peered in. 'Don’t you remember me closing that door when I came in?’ now I know my friends place is haunted, and truth be told it wobbled my head a little bit. I hadn't left the room and neither had he, and the previous occupant passed away in the hallway. I know, I always feel stares. 'That, is what The Doors were about, open the Doors of perception.' ",
            "date": "Answered May 31, 2020",
            "views": "296",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Lyle Hamer",
                    "user_href": "/profile/Lyle-Hamer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "As with other successful bands, the chemistry between band members plays a central role, how the musicians would complement each other to result in a particular sound that has wide appeal. Then, the times; it was the mid 60’s and we were looking for bands with sounds that reflected our mood and the Doors were exceptionally good at that. They were individually talented, good musicians / songwriters, had a unique sound consisting of their individualistic musical styles that meshed like a set of gears in a watch. And the special-ness of the times; it is inconceivable to think about those times without including the Doors. ",
            "date": "Updated September 14, 2020",
            "views": "249",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karen Krutzsch",
                    "user_href": "/profile/Karen-Krutzsch"
                },
                {
                    "user_id": "Chaz Star",
                    "user_href": "/profile/Chaz-Star"
                },
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Dewey Smith",
                    "user_href": "/profile/Dewey-Smith-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominic Perico",
                "href": "/profile/Dominic-Perico-1"
            },
            "answer_text": "I think it was that crazy key-board sound that kind of sounded like “The Munsters” theme song. I think people smoked a lot of pot, watched “The Munsters,” went out to the Hollywood Bowl, dropped a few hits of acid, had a quick orgy in the weeds behind the concession stands, Sally (who turned out to be Sam in drag) poked my cookie, we all grabbed a few beers and overdosed on chili-dogs, then listened to the Door’s last set, with “Come on Baby Light My Fire.” I mean, I don’t know man, I wasn’t there - but if I was that is how I would have remembered it. ",
            "date": "Answered June 6, 2020",
            "views": "213",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Allen Thompson",
                    "user_href": "/profile/Allen-Thompson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryant Stokes",
                "href": "/profile/Bryant-Stokes"
            },
            "answer_text": "Style. The Doors were VERY unique. They sounded like no one else. A more modern equivalent may be The Red Hot Chili Peppers. It was far from just Morrison as well. The other members of the band made their mark equally. You knew a song from The Doors after just a few notes, well before Jim chimed in. ",
            "date": "Answered June 4, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Phil Torkington",
                    "user_href": "/profile/Phil-Torkington"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Mcpherson",
                "href": "/profile/Brian-Mcpherson-34"
            },
            "answer_text": "Excellent musicians awesome frontman and the right songs for the historical events that occurred in the late 1960s plus they were really good live lots of jamming they were not dependent on hit singles an album orientated band not afraid to experiment and move forward not back. ",
            "date": "Answered May 31, 2020",
            "views": "144",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Wilms",
                "href": "/profile/Michel-Wilms"
            },
            "answer_text": "The whole picture. The dark vibes, the theatral aspect, the lyrics and the musicianship. They were really something. Build around Jimbo of course and he was lucky with such good musicians behind him. It were a couple of magic years. ",
            "date": "Answered May 31, 2020",
            "views": "121",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Fox",
                "href": "/profile/Richard-Fox-24"
            },
            "answer_text": "They ad a flemenco guitarist a jazz drummer a classically trained keybordist who also supplied the bass parts and an extremely charismatic poet/singer. That combination made magic on stage and in the studio ",
            "date": "Answered June 5, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                }
            ]
        }
    ]
}