{
    "title": "What are the essential differences between baroque and renaissance art? - Quora",
    "tags": [
        "Baroque Art",
        "Baroque",
        "The Renaissance"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-56"
            },
            "answer_text": "I find the most compelling way to answer that question is based on Wylie Sypher’s Four Stages Of Renaissance Style—Renaissance, Mannerism, Baroque, and Late-Baroque. Baroque is a Renaissance style. Sypher’s argument (which includes painting, sculpture, architecture, and literature—it’s a fascinating book, and well worth reading) is that each phase solved a series of problems with its predecessor. The first phase, early or classical Renaissance, solved the problem of naturalism within the pictoral frame in Gothic art. In Gothic art, the rules of perspective are thematic rather than naturalistic, and multiple events can occur within a single pictoral frame, as in this illustration from the Tres Riches Heures, painted by the Limbourgs:  From left to right, the Serpent tempts Eve, Even tempts Adam, God reprimands then, and Adam and Eve are expelled at the right, by an angel, probably a cherub (four wings instead of six which would indicate of seraph) who is depicted as burning—not just with a fiery sword. Compare this with an example of an early Renaissance painting with vanishing point perspective illustrating a single dramatic moment, Masaccio’s Expulsion From Paradise, part of the same subject:  It is in vanishing point perspective, and is intensely dramatic. Mannerism, the next phrase, introduces expressive distortion into the tight geometric confines of the classical Renaissance image. Perfect examples are Tintoretto’s The Finding Of St. Mark and The Translation Of St. Mark (favorites of mine):   The two paintings commemorate the finding of the body of St. Mark in Alexandria by two Venetian merchants in 828 (the saint on the far left identified his body and tells the other figures to stop looking) and its removal, protected by the saint. (The story is a fascinating one: see Saint Mark, Patron Saint of Venice.) The point of both of these painting is dramatic exaggeration. The perspective is exaggerated; the bodies contorted; the figures in the second painting appear to be like wraiths fleeing into the arcade on the left margin of the painting. This dramatic exaggeration, however, creates problems of its own. If the classic Renaissance space is too serene and calm, the Mannerist space is too extreme. Baroque art (you knew I’d get there, right?) returns to a highly disciplined pictoral space, but of enormous dimensions. Sypher describes the stype as “dense masses of material, redundant statements, kinetic energy, an elevated center of gravity, a broadening and consolidation of the foreground plane, a monumental academic balance, and flashing color and light.” An example? Titian’s The Fall Of Phaeton, 1604:  Or The Triumph Of San’ Ignatio, Andrea Pozzo, 1691-94, Gesu church, Rome:  It is an illusionistic space, like that of the classical Renaissance, but with a swirling energy and sense of enormous expanse replacing the highly controlled space of the classical Renaissance painting. Here is an interesting contrast: a painting by Perugino, The Delivery Of The Keys To St. Peter, in the Sistine Chapel, Rome, 1481–1482:  Crowded with figures, but symmetrical and balanced; spacious but controlled. Baroque style evolves from the classical Renaissance style. Hope this helps. ",
            "date": "Answered April 13, 2018",
            "views": "119",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Asimina Giannikaki",
                    "user_href": "/profile/Asimina-Giannikaki-1"
                },
                {
                    "user_id": "Pilar Avellanal",
                    "user_href": "/profile/Pilar-Avellanal"
                },
                {
                    "user_id": "John Waters",
                    "user_href": "/profile/John-Waters-168"
                },
                {
                    "user_id": "Shicnusz Anand",
                    "user_href": "/profile/Shicnusz-Anand"
                },
                {
                    "user_id": "Keith Bollmer",
                    "user_href": "/profile/Keith-Bollmer"
                },
                {
                    "user_id": "Ada Gabriel",
                    "user_href": "/profile/Ada-Gabriel"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Levi Faulkner",
                    "user_href": "/profile/Levi-Faulkner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosana Campos",
                "href": "/profile/Rosana-Campos"
            },
            "answer_text": "In my opinion, the philosophical principles behind them account for the major difference. Take a painting by Raphael Sanzio, for example, you will notice a composition that prioritizes vertical and horizontal lines. All the elements in the painting combine so that your eyes go from one element to the other, in a circular movement. All the figures seem static, still, calm and collected. This type of composition betrays a world view that the universe is in harmony. Everything looks harmoniously in perfect interaction. The idea behind it is that the universe is perfect. The principles of order and harmony dominate classical art. This is when man starts to believe that the universe is ruled by laws that can be scientifically proved, and that man will uncover those rules. There’s a sense of control, nothing seems spontaneous or wild, conveying the idea that man is capable of understanding how the universe works, and that with this kind of knowledge he will be able to control it. When you observe a baroque painting, you notice that diagonal lines dominate the composition. Everything seems quite chaotic. There’s a sense of disorder, there’s movement. The figures in them appear in quite uncomfortable positions, seen in perspective, bringing about a sense of unease and anarchy. Even the drapery is affected by these principles. After humanism, man felt lonely. If there’s no divine intervention, but laws that control the events in the universe, a sense of abandonment takes over. The principle behind it is, therefore, that of entropy, i.e that the universe tends to chaos, other than to harmony. Harmony requires a great effort. Left alone, things tend to be chaotic, bringing about a feeling of insecurity to man, who knows all too well, that no matter how much he studies and knows about the universe, he will never be able to fully understand and control things. Renaissance / Rönesans Stock Photo - Perseus and Andromeda by Titian, 1473, Wallace Collection, London, United Kingdom ",
            "date": "Answered April 7, 2018",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sodipto Saha Ridoy",
                    "user_href": "/profile/Sodipto-Saha-Ridoy"
                },
                {
                    "user_id": "Hugh Mosher",
                    "user_href": "/profile/Hugh-Mosher"
                },
                {
                    "user_id": "Prem Kumar",
                    "user_href": "/profile/Prem-Kumar-427"
                }
            ]
        }
    ]
}