{
    "title": "What are some rock bands with female lead singers? - Quora",
    "tags": [
        "Rock Band Recommendations",
        "Rock Bands",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Toennies",
                "href": "/profile/Craig-Toennies"
            },
            "answer_text": "Check out Company of Thieves, a rock band out of Chicago. They just released their Sophomore album, Running From A Gamble, Tuesday, May 17, 2011 - and I expect big things from them. You can hear that album in its entirety on AOL's Spinner here: http://music.aol.com/new-releases-full-cds/spinner#/12 If you like it - you can get that new album free at any FYE store using a coupon found on the band's website:  http://www.companyofthieves.net/.  Here is their Wikipedia entry: http://en.wikipedia.org/wiki/Company_of_Thieves_(band) Lead singer Genevieve Schatz sounds a lot like Björk in her Sugar Cubes incarnation (there's even something Icelandic about Schatz's pronunciations, even though I think she is a native Chicagoan) - but the music behind her isn't the esoteric, European techno blend that dominated Björk's later work  - it's sometimes foot-tapping, sometimes heart-pounding rock and roll instead. Others have compared her to Billie Holliday and Fiona Apple. To put it plainly, Schatz can belt it out or make the hair on your neck stand up when she dials it down...    Selected videos: \"Death of Communication\" (1st Single off Running from a Gamble):http://www.youtube.com/watch?v=qAJK-MYmnWI \"Oscar Wilde\" (Single off of their debut album Ordinary Riches and winner of 2007 New York Songwriters Circle contest):http://www.youtube.com/watch?v=3_slOp6yhjQ Their most viewed Youtube video is an impromptu acoustic performance of their song \"Even in the Dark\" at Horseshoe Bend, Arizona that exemplifies Schatz's sometimes intoxicating, old-timey vocal stylings:http://www.youtube.com/watch?v=O8PDoHU5mN0  My personal favorite is their new track, \"Won't Go Quietly\" - which is reminiscent of Pearl Jam's \"Just Breathe.\" I've always been a sucker for the song that immediately follows the screaming rock anthem on an album, and I think this is theirs - a deeply personal dirge that swings into a motivational theme for not taking 'shit lying down': http://www.youtube.com/watch?v=QV8wirn02Ik   Try not to fall in love with the sound of her voice. I dare you. * In the interest of full disclosure, I am a voluntary member of the band's newly formed 'street team' - but I have no vested interest in them financial or otherwise. I don't work for their label or even know any of them personally. I saw them at a show at the Knitting Factory in Los Angeles a couple of years ago that one of my friend's bands also played and have been a devoted fan ever since (their live performance was just that good!) I recognize this looks like a pretty elaborate, marketing gimmick, but I'm just a fan trying to spread the music, folks. ;) ",
            "date": "Answered May 20, 2011",
            "views": "261",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tammy Ellison",
                    "user_href": "/profile/Tammy-Ellison-15"
                },
                {
                    "user_id": "David Nettleton",
                    "user_href": "/profile/David-Nettleton-2"
                },
                {
                    "user_id": "Andrea Gauvin",
                    "user_href": "/profile/Andrea-Gauvin"
                },
                {
                    "user_id": "Christopher Taylor",
                    "user_href": "/profile/Christopher-Taylor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chrys Jordan",
                "href": "/profile/Chrys-Jordan"
            },
            "answer_text": "I checked the Answer wiki before answering. Three groups were not included: Quarterflash is not even a topic on Quora. They were essentially a two-hit wonder. They had a number-one hit, then a moderate success, after which they disappeared. But who could forget Rindy Ross?  Harden My Heart She learned how to play saxophone because she wanted to be more than just a singer. The B-52s (band) Who could forget that they featured two female singers, Kate Pierson and Cindy Wilson. Kate was the most prominent lead singer.  Roam Kate and Cindy are sharing lead vocals this time. 10000 Maniacs were more than a one-it wonder, and Natalie Merchant (musician) is still highly regarded.  Like the Weather Natalie was the sole lead singer until she quit the band. When she did, John Lombardo (who had himself quit the band right before they’d made it big) returned and brought his girlfriend, Mary Ramsey. For awhile, we had 10000 Maniacs 2,0:  More Than This: their cover of the Roxy Music. ",
            "date": "Answered May 16, 2018",
            "views": "69",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natalie Boba",
                    "user_href": "/profile/Natalie-Boba"
                },
                {
                    "user_id": "Geoffrey Brickley",
                    "user_href": "/profile/Geoffrey-Brickley"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                },
                {
                    "user_id": "Arthur Homan",
                    "user_href": "/profile/Arthur-Homan"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Luke Proctor",
                    "user_href": "/profile/Luke-Proctor-1"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        }
    ]
}