{
    "title": "What is the meaning of the song 'Twenty Eight' by the Weeknd? - Quora",
    "tags": [
        "The Weeknd (musician)",
        "Song Meanings",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jai Gupta",
                "href": "/profile/Jai-Gupta-91"
            },
            "answer_text": "Trilogy as an album has been masterfully crafted to shape up a narrative involving Abel in the process of everything from being a young guy in Toronto up to no good to witnessing growth as an artist and realising that in the process. Each song serves the purpose of adding something to the narrative and providing greater depth and insight to the listeners with the help of dark sounds, sporadic sampling and, of course, the hypnotising vocals of The Weeknd. The song “Twenty Eight” has been placed in the compilation album at the juxtaposition of the transition between the mixtapes “House of Balloons” and “Thursday”. House of Balloons is a narrative of The Weeknd partying all around town with a girl named Valerie and getting her involved in all the demonic activities that he himself engages. In the song “The Morning”, however, The Weeknd falls for a stripper downtown and tries to integrate her in his drug-fueled lifestyle the same way that he did to Valerie (as has been detailed in the song “High for This”. However, she turns out to be somebody who was with Abel just for his ability to please her in bed and switched teams once she finds a partner potentially as good. The Weeknd has sung all about it in the song which Twenty Eight follows called “The Knowing”. Once the stripper goes and meets other people, she brags about her being with The Weeknd (who is now rising meteorically in terms of popularity due to the success of his mixtapes) and shares intricate details with them about his being. Twenty Eight as a song is only about The Weeknd singing to that stripper for not being as loving and respectful to him as he was to her and him throwing curses at her and being regretful to “let you (her) in my(his) home” saying that now everybody knows about him and that has made things harder for him as people now know “where I (he) sleep (sleeps)”. All in all, Twenty Eight is all about the Weeknd singing about his frustration about the fact that he is a public image now and how he won’t be able to live his life the way he used to anymore. ",
            "date": "Answered March 27, 2020",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Syed Saifullah",
                    "user_href": "/profile/Syed-Saifullah-6"
                },
                {
                    "user_id": "Shalini Puthal",
                    "user_href": "/profile/Shalini-Puthal"
                },
                {
                    "user_id": "Gloria Calvano",
                    "user_href": "/profile/Gloria-Calvano"
                },
                {
                    "user_id": "Sally Cox",
                    "user_href": "/profile/Sally-Cox-42"
                }
            ]
        }
    ]
}