{
    "title": "What are some of your favorite hip hop lyrics? - Quora",
    "tags": [
        "Hip Hop Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Ellis",
                "href": "/profile/Aaron-Ellis"
            },
            "answer_text": "Eminem's rhymes in \"Rock Bottom\" are nothing short of amazing. The song came out around 1998, but the lyrics are especially relevant today since the down economy and slow job market have taken a toll on everyone.  Verse 2My life is full of empty promises and broken dreams.I'm hoping things look up, but there ain't no job openings. I feel discouraged. Hungry and malnourished.Living in this house with no furnace, unfurnished And I'm sick of working dead end jobs with lame payAnd I'm tired of being hired and fired the same day But fuck it! If you know the rules to the game, play.'Cause when we die we know we're all going the same way 'It's cool to be player but it sucks to be the fanWhen all you need is bucks to be the man. Plus a luxury sedan And comfortable and roomy in a sixBut they threw me in the mix with all these gloomy lunatics Who walk around depressed and smoke a pound of cess a day,And yesterday went by so quick it seems like it was just today. My daughter wants to throw the ball, but I'm too stressed to play.Live half my life and throw the rest away. ",
            "date": "Answered April 19, 2014",
            "views": "513",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Ronne",
                    "user_href": "/profile/Jeff-Ronne"
                },
                {
                    "user_id": "Hunter McCord",
                    "user_href": "/profile/Hunter-McCord"
                },
                {
                    "user_id": "Coleman Foley",
                    "user_href": "/profile/Coleman-Foley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hunter McCord",
                "href": "/profile/Hunter-McCord"
            },
            "answer_text": "Verse 1 from Black Moon's \"How many Emcees must get dissed\" Im takin ya back come follow me\nOn a journey to see a for real MCThe mind tricks the body\nBody thinks the mind is crazyBut when I get the slazyKeep my flow Im swayzeI break, you takeWhatever type of sh*t the nigga Buckshot makesThe incredible lyrical and originalYou can kill a bull if you wanna take it coolWhatever I see I attack(tack)F*ck up the back black/nigga f*ck thatThe devil lurks in my heart yearns for it well\nLook into the eyes of a nigga who fellI hit my head on the concrete to beat defeat\n(GUNSHOT)Another dead nigga in the street\nBulls eye direct hit don't missBut How Many MC's Must Get Dissed Verse 2 ftom Nas' It ain't hard to tell The buddha monk's in your trunk, turn the bass upNot stories by Aesop, place your loot up, parties I shoot upNas, I analyze, drop a jewel, inhale from the LSchool a fool well, you feel it like Braille, it ain't hard to tell\nI kick a skill like Shaquille holds a pillVocabulary spills I'm Ill plus MaticI freak beats, slam it like Iron SheikJam like a Tec with correct techniquesSo analyze me, surprise me, but can't magnetize meScannin' while you're plannin' ways to sabotage meI leave 'em froze like her-on in your noseNas'll rock well, it ain't hard to tell ",
            "date": "Answered April 18, 2014",
            "views": "242",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Ellis",
                    "user_href": "/profile/Aaron-Ellis"
                },
                {
                    "user_id": "Coleman Foley",
                    "user_href": "/profile/Coleman-Foley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clara Lee",
                "href": "/profile/Clara-Lee-11"
            },
            "answer_text": "Yasiin Bey (formerly known as Mos Def) Life In Marvelous Times Especially: The temperature's rising everywhereAll over the world, you can feel itAll over the world, feel itSpirit rise everywhereIt's just a sure shot to the heart\nIt's just a sure shot in the dark\nIt's just another place in the stars\nWonders on every side, life in marvelous times\nLife in marvelous timesNow, always And: We can't be alive in no time but NOW Always inspirational. Reminds me to focus on something outside the blinders I put on when I focus on my problems. ",
            "date": "Updated May 10, 2014",
            "views": "223",
            "upvotes": "0"
        }
    ]
}