{
    "title": "What are some lyrics that inspire you? - Quora",
    "tags": [
        "Inspiration",
        "Song Lyrics",
        "Musicians",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aryan Bajwa",
                "href": "/profile/Aryan-Bajwa"
            },
            "answer_text": "30. Stronger (What Doesn’t Kill You) – Kelly Clarkson “What doesn’t kill you makes a fighter”.  This song, performed by the American Idol Season 1 winner helps you to evaluate your life when something hasn’t gone your way. Learn from it and come back fighting so that you can reach the next level. Kelly Clarkson - Stronger (What Doesn't Kill You)  29. Don’t Stop Believing – Journey “Don’t stop believin’. Hold on to the feelin'”. Remember when you started something new? How it felt? It’s not always going to be smooth, but remember what motivated you to start off, or how that relationship felt like at the beginning and strive to reinvent it. Journey - Don't Stop Believin' (Live in Japan)  28. Ain’t No Mountain High Enough – Marvin Gaye & Tammi Terrell “Don’t you know that there ain’t no mountain high enough. Ain’t no valley low enough, ain’t no river wide enough. To keep me from getting to you, baby”. Whatever your baby may be, it’s your goal. There may be obstacles on the way, but you can overcome them to reach that goal. MARVIN GAYE & TAMMI TERRELL \"Ain't no Mountain High Enough\"  27. Save the World – Swedish House Mafia “Who’s gonna save the world tonight? Who’s gonna bring you back to life?”. It’s down to you, motivate yourself to do what it takes to bring some activity back. Swedish House Mafia - Save The World  26. Skyscraper – Demi Lovato “Go on and try to tear me down. I will be rising from the ground”. If you are seeing obstacles blocking you, you can circumvent them and build back up. Life has it’s ups and downs and it’s up to you to build strong foundations so that you can continually build your own skyscrapers. Demi Lovato - Skyscraper  25. Get up Stand up – Bob Marley “Get up, stand up: don’t give up the fight!”. It’s not over yet. Bob Marley Get Up Stand Up  24. You’re Beautiful – James Blunt “But we shared a moment that will last ’til the end.”.  When those moments happen, treasure them and remember them. You may need it one day to keep you going. James Blunt - You're Beautiful (Live at the BBC)  23. It’s My Life – Bon Jovi “It’s my life. And it’s now or never”. We only have one life, why procrastinate on the things that matter? Bon Jovi - It's My Life  22. Beautiful – Christina Aguilera “You’re beautiful. No matter what they say”. There’s something beautiful for someone in almost everything. Don’t focus on the negatives, focus on the positives. Christina Aguilera - Beautiful (Official Video)  21. Tubthumping – Chumbawumba “I get knocked down, But I get up again, You’re never going to keep me down”. Persistence is important, take those setbacks into your stride. You’ve probably heard this inspirational song on countless sports shows. That’s how effective it is. Tubthumping(i get knocked down) by Chumbawamba  20. Where is the Love? – Black Eyed Peas “Take control of your mind and meditate”.  Focus on your objective, don’t waste your energy on the things you can’t control. The Black Eyed Peas - Where Is The Love?  19. You Gotta Be – Des Ree “Listen as your day unfolds. Challenge what the future holds”. Set your goals for the day and accomplish that challenge Des'ree - You Gotta Be  18. We are the Champions – Queen “And bad mistakes I’ve made a few I’ve had my share of sand kicked in my face – But I’ve come through”. We’ve all had bad days where everything feels like its on top of you, but think about how you’ve traversed through it and how you have learned from those lessons. Queen -  We Are The Champions (Official Video)  17. Not Afraid – Eminem “We’ll walk this road together, through the storm. Whatever weather, cold or warm”. Not everything needs to be done alone, sharing your support to someone can help make their day. Eminem - Not Afraid  16. Walking on Sunshine – Katrina and the Waves This is just a great feel-good song. Katrina & The Waves - Walking On Sunshine  15. Harder, Better, Faster – Daft Punk “Work it harder, make it better, do it faster, makes us stronger;”. Working smart increases your output. Focus on doing it smart. Daft Punk - Harder Better Faster  14. Human – The Killers “Close your eyes. Clear your heart”. We’re all human, sometimes we need to take a bit of time to reset so that we can move on. The Killers - Human  13. Lust For Life – Iggy Pop “I’m worth a million in prizes”. Whatever motivates you, find that vigor that makes you feel like a million dollars. Iggy Pop - Lust For Life  12. Remember the Name – Fort Minor “This is ten percent luck, twenty percent skill, Fifteen percent concentrated power of will ,Five percent pleasure, fifty percent pain”. Focus and work hard, it’s not going to be plain sailing, but if you want to reach your destination, you need determination. Fort Minor - Remember The Name (Official Video)  11. What a Feeling – Irene Cara “first, when there’s nothing but a slow glowing dream”. All your goals start from somewhere. Keep your eye on the goal. Flashdance What A Feeling - Irene Cara Official Video  10. Imagine – John Lennon “You, you may say I’m a dreamer, but I’m not the only one”. Figure out what your dream is and strive for it. John Lennon - Imagine (official video)  9. Perfect Day – Lou Reed “Just a perfect day, problems all left alone”. Take a break from your problems and take some time to enjoy yourself. Lou Reed - Perfect Day  8. Teardrop – Massive Attack “Most faithful mirror. Fearless on my breath”. Take a look at yourself and see if you’re heading in the direction you want. Make course corrections without fear. Massive Attack - Teardrop  7. Don’t Worry be Happy – Bobby McFerrin “In every life we have some trouble. But when you worry, you make it double”. Bobby McFerrin’s inspirational 80’s song reminds us that everyone is worried about something, and we need to take time out to have some happy time. Bobby McFerrin - Don't Worry Be Happy  6. Always Look on the Bright Side of Life – Monty Python “If life seems jolly rotten, There’s something you’ve forgotten!”. Focus on the positives. Monty Python - Always Look On The Bright Side Of Life [HD]  5. Here Comes the Sun – The Beatles “Little darling, I feel that ice is slowly melting”. Even if progress is slow, progress is still being made. http://www.youtube.com/watch?v=U6tV11acSRk 4. Beautiful Day – U2 “It’s a beautiful day. Don’t let it get away”. Celebrate your victories and achievements, no matter how small. U2 - Beautiful Day  3. Lovely Day – Bill Withers “When the day that lies ahead of me. Seems impossible to face”. Life sometimes seems impossible, but there is always a way, you just haven’t though of it yet. Bill Withers - Lovely Day (Original Version)  2. Stand By Me ~ Ben E. King “No I won’t be afraid. Oh I won’t be afraid”. That challenge may seem daunting, but don’t be afraid it. We have to overcome our fears and comfort zones to progress. Stand By Me, Ben E King, 1961  1. What a Wonderful World – Louis Armstrong “The colors of the rainbow so pretty in the sky”. Life is not in black and white, there is so much color out there to keep motivated for life. This song is terrifyingly inspirational when you consider how long this song has lasted. Louis Armstrong  What A Wonderful World  Here are all 30 songs in a youtube playlist ",
            "date": "Answered January 25, 2016",
            "views": "594",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nandani",
                    "user_href": "/profile/Nandani-15"
                },
                {
                    "user_id": "Tracy Theresa",
                    "user_href": "/profile/Tracy-Theresa"
                },
                {
                    "user_id": "Raghavi",
                    "user_href": "/profile/Raghavi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhilash Anandan",
                "href": "/profile/Abhilash-Anandan-1"
            },
            "answer_text": "\"Yes, there are two paths you can go by, but in the long run There's still time to change the road you're on.\" - Stairway to heaven by Led Zeppelin  You are young and life is long and there is time to kill today  And then one day you find ten years have got behind you  No one told you when to run, you missed the starting gun - Time by Pink Floyd   No one but me can save myself, but it's too late Now I can't think, think why I should even try - Fade to Black by Metallica  End of passion play, crumbling away  I’m your source of self-destruction  Veins that pump with fear, sucking darkest clear  Leading on your death’s construction  Taste me you will see  More is all you need  You’re dedicated to  How I’m killing you - Master of Puppets by Metallica  There's a place I like to hide A doorway that I run through in the night Relax child, you were there But only didn't realize and you were scared It's a place where you will learn To face your fears, retrace the years And ride the whims of your mind Commanding in another world Suddenly you hear and see This magic new dimension - Silent Lucidity by Queensrÿche  Don't ask me what I think of you, I might not give the answer that you want me to. - Oh Well by Fleetwood Mac  Lost in thought and lost in time While the seeds of life and the seeds of change were planted Outside the rain fell dark and slow While I pondered on this dangerous but irresistible pastime I took a heavenly ride through our silence I knew the moment had arrived For killing the past and coming back to life - Coming Back to Life by Pink Floyd  (Her love is) heavenly.  When her arms enfold me.  I hear a tender rhapsody.  But in reality, she doesn't even know me.  Just my 'magination, once again.  Running away with me.  Oh, tell you it was just my 'magination,  Running away with me.  I never met her but I can't forget her.  Just my 'magination,  Ooo yeah, yeah, yeah, yeah.  Running away with me. - Just my Imagination by The Temptations  P.S: Will add more.  Source: Song Lyrics from A to Z  ",
            "date": "Answered January 16, 2016",
            "views": "386",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azhar Khan",
                    "user_href": "/profile/Azhar-Khan-1664"
                },
                {
                    "user_id": "Sahil Patel",
                    "user_href": "/profile/Sahil-Patel-988"
                },
                {
                    "user_id": "Tracy Theresa",
                    "user_href": "/profile/Tracy-Theresa"
                },
                {
                    "user_id": "Piyush Jain",
                    "user_href": "/profile/Piyush-Jain-83"
                },
                {
                    "user_id": "Raghavi",
                    "user_href": "/profile/Raghavi"
                }
            ]
        }
    ]
}