{
    "title": "What do the lyrics of 'The Sound of Silence' by Paul Simon mean? - Quora",
    "tags": [
        "Paul Simon (musician)",
        "Silence",
        "Song Meanings",
        "Song Lyrics",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Kelly",
                "href": "/profile/Sean-Kelly-173"
            },
            "answer_text": "Most of Paul Simon's song are intensely personal, yet he manages to write lyrics in such a way that they don't come across mawkish or self-pitying.  For instance, The Boxer was written at a time when Simon was feeling particularly beaten up by the music business. In The Sound of Silence he was expressing his angst toward his, and other's, feelings of alienation in a post-modern world.  Part of this alienation is viewed as a result of our inability to communicate effectively with one another, combined with our ready acceptance of thought and opinion as provided by the mass media.  He also alludes that this is a result of our desire for, edging on addiction of, comfort as a result of our own affluence.   He uses an almost biblical suggestion in the passage, And in the naked light I saw ten thousand people maybe more. This is a suggestion he will use again, to great effect.  He goes on the reveal what he believes is our inability, or unwillingness to communicate with one another, saying, People talking without speaking. People hearing without listening.  People writing songs that voices never shared. He also observes the populous, in general, is unwilling to take a stand against this norm.  A sort of \"don't rock the boat\" mentality, saying, No one dared disturb the sound of silence. He writes from the point of view of an observer who sees what is going on, and yet is equally unable to express his views in such a way that is of any effect. \"Fools!\", said I.  \"Do you not know silence like a cancer grows.  Hear my words so I might teach you. Take my arms so might reach  you.\"  but my words like silent raindrops fell. He then affixes the blame for the way thing are.  What I find to be the most striking part of the song is the fact that rather than pointing at an outside force, he places the blame the this dilemma squarely on our shoulders. And the people bowed and prayed to the neon god they made.   Again, using a biblical suggestions to convey feeling of dread.  The narrator then warns us that this situation, left unaltered, will lead to our destruction.  And the sign flashed it's warning in the words that it was forming.  There are shades of Dickens' A Christmas Carol here, in which the ghost of Christmas future reveals to Scrooge the eventual path of his actions.  Also, as I mentioned earlier, he alludes that this situation may have resulted from our own affluence, saying, And the sign said, \"The words of the prophets are written on the subway wall and tenement halls.\" Keep in mind, this was written at a time when there was a great disillusionment in our society, and dissatisfaction with the status quo.    Those who were clinging onto the values of the 1950s were out of step, yet still a formidable force in government.   We were involved in an ever escalating war, with no clear objectives, allied to a government that was as evil as the ones or father's had fought against.   President Kennedy was recently assassinated, leaving many of the new generation to whom the torch had been passed feeling disenfranchised. It wouldn't be long before an entire generation was ready to reject their parent's middle class values. ",
            "date": "Answered April 25, 2016",
            "views": "3933",
            "upvotes": " View 484 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ma. Divina Grace Luna",
                    "user_href": "/profile/Ma-Divina-Grace-Luna"
                },
                {
                    "user_id": "K Jacobs",
                    "user_href": "/profile/K-Jacobs-11"
                },
                {
                    "user_id": "Tan Nicholas K E",
                    "user_href": "/profile/Tan-Nicholas-K-E"
                },
                {
                    "user_id": "Justin Wilkerson",
                    "user_href": "/profile/Justin-Wilkerson-38"
                },
                {
                    "user_id": "Olaniran Oluwaseyi",
                    "user_href": "/profile/Olaniran-Oluwaseyi"
                },
                {
                    "user_id": "Madhavi Jayasekara",
                    "user_href": "/profile/Madhavi-Jayasekara"
                },
                {
                    "user_id": "David Duncan",
                    "user_href": "/profile/David-Duncan-207"
                },
                {
                    "user_id": "Alejandro Berrizbeitia",
                    "user_href": "/profile/Alejandro-Berrizbeitia"
                },
                {
                    "user_id": "Lita Martin",
                    "user_href": "/profile/Lita-Martin-2"
                },
                {
                    "user_id": "Elise Moriah",
                    "user_href": "/profile/Elise-Moriah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Igboanugo Jennifer",
                "href": "/profile/Igboanugo-Jennifer"
            },
            "answer_text": "INTERPRETATION OF THE SOUND OF SILENCEHello darkness, my old friendI've come to talk with you againBecause a vision softly creepingLeft its seeds while I was sleepingAnd the vision that was planted in my brainStill remainsWithin the sound of silence_interpretation of THE SOUND OF SILENCE_*FOR THE FIRST STANZA*LINE 1: The Lord God refers to the devil/Satan, an Old friend.LINE 2: formal talks with the devil (not though as friends), of which God beforehand permitted (he who accuses us) the devil, but with limited time is finished here.LINE 3: the time of my coming as foretold by my prophets is not far fetched.LINE 4,5: see Matthew 13:24-30 . THE PARABLE OF THE WEEDS.LINE 6: _The fall of man_ ...And God said: \"who will go and save my people?\" No one in heaven. There was absolute Silence in heaven. *THIS IS WHERE IT ALL BEGAN...*---------------------------------------------------------------------------------------------------------In restless dreams I walked aloneNarrow streets of cobblestoneBeneath the halo of a street lampI turned my collar to the cold and dampWhen my eyes were stabbed by the flash of a neon lightThat split the nightAnd touched the sound of silent_interpretation of THE SOUND OF SILENCE_*FOR THE SECOND STANZA*LINE 1: \"Upon seeing the vision of my suffering and death, I sweated in drops of blood. No one watched the night with me not even for an hour \"LINE 2: \"I walked along the street of rough stones carrying the cross\" _perhaps *narrow* posits for way which leads to life_LINE 3: \"I lowered myself and became man\"  _Halo posits divinity_  _street lamp posits earthly_LINE 4: \"I gave my life that you may live\"LINE 5: \"The moment my eyes were shut at death, brought upon me by evil\"LINE 6: That happened _The tear of the veil of the temple_ see Matthew 27:51\"LINE 7: \"And I broke the silence of heaven\"---------------------------------------------------------------------------------------------------------And in the naked light I sawTen thousand people, maybe morePeople talking without speakingPeople hearing without listeningPeople writing songs that voices never shareAnd no one daredDisturb the sound of silence_interpretation of THE SOUND OF SILENCE_*FOR THE THIRD STANZA*LINE 1: _In the vision of Daniel (see Daniel 7:1) and of John (revelation 1:1, Jesus Christ gave this to his servants John)_......LINE 2: \"All that have surrounded my throne are here for they have been washed by my blood that they may be made worthy before me\" _see revelation 5:9_LINE 3: \" I know of their words that worshipped me all the long, but could not stir the heaven\"LINE 4: \"For the long to behold my face they wailed in pain but not to their slightest knowledge did they know I have plans for them that in the end we will meet\"LINE 4: To enjoin my Choir of Angels they longed. Longing to sing love and glorious songs to me too they craved in their hearts. All these I know...\".LINE 6: \"but no one could help them\"LINE 7 : \"...And yet the heaven was stilled in silence \"---------------------------------------------------------------------------------------------------------\"Fools,\" said I, \"you do not knowSilence like a cancer growsHear my words that I might teach youTake my arms that I might reach you\"But my words like silent raindrops fellAnd echoedIn the wells of silence_interpretation of THE SOUND OF SILENCE_*FOR THE 4th STANZA*LINE 1,2: _it is folly of he who tries to save his life for he will lose it! A selfish man is one caught by fear of death but the fear of God is the beginning of wisdom and the great gifts of the Holy spirit of God endowed upon him, the pretence of things well be unmasked for him to see. *Dying he destroyed our death, rising he restored our life, Lord Jesus come in Glory*_See Gospel of Saint Luke 17:32._silence here has a two way effect. For the silence of heaven the intimidation of the enemy grew upon the children of God. But in this silence, the plan of God was fulfilled and sacrifice he performed (he the performer and the object of performance of the sacrifice are same) he conquered all and once and for all and for eternity.__For we on earth, fear is the result of silence. If we fail to confront evil, it destroys us gradually little by little like *cancer*_LINE 3,4: \"...Learn from me, for I am meek and humble of heart... \"see Matthew 11:29LINE 4: _like a lamb to be slaughtered he mentioned no word. A complete resignation (no self defense ) though it was clear to all he did nothing. Died an unjust death but upon it, has drawn into himself the entire mankind. *Indeed how still waters run deep*_LINE 6,7: _(continued from the last line of the 3rd stanza) Upon hearing voice of the son of God, all bowed in hell. He descended into hell *the moment his eyes were stabbed by the neon light.*and rose again after 3days. He silenced the power of the Netherworld_--------------------------------------------------------------------------------------------------And the people bowed and prayed To the neon god they madeAnd the sign flashed out its warningIn the words that it was formingAnd the signs said the words of the prophetsAre written on the subway wallsAnd tenement hallsAnd whispered in the sounds of silence*STANZA 5*line 1,2: _The neglect of God's instructions/words of advise/law. The so call civilization and technology by the worldly people; They legalize abortion and now have called God a fool he who says that thou shall not kill, they pay no attention to the word of God anymore. Rapidly, the cankerworm grows in different ways today!_Line3: _And the Lord has continued to send his prophets (preachers of TRUTH of all kind)._Line 4: \" The generation formed by the people that have neglected to listen me, they are formed by their ways and not mine. A wicked generation.\"line 5: \"Though the signs are seen by all as I foretold and by my prophets through whom I still revealed hidden things\"Line6: \"Though they are on pages the Holy Scripture\" _Subway posits the book that shows us the true way the way of life_ _walls posits the pages of the book_line 7: _Posits the encryptions normally seen inside the Church, which are the images of Crucifixion, suffering and death of Jesus Christ. And many more such as his apostles and other Saints and martyrs like us that through those images, messages are conveyed to us_Line 8: _Though those images on their own they do not speak aloud, but we have been communicated to from our within what it all means, we fully understand and their purpose to help us to never loose gaze.__*against line 1, the line 8 is the the call of all mankind back to Sainthood*_HAPPY NEW YEAR 2017✨! ",
            "date": "Answered January 2, 2017",
            "views": "318",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Argha Biswas",
                    "user_href": "/profile/John-Argha-Biswas"
                },
                {
                    "user_id": "Yasmine Saber",
                    "user_href": "/profile/Yasmine-Saber-1"
                },
                {
                    "user_id": "Tia Ciao",
                    "user_href": "/profile/Tia-Ciao"
                },
                {
                    "user_id": "Charity Spradlin",
                    "user_href": "/profile/Charity-Spradlin-3"
                },
                {
                    "user_id": "Ej Rivera",
                    "user_href": "/profile/Ej-Rivera-9"
                },
                {
                    "user_id": "Thao Nguyen",
                    "user_href": "/profile/Thao-Nguyen-513"
                },
                {
                    "user_id": "Moahiromi Lkr",
                    "user_href": "/profile/Moahiromi-Lkr"
                },
                {
                    "user_id": "John Allee",
                    "user_href": "/profile/John-Allee-6"
                },
                {
                    "user_id": "Sophie Obomighie",
                    "user_href": "/profile/Sophie-Obomighie"
                },
                {
                    "user_id": "Danielle Brockett",
                    "user_href": "/profile/Danielle-Brockett-2"
                }
            ]
        }
    ]
}