{
    "title": "What songs, sung by Ariana Grande, express her vocal talent? - Quora",
    "tags": [
        "Ariana Grande (actor, musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chorina Leanne",
                "href": "/profile/Chorina-Leanne"
            },
            "answer_text": "  Ariana is fucking amazing. She is a credit to this cruel world. To come back to Manchester after the terrorist attack. To raise money for those who were injured. To visit those who were injured in hospital. To pay for the funerals for those who sadly passed. She gladly deserves to be crowned ‘Honorary Citizen of Manchester.’ You only have to Google ‘One Love Manchester’ to see for yourself. One Love Manchester will be known as the BEST and worlds most ICONIC moments in music history. Not only for music, but for the world. #NOFEAR.  But since you asked for songs here’s a few; Dangerous WomanThinkin’ Bout YouSomewhere Over The RainbowOne Last TimePersonally I will be getting the symbol tattooed along with the bumble bee that she got tattooed herself for those who tragically lose their lives in her presence.  She is only human. She may be famous. She may have an outstanding voice. But she is only human. She didn’t have to come back to Manchester at all. She didn’t have to release the first press conference saying she wanted to pay for the funerals of those who had died. She could’ve taken time off, cancelled the rest of her world tour and recover herself, mentally and emotionally. She is only human. But no. She continued her tour for her fans. She paid for the funerals. She came back to Manchester. She raised money for those injured. She has unreal amounts of courage, strength and vocal cords. She is only human. This was one of a fair few moments to be proud to be born in the U.K.   ",
            "date": "Answered October 8, 2017",
            "views": "15",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Francesca Petrova",
                    "user_href": "/profile/Francesca-Petrova"
                },
                {
                    "user_id": "Ariana Grande",
                    "user_href": "/profile/Ariana-Grande-514"
                },
                {
                    "user_id": "Akanksha Sinha",
                    "user_href": "/profile/Akanksha-Sinha-225"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Nandani",
                    "user_href": "/profile/Nandani-15"
                },
                {
                    "user_id": "Sierra Willard",
                    "user_href": "/profile/Sierra-Willard-5"
                },
                {
                    "user_id": "Sophia Li",
                    "user_href": "/profile/Sophia-Li-146"
                },
                {
                    "user_id": "Mahdis Aghababaie",
                    "user_href": "/profile/Mahdis-Aghababaie"
                },
                {
                    "user_id": "Katie Perry",
                    "user_href": "/profile/Katie-Perry-61"
                },
                {
                    "user_id": "Nidhi Mali",
                    "user_href": "/profile/Nidhi-Mali-1"
                }
            ]
        }
    ]
}