{
    "title": "What is the best Mozart violin Concerto? - Quora",
    "tags": [
        "Concertos",
        "Wolfgang Amadeus Mozart (composer)",
        "Violins",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roel Weerheijm",
                "href": "/profile/Roel-Weerheijm"
            },
            "answer_text": "‘The best' really is subjective. Mozarts most popular violin concerto is nr. 3 in G major, KV 216. His most mature and elaborate one is no. 5 in A major, KV 219. All of Mozarts five concertoes were written in 1775, when Mozart was 19 years old. He had recently traveled to Milan and Vienna with his father, hoping to achieve a position as composer and/or conductor somewhere, but this didn’t work out. The first two concertoes clearly show the Italian influences of his Milan trip. The last three blend his recent writing for the violin with his compositional experience in general, taking a few big steps forward in lyrical writing for the violin. I find it really disappointing that he stopped writing violin concertos after his fifth. I would have loved comparing the early ones with the later ones, the way you can do with his 27 piano concertos. My personal favorite is violin concerto no. 1 in B-flat major. I love it for a lot of reasons. For a violinist, B-flat major is quite an odd key, certainly in 18th century violin music. It gives the violin (and the string instruments in the orchestra) a rounded and warm sound, which makes it very interesting. In terms of the genre itself, Mozarts first violin concerto forms a bridge between the late-baroque concerto and the rococo style of mid-18th century, showing early hints of the neoclassicism of the late-18th century. It is one of the very first compositions of Mozart that I got to know and I completely fell in love with it. I even played it myself, although I struggled with the required technique. This concerto is all sunshine, optimism and good mood. It gives off a lot of light and warmth. Listening to it, I feel my mind suddenly being perfectly clear and bright. The music is slender, beautiful, precise, witty, loveable and loving: this music loves its listener, wants to give him/her the brightest of thoughts and feelings for its entire duration. ",
            "date": "Answered September 16, 2018",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luke Kusano",
                    "user_href": "/profile/Luke-Kusano"
                },
                {
                    "user_id": "Mike Louis",
                    "user_href": "/profile/Mike-Louis-57"
                },
                {
                    "user_id": "Russell Soon",
                    "user_href": "/profile/Russell-Soon-1"
                },
                {
                    "user_id": "Judy Uhl",
                    "user_href": "/profile/Judy-Uhl-1"
                },
                {
                    "user_id": "Adam Donahue",
                    "user_href": "/profile/Adam-Donahue-6"
                },
                {
                    "user_id": "Akash Srinivasan",
                    "user_href": "/profile/Akash-Srinivasan-6"
                },
                {
                    "user_id": "Max Woodcock",
                    "user_href": "/profile/Max-Woodcock"
                },
                {
                    "user_id": "Luke Yoder",
                    "user_href": "/profile/Luke-Yoder-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Hertzer",
                "href": "/profile/Erik-Hertzer"
            },
            "answer_text": "Number 5. It was his last violin Concerto, and as is the case with virtually all of his works, the later compositions are just a little more sublime than the work before it. All 5 violin concertos are masterpieces in my opinion, but number 5 is simply perfection. ",
            "date": "Answered September 24, 2017",
            "views": "857",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Louis",
                    "user_href": "/profile/Mike-Louis-57"
                },
                {
                    "user_id": "Adam Donahue",
                    "user_href": "/profile/Adam-Donahue-6"
                },
                {
                    "user_id": "Thi Anh Hang Trinh",
                    "user_href": "/profile/Thi-Anh-Hang-Trinh"
                },
                {
                    "user_id": "Katherine Carrick",
                    "user_href": "/profile/Katherine-Carrick"
                },
                {
                    "user_id": "Melissa Graham",
                    "user_href": "/profile/Melissa-Graham-66"
                },
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Richard Brockbank",
                    "user_href": "/profile/Richard-Brockbank"
                },
                {
                    "user_id": "Lamrini Younes",
                    "user_href": "/profile/Lamrini-Younes"
                }
            ]
        }
    ]
}