{
    "title": "What are the best classic rock songs? - Quora",
    "tags": [
        "Classic Rock Music",
        "Rock and Roll Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Gabrielson",
                "href": "/profile/Steve-Gabrielson-1"
            },
            "answer_text": "As almost everyone else who has answered has said, it is virtually impossible to objectively and definitively answer which is the best classic rock song of all time. That said, the following is a list of 10 songs (in no particular order) that are consistently ranked at the top of lists of greatest classic rock songs of all time: Stairway To Heaven - Led ZeppelinFree Bird - Lynyrd SkynyrdRoundabout - YesMore Than A Feeling - BostonAnother Brick In The Wall - Pink FloydBohemian Rhapsody - QueenCarry On Wayward Son - KansasDream On - AerosmithPurple Haze - Jimi HendrixLayla - Derek and the DominoesEven this list seems somehow inadequate to me, so here are some additional “Honorable Mentions” that might also qualify as the best classic rock song of all time: All Along The Watchtower - Jimi Hendrix Baba O'Riley - The Who Won't Get Fooled Again - The Who Walk This Way - Aerosmith Sweet Emotion - Aerosmith Kashmir - Led Zeppelin Black Dog - Led Zepplin Smoke On The Water - Deep Purple The Chain - Fleetwood Mac Rock And Roll All Night - KISS You Shook Me All Night Long - AC/DC Wheel In The Sky - Journey (I Can't Get No) Satisfaction - The Rolling Stones Got To Get You Into My Life - The Beatles Hotel California - The Eagles There are certainly other songs worthy of inclusion here; this is a subjective list which reflects my own opinions and biases on the subject of great classic rock songs. YMMV. ",
            "date": "Updated February 10, 2017",
            "views": "22",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vamsi Krishna",
                    "user_href": "/profile/Vamsi-Krishna-6198"
                },
                {
                    "user_id": "Randy Kirk",
                    "user_href": "/profile/Randy-Kirk-6"
                },
                {
                    "user_id": "Cathy Gillespie",
                    "user_href": "/profile/Cathy-Gillespie-5"
                },
                {
                    "user_id": "Ankit Thapa",
                    "user_href": "/profile/Ankit-Thapa-4"
                },
                {
                    "user_id": "Anjani Kumar",
                    "user_href": "/profile/Anjani-Kumar-28"
                },
                {
                    "user_id": "Mel Lagundino",
                    "user_href": "/profile/Mel-Lagundino"
                },
                {
                    "user_id": "Roby Lazarus",
                    "user_href": "/profile/Roby-Lazarus"
                },
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                },
                {
                    "user_id": "Vanessa Graves Pcholinski",
                    "user_href": "/profile/Vanessa-Graves-Pcholinski"
                },
                {
                    "user_id": "Mutyala Pardhu Sai Chowdary",
                    "user_href": "/profile/Mutyala-Pardhu-Sai-Chowdary"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Maciel",
                "href": "/profile/David-Maciel-8"
            },
            "answer_text": "Tangled Up In Blue, Bob Dylan Masters of War, Bob Dylan When I Paint My Masterpiece, Bob Dylan Tombstone Blues, Bob Dylan Rainy Day Women #12 and #35, Bob Dylan Ballad of a Thin Man, Bob Dylan Tweedle Dee and Tweedle Dum, Bob Dylan Whipping Post, Allman Brothers Band Mountain Jam, Allman Brothers Band Chalkdust Torture, Phish In Memory of Elizabeth Reed, Allman Brothers Band Blue Sky, Allman Brothers Band Powderfinger, Neil Young Cortez the Killer, Neil Young Cinnamon Girl, Neil Young Cripple Creek, The Band Dear Prudence, The Beatles Superstition, Stevie Wonder Feelin' Alright, Dave Mason Low Spark of High Heeled Boys, Traffic Do What You Like, Blind Faith Gimme Shelter, Stones Dragon Attack, Queen The Last Resort, the Eagles Piano Man, Billy Joel Scenes from an Italian Restaurant, Billy Joel Franklin's Tower, Grateful Dead Friend of the Devil, Grateful Gead Shakedown Street, Grateful Dead Casey Jones, Grateful Dead Cassady, Grateful Dead Bertha, Grateful Dead Jack Straw, Grateful Dead Dixie Chicken, Little Feat Willin', Little Feat All That You Dream, Little Feat Spanish Moon, Little Feat Dynamo-Humm, Frank Zappa Peaches en Regalia, Frank Zappa Layla, Derek and the Dominoes Crossroads, Cream Do It Again, Steely Dan The Royal Scam, Steely Dan Pretzel Logic, Steely Dan Steamer Lane Breakdown, Doobie Brothers South City Midnight Lady, Doobie Brothers I Know A Little, Lynyrd Skynyrd You Got That Right, Lynyrd Skynyrd Ice Cream Man, Van Halen Hot for Teacher, Van Halen Death Cab For Cutie- I Will Possess Your Heart Death Cab For Cutie- Soul Meets Body Additionally, I can't conceive of not listening to any of the following albums from start to finish in one sitting, virtually qualifying any of them as a song in my book. Blow by Blow, Jeff Beck Dark Side of the Moon, Pink Floyd Wish You Were Here, Pink Floyd Animals, Pink Floyd Thick As A Brick, Jethro Tull Thank goddess the OQ didn't put a quantifying limit in the question! I'll probably be back tomorrow with a few more to add to the list. These just came flowing right out of my brain, through my fingertips, and into the answer, nothing but net. ",
            "date": "Answered March 8, 2019",
            "views": "746",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Junior",
                    "user_href": "/profile/Dave-Junior-1"
                },
                {
                    "user_id": "Anjani Kumar",
                    "user_href": "/profile/Anjani-Kumar-28"
                },
                {
                    "user_id": "Amanda Huggnkiss",
                    "user_href": "/profile/Amanda-Huggnkiss-2"
                },
                {
                    "user_id": "Sanjith Mohammed",
                    "user_href": "/profile/Sanjith-Mohammed"
                },
                {
                    "user_id": "Mike Westhoff",
                    "user_href": "/profile/Mike-Westhoff-1"
                },
                {
                    "user_id": "Roby Lazarus",
                    "user_href": "/profile/Roby-Lazarus"
                },
                {
                    "user_id": "Sheron Arcibald",
                    "user_href": "/profile/Sheron-Arcibald"
                }
            ]
        }
    ]
}