{
    "title": "What`s the meaning behind bts`s song 'MAMA'? - Quora",
    "tags": [
        "J-Hope (BTS Member)",
        "BTS Songs",
        "Song Meanings",
        "Song Lyrics",
        "BTS (K-pop group)",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carmen Lin",
                "href": "/profile/Carmen-Lin-29"
            },
            "answer_text": "I think that the most telling message that the song holds is to show his love and appreciation to him mother. It also relates to the storyline, that they create in the HYYH era, where they have shown the fictional characters displayed in the story, who are close friends that find happiness and comfort in their times together, while battling with their own inner and personal struggles. They are all broken, with their own inner mental illnesses and struggles, yet they all seek comfort and hope from one another, and their worries and problems melt away and slows them to escape from their dark, realities just for a while, when they are all in one place. Everyone has a dark history of their own, riddled with painful memories, about their childhood, or the traumatic experience, that has scarred their life, and thus, left them alienated by other people, and only with each other by their side. All have faced their own struggles, that led them to the people, they are today, which stemmed from their history. J-Hope, was once abandoned by his mother, who had left him in the circus with a Snicker bar. So, he is reciprocating his love and care for his mother, yet also, feeling apologetic, about being a disappointment to her, because of his mother decision to leave him in the circus, and with a Snicker bar. It is a vague description but if you want a more in depth explanation, I will look into it a bit more, to try to fully explain the deeper meaning of it. ",
            "date": "Answered October 22, 2020",
            "views": "31",
            "upvotes": " Answer requested by Extra Conto"
        },
        {
            "author_info": {
                "name": "Jessica Thwaites",
                "href": "/profile/Jessica-Thwaites-4"
            },
            "answer_text": "From what I know and heard J Hope wrote the song “MAMA” for his mom or a contribution to his mom who supported his every choice , and as he specified , even through debt . He was thanking her for working so hard , even when she had to move away . But it’s also about how much he misses her which is shown when he says ‘ today more than usual I want to be in your arms’ the song goes from Hobi thanking her for supporting him to the end where he says she can now lean on him and be comfortable . :) I ‘J’ hope this makes some sense or has helped hehe 💜💜 ",
            "date": "Answered October 22, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}