{
    "title": "What are easy guitar songs that look hard? - Quora",
    "tags": [
        "Playing Guitar",
        "Guitars",
        "Musical Instruments",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oliver Lee",
                "href": "/profile/Oliver-Lee-37"
            },
            "answer_text": "So this one has been hanging about on my notifications for a while and I figured someone else would’ve gotten to it but… well here we are. So my answer for you is actually inspired by a fantasy novel. Yes, really. It’s ‘the wise man’s fear’ by Patrick Rothfuss, you should definitely read it. Now without wanting to give any spoilers: Our hero Kvothe, young minstrel and actor (among other things) takes to the boards on the prestigious stage of The Eolian of Imre.  Now Kvothe needs to make money fast and he needs to stand out. So what does he do? He plays “Bellweather” a folk tune so simple anyone could carry it in a bucket, and makes it look hard. He sweats and sways, grimaces a intently frowns at the instrument. Then he plays “Tintantatorin” an amazingly hard piece, as if it’s boring and easy. He yawns, scratches his head a bit in a short gap, looks off into the audience. The musicians love it, the rest of the audience feel tricked. Basically what I’m saying here is no tune looks easy or hard to play. They are just… played. If you are performing it well then it will be a fluid motion and look easy by default, it’s then up to you to sweat and grimace and gurn to make it look hard. Why do you think punk musicians jump around frowning so much with four bar chords to play? Why do you think people playing Rachmaninov look like the Buddha after a 2 drinks when they’re probably sh*tting it inside lol. Maybe take some acting lessons? <wink> P.s. Best. Audiobook. Ever. ",
            "date": "Answered September 24, 2018",
            "views": "541",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stefan Elekanic",
                    "user_href": "/profile/Stefan-Elekanic"
                },
                {
                    "user_id": "Ann Kenton",
                    "user_href": "/profile/Ann-Kenton"
                },
                {
                    "user_id": "Tim Galli",
                    "user_href": "/profile/Tim-Galli-2"
                },
                {
                    "user_id": "Jacob Fischer",
                    "user_href": "/profile/Jacob-Fischer-1"
                },
                {
                    "user_id": "Saager Chawla",
                    "user_href": "/profile/Saager-Chawla"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Rego",
                "href": "/profile/John-Rego-12"
            },
            "answer_text": "Saager, too tough to answer, so I should not have I guess. Too many unknowns to me, but since I answered. I will go by my personal experience. Mr Bojangles, to me, then, appeared to be impossible. But, quite easy. The intro to AC/DC Shook Me seemed beyond reach, but again, once broken down, may not be easy to a beginner, though I taught it to dozens of beginners, much easier than it sounds. The Kool was intro on Can't You See, Marshall Tucker Band, is much easier Decolla online con il dominio giusto per than it sounds. Hope I helped? ",
            "date": "Answered July 27, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saager Chawla",
                    "user_href": "/profile/Saager-Chawla"
                }
            ]
        }
    ]
}