{
    "title": "What song goes “whisper words of wisdom…”? - Quora",
    "tags": [
        "Whisper",
        "Whisper (app)",
        "Song Meanings",
        "Rap Music",
        "Hip Hop Music",
        "Song Lyrics",
        "Song Identification",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nancy Pickles",
                "href": "/profile/Nancy-Pickles"
            },
            "answer_text": "Let It Be - The Beatles When I find myself in times of trouble, Mother Mary comes to meSpeaking words of wisdom, let it beAnd in my hour of darkness she is standing right in front of meSpeaking words of wisdom, let it be Let it be, let it be, let it be, let it beWhisper words of wisdom, let it be And when the broken-hearted people living in the world agreeThere will be an answer, let it beFor though they may be parted, there is still a chance that they will seeThere will be an answer, let it be Let it be, let it be, let it be, let it beYeah, there will be an answer, let it beLet it be, let it be, let it be, let it beWhisper words of wisdom, let it be Let it be, let it be, let it be, yeah, let it beWhisper words of wisdom, let it be And when the night is cloudy there is still a light that shines on meShine until tomorrow, let it beI wake up to the sound of music, Mother Mary comes to meSpeaking words of wisdom, let it be Let it be, let it be, let it be, yeah, let it beThere will be an answer, let it beLet it be, let it be, let it be, yeah, let it beThere will be an answer, let it beLet it be, let it be, let it be, yeah, let it beWhisper words of wisdom, let it be ",
            "date": "Answered November 4, 2019",
            "views": "129",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tammy Anderson",
                    "user_href": "/profile/Tammy-Anderson-216"
                },
                {
                    "user_id": "Robert Tinker",
                    "user_href": "/profile/Robert-Tinker-9"
                },
                {
                    "user_id": "Mike Austin",
                    "user_href": "/profile/Mike-Austin-36"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                }
            ]
        },
        {
            "author_info": {
                "name": "H.T. Van Fleet",
                "href": "/profile/H-T-Van-Fleet"
            },
            "answer_text": "“Let it Be\" The Beatles (from album if same title) Paul McCartney all time classic. He dreamed his mother, (who had passed away) was whispering advice to him one night. All of the stress he was going through with The Beatles management and money quarrels that finally broke up the band shortly after. She was whispering “just let it be Paul. Just let it be.” Whispered words of wisdom indeed… ",
            "date": "Answered November 7, 2019",
            "views": "46",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mike Austin",
                    "user_href": "/profile/Mike-Austin-36"
                }
            ]
        }
    ]
}