{
    "title": "What was life like in the early 1960s compared to the late 1960s? - Quora",
    "tags": [
        "1960s",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Larry Wallach",
                "href": "/profile/Larry-Wallach"
            },
            "answer_text": "In just the period from early 1965 to 1969, the changes in styles, lifestyle and society were breathtaking and unlike anything that happened in the decades that have followed. I remember that in the mid-60’s, it was almost the rule that men wore dress hats when going out and women wore gloves and often hats. It was still common for men and boys to use Vitalis or similar things in their hair, though I remember one men’s hair commercial from 68 or 69, with the theme “the wet head is dead.” Clothes in the early to mid 60’s were not too colorful, especially for men—dark suits, white shits and a skinny tie with a tie clasp. That began to change at the end of the 60’s. I only saw someone wear bell bottoms and wire glasses in early 1967 and I still remember it because it looked odd to me that first time. You heard expressions from older people that are mostly forgotten today—referring to the refrigerator as “the ice box”, or calling someone and being told to “hold the wire.” Teachers and principals were very much authority figures—many were feared, and used language, even in elementary grades, that would not be acceptable today. The paddle was also not a strange sight. Most parents at that time came of age during the depression and WWII. They were, on the whole, stricter than parents today and put significant priority on being authority figures; and from conversations you heard (overheard) among grownups, it was clear many had a very hard time coping with what was called the youth culture/generation gap. I still remember the first time I flew, in 1966, on American Airlines. The stewardess’s were very well groomed and dressed in blue uniforms—it was still considered a high glamour job. The plane was spotless, and most of the passengers were either businessmen (and it was mostly men then) or families going to visit relatives. Passengers got full meals, served on regular plates with metal silverware. You got dressed up to fly—no tee shirts or shorts. Folks smoked heavily in flight, as they did elsewhere. Kids could get wings, rings and related airline promo stuff. I remember airports at that time often being a vast sea of military uniforms from all service branches, as soldiers were coming and going to Vietnam. Food in the mid to late 60’s was both more limited and blander than today. Lots of fried stuff. Italian and Chinese food (and Mexican depending on where you lived) were considered the “ethnic” or international dishes. Many people at that time did not know what bagels were, let alone many other dishes were take for granted today. The big snacks for kids were hostess cupcakes, twinkles and then-new pop tarts—all heavily promoted by Captain Kangaroo. The Captain also wanted you to to remind mom to buy Kellogg’s Sugar Pops when she went shopping, so you could have a healthy and delicious breakfast. A trip to McDonald's was way different—most of their places were small and very plain and the menus were limited to regular hamburgers or cheeseburgers or maybe a fish sandwich, with a small paper packet of fries and milkshakes in three flavors. If you were lucky, you could get a free McDonald’s paper folding hat. Still, it was a treat to go. I remember some of the news events, from the perspective of an elementary school kid—LBJ’s very large face and ears filling up our black and white TV and his accent more than any of his words. I was a little too young to have memories of JFK’s assassination, but I very much remember, in the mid-60’s, that his memory was very powerful for a lot of folks. It was very common to see his picture in people’s homes and even places like restaurants. Those not alive in the mid-late 60’s might be surprised at the emotional hold that the Kennedy's, especially Robert Kennedy, had on lots of people who liked them, particularly compared to the way most politicians are viewed today. At decade’s end, I remember watching Nixon’s first inauguration at school, and not too much later, a comedian named David Frye doing his Nixon imitation on the Ed Sullivan show. Even through the eyes of a kid, the 60’s seemed like a roller coaster ride that started out fairly smooth and became fast and difficult at the end. ",
            "date": "Answered November 3, 2019",
            "views": "13",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Farina",
                    "user_href": "/profile/Stephen-Farina"
                },
                {
                    "user_id": "Sheila Tellez",
                    "user_href": "/profile/Sheila-Tellez-1"
                },
                {
                    "user_id": "Oleg Rogozhkin",
                    "user_href": "/profile/Oleg-Rogozhkin"
                },
                {
                    "user_id": "Brian Viera",
                    "user_href": "/profile/Brian-Viera-1"
                },
                {
                    "user_id": "Thomas Wayne",
                    "user_href": "/profile/Thomas-Wayne-26"
                },
                {
                    "user_id": "Greig Ross",
                    "user_href": "/profile/Greig-Ross-2"
                },
                {
                    "user_id": "Hamza Murad",
                    "user_href": "/profile/Hamza-Murad-19"
                },
                {
                    "user_id": "Bill DeCoste",
                    "user_href": "/profile/Bill-DeCoste"
                },
                {
                    "user_id": "Sandy Martin",
                    "user_href": "/profile/Sandy-Martin-63"
                },
                {
                    "user_id": "Scott Chandler",
                    "user_href": "/profile/Scott-Chandler-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niko Vasileas",
                "href": "/profile/Niko-Vasileas"
            },
            "answer_text": "Well at midnight January 1st, 1960 the ’50s didn't just vanish and hippies magically appear. The final Lucy-Desi Comedy Hour, the last time Lucille Ball and Desi Arnaz appeared as Lucy and Ricky Ricardo wasn't aired until April 1, 1960! The era we think of as “the sixties” (drugs, sex, flower powe, hippies and Vietnam) were from about 1965-1974. The early 1960s were still very much like that of the 1950s. To us it would be an alien world of social repression and lock-stock conformity. But even then the “all American family” of a dad ar work, mom cooking and cleaning in pearls and heels and 2.5 children is something of a myth. Only about 60% of children in that era spent their entire childhoods in that type of family and as for “traditional” the 1950s were an aboration bucking the trend of rising divorce rates and declining marriage rates and family size since the 1880s. In fact in the 1920s there were predictions that marriage would be extinct by the 2020s. By around 1965 the oldest “boomers” were 20 and society had grown weary of the “pretend it isn't happening” mindset of the ‘50s, what was often deemed “innocence” was often in fact forced naivete. The civil rights movement had gained serious traction by then, women's rights and by 1969 gay rights had emerged. The pill and sexual revolution made it so people, especially women had greater agency over their bodies and lives. The deaths of JFK, RFK and King rocked society, the sprees of Richard Speck and the Manson family stripped away “innocence” as did riots, protests and demonstrations. The counter culture and the “mod” allowed for greater personal freedoms and sexual expression. Of course not everyone liked these changes. I've never heard “hippie” used as a compliment. The “schedule 1” of drugs, marijuana, LSD and heroin reflect what was demonized at the time. A lot of people blame the sixties for “what's wrong with this country” (an old refrain, when three boys in Chicago disappeared in one day in 1955 the father of one of them said “when three boys can't walk to a bowling alley and be safe in the middle of the afternoon there is something wrong with this country.”) People lament the death of an old comforting world in the 1960s, the loss in Vietnam, Nixon, the cynicism of the 1970s, the greed of the 1980s, and even today the 60s are blamed for ushering in our current world. But that's not fair, the 1960s helped shape a more modern outlook but it also stripped away the rose -tinted sugar coated myth of the 1950s and made everything “real” again. Far to real for some people's taste. ",
            "date": "Answered June 24, 2017",
            "views": "38",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Sheila Tellez",
                    "user_href": "/profile/Sheila-Tellez-1"
                },
                {
                    "user_id": "Christian John Eli",
                    "user_href": "/profile/Christian-John-Eli"
                },
                {
                    "user_id": "Air Breather",
                    "user_href": "/profile/Air-Breather-3"
                },
                {
                    "user_id": "Brian Viera",
                    "user_href": "/profile/Brian-Viera-1"
                },
                {
                    "user_id": "Alex Jiménez",
                    "user_href": "/profile/Alex-Jiménez"
                },
                {
                    "user_id": "Hamza Murad",
                    "user_href": "/profile/Hamza-Murad-19"
                },
                {
                    "user_id": "Donna Pieniazek",
                    "user_href": "/profile/Donna-Pieniazek-2"
                },
                {
                    "user_id": "Armando Anguiano",
                    "user_href": "/profile/Armando-Anguiano-4"
                },
                {
                    "user_id": "Marcus Sidoti-McNary",
                    "user_href": "/profile/Marcus-Sidoti-McNary-1"
                }
            ]
        }
    ]
}