{
    "title": "What did Paul McCartney want from Linda? - Quora",
    "tags": [
        "Linda McCartney",
        "Paul McCartney"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adithya Vishnu",
                "href": "/profile/Adithya-Vishnu"
            },
            "answer_text": "Linda was unfazed by the rock stars she photographed. She was very professional. She was also from the famous Eastman house. Of all the Beatles, Paul valued the concept of a tight family the most. He was maybe traditional in this aspect. When Paul first met Linda she was actually into George but Paul made it clear she was his from the very start.Paul pursuing Linda actually tells us how unique she was.He is Paul F* McCartney and he could have had the prettiest women in the world and he did before he married Linda.Paul saw in Linda the balance to his frantic rockstar lifestyle. She was the earthing to McCartney’s live wire. She managed his business, his estates, raised two daughters and stayed on stage when Wings performed even though she never played any instrument. Paul wanted her by his side always and stayed faithful to her until her death due to cancer in 1998. This is what Linda brought into McCartneys life and this unconditional love is what Paul want from Linda. The fine Balance. ",
            "date": "Answered July 12, 2020",
            "views": "30",
            "upvotes": " Answer requested by Anohar John",
            "upvoters": [
                {
                    "user_id": "Destinia Jenialita",
                    "user_href": "/profile/Destinia-Jenialita"
                },
                {
                    "user_id": "Brud Weger",
                    "user_href": "/profile/Brud-Weger"
                },
                {
                    "user_id": "Cindy Warnick",
                    "user_href": "/profile/Cindy-Warnick-2"
                },
                {
                    "user_id": "Linda Huetson",
                    "user_href": "/profile/Linda-Huetson-2"
                },
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Larry Starstruck",
                    "user_href": "/profile/Larry-Starstruck"
                },
                {
                    "user_id": "Lori Anne",
                    "user_href": "/profile/Lori-Anne-3"
                },
                {
                    "user_id": "Matt Stahl",
                    "user_href": "/profile/Matt-Stahl-8"
                },
                {
                    "user_id": "Bev Lueers",
                    "user_href": "/profile/Bev-Lueers"
                },
                {
                    "user_id": "Caitlin Frawley",
                    "user_href": "/profile/Caitlin-Frawley-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Edwards",
                "href": "/profile/Patricia-Edwards-102"
            },
            "answer_text": "What kind of question is that any way? One would presume he wanted what we all want from our lifemate, love, understanding and emotional support. Linda fulfilled these “wants” and much more. It's a mystery as to exactly what you are hoping for someone to say given the wording of the question though. Perhaps hoping for drama or dirt?  ",
            "date": "Answered February 10, 2020",
            "views": "115",
            "upvotes": " View 68 Upvoters "
        }
    ]
}