{
    "title": "What's the most disturbing song you've ever heard? Why? - Quora",
    "tags": [
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Richardson",
                "href": "/profile/Patrick-Richardson-18"
            },
            "answer_text": "Perhaps I could give a better answer if I had a more concrete understanding of what you mean by \"disturbing.\"  Are we talking lyrics?  Pretty much every taboo has been pushed to the extremes and beyond in some song or another by now.  Or are you talking about the actual sound of the music?  Is \"disturbing\" synonymous with unnerving, annoying, haunting, infuriating, disgusting...a lot of things can be \"disturbing;\" what are you looking for? Off the top of my head... Come to Daddy - Aphex Twin:  For the record, if you've never heard this, please listen to it by itself without watching the video first.  The video is totally disturbing, but it will lessen the intensity of the song by itself.  I first heard this during the climax of the film 8mm and tracked it down not long after.  Maybe it's the bizarre and incessant rhythm...or maybe it's just Richard screaming/bleating/groaning, \"I want your soul / I will eat your soul!\" Kim - Eminem:  Eminem nailed \"crazy\" on the head with this one.  This song is a bit of an experience, and the way he precisely conveys the exchange between the 2 is eeriely realistic.   Where Did You Sleep Last Night? - Nirvana: Kurt really does a wonderful job of turning this a haunting, almost ethereal piece.  It plods along, coolly but detached, with just a hint of underlying menace....and then there's the climax where Kurt bursts through with that unholy, otherwordly delivery of \"shiver.\"  There's a lot of pain there, and I suppose being so close it makes it a bit disturbing. In an Excruciating Way Infested with Vermin and Violated by Executioners Who Practise Incendiarism and Desanctifying the Pious - Wormphlegm:  This is a fairly atmospheric/disgusting piece of cult-status funeral doom metal.  You're not likely to pick up on much without the lyrics in front of you, but it's a filthy, abhorrent piece where the singer watches saints and other religious figures (I remember Martin Luther for sure) undergo extreme, inventive, and graphic tortures at the hands of what I presume to be demons.   This is more of a \"shock piece\" than anything else, and truth is you can find a lot of this ultra-violent/ultra-graphic/ultra-offensive stuff at the extremes of most hard rock, metal, and punk genres.  Want Satan and blasphemy and creatures from the deep?  Turn to the lo-fi recordings of the 2nd wave of black metal.  Need some good ol' encouragement to commit suicide?  Look no further than the mid-2000's slew of depressive black metal acts - Shining's Halmstad, Totalselfhatred's eponymous 2008 album, or Stiny from Trist.  Maybe extreme gore - everything from cannibalism to necrophilia - is your thing?  You've got everything from the relatively \"tamer\" material of Cannibal Corpse up through Cephalotripsy and Dead Infection, spanning death metal to grindcore and everything in between.  Or maybe bleak and bizarre war-torn futurescapes are your thing, with sometimes radically left-ish ideals....dig into the frenetic yet calculated world of industrial metal acts like Godflesh and Rammstein.  Or why not introduce yourself to the world of powerviolence with Magrudergrind's self-titled album or Deconstruct from Hatred Surge...?  Perhaps a slice of the wildly intolerant- I'm talking blatant racism, misogyny, homophobia, and more - look no further than David Allan Coe's less popular years (you'll know the song titles when you see them) for your country fix, or how about Anal Cunt's brand of grindcore for the metalheads (with songs like \"Van Full of Retards,\" \"Hitler was a Sensitive Man,\" and \"I Got an Office Job for the Sole Purpose of Sexually Harassing Women\")?  You can even push into the darkened corners of rap and hip-hop for equal amounts of violence and morbidity, though I'm less familiar with individual acts and albums. My point is that we're getting back to \"what is disturbing\" again.  If the subject matter is purely what you're after, look no further than the above! ",
            "date": "Answered December 11, 2015",
            "views": "42",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Mirna Guillen",
                    "user_href": "/profile/Mirna-Guillen-2"
                },
                {
                    "user_id": "Ajax Jo",
                    "user_href": "/profile/Ajax-Jo-1"
                },
                {
                    "user_id": "Bruno Tavares",
                    "user_href": "/profile/Bruno-Tavares-6"
                },
                {
                    "user_id": "Nicola Timmins",
                    "user_href": "/profile/Nicola-Timmins"
                },
                {
                    "user_id": "Eduard Nemes",
                    "user_href": "/profile/Eduard-Nemes"
                },
                {
                    "user_id": "Victoria Flytrap",
                    "user_href": "/profile/Victoria-Flytrap"
                },
                {
                    "user_id": "Anany Dwivedi",
                    "user_href": "/profile/Anany-Dwivedi-5"
                },
                {
                    "user_id": "Marty Tango",
                    "user_href": "/profile/Marty-Tango-1"
                },
                {
                    "user_id": "Brígida Cury",
                    "user_href": "/profile/Brígida-Cury"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Farrar",
                "href": "/profile/Emma-Farrar-11"
            },
            "answer_text": "“She's so lucky, she's a star / But she cry, cry, cries in her lonely heart, thinking / If there's nothing missing in my life / Then why do these tears come at night?” - Lucky, Britney Spears “I need to make mistakes just to learn who I am / And I don't want to be so damn protected” - Overprotected, Britney Spears “Why don't they just let me live? / I don't need permission, make my own decisions” - My Prerogative, Britney Spears  Beginning her career on Broadway at just four years old, Britney Spears has spent almost her entire life engulfed in fame, protection, and restrictions. From there, Spears moved on to a role in a very successful movie, Mickey Mouse Club, at just 11 years old, and moreover began to pursue her solo career years later.  When her solo career began, her voice sounded almost identical to that of Christina Aguilera’s—who was also in Mickey Mouse Club, and planned to release a debut album at the same time as Spears. And from this, the controlling began. Producers trained her voice to have a different sound, the “baby” sound that we can all recognize today—the sound that ruined her voice for decades, explaining her common use of lip sync. In 2007, Spears was the face of dozens of magazine covers for her public divorce, and had a massive amount of attention from the public eye. She’d been constantly chased by hundreds of paparazzi, including once while naked to one of her two cases of hospitalization for mental health, and, from there, was “losing her mind.” Six months after leaving the hospital for the second time, in a still obvious unstable condition, she begun working immediately by promoting her new album, Circus. Months after this album, her father made his previous temporary conservatorship permanent, after claiming that she had early onset dementia at just 26 years old. To this day, at 38 years old, she still lives under his control. Conservatorships are meant for those with failing health, typically of the elderly—not 38 year old adults. This means that she is unable to, at 38 years old, do none of these (and many other) things without her father’s permission: spend her own money (mind you, she is believed to make about $138 million per year)drive a carvote in an electionspeak up publicly about the conservatorshipcontact anyone without surveillancego for a walkIf she does end up doing any of this impermissibly, her father may legally send her to an asylum/facility for mental health. She’d been in one for three months in January of 2019 for driving her car to In-N-Out Burger with her boyfriend, after refusing to take medication that her father’s doctors prescribe her so that she stays “under control.”  As all of this happens, she releases music and makes hundreds of millions of dollars. Music with lyrics that are obviously cries for help. The dream life, right? Before reading about her condition, which her family did their best to stay hidden, you may be given the idea that she’s living the life that everyone wishes they could afford, constantly walking on money and support. But a lot happens behind closed doors. Free Britney. bless í bili, Emma Sources: #FreeBritney explained: What’s going on with Britney Spears’ conservatorship? Britney Spears - Wikipedia ",
            "date": "Answered August 2, 2020",
            "views": "26",
            "upvotes": " View 96 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julia Vu",
                    "user_href": "/profile/Julia-Vu-26"
                },
                {
                    "user_id": "Ashton Lindsay",
                    "user_href": "/profile/Ashton-Lindsay-2"
                },
                {
                    "user_id": "Breanna Chai",
                    "user_href": "/profile/Breanna-Chai-1"
                },
                {
                    "user_id": "Yara Sanchez",
                    "user_href": "/profile/Yara-Sanchez-4"
                },
                {
                    "user_id": "Isobel Smith",
                    "user_href": "/profile/Isobel-Smith-44"
                },
                {
                    "user_id": "Uyen Hoang",
                    "user_href": "/profile/Uyen-Hoang-22"
                },
                {
                    "user_id": "Sofia Galstyan",
                    "user_href": "/profile/Sofia-Galstyan"
                },
                {
                    "user_id": "Ajax Jo",
                    "user_href": "/profile/Ajax-Jo-1"
                },
                {
                    "user_id": "Jorge Espinal",
                    "user_href": "/profile/Jorge-Espinal-20"
                },
                {
                    "user_id": "Talia Sabbath",
                    "user_href": "/profile/Talia-Sabbath"
                }
            ]
        }
    ]
}