{
    "title": "What is the science involved when plants hear music and grow in size? - Quora",
    "tags": [
        "Horticulture",
        "Hearing",
        "Trees (plant)",
        "Gardening",
        "Science of Everyday Life",
        "Plants",
        "Botany",
        "Biology",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hardy Mletzko",
                "href": "/profile/Hardy-Mletzko"
            },
            "answer_text": "The science, as yet, has not been defined. According to research from Tel Aviv University, Oenothera drummondii flowers “exposed to playback sound of a flying bee or to synthetic sound signals at similar frequencies, produce sweeter nectar within 3 minutes, potentially increasing the chances of cross pollination.” The flowers also vibrated mechanically in response to these sounds, “suggesting a plausible mechanism where the flower serves as an auditory sensory organ.” And this wasn’t simply a case of flower + sound = response — while the plants vibrated and made sweet, sweet nectar in response to pollinator sounds, they showed no response to random, higher-frequency noise. Scientific American, meanwhile, highlighted work from the University of Western Australia. Evolutionary biologist Monica Gagliano and her team put pea seedlings in pots with two “arms”, one led to a tray of water or plastic tube with water flowing inside, while the other led to dry soil. In all cases, the peas grew toward the water, suggesting they could “hear” it moving through the pipe. The Scientific American piece also pointed to a 2014 study that discovered the rock cress arabidopsis can tell the difference between blowing winds and chomping caterpillars. If it’s the latter, the plant pumps up its chemical toxin production to frustrate flora feeders. Why haven’t we heard about this until now? As noted by a study about the impact of sound on mung bean sprouts, investigating the effect of sound on plants has typically focused on noise outside the audible range (20-20,000 Hz). Leveraging more common noise levels and frequencies, the researchers found that sound intensity of 90 dB and frequencies of around 2,000 Hz “indicated that the sound wave can reduce the germination period” of mung bean sprouts and drive a “significant increase in growth.” As noted by Beyond Chemical Triggers: Evidence for Sound-Evoked Physiological Reactions in Plants, meanwhile, exposing rice to 0.8-1.5 kHz sound waves for one hour produced increased drought tolerance and stomatal conductance. And when crop plants such as pepper, cucumber, tomato and strawberry were exposed to 1,000 kHz sound, systemic immune responses occurred,specifically, “the Ca2+ ions influx cytosol from outside the plants membrane.” Researchers suggested that these ions may act as secondary messengers to help boost plant resistance to microbial pathogens. This also helps explain why the supposed success that comes from supplying plants a steady stream of classical, pop or rock music to promote growth are so hard to pin down scientifically, since plants aren’t normally exposed to the melodious strains of Beethoven or the prog-rock of Pink Floyd, it’s hard to garner reliable results. If plants can hear, should we also be paying attention to what they New research suggests that plants may emit ultra-sonic sounds in response to specific stimuli, such as a lack of water or their stems being cut. While there’s speculation here that insects may avoid stressed plants in favor of more mellow alternatives, that’s putting the stem before the stamen, there’s just not enough data yet to yield a clear conclusion. Still, there’s potential benefit to listening in, water-stressed plants appear to make louder sounds than their stem-cut companions. If further research bears out this observation, it could open the door to plant listening posts in commercial farming and greenhouse operations that would let growers pinpoint areas of potential drought to take appropriate action. ",
            "date": "Answered July 10, 2020",
            "views": "856",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marina Ritisha",
                "href": "/profile/Marina-Ritisha"
            },
            "answer_text": "When it comes to understanding the effects of music on plant growth, it appears that it isn’t so much about the “sounds” of the music, but more to do with the vibrations created by the sound waves. In simple terms, the vibrations produce movement in the plant cells, which stimulates the plant to produce more nutrients,this results in faster growth of plants. 1962, an Indian botanist conducted several experiments on music and plant growth. He found that certain plants grew an extra 20 percent in height when exposed to music, with a considerably greater growth in biomass. He found similar results for agricultural crops, such as peanuts, rice and tobacco, when he played music through loudspeakers placed around the field. A researcher in Illinois was skeptical that plants respond positively to music, so he engaged in a few highly controlled greenhouse experiments. Surprisingly, he found that soy and corn plants exposed to music were thicker and greener with significantly larger yields. Researchers at a Canadian university discovered that harvest yields of wheat crops nearly doubled when exposed to high-frequency vibrations. ",
            "date": "Updated July 24, 2020",
            "views": "618",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pradeep Shetty",
                    "user_href": "/profile/Pradeep-Shetty-324"
                },
                {
                    "user_id": "Amina Khatoon",
                    "user_href": "/profile/Amina-Khatoon-1"
                }
            ]
        }
    ]
}