{
    "title": "What Van Halen song had the best intro? - Quora",
    "tags": [
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Classic Rock Music",
        "Rock Music",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Mullaney",
                "href": "/profile/Mike-Mullaney-4"
            },
            "answer_text": "It’s gotta be the intro to the very first song, the mind-blowing start to RUNNING WITH THE DEVIL. The song was always a gem, but the famous intro was a crazy creation that had input from producer Ted Templeman, KISS star Gene Simmons as well as the band. Check out the original version WITHOUT the legendary intro.  Good, but not the punch to the gut intro the first song on a debut album deserves. So they experimented with an unusual sound to punch it up. The legendary noise at the beginning of the finished, masterpiece version is a collection of car horns. The horns were taken from the band’s own cars, including Alex’s Opel, Eddie’s Volvo, a Mercedes Benz and a Volkswagen. The horns were mounted in a box and powered by two car batteries, with a foot switch to turn them on and off. The same idea was first used during the band’s club sets and appeared on the Gene Simmons Demo on House of Pain, sounding after each verse. On the demo the horns also acted as a segue to Runnin’ with the Devil. When they got into the studio with master producer Ted Templeman, he reworked those horned to create a sound like an alien spaceship landing on Earth, much in the way the band was about to unleash a sound alien to rock before 1978. Listen to the incredible power of this insane sound, and how it screamed look at me as the greatest debut album in history launched into the 1st track of the record.  After the crazy horns run, they stop…and the song goes stark to the killer, ominous bass of Michael Anthony, followed by the pounding drums of Alex, then the incendiary guitar of Eddie, and finally the banshee wail of Diamond Dave. Each of the payers gets a quick moment to shine as it all explodes into the track. SO INCREDIBLE!!! ",
            "date": "Answered August 8, 2019",
            "views": "211",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darren Shea",
                    "user_href": "/profile/Darren-Shea-1"
                },
                {
                    "user_id": "Michael Uzar",
                    "user_href": "/profile/Michael-Uzar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "If you agree that it is an intro I'd say \"Eruption\" is a great intro to \"You Really Got Me\" on the first Van Halen album. I mean sure they gave it a title but still is it really a song on its own? Van Halen - Eruption/You Really Got Me - YouTube  ",
            "date": "Answered August 8, 2019",
            "views": "72",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Uzar",
                    "user_href": "/profile/Michael-Uzar"
                },
                {
                    "user_id": "Darren Shea",
                    "user_href": "/profile/Darren-Shea-1"
                }
            ]
        }
    ]
}