{
    "title": "What Kpop trends are you sick of? - Quora",
    "tags": [
        "Kpop Band",
        "Overrated Things or People",
        "Pop Music",
        "Trends",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Fox",
                "href": "/profile/Steven-Fox-176"
            },
            "answer_text": "The trend i am sick of is “SELECTIVE CANCEL CULTURE”  Bts member wearing crop top (Dont know which member)  Three Female idols wearing lgbtq supportive clothing  Hyunjin from loona wearing a BLM shirt. Right. The idols wearing these clothings is not a problem for me, and it shouldnt be for anyone else, but what i dissaprove of is the hypocritical comments. Everytime an male idol wears a crop top or a female idol wears an lgbtq shirt or similar, the photo gets shared everywhere, months on end, and people comment “shes an lgbtq queen”, “she chose to wear that, im glad she supports”, “_____ supports blm yall” “bts breaking gender barriers omg fuck toxic masculinity”. Here are some other pictures of idols  Bts member wearing an indigenous headress EDIT: I removed the jamaican hat and dreads, because it was a gift from a jamaican shop keeper, apparently These are pictures of the cultural appropriation that goes on in kpop. Suddenly when this happens, “its the stylist”, “dont blame the boys”, “they didnt choose to wear it”, etc etc. What needs to stop, is the hypocritical fans saying the idols are supportive when wearing a certain blm or lgbtq or crop top shirt, and talking about it for months on end, but when they are doing cultural appropriation or blackface, you blame the stylist. Which one is it then? Is it the stylist, or the idol? You cant choose whichever suits you best. Lets be real, your idol probably doesnt even understand whats on their “supportive” shirts, let alone care enough to pick it out, and style with the shirt. Fans will bash groups for things their praising their faves for. For example, the resting bitch face. Jennie is infamous for resting bitch face, and it isnt a bad thing it just means when your not using your face you look like your a bitch. Jennie has recieved alot of hate for it, being called rude, and got called a sore loser after ice cream lost and she wasnt using her face. Whereas some male idols have rbf too, but when they do rbf its labelled as “sexy and mysterious” I personally believe, that if you are going to call a group out for something, then do the same when your faves do it, or shut the fuck up. 90% of kpop fans dont care about blm and alot of homophobes in the fandom, they just want to cancel groups they dont like by calling them racist and homophobic, etc ",
            "date": "Answered October 30, 2020",
            "views": "64",
            "upvotes": " View 126 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Singh",
                    "user_href": "/profile/Divya-Singh-3362"
                },
                {
                    "user_id": "Suhani Gupta",
                    "user_href": "/profile/Suhani-Gupta-99"
                },
                {
                    "user_id": "Elle Maeda",
                    "user_href": "/profile/Elle-Maeda"
                },
                {
                    "user_id": "Anise Tatlin",
                    "user_href": "/profile/Anise-Tatlin-2"
                },
                {
                    "user_id": "Alex Bishop",
                    "user_href": "/profile/Alex-Bishop-110"
                },
                {
                    "user_id": "Tavia Ramkissoon",
                    "user_href": "/profile/Tavia-Ramkissoon"
                },
                {
                    "user_id": "Srijan Arora (सृजन अरोड़ा)",
                    "user_href": "/profile/Srijan-Arora-सृजन-अरोड़ा"
                },
                {
                    "user_id": "Geet Jain",
                    "user_href": "/profile/Geet-Jain-23"
                },
                {
                    "user_id": "Anna Daisy",
                    "user_href": "/profile/Anna-Daisy-7"
                },
                {
                    "user_id": "Maryam Asim",
                    "user_href": "/profile/Maryam-Asim-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annabel Richards",
                "href": "/profile/Annabel-Richards-7"
            },
            "answer_text": "I couldn’t imagine anything worse than training for years and years, putting your heart and soul into what you do, to just having a swarm of anti fans ruin everything you worked for. We’re all familiar with the strenuous and inhumane training kpop idols have to go through to get to be where they are. It’s something no ordinary person would be able to get through. But idols go through it because they know what will come out of the other side if they try hard enough. Unconditional love and support from adoring fans. All those endless nights of staying up late in the practice room to train, all those times they got yelled at by managers for making one tiny mistake, all those times they went to sleep in tears knowing they messed up, they knew it would all account for something. And most of the time, they do get that love they had wished for. I can imagine the joy and immense gratitude they must feel when they look over at the sea of fanlights at their concerts. They must know that each of those lights represents one person who loves and supports what they do and will stand by them through the thick and thin. Whenever idols cry at concerts because of the beautiful sense of accomplishment they feel, I cry with them. The connection between fan and idol becomes so raw and unscathed that it feels like we know each other personally. But all good things come with a price. A price some idols just can’t pay……..  The issue I want to talk about is something I wish I couldn’t use as an answer to this question. It is something I wholeheartedly wish I couldn’t call a “trend”, but have to because of how much I see it in kpop every day. And it is nothing other than excessive hate towards idols. I couldn’t imagine hating another human so much that you purposefully became hell-bent on breaking their spirit and wiping out all of their confidence. I couldn’t imagine wanting to tear another person down that badly. So why is it so prominent? Every day I see idols being faced with a wave of hurtful and toxic comments on social media because of just one simple action they did. As soon as they accidentally do something that could be seen as the slightest bit controversial they are suddenly attacked by malicious fans with no signs of stopping. Sometimes they are attacked for doing virtually nothing. So now, idols have to live in constant fear of being ridiculed. They have to live with a lingering feeling that they may be doing something wrong. The feeling is always there like a deadly disease. It’s impenetrable, it becomes part of them, and serves as a permanent reminder of the repercussions of what will happen if they step one toe out of line. Jennie from Blackpink may just be the most hated kpop idol in the industry for simply being a human.  She is criticised for having a “rude” personality when really, she is just more outspoken. YG also tries to give her a savage, “I’m a bad bitch” persona. While she has no choice but to go along with it, anti fans have taken it out on her. She was also ridiculed for her “lazy dancing”. There were a few videos that surfaced online of her dancing “lazily” but really, netizens failed to think of why she didn’t seem to be trying as hard. They instead just took to Twitter to hate on her without thinking about the logistics. Jennie is a human, just like the rest of us, so she too has bad days. And she could have been having a bad day that day. Maybe she was unwell or was deeply upset about something so she couldn’t perform to her best efforts. Yeri from Red Velvet is hated on for things she cannot control.  She was added into Red Velvet late and OT4 Reveluvs have hated on her relentlessly ever since. She was claimed to be “talentless”, “ugly”, “annoying”, “rude” and “a useless member to Red Velvet”. She was even getting death threats. She was accused of being an attention seeker when she was seen crying at Jonghyun’s funeral when really she was just mourning the death of her very close friend. She was a teenager when all of this was happening. Hwasa from Mamamoo is hated on for being a queen.  She is hated on for having more confidence than most people will ever have. Netizens accuse her of being “ugly” and “fat” because she does not exactly fit the idealic Korean beauty standards. She has never been interested in going on crazy diets to lose weight and instead speaks of how she loves her body the way it is. She is also accused of wearing outfits that are “too revealing”. Yes, she wears revealing outfits but she does so because she is proud of how she looks and doesn’t care what the haters will say. I think that is something that should be praised, not hated on. The list just goes on. Whenever idols do something that they are proud of, all their confidence is swept away and obscured by hate. It’s like they can never win.  I’ve dealt with this constant influx of antagonism myself, so I know how it feels. A couple of years ago, I had to do an oral presentation in front of my class. I have a bad stutter, so I was dreading this presentation. I hate talking in front of people because of how scared I am that they will judge me for the way I talk (I’m the only one with a stutter in my whole school). But it was for English, my best subject, so I was determined to do well despite the fact that public speaking was not my strong point. I put a ton of effort into writing my speech and spent weeks practising saying it while stuttering as little as possible. I put a ton of effort into that presentation, hours upon hours of hard work, until it was finally time for the presentation. By the end, I was proud of myself. I was beyond nervous no doubt and my leg was shaking the whole presentation. I had stuttered, but not as much as I normally would. The feeling of accomplishment I had afterwards was unbelievable. At lunch that day, I asked my friends how they thought I went. They were supportive, saying that they thought I sounded great. I asked if anyone in the audience was laughing at me because I hadn’t really scrutinised everyone’s faces as I was speaking. I noticed that their faces suddenly looked crestfallen, so I asked what the problem was. After a lot of persuasion, they admitted to me that more than half the class had been trying not to laugh at me the whole time, and a few girls up the back were mimicking the way I spoke the whole time. And after the presentation when it was lunchtime and I was somewhere else, they were all laughing about how I sounded at the lockers. I was so disconcerted after that that the whole feeling of accomplishment I had was suddenly gone. I began to not think of all the good things I did in the presentation, but rather all the times I stuttered. And suddenly I didn’t think I did anything good anymore. It hurt that people were so quick to make fun of something I couldn’t help but do. I couldn’t control my stutter. And my sobby story that hurt me more than anything else could at the time is nothing compared to the hate kpop idols get. What my classmates did to me wasn’t even to my face, but kpop idols get hate comments sent directly at them. I can’t imagine what they must feel.  So I ask now, why is this wave of hate necessary? It pains me to know that so many people find satisfaction in tearing idols down. It hurts to know that people know the damage that their words are causing to an idol’s mental health, but choose to do nothing about it. How can you be so cold-hearted? You may think that posting one toxic comment on social media may be harmless but in the long run, it could have more repercussions than you could ever think of. Each of those seemingly “tiny” comments can come together to create something bigger. Something that is slowly but surely crumbling an innocent person’s spirit. A person who’s only intentions are to do nothing but simply just make good music that people enjoy. This whole hate bandwagon is visible outside of kpop as well. It is a normal emotion to dislike someone, but all negative emotions like that should be kept bottled up inside us and not let out to the world to do their damage. The person you are directing them to has normal emotions too, and they deserve to have those emotions treated just as well as you do. And you don’t know what that person is going through when you direct hate to them. We don’t know what Jennie was going through during the lazy dancing scandal, so why did so many people give her hate? But a positive comment can go a long way as well. The good things hold just as much meaning as the bad things. If you go onto social media and post a positive comment, that will have just as much impact as a toxic comment. You could brighten an idol’s day with that comment. With this unhealthy torrent of hate comments each of them receive from anti fans and sometimes even their own “fans”, a positive comment will brighten their day. It will let them know that they still have kind fans who appreciate them and love what they do. I think that role of being the kind person is much more favourable than playing the villain. And thankfully, most idols have more good fans that anti fans. And we constantly have to remind them that they still have people who will support them unconditionally. Sometimes the hate gets so overpowering that they forget that there are still people who support them. They should never have to think that. So next time you go to post a toxic comment think again. Your words have power. Power that can hurt someone. But also power that can love. And that is what we should be using the power for.   And now we in a zone~ ~Annabel~ ",
            "date": "Updated September 14, 2020",
            "views": "166",
            "upvotes": " View 472 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Ko Kora",
                    "user_href": "/profile/Ko-Kora"
                },
                {
                    "user_id": "Betsy Rebecca",
                    "user_href": "/profile/Betsy-Rebecca-1"
                },
                {
                    "user_id": "Melody Myers",
                    "user_href": "/profile/Melody-Myers-27"
                },
                {
                    "user_id": "Choi Seunghyun",
                    "user_href": "/profile/Choi-Seunghyun-8"
                },
                {
                    "user_id": "Lijia Lin",
                    "user_href": "/profile/Lijia-Lin-4"
                },
                {
                    "user_id": "Xu Jiaqi",
                    "user_href": "/profile/Xu-Jiaqi-10"
                },
                {
                    "user_id": "Johannes Acuna",
                    "user_href": "/profile/Johannes-Acuna"
                },
                {
                    "user_id": "Anuja Raja",
                    "user_href": "/profile/Anuja-Raja-1"
                },
                {
                    "user_id": "Nir Harpaz",
                    "user_href": "/profile/Nir-Harpaz-1"
                }
            ]
        }
    ]
}