{
    "title": "What is the present condition of syria? - Quora",
    "tags": [
        "Politics of Syria",
        "Syrian Civil War (2011–present)",
        "Syria",
        "United Nations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaurav Dutta",
                "href": "/profile/Gaurav-Dutta-8"
            },
            "answer_text": "The war in Syria has gone on for more than six years and has claimed the lives of more than a quarter of a million people. It is being fought between soldiers who support the president of Syria, Bashar al-Assad, and a group of fighters known as rebels, who don't want him to be in power anymore. How did it all start? The trouble began in 2011 in the Syrian city of Deraa. It began because local people decided to protest after 15 schoolchildren were arrested - and reportedly tortured - for writing anti-government graffiti on a wall. The protests were peaceful to begin with, calling for the release of the children, democracy and greater freedom for people in the country. The government responded angrily and, on 18 March 2011, the army opened fire on protesters, killing four people. The following day, they shot at mourners at the victims' funerals, killing another person. People were shocked and angry at what had happened and soon the unrest spread to other parts of the country. At first, the protesters just wanted democracy and greater freedom. But after government forces opened fire on peaceful demonstrations, people demanded that President Bashar al-Assad resign. However, he refused to do this which made the protesters extremely angry. President Assad still had a lot of people in Syria that supported him and his government, so they began to fight against people who were against the government. In July 2012, the International Red Cross said the violence in Syria had become so widespread that it was in a state of civil war. Who are the rebel fighters? There isn't one single group of rebels fighting against President Assad and the government's army. The group who want the president to step down - called the opposition - is made up of several kinds of people. These include groups of rebel fighters, political parties who disagree with Assad, and those living in exile who cannot return to the country. It is thought there could have been as many as 1,000 different groups opposing the government since the conflict began, with an estimated 100,000 fighters. Is there anyone else involved? The crisis in Syria has become more than just a war between people who are for or against President Assad. In 2014, a group that calls itself Islamic State (IS) began to take over large areas of a country called Iraq next door to Syria.  What is the group that calls itself Islamic State? IS is a militant group with extreme, violent views, which has used this violence against anyone who doesn't agree with what they think. They have also persecuted other groups, including Christians and Yazidis. They moved into eastern Syria and, in the chaos of the war, they were able to gain land and power there too. Now, both Assad's forces and the rebels are having to fight a separate battle against IS at the same time. To try to stop IS,. These attacks are known as airstrikes. Just over a year later, UK MPs voted in favour of military action against IS in Syria too. The first airstrikes were carried out by RAF Tornado jets within hours of the vote in the House of Commons. What has been the impact of the war on people living in Syria? Millions of ordinary people living in Syria have had to escape from their homes to find somewhere safer to live. According to the United Nations (UN), a group that works to try to solve some of the world's problems, almost five million Syrians have had to leave the country. Many have gone to neighbouring countries, like Jordan, Lebanon, Turkey or Iraq. Six million more people have tried to find safety elsewhere in Syria. Lots of children can no longer go to school because their schools have been destroyed or there are no teachers where they have moved to. When people are forced to leave the country where they live like this, they become known as refugees. The conflict in Syria has caused one of the largest refugee movements in recent history. Many refugees made the decision to try to reach Europe. This is because some countries in Europe said they would accept refugees who wanted to start a new life here.  From Syria to Sweden - Kava's story Millions of people both inside and outside Syria are in desperate need of help, but aid agencies say that getting help to people inside the country is very difficult and dangerous. What else do we need to know about this war? One other topic that has been talked about a lot is the use of chemical weapons.  What are chemical weapons? There is an international law which bans countries from using chemical weapons in wars, as they are deemed too cruel to use on other people. However, in August 2013, it was reported that they were used in the war in Syria, which caused anger around the world. Both the rebels and the Syrian government denied that they were responsible. MPs in Westminster voted against responding to this with military action in Syria. But the US and French governments discussed limited missile strikes against military targets. In September 2013, Russia and the US reached an agreement which said the Syrian government should give up its chemical weapons and destroy them so they can never again be used. This was important as Russia and the US support different sides in the Syrian war. The process of destroying the weapons began in October 2013and the people working on this project were awarded the Nobel Peace Prize later that month. Image captionUN chemical weapons inspectors in Syria But in April 2017, there was reportedly another chemical weapons attack on a town in north-west Syria, which killed and injured many people. Many weapons experts, the UK and other countries, and US President Donald Trump have said President Assad's government was to blame for the attack. But the Syrian President says he didn't do it and Russia, which supports him, said it was the result of aircraft hitting chemical weapons on the ground, which belonged to the rebels. The US has responded with military action by carrying out missile attacks on Syria, which the UK has said it supports. So what next for Syria? It doesn't look like the fighting is likely to end any time soon. There is a stalemate between the two sides. This means that the government forces and the rebel groups are unable to defeat each other or agree on the future. Lots of countries are trying to continue to supply aid, such as food and emergency supplies. The rest of the world will continue to try to work out if there is a way to help Syria achieve peace. But for the time being, the conflict continues. ",
            "date": "Answered April 17, 2017",
            "views": "37",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Velan Dsilva",
                    "user_href": "/profile/Velan-Dsilva-1"
                },
                {
                    "user_id": "Ekansh Puri",
                    "user_href": "/profile/Ekansh-Puri"
                },
                {
                    "user_id": "Isha Rane",
                    "user_href": "/profile/Isha-Rane-7"
                },
                {
                    "user_id": "Deepak Singh",
                    "user_href": "/profile/Deepak-Singh-633"
                },
                {
                    "user_id": "Aditya Sharma",
                    "user_href": "/profile/Aditya-Sharma-2056"
                },
                {
                    "user_id": "Janindu Shalithra Galagama",
                    "user_href": "/profile/Janindu-Shalithra-Galagama"
                },
                {
                    "user_id": "Ray Thabiso",
                    "user_href": "/profile/Ray-Thabiso"
                },
                {
                    "user_id": "Dhruvik Pankaj Shah (ध्रुविक पंकज शाह)",
                    "user_href": "/profile/Dhruvik-Pankaj-Shah-ध्रुविक-पंकज-शाह"
                },
                {
                    "user_id": "Yifu Ou",
                    "user_href": "/profile/Yifu-Ou"
                },
                {
                    "user_id": "Yashvardhan Ojha",
                    "user_href": "/profile/Yashvardhan-Ojha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmed Ismail",
                "href": "/profile/Ahmed-Ismail-236"
            },
            "answer_text": "The present condition in Syria, on 13 Sept. 2018, is all around Idlib. Assad has basically gained control over the entire country, with the help of Russian and Iranian forces, with the exception of Idlib, the last “rebels” and terrorists(in fact, both are the same) stronghold.Russia has been warning for over a couple of weeks that a chemical attack will be staged by the White Helmets, and acknowledged the normalcy for Assad to launch an attack on terrorists Russia backs Syria’s right to start its final battle, but Germany warns of “catastrophe”. The U.S., however, has been warning that Assad will do it and “use chemical weapons,” and is insisting that Assad doesn’t attack Idlib, a terrorists stronghold!!! You know why?! The irony is, Assad has actually gave up his chemical stockpile in 2014, BY THE HELP OF THE U.S. Last of Syrian chemical arms removedThe U.S. has been illegally increasing its military presence in Syria, including the sea, and is also conducting illegal exercises in Syria’s territorial waters:US destroyer arrives in Mediterranean as Syria tensions rise &US forces conduct live-fire exercise in Syria in warning to Russia. Of course, the puppet in the White House, Donald Trump, after saying he ‘wants’ to “pull out” of Syria a few months ago (WH: Trump Wants US Forces Out of Syria as Soon as Possible), is now saying the U.S. will have an indefinite presence in Syria: Trump OKs indefinite US presence in Syria.Syria as a sovereign nation wants to attack these terrorists and regain control. The U.S., the UK, France, and Israel, however, are insisting on protecting their dear ones: The U.S., U.K. and France are planning an attack on Syria. Can Russia and Iran stop them?&France warns attack on Syria’s Idlib would pose HUGE security threat to Europe In fact, Nikki Haley has made it clear in the UN that any chemical attack done will be done by Assad—she had already stated it as a fact, even though there’s absolutely NO evidence that Assad has ever used chemical weapons and Mattis, U.S. Secretary of Defense, has said there’s NO evidence, Mattis: Still no evidence on Syria chemical attack, but I believe there was one&Pentagon admits NO evidence of chemical attack in Syria, relying on ‘social media’ Haley has also, protecting terrorists, threatened that after any chemical attack, which will actually be staged by the “White Helmets” (potential terrorists), of whom Israel has evacuated 442 members the last month Inside the secret mission to rescue Syria's White Helmets&Inside Israel's secret and unprecedented rescue of Syria's White Helmets—and is mainly sponsored by the MI6—the U.S. will attack the Syrian army: ‘Don’t test us’: Haley threatens US strikes over any attack on Syria’s Idlib. Additionally, along with the big belly called Pompeo, Nikki has warned Iran and Russia of “dire consequences” shall they attack Idlib along with Syria’s army: Haley warns Russia, Iran of 'dire consequences' over Syria military assault Israel is, indeed, intensifying arms supplies to its dear ones, as it did before: Israel secretly armed and funded 12 Syrian rebel groups, report says in an operation called “Operation Good Neighbor.” Lol!!While the U.S. and UK propaganda machines are at their zenith for selling out wars and lies and false flag attacks (CNN: US backed forces begin Syria battle for ISIS' last redoubt — BBC: Last IS pocket in east Syria under attack, The Independent: UN says Syrian forces used chemical weapons as they warn against Idlib 'massacre'), the MI6 is taking the lead in supplying chemicals to the “rebels.” In fact, a sincere U.S. senate has said that a chemical attack is being staged by MI6: US senator claims Britain's MI6 is planning a fake chemical weapons attack on SyriaIndeed, the U.S., once the “chemical attack” is done, will attack Assad, directly intervening with its illegal military forces in Syria rather than proxies to hunt him down, since basically all the ways to bring him down have failed so far. Russia and Turkey, just like the U.S., are intensifying their presence in Syria. However, everybody has his own presence and will put his forces in a different place. Turkey, for instance, is reinforcing its forces Northern Idlib, probably to give medical aid to any terrorists if wounded: Turkey reinforces military in Syria's Idlib after ceasefire call fails&Turkey is secretly undermining Russia and Iran by arming rebel groups in Syria, report claims Russia, on the other hand, is intensifying its forces left, right, and center—around Damascus and around Syria as a whole: Russian Forces Flood Into The Med Ahead Of Syrian Offensive, Here's Everything You Need To Know&Russia to hold major drills in Mediterranean off Syria as UN warns of 'perfect storm'The UN, as usual, is doing its avg job of…warning about civilian casualties and death: UN warns of threat to Syrian civilians&The Latest: UN chief: A 'bloodbath' must be averted in Idlib.Germany, for the first time, has said it will not “walk away” if Assad “attacked his own civilians,” and Merkel, along with EU leaders, has launched some sternly worded statements: Merkel Says Germany Can't Look Away if Assad Uses Chemical Weapons&EU urges to remain tolerant to avoid atrocities in Syria's IdlibAs a consequence of Western intervention, an innocent civilian population in Idlib is literally on the brink of starvation and in the crossfire. Meanwhile, key western ally MBS has been bombing the shit out of Yemen, and the U.S. is clapping its hands: Yemen war: 'Nowhere left to hide' for 400,000 trapped in Hodeidah&U.S. Stands By Saudi Arabia, Despite Criticism Over Civilian Casualties In YemenThe question is, Assad has now won the war technically—why would he use chemical weapons, especially when he knows the U.S. will attack him??? Makes me wonder. Everyone takes the news with joy and thinks, “F**k it.” It’s becoming more fun to watch than PARKS AND RECREATION. Lol. ",
            "date": "Updated November 4, 2018",
            "views": "42",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Deangelis",
                    "user_href": "/profile/Michael-Deangelis-14"
                },
                {
                    "user_id": "Sakib Hassan",
                    "user_href": "/profile/Sakib-Hassan-29"
                },
                {
                    "user_id": "Usman Khan",
                    "user_href": "/profile/Usman-Khan-1308"
                },
                {
                    "user_id": "Mark Crowther",
                    "user_href": "/profile/Mark-Crowther-5"
                },
                {
                    "user_id": "Imran Roy",
                    "user_href": "/profile/Imran-Roy"
                },
                {
                    "user_id": "Dhruvik Pankaj Shah (ध्रुविक पंकज शाह)",
                    "user_href": "/profile/Dhruvik-Pankaj-Shah-ध्रुविक-पंकज-शाह"
                },
                {
                    "user_id": "Prasham Doshi",
                    "user_href": "/profile/Prasham-Doshi-2"
                },
                {
                    "user_id": "Askander Mirza",
                    "user_href": "/profile/Askander-Mirza-1"
                },
                {
                    "user_id": "Imran Khan",
                    "user_href": "/profile/Imran-Khan-9633"
                },
                {
                    "user_id": "Yashvardhan Ojha",
                    "user_href": "/profile/Yashvardhan-Ojha"
                }
            ]
        }
    ]
}