{
    "title": "What are some music themed Korean dramas? - Quora",
    "tags": [
        "Theme Music",
        "Television Dramas (Asian)",
        "Korean Dramas",
        "Drama (genre)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cindy Odoc",
                "href": "/profile/Cindy-Odoc"
            },
            "answer_text": "Here is a short list of some music themed K-Dramas: YOU’RE BEAUTIFUL (2009) The series follows fictional musician band, A.N.JELL and how the relationship between its members changes when a girl posing as her twin brother joins the band. The story revolves around the life of its band members and involves a love triangle. Starring: Jang Keun-suk, Park Shinhye, Jung Yonghwa of CN Blue, Lee Honggi of FT Island 2. DREAM HIGH (2011)  Six students at Kirin High School share dreams of becoming K-pop idols, among others. During their school years, they learn how to develop their singing, songwriting and dancing skills while undergoing personal growth. They also start to develop feelings for one another. Each of them has their own strengths and weaknesses, but they strive to debut with the support and guidance of one another. Starring: Miss A’s Bae Suzy, Kim Soo-hyun, T-ara’s Ham Eun-jung, IU, 2PM’s Ok Taecyeon and Jang Wooyoung 3. DREAM HIGH 2 (2012)  Kirin High School of Art has been taken over by Oz Entertainment because of financial bankruptcy. Oz Entertainment then transfers over its own idol stars to Kirin High to avoid a law requiring under age entertainers to study for a set time. Competition then brews between troubled students at Kirin High School of Art and then newly transferred idols from Oz Entertainment. Starring: Kang Sora, GOT7’s JB and Jinyoung, 2AM’s Jinwoon, T-ara’s Jiyeon, SISTAR’s Hyolyn, Park Seojoon 4. THE LIAR AND HIS LOVER (2017)  A love story about a heartbroken genius music composer Kang Han-gyul (Lee Hyunwoo) who meets the talented singer and student Yoon So-rim (Joy) whilst he’s living under a hidden identity. With her courageous honesty and beautiful singing, So-rim draws Han-gyul back to her time and time again. Along the way the two meet obstacles as So-rim starts her career in the music industry and begins to uncover Han-gyul’s lies. Starring: Lee Hyunwoo, Joy (Park Sooyoung), lee Jungjin, Lee Seowon, Hong Seoyoung 5. HEARTSTRINGS (2011)  Kyu-Won (Park Shinhye) is a bright girl and a highly skilled gayageum player. She is in the Korean traditional music department. Kyu-Won also comes from a family who has one of the three best pansori singers in the world. Shin (Jung Yonghwa) is a cold and refined young man, while being a highly skilled guitarist. He is in the applied music department. They come from different family backgrounds and have an argument, but then start to like other. Starring: Park Shinhye, Jung Yonghwa of CN Blue 6. SHUT UP FLOWER BOY BAND (2012)  Byung Hee is the crazy, free-spirited leader and vocalist of the popular underground rock group, Eye Candy. Joining him is mood-maker Ji Hyuk, chic Hyun Soo, playboy Ha Jin, silent Do Il and baby-faced Kyung Jong. These boys rule their school until a redevelopment plan forces the delinquent-ridden school to close down. They're all assigned a transfer to Jung Sang High, but debate whether it's even worth returning to high school at all. However, due to an outside confrontation with Jung Sang's current ruling band, Strawberry Fields, Eye Candy decides to attend Jung Sang out of spite and rule the school once again. Starring: Sung Joon, Jo Bo-ah, L, Jung Eui-chul, Lee Hyun-jae, Yoo Min-Kyu, Kim Min-seok 7. ENTERTAINER (2016)  It’s about the assembling of a ragtag band (as in, musical group). The character Ji Sung is up for was once a manager at an agency handling the nation’s top singers, and is now the CEO of an agency repping the most pathetic rookies. Through various struggles and incidents, he’ll learn to become “a genuine manager,”. Starring: Ji Sung, Lee Hyeri, Kang Minhyuk, Chae Jung-an 8. EXO NEXT DOOR (2015)  Ji Yeon-hee (Moon Ga-young) is an extremely shy, introverted 23-year-old girl with zero dating experience and a tendency to blush when talking to someone she likes. One day, four young men move into the house right next door to Yeon-hee's home, and to her surprise, they turn out to be Chanyeol (Park Chanyeol), D.O. (Do Kyungsoo), Baekhyun (Byun Baekhyun) and Sehun (Oh Sehun) from her favorite boy band Exo, who are looking to lay low for a while. They hire her to clean their house part-time during the winter vacation and that's when Yeon-hee found out that Chanyeol was her long lost childhood friend and crush \"Chan\" and that he is the grandson of the house owner. As the story goes on, Yeon-hee soon becomes involved in a love triangle with Chanyeol and D.O. Starring: Moon Ga-young and members of the K-pop boy band Exo 9. BEETHOVEN VIRUS (2008)  Kang Gun-woo (or Kang Mae) is a world-renowned orchestra maestro who is a perfectionist in his work. He is not an easy person to work with and is feared by all his players. By chance, he comes across Du Ru-mi, a violinist, and a young cop who has the same name as his and discovers that even without formal training, the young Kang is a music genius. The three soon get tangled in a love triangle as Kang Mae attempts to salvage a local orchestra. Starring: Kim Myung-min, Lee Ji-ah, Jang Keun-suk 10. YOU ARE TOO MUCH (2017)  The series revolves around a Yoo Ji-na impersonator who calls herself “Yoo Gina”. The real Yoo Ji-na was a pop diva who lived life to the fullest and one day, she becomes involved with her impersonator called “Yoo Gina” and their two lives become intertwined. Yoo Ji-na lives a glamorous life but she also harbors a personal tragedy that pains her deeply. Then there is “Yoo Gina” who works as an impersonator to eke out a living but wants to become a real singer herself. Starring: Uhm Junghwa, Jang Heejin, Kang Tae-oh 11. TOP MANAGEMENT (2018)  The story centers on Eun-sung, a former girl idol trainee with the power to foresee the future, who becomes the manager of the aspiring, but struggling, boy idol group \"S.O.U.L.\" Starring: Seo Eunsoo, Ahn Hyoseop, Cha Eunwoo ",
            "date": "Answered November 26, 2019",
            "views": "492",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Riwa Routray",
                    "user_href": "/profile/Riwa-Routray-1"
                },
                {
                    "user_id": "Reena Rajak",
                    "user_href": "/profile/Reena-Rajak"
                },
                {
                    "user_id": "Akshay",
                    "user_href": "/profile/Akshay-707"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maica Sherman",
                "href": "/profile/Maica-Sherman"
            },
            "answer_text": "The first ones that come to mind are “DreamHigh” and “Dream High 2”   I love the cast and there are some great scenes in “Dream High” but it isn’t the deepest series, nor is the OST the most incredible I have heard. It is similar to “Fame” in that it is about kids attending a music school. The biggest trials are trying to compete in the music industry and love triangles. It isn’t the best drama I have seen, but I think it is still worth watching. Bae Suzy and Taecyeon are in this one, too.  The sequel is not even a quarter as addictive or interesting as the first, although it should be. Whereas most films feature the performers, it is rare that we get to examine the people who compose it and/or write the lyrics. We are also meant to examine other genres like rock. Although it has some fantastic ideas, the script and plot is lacking- other than all of the parts with Hyorin/Hyolyn in it. If you haven’t listened to SISTAR or any of Hyolyn’s music, check it out. Her vocals are incredibly beautiful and husky. Ailee is also featured here, too. “Dream High” and “Dream High 2” are meant to be romcom/inspiring dramas. My personal favourite is the film “Highway Star”  It is an older comedy/drama about a singer from a metal band that tries out for the “Trot” genre. Think karaoke synthesized-style music, sequined tuxes, slow music with lots of vibrato.  He is so ashamed, he hides behind a luchador mask when he competes for the part, and so it begins. For Japanese dramas, I have watched “Nodame Cantabile” which I would NOT recommend. The music is incredible, but the drama is awful- a lot of over the top comedy with a wailing heroine, a perverted conductor and an arrogant love interest that punches her. A lot of beautiful classical music though, and a glimpse into the life of trying to get into the orchestra. The best film though is “Linda, Linda, Linda”   It is a slow-paced, Japanese film about a group of girls performing a song for their school’s talent show. It is a slice-of-life film that is more about the every-day memories of high school, but the band it covers is phenomenal - The Blue Hearts.  That is it for the ones I have watched, but I found this: 7 Inspirational Characters From K-Dramas About The Music Industry (A list from Soompi) as well as a list from Spinditty: 13 Best Korean Musical Dramas That You Must Watch It mentions “Monstar” which a lot of Kdrama fans have recommended, but I haven’t watched yet. Good luck and happy viewing! ",
            "date": "Answered February 18, 2019",
            "views": "957",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlotte Lote",
                    "user_href": "/profile/Charlotte-Lote-1"
                },
                {
                    "user_id": "Jade Kim",
                    "user_href": "/profile/Jade-Kim-69"
                },
                {
                    "user_id": "Jake Coleman",
                    "user_href": "/profile/Jake-Coleman-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irene Jim",
                "href": "/profile/Irene-Jim-2"
            },
            "answer_text": "To be honest I haven’t come acroos many dramas that showed the music genre, but here area few. Dream High  Thia is such a classic drama that I think all kdrama fans should watch in general, not just because it’s music themed. It’s set in an arts school that trains students in various things like singing or dancing so they can become the stars of the entertainment world. This drama shows the hardships of the students, the romance between them and how they all mature through out it. Moreover, the teachers at the school are heavily involved making it even more interesting. You’re beautiful  This series is all about a band who has gets an additional member but what they don’t know the member’s twin sister is posing as him. It’s hystrical to see band members confusion when they start developing weird feelings to her and start to question heir sexuality!! Honestly, I’m sure anyone will love this drama. Cheer up!  Not going to lie this one is not really focused on music and is really more about dance but since dance and music are somewhat similar topics I thought it’d make a great addiotion to the list, especially since it’s phenomenal. This drama shows the story of how the students at a school are discriminated against based on their status and grades. Even though it’s such a heavy topic, the series gives the message in a light and cheerful way which is why I recommend it 100%. ",
            "date": "Answered January 28, 2020",
            "views": "360",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jordan Lubus",
                    "user_href": "/profile/Jordan-Lubus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himani Reddy",
                "href": "/profile/Himani-Reddy"
            },
            "answer_text": "Well, you might have asked the right person! :D Since, i don’t know which dramas you’ve watched, so i’ll be dumping all the names here for your future references as well and probably in no particular order. HeartstringsI love it. 2. My lovely girl It has rain (the singer ;)) in this. The plot is kind of sad and slightly twisted, but the drama is nonetheless great. 3. Nodame cantabile (Japanese) Apparently, there is a Korean remake to this drama called *cantabile tomorrow* but i’d still suggest one to watch the Japanese version. It’s literally the perfect adaptation of manga, including all the of extremely dramatic and over-expressive comic panels. 4. Dream High 1 & 2 There is a sequel to this drama, the first one should have been definitely amazing. You can blindly go by that principle, when dramas have sequels. :p 5. The liar and his lover My favorite. 6. You are beautiful 7. Top Management 8. Shut up flower boy band 9. Entertainer 10. Mary stayed out all night 11. Producers & High end crush (Short/Web drama) They slightly fall under this category too, i suppose. P.s: After all, i did follow some particular order. ;) And i might come back, edit and re-edit, in case i find something that is worth mentioning. :) ",
            "date": "Answered February 1, 2020",
            "views": "308",
            "upvotes": " Answer requested by Jake Coleman",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Jessica Igarashi",
                    "user_href": "/profile/Jessica-Igarashi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jae Lee",
                "href": "/profile/Jae-Lee-13"
            },
            "answer_text": "You’re Beautiful  K-pop Extreme Survival  Monstar  Full House Take 2  Orange Marmalade  The Suspicious Housekeeper - ( Not fully music related, but some parts are music related!)  Dream High  Dream High 2  Mary stayed out all night  Heartstrings  Shut up Flower Boy band  The Producers  I am Legend  Thirty but Seventeen - (Some aspects of this drama contains music!)  Page Turner  Ma Boy  Naeil’s Cantabile  ",
            "date": "Answered February 19, 2019",
            "views": "319",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Helena Rachel",
                    "user_href": "/profile/Helena-Rachel"
                },
                {
                    "user_id": "Denny Mack",
                    "user_href": "/profile/Denny-Mack-3"
                },
                {
                    "user_id": "Teleri Ferch Nyfain",
                    "user_href": "/profile/Teleri-Ferch-Nyfain"
                },
                {
                    "user_id": "Favor Mulalira",
                    "user_href": "/profile/Favor-Mulalira"
                },
                {
                    "user_id": "Dhara DeVane",
                    "user_href": "/profile/Dhara-DeVane"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlotte Lote",
                "href": "/profile/Charlotte-Lote-1"
            },
            "answer_text": "Music themed Korean Drama's: The MusicalDream HighDream High 2Heartstrings *(recommended)The liar and his lover *(recommended)Trot LoversI Am LegendBeethoven Virus *(recommended)Shut Up Flower Boy BandMary Stayed Out All NightKPop The Ultimate Audition- TV ShowMonstar- TV ShowCantabile Tomorrow *(recommended)EntertainerMy lovable girl*The above list is in no order whatsoever* ",
            "date": "Answered July 4, 2019",
            "views": "191",
            "upvotes": " Answer requested by Jake Coleman",
            "upvoters": [
                {
                    "user_id": "Jake Coleman",
                    "user_href": "/profile/Jake-Coleman-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uniy Mox",
                "href": "/profile/Uniy-Mox"
            },
            "answer_text": "Dream highDream high 2The liar and his lover/ lovely love lieYou're beautifulHeartstringAmong the dramas I watched those are the ones which are fully themed music dramas and not just some part of it (I'm talking about high school musical level)….if you want ones that are partially music themed there are many like The best hit, modern farmer, the producers etc ",
            "date": "Answered April 15, 2019",
            "views": "172",
            "upvotes": " Answer requested by Jake Coleman"
        },
        {
            "author_info": {
                "name": "Zarah Macabinquil",
                "href": "/profile/Zarah-Macabinquil"
            },
            "answer_text": "Hmm.. Beethoven VirusNae Il’s Cantabile (kver of Nodame Cantabile jdorama)dream highShut up Flower boy bandHeartstringsEntertainerMary Stayed Out All NightYou are BeautifulMonstarI am LegendTrot LoversKpop Ultimate AuditionThe MusicalWhat’s UpThe Liar and His Lover (kver of LA jmovie Kanojo wa Uso o Aishisugiteru )Five Fingers",
            "date": "Answered July 14, 2019",
            "views": "96",
            "upvotes": " Answer requested by Jake Coleman"
        },
        {
            "author_info": {
                "name": "Mingyun Seo-Bang",
                "href": "/profile/Mingyun-Seo-Bang"
            },
            "answer_text": "Dream High. Monstar. You're Beautiful. Heartstrings. Shut Up Flower Boy Band. I'm sure there are more but these are all I can think of at the moment. ",
            "date": "Answered July 15, 2019",
            "views": "25",
            "upvotes": " View 5 Upvoters "
        },
        {
            "author_info": {
                "name": "Valerie Kubiak",
                "href": "/profile/Valerie-Kubiak"
            },
            "answer_text": "Some more to add on from Susan’s answer: What’s Up (my personal favorite music-themed drama. My second favorite was already mentioned by Susan: Shut Up Flower Boy Band.)Full House 2 (watching Full House 1 is not necessary)Cheer Up!Heartstrings",
            "date": "Answered February 18, 2019",
            "views": "113",
            "upvotes": " Answer requested by Jake Coleman"
        },
        {
            "author_info": {
                "name": "Syemylona Ishak",
                "href": "/profile/Syemylona-Ishak"
            },
            "answer_text": "Dream High It is a high rating drama starring the talented actors & singers including IU, Bae Suzy, Ok Taec Yeon (2PM), Woo Young (2PM), Kim Soo Hyun, Ham Eun Jun. The drama is about the struggles the students encountered in becoming an idol. This drama was so huge and they even have concerts in Seoul & Japan. The drama also have a second season but with a different cast.  ",
            "date": "Answered February 18, 2019",
            "views": "192",
            "upvotes": " Answer requested by Jake Coleman"
        },
        {
            "author_info": {
                "name": "Susan Yama",
                "href": "/profile/Susan-Yama"
            },
            "answer_text": "A small list of the dramas I’ve watched that are musically themed: Dream High 1 & 2Shut Up Flower Boy BandYou’re BeautifulAbout Time (The musical part isn’t the central theme though but it’s still there)",
            "date": "Answered February 18, 2019",
            "views": "103",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Maria Tolentino",
                "href": "/profile/Maria-Tolentino-5"
            },
            "answer_text": "Watching and subtitling one right now: When the Devil Calls Your Name There's also “My Lovely Girl” which stars Rain and Krystal, and the best, “Five Fingers, “ which stars Joo Ji Hoon and Ji Chang Wook. Oh, and before I forget, “Hymn of Death” which stars Lee Jong Suk, is another one. ",
            "date": "Answered August 20, 2019",
            "views": "52",
            "upvotes": " Answer requested by Jake Coleman"
        },
        {
            "author_info": {
                "name": "Trsevestark Osborne Luther",
                "href": "/profile/Trsevestark-Osborne-Luther"
            },
            "answer_text": "When the devil calls your name     I absolutely love this drama and its ost, its AMAZing. The title and the trailer may seem scary but trust me i found the drama funny and heartwarming.I feel like this drama is unique and beautiful. Genre : Fantasy, melodrama, supernatural Year : 2019 Episodes : 16 The series is about a man who sold his soul to a devil ten years ago to obtain fortune and fame. As his contract is soon to expire, he tries to make a deal with the devil using his life as collateral. ",
            "date": "Answered September 3, 2020",
            "views": "99",
            "upvotes": " View Sharers"
        }
    ]
}