{
    "title": "What is the ideal girl of Taehyung? - Quora",
    "tags": [
        "Kim Taehyung (BTS Member)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reem Elkelish",
                "href": "/profile/Reem-Elkelish"
            },
            "answer_text": "Well, I’ve read and heard a bunch of things so there’s not entirely an ultimately clear answer to TaeTae’s ideal girl. But here are some of the things he’s mentioned as well as the members: *He stated that he likes a girl that is charismatic and is a little bit stingy, he likes a girl that is thrifty and can spend his money well without going crazy and buying what is only needed and affordable. As well as showing him a thing or two if he spends his own money unwisely. *He also stated that he’d like a girl that’d take care of him and is a thoughtful person since he doesn’t do much thinking (hahhaha this boy! Seriously!). *Also style wise, he’d like a girl that is very laid back in clothing, like ripped jeans and a baggy t-shirt, something that resembles his own style. *I personally think that V’s very family oriented so that’s why another characteristic he’d like in a girl would be that she is also that way, that she will give everything to her parents and to his parents as much as she can. But, OVERALL, since V is just a ball of quirkiness and young, his ideal girl type changes ALL the time as RM mentioned before in an interview, he never truly has one staple, it changes with the seasons and that is SO fitting for his personality. Or at least what we think we know about his personality. He’s not my bias! But I love this boy!! <3 ",
            "date": "Answered September 12, 2018",
            "views": "346",
            "upvotes": " View 69 Upvoters",
            "upvoters": [
                {
                    "user_id": "Disha Sangtani",
                    "user_href": "/profile/Disha-Sangtani-1"
                },
                {
                    "user_id": "Camryn Harrah",
                    "user_href": "/profile/Camryn-Harrah"
                },
                {
                    "user_id": "Francy Balti",
                    "user_href": "/profile/Francy-Balti"
                },
                {
                    "user_id": "Sapthami Gowri",
                    "user_href": "/profile/Sapthami-Gowri"
                },
                {
                    "user_id": "Junrich Ocon",
                    "user_href": "/profile/Junrich-Ocon"
                },
                {
                    "user_id": "Guljar Singh",
                    "user_href": "/profile/Guljar-Singh-44"
                },
                {
                    "user_id": "Yukimi Suzuki",
                    "user_href": "/profile/Yukimi-Suzuki-2"
                },
                {
                    "user_id": "Durgapur - Hawa Valves",
                    "user_href": "/profile/Durgapur-Hawa-Valves"
                },
                {
                    "user_id": "Jacey Song",
                    "user_href": "/profile/Jacey-Song-2"
                },
                {
                    "user_id": "Bhumika Meshram",
                    "user_href": "/profile/Bhumika-Meshram-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devil Bug",
                "href": "/profile/Devil-Bug"
            },
            "answer_text": "Im pretty sure he likes sweet fun kinda rebel And one that of course loves him for him and one that loves themselves as well to me i love him for his box smile, unique fashion, love for animals, his deep voice, his BIG heart, ETC.. he makes my day just hearing his voice he is perfect with out makeup he is vary special to my life all of the members are cause their songs clear my head and help me though life so if i could i would thank him and the others #Foreverbangtan&army ",
            "date": "Answered February 18, 2019",
            "views": "103",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bck Esmeralda",
                    "user_href": "/profile/Bck-Esmeralda"
                },
                {
                    "user_id": "I'm a Kind Kitty",
                    "user_href": "/profile/Im-a-Kind-Kitty"
                },
                {
                    "user_id": "Leelavati Leelavati",
                    "user_href": "/profile/Leelavati-Leelavati-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Taehyungie-Rs"
                },
                {
                    "user_id": "Scarlett Kyut",
                    "user_href": "/profile/Scarlett-Kyut"
                },
                {
                    "user_id": "Ramsha Ansari",
                    "user_href": "/profile/Ramsha-Ansari-15"
                }
            ]
        }
    ]
}