{
    "title": "What business can a 16 year old start with little investment? - Quora",
    "tags": [
        "Startups and Entrepreneurship",
        "Startup Founders and Entrepreneurs",
        "Entrepreneurship",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Courteau",
                "href": "/profile/Robert-Courteau"
            },
            "answer_text": "If you do not want to invest money, you'll need to invest time. Time=Money. If you have a specific skill that you know you are better at then most, and you can do it for cheaper, then great! Go do that. At 16, I was not sure what were my amazing skills, since I hadn't really developed them yet. So... There are tons of things you can do which don't require a license (mowing lawns, babysitting, newspapers, dogsitting, dog walking, car washing, food gardening, house cleaning, lawn cleaning, painting, etc). Make a spreadsheet, go around and ask friends how much they are paid for such things. Ask Quora, ask whoever. The closer to your location, the better the response.  Now you know how much money you can make per hour on various services, and approximately how many hours you can expect to do in a week, month, year (for each job). Choose the highest paid, and get to work. Spend some, and save some. Eventually you will have money to invest instead of investing your time. Example: If you are cutting laws at $15/lawn. First, seek the smaller lawns (which are still big enough to warrant $15) and mow as fast as possible, but do it perfectly! Then, hand them a card with your phone number, and a discount for the next mow. 20% off and satisfaction guaranteed or money back. Then do the math. You mow their lawn every 2 weeks for 6 months. That is 12 events. 12*$15=$180. Offer them $120 for the entire summer (at the beginning of the season). And $99 for the next summer if paid THIS summer (end of season). Hire a friend or someone that you trust to mow PERFECTLY. And pay them $8 per lawn. Now you can double the number of clients with 2 people. And the person you have working for $8/lawn you profit on between $2-$7 per lawn! And he has no sales to do, just go from lawn to lawn mowing. You need to follow up, and visit those lawns to make sure they are at your level of perfection.  Do this over and over again and you'll have a mini empire of lawn mowers. But by this time, you'll have to register your profitable business. ;) ",
            "date": "Answered October 26, 2015",
            "views": "45",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mikael Montoya",
                    "user_href": "/profile/Mikael-Montoya"
                },
                {
                    "user_id": "Abdullah Salim",
                    "user_href": "/profile/Abdullah-Salim-31"
                },
                {
                    "user_id": "Ervic Xander Padilla",
                    "user_href": "/profile/Ervic-Xander-Padilla"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SaRDaR-YaSSiR"
                },
                {
                    "user_id": "Divya Gor",
                    "user_href": "/profile/Divya-Gor-5"
                },
                {
                    "user_id": "Janek Codlin",
                    "user_href": "/profile/Janek-Codlin"
                },
                {
                    "user_id": "Benjamin Den Dulk",
                    "user_href": "/profile/Benjamin-Den-Dulk"
                },
                {
                    "user_id": "Corban Kreitzer",
                    "user_href": "/profile/Corban-Kreitzer"
                },
                {
                    "user_id": "Jared Zwick",
                    "user_href": "/profile/Jared-Zwick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Flint",
                "href": "/profile/Kevin-Flint"
            },
            "answer_text": "Ah yes! The heady joy of youthful entrepreneurialism! My school was filled with enterprising youngsters, eager to stake out a piece of the business world. Here are some businesses owned and operated in my peer group at age 16:  Firework importation and resale. Mail ordering bulk fireworks to a friend/cousin living in a state where it was legal, having them repackage and ship it to California, where it could then be broken into small lots and marked up 3-400% or more. Pot. The old standby. Every high school had a pot dealer or three. Or twenty. High school kids would pay a premium, buying terrible weed at top shelf prices. Most kids selling seemed to get theirs from an older sibling/friend in college or a hippy uncle. The increased legalization may have upended this half century old business model, a current high schooler would have better perspective. Booze/cigarettes. Similar to pot, typically acquired from older sibling, the guy with the great fake ID (see below,) pilfered from the absent minded parent with the massive liquor supply, or via the classic shoulder tap. Redistributed at a premium \"Natty Light for just $3 can? Awesome, I'll take 20!\"Nitrous tank installation. There were always a couple of guys that would install Nitrous tanks in cars for a nice payoff. They also did various other racing and off road modifications. Usually need to be in tight with the auto shop teacher to have sufficient access to do this. Porn.  I'm guessing this market is gone. But before porn was ubiquitous via the Internet, it was all in magazine and vhs form. Even a simple playboy could fetch $10. Enterprising kids would mail order hard core stuff from the back pages of \"legit\" magazines with a money order to their house, then redistribute at large markups. A fake ID equipped kid (see below) could go a few towns over to an adult book store. There was also a thriving second hand market in this. Sex will always sell when there are 16 year old boys in the world, so I imagine this still exists in some form. The next step from that ^. Yes, sex sells. Now nothing on the scale of \"Risky Business\" happened at my school. But we were an upscale suburb far from the grit of the big city. And occasionally one of those big city girls would get invited for a stay in the suburbs while someone's folks were away. And other kids might get an invite over. I recall after Risky Business came out, a few enterprising kids wondered if they could pull that off (none in my town attempted it.) Weapons.  I grew up in a conservative, wealthy, faux-red neck town, so this trade was actually fairly innocent. Kids wanted ammo to shoot dad's gun up in the hills while the parents were on vacation. Or crossbows or ninja stars or switchblades or samurai swords or butterfly knives or whatever the latest ninja movie had convinced us was awesome. Could be acquired via mail order, pilfered from a less secure father, or gotten from an expedition to Chinatown in the big city. \"Yes, I'm 18. Actually could I get 3 switchblades and the 12 pack of ninja stars?\" Pirated anything. It was vhs, tapes, and computer games on floppy disks when I was a kid. Of course, technology has changed, but pirating- and the distribution of pirated good - still thrives. Fake IDs. Easier in my day, when a skilled artisan could make a passable ID with a color copier and a trip to the craft store. The hard part was a quality color copier, which were somewhat rare and restrictive in access. Another method was scraping/repainting the DOB numbers on an existing ID. Or acquiring legit IDs and matching then to people who looked like the original. Fake IDs carried a lot of power, and were quite desirable. Bookie. Young men (and many women) love sports. And like all of us idiots in the world, love a good bet. Vegas is far away, and Internet gambling not easy for a 16 year old with no credit card. Take the bets! Serious profits to be made by a smart bookie. Party!  House parties, raves, underground clubs, speakeasys, poker dens, underground strippers, wilderness parties. In reality, most anything like this that tried to make a profit, failed to do so. So many things you forget to budget for, so many things you don't know to plan for, so many things you could profit from and fail to realize. It takes some experience and talent to get a profitable party/club model. If I knew then what I knew now, I could have made a fortune on high school parties and such. A serious fortune. It is such a captive and eager market. Instead, I got 2 minor in possession of alcohol charges before age 18. Ah well, we live and learn, right? Counterfeiting. So yes, there was a kid who had parents that owned the local print shop and she had keys and knew how to work the equipment.  Apparently, $1s can be bleached and reprinted as $10s or $20s. This was before fancy countermeasures. This is moving into a more... advanced level of Federal no no. I was not at all involved in this one, and I disavow any knowledge of what may or may not have gone on there. Disclaimer: The above is for recreational reading and historical documentation, and in no way amounts to an endorsement or encouragement of any activities. So yes, that was the thriving entrepreneurial scene in my high school. There were many other such things going on (I have no doubt the young women had many trades specific to them that I had little awareness of.) I can think of so many illegitimate activities, and so few legitimate entrepreneurial activities. All the legitimate money makers were delivering pizzas or working at dad's office on the weekends. Maybe a few kids tried car washing or gardening, but they were largely adverse to the necessary hard work and could not really compete with the adults in that market.  The truth is at age 16, with me being over twice as old and far more experienced, I am better than you at nearly anything you can do. Almost any business you try, an adult will be able to out compete you. The biggest advantage you have over me is market access. You can reach markets that I can't. I can outsell you with adults. Heck, I can easily outsell you with kids. I am stronger, smarter, have way larger networks, and have a lifetime of lessons under my belt. But I can't access all the markets you can as easily.  You have day to day access to the 13-18 crowd. It would be inefficient for me to try to gain access to that market. So I don't really try. Use that advantage. Identify something your peers want and need. Then sell them on the necessity of it. Corner your local, accessible market. Learn from and understand your successes and failures, and then grow and expand as you can. A final note. Some of you might have read the above and smugly thought \"well yeah, I bet all those kids selling booze, crossbows or fireworks or throwing raves are all in jail or junkies now.\" You would be wrong. They are now the business owners, top executives, and industry leaders you see all around you. Just writing that list brought back some hilarious memories of illegal enterprise in my high school, but also a realization at just how successful most of those kids went on to be. That entrepreneurial, creative spirit was used then to identify demands of their peers and profit from them. Now they use that same talent to sell to all of you. ",
            "date": "Answered February 1, 2015",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Benjamin Fox",
                    "user_href": "/profile/Benjamin-Fox-5"
                }
            ]
        }
    ]
}