{
    "title": "What is the meaning of Jackson Browne’s 'Running on Empty' song? - Quora",
    "tags": [
        "Song Meanings",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Smith",
                "href": "/profile/Bob-Smith-6121"
            },
            "answer_text": "Jackson Browne, good musician . Jackson Browne released an album called “ Running On Empty” back in 1977 that album containing a song by the same title. To date it has been his best selling album having gone multi platinum since it’s release.  The entire album was recorded on tour, in dressing rooms, backstage, onstage and in hotel rooms so the whole theme of life on the road and travel permeates the album. The song itself “ Running On Empty” was written by Jackson Brown with the idea and song coming together on his drive to the nearby recording studio. According to Browne himself, he rarely fueled the car as the drive to the studio was a relatively short one giving him the inspiration for the song. The song has long become a staple on classic radio after hitting the #11 spot on the Top 100 list back in 1978. A much loved oldie.. Enjoy.  ",
            "date": "Answered October 21, 2020",
            "views": "538",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Mackenzie",
                    "user_href": "/profile/Jeff-Mackenzie"
                },
                {
                    "user_id": "Andy Parris",
                    "user_href": "/profile/Andy-Parris-2"
                },
                {
                    "user_id": "Beth Romo",
                    "user_href": "/profile/Beth-Romo"
                },
                {
                    "user_id": "John Howard Sr.",
                    "user_href": "/profile/John-Howard-Sr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Nairn",
                "href": "/profile/Peter-Nairn-2"
            },
            "answer_text": "He talked about that in an interview right after the album came out. When recording the album, he lived really close to the studio, but not close enough to walk there. So every day, he would drive back and forth, but couldn’t be bothered to fill the tank of his car because it was so close to the studio. So he was always running on empty. ",
            "date": "Answered August 23, 2020",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbara Kirk",
                    "user_href": "/profile/Barbara-Kirk-22"
                },
                {
                    "user_id": "Linda Cook",
                    "user_href": "/profile/Linda-Cook-101"
                }
            ]
        }
    ]
}