{
    "title": "What are some great advertisements? - Quora",
    "tags": [
        "Television Advertising",
        "Best of X",
        "Online Advertising",
        "Advertising and Advertisements",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander R",
                "href": "/profile/Alexander-R-28"
            },
            "answer_text": "In today’s world of interactive web-based marketing, viral campaigns and high production television commercials, the print ad remains one very powerful and effective means for advertisers to reach their audience.Already answers are completely flooded and I'm very late to answer it.I tried to go through all the existing answers and will try not to repeat the existing one. Its going to be pretty long, so please bare with me. AdvertisementsBose Noise Reduction Headphones: Waterfall  Belgian Association For Obese Patients: Encourage Your Children To Do More Sport  Glassex Window Cleaner: Magician  Later Cycle Helmets  Timotei : Lion  Nikol Baking Tray: Jacuzzi  Softlan Ultra: Wrestling  Alka Seltzer: Hangover  Kodak Rechargeable Batteries: Tiger  Utopolis Group Of Cinemas: Titanic  Listerine Mouthwash: Sermon  Pringles Hot and Spicy  Guinness: Einstein  DynaKids Vitamins: Making Kids Stronger  Loteria de la provincia de Buenos Aires: Money  Chupa Chups Sugar Free  3M Scotch Magic Tape: Overload  Fibermesh Concrete Reinforcement: Karate  WFM: Sharper Than You Think  Maglite: Gallery  Nissan : Chickens  Nutri Balance : Husband  Bare Wet Suits : Stay Down Longer  2. Advertisement's War First Round : Nikon vs Lumix Nikon - Face focus \"no matter ghost face, human face, Skeleton, peeper,I can find them all.\"   Lumix - I can find the face you even cannot see it.  Second Round : Coca Cola vs Pepsi From Pepsi Coca Cola takes the 2nd floor of this building for their sales marketing office and puts up a boarding. A couple days later Pepsi puts up the other board just for fun.  Even the snow storm can't stop people go and buy Pepsi.  Woo, seem like the straw doesn't want to be put into \"Coca Cola\".  Third Round : BMW vs Audi vs Subaru This one is a really classic ads war, they are really awesome. :D:D:D BMW started it  Audi answered.  Subaru wanted to say something. (I cant stop laughing)  Latest entry by another rival car company, Saleen almost steal the show  3. Awareness advertisement Fashion claims more victims than you think - Save the Animals  CCA UNICEF Special Mention - Gender in education  Against corruption  Road safety  Nature is incomplete without Female gender - Save girl child  Help street children’s  Road safety  4. Self-Explanatory advertisements                         You made it to the end!!! Hope you enjoyed Source: Internet PS: Could anyone help me with translating the adds in Hindi ? will be really helpful. Thank you ",
            "date": "Updated May 24, 2016",
            "views": "98",
            "upvotes": " View 216 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Mishra",
                    "user_href": "/profile/Shubham-Mishra-3230"
                },
                {
                    "user_id": "Hari Krishna",
                    "user_href": "/profile/Hari-Krishna-3282"
                },
                {
                    "user_id": "Rohit Gulla",
                    "user_href": "/profile/Rohit-Gulla-1"
                },
                {
                    "user_id": "Gina Whitney",
                    "user_href": "/profile/Gina-Whitney-9"
                },
                {
                    "user_id": "Subba Rao Grandhi",
                    "user_href": "/profile/Subba-Rao-Grandhi"
                },
                {
                    "user_id": "Vishwam Joshi",
                    "user_href": "/profile/Vishwam-Joshi-1"
                },
                {
                    "user_id": "Fulan Qadsi",
                    "user_href": "/profile/Fulan-Qadsi"
                },
                {
                    "user_id": "Tejaswi T",
                    "user_href": "/profile/Tejaswi-T-9"
                },
                {
                    "user_id": "Myasu Feed",
                    "user_href": "/profile/Myasu-Feed"
                },
                {
                    "user_id": "Madhaan S",
                    "user_href": "/profile/Madhaan-S"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Chawla",
                "href": "/profile/Shubham-Chawla-13"
            },
            "answer_text": "Some of the great advertisements I recently came across - Sweet kills. A poster made to raise awareness about diabetes.  A graphic way to remind people about the dangers of smoking.  Give blood. Replenish someone’s life.  A project promoting organ transplants in China.  Children spend less time outdoors than a prison inmate.  Child labor. If you don’t speak up, it doesn’t stop.  UNICEF : We work for a world where this picture doesn’t have another meaning.  The longer a child with autism goes without help, the harder they are to reach.  On the importance of making the city accessible for disabled people.  A project aimed at raising awareness about loneliness among the elderly.  Romania against waste: How big must litter be so we’ll stop ignoring it?.  A warning about using your phone while driving.  This is how the environment lives: trying to survive.  A reminder that deforestation causes real suffering.  It’s not fur. It’s someone’s mother. Source - BrightSide - Inspiration. Creativity. Wonder. Edit 1- A few more on the Christmas theme.     Don’t drink and drive.      Edit 2 - This ad for World No Tobacco Day compares two sides of a woman’s face to demonstrate the ravaging effects of smoking  This ad for tea brand Curtis takes advantage of the sensation of smell and taste that can come with looking at a piece of fruit. Add a little steam and your mouth starts water.  Heinz appeals to its audiences’ tastebuds in this ad for tomato ketchup. According to the ad, your steak and French fries are going to taste like cardboard without their world famous sauce.  This ad for the London Marathon by Reflex Spray has a shoe with a miniature re-creation of London on its sole. The shoe has literally run all over the city.  This campaign called “Work Ache” for painkillers Aspirina Bayer features a stapler painted with a man face down holding the sides of his head. It cleverly depicts how a headache can feel like you’re hammering your head on the desk.  Bike machinery becomes body machinery in this ad by Argentenian studio La Comunidad promoting the health benefits of cycling. Concept, design and consistency makes for an aesthetically appealing and easy to understand campaign.  A dog taking a selfie? Not quite. This ad by Ogilvy Istanbul is for Ford’s Rear View Camera and it features a dog staring straight into the camera – in effect, straight out to the audience – to bring feeling and emotion to an important message.  If you need to get the bus to the airport, this clever wrap gives you an idea of what's coming next. When viewed from exactly the right angle, when the sky is its most sky blue, you'd almost be fooled into thinking you're watching a bus taking off. Or at the very least pulling an impressive wheelie.  The idea behind using Wite-Out is to fix things. The campaign showed Bic Wite-Out correcting societal problems that are faced in Kenya: crime, poor infrastructure, poverty, lack of education etc. This series of print ads was created by Kenyan agency Flametree.  Hats off to the ad copy of the Nut brand needless to say that the timing totally nailed it!!  Instant Fryer  Mattress so soft that you sleep like a baby   Source - Itchy Ketchup | Facebook ",
            "date": "Updated February 9, 2017",
            "views": "741",
            "upvotes": " View 3.8K Upvoters",
            "upvoters": [
                {
                    "user_id": "Ninad Adavadkar",
                    "user_href": "/profile/Ninad-Adavadkar"
                },
                {
                    "user_id": "Manan Dhawan",
                    "user_href": "/profile/Manan-Dhawan"
                },
                {
                    "user_id": "Dionísio Bragança",
                    "user_href": "/profile/Dionísio-Bragança"
                },
                {
                    "user_id": "احمد هادوی نیا",
                    "user_href": "/profile/احمد-هادوی-نیا"
                },
                {
                    "user_id": "Giorgio Arbato",
                    "user_href": "/profile/Giorgio-Arbato"
                },
                {
                    "user_id": "Marvheen Theodore",
                    "user_href": "/profile/Marvheen-Theodore"
                },
                {
                    "user_id": "David Richardson",
                    "user_href": "/profile/David-Richardson-635"
                },
                {
                    "user_id": "Soňa Výhonská",
                    "user_href": "/profile/Soňa-Výhonská"
                },
                {
                    "user_id": "Stuti Suchak",
                    "user_href": "/profile/Stuti-Suchak"
                },
                {
                    "user_id": "Rine Aguirre",
                    "user_href": "/profile/Rine-Aguirre"
                }
            ]
        }
    ]
}