{
    "title": "What are some bands that sound just as good (if not better) live when compared to their recorded sound? - Quora",
    "tags": [
        "Sound Engineering",
        "Music Recording",
        "Audio Recording",
        "Bands (music)",
        "Sound",
        "Music Recommendations",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vicki Racicot",
                "href": "/profile/Vicki-Racicot"
            },
            "answer_text": "BECK - I've seen him perform live 3 times now…each time I'm more blown away by his talent. It's just not as easy to catch the nuances, the seamless blending of seemingly disparate musical genres within each of his songs, unless you see him live. Trust me, the man is a musical genius! THE CURE - Ahhh so wonderful recorded, but even better live. I caught them at the Austin City Limits fest a few years ago and enjoyed every minute. I could tell that the band was having a great time as well…most importantly, they totally killed it. For as long as they've been together, the years have certainly NOT diminished their chops on stage. NEIL YOUNG - I've seen him live 5 times thus far (twice with Crazy Horse, once solo acoustic, once solo electric & acoustic, and most recently with the Promise of the Real). Each performance was unique and I loved them all. He is one of the few artists who moves me to tears of joy when I see him play. GARBAGE - I saw them at a small rock club in Boston back in maybe 1999? What a show! Shirley Manson is an incredible singer - her voice live really punches you in the gut, in the best way possible. SHARON JONES & THE DAP KINGS - I was lucky enough to catch her live many years ago, right after 100 Days… was released. Incredibly dynamic and wonderful live. May she Rest In Peace! NEKO CASE - No doubt my favorite live act, and far more impactful to hear her amazing voice live versus recorded. She's more restrained in the recording studio, but totally belts live. Highly recommended if you like Americana/Country Noir. CAKE - Caught them at the Toronto Urban Roots festival a few years ago - a most excellent show. I'd heard their radio hits but did not appreciate them until I saw them live. The giant disco ball on stage was a bonus. ROGER WATERS - Saw him for the first time at the Desert Trip fest in 2016…hearing that performance was akin to a holy experience. THE FLAMING LIPS - Always delightful live, both from an audio and visual perspective. NINE INCH NAILS - I managed to check out most of their set at the Primavera Sound festival in Barcelona back in 2014. Amazingly tight performance, and I'm pretty convinced that Trent Reznor is from another planet or dimension - not sure how he played that marathon set clad head to toe in leather without breaking a sweat, without missing a note. ",
            "date": "Answered August 25, 2017",
            "views": "13",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Hyde",
                    "user_href": "/profile/Aaron-Hyde-12"
                },
                {
                    "user_id": "Peter Rickard",
                    "user_href": "/profile/Peter-Rickard"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                },
                {
                    "user_id": "Phil Giles",
                    "user_href": "/profile/Phil-Giles-3"
                },
                {
                    "user_id": "Noir Eger",
                    "user_href": "/profile/Noir-Eger"
                },
                {
                    "user_id": "Susan Hadlow",
                    "user_href": "/profile/Susan-Hadlow"
                },
                {
                    "user_id": "Krishna Kumari",
                    "user_href": "/profile/Krishna-Kumari-162"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Urso",
                "href": "/profile/Mark-Urso"
            },
            "answer_text": "This is a great question! My initial reaction was, as you might think, the studio recordings sound best; after all, they get to do multiple takes and spend time making things perfect. But then my mind went to a Grateful Dead concert, at the Providence Civic Center, in the 1980’s … when I walked around from my terrible seat, and stood in the perfect spot in the huge stadium, feeling like a king, watching the band as if they were in my enormous living room … and I remember what it sounded like; remarkable, inimitable, and special in a way that can’t be described … Without missing a beat, my mind segued into a Tedeschi Trucks Band concert I recently saw on my high-definition TV. Susan looked and sounded beautiful, backed by one of the most talented bands you can ever see or hear, and they did some Dylan and maybe even a Dead cover. There’s a couple bands that play so well live, it’s just about as good as it gets. Maybe better. The band’s skills, management, PA system and various factors can make a local or regional act really special, too. Some great bands tour, do weddings for bread and butter, and don’t ever make a CD. Like Sugar, a band that tours around New England, doing popular music covers. They have one of the best PAs I’ve heard, and going to a show is usually a pretty perfect experience. When a band or singer is “on,” it can be better than the recording; it’s a rare occurrence, that they couldn’t do that same thing again even with a studio environment. Some bands, like the Dead, specialized in playing live. Hope that helps! Have a great day! Nothing Original question: What are some bands that sound just as good (if not better) live when compared to their recorded sound? ",
            "date": "Answered October 25, 2018",
            "views": "527",
            "upvotes": "0"
        }
    ]
}