{
    "title": "What PC is good for music production and gaming? My budget is anything below $1,000. I also don't know where to get the parts at for an affordable price if I were to build one. - Quora",
    "tags": [
        "Custom PC Building",
        "Home-built Computers",
        "Music Production",
        "Personal Computers",
        "PC Gaming ",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Connor Dalton",
                "href": "/profile/Connor-Dalton-13"
            },
            "answer_text": "Gaming requires a good GPU and music production tends to favour a combination of RAM and CPU thread count. TLDR, for the budget, this rig has to be biased to one side or the other. There isn't enough cash on hand to build a rig that will excell at both, so were going to have to weaken our build a little on the gaming front. Ideally for this, you would want a 16 thread CPU for some serious music production. To get that cheap means Ryzen ( 1000 or 2000 series). So ryzen 1800 or a Ryzen 2700 are the front runners. Ideally, a 3700X should be used, but that would mean blowing just over a third of the budget on a CPU, which is very counter intuitive for a gaming rig ( the GPU needs funding priority for a good gaming build). Board wise, go with a B450. An X470 or an X570 is better, but the expense isn't worth it here. I wouldn't reccomend a B350, X370, or an A320 here, esspecially if you want to upgrade down the line. Ram should be at least 16gb. Ideally 3000mhz, but it's not mandatory ( just really reccomended). GPU should be at least a GTX 1060 6gb. Their cheap on the resale market too. A 1070 is preferable if you can spot one. For store bought GPU's, GTX 1660, RX5500, or RX5700 all work, but be mindful of the price. Resold GPU's are extremely reliable, so finding one second hand is very much encouraged. Get a small SSD boot drive if possible to complement an HDD for bulk storage. Otherwise, go pure HDD. PSU probably needs to be at least 650W to run this reliably. For this build, look for deals on Ebay, Kijiji, or any other relevant resale site. Even with Ryzen, getting the needed cores for cheap is best done on the resale market. Otherwise, not actually too sure which stores to use. I always use memory express for their prices, but their canada exclusive. ",
            "date": "Answered May 31, 2020",
            "views": "190",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Maximus",
                    "user_href": "/profile/Christopher-Maximus-1"
                },
                {
                    "user_id": "Miles Rathkamp",
                    "user_href": "/profile/Miles-Rathkamp"
                },
                {
                    "user_id": "Jonathan Reyes",
                    "user_href": "/profile/Jonathan-Reyes-232"
                },
                {
                    "user_id": "Mihir Srivastava",
                    "user_href": "/profile/Mihir-Srivastava-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Nettles",
                "href": "/profile/Christopher-Nettles-8"
            },
            "answer_text": "Worry about building a gaming pc first, you can buy stuff like Presonus Studio One (what I use) for like $90. It includes a solid daw, and mixing mastering software. You can upgrade to pro or artist later on. That's my opinion anyway. ",
            "date": "Answered June 1, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Reyes",
                    "user_href": "/profile/Jonathan-Reyes-232"
                }
            ]
        }
    ]
}