{
    "title": "What do you say to someone who claims they don't like the Beatles? - Quora",
    "tags": [
        "The Beatles (band)",
        "Social Advice",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Latta",
                "href": "/profile/Robert-Latta-5"
            },
            "answer_text": "What do you say to someone who claims that he (let’s say) doesn’t like the Beatles? Well, if he happens to be a Roman, you might say this, in a conciliatory spirit: De gustibus non disputandum est. Why do you doubt his sincerity? Don’t you know that people show individual differences? Speaking of individual differences with respect to music, I enjoy art music very much: Monteverdi, Vivaldi, Corelli, Bach, Telemann, Handel, Mozart, Brahms, Tchaikovsky, Dvorak, Stravinsky, Prokofiev, Shostakovich, Debussy, Ravel, Sibelius, Grieg, Carl Nielsen, and so on and on. Unusually for someone who can say that, however, I’m not much on Beethoven. I like spinach, but you don’t. That is because one thing happens in my brain when I have spinach, and something quite different happens in yours when you have spinach. Similarly for the Beatles (though in fact I do like their music). That’s the way the world works. To return to the Latin, I understand it to mean this: Tastes are not to be disputed. But that isn’t entirely true. At the risk of running up against the anti-elitist spirit of the age, there is indeed most definitely such a thing as higher and lower tastes—which suggests interesting philosophical questions—and I suppose that to some extent the former can be taught and learned. That effort, however, is more appropriate to Bach than to the Beatles. ",
            "date": "Answered December 18, 2018",
            "views": "88",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Pádraic Breathnach",
                    "user_href": "/profile/Pádraic-Breathnach"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marty Shupert",
                "href": "/profile/Marty-Shupert"
            },
            "answer_text": "This happened, sort of, at a party. A person said they liked Disco much more than anything from the 60’s. So, I set up a little contest with them. They got to have all disco bands. I got to choose one band from the 60’s. I further narrowed my side to one member of one band. A crowd started to form as I said I would go first, naming a song and then, they could name a song. I said, and I’ll tell you when I’ve won and if these people agree with me, then we’re done here. If they disagree, you win. I’ll choose The Beatles, and take Paul. I’ll go first. ‘Yesterday’” They went next and chose “Staying Alive”. I chose “Back In The U.S.S.R.” They chose the Stone’s song… what was that? something about some Puerto Rican girls that are just dyin’ to meet cha. Anyway, it went on for about five picks and they said, “Disco Duck.” I was waiting for it. I said in about a nano-second. “I win.” Everyone agreed. If you can’t get past five songs before you name “Disco Duck” as a great song, you’re bankrupt… game’s over… down goes Frazier… Thanks for playing… I’m sure I had about 50 songs left in the bank, maybe 100. You can say you don’t like the Beatles if you want. It makes about as much sense to say you don’t like Bach. ",
            "date": "Answered December 14, 2018",
            "views": "310",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Celeste Celeste",
                    "user_href": "/profile/Celeste-Celeste-8"
                },
                {
                    "user_id": "Grant Morahan",
                    "user_href": "/profile/Grant-Morahan"
                },
                {
                    "user_id": "Daniel Doman",
                    "user_href": "/profile/Daniel-Doman-4"
                }
            ]
        }
    ]
}