{
    "title": "What do you think of Marina Rayne? - Quora",
    "tags": [
        "Actors and Actresses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Destiny Rivers",
                "href": "/profile/Destiny-Rivers-27"
            },
            "answer_text": "I think she is very toxic. First of all, she’s a Jennie anti and ot3 Blonk. I’ll show one of her answers, where she praises Red Velvet and ChaeLiSoo, but brings down Jennie.     See how toxic she is? (She has more answers where she hates on Jennie, but I’m way too lazy to add all of them. If you want to see how toxic she is, check out her profile. She calls Jennie fat and ugly, but Jennie’s body looks like this:  Yeah, so fAt aNd oVeRwEiGhT. 🙄 She says that Jennie is the worst singer, rapper and dancer. She’s the main rapper, why would she be picked to be the main rapper if she was the worst? I’ll admit, she isn’t the best at singing or dancing, but she’s not the worst in the group, either. She’s an average singer, and an average dancer. In fact, if she tries her hardest, she is actually pretty good at dancing. Second of all, she is rude to many Quorans, including me, Charissa Han, Marvheen Theodore, Hamedah Badmus, Yuqi Wong ៹༢, and like, 12 others. She accused all of us of being the same person. 🤡 Who makes THAT many accounts just to win a dumb argument? She also suggested some toxic edits to my, Charissa’s, and Marvheen’s answers. Edits she suggested to me:     “Nobody reads your dumbass answers anyway.” Oh, okay. Then explain how I get upvotes on my answers, while you don’t? Sure, I might not be the most popular Quoran out there, but it’s not a competition. Also, I don’t necessarily write for upvotes (even though I like upvotes), I write because I want to. “You are just a delulu and a failure.” Okay, but at least I don’t fat-shame a thin person’s body like you do. “Your answers are really bad and cringy, I just want to kill you after I read them.” Well, aren’t you nice and peaceful. “Are you an 8 year old? Because you act like it.” No, I’m twelve. I think you’re probably younger than that, judging by your immaturity. “You think you’re being so cute and funny, but you are just being attention seeking.” How am I being attention seeking? If anything, you are. You know that people will respond negatively to your behavior, but you keep on doing it. “Go burn in hell bitch.” The interesting part is when someone else told YOU to burn in hell (which they apologized for) you got offended. Hypocritical much? 🙄 Now, let’s move on to the edits she suggested for Charissa’s answer…   (I didn’t take these screenshots, btw.) “Your answers suck. You are clearly trying to make them “hIgH qUaLiTy” so you can get attention, fame, and followers, but you fail.” First of all, isn’t it actually a good thing that Charissa puts effort into her answers? Second of all, she DOESN’T fail. Her answers are actually good. If not, explain how they get thousands of upvotes, while Marina’s answers get like 0–2. “You’re a Jennie akgae who doesn’t even appreciate how hard the other members work” No, sweetie. It’s called supporting a group and not hating on a member. If you actually READ Charissa’s answers, you would know that she cares about all four members of BP, which is more than I can say for you. And now the edits she suggested for Marvheen:  I would explain why these edits are so dumb, but Marvheen already did, so yeah. Also, her bio is really immature:  Basically, she needs to be reported and banned ASAP. ",
            "date": "Answered August 29, 2020",
            "views": "17",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rineko Fukosa",
                    "user_href": "/profile/Rineko-Fukosa"
                },
                {
                    "user_id": "Aubrienne Hansen",
                    "user_href": "/profile/Aubrienne-Hansen"
                },
                {
                    "user_id": "Lisa Johnson",
                    "user_href": "/profile/Lisa-Johnson-2278"
                },
                {
                    "user_id": "Remi-Hana Arai",
                    "user_href": "/profile/Remi-Hana-Arai"
                },
                {
                    "user_id": "Diane Jeong",
                    "user_href": "/profile/Diane-Jeong-8"
                },
                {
                    "user_id": "Ruby Mae",
                    "user_href": "/profile/Ruby-Mae-49"
                },
                {
                    "user_id": "Maddie Hernandez",
                    "user_href": "/profile/Maddie-Hernandez-19"
                },
                {
                    "user_id": "Phoebe Tan YZ",
                    "user_href": "/profile/Phoebe-Tan-YZ"
                },
                {
                    "user_id": "Mia Garrett",
                    "user_href": "/profile/Mia-Garrett-18"
                },
                {
                    "user_id": "Christy Liu",
                    "user_href": "/profile/Christy-Liu-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charissa Han",
                "href": "/profile/Charissa-Han-1"
            },
            "answer_text": "Get your popcorn ready. So this answer includes toxic Blonk and ot3, Marina Rayne. Frankly, I’m quite surprised that this question hasn’t been asked earlier, due to the toxicity she emits. Marina is a Blackpink ot3 who hates Jennie.     There are more, but I’m not wasting time putting the rest of them. She writes disrespectful answers about Jennie, and according to her, everyone who disagrees with her is a delulu and/or blonk. Obviously, people like Yuqi Wong ៹༢, Destiny Rivers, and Hamedah Badmus started noticing her bull and called her out in her comments section. I did too, obviously, since Jennie is my bias, and guess what? She thinks we’re all sockpuppet accounts now. That’s right; I befriended and messaged my sockpuppet accounts just to gang up on her. She also sent me an extremely amusing edit request.  My existence? Sorry sweetie, not much I can do about that. My answers apparently suck, and I am trying to make my answers high quality so I can get followers and attention but failing. Well…thanks? It’s nice to know I’m involved enough for people to send hate to me. But seriously though, I work hard when writing answers. I write all my answers on paper before uploading them. Even this one. I don’t understand what she means by ‘high quality’, though. Isn’t it the point of Quora to write good answers? Who wants to read a half-assed piece of shit. Just because, I like writing serious topics doesn’t mean I’m trying too hard, lol. I enjoy writing, and not just for followers. Although that does help. Now let me compare my suckish answers to her amazing ones. The same question:    versus hers:  Isn’t she good at writing? My answers cannot compare to hers. :(        Crappy, I know. It’s really hypocritical of her to say that she was disgusted by what Kara Cadake said, after she sent this edit request to Destiny.  She got all upset when Kara told her to burn in hell, but when she does it to Destiny? Oh its justified since Destiny's been, 'Harassing me for months'. Does that make it okay? Destiny's just disagreeing and calling you out, and you haven't even been on Quora for a month yet. She called me a Jennie akgae who, quote unquote, “doesn’t appreciate the efforts of other members”. Huh? Wait, what? I'm a freaking ot4, I love all of them! I'm just especially talking about Jennie because you've been hating on her which never should be justified. Lastly, I'm just a young kid who wants attention so I made sockpuppet accounts. Two can play this game. I bet all the Jennie haters on Quora are the same person, you're creating sockpuppet accounts. That's obviously the case, you attention seeker. What's wrong with you, why'd you create so many accounts? Huh? But for real, many people have the same opinions. Just because your thinking is flawed and people are disagreeing, doesn't mean they're all the same, oh my god. And who cares if I'm twelve? I write good answers, better than you do. Judging by your profile picture, maturity level (non existent), and the way you talk, construct sentences, use words…yeah you're probably around the same age as I am, add one or two years. I'm assuming you're either 13 or 14, and since you're a teen, you feel superior. You should be embarrassed that I can write better than you can. Lastly, are you a vocal coach? Are you a rapper? Are you a dancer? Who are you to say that she isn't good at these things. And I can easily prove why her life isn't easy, if you ever bother to have a mature conversation without your obnoxious interjections and pulling out phrases like, “Stop trying to be sassy and cool!”, or even the now iconic, “Whatever Aulona, no one cares!”. Nobody's life is easy. We all grow up at one point, and Jennie had to at fourteen. You're fourteen aren't you? Well then, you should be ashamed that Jennie went through so much struggle and hardship while you sit at your chair eating chips and bitch about how much you hate her. I'm just waiting for your obnoxious comment. Oh well. Stan Jennie for clear skin~ Good memories and nightmares~ EDIT: I’ll show you guys the answer she sent edits to:     ",
            "date": "Updated August 29, 2020",
            "views": "11",
            "upvotes": " View 189 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priya J",
                    "user_href": "/profile/Priya-J-211"
                },
                {
                    "user_id": "Monica Medina",
                    "user_href": "/profile/Monica-Medina-116"
                },
                {
                    "user_id": "Park Min Young",
                    "user_href": "/profile/Park-Min-Young-9"
                },
                {
                    "user_id": "Azula Rene",
                    "user_href": "/profile/Azula-Rene"
                },
                {
                    "user_id": "Random Patotoe",
                    "user_href": "/profile/Random-Patotoe"
                },
                {
                    "user_id": "Mansi Jha",
                    "user_href": "/profile/Mansi-Jha-58"
                },
                {
                    "user_id": "Kaivalya Thakur",
                    "user_href": "/profile/Kaivalya-Thakur"
                },
                {
                    "user_id": "Rineko Fukosa",
                    "user_href": "/profile/Rineko-Fukosa"
                },
                {
                    "user_id": "Nikki Patil",
                    "user_href": "/profile/Nikki-Patil-14"
                },
                {
                    "user_id": "Mengkai Liao",
                    "user_href": "/profile/Mengkai-Liao-1"
                }
            ]
        }
    ]
}