{
    "title": "What's it like to meet Eminem in person? - Quora",
    "tags": [
        "What is/was X Like In Person?",
        "Eminem (musician)",
        "Meeting New People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Zain",
                "href": "/profile/Alex-Zain-1"
            },
            "answer_text": "I met Eminem twice because of my cousin who works in a studio in Vegas. He's a down to earth kinda person I tell ya. Our convo when we first met at a show in Michigan. My cuz: Hey Shady, this is my brother Alex and he's one of your biggest fans. Shady: Oww! I'm glad to hear that. You the same Alex who turned my 12 songs into a mixed mash-up that Kris brought once? (I had made a mash-up of songs and gave it to my brother and ask him if he could make Eminem to hear it once). Me: Is this a dream? Tell me this isn't a dream! You heard my mash-up! My cuz & shady: laughing. Shady: No champ, this ain't a dream and yeah Kris once came with it. Good job in selecting the soundtracks. I loved it. Me: Damn! I want a your autograph! (I gave him a $100 bill to get his autograph because I had no diary) He signed the bill. Shady: Hey Kris! You and Alex commin’ tomorrow night, aey? My cuz: Yeah we’ll be there. Shady leaves. When shady left, I was on the top of the world! I couldn't believe he actually knows me! Then I asked my cuz for the night and he said there's a small party at his place with his friends and collaborators. We were at his Michigan Mansion and the place was huge with enormous infrastructure and a beautiful tennis and basketball court. People say Shady doesn't smile that often but he has great sense of humour. He can pick out words for almost every conversation that you start. I met Kanye West and Lil Wayne too in that party. I wished to present my cousin with a Nobel meeting prize. My next meeting with the rap god was at Detroit when I was at Westland and I'd called to thank him for that night, and he said he was in Detroit recording a song and asked if I could kill some time and drop by the studio. A world famous rap artist asking you to come over is like Poseidon asking you to visit his underwater Kingdom! I was busy but I did manage to pay him a visit. He's a genius in writing songs and awesome human. He knows what others feel. Probably because he has been through all tough times that a human could ever be in. He gave me this when I last met him.  Meeting him is like you got the 50% of the surprise life could ever give you. Happy reading! Cheers! EDIT THANK YOU PEOPLE FOR APPRECIATION. :) ",
            "date": "Updated March 25, 2019",
            "views": "1758",
            "upvotes": " View 8.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kay Edmund",
                    "user_href": "/profile/Kay-Edmund-2"
                },
                {
                    "user_id": "Jennifer Pierce",
                    "user_href": "/profile/Jennifer-Pierce-184"
                },
                {
                    "user_id": "Trevor Jones",
                    "user_href": "/profile/Trevor-Jones-443"
                },
                {
                    "user_id": "Victor Babalola",
                    "user_href": "/profile/Victor-Babalola-8"
                },
                {
                    "user_id": "Sanket Rout",
                    "user_href": "/profile/Sanket-Rout"
                },
                {
                    "user_id": "Jadan",
                    "user_href": "/profile/Jadan-8"
                },
                {
                    "user_id": "Chirag Sharma",
                    "user_href": "/profile/Chirag-Sharma-1116"
                },
                {
                    "user_id": "Keep Growing",
                    "user_href": "/profile/Keep-Growing-6"
                },
                {
                    "user_id": "Lanýž Bílý",
                    "user_href": "/profile/Lanýž-Bílý"
                },
                {
                    "user_id": "Victor Kyaw",
                    "user_href": "/profile/Victor-Kyaw-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Smart",
                "href": "/profile/Nathan-Smart"
            },
            "answer_text": "Years ago when the Lyricist’s Lounge put out their first compilation and went on tour with Big Pun and a bunch of others, they came to Cleveland. I think it was Big Pun and Dead Prez on the show. I was a hip hop starved junkie who ate up everything he could find that he considered to be “underground.” (naturally, I was bummed that Big Pun was on the Cleveland leg of the tour, though I don’t feel the same negative way about him now) I got to the show early and went to the merch table to see what they had available and to try and talk to the person running it. I didn’t have a lot of friends in my life that were into the “underground” side of hip hop so any chance I could get to try to impress someone with my knowledge I did. I struck up a conversation and he casually mentioned that Slim Shady was in the room. I was aware of Eminem but not enough to know of his “Slim Shady” moniker but I still acted like that was cool. In about a second or so, I realized he was talking about Eminem and I said, “Where is he?” and he said, “Right over there,” pointing to the bar directly behind me. I immediately turned around and took a few steps (he was that close) and introduced myself. He was sitting at this stool - he was laid back trying to be as cool and chill as any hip hop guy could at the time. He did that thing where he looked around the room as you talked to him but it didn’t feel like he was just trying to pawn me off. He definitely listened to what I was saying and responded in kind. He asked me about the hip hop scene in Cleveland and, being the negative Nelly I used to be, I told him it wasn’t very good. In fact, we did have a nice little scene though I couldn’t see it at the time because I wasn’t plugged in. We talked a little bit about that and then I asked him if he had his tape there for sale. He reached into his pocket and said, “You mean this?” and then gave it to me for free. He then asked me if I was a DJ. I said no, but that my friend was and he gave me his single on vinyl (I think it was “My Name is”). Lastly, he gave me a free shirt and I gave him a pound and let him keep on chilling. All in all, it was a very “generous” encounter! :) ",
            "date": "Answered November 30, 2016",
            "views": "65",
            "upvotes": " View 325 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Pierce",
                    "user_href": "/profile/Jennifer-Pierce-184"
                },
                {
                    "user_id": "Trevor Jones",
                    "user_href": "/profile/Trevor-Jones-443"
                },
                {
                    "user_id": "Keep Growing",
                    "user_href": "/profile/Keep-Growing-6"
                },
                {
                    "user_id": "Maryam Moravej",
                    "user_href": "/profile/Maryam-Moravej"
                },
                {
                    "user_id": "Marcian Sean",
                    "user_href": "/profile/Marcian-Sean"
                },
                {
                    "user_id": "Nick Reynolds",
                    "user_href": "/profile/Nick-Reynolds-102"
                },
                {
                    "user_id": "Kasheem Jefferson",
                    "user_href": "/profile/Kasheem-Jefferson"
                },
                {
                    "user_id": "Shreyan Sen",
                    "user_href": "/profile/Shreyan-Sen-2"
                },
                {
                    "user_id": "Christine Hawkins",
                    "user_href": "/profile/Christine-Hawkins-51"
                },
                {
                    "user_id": "Brooke Rennert",
                    "user_href": "/profile/Brooke-Rennert"
                }
            ]
        }
    ]
}