{
    "title": "What was Elvis Presley like in person? - Quora",
    "tags": [
        "Elvis Presley (musician, actor)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Frigault",
                "href": "/profile/David-Frigault"
            },
            "answer_text": " On August 16, 1977, the King of Rock and Roll died at the relatively tender age of forty-two. Having been born on January 8, 1935, Elvis lived for a total of 15,562 days. As of today, March 24, 2020, it has been 15,562 days since Elvis’s presumed passing, and it is the reason why I have chosen today, out of all other dates, to make a biographical essay on his life. Personally, I am not a die-hard fan of his, even though I have listened to his music whenever I am around to hear it and still appreciate his works. As a result, despite doing some extra research on his background for the purposes of this article, I would definitely not count myself as an expert on his life, so I am certain I will end up omitting some things about him (though I have tried looking for background information on him that even the more enthusiastic Elvis readers out there are less likely to know about). Nonetheless, with Elvis now being dead longer than he was alive, I figured that this landmark date is suitable for talking about a singer, who was also a man who seemed to be loved and hated by society for one reason or another. Below, I am going to talk about an Elvis with good and bad tendencies like any other person in order to give a more humanistic, as opposed to ideal, version of Elvis. BIRTH AND EARLY LIFE Elvis Presley was born on January 8, 1935 in Tupelo, Mississippi to Vernon Presley and Gladys Smith.  Above: Elvis Presley As A Kid Theoretically, Elvis was the youngest child, as his older twin brother, Jesse Garon Presley — who was reportedly born 35 minutes after Elvis — was stillborn when he exited his mother’s womb and was subsequently buried at the Priceville cemetery located just outside the old downtown limits of Tupelo. While Elvis would later claim this as his most “tragic” childhood moment of his life, another event was to come about within a year later that would have far more life-changing effects.  Above: Jesse Garon Presley’s Grave Marker https://www.history.com/news/7-fascinating-facts-about-elvis Due to the time period since the events in question, as well as the secrecy kept regarding Elvis’s childhood background from the public, much of what we know largely comes down to educated guesses. However, Elvis did apparently make some mention regarding the whereabouts of himself and his immediate family on the evening of April 5, 1936 when an F-5 tornado shredded Tupelo to bits. TUPELO TORNADO His father Vernon was apparently away for reasons never specified, and as a result, Gladys brought Elvis — then a one-year-old infant — to what was probably the official residence of Vernon’s parents (Elvis’s birthplace), as Doll Smith (Gladys’s mother) had died on April 13, 1935 while Bob Smith had died sometime in October 1931 (a specific date has not come across my research).  Above: Downtown Tupelo After The Tornado Tore Through The Area — Making It The Fourth Deadliest American Tornado In History 1936 Tupelo–Gainesville tornado outbreak - Wikipedia It was around 8:30 PM when the tornado came through Tupelo and proceeded to gut the city of Tupelo, whose population at the time only numbered around 7,000 inhabitants. This tornado was part of a major tornado spawn that would also resulted in the unleashing of the 1936 Gainesville tornado twelve hours later. In only a matter of minutes, the tornado travelled approximately 15 miles through the city and into the farmland outside the city boundaries. The official death toll was 234 dead (3%) and 700–1,000+ injured (10–15%), leaving the survivors stranded in a war-torn environment where most houses and buildings within eyesight were flattened.  Above: Elvis, His Mother And Paternal Grandparents Were Here On The Day The Tornado Struck — Though Their Home Was Ultimately Spared From Destruction Elvis’s temporary residence on the evening of the tornado, as well as the official place of his birth, was spared when the tornado allegedly changed directions just before reaching their location. On the other hand, it appears that the house that he and his parents had only recently intended to move into may have been either destroyed or rendered uninhabitable during the tornado, as Elvis would spend the next several years living in the household with his parents and paternal grandparents until they were able to recover from the ordeal. ELVIS IN SCHOOL While in school, his elementary teachers more or less saw him as just an average student, academically speaking. It was not until he took part in a school singing contest that his teachers advised him to put his talents to use and get more serious in his singing ability.  Above: Elvis As A Child Posing With His Parents — Gladys And Vernon In November 1948, when Elvis was thirteen, the family relocated to Memphis, Tennessee, where Elvis would spend the majority of the rest of his life living. Since Memphis was more expensive to live in than Tupelo (the tornado of 1936 obviously impacting housing value) his father was only able to afford a two-bedroom apartment for the family, where Elvis would remain during his remaining school years. Unlike some of his elementary teachers, it seems that Elvis’s middle school and high school teachers took far less of a liking to him as far as his talents were concerned; though that might have been because by then, Elvis was going into far more unorthodox territory in his choice for music. According to a classmate who was in Elvis’s eighth grade music class at L.C. Humes High School, his music teacher gave him a C by remarking that he had “no aptitude for singing.”  Above: Humes Preparatory Academy School — Where Elvis Presley Attended The next day, Elvis tried in vain to win her over by bringing his personal guitar from home and performing “Keep Them Cold Icy Fingers Off Me” and by the end of his performance, when he made a remark that she did not “appreciate his singing” she allegedly gave a blunt agreement. Elvis Presley - Wikipedia For most of his teenage life, Elvis was too much of an introvert to publicly sing outside his apartment. And, due to Elvis being known for being “close” to his mother by his peers, a lot of students used to openly dismiss him as a Mama’s Boy. In later years, Elvis would remark that he failed high school music, and that it was the only class he could never succeed at in a school setting. Nonetheless, by the time Elvis was in his final year of high school, the physical appearance which he would be more well-known for in later years — sideburns, haircut-style, clothing outfit etc. — were now becoming part of his physical life. It is also at around this time that he was entered into a high school music show on the recommendation of one of the few people in the school who was aware of Elvis’s active (private) singing and persuaded him to give it a try.  Above: Elvis Presley As A Teenager Elvis would later claim that his earlier relationship with his neighbour Lee Denson and two other teenagers, Dorsey and Johnny Brunette, whom he began practicing with in 1950, gave him the confidence to make his first serious outside performance in April 1953 in front of hundreds of high school students, parents and staff when he began performing his opening song “Till I Waltz With You Again.” Due to Elvis losing all interest in academic music, he was apparently illiterate when it came to reading music sheets and instead simply relied on a combination of rote memorisation and instinct to get him through a performance.  Above: Elvis Presley Around 1957 Elvis Presley - Wikipedia In the nascent of his career, Elvis listened to dozens of different performers through music records and jukeboxes to practice with. Some of his biggest influences included, but were probably not limited to: Roy Acuff, Ernest Tubb, Ted Daffan, Jimmie Rodgers, Jimmie Davis, Bob Willis, Arthur Crudup, Rufus Thomas as well as his two biggest inspirations: Jake Hess and Sister Rosetta Tharpe, a Black woman who convinced Elvis through her albums to add some Blues to his style of music. SINGING CAREER Four months after Elvis performed before his high school, he went to the Sun Records in downtown Memphis. Even though Elvis claimed he was doing it innocently as a gift album for his mother, there is evidence that he was also hoping he might get noticed by influential people, as the Sun Records even in its then short history of existing, had already been reputed for launching the careers of other singers.  Above: Elvis Presley In 1954 After he left the studio, the thirty-five year old female staff member who had set up his studio performance, Marion Keisker, was ordered by her boss — thirty-two-year-old Sam Phillips — to write his name down for the possibility of future contacts. Nonetheless, despite getting minimal attention during this time, Elvis quickly launched two albums, and both of them failed to get any significant interest from either the population at large, or any reputable agent/investors. As a result, Elvis had mostly given up on a serious career in music and was working as a truck driver. He was turned down for several auditions, including one incident that took place when Elvis was eighteen and was told by Eddie Bond — who was to become famous as a singer himself — that Elvis should focus his career on being a truck driver because he would never be good enough as a singer.  Above: Elvis Presley Posing While Riding In A Truck Elvis Presley Told to Stick to Truck Driving Elvis eventually met a man who went by the name of Tom Parker (later nicknamed the Colonel, when it was bestowed upon him by Louisiana’s then governor, Jimmie Davis). However, Tom Parker was actually born as Andreas Cornelis van Kuijk on June 26, 1909 in Breda, Netherlands, and that he most likely changed his birth name out of fear of being discovered as an illegal immigrant. His non-American citizenship status would later prove a crutch for Elvis, who was forbidden to perform outside the United States (with the exception of a brief tour in Canada in 1957 when Elvis was then only a minor celebrity). Allegedly, Elvis first became a household word a year earlier in 1956 when Elvis performed on the Steve Allen Show. Ed Sullivan had found Elvis’s music to be distasteful and refused to let him on the show.  Above: Elvis Presley Appearing On The Steve Allen Show On July 1, 1956 It was not until he saw Steve Allen — who usually got far lower ratings than Ed Sullivan — suddenly go better in the television ratings after allowing Elvis to perform on his show on July 1, 1956 that Sullivan also relented and decided to let Elvis appear on the Ed Sullivan Show for three segments, with the first starting on September 9, 1956. NOTE: It should be remembered that Steve Allen was every bit as critical about Rock N’ Roll music as his competitor was, though Steve Allen beat Ed Sullivan into accepting the music on his stage first, though with certain restrictions (including Elvis wearing a suit with a bow tie as opposed to his more common outfit). As fate would have it, Ed Sullivan apparently got into a vehicular accident and could therefore not make the appearance. Nonetheless, when Elvis made his second appearance on October 26, 1956, however, Sullivan was present, and Elvis’s dressing restrictions were far more lenient when compared to the conditions imposed on the Steve Allen Show.  Above: Elvis Presley Performing On The Ed Sullivan Show On September 9, 1956 Nonetheless, Elvis himself was reportedly very unhappy with where his music career was going, as he had wanted to sing his own original songs, but was instead made to sing the songs that his manager, the “Colonel” (as he insisted being called) approved of, which were typically songs made by other singers paying a commission for Elvis to more or less advertise for them. Even though I am obviously not certain what the contractual agreement between the two was, I would have presumed that if Elvis really wanted, he could have set out on his own; especially in his later years. Regardless, he never did formally leave his manager, despite being reportedly upset that he was taking as much as 50% of his earnings. By this time, Elvis was also appearing in films, presumably targeted for audiences who were not able to hear him perform in live for one reason or another. As such, with the exception of the 1969 film Charro! filmed later in his career, every Elvis movie ever made was deemed a musical.  Above: Elvis Being Sworn Into The Military It was while he was filming King Creole that he was told on March 24, 1958 that he was going into the military. Elvis had been ordered as early as December 1957 into conscription, though he was able to work out a deal permitting him to finish filming production. He was sent down to Fort Hood, Texas for training, though just before he shipped out, he was able to visit his mother, Gladys, who was dying. (She would die on August 14, 1958 at the age of 46, just before Elvis was due to ship out.) At first, it was presumed that he would be sent to Vietnam, where tensions were already brewing into what would later be the Vietnam War; or perhaps South Korea, where the aftermath of the Korean War was still fresh, and hostilities along the 38th Parallel still just as intense as ever.  Above: Elvis Presley Getting A Medical Examination While In The Army Nonetheless, Elvis was sent to West Germany, possibly because it was comparatively safer, due to the military not wanting to feel responsible for causing the death of a celebrity (though it is apparent that many would have rejoiced at Elvis’s death, as an effigy symbolising Elvis was even publicly hanged and burned alive by an angry mob outside the Ed Sullivan Show). Despite being away from home, his fans continued blossoming while he was working as a private driving jeeps and trucks (quite suitable, I must say, as being a truck driver was Elvis’s original career plan).  Above: Elvis Presley In Germany Posing For The Cameraman Elvis Presley's Army career - Wikipedia During his time in Germany, he reportedly gave one of his few performances when he would occasionally sing some songs before some of the soldiers present, which apparently caused much chagrin for the “Colonel” who was very protective of any profits Elvis would be potentially losing by doing these performances of his for free, and was allegedly told later to stop doing them. ELVIS HEALTH ISSUES Of course, by the time he started to become known, even as early as 1955, Elvis’s shyness may have taken an opposite approach when he suddenly became very comfortable with groping women in public, presumably because he assumed that is what he wanted.  Above: Elvis Presley And Kay Wheeler On April 15, 1956 On April 5, 1956, twenty-one-year-old Elvis was shown with a woman named Kay Wheeler, who claimed that Elvis had been groping her buttocks during an image taken together, and that he “forcefully” kissed her before he ran on stage to perform in front of his 6,000 fans. She reportedly had this to say some years later: “He should have been under freaking arrest. He’s feeling me up in that picture. Those are some of the most blatantly sensual poses that I’ve ever seen him in with a girl.” Pajama party with Elvis! Despite Elvis growing a physical confidence on the outside, it was apparent that Elvis suffered from anxiety and other stress-related issues on a mental level, which he never overcame. In his later years, it would result in Elvis himself becoming physically more aggressive for reasons which were seemingly peculiar for those witnessing his growing outbursts.  Above: George Constantine Nichopoulous And Elvis Appearing Together In Public In 1970 Elvis’s doctor in later life, George Constantine Nichopoulos, would presumably issue Elvis more than 10,000 doses of medication from January 1, 1977 all the way until Elvis’s death on August 16, 1977: an approximate average of just under forty medicinal doses ranging from amphetamines, barbiturates, narcotics, tranquilizers, sleeping pills, laxatives and hormones. It is also said that Elvis especially liked dating women if they reminded him of his mother, and that he was very fond of physical relationships with girls as young as twelve or thirteen. While this in itself is not necessarily bad if someone doesn’t consider physical relationships the same as sexual relationships (in such cases, I would go 50:50) the fact is that if Elvis were to behave like this today, especially with all the alleged groping and kissing etc. that he did, he would most certainly be labelled a sex offender in today’s world, where sex-related issues have since become far more stringent.  GRACELAND Elvis was twenty-two when he purchased the house for which he is now best known for residing in. Even though Elvis may have been generous when it came to donations (such as donating more than $50,000 — $432,571.91 today — in contributions towards the memorial of the USS Arizona lost during Pearl Harbor) or giving out personal gifts to fans, friends, relatives or random poor individuals ranging from clothes to new cars, it should be noted that Elvis was definitely not as frugal as some have claimed when it came to his own personal lifestyle. At the time, Lyndon Johnson reportedly had three televisions in his living room — a rarity back then to say the least — because Johnson liked keeping all three main network channels open in case anything worthwhile appeared on any of the screens.  Above: Elvis Presley TV Room At Graceland In turn, Elvis outdid Johnson and customised his own living room to also have multiple television screens. Even though Elvis performed in his own movies, he did not enjoy watching himself on screen (understandable, as it is always a bit strange seeing yourself on any device). Rather, Elvis’s favourite movie was the film Patton; a war movie about George Patton played by George C. Scott. It is said that Elvis watched the movie so many times that he eventually learned all the lines in the movie and would even physically reenact some scenes as part of his home entertainment. 75 things you didn't know about Elvis Aside from television, Elvis also had his own jungle room created inside his home with a full-time functioning waterfall, plus an arcade room, racquetball court, and music stereos capable of playing throughout the house etc..  Above: Graceland Jungle Room All of these would be seen as fairly lucrative even by today’s standards. In 1977, however, this lifestyle would have been unimaginable for 99.99% of the population. ELVIS DIES (…OR DOES HE?) By 1973, Elvis had divorced Priscilla Presley, whom he had met when she was fourteen and he was twenty-four while stationed in Germany, as her father was a senior officer working near Elvis’s place of employment. He had several unsuccessful relationships afterwards, though it seems he was probably single on the night of August 16, 1977 when Elvis had a party with some of his friends at his home.  Above: Last Song Elvis Ever Sang In Public Some evidence suggests that Elvis had agreed to marry Ginger Alden, who was twenty at the time, two months earlier, though it is quite probable that Alden was more involved in the relationship than Elvis was. According to another woman named Barbara Hearn, he once said this about Elvis: “My husband tells everybody that Elvis and I dated steadily for a year. And I say, ‘No. I dated him steadily for a year. He didn’t date anybody steadily for more than 15 minutes.”  Above: Quite Likely The Washroom Elvis Presley Died In It was while he was in the washroom shortly after his party that his demise came about. You know those feelings you get where you try to force yourself to poo faster? Well, that is what Elvis was most likely doing when he suddenly got a heart attack or a stroke, as it takes a lot of stress on your body to do that, and Elvis’s medication, combined with the stress he was already dealing with on a daily basis probably did not help with his situation. https://goat.com.au/music/never-forget-elvis-presley-died-on-the-bog-because-he-really-struggled-to-poop/ Several hours later, Ginger Alden herself decided to venture into the washroom and found Elvis dead in a “sitting” position, except his body had fallen forward off the toilet at some point and was now in the stage of rigor mortis.  Above: Baptist Memorial Hospital Where Elvis Was Pronounced Dead It was no surprise that doctors could do nothing more for the now clearly dead Elvis, as his death was formally announced at 3:30 PM at Baptist Memorial Hospital. LEGACY In his later life, Elvis’s daughter would have multiple marriages, including one with Michael Jackson, whom Elvis had reportedly befriended during his lifetime.  Above: Elvis Presley Giving A Personal Performance For Michael Jackson Despite never performing (officially) outside the United States, save for a few concerts in Canada in 1957, it seems that even in East Asia, Elvis was a hit. George W. Bush in 2006 became the first sitting president to visit Graceland when the Prime Minister of Japan at the time, Junichiro Koizumi, who was a major Elvis Presley fan, was visiting the United States and expressed his wish to visit his home.  Above: Junichiro Koizumi And George W. Bush Touring Graceland In 2006 Even though the original Elvis is no longer around to perform in film, adaptions of Elvis have abounded since then, ranging from his appearance in Forrest Gump, all the way to Bruce Campbell playing a retired Elvis who had faked his death in a horror comedy where he must fight against mummies and zombies. His father, Vernon Presley, would outlive his son by nearly two years (June 26, 1979), while Elvis’s grandmother would in turn outlive her own son by just under a year when she died on May 8, 1980 at the age of eighty-nine. Regardless of what one thinks of Elvis: despite being deceased for a period longer than he was alive, it does not seem that his music is about to lose its appeal for his fans any time soon.  BONUS Since I know all about the Elvis Is Alive theories out there, ranging from his alleged appearance in Home Alone all the way to being a worker at Graceland etc. here is one funny theory I thought was especially amusing when I first heard about it. That Elvis Presley is Donald Trump! According to the theory, the real Donald Trump conveniently died at around the time Elvis was thinking of ditching his life as a singer and was asked by his father, Fred, to help take his place in order to prevent any negative attention from being directed against his company. Other evidence used to “prove” that Elvis Presley is now living the life of Donald Trump, include the haircut style, as well as several remarks made by politicians, including Trump himself.  Above: One Of Several Videos Where Trump Supposedly “Hints” At Being Elvis — His Blond Hair Joke Is Sort Of Amusing As Elvis Was A Natural Blond Who Dyed His Hair On one occasion, Jimmy Carter halfheartedly stated in an interview regarding Trump’s popularity that “Trump is Elvis” and then there was a rally speech by Donald Trump when he said “Elvis is here with us tonight!” Well, if this all ends up being true, then I suppose one could say that Elvis never left the world at all, but has since been residing at the White House… And he has yet to leave the building!  Above: Elvis Presley Shaking Hands With Richard Nixon At The White House ",
            "date": "Answered March 24, 2020",
            "views": "58",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christine George",
                    "user_href": "/profile/Christine-George-8"
                },
                {
                    "user_id": "Matias Jauhojärvi",
                    "user_href": "/profile/Matias-Jauhojärvi"
                },
                {
                    "user_id": "Kathryn Herzog",
                    "user_href": "/profile/Kathryn-Herzog-1"
                },
                {
                    "user_id": "Jorge Campus",
                    "user_href": "/profile/Jorge-Campus"
                },
                {
                    "user_id": "Ronda Drake",
                    "user_href": "/profile/Ronda-Drake-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ahmed-Md-37"
                },
                {
                    "user_id": "Angela Mortenson",
                    "user_href": "/profile/Angela-Mortenson-3"
                },
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Kiran Kunwar",
                    "user_href": "/profile/Kiran-Kunwar-13"
                },
                {
                    "user_id": "Robert Evans",
                    "user_href": "/profile/Robert-Evans-400"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antony Wolfson",
                "href": "/profile/Antony-Wolfson"
            },
            "answer_text": "I'll try and answer this. Unfortunately I would love to be able to say I met him but I was eleven on the 16th August 1977 and never did although I've experienced his presence spiritually. I do however know a number of people who knew him very very well indeed. And I have spoken with them and they have shared some of their personal experiences of who he was with me. And I can tell you categorically that Elvis was a thoughtful, kind and extremely generous person. Deeply religious and respectful of people. He adored his fans. He had good honest values. Was humble and gave his all to his craft. He adored his mother and never really recovered from her death. He adored Priscilla who I can tell you - first hand - is a lovely woman. He also didn't think he would be remembered after his death. Elvis had a quick temper at times - but was also deeply caring and felt guilty if he lost it. Elvis was human with some faults as we all share - but I can tell you this. He is now happy, reunited with his beloved mum and dad. And at peace. I am one of many millions who misses him and I love him dearly. ",
            "date": "Answered August 11, 2018",
            "views": "76",
            "upvotes": " View 55 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John King",
                    "user_href": "/profile/John-King-747"
                },
                {
                    "user_id": "Torri Tucker",
                    "user_href": "/profile/Torri-Tucker"
                },
                {
                    "user_id": "Kathryn Herzog",
                    "user_href": "/profile/Kathryn-Herzog-1"
                },
                {
                    "user_id": "Jorge Campus",
                    "user_href": "/profile/Jorge-Campus"
                },
                {
                    "user_id": "Angela Mortenson",
                    "user_href": "/profile/Angela-Mortenson-3"
                },
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Debbie Fellman",
                    "user_href": "/profile/Debbie-Fellman-2"
                },
                {
                    "user_id": "Doug L",
                    "user_href": "/profile/Doug-L-3"
                },
                {
                    "user_id": "Angie Camarena",
                    "user_href": "/profile/Angie-Camarena-1"
                },
                {
                    "user_id": "Cheryl Wickes",
                    "user_href": "/profile/Cheryl-Wickes-1"
                }
            ]
        }
    ]
}