{
    "title": "What do you prefer, 49 keys midi keyboard or 61 keys midi keyboard for your home studio? - Quora",
    "tags": [
        "MIDI Controllers",
        "MIDI",
        "Music Production Software and Apps",
        "Keyboards (instrument)",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Fenton",
                "href": "/profile/Roger-Fenton-5"
            },
            "answer_text": "I’ve used a number of midi keyboards over the years - from 25 key synth action to 88 note hammer. The compromise tends to be between convenience (size and weight) musical expressiveness. The 49/61 choice largely depends on your intended use - if you are going play ‘proper’ piano and keyboard music, with chordal bass, or study a piano course, you need 61 keys. If your going to be playing mainly monophonic synth bass parts and lead, or emulating string or horn sections, or pad parts, then 49 is fine. The choice in the end is not down to the gap between the lowest and highest note since the whole keyboard (or often sections of it) can be transposed. The choice is down to the style of music you want to play. Of course if you have the room, get the 61! (I say 61 here as the longer boards tend to put the pitch bend and mod wheels above the keyboard, a position I dislike - if this doesn’t bother you, go longer - great for split keyboard arrangements.) Hope this helps ",
            "date": "Answered February 20, 2019",
            "views": "625",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ayush Nema",
                    "user_href": "/profile/Ayush-Nema-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giovanni Galvez",
                "href": "/profile/Giovanni-Galvez-1"
            },
            "answer_text": "88 ",
            "date": "Answered February 20, 2019",
            "views": "189",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                }
            ]
        }
    ]
}