{
    "title": "What's a band or musician you always wanted to see but never got the chance? - Quora",
    "tags": [
        "Independent Music",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcelo Soares",
                "href": "/profile/Marcelo-Soares-1"
            },
            "answer_text": "I’m a fan of Deep Purple, but I’ve never saw them for myself in my favorite lineup: Mark 2, with Ritchie Blackmore and Ian Gillan sharing the stage with Roger Glover, Ian Paice and Jon Lord. On their peak, they split up three and a half years before I was born; when they regrouped, twice, they never came to my country with that lineup. When they first came with Blackmore, their singer was not Ian Gillan. When they began coming to Brazil regularly, Blackmore was gone and doing something else. That lineup (1969–1973) was POWERFUL.  When they returned (1984–1988), they were still damn good.  In the second return (a few months in 1993), they could be on fire if all the stars aligned.  Of course, Blackmore left slamming the door. Deep Purple got Steve Morse, a skilled and smiling guitar player, and they’re on the road with him to this day. It’s impossible to have them back. Jon Lord is dead. Ritchie Blackmore is complicated and arthritic. The other three are in the band but they shun the idea of having their former colleague back even for one day. There was a remote chance they could have played together in 2016, when Deep Purple was inducted to the Rock’n’Roll Hall of Fame. Lord was already dead, but I was pretty much thinking about going if they could play together, even if I didn’t believe it would happen. In the weeks before the gig, things escalated. Know your heroes and you’ll never waste money. Blackmore released a note saying he had he had been forbidden to go by Deep Purple’s current management (his former management, by the way). That never happened, but it always gains headlines in the lazy rock press when he says it. Other inducted Deep Purple members also were not really interested in sharing the stage with other former colleagues. Some of them are very angry about it to this day. People are strange, but that’s another band’s song. ",
            "date": "Answered May 24, 2019",
            "views": "332",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lea Harrelson",
                    "user_href": "/profile/Lea-Harrelson"
                },
                {
                    "user_id": "Nelson Morgan",
                    "user_href": "/profile/Nelson-Morgan-11"
                },
                {
                    "user_id": "Brandon Schaben",
                    "user_href": "/profile/Brandon-Schaben-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Abell",
                "href": "/profile/Christopher-Abell-8"
            },
            "answer_text": "Two very different artists/bands. The first is Lou Reed. Lou Reed had been a part of my youth since I was about 10 in 1974. I listened to him like crazy, and considered him a classic New Yorker. I worked in a music store in Midtown Manhattan (Sam Ash) and ran into Lou about a dozen times. We would chat, I would make jokes about him hiring me for his band, etc. But, I NEVER saw the guy. I cannot process that. Not seeing Lou Reed perform in New York is like going to Paris and not seeing the Eiffel Tower. I don’t know what happened. The second band - Overkill. I’m an old Metal head from New York, and I would go to 200 shows a year back in the day. I also worked at a handful of Rock Metal clubs there. Overkill was from New Jersey, but played on the NY circuit. I don’t know how I missed them, but I missed them. ",
            "date": "Answered May 24, 2019",
            "views": "370",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathie McDonald Rost",
                    "user_href": "/profile/Kathie-McDonald-Rost"
                },
                {
                    "user_id": "Lea Harrelson",
                    "user_href": "/profile/Lea-Harrelson"
                },
                {
                    "user_id": "Taylor Hardy",
                    "user_href": "/profile/Taylor-Hardy-31"
                },
                {
                    "user_id": "Diane Karr",
                    "user_href": "/profile/Diane-Karr-1"
                },
                {
                    "user_id": "Nelson Morgan",
                    "user_href": "/profile/Nelson-Morgan-11"
                },
                {
                    "user_id": "Brandon Schaben",
                    "user_href": "/profile/Brandon-Schaben-1"
                },
                {
                    "user_id": "Bill Lonero",
                    "user_href": "/profile/Bill-Lonero"
                },
                {
                    "user_id": "Floyd Aranyosi",
                    "user_href": "/profile/Floyd-Aranyosi"
                }
            ]
        }
    ]
}