{
    "title": "What was 1960s music like? - Quora",
    "tags": [
        "1960s Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Rowley",
                "href": "/profile/Ken-Rowley"
            },
            "answer_text": "1960s music was as incredibly varied as now, but the main difference was that this music was all part of a kind of monoculture. You see, you got to hear new music via radio and television, and everyone listened to and watched the same few stations. So in a weekly chart you would get singles bought by youth, their parents, and their parents. To give a famous example: in 1968 ‘Lazy Sunday’ by the rock band The Small Faces—a tongue-in-cheek riposte to the older generation—was kept from reaching the top of the charts by Louis Armstrong’s ‘What a Wonderful World’ which was bought by the Small Faces fans’ mums and dads. Another difference was that it was the golden era of singles—two and three minutes of catchy hits—rather than albums, which really came into their own in the later 1970s. And of course it was an era pre-synthesisers, electronic drum machines, and digital state of the art designer studios. Most singles weren’t even in stereo. ",
            "date": "Answered October 5, 2017",
            "views": "238",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susan Altman",
                    "user_href": "/profile/Susan-Altman-7"
                },
                {
                    "user_id": "Mark H. Spud Friedman",
                    "user_href": "/profile/Mark-H-Spud-Friedman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Martinez",
                "href": "/profile/Steve-Martinez-7"
            },
            "answer_text": "The music of the early sixties was pretty melodic, softly wooing, gently encouraging. However, once The Beatles, The Rolling Stones (and so many more) arrived on the music scene, it was basic rock & roll explosion, and dancing took on a whole new level. Music became an event, a happening, instead of simply background. ",
            "date": "Answered June 21, 2014",
            "views": "178",
            "upvotes": "0"
        }
    ]
}