{
    "title": "What is the meaning of Coldplay's song, 'Something Just Like This'? - Quora",
    "tags": [
        "Something Just Like This (2017 song)",
        "Coldplay (band)",
        "Song Meanings",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Kitson",
                "href": "/profile/David-Kitson-1"
            },
            "answer_text": "I had to think about this for a while, so listened to the song. At first, the choices certainly seem strange. But on reflecting, I think a lot of the song’s lyrics are more literal than they appear. Each like can be taken as something that the song’s protagonist feels himself to be missing - this element would appear far more important than the actual examples provided. eg; Achilles and his gold. Achilles is better known for his heel, being his weakness. But to a lesser extent he’s also known for his treatment wealth, and it’s influence on his fame. Hercules and his gifts. Hercules wasn’t so much gifted as he was born with strength.But to a lesser extent, his beauty and strength could be thought of as gifts. Spiderman’s control. Spiderman is known for shooting webs and walking on walls.But to a lesser extent, he’s also known for his self control, something he only ever lost once at the start of the story. Batman and his fists. Batman is better known as a detective who uses expensive technology.But to a lesser extent, he’s also known for being able to fight and protect people. Superman and his suit. Superman is known for being super.But to a lesser extent, he also uses it to cover his identity and Clark Kent never takes the credit. So why these choices? Sure, it’s not something that the superheroes were known for, but for each it was a virtue they possessed. And each is something the protagonist feels he is lacking. Money ( or, alternately, a lack of greed )Beauty and StrengthSelf ControlThe ability to fight to protect someone.Humbleness.These are probably five important things we would like to have to support the people we love in every way possible. By contrast, the protagonist considers himself; Poor and greedyWeak and UnattractiveQuick to angerUnable to defend those he lovesBrash and BragfulBut on finding someone who loves him, they express they don’t need those things, that what they are wanting is just someone to love and to love them back. In this, I think is the meaning intended in the song - that all we really want is to be loved, is the key meaning, and that in finding someone like that, who only loves and wants to be loved in return, that the things we tend to think are important in a relationship aren’t as important as that one singular aspect. It’s a song that dispels the concept of a soul mate, which is the opposite of such a relationship, where the aspects of the other person must be perfect in each and every way to the other partner, such that they fit each other whether love is present or not. In this, I’d agree. The happiness from love alone is enough for a lifetime, even without being able to change the person we are, or the person that we’re in love with. Being able to accept someone with each and every one of their flaws is something that doesn’t waver. After all, there are times in our lives when we all have those flaws. I know I do, and it’s not just at times either. But that’s OK because when it comes to love, I’ve got something just like this. Finally, the woman not only explains what she wants, but not once does she suggest to the protagonist that he doesn’t have those qualities. Nor does she necessarily accept that he doesn’t possess them. So it’s entirely possible that his fears only exist in his own head. More than likely, the protagonist is sufficiently wealthy, attractive, patient, protective and humble to her. ",
            "date": "Answered October 9, 2018",
            "views": "78",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suhrid Bhattacharya",
                    "user_href": "/profile/Suhrid-Bhattacharya"
                },
                {
                    "user_id": "Prateek Surin",
                    "user_href": "/profile/Prateek-Surin-1"
                },
                {
                    "user_id": "Vineet Singh Bist",
                    "user_href": "/profile/Vineet-Singh-Bist-1"
                },
                {
                    "user_id": "Jing Jing",
                    "user_href": "/profile/Jing-Jing-305"
                },
                {
                    "user_id": "Ruth Ramos",
                    "user_href": "/profile/Ruth-Ramos-1"
                },
                {
                    "user_id": "Nimae Rahma",
                    "user_href": "/profile/Nimae-Rahma"
                },
                {
                    "user_id": "Faith Onowise",
                    "user_href": "/profile/Faith-Onowise"
                },
                {
                    "user_id": "Aditya Umarjikar",
                    "user_href": "/profile/Aditya-Umarjikar-1"
                },
                {
                    "user_id": "Aakash Shinde",
                    "user_href": "/profile/Aakash-Shinde-66"
                },
                {
                    "user_id": "Samiksha Sinha",
                    "user_href": "/profile/Samiksha-Sinha-2"
                }
            ]
        }
    ]
}