{
    "title": "What is the best PC vs Mac for filmmakers and video editors? - Quora",
    "tags": [
        "Video Editor",
        "Video Editing",
        "Mac (computer)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberto Santocho",
                "href": "/profile/Roberto-Santocho"
            },
            "answer_text": "I’ve owned a consulting company in Silicon Valley for 40 years and every single one of my clients uses Macs for filmmaking and editing. They demand systems that are dependable, reliable, virtually immune to viruses and hackers, in other words they want systems that hav ether best uptime, are easiest to use, last many years with no significant cost associated with them and they choose to use Macs. In the long run, starting since the very first days when we did simple documentaries on the earliest editing software, we have proven the Mac platform to be the most cost effective, reliable and easiest to use platform on the market. We have clients today with ancient Macs that still do video editing on a daily basis and they are completely reliable. That is what makes them the best. ",
            "date": "Answered October 30, 2019",
            "views": "117",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ludvig Kári Forberg",
                    "user_href": "/profile/Ludvig-Kári-Forberg"
                },
                {
                    "user_id": "Judith Engelstad",
                    "user_href": "/profile/Judith-Engelstad"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Crossman",
                "href": "/profile/John-Crossman-6"
            },
            "answer_text": "A well built PC will do a great job and you can get high end performance for less than a Mac. I have used Mac’s since they came out in 84 and use one now. I have been generally disappointed with many of their decisions in the past few years, FCPX, The Garbage can mac Pro. I use a 2012 12 core Mac Pro and it has generally been a work horse. If I had to replace it tomorrow I would probably stay with an iMac Pro but… They have a new MacPro coming out any day now and the advance buzz is very exciting but it may cost double of what a workstation PC would run for many of the same parts. That being said, I haven’t seen and 24 core PC’s, but you will pay a lot to get the new MacPro fully decked out. If you have a system you know better, go with that. If you are using FCPX and motion you have to use a Mac. All other software will either run on both, or PC. ",
            "date": "Answered October 26, 2019",
            "views": "117",
            "upvotes": " Answer requested by Ken Humphrey"
        }
    ]
}