{
    "title": "What do you think of Jennie of BLACKPINK? - Quora",
    "tags": [
        "Jenni Rivera (singer-songwriter)",
        "BLACKPINK"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abigail Lee",
                "href": "/profile/Abigail-Lee-157"
            },
            "answer_text": "I love Jennie but I don't agree with her actions. This isn't hating on her, I'm just voicing out what I think about Jennie's recent unnecessary behaviour...cause Everyone thinks that if someone isn't talking nice about Jennie It's a hate comment. 1. Jennie is taking out her anger on YG by not being a good performer. Lol. It sounds ridiculous. But at Least makes sense. Jennie literally has called out YG and his treatment towards them. She goes on and on trying to call out YG. So it's obvious that she can also got to such lengths and not perform well. I don't know but...it surely does more harm to her and the group more than YG. I'm just saying this because jennie has nothing else to talk about other than YG. It would be much better to voice out her concerns on their treatment to YG's face itself rather than saying it to fans cause fans can't do anything about it. 2) Jennie is biased towards performing in America & Korea. There's nothing to hide here. It can clearly be seen. She has more interest in performing in America than in Korea. What she's doing is completely wrong. She should concentrate on doing well in Korea. As I have said multiple times. International fame isn't guaranteed. Also it's really bad...she just half asses her performance in Korea and does well in America...that's bad treatment towards fan. I think it's not only having to call out YG but Jennie needs to be called out on her treatment to fans. Since the past year she's just being disappointing fans again and again. Sorry not sorry. This is not hate. I'm just saying how everything is. Too bad the truth hurts. 3) Rapping. Jennie is a really good rapper but not the best. Whatever the rap is jennie always tries to rap fast. Like...rap is not only about singing the words fast it's also about the rhythm and flow...why dosen't she get that? Honestly...Jennie should get most of the rap parts. But I think because Lisa has no other position except being the main dancer and rapper YG just dumps all the rap parts onto Lisa. Cause sub vocalists aren't that used in a group. 4) Singing. Now...Jennie has a really raw & a rough voice. Which isn't generally the best..I mean cause you sound as if you are screaming. But...it's Jennie's responsibility to control her voice. The first few parts of Solo, Jennie sings well...till she sings the last verse and ruin Every thing. I don't think it's good to give Jennie parts where she has to sing high notes. It's very risky and don't come out well with Jennie's type of voice. But...the thing is...she barely sings the song and I - I don't understand. Blinks just spread videos of Jennie singing while she's just sitting or standing with no movement. Obviously it's easy to sing when there's no movement. But Jennie can't perform well while she's dancing. And ironically...blinks barely like to share the videos where Jennie's voice is weak...so that explains it all there's no point in trying to ignore it. Trained for 6 years and yet she can't sing properly while performing...I don't know what is there to expect from that. Also when she sings she tries to sound too sexy like she literally sounds as if she's having an orgasm while singing. And yeah she lip syncs...don't try to ignore this shit. It's being proved multiple times...you are just a fool to deny it. I mean other people die to have Jennie's spot meanwhile she's just on stage singing 5 lines. Blinks are only hyping Coachella. Like that's just a one time happening. Blackpink hasn't given a good performance like that after Coachella so hold your horses. 5) Jennie is the \"Villain\" of kpop. I explained this in another answer. But I'll say it briefly. Jennie isn't the villain of kpop and you people have to stop calling her that. She didn't hurt anyone, do bad to anyone so I don't know why She deserves this title. Just because she gets hate alot dosen't mean you can call her a villain - it makes no sense. There are so many other celebrities who get tons of hate so I don't understand why Jennie is an exception and given that name. Ironically the people who preach about telling people to stop hating Jennie - I mean blinks...Blinks themselves yell at people to stop hating on Jennie and they themselves name Jennie as the Villain of kpop. Like Every time I see a person calling jennie a villain they are blinks. Like no other person named or called jennie a villain but blinks themselves call jennie a villain...maybe blinks should stop acting like saints...cause they ain't. There's no point in telling other people to stop hating on her when literally her own fandom calls her like this...this is what you call hating not when someone talks about her singing and stage presence. 6) The jennie breaking rules of YG because she dated. So Jisoo said that they can break the rules of YG if YG gives them permission. But the thing here is...that YG himself didn't know about Jennie & Kai dating! There you have it...YG stated that he had no idea of them dating...so it's obvious that Jennie broke the rules of YG. Cause YG didn't give them permission to date until the news broke out. But...I'd say...Kai did Jennie ugly. PERIOD!!! Just look at the aftermath of the dating news...Kai got No hate but Jennie had to carry all the hate. Yes as usual the female is the one to blame. But if Kai had a bit of Common Sense in him he would have thought twice before dating Jennie. Obviously they won't get out Scott free. But Kai was selfish and only thought about himself and just 1 month after the news broke out they broke up...Nice! Also I don't understand why Jennie & Kai didn't handle the situation properly like...what were they expecting? That they won't be caught? Also fans should stop being delusional and thinking that Kai & Jennie are still together…like? No why do you want to comfort yourself with lies? There's no point in it! 7) Stop Labelling her as a Savage for everything. Yes Jennie is a Savage Person. I myself is a savage person. But there's a clear line to being Savage & being rude. During Knowing Bros, I thought she was savage & cool for passing a comment like that but later as I realized the comment she made was also a belittling comment too. Koreans aren't very much good in English & they have pretty low knowledge on other countries and cultures. Whereas Jennie was brought up in New Zealand. She knew how poor the knowledge koreans had about other countries. And when the hosts questioned her she asked \"Do You Even Know Any Cities In New Zealand?\" Like...that's belittling a person. So what if a person has little knowledge on something she can always tell them more about it instead of questioning them and making them look dumb just to make yourself look cool. But at the end Jennie was backfired because the host knew cities in New Zealand and the way she tried to act like nothing happened after she was proved wrong. It was really wrong of her to assume that the host had no knowledge about that country & belittle him Like that. There's no savageness over here. About the Lisa thing...yes certain actions seemed rude. Like the time she pulled jisoo and Rosè together and saying only 3 members are there. That's rude. Why? Cause I have been in situations like that and Honestly it hurts. And alot of people agree that it was hurtful cause they have been in the same position. Those who don't agree might haven't experienced such a situation or as delusional fans it's their hobby to even glorify the wrong actions. Jennie used to cut off or sometimes snap at Lisa that's not nice but at Least Jennie reformed her behaviour towards her. But...the problem I have is...she's kind of trying to sexualize with Lisa. Like touching Lisa all over her body, coming and rubbing herself on her..it sounds ugly but there's no other way to explain this. If she wants to treat lisa better then she can just give her a hug or praise her and appreciate her she dosen't have to go and touch lisa here and there. I think it's because these stupid blinks have been shipping them together and Jennie just wants to please her fans so she does these stuff. 8) I don't like Jennie's method of Fan Service. Like...she tries to lure fans in all lustful ways. Putting her tongue out...going and touching members here and there...sexualized movements...yes she's a grown adult and she can do whatever she wants but there's a limit to it. She's trying to behave like all those western artists. Like No! 9) If she's finding the outfit uncomfortable why the hell did she agree to wear it? All blinks give various excuses for Jennie's lack of interest in her job and one of them is \"It's because the outfits are uncomfortable!\" Jennie is the fashionista of the group. But that dosen't mean she needs to wear every single outfit that's dumped on her. Jennie clearly has spoken out that she also gets involved in choosing her outfit. So if a particular outfit is uncomfortable for her then why does she agree to wear it? That's not the only outfit there is. Also she's from YG she can have tons and tons of outfits she desire. So why can't she just wear something that's comfortable for her? 9) Jennie is taking her job too lightly. Jennie is a celebrity. Being a celebrity dosen't mean that you can just simply appear on camera and be paid thousands and millions and then use that money to go on vactions here and there. Now that jennie has secured her spot in the entertainment field she thinks she can do everything she wants to and mess up badly and expect that she's on the top of the list. Celebrities can't do that! Even a small action can be full blown to lengths...jennie can't understand the severity of the situation. Jennie always expects her fans to defend her from everything. Jennie thinks that her fans will always be there for her no matter what but those things aren't always guranteed - one small slip and you lost it all. Jennie had already lost a lot of fans with her own doings if she isn't careful that's it. 10) Jennie should fix her attitude. I mean nowadays she always acts really moody on camera. In the airport she's always trying to hide. Like...just why can't she carry herself with a smile for a few minutes. It's not like the reporters are going to follow you until you board the plane! They only follow you until the security checkpoints and then leave. So why for a few minutes she can't smile. I know she might not be feeling well and it's hard I know that feeling but just for a few minutes...why? Also during the Samsung event it wasn't the organizers at fault but Jennie too... Indonesian blinks told that jennie was already moody since she entered and blinks were just wondering why....so...why put all the blame on the organizers when Jennie was at fault too? Just how many blinks tried to attend that event by paying tons of money and there you are already acting badly enough. 11) If Jennie can't handle the celebrity life then she should just leave. Being a celebrity is a very demanding job and if Jennie isn't going to give into the demands then she might as well leave the entertainment industry all together cause that job isn't good for her. ",
            "date": "Answered February 19, 2020",
            "views": "15",
            "upvotes": " View 123 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zara Smith",
                    "user_href": "/profile/Zara-Smith-118"
                },
                {
                    "user_id": "Mado MK",
                    "user_href": "/profile/Mado-MK"
                },
                {
                    "user_id": "Nitin Kumar",
                    "user_href": "/profile/Nitin-Kumar-3000"
                },
                {
                    "user_id": "Nitin Hardas",
                    "user_href": "/profile/Nitin-Hardas"
                },
                {
                    "user_id": "Anuja Raja",
                    "user_href": "/profile/Anuja-Raja-1"
                },
                {
                    "user_id": "Kate Jimenez",
                    "user_href": "/profile/Kate-Jimenez-9"
                },
                {
                    "user_id": "Maira Rehman",
                    "user_href": "/profile/Maira-Rehman-7"
                },
                {
                    "user_id": "Gianne Juson",
                    "user_href": "/profile/Gianne-Juson"
                },
                {
                    "user_id": "Blinkeu",
                    "user_href": "/profile/Blinkeu-4"
                },
                {
                    "user_id": "Croft",
                    "user_href": "/profile/Croft-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Estrella Salazar",
                "href": "/profile/Estrella-Salazar-2"
            },
            "answer_text": "MMMMmmm… I think as a Blink it is my duty to clear up any misunderstanding between how non-fans/anti sees Jennie Kim, vs. how, us, Blinks know Jennie Kim. OK here we go. Let me introduce you to the wonderful world of BLACKPINK introducing: Jendeugi… I mean Jennie. So you don't know what to feel about our Sassy Jendeukie, huh?  It’s okay. I can understand, especially when you got used to seeing kpop female idols being cutesy and are absolute angels all the time. Before I go in depth, let’s start with formalities first: Birth Name: Kim Jennie (김제니) Nicknames: Jendeukie, Jendeugi, Nini,JPosition: Main Rapper, Lead VocalistBirthday: January 16, 1996 born in: Anyang, province of Gyeonggi, South Korea Height: 163cm (5’4″)Weight: 50 kg (110 lbs)Blood Type: B The only Child She trained for 5 years and 11 months (2010 August). the first member to be revealed on June 1, 2016 She has dogs named Kuma and Kai (shown respectively)   (Kai and Kuma are very close as they grew up together.) now let’s go in depth with our Mandeukie: She is know as “Human Gucci” ,because of the way she rocks all her Gucci wardrobes until Her fashion-forward ensembles have also caught the eye of several fashion brands, including Chanel. She was officially named the French fashion brand's Korean ambassador in June 2018. And now, we call her “Human Channel”. 2. She is considered the Fashionista of the group. When she was younger, she enjoys reforming clothes and combining different pieces in different ways. She was handed a hand-me-down vintage chanel from her mom’s closet before she was even a pop star. “Whatever Jennie wore, like a vintage crop top and cargo trousers, mainstream shopping sites started to mass produce. In 2019, music fans and fashion lovers noticed she started wearing statement pieces from the early 2000s, like pointelle knit crop tops and wide-legged jeans, as well as sporting short-handled shoulder handbags and wearing silk scrunchies. As a result, shops around Seoul started stocking imitations of what she was photographed in.”- South China Morning Post 3. She is interested in things that aren’t in her time or age. 4. She is a good cook amongst her members. She loves to cook and is thinking of learning professionally.  5. Jennie studied abroad in New Zealand at ACG Parnell College. 6. Because of her international background, she is able to speak both English and Korean fluently, and has added Japanese to the list of languages she is able to communicate with as well. 7. Her all-time idol is Rihanna 8. She gets scared easily. 9. She can eat crackers without making a sound! (no, that’s a joke. She can’t. She tried though). 10. Jennie can also play piano and flute. 11. She acted in G-dragon’s “That xx mv” and “ Black LEE Hi’s”. She also appeared in Seungri’s “GG be”. 12. Jennie is an all rounder. She can RAP, SING and DANCE. 13. She has a motion sickness issue. 14. She is one of the best brand ambassador. She is loyal to the brands that she is endorsing. During their world tour Jennie avoided iphones like a plague and only took Samsungs. She was even advertising Samsung during their v-lives. When she became the brand ambassador of Chanel, she ditched Gucci and now is seen mostly in Chanel. Arguably, Jennie is one of the most controversial Idols out there.  Things that Jennie get hated for: 1. YG's princess - Even before their debut Jennie got a lot of promotion and hype from her company, especially from GD and Seungri ( members of BigBang). Fans noticed that in every stage, Jennie seems to be the one who has the most beautiful and luxurious outfit. Furthermore, in their MVs and concert, her outfit standout the most and is distinguishable amongst her members. She is also the member with most lines, always in center of photoshoots and commercials, and promoted more (Although, in KTL era, this seems to be not the case anymore after YG received a huge backlash from fans). reason for this: Their stylist have already explained that Jennie always participated on the outfits that she is going to wear. She always put her personal touch on her every attire. It is evident that in every YG groups, YG always favors the main rappers. From GD, CL, Hanbin to Jennie. Jennie is the face of the group that's why she was always the center and pushed more. (Although, I personally don't agree with any of this, this is how kpop works). 2. Was accused of acting cute- I have seen a lot of comments accusing Jennie of faking her cuteness. Jennie, actually hates doing aegyo, people around her had to asked for aegyo before she obliged. Her cutesy behavior is rarely seen in BlackPink house. 3. Was accused of being Rude - “She is not Savaged. She is just plain rude!” This is mostly the opinion that I read regarding Jennie's savage personality. Actually, you are right! She is not savage at all, that throne goes to Jisoo, but she is Sassy. She is someone that is bold and little fiesty. Someone to disregard the status qou. Jennie has an assertive nature and quick comebacks. Is she rude though? Nope. She is never seen disrespectful to anyone. 4. Bullying- she was accused of bullying a classmate which was later proved to be fake and a rumour spread by a YG anti. She was accused of bullying Lisa. Actually, she is just straightforward when it comes to her remarks. This may come off to fans who are used to seeing modesty in girl idols, but Jennie isnt complacent with the norm, she grew up in a western country where people say things as it is. Jennie and Lisa have a good relationship, and isnt seen being awkward to each other. We all have that one friend who just say it as it is.  5. Resting Bitch Face - I never came across of any comment regarding her RBF, but apparently, she is also getting hate for this. Idk, it’s really tiring smiling all the time. 6. Was accused of being fake- when Jennie guested on Running Man, a lot of people had mixed emotions when Jennie cried a lot during the haunted tunnel. Yeah, I saw that too. I actually do agree with you on this. Remember though that a lot of idols are encourage to exaggerate things in order to make something interesting. After Jennie's guesting, the episode had a high viewer ratings that they invited Jennie to be their guest again in which she happily accepted. In conclusion: This Kid has been misunderstood a lot. Had faced hatred and criticism and is undoubtedly scrutinized the most amongst her fellow BlackPink members.  So, Who is Jennie Kim to blinks? I won’t be writing here how Jennie is such a “dork” or a “crackhead” like other Kpop Idols because honestly, Jennie Kim is different to that. She may once in a while show her dorkiness but she isn’t really known as someone like that. She is Sexy and Fierce. A rebel who tries to unbound herself from any constraint of a kpop Idol: CEO Jennie Kim Jennie’s Rich and sophisticated style have made us,blinks, wonder if Jennie will soon takeover the YG entertainment in the future. If not, she is still set to be one someday knowing that her family is rich and a major shareholder of a famous entertainment group CJE&M.   2. Caring Jenie always teach and encourage Jisoo to speak english. She takes care of her members: She is always the first one to comfort Rose when crying, She warms Jisoo’s hands when they are outside in the cold promoting, assuring blinks that they will take care of Lisa. She took her member’s baby pictures as she believes it will bring her goodluck. She is the member who interacts with blinks the most. She even turned an anti to becoming her fan. 3. Outspoken She is blunt when she address her concerns to the company. When the others hesitate to tell their stylist or makeup artist what looks they want to incorporate, Jennie has no trouble with it at all. She participates on deciding how she wants to look and what to wear. 4. Sensitive and Reserved She may look cold because she is blunt. Jennie kim isn’t as bubbly as the other members. With her sexy looks and poses, she can easily be mistaken as a party girl. This is contrary from the truth, Jennie is actually Reserved and is only comfortable with the people who are close to her. She is sensitive, she observes and notices when her members are having trouble, or when they have a hidden talent and they just haven’t figure it out yet (she always tells the blinks how Jisoo is good at rapping, which turns out to be true). 5. Extricate Unlike her members,Jennie Kim is a rebel. Remember Jenkai? She isn’t afraid to look mature and sexy, or to post bikinis and stick her tongue out for a photo.   Jennie is just a rebel with a heart. ",
            "date": "Updated June 14, 2020",
            "views": "46",
            "upvotes": " View 67 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachel Kim",
                    "user_href": "/profile/Rachel-Kim-333"
                },
                {
                    "user_id": "Sabhyata Gurung",
                    "user_href": "/profile/Sabhyata-Gurung-2"
                },
                {
                    "user_id": "Irwing Eltime",
                    "user_href": "/profile/Irwing-Eltime"
                },
                {
                    "user_id": "Martha Mark",
                    "user_href": "/profile/Martha-Mark-5"
                },
                {
                    "user_id": "Ashok Velu",
                    "user_href": "/profile/Ashok-Velu-9"
                },
                {
                    "user_id": "Tanveer Farooqui",
                    "user_href": "/profile/Tanveer-Farooqui-7"
                },
                {
                    "user_id": "Janhvi Kudari",
                    "user_href": "/profile/Janhvi-Kudari"
                },
                {
                    "user_id": "Ruby",
                    "user_href": "/profile/Ruby-1235"
                },
                {
                    "user_id": "Kpop Is Life",
                    "user_href": "/profile/Kpop-Is-Life-62"
                },
                {
                    "user_id": "Anu Kumar",
                    "user_href": "/profile/Anu-Kumar-272"
                }
            ]
        }
    ]
}