{
    "title": "What is your favorite part of your favorite song? - Quora",
    "tags": [
        "Favorite Songs",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Boorer",
                "href": "/profile/Laurence-Boorer"
            },
            "answer_text": "Although I appreciate every part of  I'm Not In Love\" by 10cc, I think the one part that really stands out for me is the \"Choir Supernal\" backing, and I'm in awe when I think of how the effect was created. For those who don’t know the story, there were only three singers. but they would all sing the same note for as long as possible and this was recorded onto one track of a 16 track recorder. This was repeated for each of that recorder’s tracks and they were then mixed down and put onto one track of a twin track recorder. That process was repeated and then the two tracks were mixed onto a single track. This meant that there were 96 “voices” singing a single note. They repeated the whole process for every note they needed, and each note was put on a tape loop controlled by a separate channel on the mixer. Also, there was a strip of adhesive tape across the bottom of the faders so that no note was never fully “off”. This means that there are over fifteen hundred voices heard throughout the song. ",
            "date": "Answered September 13, 2018",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Meera Kapoor",
                    "user_href": "/profile/Meera-Kapoor-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Jacks",
                "href": "/profile/Craig-Jacks"
            },
            "answer_text": "I’d say my favorite part of maybe any song is that magical few moments in ‘Bodhisattva’, by Steely Dan, where, instead of playing the expected single turnaround chord in what seems to be a 1–4–5 progression, a group of “new” chords are introduced along with their own additional measures. But it’s not just the unique musical twist that gets me, it’s the whole thing — every element combined. The lyrics are cool and seem simple, yet they paint huge pictures in my mind. Something wonderful happens as each chord changes into the next. Everything suddenly moves from a rough, swing thing and takes on a high gloss, futuristic tone. For just a few seconds I’m hit emotionally and feel like everything just speeds off into space. OK, yeah! Then the last three chords jump onboard and bring us all in for a perfect landing. Aannnnd, we’re back, right there at the ‘1’. Amazing what a few well chosen chords and a dash of time stretch can do. Music rocks! I like this related story. So, I was lucky enough to be at a Black Oak Arkansas concert in the early 70s (you don’t hear that very often) where, after Focus played, (famous for their hit song ‘Hocus Pocus’, and the only reason I was there) a second opening act came out onstage. This turned out to be Steely Dan on their first tour—a band I thought was going to sound like Hamilton, Joe Frank, and Reynolds at best. Nope. Steely Dan was loud, extremely trebly sounding, and seemed really pissed off as they busted into a really fast version of Bodhisattva. Yep. That’s when I first heard my favorite part of any song and I think I almost fell over backwards. Wild. Interestingly, the album Bodhisattva actually came out on, CountdownTo Ecstasy, wouldn’t be released for several more months. The lyrics for the part I’m going on and on about are in bold below and the soundclip (link) is from the second verse where the chords are first sustained. …Bodhisattva Bodhisattva, I’m gonna sell my house in town Bodhisattva, I’m gonna sell my house in town And I'll be there to shine in your Japan To sparkle in your China, yes I'll be there Bodhisattva, Bodhisattva https://storage.googleapis.com/kapwing/final_5b9b3fd32cd7e4001204c4db.mp4 Here’s the entire song.  From what I’ve been able to find online, and from playing the chords myself, I’m pretty sure this is what’s going on. And I’ll be there Ebmaj7 To shine in your A7(b9) Japan Dmsus11 To sparkle in your Bb China Ebmaj7 Yes I’ll be there F (the piano plays F6 here) Bodhi- sattva… G7 ",
            "date": "Answered September 13, 2018",
            "views": "498",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Devine",
                    "user_href": "/profile/Anthony-Devine-33"
                },
                {
                    "user_id": "Meera Kapoor",
                    "user_href": "/profile/Meera-Kapoor-16"
                },
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                }
            ]
        }
    ]
}