{
    "title": "What is your opinion of the song Cross Off feat. Chester Bennington? - Quora",
    "tags": [
        "Chester Bennington (musician)",
        "Linkin Park (band)",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah McGee",
                "href": "/profile/Sarah-McGee-38"
            },
            "answer_text": "I really love this song. Not just because it's Chester Be. singing or cuz it's a song from him after his death.. Though both of those reason's are pretty good one's… I love this song simply cuz it's a good song. The meaning and lyrics are something I can relate to and with Chester's emotion within singing it really conveys the message. Also, Chester sounds amazing, I love his high intensity moments along with the lows and Mark Morton… he always rocks with the guitar. What more can you ask for..? (Don't answer that..it's a rhetorical question.) :\\ I'm sure plenty were looking for another one of those legendary 18 second growl screams from Chester...but people...that injured his voice somewhere around 2010–2014. It is extremely stressful for your vocal cords to be doing that along with touring and all that comes with that... So.. for those who really wanted that..just be happy that you got to hear something new from Chester. I do feel like it was missing a little something though.. It was probably Shinoda's personal touch kind of thing...like the flow of the song was almost on point but just missing one beat...or some shit. Besides that though, it's a great song and definitely worth $15 bucks to buy Morton's album. :) ",
            "date": "Answered February 19, 2019",
            "views": "132",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Trisha Sushil Kumar",
                    "user_href": "/profile/Trisha-Sushil-Kumar"
                },
                {
                    "user_id": "Anthony Alcaraz",
                    "user_href": "/profile/Anthony-Alcaraz-7"
                },
                {
                    "user_id": "Ankan Roy",
                    "user_href": "/profile/Ankan-Roy-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sujay Rittikar",
                "href": "/profile/Sujay-Rittikar-1"
            },
            "answer_text": "I heard it and, I heard it. That loop went for around 10–15 times. I heard it today again. Although I felt a slight difference in his screams. They had changed a bit, I don’t know perfectly as per the vocal technicalities. But, I still loved that song because I could again listen to his voice in yet another song and that too released in 2019. I bet I can never cross off Linkin Park songs but sure, I’ll try to cross off the days passed by as Chester has got it for us. Those lyrics are again, deep, dark and inspiring at the same time. Also, I loved the guitar’s taste with the tasty cooked stuff, credits to Mark Morton. I’m also happy that it has peaked to number 13 as of today on the Rock Mainstream Chart on Billboard!! Here:  Rock Music: Top Mainstream Rock Songs Chart Cheers! ",
            "date": "Answered February 19, 2019",
            "views": "59",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Trisha Sushil Kumar",
                    "user_href": "/profile/Trisha-Sushil-Kumar"
                },
                {
                    "user_id": "Ankan Roy",
                    "user_href": "/profile/Ankan-Roy-18"
                }
            ]
        }
    ]
}