{
    "title": "What is the English translation of the song “Bekhayali” from Kabir Singh? - Quora",
    "tags": [
        "Hindi Songs",
        "Hindi to English Translation",
        "Bollywood Music",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Navneet Arora",
                "href": "/profile/Navneet-Arora-72"
            },
            "answer_text": "Thanks for the A2A, This is the lyrics for the song Bekhayali with English translation: Bekhayali Mein Bhi Tera Hi Khayaal AayeEven in times when I have no thoughts, I think about You(You are always there in my thoughts)Kyun Bichhadna Hai Zaroori Yeh Sawaal AayeI keep on thinking why this separation between us is necessary/importantTeri Nazdeekiyon Ki Khushi Behisaab ThhiThe joy of You being close to me was indescribable/tremendous Hisse Mein Faasle Bhi Tere Bemisaal AayeIn my share, the separation from You also came in huge abundance Main Jo Tumse Door HoonAs I’m far away from YouKyun Door Main RahoonWhy should I remain like this?(Why shouldn’t I come closer to You?)Tera Guroor Hoon…I am Your pride Aa Tu Faasla MitaCome and eradicate these distancesTu Khwaab Sa MilaYou are like a dream that I have achievedKyun Khwaab Tod Doon Why should I break my own dream? Ooo Ooo Ooo… Bekhayali Mein Bhi Tera Hi Khayaal AayeEven in times when I have no thoughts, I think about YouKyun Judaai De Gaya Tu, Yeh Sawaal AayeWhy did You give me separation, I have this question in my mind Thoda Sa Main Khafa Ho Gaya Apne Aap SeI am a little upset with my own selfThoda Sa Tujhpe Bhi Bewajah Hi Malaal AayeI feel a little amount of regret/remorse about You without any reason Hai Yeh Tadpan, Hai Yeh UljhanI have this uneasiness, I have this confusionKaise Jee Loon Bina TereHow should I keep on living without YouMeri Ab Sab Se Hai AnbanI have quarrels with everyone nowadaysBante Kyun Yeh Khuda Mere Why are they trying to become my lords?(Why are they trying to advise/guide me in how I should live my life?) Hmm Mmm... Yeh Jo Log Baag Hain, Jungle Ki Aag HainAll these hordes of people are like a wildfireKyun Aag Mein Jalun...Why should I burn myself amongst them(in their midst)?Yeh Nakaam Pyaar Mein Khush Hain Yeh Haar MeinAll of them are happy despite their failed love storiesIn Jaisa Kyun Banun Why should I become one of them? Ooo Ooo Ooo… Raatein Dengi Bata Neendon Mein Teri Hi Baat HaiEven the nights will showcase that Your thoughts are present in my sleepBhoolun Kaise Tujhe Tu Toh Khayalon Mein Saath HaiHow can I ever forget You as You’re always a part of my thoughtsBekhayali Mein Bhi Tera Hi Khayaal AayeEven in times when I have no thoughts, I think about YouKyun Bichhadna Hai Zaroori Yeh Sawaal AayeI keep on thinking why this separation between us is necessary Ooo Ooo Ooo… Nazar Ke Aage Har Ek Manzar, Ret Ki Tarah Bikhar Raha HaiIn front of my eyes, every single moment, is falling apart(withering) like a grain of sandDard Tumhaara Badan Mein Mere, Zeher Ki Tarah Utar Raha HaiThe pain of Your absence is slowly entering my body like poisonNazar Ke Aage Har Ek Manzar, Ret Ki Tarah Bikhar Raha HaiIn front of my eyes, every single moment, is falling apart like a grain of sandDard Tumhaara Badan Mein Mere, Zeher Ki Tarah Utar Raha HaiThe pain of Your absence is slowly entering my body like poison Aa Zamaane Aazma Le Roothta NahinO world! Come and test me, I will not become upset with YouFaaslon Se Hausla Yeh Toot Ta NahinEven if there are distances, my hope is still not breakingNa Hai Woh Bewafa Aur Na Main Hoon BewafaNeither she nor I am unfaithful Woh Meri Aadaton Ki Tarah Chhoot Ta Nahin…She is like a habit of mine, I’m unable to let go of her Credits: Bekhayali - Bollywood Song Lyrics Translations. (2019). Retrieved 13 August 2019, from https://www.bollynook.com/en/lyrics/22116/bekhayali/ ",
            "date": "Answered August 12, 2019",
            "views": "3",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-815"
                },
                {
                    "user_id": "Kannan Mali",
                    "user_href": "/profile/Kannan-Mali"
                },
                {
                    "user_id": "Rity",
                    "user_href": "/profile/Rity-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shabir Bhacho",
                "href": "/profile/Shabir-Bhacho"
            },
            "answer_text": "Poetry is all about feelings. this song is full of feelings and emotions. such are rare songs to listen in history of Indian cinema. I am going to translate a few lines of the song. BEKHAYALI ME BHE TERA HE KHAYAL AE Thy thoughts never leave me even in unmindfullness. KIYUN BICHARNA HAI ZARORI YE SAWAL AE The only question is if our separation is justified. TERI NAZDEEKYON KI KHUSHI BE HISAB THI Whenever you were with me, I felt the joy beyond the boundaries. HISE ME FASLE BHI TERE BEMISAL AE Also, I felt the pain beyond the boundaries, whenever you were not with me ME JO TUM SE DOOR HON Since the day, you are away from me. KIYON DOOR ME RAHON I keep thinking if I should let you away from me. TERA GHROOR HON You were proud of me. AA TU FASLA MITA Come and reunite. ",
            "date": "Answered January 31, 2020",
            "views": "641",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vibhu Prakash",
                    "user_href": "/profile/Vibhu-Prakash-4"
                },
                {
                    "user_id": "Raja Sree16",
                    "user_href": "/profile/Raja-Sree16"
                },
                {
                    "user_id": "Kujan Doka",
                    "user_href": "/profile/Kujan-Doka-1"
                }
            ]
        }
    ]
}