{
    "title": "What causes people to like different genres of music? - Quora",
    "tags": [
        "Genres",
        "Music Genres",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peggy George",
                "href": "/profile/Peggy-George-11"
            },
            "answer_text": "I think a lot of the reason for a person’s genre preference has to do with what music they grew up hearing. I know many a person my age (67, ) for instance, who introduced their children to the Beatles. A young lady who appeared recently, and did very well, on one of the talent shows started listening to, singing along with, and later performing operatic arias from the age of 2 on. I have a private music student who is enamored with the music of Fish and other such groups because she hears their work on video games, etc. Folks who grow up in certain church denominations often favor gospel. People from southern and western states often favor country music. You get the idea. On the other hand, some people simply like the beat and drive of music that features these elements, like a lot of rock music. Again, I am 67, and every time I hear Elvis Presley’s “Jailhouse Rock,” I just want to get up and dance! Same is true of The Beach Boys’ “Good Vibrations.” To fast forward to today, I really enjoy The Jonas Brothers’ recent release “Sucker for You.” I love the song “Just Can’t Stop the Beat,” from the musical Hairspray. On the other hand, I , like many people, can also appreciate more mellow songs like Prince’s “Purple Rain.” Powerful ballads, like “Bring Him Home,” from Les Miserables or “Lily’s Eyes,” from Secret Garden move my heart so much that I cry every time I see these shows. What’s more, I so very much appreciate an aria (song from an opera or oratorio) like “Der Holle Rache,” from Mozart’s opera, The Magic Flute. This type of music inspires the listener because the vocal gymnastics required to perform it correctly are truly astonishing…mind-blowing, actually. I have bought tickets to see this opera just to hear that aria and other singing by the character, The Queen of the Night. I am a person who also very much likes, teaches, and performs choral music. The intertwining of the voice parts and the harmonies created make for an awesome sound! As I also enjoy and teach the folk songs of our country, as well as the patriotic songs that we all learn from the day we were born. If you haven’t discerned this already, I like most genres for different reasons. Two genres that I don’t care much for are heavy metal and rap. I just don’t find them interesting. ",
            "date": "Answered December 7, 2019",
            "views": "370",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nika Ahmadi",
                    "user_href": "/profile/Nika-Ahmadi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kali Ashby",
                "href": "/profile/Kali-Ashby"
            },
            "answer_text": "Throughout the course of your life you encounter many things that influence your taste in music. Start with your childhood. What kind of music did your parents and family members listen to? At such a young age you would accept that type of music as “normal.” If you grew up in Edinburgh “normal” music would sound very different than if you grew up in Houston. Then comes your teen years. What kind of music did your peers listen to? They’ve probably grown up with music similar to what you’ve grown up with, but the teen years are the time kids begin to separate from their parents so they intentionally find new types of music. This is your second big influence. Then there’s the question of playing a musical instrument. Anyone who has learned to play any type of instrument is going to be influenced by the music associated with that instrument. If you learned to play the electric guitar you were probably exposed to different music than if you learned to play the piccolo. Lastly, there’s still that place in your heart that gravitates to certain types of sounds. If you’re drawn to ballads, you’ll gravitate to songs that are somewhat familiar but are soft and gentle. If you favor a quicker pace, you’ll gravitate to rock, polka, or line dancing. If you love the sound of a violin, you’ll gravitate to chamber music or orchestras. Basically, your taste in music continues to evolve during your life, but there will always be a certain sound or a certain beat that you connect with a bit more than others. ",
            "date": "Answered June 7, 2019",
            "views": "904",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nika Ahmadi",
                    "user_href": "/profile/Nika-Ahmadi-2"
                }
            ]
        }
    ]
}