{
    "title": "What is the biggest snub in the 2019 MNET Asian Music Award (2019 MAMA) nomination? - Quora",
    "tags": [
        "Asian Music",
        "Music Awards",
        "Pop Music",
        "Honors and Recognition",
        "Asia",
        "South Korea",
        "Music Industry",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Braybrook",
                "href": "/profile/Ashley-Braybrook-1"
            },
            "answer_text": "Uh, I think there were a few. Blackpink got NOTHING. I was told it was because since they couldn’t attend they get zero awards (dumb in my opinion). They are in Japan doing a string of concerts. So naturally unable to attend. But they were nominated quite a lot. Two categories I felt pretty strongly about where the award ended up going. Don’t get me wrong. I get it. K-Pop Idols work their butts off. Each and every one of them give their all and they all 100% deserve recognition for efforts. However, I was displeased with Best New Male Artist: Winner: TXT. Who I believe SHOULD have won: Ateez. I ADORE TXT but I think that Ateez just has that something MORE that TXT is still missing. It’s hard to explain. And Best Dance Performance - Male Group: Winner: BTS. Who I believe SHOULD have won: Literally any other group nominated in that category (Got7 “Eclipse”, EXO “Tempo”, NU’EST “Bet Bet”, Monsta X “Alligator”, and Seventeen “Fear”). Boy with Luv was 100% a bop but it did not have great choreo. ",
            "date": "Answered December 4, 2019",
            "views": "858",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shikha Singh",
                    "user_href": "/profile/Shikha-Singh-101"
                },
                {
                    "user_id": "Tsukki Mons",
                    "user_href": "/profile/Tsukki-Mons"
                },
                {
                    "user_id": "Zahara Shaikh",
                    "user_href": "/profile/Zahara-Shaikh-1"
                },
                {
                    "user_id": "Delgermoron Barsbold",
                    "user_href": "/profile/Delgermoron-Barsbold"
                },
                {
                    "user_id": "Joy Wang",
                    "user_href": "/profile/Joy-Wang-139"
                }
            ]
        }
    ]
}