{
    "title": "What is the difference between a chromatic scale and a pentatonic scale (2 points)? - Quora",
    "tags": [
        "Pentatonic Scale",
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cory Miller",
                "href": "/profile/Cory-Miller-43"
            },
            "answer_text": "Well, technically a chromatic scale isn't a scale at all necessarily; to really understand that, you have to understand some types of Harmony. Put simply, a Chromatic Scale contains all 12 notes used in music, each a half step apart. Pentatonic Scale uses only 5 notes, usually the Tonic, Second, Third, Fifth, and Sixth notes of the major/minor scales. For a slightly more in depth explanation: The majority of music falls into what is called Diatonic Scales, and follows Diatonic Harmony (for the most part.) That is to say, most music stays within the exact 7 notes of a Diatonic scale, such as Major or Minor. That is Diatonic Harmony. Chromatic Harmony is what you use when you break away from the exact Diatonic scale and play a note that is not one the 7 included in the scale. ",
            "date": "Answered February 19, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Paglia",
                    "user_href": "/profile/Michael-Paglia-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Funk",
                "href": "/profile/Jesse-Funk"
            },
            "answer_text": "The chromatic scale is not really a true scale per say. It is simply a collection of all twelve notes that we have to work with (each one a semi-tone apart). It has no tonality, related harmony, and is completely symmetrical (all semi-tones). The pentatonic scale is a variation of the major scale where the 4th and 7th notes are omitted. It is tonal (i.e. has a defined “I” chord), has related harmonies, and is asymmetrical. ",
            "date": "Answered February 6, 2018",
            "views": "632",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Colton Key",
                    "user_href": "/profile/Colton-Key-1"
                }
            ]
        }
    ]
}