{
    "title": "What song makes you cry? What is it about this song that affects you that way? Maybe it speaks to something in your life; a time or a person that was important. - Quora",
    "tags": [
        "Crying",
        "Song Lyrics",
        "Musicians",
        "Songs",
        "Emotions",
        "Love",
        "Music",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Meghan Smith",
                "href": "/profile/Meghan-Smith-142"
            },
            "answer_text": "I know more than one song fits this for me, but there is one that is so clearly in my head and so precisely poised in my memory whenever I think of it that it seems right, somehow, to answer. I was about 16 years old, I think; a junior in high school. It was the best year I had in many ways. Most of my friends were seniors and I was at a small high school, and in some ways lived my junior year as if it were my senior year. I had dear friends, amazing teachers, fascinating classes, even my first romantic interest slowly starting with one of my close friends. A few of us were (separately but at similar paces and comparing notes) watching the TV show The West Wing. There was a core group of three of us in this West Wing obsession, one of whom had seen the whole series and the other two of us watching for the first time. Some of our friends would join discussions sometimes, but the obsession ran deep with us. It is a great show, and we had wonderful times discussing it and everything else we thought of, and I'm glad. I'm still very close with one of the other two to this day and the memories tied to this song are, I think, part of the reason why. I will be deliberately vague on some matters to protect the privacy of some in this story, but sadly I suspect that there are enough similar ones that the details wouldn't be easy to find. Still, people went through more than I can comprehend and having their tragedies in the spotlight is not fair. Content note: this answer discusses depression, suicide, and these things in a minor. Never graphically or with the details, but the memories of that week and how these songs bring it back up might hit too close to home for some. Like I said, I was 16. For a senior project, my friends were doing a student-directed play, a musical no less; two of them had been talking about putting on a certain musical since they were freshmen and the dream had come to life. I wasn't a senior, but it was my project too, as I was the techie. After intense weeks and mess, it was tech week. We were rehearsing on the lowest floor of the school and had to borrow a sort of folding bed type thing from a school nurse's office on the top floor. It was a lot of floors, we were tired, the next day was a day off (we were in on a weekend for rehearsal, and that Monsay had no class) and the teacher there to supervise the building being used agreed that we could just leave the bed tucked away in a hallway rather than carry it up the many flights of stairs yet again only to bring it down the next school day with nobody using it between those times. It seemed logical. It even was logical. It also is the backdrop for a disturbing thought later. The Monday was a day off school, as I mentioned, and it was also a day off rehearsal for various reasons we couldn't control despite it being tech week. Me and the two friends I discussed West Wing with were also the leadership (them) and future leadership (me) of a school club and spent that Monday at a sort of conference or get together at another high school for groups from these clubs at different schools to get together and compare notes and and such. I remember very little of the day, but I remember the end. One friend lived a long commute from our school and was spending the week with the other friend, who lived much closer, to make the late nights of tech week possible. They were getting picked up by one's parent and I was offered a ride to the train station to start my trip home (two train lines), and I gladly accepted. We had time to spare waiting and spent it on the steps of the host school, discussing both the day and of course our beloved show. I had just watched the last two episodes of season two the night before, taking advantage of my lack of homework. The last episode in season two of The West Wing is called “Two Cathedrals”. It is one of the most remarkable pieces of television I have ever seen, more so every time I watch. I'll try not to give much away for any who might be worried about spoilers but essentially a character dies, and the protagonist has a crisis apart from that tragedy coinciding. The protagonist has a moment alone in the church after the funeral service, and his helpless rage and the force of his grief and eloquence, giving his fury at the injustices of loss and circumstances an outlet in a tirade addressed to “God\"…the lighting of the moment (remember I'm a theater techie and lighting ie something I love) awed me, the scene awed me, the crashes of thunder and flashes of lightning as a literal storm raged outside served as accent for the first notes of the song this long-winded answer is mostly about: Brothers In Arms by Dire Straits. The song is incredible in the whole scene it plays through, the chaotic press conference and grim car ride and determined walk through the rain…all of it, starting with that scene after the funeral. It struck me deeply and I wanted to know the name of this music as we sat on the steps, and both friends immediately knew what I meant and agreed it wasmagnificent. I listened to the song on my computer on the way home, using spotty commuter train WiFi. And then I got home. A person in my small school had committed suicide; a student a year younger than me. They were someone my friends and I had mentioned just that afternoon relaying a story in which they had done one of them a deep kindness they a very matter of fact way and we had all appreciated them. I was not close to them, just friendly when we did interact, but the news of their suicide was a shock. Remember that bed from earlier, the one from the nurse’s office? I used to be ashamed to admit this, but have come to accept the ways our minds work since then and will freely admit that my first thought was the distinct knowledge that we should have put that damn bed back, because people were going to need it. As a side note I cannot for the life of me remember whether the bed was downstairs when we got in that Tuesday morning or if it had already been taken care of, or really anything about the furniture situation except my immediate thought. I will probably talk about this more fully one day, here, but the question asked about a song that makes me cry and what gives it such emotional weight. It is intertwined with so much for me -- memories and people I love, memories of incredible sadness and tragedy and confusion, people I consider my family and people I may only have thought of because of a moment of kindness to my friend and never known it was the last time I'd think of them without the weight of their death flooding back. I hear it and I'm back there at school that morning, getting there early, going to my usual hangout spot on the second floor and passing the teachers huddled and standing on the first near the entrance, then hearing sobs as one broke down and the explanation to the other guiding them to an office on the second floor: “I thought I could handle it until I got here…” I remember how each of us tried to handle things and each other, and I remember the touching moments that week -- I remember a moment sitting in the hall during my free period when one of my best friends (who had class that period, and was like a sibling to me) walked through a door to the hallway without a word and hugged me, both of holding on for a few moments before they went back to class. We didn't speak then, and never needed to talk about it -- they very simply needed that and I did too. I remember the school's head addressing this confused, scared, sad group of teenagers and telling us to try to be patient with ourselves, to accept that our feelings, however much or little we felt, whatever it was, were valid and real and simply were, and that nothing about our feelings were right or wrong. I remember in one class reading through a poem together, each in turn however much they chose that moment, until it was done, at the suggestion of a classmate for whom it was a helpful way to mourn and pay tribute both. I still have deep feelings for Walt Whitman's poem “\"When Lilacs Last in the Dooryard Bloom'd\" and have a tear stained printout somewhere from later that week. And I remember the song. I remember that I had just watched this incredibly powerful, emotional episode of a show, that the music would have had a deep impact at any time, and that during that week it became intrinsically tied to the suicide of a child, a high school classmate at a small school, and the incredible depth of emotion and fear and anger I felt and saw that week. Whenever I watch that episode, I cannot help but think of it all, including the funeral I attended later that week and the small children, younger siblings, who spoke at it, and the unimaginable strength of the parents who asked that we classmates ne given information about their child's long struggle with depression (and treatments and ongoing care that had seemed to be going so well) and that we be told on no uncertain terms not to blame ourselves or think we could / should have done some things or seen something, that nobody saw it coming. I hear that song, a song that is emotional without the added weight, and I usually cry because of what it bring back. It is the topic of the last conversation I had with my friends before we found out, it is the soundtrack to a tragedy in the show I first heard it on, it is an inherently emotional song to listen to, and it is the song I was listening to the night it happened, though I had no way to know at the time. So, I cry. ",
            "date": "Answered August 23, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barry Scott",
                    "user_href": "/profile/Barry-Scott-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Ricki",
                "href": "/profile/Joel-Ricki"
            },
            "answer_text": "Hallelujah, any number of renditions by any number of artists. I’ve struggled with my faith immensely. I grew up in an atheistic household. My mother didn’t believe in a god and resented her parents for raising her Christian. My father was agnostic and ambivalent to the matter. I grew up ignorant of religion, excessively so, catching only scraps and trying to understand, to glean the truth from what little I overheard from religious relatives and strangers alike. I stole a Bible from a hotel once, because whenever I asked, my mother snorted and said there were better books to read, or would say she’d ‘look into it’ to shut me up. I read that Bible in the dead of night, by a flashlight, by moonlight, whenever I thought it was safe. Even if the original intention of the song was to paint a picture of a dysfunctional relationship between two people who had lost their love for one another, all in the colors and canvases of religious allegory. It resonates with me. Especially since I don’t fit any denomination of Christianity I’ve researched, turning the leaf thin pages of the Bible and whispering prayers to the beat of a rosary I inherited from my great-grandmother, I feel like a fraud. I feel like a heathen masquerading as Christian because he fears the possibility of being wrong, because he fears that his every failure and sin will drag him down, down and further down. I feel like a man clinging to every justification, every excuse, to say that everything that he has done and everything that has been done to him, has been ordained by someone with infinitely more wisdom than he. Somewhere Over the Rainbow by IZ. I used to have no connection to this song whatsoever. It was simply a song, one I actually disliked. And then my great-grandmother died. My “Nana”, the only person in my immediate vicinity who loved me unconditionally and never, ever yelled at me (except when I was trying to climb up onto the roof, or had nearly poured boiling water over myself in my haste, and so on), never made me feel less than worthy of her love, always offered a safe place to rest my head without fear of being told that relaxing was laziness. She was everything to me, everything I imagine a mother ought to be. Gentle, steady. Loving. Stern when necessary but never cruel. Playful and authoritative in equal measure. When she died, after months fighting cancer, I was lost. Set adrift because who could I turn to when I woke up in the middle of the night with phantom pains, phantom hands forcing me face down and a phantom cock in my ass? Who would hold me tight when I sobbed and confessed to every fear, every concern — that, maybe, there is a God, but maybe I’m not worthy, maybe I can never understand, that maybe I am unloveable, that maybe I’ll never amount to anything and all I’ll have managed in my life is to have wasted others’ time, energy and patience. I love her. God, did I love her. I felt numb when my mother sat down on my bed, woke me up at 5:14 in the morning, and told me my beloved great-grandmother had died and that I was still expected to go to school, and don’t even think about sneaking off to the guidance counselor. I felt numb at the wake, even as this song played, along with a few of her favorite songs, over a montage of pictures from before she became a walking skeleton. I felt numb when I stood in the church, numb when I sat in the pews and barely managed to mouth along with the hymns. And then weeks later, the song played out of nowhere. Maybe on some kid’s film or a commercial. And I burst into tears, and embarrassed my mother by making a scene in public. The Cave by Mumford and Sons. Despite the rather upbeat sound to it, at least compared to the above two, this song never fails to choke me up. Perhaps it’s my fixation on own inadequacies, or my confusion and turbid emotions, or a reflection of any number of broken, disfigured relationships I’ve formed in my life, or my ever worsening chances of proving to the world, or at least a certain select few, that I have a purpose and can be useful. ",
            "date": "Answered January 29, 2018",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Thumb",
                    "user_href": "/profile/Tom-Thumb-166"
                },
                {
                    "user_id": "Patricia Hoffman",
                    "user_href": "/profile/Patricia-Hoffman-10"
                },
                {
                    "user_id": "Taylor Calhoun",
                    "user_href": "/profile/Taylor-Calhoun-2"
                },
                {
                    "user_id": "Hilary Kite",
                    "user_href": "/profile/Hilary-Kite"
                },
                {
                    "user_id": "Colleen Wolfe",
                    "user_href": "/profile/Colleen-Wolfe-3"
                },
                {
                    "user_id": "Allen Tyler",
                    "user_href": "/profile/Allen-Tyler-3"
                },
                {
                    "user_id": "Alexander Kruschek",
                    "user_href": "/profile/Alexander-Kruschek-1"
                },
                {
                    "user_id": "Gloria Bates",
                    "user_href": "/profile/Gloria-Bates"
                }
            ]
        }
    ]
}