{
    "title": "What makes K-pop idols rely on fans while other singers don't? - Quora",
    "tags": [
        "K-Pop Idols",
        "Singers",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kouser Fatima",
                "href": "/profile/Kouser-Fatima-4"
            },
            "answer_text": "Way back, kpop was more about quality content but now their companies would just use idol's as puppets who earn money for them and it's all views and stuff. People don't really care about how good the mv is and most companies would just be unfair and promote the popular ones. They don't help idol's achieve their dreams, they just use them to gain money and views so that's why their fans are reliable since the fans are the ones who will give them views and will stream their songs and so some fans would even feel superior and in control of their idols which is really messed up. other singers do care about being successful but they are just boys and girls following their dreams being with the fans and no one is in control of them. ",
            "date": "Answered September 15, 2020",
            "views": "60",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samya Choudhary",
                    "user_href": "/profile/Samya-Choudhary-4"
                },
                {
                    "user_id": "Lucy Muthoni",
                    "user_href": "/profile/Lucy-Muthoni-74"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teleri Ferch Nyfain",
                "href": "/profile/Teleri-Ferch-Nyfain"
            },
            "answer_text": "ALL singers rely on fans! Good heavens, who do you think buys the albums, asks for radio airplay (or Spotify, etc, or watches MVs), goes to the concerts?! What in the WORLD makes you think that any celebrity doesn’t rely on fans? The KPop entertainment companies know this fundamental fact, and act accordingly. ",
            "date": "Answered September 17, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                }
            ]
        }
    ]
}