{
    "title": "What is the meaning of the Tool song Stinkfist? - Quora",
    "tags": [
        "Tool (band)",
        "Song Meanings",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Giaquinta",
                "href": "/profile/Steven-Giaquinta"
            },
            "answer_text": " In one way or another, it’s about desensitization. It uses the sexual act of “fisting” as a metaphor (“turn around and take my hand”… “finger/elbow/shoulder deep in the borderline”… “this may hurt a little but it’s something you’ll get used to”… etc.). But Tool’s lead singer, Maynard James Keenan, has historically been known for his scathing commentary and critiques on society… not one-dimensional, perverse shock-lyrics. So the sexual theme here is almost definitely a metaphor. That metaphor, to me, is desensitization: the protagonist, or humans in general, are constantly searching for more… never satisfied and always pushing the envelope. This desensitization could also be linked to something more specific. It could be how people seek stronger drugs, wilder sex, and crazier adrenaline rushes just to feel anything at all after a while. It could also be a metaphor for drug addiction, detailing how it gets worse and worse and “screws you” even more over time. Then again, it may also be how media desensitizes us to violence. One way or another… I know MJK is NOT simply writing a song about fisting. There’s symbolism there, somehow tying into desensitization or destructive progression of drugs or desire. Tool is a great band, and MJK is a talented lyricist/songwriter.  ",
            "date": "Answered October 2, 2019",
            "views": "35",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vineet Rao",
                    "user_href": "/profile/Vineet-Rao"
                },
                {
                    "user_id": "Saghar Kheirollahzade",
                    "user_href": "/profile/Saghar-Kheirollahzade"
                },
                {
                    "user_id": "Shane Waidner",
                    "user_href": "/profile/Shane-Waidner-1"
                },
                {
                    "user_id": "David Blanton",
                    "user_href": "/profile/David-Blanton-3"
                },
                {
                    "user_id": "Jack Murphy",
                    "user_href": "/profile/Jack-Murphy-337"
                },
                {
                    "user_id": "Sidney Stokes",
                    "user_href": "/profile/Sidney-Stokes-5"
                },
                {
                    "user_id": "Elizabeth Lund",
                    "user_href": "/profile/Elizabeth-Lund-18"
                },
                {
                    "user_id": "Aida De Acosta",
                    "user_href": "/profile/Aida-De-Acosta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Inniss",
                "href": "/profile/Carl-Inniss"
            },
            "answer_text": "The Tool song Stinkfist is a metaphor, based on buttsecs of course. Specifically using the hand, hence the title. In the song, the lyrics say \"Desensitized to everythingWhat became of subtlety?\" The metaphor is our own lack of satisfaction when we get what we want. We always want more. The metaphor starts in the verse \"Finger deep within the borderline\" Tool is saying at first a finger is good enough. By the last verse, it's an elbow within the borderline. EDIT: I was trying to be subtle. It's about fisting, dude. ",
            "date": "Updated September 9, 2015",
            "views": "74",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vedant Acharya",
                    "user_href": "/profile/Vedant-Acharya-5"
                },
                {
                    "user_id": "Sean Uí Niallan",
                    "user_href": "/profile/Sean-Uí-Niallan"
                },
                {
                    "user_id": "Cagri Cakir",
                    "user_href": "/profile/Cagri-Cakir"
                },
                {
                    "user_id": "Brett De Haven-Harpster",
                    "user_href": "/profile/Brett-De-Haven-Harpster"
                },
                {
                    "user_id": "Myles Jacobs",
                    "user_href": "/profile/Myles-Jacobs-1"
                },
                {
                    "user_id": "Muhammad Arsal Abdullah",
                    "user_href": "/profile/Muhammad-Arsal-Abdullah-1"
                },
                {
                    "user_id": "Josie Snow",
                    "user_href": "/profile/Josie-Snow"
                },
                {
                    "user_id": "Orlando Barron",
                    "user_href": "/profile/Orlando-Barron-1"
                }
            ]
        }
    ]
}