{
    "title": "What are the most intense, heart-wrenching, pulse-pounding classical music pieces? Especially more uncommon ones? - Quora",
    "tags": [
        "Contemporary Classical Music",
        "Classical Music",
        "Music Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Graham Major",
                "href": "/profile/Graham-Major-1"
            },
            "answer_text": "Can anything beat Das Lied von der Erde, already mentioned in other answers? How much intense heart-wrenching can you take? If you need a further bout of being torn to shreds, here are a few pieces to ease your way in, finishing with the perfect companion piece to Das Lied. Charpentier: Depuis le jour (‘Since the day’) from Louise. It’s a ravishing aria in its own right, but if you take the few minutes needed to watch this video, Derek Jarman reveals deeper, gut-wrenching levels in his visionary segment for the film Aria, where “a veteran opera singer gives her final performance, intercut by home movies of her on holiday when young and in love.” The recording is of Leontyne Price, with Tilda Swinton as the younger version of the singer, Amy Johnson.  User-13691727748309034687 just pipped me to the post with the essential Scriabin work for this question, so here’s something completely different: Vaughan Williams: Romanza from Symphony No 5 in D.  Korngold: Ich ging zu ihm (‘I went to him’) from Das Wunder der Heliane. This is how Korngold sounded before arriving in the States and becoming a film composer. No points for guessing the soprano.  Schreker: Chamber Symphony. A work by a composer who was a close friend of Korngold’s teacher, Zemlinsky (who also taught Schoenberg). Once you’re familiar with Schreker’s style - there’s now quite a lot of his music on YouTube - it’s not difficult to hear how much he influenced Korngold. He and Zemlinsky are pillars at each end of the bridge between Mahler and Korngold.  And the Master of Heart-Wrench himself: Mahler: Symphony No 9 in D major. Performed by the Concertgebouw Orchestra with Bernard Haitink.  ",
            "date": "Updated October 4, 2019",
            "views": "704",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Valentine Semet",
                    "user_href": "/profile/Valentine-Semet-1"
                },
                {
                    "user_id": "Harsha M Jagalur",
                    "user_href": "/profile/Harsha-M-Jagalur"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Ken Simpson",
                    "user_href": "/profile/Ken-Simpson-30"
                },
                {
                    "user_id": "Jennifer Schmitt",
                    "user_href": "/profile/Jennifer-Schmitt-6"
                },
                {
                    "user_id": "Firda Fairuz",
                    "user_href": "/profile/Firda-Fairuz"
                },
                {
                    "user_id": "Katja Kaila",
                    "user_href": "/profile/Katja-Kaila"
                },
                {
                    "user_id": "Kenny Rodriguez",
                    "user_href": "/profile/Kenny-Rodriguez-9"
                },
                {
                    "user_id": "Michael Rose",
                    "user_href": "/profile/Michael-Rose-146"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Rose",
                "href": "/profile/Michael-Rose-146"
            },
            "answer_text": "Mahler’s powerful meditation on life, mortality and death, Das Lied von der Erde, should meet your criteria (if not your taste); it’s not uncommon, but not often performed. In particular, the final segment, VI. Der Abschied (28 minutes long), is heart wrenching, especially the final, resigned “Ewig. . .Ewig. . .” (“forever. . .”). There are lots of fine performances. Here’s one of my favorites, performed by conductor Bruno Walter (who conducted the premiere in 1911), the Vienna Philharmonic, tenor Julius Patzak and contralto Kathleen Ferrier, who was dying of cancer when this was recorded in 1952, making her performance that much more amazing, especially the concluding “ewigs”.  notes: 1) Der Abschied begins at about 32:00; 2) this was recorded in 1952, so the sound quality isn’t up to the current state of the art. ",
            "date": "Answered January 1, 2019",
            "views": "179",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valentine Semet",
                    "user_href": "/profile/Valentine-Semet-1"
                },
                {
                    "user_id": "Firda Fairuz",
                    "user_href": "/profile/Firda-Fairuz"
                },
                {
                    "user_id": "Debora Sanny Teoh",
                    "user_href": "/profile/Debora-Sanny-Teoh"
                },
                {
                    "user_id": "Graham Major",
                    "user_href": "/profile/Graham-Major-1"
                }
            ]
        }
    ]
}