{
    "title": "What is the easiest guitar tuning to play in? - Quora",
    "tags": [
        "Guitar Tunings",
        "Tuning",
        "Acoustic Guitars",
        "Electric Guitars",
        "Playing Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Dickson",
                "href": "/profile/Bruce-Dickson-7"
            },
            "answer_text": "The reason standard tuning (EADGBe) is so popular is that it’s versatile. It’s easy to play in most of the natural keys. Most folk start this way but it might be easier to learn an all fourths tuning (say EADGCF) because this allows for chord shapes that move across the fretboard and along it. Be cautious - the high F string will need to be really thin - assuming a 648mm scale length, a regular 0.0085 string should be ok.) Alternatively, DGCFA#D# might work too and a set of medium gauge strings will work fine. You could also experiment with DADGAD - which is great is some keys but - absent a capo - is diabolical in others. Or you could try open D (DADF#AD) or open G (XGDGBD) .. both are quite easy and also quite limiting. All things considered, learning chord shapes is not the problem. The real issue is probably getting your fingers on each hand to do what you want them to do so well that you don’t think about them. You can then concentrate on other parts of your performance. This takes practice. Lots and lots and lots of practice. Maybe until your fingers bleed (been there, done that.) Malcolm Gladwell claims it takes 10000 hours of deliberate practice to master something…. maybe, maybe not but it certainly takes more than a thousand to master the guitar. ",
            "date": "Updated October 7, 2020",
            "views": "31",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Read",
                    "user_href": "/profile/Richard-Read-30"
                },
                {
                    "user_id": "Delmont Ribeiro",
                    "user_href": "/profile/Delmont-Ribeiro"
                },
                {
                    "user_id": "George Chalmers",
                    "user_href": "/profile/George-Chalmers-7"
                },
                {
                    "user_id": "Sam Damniel",
                    "user_href": "/profile/Sam-Damniel"
                },
                {
                    "user_id": "Ann Hutchings",
                    "user_href": "/profile/Ann-Hutchings"
                },
                {
                    "user_id": "Alex Palmer",
                    "user_href": "/profile/Alex-Palmer-60"
                },
                {
                    "user_id": "Dave Wilson",
                    "user_href": "/profile/Dave-Wilson-299"
                },
                {
                    "user_id": "Bruce Cichowlas",
                    "user_href": "/profile/Bruce-Cichowlas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "Depends mostly on WHAT you’re playing. All tunings involve compromises. Any given tuning will make SOME things easier to play, but other things harder. If you have zero guitar experience, an open chord tuning will let you play chords pretty easily, and that could be the “easiest”. Speaking in general, “standard” EADGBe tuning has been standard for >200 years for a reason. . .its really versatile and allows for good use of open and barre chords. If you had to pick “just one” and play everything in that one, this is a good choice. . .and many do use it exclusively. ",
            "date": "Answered March 31, 2020",
            "views": "605",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Chalmers",
                    "user_href": "/profile/George-Chalmers-7"
                },
                {
                    "user_id": "Merrill Russell",
                    "user_href": "/profile/Merrill-Russell-1"
                }
            ]
        }
    ]
}