{
    "title": "What is the difference between an A clarinet and a BB clarinet? - Quora",
    "tags": [
        "Clarinets",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Yankee",
                "href": "/profile/Brian-Yankee-1"
            },
            "answer_text": "The difference is that they re pitched diffetently. On an A clarinet, when you play the note C, it sounds as the note A on the piano or, as it is called, in “concert pitch\". On a B flat (Bb) clarinet, when you play the note C , it sounds as the note B flat in concert pitch. This same thing happens with other wind instruments such as trumpets, horns and saxophones that are not pitched in C. Why these instruments evolved this way is a long and complicated story which I won't go into because I honestly don't understand it. In any case, composers wrote music for different clarinets: clarinets in A and clarinets in B flat. So to play the music, you have to use the right instrument. Otherwise the notes will come out wrong. I should note as a trumpet player that although trumpets come in a wider variety of pitches (Bb, C, D, Eb being most common) and trumpet parts being written for all sorts of different pitched inatruments, instead of using different trumpets, classical players most often use trumpets pitched in C and just transpose the music on sight so that the proper notes are sounded. So if the part is written for trumpet in F, the player will play all of the notes a fourth higher than written. Clarinet players could do the same thing - play parts written for Clarinet in A on a Bb clarinet by transposing everything down a half step, but fortunately for them they don't have to. They just grab an A clarinet and play the notes as written. ",
            "date": "Answered August 17, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Postle",
                "href": "/profile/David-Postle-8"
            },
            "answer_text": "The B flat clarinet is the standard clarinet used in orchestras in jazz bands. The A clarinet is slightly smaller and has a higher range. The E flat clarinet is smaller still and is the soprano member of the clarinet family. Although the A clarinet is sometimes used in modern orchestras, the standard instruments are the B flat and E flat clarinets. On the other side, the basset horn is larger than the B flat clarinet and the bass clarinet is larger still. ",
            "date": "Answered August 17, 2020",
            "views": "56",
            "upvotes": "0"
        }
    ]
}