{
    "title": "What are some underrated compositions of classical music? - Quora",
    "tags": [
        "Underrated Things or People",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Brassfield",
                "href": "/profile/Bill-Brassfield"
            },
            "answer_text": "One piece of contemporary orchestral music which receives very little attention but is hauntingly beautiful is the Small Triptych by Georgy Sviridov:  I actually heard a live performance of this piece in the late spring of 2001, performed by the San Francisco Symphony, conducted by guest conductor Yuri Temirkanov of the St. Petersburg Philharmonic. In my opinion, it was one of the best short pieces of music performed by the SFS that entire year. I was able to make a decent digital recording of an FM radio broadcast of the performance about a week and a half later (on San Francisco’s KDFC, which was 102.1 FM at the time). It is one of my most treasured pieces of music in my music collection. I have it on CD, as well as on my iPhone and iPad. I actually don’t listen to it very often, for a couple of reasons: It’s an emotionally very powerful piece for me, and it brings back some very powerful memories of a dark and depressing time in my life (with the recent loss of a very close family member, among other things).I don’t want to overplay the piece and become desensitized or weary of it. I want it to always be a special and meaningful experience every time I listen to it.I haven’t shared my recording of the piece publicly, but have given copies of it to a few close friends. By strange coincidence, one of my friends was also going through a very difficult time in his life (dealing with the loss of an elderly parent), and this specific piece of music became somewhat of a milestone marker for him. Although in some ways he found it quite painful to listen to this piece of music, he found that listening to this piece of music was therapeutic and helped him to get through the grieving process — very much in the same way that it had been therapeutic for me under similar circumstances. ",
            "date": "Answered October 7, 2017",
            "views": "932",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Himangshu Arnheim Bora",
                    "user_href": "/profile/Himangshu-Arnheim-Bora-1"
                },
                {
                    "user_id": "Franklin Parker",
                    "user_href": "/profile/Franklin-Parker-2"
                },
                {
                    "user_id": "Raymond Zhang",
                    "user_href": "/profile/Raymond-Zhang-129"
                },
                {
                    "user_id": "Antonio Contreras",
                    "user_href": "/profile/Antonio-Contreras-6"
                },
                {
                    "user_id": "Graham Major",
                    "user_href": "/profile/Graham-Major-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Major",
                "href": "/profile/Graham-Major-1"
            },
            "answer_text": "Honegger: Prélude, fugue et postlude for orchestra. It really doesn’t help that this work has such a dry, unimaginative sounding title. As the piece is taken from Amphion, there were definitely other possibilities at hand. The Wikipedia page calls it a suite; Amphion Suite would have been more memorable. Amphion is a 1929 drame lyric (in English it’s called a ballet-melodrama) composed for the dancer Ida Rubinstein who premiered it in 1931. The music is superb; by turns sombre and radiant, muscular and gentle, and stunningly majestic. The first three chords - two huge, chunky blocks of dissonance followed by a resolution of sorts - are enough for anyone familiar with Honegger’s best known works to recognise the composer immediately. The three sections described in the title follow each other without a break and are easy to distinguish. There are many standout features; elegiac melodies on solo saxophone in the Prélude and Postlude; brilliant baroque-sounding figurations shared by strings and trumpets in Honegger’s typical neoclassical style; the climax of the Fugue played by full orchestra with sweeping harps, an unusual sonority for this composer; just three of many. In fact ‘sweep’ is the word. This piece has immense sweep as well as imposing architectural presence. Honegger packs so much in that the work feels longer than its roughly 14 minutes, requiring repeated hearings to take it all in. I imagine it being a riveting opening to an orchestral concert. Why it isn’t better known is one of those imponderables. (Probably that damned title …)  ",
            "date": "Updated July 24, 2019",
            "views": "858",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond Zhang",
                    "user_href": "/profile/Raymond-Zhang-129"
                },
                {
                    "user_id": "Michelle Harris",
                    "user_href": "/profile/Michelle-Harris-159"
                },
                {
                    "user_id": "David MacFarlane",
                    "user_href": "/profile/David-MacFarlane-7"
                }
            ]
        }
    ]
}