{
    "title": "What should I learn when playing piano? - Quora",
    "tags": [
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Megan Freeman",
                "href": "/profile/Megan-Freeman-108"
            },
            "answer_text": "What should I learn when playing piano Tks for Jon Nolan 's technique and ways to l_e_a_r_n pianno effectivly in 6 weeks.Thank Jon Nolan 5 WAYS TO LEARN PIANO EFFECTIVELY IN 6 WEEKS: 1. Get your friend or relative or acquaintance to teach you piano. This is perhaps the cheapest and easiest method. You can learn fast because it is after all your friend or relative who is teaching you, and you can fix the time as per your requirements. Of course you will need the piano, and some resources, but if you are not planning to learn it to become a pro, then you can perhaps do away with the resource materials. You can also be quite sure of learning some good simple songs quite early and can show them off to your friends too! 2. Find some good online resources where everything related to piano is being taught. Find a website where there are lots of video lessons, ample resources and tips as well as some kind of a schedule-based learning curriculum. Stick to the site (which means do not keep switching sites and dropping them) and learn everything that it teaches. There are plenty of them today which have a very thorough and clear resources including lessons, exercises etc. Below are suggested resources to learn piano by Quorarian Jennife Lee: . Private teachers . Piano schools . Best 3 piano channels on YouTube: LearnPianoLive, HDpiano, PianoPig. . Best forums: Reddit piano (125k members) is the best place to discuss and learn piano. Alteratives: Pianostreet forum, Pianoworld forum . PianoHandbook365 .club/2019/free-ebook-31-tips-to-become-a-pro-piano-player.html . Best frree training site: 701PianoVideos .info 3. Get a piano learning software program. They might cost you a bit, but when they come with plenty of video lessons and resource manuals, as wells as thousands of lessons, exercises and even evaluating tools, you can almost think of it as a piano tutor! 4. Learning from a tutor. The first thing that may come into your mind if you are thinking of learning the piano is to find a personal tutor who can help you learn the instrument. This can mean allotting your time to a fixed schedule every week to be able to go to your personal tutor or have him come over for the tutorial. One advantage of course of a personal tutor is the fact that he can see you learn and correct you as soon as he finds you not doing it correctly. 5. Learning on your own. Yes, you can actually learn to play piano on your own. With a lot of resources you can find around you, learning the piano can be easy. You can find free tutorial videos online, or find websites and blogs of music enthusiasts who are generous enough to share their skills. However, it is important to keep in mind that learning on your own especially if you are a total beginner may not be the best way to learn piano. In learning the piano and any musical instruments, it is important that you have to learn it correctly right from the start and this may be a little difficult if you are on your own. In fact, one thing that can also be difficult with learning on your own is that, you may not be following the lessons step by step and errors that you may develop early on may not be corrected right away. ",
            "date": "Answered September 28, 2019",
            "views": "405",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5863"
                },
                {
                    "user_id": "Maria Miller",
                    "user_href": "/profile/Maria-Miller-972"
                },
                {
                    "user_id": "Patricia Johnson",
                    "user_href": "/profile/Patricia-Johnson-1512"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5870"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5856"
                },
                {
                    "user_id": "Jennifer Garcia",
                    "user_href": "/profile/Jennifer-Garcia-1340"
                },
                {
                    "user_id": "Patricia Johnson",
                    "user_href": "/profile/Patricia-Johnson-1502"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5859"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-5868"
                },
                {
                    "user_id": "Barbara Brown",
                    "user_href": "/profile/Barbara-Brown-550"
                },
                {
                    "user_id": "Emily Foster",
                    "user_href": "/profile/Emily-Foster-218"
                },
                {
                    "user_id": "Ruby Hughes",
                    "user_href": "/profile/Ruby-Hughes-36"
                },
                {
                    "user_id": "Kathryn Brooks",
                    "user_href": "/profile/Kathryn-Brooks-48"
                },
                {
                    "user_id": "Jennifer Garcia",
                    "user_href": "/profile/Jennifer-Garcia-1126"
                },
                {
                    "user_id": "Margaret Rodriguez",
                    "user_href": "/profile/Margaret-Rodriguez-84"
                },
                {
                    "user_id": "Elizabeth Jones",
                    "user_href": "/profile/Elizabeth-Jones-848"
                },
                {
                    "user_id": "Linda Williams",
                    "user_href": "/profile/Linda-Williams-1626"
                },
                {
                    "user_id": "Mary Smith",
                    "user_href": "/profile/Mary-Smith-3889"
                },
                {
                    "user_id": "Linda Williams",
                    "user_href": "/profile/Linda-Williams-1668"
                },
                {
                    "user_id": "Barbara Brown",
                    "user_href": "/profile/Barbara-Brown-549"
                },
                {
                    "user_id": "Patricia Johnson",
                    "user_href": "/profile/Patricia-Johnson-1375"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daya Shree",
                "href": "/profile/Daya-Shree-2"
            },
            "answer_text": " Playing piano is identical with classical music and it is usually where most famous musicians start with. In fact, there is another option for music genre played with piano. Online piano lesson is a very practical way to have piano lesson without leaving home with complete tutorial. You should know the keys in the pianos which is more important. It is also better for you to learn piano from the Online Courses. I can also recommend you the Best Piano Online Courses. #1 How to play Piano - Go from a Beginner/Intermediate to a Pro Piano Course with lessons to learn from that teach Scales,Chords,Playing piano by ear,Music Theory,Improvisation & More! Below are the different sections that this Course consists of: IntroductionGetting StartedThe Development of Independence between the Right Hand and the Left HandBrief Overview of what is to Come in the CourseMusical IntervalsScales/Major ScalesPractical Exercises that you can do to master all the 12 Major ScalesMinor Scales/Natural Minor ScalesHarmonic Minor ScalesMelodic Minor ScalesScale DegreesMore about Musical IntervalsChords (Triad Chords)Major Scale Triad ChordsNatural Minor Scale Triad ChordsMelodic Minor Scale Triad ChordsHarmonic Minor Scale Triad ChordsThe Triad Chord Patterns in each Major Scale & in each type of Minor Scale7th Chords, 6th Chords & Suspended ChordsThe Seventh Chord Patterns in each Major Scale & in each type of Minor ScaleScale Degrees for Chords (Number System for Chords within a Scale)Pentatonic, Chromatic & Blues ScalesChord Inversions & ArpeggiosSharps & Flats Explained FurtherCircle of FifthsThe Primary and Secondary Chords in all Major and in all 3 types of Minor ScalesHow to Play Songs by ear and How to use different types of Chords in each KeyTranspositionDeveloping the ability to be able to play comfortably in all 12 KeysRhythms & ImprovisationPassing Chords | Using Diminished & Augmented Triad Chords as Passing ChordsHow to use Diminished 7th Chords and the uniqueness of Diminished 7th ChordsHow to use an Augmented Triad and the uniqueness of an Augmented Triad ChordUsing 7th Chords in Chord ProgressionsAdditional Resources: #2 Pianoforall - Incredible New Way To Learn Piano & Keyboard #3 The Complete Piano Course - Master The Piano ",
            "date": "Answered September 3, 2018",
            "views": "148",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhagirathi Murray",
                    "user_href": "/profile/Bhagirathi-Murray"
                },
                {
                    "user_id": "Madan Manney",
                    "user_href": "/profile/Madan-Manney"
                },
                {
                    "user_id": "Shannon Bonham",
                    "user_href": "/profile/Shannon-Bonham-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaqueline Taylor",
                "href": "/profile/Jaqueline-Taylor-2"
            },
            "answer_text": "If one wishes to take private lessons or perhaps some other means of formally learning the piano, what are the topics that one must cover and in what order? Which topics are usually the hardest and thus need the greatest amount of concentration and practice and by one point along this line is a person at ‘intermediate’ level?I am posting this question as myself and many others that wish to learn this instrument and have no prior experience of any musical instruments would like to know this. Everybody learns best in different ways but personally I was getting nowhere until I tried this course: Pianoforall | Learn Piano & Keyboard | 200 Video Lessons I like having everything laid out so I can see myself progress through it and I know what I need to be working on. To get to the point where you can play very simple songs easily, you should give yourself at least half a year. Everything after that is pretty much just practice until you keep getting gradually better. I should add that probably the hardest hurdle to get over in all of this is playing both hands at the same time (and reading two clefs at the same time - three if you’re also singing). For some people, it’s really hard. Especially when they’re both playing ‘melody’. I am assuming you want a break down of learning piano as from its origins in western culture, as in you are more likely going to want to play a Bach fugue on the piano vs. an Indian raga. Acoustics and mechanics: how the piano works with hammers, why there is only one string for the lowest note and three for the highest note, pedals, open lid vs. closed lid, upright vs. grand piano, electric piano vs. acoustic piano. Music Theory: Note names, time signature, changes of time, rhythm, durations, scales, arpeggios, chords (diads, triads, etc.), key signatures, reading the grand staff including dynamic and tempo markings, tuning systems. If one wishes to take private lessons or perhaps some other means of formally learning the piano, what are the topics that one must cover and in what order?If we’re talking piano lessons with any type of teacher, the teacher himself will have it’s own technique or approach on how to play the piano. There are a lot of different things he can teach in a lot of different order. Which topics are usually the hardest and thus need the greatest amount of concentration and practice and by one point along this line is a person at ‘intermediate’ level?Once again a question opened to a lot of interpretations. When do a piano player reach the ‘intermediate’ level.. Who can really define what is an ‘intermediate’ level ? It might seem a little much to ask yourself all these questions but trust me, I decided to stop there because there are a hundred more that could define how long it would take you and where you would have to start. Now that we’ve ruled out all the theory about how much your question is opened to interpretation, I guess you want some real explanations so let’s start by implying you haven’t touch a piano ever and you want to learn all by yourself. ",
            "date": "Answered February 20, 2018",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nishantha Sanjeeva",
                    "user_href": "/profile/Nishantha-Sanjeeva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elaine Stewart",
                "href": "/profile/Elaine-Stewart-26"
            },
            "answer_text": "You must learn how to read music. That is the most important thing. Also, understanding how chords work will enable you to pick out chords with your lefts hand while playing a melody with your right hand. I recommend that you get a teacher. You can learn some basic music from books and online, but it’s never as good as getting a teacher. A teacher will help you recognize notes and chording. Practicing scales will teach your fingers how to react to pressing keys. Learning to play the piano doesn’t happen overnight. You need good teaching and lots of practice. Without a lot of practice you will never succeed. Good luck with your piano playing. You’ll enjoy the time spent on the piano. It is a wonderful way to pass the time. I recommend that you get a real piano. Electric and electronic pianos can just not produce the good sound you get from a real piano. ",
            "date": "Answered May 28, 2019",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Contraveos",
                "href": "/profile/Michael-Contraveos-1"
            },
            "answer_text": "In one word, it’s awareness. Learning to be an engaged listener of your sound in the moment is most important. Being able to listen to that sound and adjust your playing to fit your intended expression will make your performance a richer experience for you and your audience. Not all pianos, rooms, or audiences are the same; nor will your body be exactly the same from day to day, and a good pianist is aware of all of these differences when performing. This is most important to learn as a beginner, however abstract this idea might be. A lack of this awareness reduces the pianist to a machine executing a series of notes at prescribed times and volumes. A good piano performance is, of course, much more than this. Consider someone who’s cooking, yet doesn’t bother to taste the dish along the way to completion. How will that dish turn out in the end? Someone may cook that way if they’ve made a dish a few hundred times, but even so…would you want your performance at the piano to sound like that—rote? The rest of the advice here, specifically regarding form and technique, is all very good and necessary for great control at the piano—but is ultimately secondary to awareness. ",
            "date": "Answered October 6, 2017",
            "views": "247",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Bryk",
                "href": "/profile/Bob-Bryk"
            },
            "answer_text": "My answer my answer is simple, but very important. You should be sitting at a height relative to the piano where your arm forms an L on your hands naturally fall towards the keys. I also I also can't stress enough The Importance of Being able to fit your fingers in between the Black Keys. If you avoid trying to fit your fingers in between the Black Keys your finger posture will be off and many passages will be impossible and difficult to play. Also it's important not to over press into the keyboard also it's important not to over press into the keyboard as that fatigues to fingers and strains your ligaments only hit the key hard enough to create the sound and then instantly relax. ",
            "date": "Answered October 5, 2017",
            "views": "623",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                },
                {
                    "user_id": "Ashley Roberts",
                    "user_href": "/profile/Ashley-Roberts-128"
                },
                {
                    "user_id": "Adnan Sezai",
                    "user_href": "/profile/Adnan-Sezai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lara Poe",
                "href": "/profile/Lara-Poe-1"
            },
            "answer_text": "Well, that depends on your current level. Pick something appropriate– for instance, if you’re just learning to play the C major scale for the first time, I wouldn't go out there and learn a Liszt Hungarian Rhapsody. I don't know your current level, so it's hard for me to say what you should be playing. If you're just starting out, Bartok’s Mikrokosmos and Burgmuller’s 25 progressive pieces, along with Donald Waxman’s beginning piano series would be pretty good. As always, I recommend a teacher– they help you learn faster and help you avoid pitfalls caused by practicing technique poorly. Also, a teacher could help with picking repertoire that's interesting and challenging, but not too difficult. ",
            "date": "Answered July 22, 2016",
            "views": "567",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jas J",
                    "user_href": "/profile/Jas-J-45"
                },
                {
                    "user_id": "Sergio Ortega",
                    "user_href": "/profile/Sergio-Ortega-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leonore Verster",
                "href": "/profile/Leonore-Verster"
            },
            "answer_text": "I am assuming that the instrument was chosen because you love it. Loving the sound of it and enjoying piano music would be the most important. But beyond that: Focussing on the correct technique* right from the start will speed up the whole process immensely, even though it won’t seem so at first. You can balance the initial frustration with learning a new song every week or two (for improving your sight-reading and just to have more ‘fun’ pieces to enjoy), while spending much more time on a more complicated piece to practice and improve your technique. *Hand and wrist position, relaxing the shoulders, sitting correctly, controlling the pedals, and never, ever underestimate the importance of all the scales and arpeggios - it will create “muscle memory” that will not only help you learn and play passages faster and more evenly, but also help when choosing the best fingering for each passage. ",
            "date": "Answered October 1, 2017",
            "views": "301",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Mitchell",
                    "user_href": "/profile/James-Mitchell-286"
                },
                {
                    "user_id": "Ashutosh Thite",
                    "user_href": "/profile/Ashutosh-Thite"
                },
                {
                    "user_id": "Mahnoor Qadri",
                    "user_href": "/profile/Mahnoor-Qadri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "The piano keys. If you’re asking WHAT you should learn how to play, that’s entirely up to what you want do to on piano. But learning scales and chords is a good starting point for any music and any instrument. And you want to start with really simple easy pieces (in whatever genre) then work your way up to more technically and musically difficult ones. ",
            "date": "Answered March 3, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lucius White",
                "href": "/profile/Lucius-White"
            },
            "answer_text": "Good question here…I would say the most important thing of learning the piano would be as important to learning each instrument. Each instrument has it’s own purpose and on voice. For example if you think drums think you’r thinking ok we need this to keep time and rhythm. When you think bass you think of we need something to carry the bottom to sustain the foundation of the music. So it’s basically the same as a piano. In most cases the piano if usually the lead instrument of the music which is usually the first thing people go to for learning, accompaniment, songwriting and other things as well. I would say the important thing about learning the piano is to first understand the instrument and the purpose of the instrument. After you fully understand that then you will learn things much better within the instrument rather you’re learning a song or if you’re using the instrument to write a song. Hope this was helpful. ",
            "date": "Answered October 1, 2017",
            "views": "258",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Upasani",
                "href": "/profile/Yash-Upasani"
            },
            "answer_text": "Learn not to mug up things and have the basic knowledge of raga its aroh avroh also practice with taal. You should understand the meend and gamak while listening and playing to create the original effect of the song. You must be able to create your own music and create some variations in the original one. All this can be done by learning hindustani classical music and following some great maestros of this field. If you are really interested then i can teach you on skype. ",
            "date": "Answered July 23, 2016",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "DewGlayze",
                "href": "/profile/DewGlayze"
            },
            "answer_text": "Well, I am assuming that the question is meant in terms of what to do at first to become a great piano player.. So, for this, here is my answer: You should start off by learning the notes, which, as you will see, they repeat every octave, therefore being relatively easy. Then, you should probably start playing with them, thus experimenting with rhythms! From there on, you can probably get a piano book, look into online free lessons, or get a real-life tutor, that will help you progress through you time on the piano. It will eventually come to the time where you can learn to play full pieces of music, and once mastered, you can perform to an audience! The pieces should become slightly harder and harder each time so it challenges you, consequently upping your skill, and comfortability to play the piano. :) ",
            "date": "Answered December 4, 2016",
            "views": "423",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Kalia",
                "href": "/profile/Yash-Kalia-1"
            },
            "answer_text": "Tell me if you are facing any specific problems then I can help you better. In general I guess to maintain your interest you must learn to play what you really want to play above learning anything else on the piano. Keeping your interest high is important in the rudimentary stage. So listen to as many songs as you can and develop the ear to decide which songs you can and would like to play on the piano. ",
            "date": "Answered May 16, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stacey Brewer",
                "href": "/profile/Stacey-Brewer-30"
            },
            "answer_text": "When it comes to learning how to play the piano, learning things right the first time is much easier than trying to unlearn poor practices and relearn best practices in the future. Scales are often a piano student's first step in learning how to play to the piano. Concentrate on chords first because the foundation of almost all popular music is harmony. Once you get familiar with chords, learn ways of connecting chord tones together (melodic lines). One way this is done is with scale tones, so at that point you would be learning scales! Go to my Profile and you can find all about Learning Piano material there... ",
            "date": "Answered September 24, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Soong",
                "href": "/profile/Richard-Soong-2"
            },
            "answer_text": "Short answer: Practice It doesn’t matter how much you practice; just make sure you practice everyday. Even practicing little sections of a song or just scales for 15 minutes everyday will help. In my experience, piano is all about muscle memory, and by practicing everyday, your hands will automatically remember how to play a song or scale fluently. ",
            "date": "Answered October 7, 2017",
            "views": "178",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Jefferson",
                    "user_href": "/profile/Amy-Jefferson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joy Paul",
                "href": "/profile/Joy-Paul-235"
            },
            "answer_text": "Major scales are basic to your understanding of musical keys and are the scales that most piano students learn first. Most everyone agrees that the scale that should be learned and mastered first is the C Major Scale. Just from a very basic technical standpoint, the piano is an easier instrument to play. ... But, at the beginning level, especially for young children, executing even basic moves on the guitar simply is more difficult than on piano. Go to my Profile and you can find all about playing piano material there... ",
            "date": "Answered August 16, 2020",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nishantha Sanjeeva",
                    "user_href": "/profile/Nishantha-Sanjeeva"
                },
                {
                    "user_id": "Augusto Lopetegui",
                    "user_href": "/profile/Augusto-Lopetegui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon James",
                "href": "/profile/Brandon-James-114"
            },
            "answer_text": "Start with something that excites you. I found the traditional approach of learning scales and beginner pieces to be boring so I paved my own way: Pick a piece that you enjoy and try playing it on the piano (through synthesia on youtube)Learn to incorporate proper technique into your piano playing. This will reduce strain, improve the quality of your sound and control over the keys.If you want to take it more seriously, get into the theory (notes, scales, tempo etc). Accelerate your progress by hiring a piano tutor.",
            "date": "Answered February 21, 2017",
            "views": "214",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ferdinando Argenti",
                "href": "/profile/Ferdinando-Argenti-1"
            },
            "answer_text": "It depends on your piano skills level, how much you practise, and what kind of music you like. If you are a beginner , get a good teacher , follow exactly what he tells you to do for at least three years, and if you practise daily and learn some decent skills , then you can decide what to play based on what you like. It is also all relative to the type of music you choose and your ability at a particular moment in time during your course of study. ",
            "date": "Answered December 4, 2016",
            "views": "199",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stan Swiniarski",
                "href": "/profile/Stan-Swiniarski"
            },
            "answer_text": "Be patient, and practice consistently. Whether you start at age five or 50, you have to go through the same learning process. Give yourself at least a solid year of lessons, practice each and every day (even if you can only do it for 20 minutes). There are no shortcuts. I have taught adult students, and they tend to get discouraged more easily than the young ones because of the repertoire available to them unless they are interested in classical music. Beginner versions of modern songs are not usually that interesting. ",
            "date": "Answered October 3, 2017",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Margaret Washington",
                    "user_href": "/profile/Margaret-Washington-24"
                },
                {
                    "user_id": "Eloise Roy",
                    "user_href": "/profile/Eloise-Roy"
                },
                {
                    "user_id": "Brandy Ryan",
                    "user_href": "/profile/Brandy-Ryan-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jorge Miguel Frankon",
                "href": "/profile/Jorge-Miguel-Frankon"
            },
            "answer_text": "The three main for me, that my teacher adviced to me in my first class, and every class after: Position of your body (arms loose, distance to the piano, the part of the bench where your pants must be positioned)Don’t use the power of your arms, just only the power of your fingers.Don’t hurry, be slow and accurate. Speed will come when you don’t realize is has come.These three advices, will let you practice for many hours without getting tired of feeling aches, and as a result you are going to discover the one and only secret for learning to play piano: Practice a lot! ",
            "date": "Answered October 1, 2017",
            "views": "447",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pringles",
                "href": "/profile/Pringles-6"
            },
            "answer_text": "Learning the piano requires hard work and perseverance, but if you’re really passionate about doing it, then go for it. I’m assuming you’re just a person who wants to know what to learn on the piano. Piano has a variety of different music styles, from pop to classical. For one thing, it depends on your playing ability, experience, and of course knowledge. If your’re looking for something to impress people with, go with a classical piece that has a lot of movement, such as Sonatina. Hope this helps you! ",
            "date": "Answered December 8, 2016",
            "views": "323",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saurabh Kumar",
                    "user_href": "/profile/Saurabh-Kumar-2440"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Peresta",
                "href": "/profile/Jessica-Peresta"
            },
            "answer_text": "I think it’s a mixture of learning to read music, learning how to actually play the piano, and a little of playing by ear that are all important in learning piano. ",
            "date": "Answered October 4, 2017",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liz Meiklejohn",
                    "user_href": "/profile/Liz-Meiklejohn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Toha",
                "href": "/profile/Julian-Toha"
            },
            "answer_text": " 0:00-0:30 Good luck! Anymore questions? Email me! Julian@oclef.com Want to learn more? Listen to our podcast where we talk to the top music educators on the planet. Tap the link below! Oclef Podcast by Julian Toha: music educator, former concert pianist, tech nerd and podcaster on Apple Podcasts ",
            "date": "Answered December 6, 2017",
            "views": "176",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rick Holladay",
                    "user_href": "/profile/Rick-Holladay"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Nienaber",
                "href": "/profile/Alex-Nienaber-1"
            },
            "answer_text": "Middle C If it's out of tune, playing the blues is great If it's in tune, playing the blues is great A chord progression like C F F G F can be a lot more cheery sounding than the blues ",
            "date": "Answered October 4, 2017",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Madell",
                "href": "/profile/Ken-Madell"
            },
            "answer_text": "Find an inspiring experienced teacher, if you can afford one. Practice at least a little every day. Learn from your teacher the best ways to practice; takes a little discipline, and may not always be fun. Your teacher is going to make a big difference. Don't be afraid to try a few, if you need to. ",
            "date": "Answered October 2, 2017",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rick Holladay",
                    "user_href": "/profile/Rick-Holladay"
                }
            ]
        },
        {
            "author_info": {
                "name": "J. Lew",
                "href": "/profile/J-Lew-7"
            },
            "answer_text": "Piano learning can be a very very long process depending what direction you wish to go whether it is classical, pop, jazz or something in between. After some point in your learning process of the basics you can be guided toward pieces you want to learn and work on them at your pace. Of course if you want to perform something for friends or others, then after spending a long while on a piece where you REALLY know it, you can play it for others or work at performing it for others. The “should” to me is required if you join a music school or at a very high level in piano where you audition for entrance to a conservatory, for exams and performance. ",
            "date": "Answered March 3, 2020",
            "views": "33",
            "upvotes": " Answer requested by Julian Alexander Lopez",
            "upvoters": [
                {
                    "user_id": "Anand Sekar",
                    "user_href": "/profile/Anand-Sekar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancie Smither",
                "href": "/profile/Nancie-Smither"
            },
            "answer_text": "If you're looking for song recommendations, I suggest: I Giorni by Ludovico Einaudi. Beautiful composition and not too difficult to learn if you're an intermediate player. Do check out his other pieces; he's brilliant. On another note, instead of learning an existing piece you could try to compose your own. If you haven't tried already, there are loads of resources out there on the net that will help you choose the right chords for your chosen key and will give you some ideas of how to put in melodies & small nuances to make your music unique. Have fun and good luck with your musical experience! ",
            "date": "Answered December 5, 2016",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Cook",
                "href": "/profile/Matthew-Cook-97"
            },
            "answer_text": "I like to just improvise if I'm a beginner. I would learn scales, then find the 1st, 2nd, 3rd, 4th, 5th, and sixth chord of the scale (maybe also the sevenths for a more interesting experience) and just play around with the chord sequence, basically by arranging the chords in an order of your choice, and then improvise using mostly the notes from your chord, with following notes every so often. That’s basically what I do, and I managed to squeeze a few compositions out of it. ",
            "date": "Answered December 7, 2016",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pankaj Lalge",
                "href": "/profile/Pankaj-Lalge-1"
            },
            "answer_text": "Understanding Basic Music theories & terms. Music notes, octave, scales, pitch, chords, melody, rythm, tempo, etc. and above all interest to learn all these without getting bored! ",
            "date": "Answered October 2, 2017",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Alan",
                "href": "/profile/Chris-Alan-16"
            },
            "answer_text": "Understanding Basic Music theories & terms. Music notes, octave, scales, pitch, chords, melody, rythm, tempo, etc. and above all interest to learn all these without getting bored! Regards,Digital Pianos ",
            "date": "Answered October 6, 2017",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick Reed",
                "href": "/profile/Rick-Reed-38"
            },
            "answer_text": "That will depend on many things, including what you mean by “play”. Taking into consideration your ability to learn, your teacher’s ability to instruct, it will take some time to get rolling, but be patient. If your teacher assigns something, do twice at much if you can. Also know that many songs are published formatted for beginning, intermediate, and advanced players. Learn the notes quickly. Learn the staves quickly. Learn not to look at your hands while playing. The rest will come quickly. ",
            "date": "Answered March 4, 2020",
            "views": "38",
            "upvotes": " Answer requested by Julian Alexander Lopez"
        },
        {
            "author_info": {
                "name": "Dion Kara",
                "href": "/profile/Dion-Kara"
            },
            "answer_text": "Start off with basic music theory like note location and recognition at the same time working on some beginner exercises and some basic one hand melody pieces. Good luck. ",
            "date": "Answered December 4, 2016",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Mitchell",
                "href": "/profile/James-Mitchell-286"
            },
            "answer_text": "Romantic pieces (no it’s not cinderella pieces, it’s completely different defined by the characteristics of the piece), jazz is quite nice, contemporary it’s that great, classical is awesome. ",
            "date": "Answered March 8, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colby Blegen",
                "href": "/profile/Colby-Blegen"
            },
            "answer_text": "When you mean technique, scales, for songs for a beginner something simple like twinkle twinkle, or chopsticks ",
            "date": "Answered August 22, 2019",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Song Bird",
                "href": "/profile/Song-Bird-11"
            },
            "answer_text": "It honestly depends on your level and what type of genres you enjoy playing. I, myself would recommend Chopin’s One Minute Waltz, it’s quite popular among classical music. Mendelssohn’s compositions are fantastic! Beethoven's Moonlight sonata is a moody, somewhat dramatic piece, that I would recommend to people of all ages. Hope this helps! ",
            "date": "Answered December 7, 2016",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Klark Jeams",
                "href": "/profile/Klark-Jeams"
            },
            "answer_text": "Any piano teacher should be able to tell you that developing playing skills sometimes takes 5 to 6 years, and sometimes, it takes 10 to 12 years. When we say playing skills, we are referring to the ability to perform complex pieces of music, flawlessly, on stage. ",
            "date": "Answered March 7, 2020",
            "views": "31",
            "upvotes": "0"
        }
    ]
}