{
    "title": "What are the top skills one should develop to become a great music producer? - Quora",
    "tags": [
        "Music Producers",
        "Music Production",
        "Music Industry",
        "Skills",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tripuresh Paridhyani",
                "href": "/profile/Tripuresh-Paridhyani"
            },
            "answer_text": "For me personally learning to produce music is a five step process: Getting acquainted with the DAW~ if you know the basics of what thing does what, it helps in the workflow in the future. Master all shortcuts before because, when in the future you will master the other things on this list your habit would be of going the long way and it would be very tough to change those habits and learn shortcuts.Music theory ~ once you are through with your DAW from the surface. Learn music theory this helps a lot in laying melodies and chords that sit well with each other. Always ensure the time signatures and the measures and also ensure that your samples are in key and whatever you make is harmonic and without off notes.Sound Design ~ once you can layout decent chords and top melodies instead of using presets start making sounds on your own. Use plugins like Massive and Serum which are very good for designing your own sounds. This would answer the question of getting your signature sound as well.Arrangement ~ you are capable of making your sounds and playing chords and melodies on them and have drums to accompany they rhythm. Now start arranging them into a cohesive song structure which goes from low toh high. Add elements to make it sound more intresting and non repetitiveMixing and Mastering ~ once you're done with your song it's time to polish it to make it professional sounding. Mix your song with gain staging panning equing etc. Be sure to make enough headroom for mastering it later so that it sounds all the same at whatever player you throw it at.Hope this helps! ",
            "date": "Answered August 20, 2020",
            "views": "358",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chaitanya Nemani",
                    "user_href": "/profile/Chaitanya-Nemani-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giovanni Blanc",
                "href": "/profile/Giovanni-Blanc"
            },
            "answer_text": "Before you even start producing you need to learn how to dissect music. Play your favorite song and figure out WHY it’s amazing to you. Catch the instrument that sent chills up your spine and and follow it’s rhythm as well as it’s note range. Also, isolate the sound WITHOUT AID. Don’t use any EQ’ing tools. It’s a good practice. Once you get that situated move onto the next sound that piques your interest, and repeat. Do this process until you have a mental picture of every sound within the song in your head. And I’m not talking vaguely, I mean in high detail. Know where the hi hat starts, where it ends, and where it sits in the mix in terms of distance and room size. Once you’ve mastered the dissection of the song, play through it and isolate each sound in your head before the song ends. Learn how to pick up the subtleties and embrace each instrument individually. Once you have a grasp at how each instrument is supposed to sound in the song you’ll start to wonder “why did this produced so that?” THAT, my friend. Is when you’re ready to sit down and figure out why via your DAW (digital audio workstation) and some google searches. :) Or if you’re up for it, I can teach you! It’s up to you how quickly you want your answers found and explained :) (I charge $30 per lesson)  ",
            "date": "Answered December 15, 2018",
            "views": "66",
            "upvotes": "0"
        }
    ]
}