{
    "title": "What things I have to do for starting my YouTube channel for making cover songs? - Quora",
    "tags": [
        "Cover Songs",
        "YouTube Channels",
        "YouTube Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaskaran Bhatia",
                "href": "/profile/Jaskaran-Bhatia-1"
            },
            "answer_text": "Hey there! I'm assuming that you want to record Vocals and/or acoustic instruments like a guitar or a flute since you're a beginner. I've made this assumption because in order to record something like a drum kit, you'll need a set of microphones specialized for drum recording, and I'm guessing you don't have the requisite space and logistics to do so, since you're only beginning. That said, the first thing you'll need is a microphone. I use a Behringer C1 USB condensor Microphone, but you can look at other options, and depending on your budget pick one that best suits you. With the C1 though, I've been able to record Vocals and an Acoustic Guitar with ease. I've also managed to record my electric guitar by placing the mic in front of the guitar amp. The next thing you'll probably need (although not necessarily), especially if you use analog microphones (the ones with a 6.3mm jack) is an Audio Interface. It's a small device that has a couple of inputs and outputs for plugging in, say, a vocal mic and guitar mic simultaneously into your computer. It acts as a pre-amp for the input, and also helps you monitor the audio with little to no latency while you record. Thirdly, you'll need a computer with a copy of your choice of a DAW (Digital Audio Workstation). That's the software onto which you're going to record your stuff into. I like to use FL Studio personally, but you can choose what you like. There's ample tutorials out there to learn how to work on one. With this, you can probably start recording to get decent quality audio, but you can upgrade your equipment as you get better and better. I'd recommend you to watch a few tutorials on how to set up a recording studio at home, and you'll get the hang of it soon! All the best! ",
            "date": "Answered July 12, 2018",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ratan Jotwani",
                    "user_href": "/profile/Ratan-Jotwani"
                },
                {
                    "user_id": "Somrat Dutta",
                    "user_href": "/profile/Somrat-Dutta-2"
                },
                {
                    "user_id": "Manmeet Bhatia",
                    "user_href": "/profile/Manmeet-Bhatia-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunwar Abhinav Aditya",
                "href": "/profile/Kunwar-Abhinav-Aditya-2"
            },
            "answer_text": "As someone who has recently started making cover songs and having tasted a bit of success with them, I can suggest you the following: Be yourself — Making a cover song doesn't mean you have to imitate it or perform it as it is, put in your style or flavour to it.Don't use karaokes — Use instrumental versions that you create yourself, either perform to it or prerecord the song and then record a separate video and then sync them together. I prefer making separate videos as it is gives me some scope to show creativity. I make Acapella covers which are really fun!Get a good recording setup — It doesn't have to be insanely costly. I have a small recording setup under 120 $ and I get my work done pretty fine. Just pick up good products and assemble them yourself.Be creative with your creations — Although similar to point 1, I mean it here a bit differently. For example, make mashups, make covers with 2 songs or more. Just experiment a bit, play around, try to be innovative.Be consistent. If people like your style, they would like to listen to you more. So get geared.Just start it. Don't think too much. Make mistakes. Learn on the go. All the best.",
            "date": "Answered September 19, 2017",
            "views": "553",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanya Mishra",
                    "user_href": "/profile/Sanya-Mishra-10"
                },
                {
                    "user_id": "Aparna Tripathi",
                    "user_href": "/profile/Aparna-Tripathi-106"
                },
                {
                    "user_id": "Nikita Sharma",
                    "user_href": "/profile/Nikita-Sharma-1465"
                }
            ]
        }
    ]
}