{
    "title": "What is the meaning of lyrics in Birdy skinny love? - Quora",
    "tags": [
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Petry",
                "href": "/profile/Todd-Petry"
            },
            "answer_text": "This song was written by Justin Vernon. The song was recorded with the band Bon Iver for the album “For Emma, Forever Ago”. This piece was written by a gentleman by the name of Mark Brown and this is the best theory on the song meaning that I have ever seen or could express myself. Version:1.0 StartHTML:000000252 EndHTML:000064580 StartFragment:000062176 EndFragment:000064440 StartSelection:000062176 EndSelection:000064428 SourceURL:What do you believe is the meaning of the Bon Iver song \"Skinny Love\"? I'd say he is comparing the true nature of love to our modern facsimile.Â Skinny love is our modern pale copy that is but a veneer and lasts but a year.Â And that is ok because it is disposable.Â It might cause some blood and scrapes when you break out of that skinny love, but that just makes your skin tougher.Â Real love cuts the rope and falls.Â It wrecks all of that pretty picture of the veneer.Â Skinny love is balanced and fine.Â Real love, as Saint Paul would say, is patient and kind.Â But the one who is patient and kind is the lover.Â In the song the one who has skinny love is putting those on his skinny love object.Â Instead of being the giving gospel, skinny love is the demanding law.Â Do this and in the morning I'll be with you.Â Real love is there regardless.Â Skinny love pastes over the problems in a lite brassier.Â Real love feels the load.Â Which do you want?Â Who will you love?Â Who will you fight?Â Who will fall far behind? Thank you for your feedback! Your response is private. Is this answer still relevant and up to date? YesNo 22.3k Views Â· 24 Upvotes ",
            "date": "Answered November 5, 2017",
            "views": "20",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Loewe",
                    "user_href": "/profile/Faith-Loewe"
                },
                {
                    "user_id": "Phi Nguyen",
                    "user_href": "/profile/Phi-Nguyen-60"
                },
                {
                    "user_id": "Typhlard Rōblox",
                    "user_href": "/profile/Typhlard-Rōblox"
                },
                {
                    "user_id": "Iván Segovia-Jiménez",
                    "user_href": "/profile/Iván-Segovia-Jiménez"
                },
                {
                    "user_id": "Kevin S. May",
                    "user_href": "/profile/Kevin-S-May"
                },
                {
                    "user_id": "Ann Damiani",
                    "user_href": "/profile/Ann-Damiani"
                },
                {
                    "user_id": "David Eric Parkhurst",
                    "user_href": "/profile/David-Eric-Parkhurst"
                },
                {
                    "user_id": "Salman Jamal",
                    "user_href": "/profile/Salman-Jamal-1"
                },
                {
                    "user_id": "Lenx Ion",
                    "user_href": "/profile/Lenx-Ion"
                }
            ]
        }
    ]
}