{
    "title": "What are some cool scales to play along the song The Thrill is Gone besides the minor pentatonic? - Quora",
    "tags": [
        "Pentatonic Scale",
        "Music Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sebastian Mercer",
                "href": "/profile/Sebastian-Mercer"
            },
            "answer_text": "Forget about minor pentatonic bullshit. Can’t you hear a melody in your head? Listen to the song without your instrument. Imagine or sing your own melodies over the chord progression. Now get your instrument and play that melody to the song. Now you are a musician. Scales are beginner stuff, they are fine but they ARE NOT MUSIC. Music is one’s personal, PERSONAL impression, feeling, interpretation of the song. Use the vocal of The Thrill Is Gone to take your solo from; copy and then play the vocal note for note. Learn that melody on your instrument. Then make variations in it, improvise. THAT is secrete #1 that no one tells people about improv. It is really no secret if you take the time to LISTEN to great improv, like Louis Armstrong. ",
            "date": "Answered July 12, 2018",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pedro Costa",
                    "user_href": "/profile/Pedro-Costa-171"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neal Gardner",
                "href": "/profile/Neal-Gardner-1"
            },
            "answer_text": "Cool is a relative term, of course. Let’s consider the basic chord progression: B minor, E minor, F#7.There’s a G Major in there (a measure prior to the F#7), but let’s ignore that for the sake of this discussion. The song is a i-iv-V7. This is a typical 12-bar Blues progression. If you wanted, you could approach it from a Jazz perspective. This would offer up a whole palette of alterations, including chord substitutions, modal interchange, reharmonization, etc. Once of the reasons why musicians are attracted to Jazz is because it allows for so many choices. I’d suggest listening to some Wes Montgomery and Grant Green as an entry into this world. The F#7 offers many options since it is a dominant 7 chord. This type of chord is a major triad with a flat seven. Some options:F# Lydian DominantF# Whole Tone G DiminishedG Melodic MinorF# Phrygian DominantF# MixolydianF# Mixolydian Pentatonic ",
            "date": "Answered July 12, 2018",
            "views": "555",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pedro Costa",
                    "user_href": "/profile/Pedro-Costa-171"
                }
            ]
        }
    ]
}