{
    "title": "What voice type do I have if my range is b2 to d4? - Quora",
    "tags": [
        "Vocal Range",
        "Singing Voice",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Olson",
                "href": "/profile/Jack-Olson-36"
            },
            "answer_text": "Short answer: undefined/untrained singer. You have the typical range of an undeveloped voice since your vocal range falls within the reach of most trained basses, baritones, and tenors. Longer answer: Like many people have said already, voice classification depends on a lot more than just the range you have right now. In fact, the color and weight of your voice is far more telling on where your voice falls within voice classification systems. you could be a tenor that hasn’t discovered his head voice, a bass that hasn’t figure out how to work the low end of his chest voice, or a baritone that has quite a bit of room to grow on both ends of his range. To figure out the true nature of your voice, you’re gonna need some training to learn singing techniques so that you can “open up” the rest of your vocal range. More importantly, you’ll learn how to project sound effectively which will lead to your natural timbre to come out. Almost every male singer starts out with a range like the one you have so don’t worry too much about it. If you keep training and learning singing technique, your voice will grow over time. Take voice lessons with a good singing coach if possible and check out a good singing program to learn on your own too. A course I’d suggest would be The Four Pillars of Singing if you want to learn how to sing higher comfortably. It teaches everything you need to expand your range and smooth out your passaggio so that you can sing through it without your voice cracking. Keep working on your voice and make the most out of the vocal range you have! ",
            "date": "Answered July 20, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serenity-Falls-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cole Beardshaw",
                "href": "/profile/Cole-Beardshaw"
            },
            "answer_text": "one with a relatively small range especially if includes head voice keep singing songs in chest and head voice and your voice will improve from practise (chances are your range will increase as you use your voice more) so sing often and sing a lot (but stopnif it hurts) your voice type doesn’t really matter until you’re fully trained and also beyond ‘tenor, baritone, bass’ (i’m assuming you’re a guy since your highest note is d4 and lowest is b2) you don’t need to care unless you sing classical or opera get a singing teacher and stop caring about this so early into singing-if you want to know for the sake of singing in a choir just sing which parts are more comfortable ",
            "date": "Answered July 17, 2018",
            "views": "467",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Gordon",
                    "user_href": "/profile/Michael-Gordon-39"
                }
            ]
        }
    ]
}