{
    "title": "What useful career skills can I learn in a month during the quarantine? - Quora",
    "tags": [
        "Job and Career Skills",
        "Skills",
        "Career Choices",
        "Learning New Things",
        "Learning",
        "Self-Improvement",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monika Bindal",
                "href": "/profile/Monika-Bindal-2"
            },
            "answer_text": "Hello folks, I am gonna tell you today one skill that you can easily learn in your quarantine all by yourself and that definitely gonna help you in your career irrespective in which domain you are working or you wanna pursue your career.  “ SHARPEN YOUR BRAIN, by doing brain exercise” Yes, you read it right. As we have to do physical exercises to strengthen our muscles, same way we have to do various brain exercises to keep it function properly. Benefits of doing brain exercise: Your memory got improved and a better memory like a sharpen sword in the soldier’s hand.It helps you to focus , to concentrate on whatever you do. Focused mind can finish a job 10 times faster than a normal one.As per your interest area and career, you can do different brain exercises. Few of them are: Start doing different puzzles available on internet. One of my favourite source is youtube channel - LOGICALLY YOURS. Puzzles helps you to crack your interview also as most of the interviewers want to check your logical thinking.You can start improving your English vocabulary. It gives you more confidence in your communication.Start adding some new facts to your General knowledge, etc. You can share your knowledge among friends, colleagues and add up to your social status.Play different brain games available online, like chess, sudoku, etc.Main point is that feed your brain something new. Stretch it and push it to process something new. As per the study, one human being has around 65,000 thoughts in a single day and more than 90% are repeated one or same. But if we have some new thoughts daily, learn something new even a single word, it will make our brain happy and smart. One famous saying: “Brain is a wonderful servant but a cruel master” Brain exercises helps you to better control your mind. You wanna be Master of your brain or you wanna be the slave. PS: From the last 3 weeks, I have been doing puzzles and improving my vocab and it’s definitely a fun and feels more confident now.  Have fun guys.. Don’t forget to upvote if you like the answer. ",
            "date": "Answered April 12, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yogee Raaj R",
                    "user_href": "/profile/Yogee-Raaj-R"
                },
                {
                    "user_id": "Priyanka Arora",
                    "user_href": "/profile/Priyanka-Arora-148"
                },
                {
                    "user_id": "Varun Singhal",
                    "user_href": "/profile/Varun-Singhal-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Hansen",
                "href": "/profile/Dave-Hansen-9"
            },
            "answer_text": "How about food preparation and nutrition. Often people are more interested in quality that quantity and just a bit of delectable food is sufficient to satisfy rather than quantity. We do an online pick up at our market and order from Amazon. Kids and I love soda crackers and canned frosting. Learn to make meat and vegetable as well as fruit pies that you can freeze. If your alone, share with your neighbors. Certainly you can work with all the online tutorials that you never had time before. Iguana ",
            "date": "Answered April 16, 2020",
            "views": "544",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "I would look to polishing the skills you do have. Let’s just say you are a big user of Microsoft Excel. Why not just boost what you can do in that? Add more techniques to what you have. I am convinced that greater confidence in what you already do is more marketable then something you are a newbie and unproven in no matter how appealing it might be. You can still explore and dabble if you have the inkling. Just put the most effort into what puts food on the table and you know you can use it. ",
            "date": "Answered April 6, 2020",
            "views": "179",
            "upvotes": " Answer requested by Lucas Sherrin"
        },
        {
            "author_info": {
                "name": "Muhammad Asim",
                "href": "/profile/Muhammad-Asim-131"
            },
            "answer_text": "Thanks for the question; according to me the answer is as under: My quote: “Most useful career skills are any skills that is having your interest & tendency…” Important You can find further Unique & Useful Ideas, Innovations, Inventions and a lot more on Global Peace, Progress & Prosperity etc. by searching the keyword ‘Global Progress Volunteer’ on the Google. Please have the benefit for YOU first and then give it to rest of the Humanity / World. Thanks ",
            "date": "Answered April 20, 2020",
            "views": "156",
            "upvotes": " View Sharers "
        }
    ]
}