{
    "title": "What is the best equipment for a recording studio? - Quora",
    "tags": [
        "Home Recording",
        "Specific Recording Studios",
        "Audio and Acoustical Engineering",
        "Music Recording",
        "Equipment",
        "Audio Recording",
        "Music Production",
        "Audio Equipment",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Hughes",
                "href": "/profile/Andy-Hughes-25"
            },
            "answer_text": "Wow! Great question and one that would take several pages to discuss fully. Short (ish) answer has to take into account what you intend to mainly use it for. Recording podcasts needs very little in relative terms compared with recording EDM or Bands for example. So … You will need a computer with recording software and some kind of interface. I would recommend a second hand MacBook Pro mid 2010 Duo core intel chip. This model is available cheaply but is capable of being upgraded far more than other models for a modest outlay. The one I use for mobile recording is now specced at 16Gb RAM with a 500Gb SSD. This runs Ableton Live9 sometimes ProTools, sometimes Mixbus. This is matched to a FastTrack Pro interface again available used for about £70. If you are recording Podcasts then GarageBand or Audacity recording software would be all you would need to get great results. A decent Condenser microphone and some sound deadening foam or even a duvet over you and mic while talking and you’re all set. If you are using it for music production then my personal choice would be Ableton Live 9. I haven’t upgraded to 10 in case of glitches so get an used copy and a license from Ableton. Some powered speakers as monitors are vital. M-Audio make great ones at modest prices. I use AV-40s for mobile as I can pack everything into one case and I’m away. The Headphones I use are AudioTechnika but for Podcasts any decent midrange model would suffice. A midi controller such as a Novation or Axiom for making beats and bass and you can start making some music. Well that’s the skinny version to the best of my ability. I think I covered the basics but don’t take this as definitive. There are lots of sources online for advice. Beware of spending too much. Companies are very good at convincing folks they need bleeding edge tech to get good results. This is why I recommend used gear that can grow with your needs. Keep your software basic for as long as you can. Try work arounds before spending on plugins. Ableton Live is particularly well equipped with everything that one needs to record, mix and master before automatically loading it to SoundCloud if you wish. Enjoy yourself and good luck . ",
            "date": "Answered June 15, 2019",
            "views": "96",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Wrhel",
                    "user_href": "/profile/Mark-Wrhel"
                },
                {
                    "user_id": "Peter Coultas",
                    "user_href": "/profile/Peter-Coultas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walt Borys",
                "href": "/profile/Walt-Borys"
            },
            "answer_text": "I can only answer for myself. The answer is wrapped around the self-examination, “What do I want to do? What do I want the final product to sound like?” For me, I make home demos of songs I (or friends) have written, mainly for my own pleasure, and occasional web posting . Since I have 24 tracks, I can put down basic tracks, then add whatever instrumental foolishness I wish to spend my time on. The end product is not ‘professional’, but certainly competent and depending on the effort put, can sound pretty great. I suppose I can spend gobs of time learning how to master like a pro, and RTFM (read the frickin’ manual) to take advantage of all the onboard processing, -OR- I could simply learn enough to sound good and spend time playing. I DIDN’T NEED A LOT OF EXPENSIVE EQUIPMENT, and I chose a standalone DAW (digital Audio Workstation) to do all my work on, instead of loading my PC with extra software (and hardware) to get the job done. Main components of my current setup- Digital Recording Workstation- Tascam DP24, 24 track studio, outputs final mixdown to SD disk Good mics- Shure Beta 58A (vocals), Sennheiser MKE 4032 (for instruments) NearField Monitors- KRK RockIts Playback Amplifier- Samson Servo 170 Dell PC to download from SD disk, and burn final tracks onto CD or post to web. (judge for yourself- here’s an original track I recorded with my 9 piece Praise group, almost 10 years ago! )  ",
            "date": "Answered June 21, 2019",
            "views": "196",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikhil Gupta",
                    "user_href": "/profile/Nikhil-Gupta-38"
                },
                {
                    "user_id": "Mark Wrhel",
                    "user_href": "/profile/Mark-Wrhel"
                },
                {
                    "user_id": "Peter Coultas",
                    "user_href": "/profile/Peter-Coultas"
                }
            ]
        }
    ]
}