{
    "title": "What makes a song bad? - Quora",
    "tags": [
        "Bad",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noah Kivler",
                "href": "/profile/Noah-Kivler"
            },
            "answer_text": "So there are some objective measures of this. Excessive repetition is one way, however lack of repetition is another. In order for a theme to be developed, repetition is necessary, however many pop singers feel the need to repeat the same two bars over and over again. Another is dissatisfactory harmony. Ie. A song that ends on vi, or pretty much anything other than I. A song with no dissonance at all will bad bland, because there are no tensions being resolved, the piece will not grab or satisfy listeners, and you risk falling to the background. This is why mozart works well as study music and Beethoven not so much, Beethoven is very dissonant where as Mozart is easy to listen to. Dissonance is crucial in creating a piece of music. There are definitely subjective things some people don’t like. “Nasally” singing has been mentioned, the female equivalent is really breathy singing, a lot of sopranos do it to the point where it is now a cliche. The context of the album can make a song bad too. For instance, listening to one “Chainsmokers” song might give you the impression that they are a decent group, until you spin the record and realize that all of their other songs are the same thing. That being said, it is hard to consider any song “Bad” for those reasons alone. Are the chainsmokers bad? Sure, its repetetive drivel, but how can I possibly know that their music doesn’t speak to other people like Beethoven speaks to me. We spend our entire lives with ourself, so its hard to recognize our biases and respect art. Most pop music regardless of how we feel about the lyrics has a cadence, and a pattern, and if that speaks to people, especially in numbers like Ed Sheeran pulls, then I can’t call it a “Bad song”. Tl;DR Lack of predictability, too much predictability, the same as everything else on your album. ",
            "date": "Answered June 1, 2017",
            "views": "5",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Lovkins",
                    "user_href": "/profile/Faith-Lovkins"
                },
                {
                    "user_id": "Marier Villarreal",
                    "user_href": "/profile/Marier-Villarreal"
                },
                {
                    "user_id": "Jason Hurd",
                    "user_href": "/profile/Jason-Hurd-6"
                },
                {
                    "user_id": "Lvdjenf Vfbenck",
                    "user_href": "/profile/Lvdjenf-Vfbenck"
                },
                {
                    "user_id": "Dave Cripton",
                    "user_href": "/profile/Dave-Cripton"
                },
                {
                    "user_id": "Maryam Ahmad",
                    "user_href": "/profile/Maryam-Ahmad-24"
                },
                {
                    "user_id": "Leo Tilson",
                    "user_href": "/profile/Leo-Tilson"
                },
                {
                    "user_id": "Becky Price",
                    "user_href": "/profile/Becky-Price-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Busacker",
                "href": "/profile/Sam-Busacker"
            },
            "answer_text": "Music is subjective and I wholeheartedly think there's no logical reason music reviews should sway your opinion on a track/record. Yet, they do. A lot. Music critics and reviewers who claim something is “bad”, are not exempt from psychology. These people have specific tastes and even when they try to rid themselves of their biases, it's impossible. The only way we could accurately review music and put a “number rating”, like 0–5/5 or 0–10/10, is if we used a computer to process it. When someone else says music is bad, and then you go ahead and listen to the song to see if it's bad, your brain primes you to ask the question: is this bad? And at that point, the song they're talking about and the song you are now listening to has to be above average or youre likely to agree with the critic. This is in part due to your ego trying to make you think you know what good and bad music is. It can also be the opposite way. You might seek music that people generally dislike in an effort to stick out or consider yourself above average in your ability to interpret music. Either way, the integrity of music can't be measured effectively. without some bias. You can kind of measure this by comparing it to songs that hit the charts or by comparing it to classic songs that the public has deemed “classics” (normally just old songs that were considered popular at the time). It's all about your ego. Anyone can find any kind of music pleasant so claiming music as bad or good simply does more harm than good, because there are people who might enjoy all kinds of music until a person of influence deema it “bad”. ",
            "date": "Answered November 24, 2019",
            "views": "729",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julien Fishar",
                    "user_href": "/profile/Julien-Fishar"
                },
                {
                    "user_id": "Jony Dooi",
                    "user_href": "/profile/Jony-Dooi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Stint",
                "href": "/profile/Alex-Stint"
            },
            "answer_text": "Preference and taste. Pick a really bad song. I bet someone likes it. No matter how bad a song is, there are people who like it. It comes down to individual preference in music. Perhaps conditioning plays a part too. Pop songs these days follow certain formulas and if lots of people like them, it must mean that’s what good music sounds like. Repetitive songs that are easy to remember are quite popular. Preference in music, therefore, can be swayed. So when there is a song that doesn’t follow a formula or is different from “good music”, it is often seen as a bad song. Haven’t you ever listened to a song the first time and thought it was bad but after listening to the same some a bunch of times, it grew on you and you liked it? Repetitive listening of certain styles of music can make your preference lean toward those types of songs as well. ",
            "date": "Answered June 2, 2017",
            "views": "17",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faith Lovkins",
                    "user_href": "/profile/Faith-Lovkins"
                },
                {
                    "user_id": "Jony Dooi",
                    "user_href": "/profile/Jony-Dooi"
                },
                {
                    "user_id": "Exciting Cubs",
                    "user_href": "/profile/Exciting-Cubs"
                },
                {
                    "user_id": "Music Lover",
                    "user_href": "/profile/Music-Lover-277"
                },
                {
                    "user_id": "Timothy Spencer",
                    "user_href": "/profile/Timothy-Spencer-30"
                },
                {
                    "user_id": "Elad Perets",
                    "user_href": "/profile/Elad-Perets"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "That’s highly subjective, as people have different criteria to apply to the question of whether they like a particular song or not. I’m pretty picky; I don’t like nearly any of today’s “pop” music. I don’t like repetitive, silly lyrics. I don’t like thumping, “hit-you-over-the-head” backbeats or repetitive rhythm figures. I don’t want to struggle to understand the lyrics. However, lots of people seem to like those very things. I don’t know how many times on the old American Bandstand show some youngster would give his mini review—”Well, it’s got a good beat and you can dance to it.” Enough for him, not for me. To me, some of the worst pop music ever turned out was during the so-called disco era. Vapid lyrics (that were for the most part just parts of the rythym), thump-thump-thump backbeats (“music even white people can dance to”) and even worse; no guitars. ",
            "date": "Answered June 1, 2017",
            "views": "928",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tucker Benton",
                "href": "/profile/Tucker-Benton"
            },
            "answer_text": "many things, being too repetitive, using chord structures that do not fit well together, bad players, bad singers, bad rhythms, sometimes people will use the same beat or chords for many songs and once you hear that so many times it gets annoying, and many other factors can make a bad song, it can even just be your taste in music, or not understanding what is happening in the music you are listening too, like if you jump straight into something like live in japan or medeski martin and wood you will be disturbed but if you have been into jazz and understand what they are doing you will find them geniuses. ",
            "date": "Answered June 3, 2017",
            "views": "845",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julien Fishar",
                    "user_href": "/profile/Julien-Fishar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheena Williams",
                "href": "/profile/Sheena-Williams-27"
            },
            "answer_text": "To me, what makes a song bad is if an artist plays it safe when it comes to the melody. If it sounds monotonous but at the same time catchy, then I know the song wasn’t made to make the listener “feel” anything. It’s just designed to be repetitive and annoying enough to get stuck in one’s head, eventually breaking down any resistance, causing folks to just wake up one day and like the song. Another thing that makes a song bad is if it has nothing to say. It’s just mindless drivel. ",
            "date": "Answered June 2, 2017",
            "views": "576",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fabian Sturman",
                    "user_href": "/profile/Fabian-Sturman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wesley Riggs",
                "href": "/profile/Wesley-Riggs"
            },
            "answer_text": "\"There are only two kinds of music-good (music) and bad (music)” - Duke Ellington Taste in music is subjective. What irritates me the most is a grating, nasal tone like that of Shawn Mendes, Burl Ives, and Billy Corgan. I also don’t like songs that are too simple or repetitive: “Ring My Bell” or “Hey Mickey.” I seek out pure tone in whatever genre of music, so I prefer singers like Norah Jones, Whitney Houston, Faith Hill, and Samantha Gongol. I also prefer the complex patterns of jazz and classical music, but I’m a big fan of Fifth Harmony, Ariana Grande, and Selena Gomez. I highly recommend the jazz-synth hybrid sound of Marian Hill (aka nerd pop). They are by far the best new sound of the year. ",
            "date": "Answered June 1, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Lambert",
                    "user_href": "/profile/Ben-Lambert-19"
                },
                {
                    "user_id": "Bella Kurtzmäch",
                    "user_href": "/profile/Bella-Kurtzmäch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Hurd",
                "href": "/profile/Jason-Hurd-6"
            },
            "answer_text": "In the 18th century, there was a rule that repetition of the same melodic figure four times consecutively was inept and in bad taste, thus rendering the composition in which the repetition occurred ‘bad’, objectively speaking. Given that repeating a figure four consecutive times is standard operating procedure for contemporary pop songs, there is a lot of bad music being played nowadays, at least by Mozartean standards. ",
            "date": "Answered February 16, 2019",
            "views": "420",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Maples",
                "href": "/profile/Daniel-Maples-1"
            },
            "answer_text": "When it fails to be written from the heart. It’s easy to be disingenuous when you’re just trying to make some money. It’s much more challenging to open your heart and mind and spill it all over a recording studio and stage for others to critique. This may explain why it’s so difficult to cover other artists work. It requires feeling something vs regurgitating others’ feelings. ",
            "date": "Answered June 15, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julien Fishar",
                    "user_href": "/profile/Julien-Fishar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kartik Berry",
                "href": "/profile/Kartik-Berry-1"
            },
            "answer_text": "A bad song can be like.. Having a bad beat.. Or high pitch sounds.. Like girl shouting in your ears…a song that feels that its creating noise and u cant hear it anymore.. Like selfie mene leli aaj.. By dhinchak pooja  ",
            "date": "Answered June 2, 2017",
            "views": "200",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mate Eyy",
                "href": "/profile/Mate-Eyy"
            },
            "answer_text": "How it’s sung ",
            "date": "Answered June 3, 2017",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zoe Hitchins",
                "href": "/profile/Zoe-Hitchins"
            },
            "answer_text": "I’d like to think so.. ",
            "date": "Answered June 1, 2017",
            "views": "80",
            "upvotes": "0"
        }
    ]
}