{
    "title": "What's the best way to learn and practice bass at home? - Quora",
    "tags": [
        "What Is the Best Way To Do X?",
        "Bass Guitar",
        "Learning to Play Musical Instruments",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Barnes",
                "href": "/profile/Jon-Barnes"
            },
            "answer_text": "I agree with Ruben Kenig's response and would probably add the following: Learn how to hold back This generally comes more easily playing with others than on your own, but the idea of the musical line over quick fingers is very important. You mentioned Panagiotis Andreou, who happens to be one of my favorite bass players at the moment. The reason for this is that, while he can rip up the bass when he wants to, most of the time he doesn't. Most of the time, he is playing an incredible funky groove with very few notes and flourishes.  There are many flashy bass players out there and Wooten comes to mind immediately. That man can certainly play a solid line, but he focuses too much on his lightning fingers schtick for me to take him seriously. Alternatively, players like Anthony Jackson and John Patitucci, who can also be loquacious, seem to have a very specific intent for their notes in a much more musical sense.  Learning to hold back is very challenging because it often goes counter to what you want to do. But it's important to remember that you are the groove. Think about what statement you are making with your line. If your band is playing fast 16th notes, think about how poignant playing whole notes, or half notes would be.  This does not mean that you shouldn't eventually practice Teen Town at 150bpm, but think about the line you are playing and how it sits in the song rather than worrying about playing as fast as you can. This brings me to... Focus on your role As mentioned, you are the harmonic pocket that your band will rely upon. You are their pillar of support, and it's important that you provide a strong foundation for the rest of the song, both rhythmically and harmonically.  This doesn't mean that you can't aspire to become a more prominent player like Pastorius, but even he knew his role. Very well, I might add. Playing the bass like a guitar, which is a trap that many people fall in to (possibly from just hearing guitar lines better), can end up reducing the role of the bass in the music. This also does not mean that the bass can't be approached from a more experimental standpoint. But understanding the role that the bass has in music, going back hundreds of years, is the foundation from which you want to build.  Study jazz/romantic era compositions ..and in general, listen and think about many other styles. I don't think that this is a necessity, but both jazz and romantic era compositions (e.g. Chopin, Liszt, Brahms) offer up very palatable experiences with chromaticism and dissonance. What this can bring to your bass playing is a larger vernacular. You'll learn how to substitute notes, re-harmonize, and build flowing bass lines that can enhance the overall interest in the song. For some, this is less important than the other factors, but I think that it very largely helps to expand your abilities from both harmonic and rhythmic aspects.  But don't stop there! Listen to Brazilian music, Afro-Cuban music, electronic music, funk, classical music... There is so much out there to widen your own language and this will definitely help you to apply the best lines at the right time.  Learn to transcribe The skill of notation can be incredibly helpful as you will be able to visualize the lines. But if you don't want to learn how to notate, just try to learn the lines from those you admire. As Ruben mentioned, learning other bass lines will help you understand what the bass players are doing and why it works. It is up to your own judgement as to who is a good player and what you want to achieve, but again, Panagiotis Andreou is a pretty incredible guy to learn from.  Think about the reasons for your technique In essence, you should be able to play what you want to play, and then the some. I think that this is the extent to which you should learn technique. Aside from your scales and modes (which are very important), think about learning technique from a musical standpoint and think about how and why you want to apply it. Knowledge without application is relatively useless and while there are things that you just can't get around knowing (because they apply everywhere), the musical reason why you learn something is what is going to be most beneficial for you.  Also, hammer out your body motions early as it is much more difficult to undo bad habits later on. This often requires the guidance of a teacher as they'll be able to figure out what is working and what is not, but you can certainly gather some useful information from just watching other players.    While this is a much more esoteric, and perhaps less directly useful response, these ideas are some of the fundamentals for my own playing and learning. One of the most important things to consider, both when you are playing and when you are practicing, is why you are doing what it is you are doing. Every single note and every single articulation counts so there should be a reason behind each one. ",
            "date": "Answered July 15, 2015",
            "views": "2",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhimanyu Chaturvedi",
                    "user_href": "/profile/Abhimanyu-Chaturvedi-5"
                },
                {
                    "user_id": "Rohan Naik",
                    "user_href": "/profile/Rohan-Naik-35"
                },
                {
                    "user_id": "Lara Sandoval",
                    "user_href": "/profile/Lara-Sandoval-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruben Kenig",
                "href": "/profile/Ruben-Kenig"
            },
            "answer_text": "Jay Verkuilen's answer is good. This is intended as an epi-answer: Learn songs by ear. Find songs you like the bass on, listen to them and copy what they do. Work on just a few bars at a time. You can use an audio editor like Audacity to slow tracks down to help pick things out. I would suggest good places to start are, Early BeatlesStax soul (Otis Redding, Sitting on the Dock of the Bay for example)Talking Heads (particularly the early stuff)Also, sing basslines out loud. Building a connection between your ear, your voice and your fingers (to play the lines) will help you massively as you develop as a musician. Start slowly. When learning anything accuracy is more important than speed. In fact, in order to get fast you have to start slowly. Really slowly. For instance, Steve Harris's iconic metal bassline on The Trooper runs at about 160 bpm. I would recommend starting to learn that with a metronome set at 60bpm or even lower. Use a metronome. A good sense of time in music is one of the key differentiators between a player you want to make music with and one you don't. This is particularly true for bassists. It can seem difficult at times dealing with that click, but if this happens just slow it down. It will pay off massively. Don't practice in mistakes. If you are practicing something and make a mistake stop, go back and correct it. You are teaching your body to repeat desirable actions. If you let the mistakes slide you are practicing the mistakes. If you can't play something at a particular speed, slow it down and/or break things into smaller blocks. Record yourself playing regularly. Learning a musical instrument is a massive task. This can seem daunting, but along the way to your ultimate goal there will be lots of intermediate successes. Record yourself practicing regularly and go back and listen to your recordings from a few months ago periodically. It is very easy to get sucked into looking at very short scales of time. That can be demoralising, \"Why is it taking me so long to learn this line?\" However if you are practicing regularly you will get noticeably better over longer time scales. In general the better you get the longer you might need to look back to see big improvements. Starting out a month should do. When you start shredding like Stu Hamm you might need to look back six months to see improvements but they are there. Enjoy your successes. Practice regularly. Regularity is more important than volume. It is much better to practice effectively for 10 minutes five times a week than for an hour once a week. Try and play every day. Even if this is just noodling around. It is good to feel your instrument in your hands every day. Mindful practice is better and regular mindful practice is best. Enjoy yourself. Playing music is great fun. You are on a path to becoming a wizard. Have fun. ",
            "date": "Answered July 9, 2015",
            "views": "31",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adrian Trawka",
                    "user_href": "/profile/Adrian-Trawka"
                },
                {
                    "user_id": "Jon Barnes",
                    "user_href": "/profile/Jon-Barnes"
                },
                {
                    "user_id": "Eric Tan",
                    "user_href": "/profile/Eric-Tan-49"
                },
                {
                    "user_id": "Gabriel Souza",
                    "user_href": "/profile/Gabriel-Souza-6"
                }
            ]
        }
    ]
}