{
    "title": "What is the meaning of the Tool song Jambi? - Quora",
    "tags": [
        "Meaning (philosophy)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sengward Robuts",
                "href": "/profile/Sengward-Robuts"
            },
            "answer_text": "Many elements of the song are based on a rather psychadelic-friendly children’s TV show from the early 90s called Pee Wee’s Playhouse. An occasional character on that show was a genie named Jambi, who uses a magical phrase “meka leka hi meka hiney ho.” The rhythm of the song’s main riff strongly resembles the rhythm of the magical phrase. Indeed, drummer Danny Carey has admitted that the name Jambi came from Pee Wee’s Playhouse. Additionally, I believe there is a very strong chance, from the sound of it, that guitarist Adam Jones is saying something along the lines of “meka leka hi….. meka leka hiney ho” into his talk box at the end of the talk-box guitar solo. The vowel sounds and syllables coincide. Besides, why else introduce a talk box?! Does that mean the song is about Pee Wee? No, that’s the amateur approach to art critique—tracing one allusion and then stopping there as if the mystery is solved. If the meaning of the song Jambi is Jambi from Pee Wee’s Playhouse, we can’t stop there. The question, then, is what is the meaning of Jambi from Pee Wee’s Playhouse? ",
            "date": "Answered February 19, 2018",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nagham Arous",
                    "user_href": "/profile/Nagham-Arous-1"
                },
                {
                    "user_id": "Jade Dixon",
                    "user_href": "/profile/Jade-Dixon-35"
                },
                {
                    "user_id": "Son H Nguyen",
                    "user_href": "/profile/Son-H-Nguyen-1"
                },
                {
                    "user_id": "Adolfo Sesto",
                    "user_href": "/profile/Adolfo-Sesto-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ghina Fatimah",
                "href": "/profile/Ghina-Fatimah"
            },
            "answer_text": "Besides having the folk songs are Jambi, Jambi Province Also have some traditional musical instruments. The Jambi provincial capital Also in Jambi most big society adala Malay community. So it is no wonder if some of the musical instruments The ADA in Jambi almost the same WITH The area is more predominantly Also wither. However, kita will try to review 7 Typical musical instrument that is in Jambi singer. 7 traditional musical instrument from the Jambi is: 1. Serangko2. Gangor Cangor3. Puput Wood4. Drum Melayu Jambi5. Lute Jambi6. Sekdu7. Kelintang Wood Below is a musical instrument Explanations Concerning 7 Jambi: Serangko Serangko Is a kind of wind instrument Made Of buffalo horn. Length musical instruments Serangko singer reached 1 meter - 1.5 meter. COPYRIGHT WORKS ON SON era PT Serangko singer instruments used by War Commander for review provides Command. In addition to the functions of ITU, Serangko Also used to review notifications when ADA Accidents Death The override prayers One society in Jambi. Serangko traditional musical instruments from JambiGangor / Cangor Gangor Cangor is a traditional musical instrument Jambi Made Of Bamboo. Cangor a tube zither musical instruments, including the Group of musical instruments Idio-kordofon. Singer musical instrument usually played as Pelepas Tired for Farmers while the Rest. Cangor Many are found in Sarolangun, Merangin, Bungo, Tebo and Kerinci. Cangor instrument From Jambipuput WoodIF in West Sumatra kita Know Serunai Puput musical instruments, in Jambi ADA man named Puput Wood. Puput Wood Singer Is a kind of traditional musical instruments Jambi Made Of Wood. Wood Puput musical instrument classified as a wind instrument. Wood crowbar similar Singer serunai Equipped tongues as inflatable tools, IN bodies are Seven Holes wooden whistle tones. Wooden whistle play as a complementary tool to accompany the song When the ON arts and traditional dance Jambi. Jambi musical instruments - Puput WoodMalay drum JambiJambi Melayu drum has the characteristics Shape and Sound The Typical compared WITH drum From other regions are. Jambi Melayu drum made from coconut Bongkot And Animal Husbandry like goat skin. Interwoven rattan serves to review the drum skin tightening. WITH played drum beaten way using both serbi While embraced hearts POSITION Sit. MORE ON reads aloud so that the skin Circle Part hearts nailed WITH using round rattan called sentung. Diprovinsi Jambi singer drum typically used to review polaritme folk songs are well as dance accompanist, as well as songs melayu other Jambi. ",
            "date": "Answered January 23, 2017",
            "views": "32",
            "upvotes": "0"
        }
    ]
}