{
    "title": "What are the last five artists you listened to? - Quora",
    "tags": [
        "Listening to Music",
        "Listening",
        "Music Recommendations",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Betül Baykuş",
                "href": "/profile/Betül-Baykuş"
            },
            "answer_text": "TREMONTI ⌁ Unable to See, Dust, Catching Fire, Radical Change, All I Was, Desolation, Things I’ve Seen, Decay, Another Heart, Dark Trip, Leave It Alone, Tore My Heart Out, Providence ONE OK ROCK ⌁ The Same As, Deeper Deeper, Nothing Helps, Reflection, Yume Yume, Onion, Koi No Aibou Kokoro No Cupido, Juvenile, Doppelganger, Kaimu, No Scared, C.h.a.o.s.m.y.t.h N.FLYING ⌁ Heartbreak, Oh Really, Goodbam, All In, Youth, Flowerwork, Rooftop, Hot Potato, The Real, Lonely, Leave It ( Also, their whole award and k-pop concert performances, their covers on Immortal Songs and other covers- Queen, Michael Jackson, K-pop Medley…2 or 3 full busking and I already watched all these videos before 🤦🏼‍♀️ but I really love their covers ) NIRVANA⌁ Smells Like Teen Spirit ( also covers of the song in the voice ^^ ), Come As You Are, Polly, Lithium NEW RADICALS ⌁ You Get What You Give, Someday We’ll Know These are literally my last five artists and their songs I listened to today. I listened to other artists too but my heavy rotation was these bands. I am listening to too many songs nowadays cause onion, garlic, tobacco, and wheat harvest time have passed in Turkey, Adıyaman ( yes, I spend summers working on a field with my family ) and my online lessons are about to start so I am a little depressed. I am just playing Sudoku while listening to music the whole time and maybe a little housework but while listening to music 😂 ",
            "date": "Answered September 12, 2020",
            "views": "283",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Levii Shu",
                    "user_href": "/profile/Levii-Shu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sophie Swaney",
                "href": "/profile/Sophie-Swaney"
            },
            "answer_text": "Lordy. This is extremely hard. Most of my listening is purely Rush. I’ll just do my top 5 most recently listened to songs from each band as well. Lel Rush (Vapor Trail, In The Mood, Limbo, The Analog Kid, Bastille Day)Iron Maiden (Sign of the Cross, Powerslave, Book of Souls, The Longest Day, Running Free)Duran Duran (Last Chance on the Stairway, Friends of Mine, Come Undone, Girl Panic, A View To A Kill)Led Zeppelin (All My Love, Trampled Underfoot, When the Levee Breaks, Heartbreaker, St. Tristan’s Sword)Greta Van Fleet (Highway Tune, Black Smoke Rising, When the Curtain Falls, Edge of Darkness, Brave New World)",
            "date": "Answered September 11, 2020",
            "views": "129",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristi Brandom",
                    "user_href": "/profile/Kristi-Brandom-4"
                },
                {
                    "user_id": "Aidan Cavanaugh",
                    "user_href": "/profile/Aidan-Cavanaugh-1"
                },
                {
                    "user_id": "Tom Thomas Bejoy",
                    "user_href": "/profile/Tom-Thomas-Bejoy"
                }
            ]
        }
    ]
}