{
    "title": "What music artist produces bad music, but is still famous? - Quora",
    "tags": [
        "Music Production",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Burnett",
                "href": "/profile/Ken-Burnett-3"
            },
            "answer_text": "Can of worms eh, good and bad; how subjective is this? Ignoring that caveat, let’s discuss Captain Beefheart. A first album has Ray Cooder as part of the ensemble, so clearly has its roots in blues, but, it does have the track Electricity which has a bonkers theremin riff. Then he kidnaps his new band, keeps them in a cabin low on food, sleep and money, which produces Trout Mask Replica. This is….strange. It’s definitely not pop, rock or blues, nor even jazz, but just occasionally you might hear distant echoes of these. Fast forward a few years and he is now a symbol of the musical counterculture, although not in any political sense. His music is, well, difficult but this has not prevented him from selling out the historic Manchester Free Trade Hall.* The substantial proportion of dope heads in the audience have affected everybody’s heads. When he plays Big Eyed Beans From Venus, there is an open chord which swells in volume, for a long time. I experienced the sensation that the FTH levitated upwards during this, a never to be repeated phenomenon. You’ll have got the gist by now. Then, he makes an album of soft rock, Unconditionally Guaranteed , to general derision. As soft rock it’s not bad but then it’s not Lick My Decals Off either. Beefheart fans will shuffle awkwardly and generally try not to mention this as it makes their musical hero appear as an unprincipled sellout. He does come back with Floppy Boot Stomp but multiple contractual difficulties and a debilitating illness ends his musical career and he becomes a painter of some note. The moral of this tale is that we shouldn’t believe that musical heroes are heroes in any other contexts. If they produce bad or “sellout” music we should just continue to enjoy the stuff which we liked in the first place. The Free Trade Hall was the site of an historic exchange between a member of the audience and a musician. Dylan had just completed a first half of acoustic music and came back on with an electric guitar which he plugged in. “Judas” came the shout in a Lancashire accent. “He ain’t no fuckin’ Judas!” - this from A band member.",
            "date": "Answered November 8, 2018",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Maroun Aye",
                    "user_href": "/profile/Maroun-Aye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikki Weston",
                "href": "/profile/Nikki-Weston-2"
            },
            "answer_text": "U2. Anybody remember “Lemon”?  They haven’t had a good song since maybe 1991.  Also I do not get Drake and his string of #1 hits this year.  My kids don’t get him either so not an age thing.  Something’s not right. ",
            "date": "Answered November 8, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maroun Aye",
                    "user_href": "/profile/Maroun-Aye"
                }
            ]
        }
    ]
}