{
    "title": "What Stray Kids songs describe each members of Stray Kids? - Quora",
    "tags": [
        "Stray Kids",
        "Boy Bands",
        "K-Pop Idols",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sejal Desai",
                "href": "/profile/Sejal-Desai-53"
            },
            "answer_text": "I don't know if the songs really directly describe the members. A lot of the things they write, could very much be from their direct experiences. I'll write my answer on which songs remind me of who, and how I perceive each member to be. So disclaimer; the following is all my opinion and based on my perception of each of the members are: Bang Chan - You Can Stay Chan is such an amazing, pure human being. He serves as a place of comfort to so many people for so many different reasons. His words are always so reassuring. Him being the leader, and his line in You Can Stay, being \"you can stay\" feels so reasurring to me. It's like he's telling you, \"hey you, you can stay\". I don't know if that makes sense? I really adore and admire Chan for being who he is. He's an exceptional leader. The lyrics of the song are so comforting and remind me so much of Chan. \"You can rest here.\" \"You can be here.\" \"You can stay.\" Lee Know - Airplane/Mixtape 2 Airplane is such a cute song. And what is even cuter is Lee Know's lines in this song. It's such a \"free\" song, as well as unique. And it just reminds me so much of Lee Know. He's so unique and so admirable. The song is beautiful and so is he. I've honestly never come across someone like Lee Know. He's just so wonderful and cool! Mixtape 2, because of how far he's come. In the survival show, he received a lot of criticism and even was eliminated. But Mixtape 2 allows me to know that he's doing so well and I'm so proud of him. He's so hard working and determined Changbin - Grow Up/My Pace These songs especially remind me of Changbin. I know how he loves to perform Grow Up and he really loves My Pace. Changbin is one of my biggest inspirations and his lines in each of the above songs always help me to push forward. The songs speak about going at your own pace, and they tell you that you're doing well as you are. It just also makes me think that Changbin, and the whole of Stray Kids are unique and shouldn't be compared to others. On Track/Neverending Story/Ex - it reminds me how Changbin tries to have a darker appearance on stage, but off stage and in his heart, he's so soft. I can't help but think about his duality and how he's so good at making everyone's hearts melt Hyunjin - Hellevator I always think of Hyunjin when listening to Hellevator, I get especially emotional during his rap part. I think it applies to all the songs they did during the survival show. Hyunjin also got quite some criticism, for his pronunciation especially. Now, when listening to each of these songs, I can't help but feel so proud of him and how far he's come. He values his profession and he really puts in the work Han - Astronaut/Mixtape 1 These songs are so bright, free and beautiful - they always remind me of Han. His personality always stands out. The vibe of each of the songs fit so perfectly with the vibe that I get from Han. I get such gorgeous, comfortable, pastel-color-clouds type of vibes and it just reminds me of how lovely and cool Han is. Han is such a lovely, bright being and he never fails to make me and so many others smile Felix - Sunshine Sunshine, because Felix is everyone's ball of Sunshine. His smile and personality is so bright. He's so strong and determined and I admire him so much. He's not afraid to be himself, and like the sun, he's not afraid to shine. I adore Felix and I'm so proud of him. He's an absolute angel. He's special like that few rays of sunshine that keep you warm, when you're out in the cold. He's unique and amazing Seungmin - Spread My Wings (Young Wings) Probably because it's one of Seungmin's favourite songs. \"어린 날개로 날래 spread my wings\" - this reminds me most of Seungmin, it translates to \"I want to fly with my young wings, spread my wings\". It's like he's ready to take off, he's determined and ready to fly. I'm tryna figure out a better way to explain this, but it's like, you're ready to fly, and make mistakes and fall down. You're willing to do all that, to put in work and become the best you can be. You're not gonna hold back, especially not out of fear. I admire Seungmin, he's very special to me. He's so disciplined and smart. He's such a lovely human being. He seems to love learning, and therefore always appears humble to me. Jeongin - School Life This cute, upbeat song always reminds me of Jeongin. Jeongin's personality is so bright and adorable to me. His smile is contagious and it's the cutest thing ever. Jeongin is definitely the Maknae On Top - everyone adores him, me included. Like many of Stray Kids songs, I haven't heard something like School Life, it's unique and fun. And reminds me of Jeongin's beautiful, unique vocals. His voice is so sweet and sometimes it even makes me cry. I'm so proud of Jeongin - he's so special and I love how carefree he can be. ",
            "date": "Answered October 1, 2020",
            "views": "474",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hyun Minho",
                    "user_href": "/profile/Hyun-Minho"
                },
                {
                    "user_id": "Audrie Han",
                    "user_href": "/profile/Audrie-Han"
                },
                {
                    "user_id": "Crystal Quartz",
                    "user_href": "/profile/Crystal-Quartz-5"
                },
                {
                    "user_id": "Meghna Pal",
                    "user_href": "/profile/Meghna-Pal-2"
                },
                {
                    "user_id": "Valerie Hale",
                    "user_href": "/profile/Valerie-Hale-21"
                },
                {
                    "user_id": "Jenna Shelby",
                    "user_href": "/profile/Jenna-Shelby-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Young-Mi Soyeon",
                "href": "/profile/Young-Mi-Soyeon"
            },
            "answer_text": "Backdoor : hyunjin he just shined to me in this era gods menu : Felix his deep voice is excellent and I thought he was just for that comeback get cool : I.n he fits the cutest eras he just shined I feel like he was made for that comeback easy : changbin and I.n and Han they all shined to me the most I couldn’t pick one! my pace : Han he shined with his first part he just matches that comeback! awkward silence: woojin and lee know because they fit that kind of cute little songs! i am u : I.n and woojin fit that era so well! miroh : Bang Chan and lee know: first of all lee knows dancing was soooooooooo goood teach me lol bang Chan did so well with his dancing his outfit was off topic it was soooo great. top : changbin i.n and Han they were so good changbin shined with never let u go never let u go I loved that part I.n shined with his center time he just looked so good, u shine tiny boi! Han your singing is so good I thought u were main vocalist and ur close is amazing. Side affects: offcorse who else Felix owned it and people need to stop saying that that song is bad it’s not!! Astronaut: I.n and hyunjin just saved the song!!! District 9: Felix and hyunjin there parts were clearly amazing! Double knot: Han and Hyunjin owned the dancing break downs!🤣😂😂😁✌️ Hope that helped u! ",
            "date": "Answered October 2, 2020",
            "views": "137",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Johnson",
                    "user_href": "/profile/Lisa-Johnson-2278"
                },
                {
                    "user_id": "Maysa Shakeel",
                    "user_href": "/profile/Maysa-Shakeel"
                }
            ]
        }
    ]
}