{
    "title": "What do people see in Ellen DeGeneres? Is there some reason she is famous that I'm missing? - Quora",
    "tags": [
        "The Ellen DeGeneres Show (TV talk show)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "A2A Question: What do people see in Ellen DeGeneres? Is there some reason she is famous that I'm missing? Some thoughts: She’s funny, without being threatening - Ellen’s humor is the bland and largely inoffensive kind that attracts the middle class viewers her program is seeking. She isn’t “dirty” and, as a female comedian, her humor doesn’t “male bash” which doesn’t make her a threat some people’s fragile egos.She’s gay, but not “militantly so.” - Everybody knows that Ellen DeGeneres is gay…but her public image is carefully crafted to keep that as just another part of her personality. Her wife doesn’t appear very often on the program, she doesn’t use her talk show as a platform for LGBTQ issues, she avoids “militantly gay” guests and she keeps things as “straight” as she possibly can. Only true homophobes could find anything about her program which promotes being gay. In fact, if she had a Steadman Graham in the background, you wouldn’t know that she was a lesbian.Her timing was excellent - Hollywood kept trying to create a “White Oprah Winfrey” to compete with the real one. The only one who made the “cut” was DeGeneres. She was the right person, at the right time, with the right blend of blandness and humor to make her appealing to mass audiences. A few years earlier or later, she wouldn’t have made it. Her timing was just right and a lot of people find that to be appealing.Her personal life is pretty undercover - Again, her wife doesn’t appear on the show very often. Her relationship with her mother has to be pretty strained (DeGeneres by her own admission had a hard time coming out to her which doesn’t indicate much closeness) and she doesn’t have any children, neither of which are spoken about on the show. While her real estate speculation makes news, her personal affairs rarely do. The public can certainly appreciate a celebrity who keeps their private matters private and Ms. DeGeneres certainly does do that.She keeps her harder edges well-hidden - If you watch DeGeneres’ early standup (and read a recent interview about her) it’s pretty clear that she isn’t all “sweetness and light.” The fact that she’s managed to keep people from going back too far into her past and pulling out the unpleasant things (or getting her to be too unpleasant now) is a testament to both her self-control and her image-managing abilities. While there are occasionally cracks in the facade (Watch how Ellen acts on her shopping trips and how she acts when things are going a little rough with a guest) for the most part, Ellen DeGeneres’ rough parts are kept well-hidden.Soooo…while I don’t know why YOU don’t like her, questioner, I can tell you that her mild humor, bland inoffensiveness, her timing and her ability to keep her personal life and demons under wraps are the major reasons that she’s been a success. ",
            "date": "Answered February 7, 2019",
            "views": "245",
            "upvotes": " View 231 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ed-Klein-18"
                },
                {
                    "user_id": "Arlene B. Heed",
                    "user_href": "/profile/Arlene-B-Heed"
                },
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                },
                {
                    "user_id": "Debbie Thompson",
                    "user_href": "/profile/Debbie-Thompson-16"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anat-Aimee-Azure"
                },
                {
                    "user_id": "Andi Budi",
                    "user_href": "/profile/Andi-Budi-4"
                },
                {
                    "user_id": "Cynthia 李娜",
                    "user_href": "/profile/Cynthia-李娜"
                },
                {
                    "user_id": "Richard Smith",
                    "user_href": "/profile/Richard-Smith-263"
                },
                {
                    "user_id": "Malika Cox",
                    "user_href": "/profile/Malika-Cox-2"
                },
                {
                    "user_id": "Fredda Stibbens",
                    "user_href": "/profile/Fredda-Stibbens"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glenn Brons",
                "href": "/profile/Glenn-Brons"
            },
            "answer_text": "Is she funny? Yeah, but she’s not THAT funny. Here’s my personal thoughts on Ellen DeGeneres. I like her. I liked her show that she was on called “Ellen” where she was a book store owner. It was okay and an easy way to kill 30 minutes. I didn’t watch it religiously or anything, but if I wasn’t doing anything and it was on, sure I’d watch it. Then she came out as Gay on the show and in real life. And she paid for it. She thought she had ruined her career and she did for a while. But here’s my take on this and I could be completely wrong on this, but it was my observation and I’ve not heard many people say this. I didn’t care about Ellen coming out as gay and I didn’t care that the character on the show was gay. But after that happened, that’s what the show became about. ELLEN is GAY. That could have been the episode title of every weekly airing. It got old. Okay okay, we get it. Now go back to your weekly episodic sitcom stuff and make a funny (or semi-funny) 30 minute show about something other than the fact that Ellen is gay. Would the show have continued if they had carried on as before? I don’t know. People blame the failure of that sitcom on her coming out. I say NAY NAY. I feel it failed because her coming out as gay became the sole subject matter of the show. She just recently had a standup show that I watched on Netflix. Wanna guess what the whole premise of the show was? Ellen was gay and came out in the 90’s. I was kind of disappointed, because I was really looking forward to enjoying her show. And I did enjoy it actually, but it could have been so much better. Now I can’t say much about her daytime talk show. It’s obviously very successful given the number of years it’s been on. I’ve seen snippets of it on YouTube or if I’ve got a day off and I happen to see a piece of it. She played a couple of parts in some movies (Ed and Mr. Wrong come to mind) and obviously Dory in Finding Nemo. Here’s the thing, and once again, this is just me. I’m not a Hollywood junkie, character expert. She just comes across as a very naturally nice person. She comes across as a person that you just want to be friends with and be nice to. She comes across as a fun person and we don’t have to agree with everything, but lets have fun around the things we DO agree with. She comes across as a person that could be friends with ANYONE. And when the vast majority of people in Hollywood absolutely do NOT come off that way, she is a breath of fresh air. I believe THAT’s what people see in Ellen DeGeneres. She’s not the funniest, she’s not the most beautiful, she’s not the most youthful, but she’s got an infectious attitude and an infectious smile. ",
            "date": "Answered January 28, 2019",
            "views": "762",
            "upvotes": " View 186 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marianne Alfano",
                    "user_href": "/profile/Marianne-Alfano-2"
                },
                {
                    "user_id": "Katrinka Roberson",
                    "user_href": "/profile/Katrinka-Roberson-2"
                },
                {
                    "user_id": "Letha Kendrick",
                    "user_href": "/profile/Letha-Kendrick"
                },
                {
                    "user_id": "Mari Young",
                    "user_href": "/profile/Mari-Young-14"
                },
                {
                    "user_id": "Sherie Ward",
                    "user_href": "/profile/Sherie-Ward-1"
                },
                {
                    "user_id": "Greg Stipek",
                    "user_href": "/profile/Greg-Stipek"
                },
                {
                    "user_id": "Arlene B. Heed",
                    "user_href": "/profile/Arlene-B-Heed"
                },
                {
                    "user_id": "Wendy Riggs",
                    "user_href": "/profile/Wendy-Riggs-1"
                },
                {
                    "user_id": "Joel Morrison",
                    "user_href": "/profile/Joel-Morrison-16"
                },
                {
                    "user_id": "Robert Ranahan",
                    "user_href": "/profile/Robert-Ranahan"
                }
            ]
        }
    ]
}