{
    "title": "What artist or band has recorded the most songs ever? - Quora",
    "tags": [
        "Music Recording",
        "Bands (music)",
        "Music Recommendations",
        "Music Industry",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glenn R. Anderson",
                "href": "/profile/Glenn-R-Anderson"
            },
            "answer_text": "I don’t know if you would count them as a band, but my guess would be the now defunct studio band, The Wrecking Crew. These guys (and one girl, guitarist/bassist Carol Kayne) are the music behind just about every song you love from the 1960s and early 1970s; several hundred top 40 songs, all told. Rock and roll, R&B, country, jazz, pop…if it came out of the Los Angeles music scene, chances are it was played by The Wrecking Crew.  Image A small sample of their songs includes, \"Surfin' U.S.A.\" by the Beach Boys \"Surf City\" by Jan and Dean \"Everybody Loves Somebody” by Dean Martin \"You've Lost That Lovin' Feelin'\" by the Righteous Brothers \"Mr. Tambourine Man\" by The Byrds \"California Dreamin'\" by the Mamas and the Papas \"Eve of Destruction\" by Barry McGuire \"I Got You Babe\" by Sonny and Cher “A Taste of Honey” by Herb Albert and the Tijuana Brass \"San Francisco (Be Sure to Wear Flowers in Your Hair)\" by Scott McKenzie \"Strangers in the Night\" by Frank Sinatra \"Up, Up and Away\" and \"Aquarius/Let the Sunshine In\" by the Fifth Dimension \"Mrs. Robinson\" and \"Bridge over Troubled Water\" by Simon and Garfunkel \"Galveston\" and \"Rhinestone Cowboy\" by Glen Campbell \"Cracklin' Rosie\" by Neil Diamond …and many, many more. A pretty diverse range of music. ",
            "date": "Answered October 13, 2019",
            "views": "37",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marko Valo",
                    "user_href": "/profile/Marko-Valo"
                },
                {
                    "user_id": "James Beck",
                    "user_href": "/profile/James-Beck-62"
                },
                {
                    "user_id": "Bill Salefski",
                    "user_href": "/profile/Bill-Salefski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Russell",
                "href": "/profile/Matt-Russell-77"
            },
            "answer_text": "Off the top of my head…and not resorting to Google id say Lennon and Mcartney….i know Yesterday is the most covered song in history….between them they wrote over 300 songs…well according to Paul they actually wrote 30 odd songs ‘together’…and although they wrote the rest seperately they were published as Lennon Mcartney songs…also many many artists have covered a Beatles song I can't really think of many others…Elton John released 40 plus albums…so I guess 40 × say 12 songs per single album….plus all the live albums plus a double album being goodbye yellow brick road he would have to be close…I'd be interested to know if anyone comes close to these three prolific songwriters…hope this helps…well 4 if you count Bernie Taupin OIMO….(only in my opinion) ",
            "date": "Answered August 10, 2020",
            "views": "281",
            "upvotes": "0"
        }
    ]
}