{
    "title": "What musical instrument would you like to play? - Quora",
    "tags": [
        "Hobbies",
        "Musical Instruments",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Peterson",
                "href": "/profile/Joshua-Peterson-54"
            },
            "answer_text": "I actually have an answer for this one! I love music so much that I made myself learn 5-ish instruments, and you’ll see what I mean. As a Middle Schooler (Junior High, 6–8th grade) all students are required to take an ‘art’ class. Such as art, band, orchestra, or choir. As a 6th grader I knew Middle School choir would suck, orchestra would be boring, and art would be hard, so I took band, which appealed to my interests much more. I started on trumpet as well as about half the rest of the class. In the beginning I felt like it was just a class and nobody was ever going to sound better, so I let it be just another class. Suddenly, seventh grade comes, and this is where it starts to get interesting. Seventh grade saw a significant drop in trumpets, although we were still many. Many of the jocks, who knew they were more interested in other ‘feilds’ (haha get it? Anyway…), left to peruse other passions while we music lovers stayed. This is also where Jazz Band became a thing. Halfway through Seventh grade my friend invites me to join the Jazz Band that met before school but was still led by the band teacher, so I did. I instantly loved it. Now in regular band, the teacher, Mr.R, asks if any of us trumpets would like to learn a new instrument, French Horn. At first I was hesitant because I was one of the better trumpets in the section, but eventually I agreed to be one of the three. One of the others who came with me still plays French Horn in band with me today, just so you know. After learning and playing the French Horn for that Christmas concert I went back to trumpet because I was having what I call “withdrawals” or perhaps just pride because I wanted to shine on the instrument I was best on. So I continued to play both off and on throughout my Middle School career. The summer after Middle School I decided that I wanted to learn another instrument, not only to help the band and be able to fill spots for our band teacher, but also so I could feel awesome when people asked how many instruments I could play. So that summer we started renting my trombone. I took some lessons from the Middle School teacher and felt a little more prepared for my High School experience the next year. My first day of High School Jazz Band (still before school) I brought my trumpet, thinking, “Now is my time to shine and show off to the snotty sophomores who think they are so great”, but lo and behold NO TROMBONES SHOW UP! I mention that I can play trombone to the High School band teacher and he instantly gave me the part. Eventually we had more trombones show up and I was on the third part which worked for me since I wasn’t very confident on trombone yet. At the end of the year I was on fourth trombone, and Mr. S (the High School Band director) had me learn Bass Trombone to be able to hit the low notes required. Are you keeping up? That’s four instruments so far, although I count Bass Trombone and regular trombone as one instrument since they are very similar. At the end of the year I tried out for the Show Choir of the High School, and found out that I made it, so thus began my path on to learning another instrument: my voice. That summer after Freshman year, me, being the suck-up I am tried to take voice lessons, but quit after the first lesson. I also wanted to try to learn another instrument, so we started renting a flute. I learned some basics but wasn’t progressing enough to keep me motivated, so at the end of the summer, my mother returned it to the shop. Sophomore year, I continued on my music path, playing trombone in Jazz Band and singing in choir (I wasn’t able to fit Band into my schedule Freshmen or Sophomore year so only played my trumpet and French Horn every once in a while). The first trombonist in Jazz Band started getting busy since it was his Senior year, so I started getting tossed into the first position at random times, eventually taking over his part completely since he couldn’t show up much. So that’s 6 instruments so far. Finally, in my Junior year, which is the year I’m in now, I’ve continued to develop all instruments (excluding flute) in Jazz Band (**trombone**), Band (**French Horn**), Pep Band (**marching flugelhorn** which is basically a French Horn but for marching), Show Choir (**voice**), and Handel’s Messiah (trombone, trumpet, French Horn, and voice in the 4 years I’ve participated). So technically I can play 7 instruments, but when people ask, I usually say 5. I hope none of you were bored by my answer, I tried to keep it to the point! I just get carried away sometimes… ",
            "date": "Answered December 5, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mochi Ice Cream",
                    "user_href": "/profile/Mochi-Ice-Cream-4"
                },
                {
                    "user_id": "Kamal Rawat",
                    "user_href": "/profile/Kamal-Rawat-217"
                },
                {
                    "user_id": "Cindy Ryan Gabertem",
                    "user_href": "/profile/Cindy-Ryan-Gabertem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eva Fast",
                "href": "/profile/Eva-Fast-2"
            },
            "answer_text": "I dare to say that I play on a somewhat level eight instruments including my voice. The first instrument I started with was my voice. In my school it was mandatory to join the choir if you were a girl… don't ask why. I don’t know. My teacher said that my singing was exceptional and made me get solo voice lessons. A long time passed and my family was encouraging me to persue singing as a professional career. But in order to get into the conservatory you had to play piano exceptionally well. My starstruck mother signed me up for piano classes, but I had to give up because I was so bad. I can play some easy pieces, but not the ones required for conservatory. As expected, I didn't make the entrance exam for conservatory. After I started college( IR degree) my father’s friend wanted to give me a gift for my 20th so he gave me a 1899 violin from his father. Later on, a classical guitar was given to me by my mom’s cousin. And knowing that, my stepsister, clueless what to give me for Christmas, bought me a uke. Then my niece was getting herself a concert quality flute for conservatory, and as her old one was too used and cheap to get resold, it found a new home with me. I also own a dizi which I bought from ebay, simply because I was curious what it sounds like, and I wanted an instrument that could be adorned. And as every child that went to kindergarden, I played the recorder. I still own the aulos my parents bought me in 2003. As in which instrument I play the most ? I would probably say that it currently is the flute. It is he one I think I can play best and improvise almost immediately after picking it up. ",
            "date": "Updated February 13, 2020",
            "views": "401",
            "upvotes": "0"
        }
    ]
}