{
    "title": "What can I do to help myself when I’m depressed? - Quora",
    "tags": [
        "Mental Health Advice",
        "Coping and Living with Depression",
        "Depression",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharon Stories",
                "href": "/profile/Sharon-Stories"
            },
            "answer_text": "Well, depression can range from time to work on a new playlist or go to a movie in a real theater to that black hole consuming your soul pushing you into an abyss of pain so you can battle the numbness. That last example takes a long time to fix and anti-depressants are a good idea. Depression can take years to corral into a manageable place and reacting to it will most likely make it spiral downward. I take it very seriously. When your soul is crushed by death, abuse, isolation, and trauma you must treat yourself like someone with a giant wound. How long did it take for you to get to this point? Give yourself that must time to heal. Do you have a grounded place in your soul that you can get back to? If the answer is no, you need more than a new playlist you need to invent a new person and heal your inner child. Please read on.Remuneration is tempting because trauma that happens as a child revisits as bad decision-making throughout life. You experience trauma more when you reach adulthood and that inner-child never had a childhood begins screaming. Would you terrify a small child with a daily dose of horror shows, i.e., remuneration? You probably wish for a narrative that says, “That’s not me. That abused child cowering in the corner needs to grow up or get out.” But the actual child did see the horror show, and they won’t make progress until that child is properly cared for. So the first thing you do is quit scaring the child. As necessary as it is to build an adult personal narrative, you have to set that aside and save the child. There is not a person on this planet that can do that other than yourself.You cannot bully a child into growing up. If you can’t get the child to a safe place, get them to a safer place. Watch the sunrise or moonset. If it’s raining read them a story or teach them to meditate. A child has not learned to soothe themselves, or delay gratification, they are totally reactive creatures and dependent on others to show them how. So, if your child is anxious or cranky it’s all about quality time, no shaming, and allowing them a safe place and to cry privately within reason. The keys here are doable steps, gentle progress, and feeling safe and LOVED.Is your child ready to grow socially? That’s the tough one, everyone’s looking at an adult and you have a kid talking to them. Formal settings are best. Something like a church but any group activity will do, they want your money and everyone behaves well enough to get it. Your child will make lots of mistakes and needs to go through rejection in order to grow. This is where your child, a child you love, learns the first stages of forgiveness and hope.Your child needs daily physical care!!!! Care, you may have never received, must be studied and practiced. It’s incredibly easy to confuse personal hygiene and health with an eating disorder in a dysfunctional setting. So if your child needs to lose weight, look for something with a long record of success like weight-watchers and a Fitbit. Teach them to brush their teeth, eat a healthy diet, get regular sleep, and exercise according to standards set by the Nation Institute of Health.There are many forms of substance abuse that give you seconds of reward for years of pain, and they range from heroin to ice cream. Even obsessions, like popping pimples, can become time-consuming behaviors that drive away any potential of love when you need to pop someone else’s pimples. You have to deal with any bad habits with the same compassion you would for a child who wet the bed. Every day - wash the sheets and put on clean ones.Establish long term goals. Sometimes there isn’t a good answer but there is always a better answer. Choose the best one and when you get a chance, choose a better one. Life can change on a dime in a good way, but the most important thing to believe is that your health and happiness can be achieved in small doable steps, the ones a child or elderly person can take.Don’t mess with people. They don’t need to understand, they don’t have an attention span, and they don’t have answers. Good advice comes from a well-worn path of effort coupled to good books or therapy. There’s a load of books for free at the library.The rules change. Back in my day therapists like to tell you to write a letter to your abuser, and they would totally come around once you had fixed yourself. They don’t do that anymore. If people had hurt you, you have not learned to distance yourself from jerks. Jesus told you to be such a doormat! You can only fix this problem by taking responsibility when relationships fail, even if the other guy was a jerk, even if that jerk was someone who biologically should have been better. They weren’t and now you own it. You will find as you heal, its less painful to think about them and nice things surface that you recognize as a contribution to your life, maybe its just raisin bread but, at least it’s something.Wow, shouldn’t there be 10 rules? If someone gave you a ticket to visit this planet where would you go? Life is all about the journey, not the destination.",
            "date": "Answered February 6, 2020",
            "views": "23",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paloma Castro",
                    "user_href": "/profile/Paloma-Castro-2"
                },
                {
                    "user_id": "Mark Weisberg",
                    "user_href": "/profile/Mark-Weisberg-8"
                },
                {
                    "user_id": "Jaclyn Ann",
                    "user_href": "/profile/Jaclyn-Ann-27"
                },
                {
                    "user_id": "Diana Difrenna",
                    "user_href": "/profile/Diana-Difrenna-1"
                },
                {
                    "user_id": "Constance Buckler",
                    "user_href": "/profile/Constance-Buckler-1"
                },
                {
                    "user_id": "Peggy J. Rees Raser-Gross",
                    "user_href": "/profile/Peggy-J-Rees-Raser-Gross"
                },
                {
                    "user_id": "Edward Kenway",
                    "user_href": "/profile/Edward-Kenway-190"
                },
                {
                    "user_id": "Rhy",
                    "user_href": "/profile/Rhy-15"
                },
                {
                    "user_id": "Todd Saunders",
                    "user_href": "/profile/Todd-Saunders-23"
                },
                {
                    "user_id": "FaTiNi SyIdA",
                    "user_href": "/profile/FaTiNi-SyIdA"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Harrington",
                "href": "/profile/Emily-Harrington-27"
            },
            "answer_text": "I have lots of practice dealing with depression, and I hope I can help you with what I’ve learned. When you’re depressed, not much appeals. Nothing sounds fun. Nothing seems worth doing. When that happens to me, I know I’m depressed. Losing interest in things you usually care about is a normal and typical symptom of depression. For many very lucky people, sadness passes in a day or so. For those of us whose sadness lasts weeks and expands into full depression, we need a plan. Deep depression can lead to suicide or suicide attempts. If you’re going to stay alive, you need tools to help you do so. Suicide happens when the pain you experience exceeds your ability to cope with it, so if you’re going to stay alive, your options are to lower the level of pain or increase your coping ability. This explanation is not original to me, so don’t credit me for it. I use it because it’s a clear and simple analysis of a messy state of mind. So. You’re depressed. Time to get to work. Self-care is where you begin. Self-care is easier than all out self-love, which is often not possible when you’re depressed. Taking a shower, brushing your teeth, or eating something is a good place to start. If you’re severely depressed, all three of those things may be impossible. If those things remain impossible for more than two weeks, you need medical intervention. If that’s where you are right now, then the job I assign you for today is to make a doctor’s appointment. That is the only task you need to do today. You can do one thing. You can spend the rest of the day watching TV and crying if you need to, just get that one thing done. It’s the first step to saving your own life. If you are still able to do something like take a shower or feed yourself, you might be able to get through this without medicine. Granted, if you have a mental illness diagnosis, you DEFINITELY need to call your doctor immediately, but if you have a situational depression from something like losing a job, ending a relationship, or grieving a loved one, you might do just fine with some added coping skills. Lower your standards. You are not having a normal time in life, so you cannot have normal expectations of yourself. Make your daily list short. Celebrate small victories, like any act of personal hygiene. Your life right now is monumentally challenging, and recognizing and respecting your current abilities go a long way toward better self-esteem.Make a List. Write down the things you can reasonably get done in a day. For example, today I’m getting sick, and I’m worn out and a little depressed. So the list I made today was weigh self, make pill case, drink coffee, shower, dress, work on website, eat dinner. That’s all that I’m requiring of myself today. On better days, I know I can do more, so I write more down. Cross things off as you go along to show yourself that you’re getting things accomplished, and if the next thing on your list seems too hard, write a time down next to it for half an hour to an hour from now, so that you can take that time to gather your strength, courage, and energy to do the next task. I frequently have to do that with showering, otherwise it won’t get done. Same goes for exercise. You can refer back to your list throughout the day, and if all the tasks are crossed off at the end of the day, please try to be proud of yourself for that.Be sweet to yourself. Use kind language when you talk to yourself. I know this is very challenging. I’ve been meaner to myself than anyone has ever been to me, most often in episodes or during depressions. No matter who you are or what you’re experiencing, you’re a worthwhile person, and who you are is absolutely enough. What you’re feeling now won’t last forever; you will live again. Be as patient with yourself as you would be to someone you love who is hurting. Say kind things. Be nice. You deserve to be treated well, especially by yourself.Write down your feelings. Even if the act of writing makes you cry very, very hard, when you’re finished you will have a deep feeling of calm that could last up to a few hours. Writing is a proven effective therapeutic activity with very clear and real results. You’re not going to want to do it, but it truly will help you.Get sunlight. Go outside, even if you just sit on your front porch for five minutes. Sunlight stimulates chemicals in our bodies and brains that are important to mental health, like lithium and vitamin D. You are also more likely to see something beautiful if you go outside. It’s amazing out there, always.Pick soothing activities. Write down one or two to do today. Pick something like watching TV, coloring, reading, or playing with a fidget toy. Mess around on the internet. Anything easy that’s not challenging and won’t steal your limited and precious energy.Get good sleep. Insomnia and depression often go hand in hand. If this is you, med up. There are lots of over-the-counter sleep aids, and I’ve had good luck with most that I’ve tried. I recommend Unisom, Alteril, and melatonin. Most people would be fine taking just one of these OTC sleep aids, but you can ask your doctor if they can be combined. You might sleep for a long time, which is not a bad thing. Sleep is foundational, and doubly so if you’re mentally ill. Set an alarm for noon and try to stay up until eight in the evening. Take your sleep aid at seven and you’ll probably be asleep in the next hour or two. This schedule allows lots of time to sleep without messing up your circadian rhythm and turning your sleep habits upside down.Hug a pillow while watching TV. I don’t know why this helps me, but it really does.If you’re working through a depression right now and you feel suicidal, call this helpline: 1-800-273-8255. Whatever your current situation, nothing is permanent. It is possible for things to get better. Don’t believe that it can’t ever get better, because that’s not true. It can always get better. ",
            "date": "Answered August 25, 2018",
            "views": "594",
            "upvotes": " View 566 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muhammad Fatkhul Aziz",
                    "user_href": "/profile/Muhammad-Fatkhul-Aziz"
                },
                {
                    "user_id": "Emma Storm",
                    "user_href": "/profile/Emma-Storm-16"
                },
                {
                    "user_id": "Gina Valentino",
                    "user_href": "/profile/Gina-Valentino-2"
                },
                {
                    "user_id": "Christy Potts",
                    "user_href": "/profile/Christy-Potts-5"
                },
                {
                    "user_id": "Barbara Kennedy",
                    "user_href": "/profile/Barbara-Kennedy-72"
                },
                {
                    "user_id": "Patrick Blackstone",
                    "user_href": "/profile/Patrick-Blackstone-1"
                },
                {
                    "user_id": "Ella",
                    "user_href": "/profile/Ella-455"
                },
                {
                    "user_id": "L Kirk",
                    "user_href": "/profile/L-Kirk-3"
                },
                {
                    "user_id": "Anita Das",
                    "user_href": "/profile/Anita-Das-319"
                },
                {
                    "user_id": "Destiney Rodgers",
                    "user_href": "/profile/Destiney-Rodgers-4"
                }
            ]
        }
    ]
}