{
    "title": "What is the difference between alternative metal and nu metal? - Quora",
    "tags": [
        "Alternative Metal",
        "Nu Metal (music)",
        "Heavy Metal (music)",
        "Metals",
        "Materials Science and Engineering",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Raphael",
                "href": "/profile/David-Raphael-16"
            },
            "answer_text": "One could consider nu metal a form of alternative metal, as alternative metal is pretty much defined as a sub genre that uses non-metal characteristics in metal songs. However generally alternative metal is used to describe bands that have more rock influences in them (e.g. Stone Sour, System of a Down, Deftones). Some may have jazz influences in them too (e.g. Animals as Leaders). Nu metal is metal that has rap influences. The genre has pretty much died out now, however some of the most famous nu metal bands were Limp Bizkit, Korn, Linkin Park, and early Slipknot. These bands blended fast rap vocals with heavy metal instrumentals to create a completely new sub genre, however this genre generally tended to lack a few metal characteristics such as guitar solos and sometimes harsh vocals. ",
            "date": "Answered July 27, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "German Dash",
                    "user_href": "/profile/German-Dash"
                },
                {
                    "user_id": "Tirpitz Tirpitz",
                    "user_href": "/profile/Tirpitz-Tirpitz"
                },
                {
                    "user_id": "Tor Santos",
                    "user_href": "/profile/Tor-Santos"
                },
                {
                    "user_id": "Fatma El Zahraa",
                    "user_href": "/profile/Fatma-El-Zahraa-4"
                },
                {
                    "user_id": "Nicolás Humeny",
                    "user_href": "/profile/Nicolás-Humeny"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Pope",
                "href": "/profile/Josh-Pope-9"
            },
            "answer_text": "Nu Metal is a subgenre of Alternative Metal. Nu Metal generally incorporates elements of funk, hip hop, and groove metal to an Alternative Metal base. Nu Metal is a very contentious genre however, and a lot of nu metal bands sound nothing like each other. ",
            "date": "Answered July 4, 2019",
            "views": "164",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garterbelt Priest",
                    "user_href": "/profile/Garterbelt-Priest"
                }
            ]
        }
    ]
}