{
    "title": "What's the best alternative rock song you've heard? - Quora",
    "tags": [
        "Pink Floyd (band)",
        "Alternative Rock",
        "Rock Bands",
        "Best of X",
        "Rock Music",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Avelino",
                "href": "/profile/Patrick-Avelino"
            },
            "answer_text": "So, so many to choose from... So, I'm really lenient when it comes to the Alternative genre.  You see, I grew up in a time when hair-bands & classic rock were the norms for anything other than pop.  Until one day, I found this radio station that played rock that wasn't like the others.  The station was a small independent called KROQ in Pasadena, Ca. Man, that changed my whole world: I digress - My best Alternative song comes from 1979...  1. Yellow Pills - by 20/20 - that one popped my cherry... Older, but I think notable songs are as follows (in no particular order):Chamber of Hellos - by Wire TrainRock This Town - by The StraycatsBlister In The Sun - by the Violent FemmesI Will Follow - by U2Schism - by ToolRooster - by Alice In ChainsRing Of Fire - by Social DistortionShe Sells Sanctuary - by The CultPlush - by the Stone Temple PilotsUnder The Milky Way - by The ChurchThree Strange Days - by the School Of Fish 1979 and Disarmed - by the Smashing PumpkinsBlack & Yellow Ledbetter - by Pearl JamCome As You Are - by NirvanaTake A Picture - by FilterShould I Stay Or Should I Go - by The ClashJane Says - by Jane's AddictionPrimary - by The CureShe - by Green dayWhat's It Like - by EverlastMexican Moon - by Concrete BlondeAnything, Anything - By DramaramaThe Kids Aren't Alright - by The OffspringBizarre Love Triangle - by New OrderBring Me To Life - by Evanescence I Need You Around - by the Smoking Popes I hope these newer songs are going to get as much mileage as the ones above:Lazy Eye - by the Silversun PickupsAin't No rest For The Wicked - by Cage The ElephantRadioactive - by Imagine DragonsEvery Stone - by Manchester OrchestraHurricane - by Ms MrMadness - by MuseWelcome To The Black Parade - by My Chemical RomanceAfraid - by NeighborhoodMisery Business - by Paramore1901 - by Phoenix ",
            "date": "Answered March 13, 2015",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Terry Phillips",
                    "user_href": "/profile/Terry-Phillips-55"
                },
                {
                    "user_id": "Mayra Aguilar",
                    "user_href": "/profile/Mayra-Aguilar-59"
                },
                {
                    "user_id": "Tram Dam",
                    "user_href": "/profile/Tram-Dam"
                },
                {
                    "user_id": "Alisa Skripka",
                    "user_href": "/profile/Alisa-Skripka"
                },
                {
                    "user_id": "Yuval Keshteher",
                    "user_href": "/profile/Yuval-Keshteher"
                },
                {
                    "user_id": "Lisa Kathryn Perry",
                    "user_href": "/profile/Lisa-Kathryn-Perry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "If you are considering really good alternative rock songs, some of the best I can think of include as follows:  Say Hello To Heaven (Temple Of The Dog) Fake Plastic Trees (Radiohead) Paranoid Android (Radiohead) Been Caught Stealing (Jane's Addiction) Heart-Shaped Box (Nirvana) Smells Like Teen Spirit (Nirvana)Lithium (Nirvana) In Bloom (Nirvana) Plush (Stone Temple Pilots) Man In The Box (Alice In Chains) Them Bones (Alice In Chains) Beyond The Wheel (Soundgarden) Black Hole Sun (Soundgarden) Spoonman (Soundgarden) Jesus Christ Pose (Soundgarden) Rusty Cage (Soundgarden) Like Suicide (Soundgarden) Even Flow (Pearl Jam) Alive (Pearl Jam) Black (Pearl Jam) Jeremy (Pearl Jam) Release (Pearl Jam) Spin The Black Circle (Pearl Jam) Yellow Ledbetter (Pearl Jam) Morning Glory (Oasis) Plug In Baby (Muse)Unintended (Muse)Hysteria (Muse) Time Is Running Out (Muse) Supermassive Black Hole (Muse) Knights Of Cydonia (Muse)",
            "date": "Answered August 5, 2015",
            "views": "15",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mana Tangirala",
                    "user_href": "/profile/Mana-Tangirala"
                },
                {
                    "user_id": "Adamović Nada",
                    "user_href": "/profile/Adamović-Nada"
                },
                {
                    "user_id": "Ian West",
                    "user_href": "/profile/Ian-West-18"
                },
                {
                    "user_id": "Alisa Skripka",
                    "user_href": "/profile/Alisa-Skripka"
                },
                {
                    "user_id": "Yaser Zafar",
                    "user_href": "/profile/Yaser-Zafar"
                },
                {
                    "user_id": "Roger Clark",
                    "user_href": "/profile/Roger-Clark-10"
                },
                {
                    "user_id": "Joe Evans",
                    "user_href": "/profile/Joe-Evans-11"
                },
                {
                    "user_id": "Shashank Jha",
                    "user_href": "/profile/Shashank-Jha-3"
                },
                {
                    "user_id": "Mark Mansour",
                    "user_href": "/profile/Mark-Mansour-5"
                },
                {
                    "user_id": "Stella Morris",
                    "user_href": "/profile/Stella-Morris"
                }
            ]
        }
    ]
}