{
    "title": "What are some good songs for someone who wants to feel angry? - Quora",
    "tags": [
        "Music Recommendation Lists",
        "Song Lists",
        "Songs Recommendations",
        "Understanding Anger",
        "Anger Management",
        "Music Recommendations",
        "Songs",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wendy Sheridan",
                "href": "/profile/Wendy-Sheridan-2"
            },
            "answer_text": "Since I’m a woman I can only judge this from a female point of view-I think. Sure I can relate to male rage and have heard lots of it in song…Death Metal! Yikes. This is my favorite song about female anger - lyrics underneath the vid:  You Oughta Know Alanis Morissette I want you to know, that I am happy for youI wish nothing but the best for you bothAn older version of meIs she perverted like me?Would she go down on you in a theater?Does she speak eloquentlyAnd would she have your baby?I'm sure she'd make a really excellent mother 'Cause the love that you gave that we madeWasn't able to make it enough for youTo be open wide, noAnd every time you speak her nameDoes she know how you told meYou'd hold me until you died'Til you died, but you're still alive And I'm here, to remind youOf the mess you left when you went awayIt's not fair, to deny meOf the cross I bear that you gave to meYou, you, you oughta know You seem very well, things look peacefulI'm not quite as well, I thought you should knowDid you forget about me, Mr. Duplicity?I hate to bug you in the middle of dinnerIt was a slap in the faceHow quickly I was replacedAnd are you thinking of me when you fuck her? 'Cause the love that you gave that we madeWasn't able to make it enough for youTo be open wide, noAnd every time you speak her nameDoes she know how you told meYou'd hold me until you died'Til you died, but you're still alive And I'm here, to remind youOf the mess you left when you went awayIt's not fair, to deny meOf the cross I bear that you gave to meYou, you, you oughta know 'Cause the joke that you laid in the bedThat was me and I'm not gonna fadeAs soon as you close your eyes, and you know itAnd every time I scratch my nailsDown someone else's back I hope you feel itWell, can you feel it? [my fave line] And I'm here, to remind youOf the mess you left when you went awayIt's not fair, to deny meOf the cross I bear that you gave to meYou, you, you oughta know Songwriters: Alanis Morissette / Glen Ballard You Oughta Know lyrics © Universal Music Publishing Group, The Bicycle Music Company Thanks for your question Craig. ",
            "date": "Answered April 11, 2019",
            "views": "624",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oliver Jack",
                    "user_href": "/profile/Oliver-Jack-39"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magdalena Lenie Louw",
                "href": "/profile/Magdalena-Lenie-Louw-2"
            },
            "answer_text": "It's a very odd question.People usually want to hear songs,to take their anger away.Why on earth would someone try to get angry?I suspect that you got hurt,or maybe you're disappointed?If any of these contribute to the case,you should rather listen to songs,to help you release the pain and/or anger.After my 2nd husband committed suicide,I was extremely angry at him,for “leaving” me,with our daughter,the pride and joy of his life,of only 2 and a half years old(The other 3 were from my previous marriage,which he adored by the way and in turn they just LOVED him)I “hated”him for what he did to me.There was no explanation,no letter,no reason…I turned to music I heard before,but didn't really LISTEN to.I HATED the songs we enjoyed together.Especialy the songs that played on the night of his death..it was the 10th of April,on his birthday.Then after a few months,I felt the pain and heart-ache.I played “our”songs repeatedly.Don Williams is still a big favorite today.Even my children know most of his songs…Amanda,Lay down beside me,I recall a Gypsy woman.Also Roxette.. you've got the look and Dressed for success,were some of the songs,he liked to sing along with and to me,when we got ready to paint the town red.Chris Izaak,Wicked games and OMD,Sailing the seven seas,Dire Straits with Money for nothing.We loved Groovy kind of love,by Phil Collins.I couldn't stop playing Sinead O'Connor’s;Nothing compare to you and Frank Duval’s;If I could fly,OMD’s;everybody hurt sometimes…over and over again.While I listened to the songs,I cried like there was no tomorrow.Then I got angry!How dare he!He had a good pension fund,that paid out quite a big sum of money,but still,this is his little girl,that loves her daddy SO much,that doesn't understand and the money couldn't buy him back.I knew quite a few artists and songs,as I grew up with it,while my sister and then my brother,was still living at home.I started listening more to Pink Floyd,Bon Jovi,Iron Maiden,ACDC,Van Halen,Black Sabbath,Guns’n Roses…When looking back now,it just seems,that he chose his birthday for a reason.. we got married on the 17th June,it was my birthday,my youngest daughter was born 2 and a half years later and he died 2 and a half years later.. Coincidence?All this aside.Hopefully you can understand,why I find it somewhat awkward,that someone would want to USE music,to BECOME angry.I personally think,that music can sometimes be a big give away,of the mood you're in.The different genres,bring different feelings out,in a different people.I turned to heavy metal and hard rock,to express my anger.This type of music,is more or less the music,someone tend to listen to,when in a daring,non-caring,hurting or ruthless mood.Others could use this same music,as a good and loving memory.Please don't use music to start anger,where there wasn't any.Rather use music,as part of the way you process your feelings.May it be happy,sad,anger,in love,disappointment….Hope you find my answer useful in some way.Best of luck with whatever you're going through.Keep us updated. ",
            "date": "Answered April 11, 2019",
            "views": "409",
            "upvotes": " Answer requested by Kris Craig"
        }
    ]
}