{
    "title": "What is the best way to learn calculus? - Quora",
    "tags": [
        "Learning Calculus",
        "Learning About Mathematics",
        "Calculus Classes",
        "Calculus Education",
        "Mathematics Education",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Satyanarayan Sudhakar",
                "href": "/profile/Satyanarayan-Sudhakar"
            },
            "answer_text": "I always thought I can get a clear idea of Calculus just by listening to lectures. It never worked out. Then, I started reading all theory about Calculus. (Methods to solve it, it’s greatness and about the applications of it.) It didn’t workout either. The one and only way which is also a good way to understand Calculus is by solving more and more and more problems. The more different kind of problems you solve, the better understanding you get. Do not right-away start solving multi-variable partial differential equations if you are a beginner and then blame the subject for being so tough. That’s like trying to jump to the 73rd step directly from the ground. Go slowly my friend. Enjoy the sweetness of Calculus in every single step. Please use technology to help you understand better. Learn from graphs. Try to understand how an equation’s graph would look like. You can use a graphing calculator.[1] The topics of order that I’d prefer to learn in if I were a beginner and would want a good grasp of Calculus: Understanding Rate of ChangeLimitsContinuityDifferentiationMore differentiation (Derivatives)Understanding the concept of Anti-derivatives.Integration as a sum of n steps.More integration (Areas under curves)More integration (Various methods used to solve problems)Understanding a differential equation.Solving ordinary linear differential equations of first order.By then, you’d have developed a very very good understanding of what exactly Calculus is. You can learn whatever you want to in your own order of preference from here onwards. A very good book to start with would be Calculus by Thomas and Finney. [2] P.S.: Please have a good understanding of Trigonometry and Logarithms before you put your foot into Calculus. You’ll be a lot benefited to them when solving problems of Calculus. Have a great day! :) Footnotes[1] Desmos Graphing Calculator[2] Calculus and Analytic Geometry (9th Edition): George B. Thomas, Ross L. Finney: 9780201531749: Amazon.com: Books",
            "date": "Answered July 6, 2017",
            "views": "107",
            "upvotes": " View 65 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Uriel Awerbuch",
                    "user_href": "/profile/Uriel-Awerbuch-1"
                },
                {
                    "user_id": "Bryce Niimi",
                    "user_href": "/profile/Bryce-Niimi"
                },
                {
                    "user_id": "Imcurious Mov",
                    "user_href": "/profile/Imcurious-Mov"
                },
                {
                    "user_id": "Rishabh Sharma",
                    "user_href": "/profile/Rishabh-Sharma-891"
                },
                {
                    "user_id": "Cj Galang",
                    "user_href": "/profile/Cj-Galang-3"
                },
                {
                    "user_id": "Cole Thompson",
                    "user_href": "/profile/Cole-Thompson"
                },
                {
                    "user_id": "Saransh Agarkar",
                    "user_href": "/profile/Saransh-Agarkar"
                },
                {
                    "user_id": "John May",
                    "user_href": "/profile/John-May-146"
                },
                {
                    "user_id": "Rohan Bajpai",
                    "user_href": "/profile/Rohan-Bajpai-27"
                },
                {
                    "user_id": "Omar Hasan",
                    "user_href": "/profile/Omar-Hasan-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Felkins",
                "href": "/profile/Joseph-Felkins-1"
            },
            "answer_text": "Four years ago, I took my first of three math courses under a particular professor who brought me to a paradigm shift in learning mathematics (and ultimately physics). It was a rapid transformation from rote memorization of formulas and using worked examples in the same manner as cookbook recipes, to being able to solve novel problems by using in-depth understanding of core concepts without the need to refer to any sources, even on exams. People learn in different ways; some people are able to learn math purely from lectures, while others, such as me, have to rely more on reading relevant material in advance. Therefore, keep in mind that the methods I give here may not help everyone, but I hope that I can help at least some people learn mathematics effectively. If the study techniques you are already using are allowing you to fully grasp the ideas and solve challenging problems without much help required, then there may be no reason to change your strategy. However, if you are struggling to understand math and perhaps having trouble passing a course, you may need to consider switching methods until you find one that works. The following method that I will describe below is what has helped me master mathematics by reading course textbooks: When reading section (or chapter) in a mathematics textbook, you should read the section three times. Skip to the exercises in the back of the section and write down essential terms that you feel you need to know and whatever questions must be answered in order to solve all of the exercises. Your list probably will not be as lengthy as it sounds, because topics in mathematics often boil down to no more than one or two concepts.Skim over the section, but DO NOT look at the worked solutions. Instead, simply read each question in the examples. Also, jot down the page numbers of any definitions and/or theorems that are relevant to any terms or questions you jotted down previously in Step 1. This is done so that you get an idea of how the section is organized.Read the section again, but this time, do it SLOWLY. Make sure you take the time to understand EVERYTHING being stated in the section. Remember that reading mathematics is typically not the same as reading a Star Trek novel. (The same could be said about trying to read Shakespeare. So for classically trained actors like Patrick Stewart and Ian McKellen…HAHAHAHAHAHAHA!) For each definition or theorem, try to devise a simple example that does not satisfy the prerequisites of a theorem, and therefore serves as a counterexample to the theorem itself. (For example, suppose you come across a theorem saying that “an odd number times another odd number is always an odd number”. A good scenario where the theorem does not apply would be 2*5=10, where one of the two numbers multiplied is even, and therefore the product is also even. Importantly, you should also try to work out every example problem in the section before even looking at the solution. Use the solutions to check to see if you solved the example problem correctly.After you finish reading the section, you work out the exercises, starting by working out the simplest exercise problems, to ensure that you properly understand the building blocks of the material. Once you solve the easiest problems, gradually build your way up to the most challenging problems. Ultimately, if you truly master the material, you should be able to work out a large number of exercises, if not all, without referring to any source material such as a textbook. Another good idea when studying is to create an outline, or perhaps more accurately called a “flow chart”. Doing so will allow you to link together various ideas in the course you are studying into a single coherent picture. This can serve well as a thought process for approaching mathematics problems. Remember, when solving an exercise, identify the structure of the problem, and think of any general mathematical topics you are familiar with that might help you solve the problem in question. Below is a picture of a flow chart for a multivariable calculus course that I took when I was first introduced to this method of study.  If you are taking a mathematics course, try to read all of the material relevant to the upcoming lecture in advance. ",
            "date": "Answered February 23, 2019",
            "views": "82",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AIRES V",
                    "user_href": "/profile/AIRES-V"
                },
                {
                    "user_id": "Alexius Vergara",
                    "user_href": "/profile/Alexius-Vergara"
                },
                {
                    "user_id": "Calisto",
                    "user_href": "/profile/Calisto-7"
                },
                {
                    "user_id": "Walter Becker",
                    "user_href": "/profile/Walter-Becker-3"
                },
                {
                    "user_id": "Maxim Sagibgareev",
                    "user_href": "/profile/Maxim-Sagibgareev-1"
                },
                {
                    "user_id": "Dimas Rodriguez",
                    "user_href": "/profile/Dimas-Rodriguez-3"
                },
                {
                    "user_id": "Molly Dorgan",
                    "user_href": "/profile/Molly-Dorgan-3"
                },
                {
                    "user_id": "Brandon Vue",
                    "user_href": "/profile/Brandon-Vue-1"
                },
                {
                    "user_id": "Chirag Dhaifule",
                    "user_href": "/profile/Chirag-Dhaifule"
                },
                {
                    "user_id": "David Sandell",
                    "user_href": "/profile/David-Sandell-1"
                }
            ]
        }
    ]
}