{
    "title": "What are the best kpop entertainments to audition for? - Quora",
    "tags": [
        "Auditions",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Murraya",
                "href": "/profile/Sara-Murraya"
            },
            "answer_text": "if you want to debut soon, do not audition for JYP. they just released a boy group and are about to release a girl group, so we won’t see any new groups for them until 4–5 years. if you are male and want to debut soon, avoid yg, jyp, fnc, and woollim. if you are male try: SM entertainment- sm is in the big 3, meaning it would be harder to get in. but if you do get in-rest assured- you will be popular. if you are a male, you can have high hopes joining NCT. if you are not korean, keep in mind your pay will not be even with the koreans.PLEDIS entertainment- pledis currently has seventeen and nu’est, so they might not create a boy group at the moment, but they will in a few years to come. its not as hard as other companies to get into pledis, but keep in mind that they are not good at promoting.starship entertainment- starship debuted monsta x a few years ago, so they might wait a few more years to debut anther group-but starship is very well known.if you are female and want to debut soon, avoid jyp, sm, and pledis. they all have recent girl groups debuting/debuted so itll take a while for you to debut. a company with no hopes- do not try bighit. they do not accept female trainees at the moment. if you are female, try: FNC entertainment: this is the company to go for if you are a very skilled vocalists they have some talented female trainees and are suspected to be debuting a girl group soon. just keep in mind their scandals, and if you are good at dance it would probably be wasted here.YG entertainment: after the western popularity of blackpink, i suspect yg will debut another girl group in 2–4 years. a pro is that you will be successful if you join yg. a con- there are rumors yg is a creep and its hard to get into yg.wm entertainment: if you get in, you will probably debut in 3–4 years with chaeyeon of IZONE and her 2 friends that were on produce 48 when chaeyeon finishes her contract with IZONE. you will probably already have a fanbase, and woollim is a kinda known company-it shouldnt be crazy hard to get in. i think they need a rapper at the moment for the girl group-but try anything honestly.A COMPANY TO COMPLETELY AVOID REGARDLESS OF SEX: CUBE ent. this is the cursed of the cursed company. they struggle to promote their boy group pentagon, kicked member out for dating, give their girl group (clc) songs away and dont give them comebacks, kick their money maker queen hyuna out and try to take it back. honestly g-idle are popular because of who they are not because of cube. watch out for this scandal ent. It took me a while to make this list so please appreciate it. I hope you get into whatever company you end up choosing. edit: mixed up WM with Woolim ",
            "date": "Updated December 30, 2018",
            "views": "405",
            "upvotes": " View 278 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Zukowsky",
                    "user_href": "/profile/Leah-Zukowsky"
                },
                {
                    "user_id": "Chuqiao Wang",
                    "user_href": "/profile/Chuqiao-Wang-13"
                },
                {
                    "user_id": "Erica Cuartero",
                    "user_href": "/profile/Erica-Cuartero"
                },
                {
                    "user_id": "M Leeladharan",
                    "user_href": "/profile/M-Leeladharan"
                },
                {
                    "user_id": "Megan Ikahu",
                    "user_href": "/profile/Megan-Ikahu"
                },
                {
                    "user_id": "Suzanie Nkn",
                    "user_href": "/profile/Suzanie-Nkn"
                },
                {
                    "user_id": "Kritika Verma",
                    "user_href": "/profile/Kritika-Verma-230"
                },
                {
                    "user_id": "Srishti Singh",
                    "user_href": "/profile/Srishti-Singh-890"
                },
                {
                    "user_id": "Meithzan Javier",
                    "user_href": "/profile/Meithzan-Javier"
                },
                {
                    "user_id": "Dipti",
                    "user_href": "/profile/Dipti-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erica Won",
                "href": "/profile/Erica-Won-2"
            },
            "answer_text": "By ‘best’ I guess you mean a company that offers the best platform for you to train and debut? I suggest you set your priority first. In my opinion, SM has the most complete training system and the mentors are top notch in this industry. You’d definitely learn a lot at SM. But they tend to have too many trainees that only few of them get to debut. JYP and YG have very specific preferences for selecting trainees. Go watch their artists performing and you’d understand what I mean. I don’t know if you fit into their ‘concept’. If you don’t, you won’t get to debut no matter how good you are. However, both companies are good at making their artists popular. I’m Starship biased but I don’t think it’s big enough to make all their artists successful. It takes tons of money to build a hype machine in Kpop after all. This goes the same with other smaller companies, where they offer bigger chance for you to debut though. If you’re interested in smaller companies, make sure you read past news reports about them to filter out problematic ones. Some mentioned Big Hit. I can’t say much about it since it only has Lee Hyun and BTS members in its talent pool. What works for BTS won’t necessarily happen to their future artists. Nethertheless, SM, JYP and YG have their ‘family’ stan, perhaps Big Hit’s new artists can also benefit from this family love. The only thing I’m sure about Big Hit is they’ve got sufficient money made by BTS to offer better stuff for their trainees. If you want to produce your own art, you’d be welcome in any company. It’s an urban legend that certain companies encourage creative activities while others don’t. NO. All Kpop companies love talents. AND it’s been a trend that the companies recruit more members who can do their own music and choreography. ",
            "date": "Answered May 30, 2018",
            "views": "65",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Megan Ikahu",
                    "user_href": "/profile/Megan-Ikahu"
                },
                {
                    "user_id": "Addison Paige",
                    "user_href": "/profile/Addison-Paige-11"
                },
                {
                    "user_id": "Karina Waritimi",
                    "user_href": "/profile/Karina-Waritimi"
                },
                {
                    "user_id": "Ljaneue Adibac",
                    "user_href": "/profile/Ljaneue-Adibac"
                },
                {
                    "user_id": "Nima Lin",
                    "user_href": "/profile/Nima-Lin"
                },
                {
                    "user_id": "Chung Ae",
                    "user_href": "/profile/Chung-Ae-3"
                },
                {
                    "user_id": "Gryffindor Boy",
                    "user_href": "/profile/Gryffindor-Boy"
                },
                {
                    "user_id": "Caroline Hinks",
                    "user_href": "/profile/Caroline-Hinks-1"
                },
                {
                    "user_id": "NIONIONII",
                    "user_href": "/profile/NIONIONII"
                },
                {
                    "user_id": "Galexia Song",
                    "user_href": "/profile/Galexia-Song"
                }
            ]
        }
    ]
}