{
    "title": "What are some examples of famous musicians joining already famous bands? - Quora",
    "tags": [
        "Bands (music)",
        "Fame and Mass Popularity",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muiris Mac Cartaine",
                "href": "/profile/Muiris-Mac-Cartaine"
            },
            "answer_text": "Thanks for the A2A Drummers are very adaptable and some are quite Bandcestuous Anysley Dunbar, ex John Mayall Group, Frank Zappa and more, drummer leaving Journey to join Jefferson Starship and later Whitesnake Marky Ramone ex Marky Bell of (Richard Hell &) the Voidoids joining the Ramones on Drums after Tommy Ramone left for their 4th album Road to Ruin in 1978 which was their first Top 40 UK album. Drummer John “Jabo” Starks leaving the Bobby “Blue” Bland Band in 1965 and joining the James Brown Band where he drummed alongside Clyde Stubblefield for five years. Along with Stubblefield he is one of the most sampled Drummers on R&B and Hip Hop records. Bassist Bootsy Collins and his brother Catfish Collins of the JBs leaving James Brown to join Parliament/Funkadelic in ’71 followed by saxophonist Maceo Parker and Fred Wesley in ’73. Ry Cooder ex Captain Beefheart “joining” the Rolling Stones as session guitarist on Let it Bleed and Sticky Fingers.  Slide by Ry Cooder Eric Clapton leaving transatlantic #1 Album Act Blind Faith and briefly joining Bonnie and Delaney & Friends c.1970 Bernie Worrell Keyboards, Mini Moog ex Parliament/Funkadelic became a de facto member of Talking Heads in the 1980s and the Tom Tom Club appearing on Stop Making Sense and several tours Gary Moore joining Thin Lizzy & replacing the departed guitarist Brian Robertson for the Black Rose Album - he had played live with Lizzy prior to this in 1977 while Robertson was injured and late 1973/74 when Eric Bell left but left to join Colosseum II. ex Thin Lizzy guitarist Brian Robertson joining Mötorhead in 1983 and leaving after the Another Perfect Day album. Midge Ure (yes!) joining Thin Lizzy on tour for two months in late ’79 and (briefly) replacing Gary Moore. Midge Ure would next join Ultravox for their 4th album Vienna. Trevor Horn & Geoff Downes ex Buggles joining Yes in 1980 Bruce Dickinson ex Samson joining Iron Maiden who had already charted their first two albums Bruce Foxton bassist ex the Jam joining Stiff Little Fingers Terry Chimes, drums ex the Clash & Generation X joining Black Sabbath Martin Simpson’s wonderful Essential Rock Discography referenced to back up much of the above and at times ailing memory ",
            "date": "Updated December 9, 2019",
            "views": "21",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ally Houser",
                    "user_href": "/profile/Ally-Houser-1"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                },
                {
                    "user_id": "Daniel Besser",
                    "user_href": "/profile/Daniel-Besser"
                },
                {
                    "user_id": "Stephen Sparks",
                    "user_href": "/profile/Stephen-Sparks-7"
                },
                {
                    "user_id": "Jerry Back",
                    "user_href": "/profile/Jerry-Back-2"
                },
                {
                    "user_id": "Edward Doran",
                    "user_href": "/profile/Edward-Doran-6"
                },
                {
                    "user_id": "Toby Phillips",
                    "user_href": "/profile/Toby-Phillips-2"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Desmond James",
                    "user_href": "/profile/Desmond-James-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Fernandez",
                "href": "/profile/Nancy-Fernandez-40"
            },
            "answer_text": "My favorite example is The Traveling Wilburys George Harrison of The Beatles started the Wilburys because he was bored,first he got Jeff Lynne from E.L.O then the legendary Roy Orbison then George got his friend Bob Dylan to join and his friend Tom Petty, best all time band that was hand picked but an exact answer to your question is Eddie Vedder joining Pearl Jam hard enough as a barely known guy,he had to take over Chris Cornell's job,as we know Eddie enjoyed great success, still does,and Pearl Jam got bigger,I love them, Chris and Eddie remained friends,Eddie still mourns Chris Cornell's death, hope I answered you! ",
            "date": "Answered May 5, 2019",
            "views": "311",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Leslie Merritt",
                    "user_href": "/profile/Leslie-Merritt-2"
                }
            ]
        }
    ]
}