{
    "title": "What should I buy with a guitar effects pedal? - Quora",
    "tags": [
        "Guitar Pedals",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Taylor",
                "href": "/profile/Jessica-Taylor-722"
            },
            "answer_text": "Besides your regular guitar cable that is used to plug the guitar onto an amp get another one like it (length depends on how far from the amp you need to be) .. the pedal board would be put in the middle, between your guitar and the amp… you should get few patch cables to connect the individual pedals.. unless your effect pedal has all in one and is just a one unit. If your effect pedal uses 9Volt batteries, get few of these - they should last a while unless you forget to remove the cable when not in use - in this case the power will be drained quicker. Best get an appropriate power supply (it should show on the effect pedal what you need - usually 9 Volt one for individual small effect pedals) - it should look a bit like the attached picture  oh.. and if you don’t have an electric guitar or an amp.. you need to buy them too… and a tuner.. ",
            "date": "Answered July 27, 2018",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "If this is your first and only pedal, you will need to buy another instrument cable to connect the pedal output to your amp or DI. You will also have the choice of buying a 9V battery or a power plug/brick for the pedal. Do note that some pedals will only take external power. If this is your next pedal, or you will buy several pedals, you will need to buy the aforementioned power sources (9V battery or a power plug/brick plus a daisy chain or as many power cables as needed), and n-1 patch cables. You may also buy a pedalboard and mounting materials (velcro, zipties, etc.) for convenience. ",
            "date": "Answered July 29, 2018",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Will Simpson",
                "href": "/profile/Will-Simpson-33"
            },
            "answer_text": "Here's what I would buy along with a new FX pedal: Power: Make sure you have a way to power the pedal. Whether this be a daisy chain or dedicated power brick make sure you can power it. Patch Cables: Make sure you have an available patch cable to run this pedal to your amp. ",
            "date": "Answered July 26, 2018",
            "views": "80",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gerald Feltch",
                    "user_href": "/profile/Gerald-Feltch"
                },
                {
                    "user_id": "Edward Sherry",
                    "user_href": "/profile/Edward-Sherry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Sherry",
                "href": "/profile/Edward-Sherry"
            },
            "answer_text": "You need 2 cables, one to send the signal from the guitar to the pedal and the other to send the processed signal back from the pedal to your amp. You may want patch cables to connect one pedal to another. Some (most) pedals consume power, and often significant amounts of power, so you may want a power supply to avoid the cost of continually replacing batteries. ",
            "date": "Answered July 26, 2018",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerald Feltch",
                    "user_href": "/profile/Gerald-Feltch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sal Lucido",
                "href": "/profile/Sal-Lucido"
            },
            "answer_text": "Why do you want the guitar effects pedal’s input? They don’t know anything. ",
            "date": "Answered July 27, 2018",
            "views": "31",
            "upvotes": "0"
        }
    ]
}