{
    "title": "What are some rock bands whose members include both some great musicians and some terrible musicians? - Quora",
    "tags": [
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Stewart",
                "href": "/profile/David-Stewart-8"
            },
            "answer_text": "Any band that featured someone married to a Beatle. Linda wasn't adding anything to Wings at any point, but then she didn't take anything away either. She was just there in the same way that a potplant on the side of the stage would have been there. She made Paul happy and that's the main thing, her lack of musical talent wasn't really relevant. Yoko Ono on the hand didn't add anything to anything musical at any point ever and took a lot away from her efforts with John. Her \"contributions\" to his musical endeavors reduced their value by a huge degree.  75% of The Red Hot Chilli Peppers are very talented. Flea is great on the bass, Chad is a fine drummer and all their guitarists have known what they're doing. It's just a shame that all Keidis brings to the party is long hair and a lack of shirt. His lyrics are terrible his singing is really bad. I imagine the rest of the band kept him because of his personality, not that it shines though in his music. But the winner is probably Bez from Madchester band The Happy Mondays. While the rest of the Mondays were talented musicians who played tight rock and roll with danceable beats, Bez was a \"percussionist\" and dancer. His role in the group was to strut about on the front of the stage for no compelling reason and wave at the audience and perform a series of gesture and motions with no rhythm, athletic ability or grace. Sometimes he'd do it while holding maraccas. It's not many bands who had a member that is so superflous to requirements that he's inaudible on live albums and could spend the entire tour at home in bed without affecting the performance in any way. ",
            "date": "Answered August 15, 2015",
            "views": "67",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Dundore",
                    "user_href": "/profile/Mark-Dundore"
                },
                {
                    "user_id": "Neil Walker",
                    "user_href": "/profile/Neil-Walker-158"
                },
                {
                    "user_id": "David Eugene Wilson",
                    "user_href": "/profile/David-Eugene-Wilson-1"
                },
                {
                    "user_id": "Dan Chernow",
                    "user_href": "/profile/Dan-Chernow"
                },
                {
                    "user_id": "Valerie Carmouze",
                    "user_href": "/profile/Valerie-Carmouze"
                },
                {
                    "user_id": "Richard Enna",
                    "user_href": "/profile/Richard-Enna"
                },
                {
                    "user_id": "Danielle Hall",
                    "user_href": "/profile/Danielle-Hall-21"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Raul Perez",
                    "user_href": "/profile/Raul-Perez-6"
                },
                {
                    "user_id": "Bob Von Der Linn",
                    "user_href": "/profile/Bob-Von-Der-Linn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "The Doors. And I am saying this as a fan of the group. Ray Manzarek, Robbie Krieger, and John Densmore were excellent at their respective instruments, inserting influences that went beyond your average blues rock in general. However, as much as I love and respect Jim Morrison as a performer, he was not the best singer. His diction sounds very slurred, and while having a great stage presence and good ability in narrating his lyrics or storytelling, he often sounds extremely strained and at times flat when singing his high notes. The band's cover of Back Door Man is one example; although I love that song, Jim was out of tune at several parts although he compensated it with a passionate performance. Sure, technique is not everything when it comes to singing and I agree on that, but compared to the musicianship of his members, admittedly he was not the best. With that being said, Jim was perfect for The Doors and deserved to be a legend.  Another band I can think of that has a share of good and bad musicians is Black Sabbath. Collectively, they are a solid band, but as a fan I feel sometimes that there is a lot desired on the vocals. Iommi-Geezer-Ward indeed formed one of the tightest rhythm sections in both rock and metal genres, becoming the first band to be labelled as the latter. Ozzy, however, was their weak link in my opinion; his pretty nasal and monotone (although in pitch) vocals were really a matter of acquired taste, although it fit the music that the band is doing. ",
            "date": "Updated August 23, 2015",
            "views": "9",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ken Honeywell",
                    "user_href": "/profile/Ken-Honeywell"
                },
                {
                    "user_id": "Albert Grande",
                    "user_href": "/profile/Albert-Grande"
                },
                {
                    "user_id": "Bruce Bryan",
                    "user_href": "/profile/Bruce-Bryan-9"
                },
                {
                    "user_id": "Charles Ganske",
                    "user_href": "/profile/Charles-Ganske"
                },
                {
                    "user_id": "James Brangle",
                    "user_href": "/profile/James-Brangle"
                },
                {
                    "user_id": "Hugo Jiménez",
                    "user_href": "/profile/Hugo-Jiménez"
                },
                {
                    "user_id": "Gary Gomes",
                    "user_href": "/profile/Gary-Gomes-9"
                },
                {
                    "user_id": "Raul Perez",
                    "user_href": "/profile/Raul-Perez-6"
                },
                {
                    "user_id": "Chris Austin",
                    "user_href": "/profile/Chris-Austin-83"
                },
                {
                    "user_id": "Enuma Elish",
                    "user_href": "/profile/Enuma-Elish-6"
                }
            ]
        }
    ]
}