{
    "title": "What songs contain names from other songs and bands? - Quora",
    "tags": [
        "Song Meanings",
        "Names and Naming",
        "Bands (music)",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Maples",
                "href": "/profile/Daniel-Maples-1"
            },
            "answer_text": "The first one that comes to my mind is early Better Than Ezra’s Teenager. “Wrap yourself in black Listen to The Cure 'Love-line' won't call back They don't know, they don't care, they don't see, but I do” I heard a live version later that referenced Green Day.  This one is memorable because it shows some frustration towards oblivious fans. Rick Springfield’s name was often mixed up with Bruce Springsteen. Springsteen became famous prior to Springfield and the names were often confused. So Springfield wrote a song about it. He’s written far better lyrics than this but it gets the point across in a humorous way. “She called me Bruce, BruceI can hear her calling Bruce, BruceI can hear her calling Bruce, BruceI can hear herMy name is Rick I'm gonna stick it to ya babe”  Lynyrd Skynyrd’s Sweet Home Alabama references Neil Young for being outspoken about the south’s attitude toward segregation. This song is considered controversial by some and is provided only in the spirit of answering the question. “Well, I heard Mister Young sing about herWell, I heard ol' Neil put her downWell, I hope Neil Young will rememberA Southern man don't need him around anyhow”  Back to BTE; A Lifetime., references R.E.M. “And I know I wasn't right, but it felt so good.And your mother didn't mind, like I thought she would.And that REM song was playing in my mind.And three and a half minutes, felt like a lifetime”  I guess the Weezer reference to the rock pioneer is kind of obvious in Buddy Holly.  Texas singer-songwriter Pat Green references 3 late Texans in Nightmare. Buddy Holly, Stevie Ray Vaughn and Townes Van Zant. If you’re not a fan of today’s cheesy country music, I recommend Pat Green for his humble, fun, down to earth southern songwriting. “So I cried \"Oh Moses, bring a flood from the Red Red SeaBring back Towns Van Zandt and my heroes back to me.'Cause I can play their songs but it ain't the way they do,It ain't the way they do.\" I had a nightmare, a nightmare, it was a nightmare. Now Buddy Holly was ridin' on the wind.Stevie Ray well he was too.And when their star came tumbling to the groundWasn't a thing all the king's horses and all the king's men could do.”  Finally, one of my favs; Hey, Hey, My, My; referencing “The King” and Johnny Rotten (of Sex Pistols fame), tied together by the bonds of rock music.  ",
            "date": "Answered June 25, 2018",
            "views": "992",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Goldfarb",
                    "user_href": "/profile/Amy-Goldfarb-1"
                },
                {
                    "user_id": "Diana Weissend",
                    "user_href": "/profile/Diana-Weissend"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Erickson",
                "href": "/profile/Kelly-Erickson"
            },
            "answer_text": "A few classics:   I Dig Rock and Roll Music, Peter, Paul, and Mary (Mentions The Mamas and the Papas, and members Michelle Phillips and Cass Elliot specifically, Donovan, and The Beatles)   American Pie, Don McLean (Specifically, though obliquely, refers to Buddy Holly/Ritchie Valens/Big Bopper, who died in a plane crash years earlier, and also is understood to refer to, in various lines: The Byrds, The Rolling Stones, Bob Dylan, The Beatles, Mick Jagger, Janis Joplin—it should be pointed out that McLean himself prefers to leave the guessing to the public)   Sweet Home Alabama, Lynyrd Skynyrd (Mentions Neil Young, who had previously released \"Southern Man,\" critiquing what he saw as persistent racism in the U.S. South, and thus ticking off a lot of folks)   Rock and Roll Heaven, Righteous Brothers (Mentions: Jimi Hendrix, Janis Joplin, Otis Redding, Jim Morrison, Jim Croce, Bobby Darin) ",
            "date": "Updated August 4, 2014",
            "views": "774",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rosemary Clarke",
                    "user_href": "/profile/Rosemary-Clarke-2"
                },
                {
                    "user_id": "Martin Fox",
                    "user_href": "/profile/Martin-Fox-3"
                },
                {
                    "user_id": "John Ferguson",
                    "user_href": "/profile/John-Ferguson-60"
                }
            ]
        }
    ]
}