{
    "title": "What song first comes to mind when hearing the word 'place'? - Quora",
    "tags": [
        "The Rolling Stones (band)",
        "Word Associations",
        "The Mind",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Hoyle",
                "href": "/profile/Jeff-Hoyle-1"
            },
            "answer_text": "The Fall - The Steak Place   Head down Head down Head, head, head down. Fool of the Commonwealth drove down there, Down turnpike; Desperate for food desperate for respite. The steak place. The steak place Cheap carpet lines the way Aluminium tack door handles Candelabra lions head Via butchers display too. The steak placeThe steak place Via a carcass rowThings are brought forward and eaten, I see the corners filled with hitmen, Two young lawyers they are whispering, in The steak placeThe steak place I want to stay here, I don't want to go anywhere, I could remain here, Head down Head down Head down Head, head, head downThe steak placeThe steak place I'd stop the automation, I'd sit behind dusty lace, I have a word with hitmen, I give off a beatific face. The steak placeThe steak placeFrom New York City run screaming, Into New England states, Combined a man not should have to do this, A man should not use his fist in The steak place.The steak place. I want to stay here, I don't want to go anywhere, I shall remain here. Songwriters: B.E. Smith / Mark E Smith The Steak Place lyrics © BMG Rights Management US, LLC ",
            "date": "Answered March 7, 2019",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darryl Morhardt",
                    "user_href": "/profile/Darryl-Morhardt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheethal Elsa John",
                "href": "/profile/Sheethal-Elsa-John"
            },
            "answer_text": "There's a place in your heartAnd I know that it is loveAnd this place could be much brighter than tomorrowAnd if you really tryYou'll find there's no need to cryIn this place you will feel there's no hurt or sorrowThere are ways to get thereIf you care enough for the livingMake a little spaceMake a better place Heal the worldMake it a better placeFor you and for meAnd the entire human race. ",
            "date": "Answered March 7, 2019",
            "views": "183",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yazeen Mohammed",
                    "user_href": "/profile/Yazeen-Mohammed"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-2192"
                },
                {
                    "user_id": "Darryl Morhardt",
                    "user_href": "/profile/Darryl-Morhardt"
                },
                {
                    "user_id": "Paola Saav",
                    "user_href": "/profile/Paola-Saav"
                }
            ]
        }
    ]
}