{
    "title": "What are the most hated songs in history? - Quora",
    "tags": [
        "Dislikes",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lennox T. Anderson",
                "href": "/profile/Lennox-T-Anderson"
            },
            "answer_text": "There was an old Rolling Stone article from 2006 that made a list of the 29 most hated songs of all time, however it was updated very recently (you can still see the original and the update) because of terrible music coming out recently. Let’s go with the updated version and I actually pretty much think this list is spot on. #29 The Ketchup Song (Asereje) by Las Ketchup #28 I Like To Move It by Reel 2 Reel #27 Never Gonna Give You Up by Rick Astley #26 Watch Me (Whip Nae Nae) by Silentó #25 Shake It Off by Taylor Swift #24 All About That Bass by Meghan Trainor #23 Gucci Gang by Lil Pump #22 Stupid H** by Nicki Minaj #21 It's Everyday Bro by Jake Paul Ft. Team 10 #20 PPAP (Pen Pineapple Apple Pen) by PIKOTARO #19 Sweatshirt by Jacob Sartorius #18 Achy Breaky Heart by Billy Ray Cyrus #17 MMMBop by Hanson #16 My Humps by The Black Eyes Peas #15 Harlem Shake by Baauer #14 Who Let The Dogs Out by Baha Men #13 That's Not My Name by The Tings Tings #12 Whip My Hair by Willow Smith #11 Despacito by Luis Fonsi ft. Daddy Yankee #10 Macarena by Los Del Rio #9 The Gummybear Song by Gümibar #8 Axel F by Crazy Frog #7 What Does The Fox Say by Ylvis #6 Gangnam Style by PSY #5 #SELFIE by The Chainsmokers #4 Call Me Maybe by Carly Rae Jepsen #3 Let It Go from Frozen by Idina Menzel #2 Friday by Rebecca Black #1 Baby by Justin Bieber ",
            "date": "Answered October 26, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lou Lint",
                "href": "/profile/Lou-Lint"
            },
            "answer_text": "I wouldn't usually use the term 'hate'. A song may not be my sort of thing but hate is such a strong word. One thing that does genuinely niggle me a bit though is when a pop singer who is on a wage of £whatever ridiculous amount of money sings about how money isn't important to them. Here's some that spring to mind: Jessie J - Price TagImani Williams - Don't Need No MoneySia - Cheap ThrillsThese are the main ones. Another tune that gets on my nerves a bit is that Roar song by Katie Perry as it is clearly a clear rip off of the classic Eye of the Tiger by Survivor. 4. Katy Perry - Roar That reminds me, another one that was released recently that pissed on my cornflakes was Steps new release Scared of the Dark as the chorus transition sounds exactly like another classic by Toni Braxton called Unbreak My Heart. I just went to check the name of the Steps one and realised my top voted comment which pointed this out has been deleted so thats just peeved me off a bit as well! Steps are also a prime example of a manufactured group who have absolutely no talent so I'm glad they made it to the list. 5. Steps - Afraid of the Dark Ok I think number 6 has to be Pitbull - One Two Three Four. So many things about this song that annoy me that it deserves its own answer. 6. Pitbull - One Two Three Four The B.O.B tune - Magic really does my tree. When I worked in central London I had to put up with 1xtra for about a year and this is one of the tunes that seemed to be on every 5 minutes. Incidentally that's where I heard most of the songs in this list. Luckily I don't get exposed to as much of this shite any more. Flat earth theory is a joke as well. 7. B.O.B - Magic I’ve never spent so much time trying to hate music! Not gonna lie but I'm struggling a bit here. Ah I know. Kelis- I Hate You So Much Right Now. Simply on the basis of it being so negative. Oh the irony! 8. Kelis - I Hate You So Much Right Now This next one because its just so annoying and a prime example of women giving other women a bad name. I dunno why but it really gets my knickers in a twist. 9. Meredith Brooks - Bitch Ok one more. This is everything that's wrong with the world: 10. Marina and the Diamonds - Primadonna Girl So, so bad. So thats my top ten. Can I just point out before I go that I don't spend my life hating or being annoyed by any type of music, it all has its place. These are simply songs that for whatever reason have stuck in my mind as being songs that ruffled my feathers. I didnt even know half the names and had to Google them. I thought the Kelis and Meredith Brook songs were by Pink! (She had a lucky escape, by the way). Try not to spend so much time focussing on things you hate and focus on things you love. Thoughts are powerful! Peace & Love brothers and sisters, I'm done. ",
            "date": "Answered May 28, 2017",
            "views": "339",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Hookings",
                    "user_href": "/profile/Jordan-Hookings"
                },
                {
                    "user_id": "Kate Haley",
                    "user_href": "/profile/Kate-Haley-4"
                },
                {
                    "user_id": "Laiwang Lakpong Lakte",
                    "user_href": "/profile/Laiwang-Lakpong-Lakte"
                }
            ]
        }
    ]
}