{
    "title": "What are the top 10 British Bands of all time? - Quora",
    "tags": [
        "British Bands",
        "Best of X",
        "Music Recommendations",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vishal Dhole",
                "href": "/profile/Vishal-Dhole-25"
            },
            "answer_text": "1. Queen I don’t normally rank top ten lists in any particular order, however, I have to place Queen in the number one spot here! Queen is one of the British bands that formed in London in 1970, with the classic line-up of Brian May, Roger Taylor, John Deacon and the legendary vocalist Freddie Mercury. Following their 1977 album News of the World, which contained well-known songs “We Will Rock You” and “We Are the Champions,” Queen quickly became one of the biggest stadium rock bands in the world by the early 1980s. Their 1981 Greatest Hits Album is the best-selling album of all time in the UK, with 6 million copies sold here. Their 1985 Live Aid performance is ranked as one of the greatest in rock music history and their hit “Bohemian Rhapsody” which stayed at No.1 in the UK charts for 9 weeks, has been voted the UK’s favourite hit of all time on several occasions. An interesting fact about Queen, is that all its members composed at least one hit single and as such, all four were inducted into the Song-Writer’s Hall of Fame in 2003. Queen’s estimated total record sales are between 150-300 million worldwide, making them one of the world’s best-selling artists of all time! 2. The Beatles The Beatles formed in Liverpool in 1960, with members John Lennon, Paul McCartney, George Harrison and Ringo Starr. Inspired by 1950s rock and roll, The Beatles also experimented with other music styles including pop ballads, psychedelia and hard rock. By 1964, they had become international stars after winning over America and are now widely regarded as one of the most influential British bands in history. Some of their best songs include “Let It Be,” “Yesterday,” “Come Together” and “Hey Jude,” to name just a few. Their Sgt Pepper Lonely Hearts Club Band Album spent 27 weeks at No.1 in the UK, won 4 Grammys, including album of the year in 1968 and has sold more than 32 million copies. The Beatles have had more number-one albums on the British charts and sold more singles in the UK than any other act. Not only that, but they are the best-selling band in history, with estimated record sales of a whopping 800 million albums worldwide! It’s no wonder they have become British cultural icons! 3. Black Sabbath Black Sabbath formed in Birmingham in 1968, made up of Tony Iommi, Geezer Butler, Bill Ward and Ozzy Osbourne as the frontman. This legendary rock band is often cited as being a pioneer of heavy metal music which helped define the genre, despite not being received well by critics initially. Their debut album, released in 1970 with progressive rock label Vertigo Records, reached number 8 in the UK albums chart and by the end of the decade, Black Sabbath had sold more than 8 million albums worldwide. The band had several line-up changes, with Iommi as the only constant member. Notable songs include “Paranoid,” “War Pigs” and “Iron Man,” with Rolling Stone Magazine naming the album Paranoid as the one which “changed music forever.” Black Sabbath were inducted into the Rock and Roll Hall of Fame in 2006, were ranked as the “Greatest Metal Band” of all time by MTV and over the last 40 years, the band has sold over 70 million records worldwide! 4. The Who The Who was formed in 1964 by members Roger Daltrey, Pete Townsend, John Entwhistle and Keith Moon. The Who were part of both the pop art and mod movements and as such, they regularly destroyed guitars and drums on stage. The band also influenced fashion through the use of the Union Jack for clothing. From the early 1970s, the band use synthesizers and integrated them into their rock music, which influenced many bands that followed them. Their first single “I Can’t Explain” reached the UK top ten and was followed by successful singles like “My Generation” and “Happy Jack.” The group’s fourth album, which included the single “Pinball Wizard,” was both a critical and commercial success and The Who became a popular and respected band after live performances at Woodstock and the Isle of Wight Festival. This is one of the British bands is now considered one of the most influential rock bands of the 20 th century, having sold 100 million records worldwide Sponsored Link 5. The Rolling Stones The Rolling Stones formed in London in 1962. The original line-up included Brian Jones, Mick Jagger, Keith Richards, Bill Wyman, Charlie Watts and Ian Stewart. Like The Beatles, The Rolling Stones were part of the British Invasion of Bands that became popular in the US in 1964. Rooted in blues and rock and roll, The Rolling Stones also experimented with psychedelia. Their albums Some Girls, Tattoo You and Exile on Mainstream were their most popular albums and their best songs include “Brown Sugar,” “Shine a Light,” “Can’t Get No Satisfaction” and “Jumpin’ Jack Flash.” By 2007, the band four of the five highest-grossing concert tours of all time and since forming, they have released 30 studio albums. Their estimated record sales are above 250 million, making them one of the best-selling rock bands of all time 6. The Kinks The Kinks are one of the most important and influential British bands of the 1960s. Formed in London in 1964 by brothers Ray and Dave Davies, The Kinks’ music was influenced by a range of genres, including rhythm and blues, British music hall, folk and country. Their third single “You Really Got Me,” became an international hit, topping the UK charts in 1964 and their single “All Day and All of the Night” was another successful hit for the band. The Kinks went on to have 17 Top 20 singles and 5 top 10 albums in the UK and became known for reflecting English culture. The group also received the Ivor Novello Award for “Outstanding Service to British Music” and four of their albums sold over 50 million records worldwide Sponsored Link 7. Pink Floyd Pink Floyd formed in London in 1965, by members Syd Barrett, Nick Mason, Roger Waters and Richard Wright. To this day, Pink Floyd remains one of the most commercially successful and influential groups in music history. Known for their experimentation and elaborate live shows, the band gained popularity performing in the London’s underground music scene in the late 1960s. Their distinctive philosophical lyrics focus on topics like life and death, time and space and empathy. Pink Floyd’s albums The Dark Side of the Moon (1973) and The Wall (1979), became two of the best-selling albums of all time. Some of their best songs include “Comfortably Numb,” “Echoes” and “Another Brick in the Wall,” which is their only No.1 single. By 2013, the band had sold more than 250 million records across the globe and they have also won several Grammys. In addition, Pink Floyd were named the biggest band of all time by Q magazine and inspired legends like David Bowie and Queen. SEE ALSO 8. Led Zeppelin Led Zeppelin formed in London in 1968, consisting of Jimmy Page, Robert Plant, John Paul Jones and John Bonham. They are now considered one of the founders of heavy metal, with a distinctly heavy, guitar-driven sound. Although not an immediate success with critics, Led Zeppelin achieved commercial success between 1969 and 1979. Their fourth album featuring “Stairway to Heaven,” is one of the most popular rock music albums of all time. The band had numerous record-breaking tours which impacted majorly on stadium rock. They remain one of the best-selling British bands in the US, with each of their albums reaching the top 10 and six reaching No.1. They also achieved 8 consecutive No.1’s the UK albums chart, a record only shared with pop sensations ABBA. Over the last 40 years, Led Zeppelin have received numerous awards including a Grammy Lifetime Achievement Award and have had multi-platinum albums, as well as five diamond albums. The band were ranked No.1 on VH1’s 100 Greatest Artists of Hard Rock and their estimated record sales are between 200-300 million! 9. Motorhead Motorhead formed in London in 1975 by bassist, singer and songwriter Ian Kilmister, better known as “Lemmy” and bandmates Larry Wallis and Lucas Fox. The band embraced both punk and metal influences and is known for their loud and fast heavy metal sound, which re-energised the genre in the late 1970s and early 1980s. Though their line-up has changed a number of times, most of their best-selling albums feature “Fast” Eddie Clarke and Phil “Philthy Animal” Taylor. Motorhead have released 23 studio albums, 10 live recordings, 12 compilations and five Eps over a 40-year career. Their most notable songs include “Overkill,” “Hellraiser,” “King of Kings” and “Ace of Spades” which spent 13 weeks in the UK singles chart, peaking at No.14. The band is also well-known in professional wrestling for Triple H’s entrance music “The Game,” however, they remain much underrated in terms of record sales. As of 2016, Motorhead have sold more than 15 million albums globally, despite the popularity of their songs and legendary frontman Lemmy who died in 2015. 10. Oasis Oasis was formed in Manchester in 1991 by brothers Liam and Noel Gallagher and three other band members. The band, which was heavily influenced by The Beatles, became one of the major British bands of the Britpop movement. Their 1995 album (What’s the Story) Morning Glory? became one of the best-selling albums of all time, selling 28 million copies worldwide and is the fifth best-selling album in UK chart history. It is also the most successful album of the 1990s in the UK. Some of their best songs include “Don’t Look Back in Anger,” “Wonderwall,” “Supersonic” and “Cigarettes and Alcohol.” Oasis had 8 UK No.1 hit singles and the same number of No.1 Albums. In 1996, Oasis performed two massive outdoor concerts, with 2.5 million people applying for tickets, which remains the highest-demand for a show in British history. Oasis also won 17 NME Awards, 6 Brit Awards and an award for Outstanding Contribution to Music in 2007. They disbanded in 2009 after the brother’s relationship broke down, but Oasis remain hugely influential in British music and culture. These are my top ten British bands of all time! Have I left a band you love off the list? Comment below with your favourite British rock ban ",
            "date": "Answered June 20, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "My top ten, taking popularity, influence, fame, and, most of all, personal preference into account: The Beatles. Not actually my favourite band, but it would be churlish not to acknowledge that they are the biggest band of all time, from anywhere. 1960s.Led Zeppelin. If it was a list of rock bands, they would come top. 1970s (mainly)Pink Floyd. A slow burner, but so influential. 1960s-present.Queen. Did very well out of Bohemian Rhapsody, and perhaps more popular now than they were in their heyday. 1970s-1980s.Dire Straits. It’s fashionable to mock them now, but they were the big attraction at Live Aid. 1980s mainly.The Police. So much raw energy, so much potential, so much left undone. 1980s mainly.Black Sabbath. Not one of my big listens, but extremely influential. 1970s to presentFlorence and the Machine. Easily my pick out of bands currently producing new material. 2000s to presentRadiohead. Extremely popular choice, if not my choice. 1980s to present.The Who. Their music has come back into focus again. 1960s and 1970s mainly.The Rolling Stones are mainly known for being the Rolling Stones, but don’t get a lot of listening these days. The Sex Pistols are widely (and incorrectly) known for inventing punk, but the Ramones from the USA got there first. Blondie is really a US band that made it in the UK. U2 are UK but not British, and would otherwise belong in the top five. The Clash are mainly known for that one album cover, and London Calling, but would pip the Sex Pistols for punk in my book. The Jam could feature too, as might The Specials. Genesis and Fleetwood Mac would be in there if it was just my personal preference. Fleetwood Mac probably belong there instead of number 7, but they are mainly a Californian band now. Deep Purple are ever green (or ever purple), and could vie for a spot easily, but then the list starts being 1960s-1970s focussed. ELO would then be in for consideration, as would Status Quo. At that point Motörhead would be knocking on the door, as would Cream and the Jimi Hendrix Experience, which was formed in the UK, even if Hendrix was US. Then we have all kinds of bands like Duran Duran, the Smiths, the House Martins, the Beautiful South, Echo and the Bunnymen, New Model Army, the Stranglers, which never quite made it onto my playlists, but are much loved. Britain has been good for bands. ",
            "date": "Answered April 27, 2020",
            "views": "41",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diane Boyle Harder",
                    "user_href": "/profile/Diane-Boyle-Harder"
                },
                {
                    "user_id": "Fia Sols EK18B KRISTINEGYMNASIET",
                    "user_href": "/profile/Fia-Sols-EK18B-KRISTINEGYMNASIET"
                },
                {
                    "user_id": "Russell Esposito",
                    "user_href": "/profile/Russell-Esposito"
                },
                {
                    "user_id": "Craig O'Brien",
                    "user_href": "/profile/Craig-OBrien-7"
                },
                {
                    "user_id": "Uğur Haspolat",
                    "user_href": "/profile/Uğur-Haspolat"
                },
                {
                    "user_id": "Jorge Pereira",
                    "user_href": "/profile/Jorge-Pereira-17"
                },
                {
                    "user_id": "Anders Eriksson",
                    "user_href": "/profile/Anders-Eriksson-9"
                },
                {
                    "user_id": "Antonios Mate 10 Lite",
                    "user_href": "/profile/Antonios-Mate-10-Lite"
                },
                {
                    "user_id": "Janice Caradona",
                    "user_href": "/profile/Janice-Caradona"
                },
                {
                    "user_id": "Mister Merlin",
                    "user_href": "/profile/Mister-Merlin"
                }
            ]
        }
    ]
}