{
    "title": "What is the difference between EP and Albums? - Quora",
    "tags": [
        "Music Albums",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Lee",
                "href": "/profile/Chris-Lee-786"
            },
            "answer_text": " EPS Estimated length that the industry gives is over 30 minutes or 4 tracks, and there have been numerous double EPs released over time. The release has a total of one to three (1-3) tracks, one or more of the tracks is/are 10 minutes or longer and entire release is less than 30 minutes. The release has a total of four to six (4-6) tracks and the entire release is less than 30 minutes.  VS  ALBUMS “Album” when referring to recorded music dates back to a collection of several 78 RPM records that were actually collected together in a book (album). An album is a release with two 2 - 7 or more tracks will be considered an album, basically a LP that is promoted and sold where Neilsen Soundscan can keep track; also count towards a record contract to being completed. Albums are made by artists but controlled by record labels on every level; even the creation process. ",
            "date": "Answered February 15, 2018",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swati Negi",
                    "user_href": "/profile/Swati-Negi-65"
                },
                {
                    "user_id": "Kriz Fizz",
                    "user_href": "/profile/Kriz-Fizz"
                },
                {
                    "user_id": "Def Espurr",
                    "user_href": "/profile/Def-Espurr-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miles Gordon",
                "href": "/profile/Miles-Gordon-3"
            },
            "answer_text": "I worked in a record store in college back when we still sold vinyl LPs, and a lot of this terminology dates back to vinyl record albums. An EP was shorter/had fewer cuts than an LP (album). A typical pop music album had 10 to 12 songs, and an EP might have 6 songs. LP stands for “long playing” which was important when people were considering purchasing 78 RPM records or 33 1/3 RPM records; the 33 1/3 records played longer and so you had to change platters less often. EP stands for “extended play” when compared to a 45 RPM single. To really blow your mind, the term “album” when referring to recorded music dates back to a collection of several 78 RPM records that were actually collected together in a book (album).  ",
            "date": "Answered June 27, 2016",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mithali Dange",
                    "user_href": "/profile/Mithali-Dange"
                }
            ]
        }
    ]
}