{
    "title": "What are the different types of Tamil folk music? - Quora",
    "tags": [
        "Types",
        "Folk Music",
        "Tamil Culture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sruti Sukumar",
                "href": "/profile/Sruti-Sukumar"
            },
            "answer_text": "Villu pattu (Villu Paatu (or 'Bow Song' as translated in English, Villu means Bow) also known as Villadichampattu and Villuppattu is an ancient form of musical story-telling where narration is interspersed with music, art of South Kerala and Kanyakumari district and in Thovalai of Tamil Nadu.Simple tunes and simple verses make the story to be followed easily. The villu, a bow, the age-old weapon of warriors - paradoxically lends itself to be used as a primary musical instrument for the Villu Pattu artists.here are also Udukku (உடுக்கை), Kudam (குடம்), Thala, Kattai(கட்டை), which are used as supplementary instruments in performances. Udukkuis a small drum with a slender middle portion which is held in the left hand and played by the fingers of the right hand. Occasionally, the Villu Pattu team divides itself into two groups, each trying to prove opposite points-of-view of a subject. This is called Lavani Pattu. The songs used by the Villu Pattu artists are mostly traditional folk-songs.They are played during occasions of temple festivals in villages. The songs sung mostly in Villu Paatu praise a god or tell a story. These days the number of artists performing Villu Paatu is tremendously reduced as the income earned from it is never enough for running one's life.  Students performing traditional villu pattu. ",
            "date": "Answered July 24, 2015",
            "views": "36",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sujisuji",
                    "user_href": "/profile/Sujisuji"
                },
                {
                    "user_id": "Mahendra Nayak",
                    "user_href": "/profile/Mahendra-Nayak-6"
                },
                {
                    "user_id": "Deeksha Prakash",
                    "user_href": "/profile/Deeksha-Prakash-2"
                },
                {
                    "user_id": "Nithya Vijayan",
                    "user_href": "/profile/Nithya-Vijayan"
                }
            ]
        }
    ]
}