{
    "title": "What makes more sound, bigger speakers or more speakers? - Quora",
    "tags": [
        "Loudspeakers",
        "Audio",
        "Sound",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikoo Shakiba",
                "href": "/profile/Nikoo-Shakiba"
            },
            "answer_text": "Actually both bigger speakers and more speakers could be relevant but it will not necessarily give you better quality. Better speakers is probably the right answer here. Here are my thoughts, hope to help you: Where more speakers counts:If you want to have best home theater experience, more speakers will usually means better staging of audio in your living room, but it could not be equal to best audio quality reproduction. This would be good for experiencing audio effects of a movie, but if you want to listen to a piece of classic music, may be not (depending on the brand and the overall quality of the speakers)If you want to cover a large hall, it is usually better to distribute speakers than putting one big speaker in front.Where big speakers counts:Where you simply want a louder speaker and sometime better low frequency response, the bigger is better, otherwise the bigger speaker doesn’t mean better audio quality.Where high quality (monitor) speakers counts:If you want the best quality, usually what you need is a pair of good monitor speakers. These speakers are designed to be linear and true to original signal and will reproduce the closest possible audio to the original recorded audio. They are expensive and durable and made for professionals. You may also need to add a sub-woofer to compensate lower frequencies.It is worth to mention that considering the whole chain of the music/audio recording to reproduction chain, the weakest technologies are still on speakers end. For example we are very good on microphone technology and what we could record by microphones, is yet to be reproduce completely with any kind of device including headphones or speakers. Headphones are also far ahead of speakers on this regard. Then if you want to hear the best possible reproduction of a record, go with monitor headphones. It could make a difference if your music player also knows about your hearing capabilities and adopt itself accordingly. Try our stereo EQ on NikooPlayer. Thanks. ",
            "date": "Answered May 1, 2020",
            "views": "691",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Surya Van De Merwe",
                    "user_href": "/profile/Surya-Van-De-Merwe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Klynhans",
                "href": "/profile/Marc-Klynhans"
            },
            "answer_text": "More sound means more pressure. To get more pressure, physics needs to intervene, and this dictates that you need more surface area. By way of example, a 15″ driver needs to move 5.5 mm out to produce 30 Hz at 100 dB (1m), while a 10″ driver needs to move 12.3 mm out to do the same. Two 10″ drivers can also do the same, but each only needs to move 6.1 mm out (10″ driver has a little less than half the surface area of a 15″). This is one reason you see many large speakers at a live gig. There is something else to be said here - normally, sound level will decrease by -6 dB every time you double the distance away from it. A line array speaker (more speakers) will carry the volume further. You will need to read up about this to get the proper terms and values. I can recommend a quick Google search, or http://www.sengpielaudio.com/calculator-distancelaw.htm ",
            "date": "Answered May 4, 2020",
            "views": "137",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Garion Hall",
                    "user_href": "/profile/Garion-Hall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eyþór A. Hallsson",
                "href": "/profile/Eyþór-A-Hallsson"
            },
            "answer_text": "Short answer: If it's the same model speakers than the loudness doesn't usually change that much when going for a fx 15\" speaker instead of 12\". But going for a different, more expensive speaker can increase the loudness a fair bit. Personally I would recommend going for a more expensive speaker instead of many inexpensive speakers. How to find out: If you are looking at speakers from the same brand and model, I would suggest looking at the watts number. fx 200w + 200w = 400w. With this you can easily calculate what combinations of speakers are the most powerful. However if you are looking at speakers from different brands who may calculate their watt numbers differently, I would recommend looking at the db number (db peak) (SPL) instead. If 2 speakers have the same db number, the loudness will increase by 3db. fx 120db + 120db = 123db. But when you have different db numbers you want to add, it gets more complicated so for that I would recommend Google-ing “db calculator” and use that. ",
            "date": "Answered October 14, 2019",
            "views": "572",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bitrus David",
                    "user_href": "/profile/Bitrus-David-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bauers",
                "href": "/profile/Michael-Bauers"
            },
            "answer_text": "I will define “more sound” as higher SPL, and/or more bass. I suggest all of these are factors: Amplifier powerSpeaker sensitivitySpeaker bass extension ( see below)Whether or not you use a powered subwoofer, and the peak SPL of the powered subwooferMore speakers can increase SPL, sure, but remember each one needs to be powered, you don’t get something for nothing. Mostly, more speakers is used either for stereo “presence”, surround sound setups, or in larger installations, for more even sound to a large audience. Speakers size is loosely correlated to bass extension, but there are many variables. For example, the design of the speaker, e.g. bass reflex, driver sizes, and voice coil extension. Also, I suggest using a powered subwoofer, even with typical floorstanding speakers. My advice is based on some 30 years of experience trying different setups at home. ",
            "date": "Answered October 14, 2019",
            "views": "261",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carl Griffiths",
                "href": "/profile/Carl-Griffiths-5"
            },
            "answer_text": "What makes more sound, bigger speakers or more speakers? Neither! You will get MUCH louder sound if you use MORE EFFICIENT speakers. Some speakers have a sensitivity of about 80 dB per Watt, while others can have up to 100 dB/W this is equivalent to using a 10 kW amplifier compared to a 1 Watt amplifier. The down side is that very efficient speakers tend to be rather “Peaky” in their response and tend to have poor bass response, but this is not always the case. ",
            "date": "Answered May 1, 2020",
            "views": "426",
            "upvotes": " Answer requested by Bitrus David",
            "upvoters": [
                {
                    "user_id": "Bitrus David",
                    "user_href": "/profile/Bitrus-David-1"
                },
                {
                    "user_id": "Jacob Laugerud Lindström",
                    "user_href": "/profile/Jacob-Laugerud-Lindström"
                },
                {
                    "user_id": "Moushmi Dey",
                    "user_href": "/profile/Moushmi-Dey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Davis",
                "href": "/profile/Steve-Davis-774"
            },
            "answer_text": "Depends on the speaker efficiency. A pair of Living Voice Air Partner horn speakers will produce far more sound than most can tolerate with only a 2½W amp.  The Air Partner speakers are huge but easily driven.  Tested with an earlier version of this Ongaku One Note amp. At the time the worlds most expensive amplifier, 2½W. Hand made, using hand wound silver wire transformers. ",
            "date": "Answered October 14, 2019",
            "views": "320",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Kuschel",
                "href": "/profile/Richard-Kuschel"
            },
            "answer_text": "That depends. A larger speaker can make more sound than a smaller speaker if it is more efficient, but if you are going for a lot of sound, you need many speakers and amplifiers. Attend any professional rock concert to find what a lot of speakers are capable of. Unfortunately due to Corona virus , there won’t be any big concerts for a while. ",
            "date": "Answered May 1, 2020",
            "views": "181",
            "upvotes": " Answer requested by Bitrus David",
            "upvoters": [
                {
                    "user_id": "Bitrus David",
                    "user_href": "/profile/Bitrus-David-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "Sound amplitude is increased by moving a larger volume of air. So speakers can be generally made louder with larger diameter cones, or longer throw cones, or simply more total speakers, or all the above methods used together in some combination.  ",
            "date": "Answered October 17, 2019",
            "views": "331",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arunav Dash",
                    "user_href": "/profile/Arunav-Dash-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eli Pasternak",
                "href": "/profile/Eli-Pasternak"
            },
            "answer_text": "It can be either. for each speaker you need to find its sound power level (SPL) in watts (not in decibels which are logarithmic). You add all the SPLs of your speakers array and compare it to the SPL of the one big speaker. Either one may win. ",
            "date": "Answered October 14, 2019",
            "views": "342",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jørgen Dal",
                "href": "/profile/Jørgen-Dal-1"
            },
            "answer_text": "We need to specify a few more aspects - as ‘bigger speakers’ mean cone area or boxes - and are the ‘more speakers’ identical to the original one - and are the speakers active or passive - and is the driving power amp unchanged - and how are additional speakers distributed in the room etc.? ",
            "date": "Answered May 1, 2020",
            "views": "37",
            "upvotes": " Answer requested by Bitrus David"
        },
        {
            "author_info": {
                "name": "Steve Noskowicz",
                "href": "/profile/Steve-Noskowicz"
            },
            "answer_text": "A2A: Yes. Q: What makes more sound, bigger speakers or more speakers? ",
            "date": "Answered May 1, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter "
        }
    ]
}