{
    "title": "What's the best site for getting last-minute tickets to concerts or events? - Quora",
    "tags": [
        "Event Tickets",
        "Concerts",
        "Tickets and Ticketing",
        "Entertainment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shiraz Mawani",
                "href": "/profile/Shiraz-Mawani"
            },
            "answer_text": "Unfortunately, there isn’t a singular ‘best’ site for last-minute tickets. Tickets that are listed on resale websites are generally the same inventory being populated across multiple platforms (StubHub, Vivid Seats, SeatGeek, TickPick, etc) due to ticket resale software. A ticket broker will have a ticket broadcasting platform service that will enable them to list the same ticket across multiple sites at the same time. As a result, the same ticket may be seen and available on many websites all at once, so it’s hard to differentiate inventory between one resale marketplace to another. More often, you see differences in available inventory is when tickets are being listed by individuals, or ticket brokers are excluding/not listed on certain ticket resale websites. This is where you may find potential ‘best’ inventory and pricing on certain resale websites over others. Think about it from a consumer standpoint - which resale marketplace makes it the easiest to list tickets/which marketplace do consumers trust the most? Generally speaking, this is StubHub and Vivid Seats (for the US at least). As a result, you may see a lot of inventory being listed on these websites that may not exist on other marketplaces. HOWEVER, this is not always the case. Some sellers may prefer to list their tickets on TickPick or SeatGeek, or other resale platforms. As a result, it’s good practice to start with looking at your favourite ticket resale marketplace as a starting point, but then check out a couple of others to see if there is similar/different inventory available across each of them. When i’m looking for tickets myself, I generally start all my searches by going to the box office website (ie Ticketmaster) and then using that as a comparison to StubHub. After that initial comparison, I will get a general idea of how much tickets cost across different websites, and then I will do a check for inventory across other platforms to see if there is similar/different inventory. Once done that, the important thing is to see if any of the resale websites have any promo codes that you can use to help reduce your price, and that will influence where I end up making my final ticket purchase. Vivid Seats will offer credit if you make a purchase through their app, StubHub and others will run various promos throughout the year, and then just always jumping back over to TickPick to see what the prices are over there since they list ticket as all-in pricing (to show ‘no’ fees). I have also done a YouTube video on how to buy last minute tickets below:  I also like to recommend using any cashback portals if you can when buying tickets to save yourself some additional cash such as Rakuten or others. Anything to save you some money! Be sure to take a look at my profile to learn more about me and subscribe to my YouTube channel where I post weekly videos on everything about tickets and how to buy them! If you have any other questions, please do not hesitate to reach out. ",
            "date": "Updated February 27, 2020",
            "views": "755",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juana Maldonado",
                "href": "/profile/Juana-Maldonado-9"
            },
            "answer_text": "NHL has seen the league's popularity which is already increasing all across the country in a few years. As the popularity already growing for NHL, the ticket sales are up & making hockey tickets really very hard to come by - and that's where eTickets takes place. eTickets is the best place to get Sports, Concert, Theatre tickets and many more… for Canada, USA, and worldwide including Broadway shows! eTickets guarantee delivery & authenticity on our massive inventory of paper & e-Tickets. Be sure to check eTickets for your cheap hockey tickets & more, you can save yourself some cash! Check out on how to save on NHL Hockey Tickets: Always pay attention to the fees when looking to buy the cheapest NHL tickets there is always a large or excessive amount of something of different NHL ticket exchanges to choose from (Official Site of the NHL, StubHub, TicketMaster, etc.). There is one thing in common for all of these ticket sites that they all have service charges, hidden fees. eTickets display all-in prices, so the price you see is the price you pay - there’s nothing to hide. Best time to Get NHL Tickets: Always pay attention to the fees when looking to buy the cheapest NHL tickets there is always a large or excessive amount of something of different NHL ticket exchanges to choose from (Official Site of the NHL, StubHub, TicketMaster, etc.). There is one thing in common for all of these ticket sites that they all have service charges, hidden fees. eTickets display all-in prices, so the price you see is the price you pay - there’s nothing to hide. Discount & Offer for NHL Tickets: NHL hockey tickets discount doesn't really exist. The Hockey teams are already reluctant to sell tickets at the best discount. There are plenty of websites like TicketsNow and the NHL Ticket Exchange, they do offer discounts sometimes, however, it's 10% off their 25% fees. Most of the people do not realize how much the hockey ticket prices change. Let us assume that your looking for NHL playoff tickets and the best price is $250, using the promo code discount which eTickets are offering to match your budget is really great compared to other ticket booking website. Authentic NHL Tickets: You can always check on the Facebook page of eTickets for what the customers have to say about the website. If you have any questions regarding NHL tickets or any of the concert tickets or seating charts, you can reach them at (855)730-0208 or support@etickets.ca. ",
            "date": "Answered November 14, 2018",
            "views": "31",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edwin Taylor",
                    "user_href": "/profile/Edwin-Taylor-15"
                },
                {
                    "user_id": "Daily Ovation",
                    "user_href": "/profile/Daily-Ovation"
                },
                {
                    "user_id": "William Galston",
                    "user_href": "/profile/William-Galston-1"
                },
                {
                    "user_id": "John Louis",
                    "user_href": "/profile/John-Louis-45"
                },
                {
                    "user_id": "Juana Maldonado",
                    "user_href": "/profile/Juana-Maldonado-3"
                }
            ]
        }
    ]
}