{
    "title": "What is the saddest song you have ever listened to? - Quora",
    "tags": [
        "Sad Songs",
        "Music Recommendations",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Johnson",
                "href": "/profile/John-Johnson-2736"
            },
            "answer_text": "Undeniably One by Metallica. The song is based on the 1938 anti-war novel Johnny Got His Gun (a play on words of a typical recruitment slogan “Johnny Get Your Gun”), and the 1971 movie of the same name (which was also directed by the novel’s author). The premise of it is this: A 22-year-old American soldier in WWI gets all of his limbs blown off, in addition to his bottom jaw; his face melted, blinding him and removing his sense of smell; and his eardrums ruptured, defeating him. In the movie/book, this was done by an artillery shell. In the song, it was done by a landmine (presumably because landmine fit into the verse). It was based in WWI, less than two months before the fighting ceased, making the horror of his situation even worse due to the end of the war being so close. Anyways, he is stuck in the most horrific state possible, with his mind perfectly intact, meaning his is fully aware of everything that has happened. Eventually, he figures out a communication method: tapping his head against his pillow in Morse code. He requests to be put in a glass coffin of sorts and shown off as some sort of freak show to show people what war does to the unprivileged who do not get to sit far away from the battlefield. He gets one simple, cold response: “What you ask is against regulations.” Realizing this, he just tells them “kill me” over and over again. But they don’t. They continue his suffering. In the movie, it is explained that he is originally thought to be decerebrated, i.e. completely unaware of anything. However, he made it very clear that this was far from the case with the Morse code. The endings vary slightly, but there is the same result: the release he desires is never granted. A hospital nurse tried to cut off his breathing tube, but was stopped. He is then left to suffer for an unknown amount of time. The music video to the song uses multiple scenes from the movie and perfectly conveys the terrifying reality of what he faces. And it has one of the most badass riffs ever made. ",
            "date": "Answered February 23, 2018",
            "views": "39",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matilda Sladen",
                    "user_href": "/profile/Matilda-Sladen"
                },
                {
                    "user_id": "Myisha Baylor",
                    "user_href": "/profile/Myisha-Baylor"
                },
                {
                    "user_id": "Teresa Reynolds",
                    "user_href": "/profile/Teresa-Reynolds-74"
                },
                {
                    "user_id": "Crystal Boyd",
                    "user_href": "/profile/Crystal-Boyd-43"
                },
                {
                    "user_id": "Kurt King",
                    "user_href": "/profile/Kurt-King-17"
                },
                {
                    "user_id": "Danielle Dinap",
                    "user_href": "/profile/Danielle-Dinap"
                },
                {
                    "user_id": "Andrew Hauptman",
                    "user_href": "/profile/Andrew-Hauptman-1"
                },
                {
                    "user_id": "Ann Shriner",
                    "user_href": "/profile/Ann-Shriner"
                },
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                },
                {
                    "user_id": "Kary Cham",
                    "user_href": "/profile/Kary-Cham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Silvestrin",
                "href": "/profile/Nicholas-Silvestrin"
            },
            "answer_text": "It was a few years ago. I had recently started listening to Metal and Rock music, and I came across this Hardcore band called Rise Against. I enjoyed them a lot: really nice guitar and drums, powerful vocals, epic lyrics. I still do enjoy them a lot, they are one of my favourite bands. Around that time I started using spotify: before then I just listened to sparse mp3s, and I didn't really look up albums, just singles. Since the first song I heard of theirs was Injection, I listened to the whole “The sufferer and the witness” album. And I loved it. But it turned out that their most famous song was “Savior\", from Appeal to Reason. Another really good song. 16 y/o me is thinking “Wow, another really cool album. What should I listen to next?”. A little song catches my eye. Awesome name, I'm expecting something along the lines of Prayer of the refugee. Oh boy was I wrong. Enter “Hero of War\" Rise Against - Hero Of War This is one of the very few songs so far that made me burst up in tears. It tells a story about a man who becomes a soldier and goes to war. It starts out pretty well Black leather bootsSpit-shined so brightThey cut off my hairBut it looks alrightWe marched and we sangWe all became friendsAs we learned how to fight Then the chorus comes, basically an anthem of patriotism: A hero of warYeah, that's what I'll beAnd when I come homeThey'll be damn proud of meI'll carry this flagTo the grave if I mustCause it's a flag that I loveAnd a flag that I trust And all of a sudden, in the span of a few seconds the song takes an extremely dark turn. The protagonist, following the orders he's given, takes a man away “from his family and his friends\". This man then gets humiliated and beaten up by the soldiers, which later the protagonist joins. The chorus comes again, but this time you can feel some sort of… uneasiness. Like he's not really believing what he's saying. Then the last verse comes. She walkedThrough bullets and hazeI asked her to stopI begged her to stayBut she pressed onSo I lifted my gunAnd I fired awayAnd the shells jumped trough the smokeAnd into the sandThat the blood now had soakedShe collapsed with a flag in her handA flag white as snow A flag white as snow. The way he says it, it's so dramatic, so powerful, that no matter how many times I listen to it I always get teary. One last chorus, but this time it's modified: the protagonist realizes that he's not a hero, and that war is meaningless. As meaningless as all the medals he got. One thing remains though, and it's his trust of a flag. A flag white as snow. A hero of warIs that what they see?Just medals and scarsSo damn proud of meAnd I brought home that flagNow it gathers dustBut it's a flag that I loveIt's the only flag I trust Then the song ends on the starting verse, closing full circle. He said \"SonHave you seen the world?Well what would you sayIf I said that you could?\" ",
            "date": "Answered December 31, 2017",
            "views": "133",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Areskog",
                    "user_href": "/profile/Alan-Areskog"
                },
                {
                    "user_id": "Anton Foley",
                    "user_href": "/profile/Anton-Foley"
                },
                {
                    "user_id": "Brandie Nichole",
                    "user_href": "/profile/Brandie-Nichole"
                },
                {
                    "user_id": "Andrew Hauptman",
                    "user_href": "/profile/Andrew-Hauptman-1"
                },
                {
                    "user_id": "Ann Shriner",
                    "user_href": "/profile/Ann-Shriner"
                },
                {
                    "user_id": "Max Cover",
                    "user_href": "/profile/Max-Cover"
                },
                {
                    "user_id": "Don Hawkins",
                    "user_href": "/profile/Don-Hawkins-12"
                },
                {
                    "user_id": "Candy Carter",
                    "user_href": "/profile/Candy-Carter-9"
                },
                {
                    "user_id": "Virginia Littleton",
                    "user_href": "/profile/Virginia-Littleton"
                },
                {
                    "user_id": "Anastasiya Lyashenko",
                    "user_href": "/profile/Anastasiya-Lyashenko"
                }
            ]
        }
    ]
}