{
    "title": "What are the best YouTube channels about music? - Quora",
    "tags": [
        "YouTube Music (website)",
        "YouTube Channels Recommendations",
        "Music Videos",
        "YouTube Channels",
        "Videos",
        "YouTube Videos",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "YanHan Lee",
                "href": "/profile/YanHan-Lee-1"
            },
            "answer_text": "There are so many channels out there that I follow that I will now have to look in the long list and try to remember them.  Major ones NoCopyrightSounds - Probably have heard of this one before. Provides music for almost all genres and from multiple artists whom you can look for. Proximity - Also amazing. I have found many new songs from this one too. Also quite well-known. MrSuicideSheep - One of my favourites! Also a channel which has great backgrounds for the music. The Nation - A list of channels for a few genres. (Chill, Trap, House, Rap, Bass and one more called F*CK GENRES) MonsterCat - Good one, though it probably won’t be a channel which you would listen to if you wanted to lie down and enjoy music or to do work. SubSoul - Has quite some interesting uploads. A good one if you are interested in individual remixes as well as House music.  Personal Favourites Frequency Music - Quite unknown and does not upload as regularly as the others, but I still manage to get some quality ones from this. Arctic Empire - Has a variety of EDMs. The backgrounds are also beautiful as well. AirwaveMusicTV - Cool backgrounds, focuses more on vocal music. xKito Music - Posts amazing music from unknown genres and artists. If you do not mind anime backgrounds (I like it ‘cos it gives me more anime to watch) then you will probably enjoy this one a lot. Diversity - Quite similar to xKito. Also has compilations as well.  Independent Channels DJRavine - Great DJ who posts mixes and random DJ-related stuff. Music Life - A group of DJs who post one hour mixes for specific genres regularly. Quite interesting if you wanted to listen to one single genre for an entire day. NightcoreReality - Creates and finds nightcore to share. Really an amazing channel if you don’t mind anime backgrounds (like all nightcores) and also appreciate them. I always recommend listening to nightcore at least once. Many either love it or hate it though. SoNevable - Plays on the Launchpad. He does not have that many uploads but the few that he has are great and alright to listen multiple times to. He is also considered one of the best artists on the Launchpad. (While you are at it, look for his mashup on MrSuicideSheep’s channel.) R!OT - Launchpad performances and other remixes. Quite interesting in my opinion. M4S0N1C - Great DJ. Also uses the Launchpad sometimes. The Living Tombstone - Makes quite random remixes of music which you least expect. Quite famous for its FNAF creations. Yellow Brick Cinema - Apparently a research team which posts music on the more relaxing end. Expect to find music suitable for meditation, sleeping and/or studying here.  I’m not gonna post individual artists here. There are too many for me to find. If you just follow the major distributing channels, you would probably end up knowing some of the major ones though, so you should be fine for that. ",
            "date": "Answered July 8, 2016",
            "views": "204",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fuad Jada",
                    "user_href": "/profile/Fuad-Jada-1"
                },
                {
                    "user_id": "Shashi Shekhar",
                    "user_href": "/profile/Shashi-Shekhar-753"
                },
                {
                    "user_id": "Vaibhav Vishal",
                    "user_href": "/profile/Vaibhav-Vishal-43"
                },
                {
                    "user_id": "Subhasish Mohapatra",
                    "user_href": "/profile/Subhasish-Mohapatra-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Trigonella"
                },
                {
                    "user_id": "Jyan Valjean",
                    "user_href": "/profile/Jyan-Valjean"
                },
                {
                    "user_id": "Mahmudul Hasan",
                    "user_href": "/profile/Mahmudul-Hasan-24"
                },
                {
                    "user_id": "Fajar M Subhi",
                    "user_href": "/profile/Fajar-M-Subhi"
                },
                {
                    "user_id": "Arvind Danushkodi",
                    "user_href": "/profile/Arvind-Danushkodi"
                },
                {
                    "user_id": "Arpit Kaushal",
                    "user_href": "/profile/Arpit-Kaushal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jismon Joseph",
                "href": "/profile/Jismon-Joseph"
            },
            "answer_text": "Non Copyrighted Music MrSuicideSheep - Ambient/Deep house, Drum & bass, Electro, Melodic dubstep, Progressive houseNoCopyrightSounds - Progressive house, Melodic dubstep, Drum & bass, TrapFluidified - Ambient/Chillout, Drum & bass, Trap, Progressive houseBlackmillMusic - Melodic DubstepAirwaveMusicTV - Dubstep, HouseElectroPosé - Deep house, Tropical houseLa Belle Musique - Deep house, Tropical houseCloudCity - Indie pop, Electro house, Trapdynmk - Indie pop, Electro house, TrapTrap Nation - Trap MusicTrap City - Trap MusicAllTrapMusic - Trap MusicThePianoGuys - Piano and Cello renditions of popular songsMajestic Casual - Deep house, ExperimentalMellow Uploads - Ambient/Chillout, Deep houseMonstercat - Drum & bass, DubstepMrDeepSense - Deep HouseSelected. - Deep houseLiquicity - Drum & bassi'm cyborg but that's okProgressive AstronautMelancholyThe Vibe GuideProximityTheSoundYouNeedKoala KontrolMahesh Raghvan - Indian Classical FusionRecord Labels Fueled By RamenAnjunadeepSpinnin' RecordsArmada MusicRevealed RecordingsMonstercatDIM MAKBig Beat RecordsUltra MusicMad DecentAxtonemau5trapIndependent Artists IlleniumPrateek KuhadXan GriffinPetit BiscuitSan HoloEdenOdeszaVexentoTobuMarshmelloTheFatRatMatomaPatrickreza",
            "date": "Updated March 25, 2019",
            "views": "244",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shrey R",
                    "user_href": "/profile/Shrey-R"
                },
                {
                    "user_id": "Tanmay Moghe (तन्मय मोघे)",
                    "user_href": "/profile/Tanmay-Moghe-तन्मय-मोघे"
                },
                {
                    "user_id": "Music Speaks",
                    "user_href": "/profile/Music-Speaks-6"
                },
                {
                    "user_id": "Shashi Shekhar",
                    "user_href": "/profile/Shashi-Shekhar-753"
                },
                {
                    "user_id": "HVH Music",
                    "user_href": "/profile/HVH-Music"
                },
                {
                    "user_id": "Sharath Kumar",
                    "user_href": "/profile/Sharath-Kumar-3"
                },
                {
                    "user_id": "Sebastian Varghese",
                    "user_href": "/profile/Sebastian-Varghese-2"
                },
                {
                    "user_id": "Luretuy",
                    "user_href": "/profile/Luretuy"
                },
                {
                    "user_id": "Petrișor Gurbină",
                    "user_href": "/profile/Petrișor-Gurbină"
                },
                {
                    "user_id": "Subhasish Mohapatra",
                    "user_href": "/profile/Subhasish-Mohapatra-2"
                }
            ]
        }
    ]
}