{
    "title": "What are some tips for getting the most out of a session at a pro recording studio for a musician who has never recorded in that environment before? - Quora",
    "tags": [
        "Music Recording"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Bowyer",
                "href": "/profile/Mark-Bowyer-2"
            },
            "answer_text": "There are some good answers here. And a couple of bad bits of advice, but hopefully the logistical impossibilities of these will be obvious to you. I would just add. Make sure you are well rehearsed. Set tempos for your songs and practice playing to a click, even if that means pushing it through the PA. Do that for a bit, and try playing with just the drummer hearing the click. It will feel much better when everyone is locked in together. Make sure everyone knows their parts. If you play rhythm guitar make sure you play the same thing each time rather than some generic “strumming”. That way everyone knows what they should be hearing at all times and you will become far tighter than if you just “jam” through every song. Make sure all your kit is absolutely spanking. New strings, yes, even new bass strings. Don’t just boil your old ones, buy some new ones, cheap ass! New drums heads, make sure your guitars are set up properly. If you try and record 10 songs in one day don’t be disappointed if your recordings don’t sound like an ultra expensive album. Aim to do 1 song a day if you can afford it. 2–3 over a weekend is ideal for EP, releasable quality. Think about whether you are capable and want to play all together. Can the studio accommodate this? Or if you want to just record drums and some scratch guitars that you will work on the sounds of afterwards. Its a far more time consuming way to record but can be really effective. Budget accordingly. Before you get to the session, have a chat to the engineer and let them know what you will be hoping to achieve and what you are expecting. Let him/her know if you have some influences that would be worth checking out prior to the session. That can really help if the engineer isn’t intimately familiar with the genre you play. Have a little think about some overdubs, Maybe try some demo recordings and think about extra layers you might like to try. An extra guitar part, a bit of percussion, some backing vocals. Well thought out overdubs can turn a great song into a great record. But don’t go crazy and remember this will take time! Let the engineer do their thing, don’t argue with him/her because you read differently on the internet. Ask questions of course, but don’t try and teach your grandmother to suck eggs. Don’t make narky comments if he/she is moving a mic for the 4th time, they are doing it for your benefit. And most importantly have fun. Recording music can be a blast! If you follow these simple rules you will have a fun and productive session and this will be apparent in the results. Don’t have too much fun though. Don’t get wasted! Or at least wait until you have finished playing. So, go enjoy yourself, good luck, and have a great session. ",
            "date": "Answered February 5, 2017",
            "views": "216",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parteek Bansal",
                    "user_href": "/profile/Parteek-Bansal-3"
                },
                {
                    "user_id": "Colby Cruz",
                    "user_href": "/profile/Colby-Cruz-1"
                },
                {
                    "user_id": "Bart Reardon",
                    "user_href": "/profile/Bart-Reardon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Welwood",
                "href": "/profile/Jason-Welwood-1"
            },
            "answer_text": "I can give you a few pointers. I am an audio engineer of over 4 years and musician of over 13. I've experienced this particular situation from both sides of the fence. Make sure they're not taking advantage of you. When I say this I mean make sure that setup is done before you arrive. The only things you should be doing as the paying client is tuning your instruments, performing and setting your amp tone (if you're a guitar player and you'd prefer to do that yourself as opposed to having the engineer do it). I've seen engineers who will spend a half hour or more setting up mic stands, getting cables out of storage, thinking about which mics to use, setting up the session file in their DAW software all while the client is sitting right there waiting AND paying by the hour! Of course, there will always be some degree of setup to do before you hit record (adjusting compression settings, EQ, quickly readjusting a mic into a new position), but I'd say at least 80% of that should be done before you arrive. If it's not, take your money elsewhere. Recording ain't cheap.Speaking of money, just because they quoted you at a certain price doesnt mean you can't strike up a deal. Recording is a very tricky business, especially now that the average Joe can throw up some mics and do it at home. There are likely other studios that would gladly accept your hard earned cash, possibly for less than what you're paying now. Of course, experience matters, so do your research on studios in your area, but use what you find to your advantage when striking up a deal. You are allowed to barter in this type of transaction, you're not standing in line at the Wal Mart.Practice and come prepared. It's almost a no-brainer, but I have seen musicians come to sessions before who hadn't even practiced the material they were paying me to record. This resulted in too many takes, a nightmare of a punch-in/punch-out recording session and a lot of wasted time (and money). Also bring lots of everything. Picks, strings, batteries, notepad, pens. Anything that you might need at a moment's notice is good to have.Get a good nights rest, lay off the sauce and don't be late. As stated, your likely paying a lot to be there, so make it worth the expense. You want your recordings to sound their best and all it takes is a small dip in willpower to turn you from guitar solo shreddin' behind your head guy to can't remember how the G chord goes at the campfire guy. Sleep! Get extra the night before if you can and when you wake up get in the mindset that you're going to have an awesome session. Tell yourself that and plan to do nothing else that day. It's all about the music. Leave early (you never know when you're going to hit construction of a traffic jam), arrive safe and stay sober the entire time. Mind blowing, I know, but trust me, musicianship is not measured by the Budweiser. If you want to get tanked after you've recorded your next gold record, by all means go ahead, but please don't do it in studio. Your music and the engineer recording it on your behalf will thank you for it.Please trust your engineer. You hand picked him for the job, so take solace in knowing you made the right choice. You'll never hear it from an engineer directly, but we actually don't like it all that much when you stand behind the console and give us suggestions on what to do next. I know, crazy right? It's kind of like having your boss hover over you while you're trying to fill out an employee survey on the performance of upper management. Take no offence, we definitely understand how important your music is to you. We want your project to sound just as good as you do and not only because you’re paying us, but because if you allow us to create something that truly stands out, your project will be the next big thing added to OUR resume as well. We're in this together so please, if the engineer tells you he needs a few minutes to edit something or try out a rough mix, don't feel bad stepping out an getting some fresh air or even just sitting quietly while he works his magic. The clients who allow us to do our job are our favourite clients, hands down.For bonus points. If you want to get on an engineer's good side, offer to get him a coffee or a bite to eat when you're going out to grab lunch, especially during a long session. Sure, it is an extra expense and yes, you are the one paying this guy, but you wouldn't believe how much we appreciate you asking. Recording, while a lot of fun, is also a lot of hard work. Sometimes it's downright frustrating, but we're trained to keep our cool and find a solution to the most obscure problems without alerting you to the fact that we're on the tipping point of heaving the mixing console through the window and renouncing our status as an audio engineer for good… So yes, coffee would be fantastic.Best of luck in your session. Remember to have fun, take short breaks every now and then to stay fresh and enjoy the experience. There certainly is something special about being in a professional studio environment. You're going to be walking away with memories you'll never forget. ",
            "date": "Answered February 4, 2017",
            "views": "223",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raquel Fisher",
                    "user_href": "/profile/Raquel-Fisher-5"
                },
                {
                    "user_id": "Coylynne Daems",
                    "user_href": "/profile/Coylynne-Daems-1"
                }
            ]
        }
    ]
}