{
    "title": "What is to hymn? - Quora",
    "tags": [
        "Hymns",
        "What Is Meant By X",
        "National Anthems",
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Curtis Lindsay",
                "href": "/profile/Curtis-Lindsay-1"
            },
            "answer_text": "A hymn is a song of “praise,” of a religious nature. The term comes from Greek ὕμνος, and the Greeks were the first practitioners of hymnody in the Western tradition, though the Egyptians, Babylonians, and ancient peoples of India also wrote and ritually performed songs of this nature. In post-Reformation Protestantism, the hymn has taken on much of the character and material of popular music or vernacular folk song. “Hymn” can refer either to the text, to the musical tune to which the text is set, or to both at once. The texts are typically structured by a simple, rhyming poetic meter and have multiple verses, each of which fits the same tune. They are often sung congregationally, by the whole church body, as part of a worship service. A hymnal is a collection of hymns, usually in book form. ",
            "date": "Answered September 8, 2016",
            "views": "658",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wouter van Burik",
                    "user_href": "/profile/Wouter-van-Burik"
                },
                {
                    "user_id": "Vanlal Nghaka",
                    "user_href": "/profile/Vanlal-Nghaka"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellen Micheletti",
                "href": "/profile/Ellen-Micheletti"
            },
            "answer_text": "It’s a song with a religious content. One of the main writers of hymns in English was Isaac Watts who wrote Joy to the Word, All Hail the Power of Jesus Name, I Sing the Mighty Power of God and many other. Another great English hymn writer is Charles Wesley who wrote Hark the Herald Angels Sing, Love Divine, All Loves Excelling, Christ the Lord is Risen Today and many more. One of the best known hymns is Amazing Grace written by John Newton. He had been a slaver and had repented of his participation and this hymn was the result. ",
            "date": "Answered September 8, 2016",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Janice Gates",
                "href": "/profile/Janice-Gates"
            },
            "answer_text": "A hymn is a type of song, usually religious, specifically written for the purpose of adoration or prayer, and typically addressed to a deity or deities, or to a prominent figure or personification. The word hymn derives from Greek ὕμνος (hymnos), which means \"a song of praise\". ",
            "date": "Answered October 16, 2016",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Krishna Kumar",
                "href": "/profile/Krishna-Kumar-976"
            },
            "answer_text": "Hyman means the act of praising something using a song/poem  or piece of song/poem .It is mostly used for God for his good grace ",
            "date": "Answered June 27, 2015",
            "views": "55",
            "upvotes": "0"
        }
    ]
}