{
    "title": "What are the best jazz mouthpieces for tenor saxophone? - Quora",
    "tags": [
        "Saxophone Players",
        "Saxophones",
        "Jazz Music",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clayton Duncan",
                "href": "/profile/Clayton-Duncan-2"
            },
            "answer_text": "Otto Links and designs based off of them are generally the most common for the 50s/60s dark to medium/slightly bright jazz sound. The only issue I have recommending them is that they’re mass produced and a lot come with flaws. Somebody mentioned Bob Reynolds who does play a stock Link and I have friends who play stock Meyers on alto (both Links and Meyers are made by JJ Babbit) but it’s a little chancy unless you’re playing a handful of them and picking the best one. For that reason, I like to recommend the Vandoren V16 mouthpieces (hard rubber). They are machine made but they’re hand finished so IMO, the consistency and quality is better. If you’re ordering it somewhere without playing it first, you’re more guaranteed to get good mouthpiece. And it’s very reasonably priced at $120. For an example of somebody playing one here’s a clip of Victor Goines from the Jazz at Lincoln Center Orchestra.  Another option would be the Jody Jazz HR*, which is modeled on a Link. Like the Vandoren, it’s hand finished and quality control is high, but it’s $200 and I don’t think it’s necessarily better than the V16. It’s just a matter of taste. ",
            "date": "Answered December 18, 2016",
            "views": "48",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Travis Tingle",
                    "user_href": "/profile/Travis-Tingle-1"
                },
                {
                    "user_id": "Brandon Berke",
                    "user_href": "/profile/Brandon-Berke"
                },
                {
                    "user_id": "Dan Borden",
                    "user_href": "/profile/Dan-Borden-2"
                },
                {
                    "user_id": "Jake Lira",
                    "user_href": "/profile/Jake-Lira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hal Cooper",
                "href": "/profile/Hal-Cooper-2"
            },
            "answer_text": "If the mouthpiece you own does not measure up correctly it is NOT any good. These YouTube sax teachers are hardly qualified to be telling anyone anything and much of what they say is dead wrong. We have exact facings, chambers and techniques. The Otto Link is good for some people; but, bad for other people. When it’s not right, you kind of know. I would never play one; but, that is me. Lots of people I know play it an like it a lot. People are liking the Jody Jazz. Some people play an S80 D. The S80 comes off the line with a real facing and a flat table. Most other mouthpieces are messed up. Vandoren have OK facings. The big question is how bright do you want to sound? Or, how dark do you want to sound. Always make sure low end responds how you need it to. Don’t think you will be able to “get it working.” This Chinese person is doing great work. The person can also do a Jody Jazz. These are hand facings. Chinese have figured out how to be good at it. Excellence Tenor sax mouthpiece Ebony wood | eBay Hard Rubber Tenor sax mouthpiece good sound Excellent 1 pc | eBay ",
            "date": "Updated April 16, 2018",
            "views": "2",
            "upvotes": "0"
        }
    ]
}