{
    "title": "What do you think the song 'Car Radio' by Twenty One Pilots is about? - Quora",
    "tags": [
        "Twenty One Pilots (band)",
        "Song Meanings",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Braeden Frantz",
                "href": "/profile/Braeden-Frantz"
            },
            "answer_text": "The answer to this question is actually a lot simpler than one might think. Tyler Joseph wrote the song about the theft of his Car Radio and the aftermath. He is an emotional person, and was struggling a lot mentally at the time. Without music to drown out his thoughts, the silence forced him to face the things that scared him. He has stated, however that it helped him in the end, and he thinks everyone should take time to sit in silence and think once in a while. Source: There is a Commentary on Twenty Øne Piløts’ album Vessel on Spotify. In it Tyler Joseph shares a lot of cool information about his songs, including Car Radio. I highly recommend you give it a listen. ",
            "date": "Answered September 5, 2018",
            "views": "11",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aarushi Sharma",
                    "user_href": "/profile/Aarushi-Sharma-132"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/BigSam-1"
                },
                {
                    "user_id": "Nicole Van Randenburgh",
                    "user_href": "/profile/Nicole-Van-Randenburgh"
                },
                {
                    "user_id": "Folina Sahlo",
                    "user_href": "/profile/Folina-Sahlo"
                },
                {
                    "user_id": "Taylor McCarty",
                    "user_href": "/profile/Taylor-McCarty-13"
                },
                {
                    "user_id": "Rebecca Rodda",
                    "user_href": "/profile/Rebecca-Rodda"
                },
                {
                    "user_id": "Nic Jester",
                    "user_href": "/profile/Nic-Jester"
                },
                {
                    "user_id": "Hector Marmolejos",
                    "user_href": "/profile/Hector-Marmolejos"
                },
                {
                    "user_id": "Virgil",
                    "user_href": "/profile/Virgil-59"
                },
                {
                    "user_id": "James Henry",
                    "user_href": "/profile/James-Henry-122"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Moran",
                "href": "/profile/Charlie-Moran-24"
            },
            "answer_text": "Car Radio is about needing a distraction from your mind. When Tyler ( the singer) talks about the car radio, he’s literally talking about a car radio, or just music in general. He says ”somebody stole my car radio and now I just sit in silence.” He is talking about the absence of sound and distractions. It’s about how being left with your mind and thoughts is dangerous. He doesn’t want to look into his feelings and think about all the bad things in life. If avoiding that means suppressing feelings and ignoring things in your life, then it’s worth it because of the pain that thinking brings. The hopeless confusion of your mind and the seemingly endless torture of self hate is arisen without distractions. This line in specific illustrates what the song is about fairly clearly. “I don’t know if we know why were here. Oh my too deep please stop thinking. I liked it better when my car had sound.” He starts thinking dark thoughts and then catches himself and desperately wants something to take his mind off of these thoughts. ",
            "date": "Answered November 13, 2019",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sophia Ndidi",
                    "user_href": "/profile/Sophia-Ndidi-1"
                }
            ]
        }
    ]
}