{
    "title": "What are your top 10 favorite songs of all time? Why? - Quora",
    "tags": [
        "Music Recommendations",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Wernick",
                "href": "/profile/Stephen-Wernick"
            },
            "answer_text": "Only 10? Shit…if I can only choose 10… 10) Clear as the Driven Snow - The Doobie Brothers. I got to play with them once in Monterey as a prize for being the CCS High School All Star Drummer of the year and this was one of the songs I got to play. Great song, too. 9) Times Like These - Foo Fighters It took me 3 years to begin to really live again after my wife's death, and this was one of the songs that helped pull me through. Times like these we learn to live again, Times like these we learn to love again. 8) Iris - Goo Goo Dolls Great song, great movie, and the drum part is so subtle in the beginning but ass kickin' during the jam. 7) YYZ - RUSH RUSH is my favorite band of All Time. Yes, Neil Peart is the excellence of drumming I strive for, but Alex Lifeson and Geddy Lee are also masters of their instruments as well, and they have produced the very best Rock instrumentals as far as I am concerned. YYZ is not my top pick from these guys, but still one of the most awesome instrumentals ever. 6) Dreams I'll Never See - Molly Hatchet Yes, I know it's a cover of the Allman Brothers, but for me it is soooo much more. I saw these guys at a Rock Super Bowl at the Tangerine Bowl, Orlando, Florida in 1980. They were the 3rd band of the night to be followed by headliner Bob Seger. Bob did his best, but the night belonged to Molly Hatchet. It was the last show of their Flirting with Disaster tour in front of basically a hometown crowd (Jacksonville ain't that far away), they were awarded their second Gold Record on stage, they played every song from their first two albums and the encore included songs from Skynyrd, Outlaws and Marshall Tucker. The energy in the stadium that night was unbelievable and something I had never felt before nor have felt since. And the song itself features 3 of the sweetest guitar leads I have ever heard, one performed by each of Hatchets three guitarists. Fuck the Allman Brothers. Hatchet wins this, hands down! 5) Wrong Side of Heaven - Five Finger Death Punch I included this song because too many people believe themselves to be so fucking righteous that they refuse to see any other points of view. It really pisses me off when 'religion' interferes with truth, when proven scientific evidence refutes a supposed 'Holy' book’s teaching, yet those under it's delusion will not even investigate the truth for themselves because of a belief system which blinds them. So, if a person spends a lifetime committing murder and mayhem but can still slide into 'heaven' because of a sudden last moment change of heart, but another person who has lived life in the service of others and has watched out for the weaker and less fortunate among us is sentenced to an eternity in 'hell' because they don't hold to a singular belief system, something is pretty fucked up. That's what I think of as being on the wrong side of heaven and the righteous side of hell, and if I am so judged one day by an omniscient being, that's probably where I will wind up. 4)Fantasia Suite for Two Guitars - Al Di Meola This guy is called The Master for a reason. Unlike other Flamenco style guitarists who use all fingers on their picking hand, Al Di Meola uses a single pick and is just as fast AND as clear as anyone else. If you have never seen his videos when he plays with other guitar virtuosos such as John McGlaughlin and Paco De Lucia, you're missing out. This guy has helped create some of the greatest guitar music on Earth, and his performances are unparalleled. On this particular song, Al plays both parts. It's an incredible journey throughout the entire adventure. If you love great guitar, this guy is one you don't want to miss out on. He shows up again soon on my list. 3) This one's a tie between two awesome self-awareness songs by Nickelback, If Today Was Your Last Day, and If Everyone Cared. I know some will think “Is he fuckin' serious? Nickelback?”. Yes, I am serious. Believe me, I didn't want to like Nickelback at first. Then I got dragged to one of their concerts and was totally blown away. I began listening to the deeper cuts on their CDs and found music that I absolutely love. While their harder stuff, like Never Again, This Means War, Coin For the Ferryman and Animals appeals to my love of energetic metal music, their more cerebral songs I picked for #3 appeal to my sense of how life should be lived. For those of you who wonder why I have picked Nickelback instead of Bob Dylan or Arlo or Woody Guthrie for social commentary songs, I just have this to say: musically, Nickelback appeals to my taste a whole helluva lot more than any of the others. Not gonna put anyone down, just my own personal preference. 2) La Villa Strangiato - RUSH Told you they'd show up again. Actually, I would prefer to put the entire album this came from right here. Hemispheres, to me, was, is and always will be the Pinnacle of Rock Music that I compare everything in rock against. I loved 2112, but the second side of that album disappointed me after listening to the 2112 side. Hemispheres blew my creative mind up throughout it's entirety. From the moment I put the needle on side one to the time it ended on side two, I sat in awe of this devastatingly beautiful production. Again, a concept album with the first side one symphony of many parts (the title song) with side two consisting of Circumstances, The Trees and ending with the singular greatest Rock Instrumental, La Villa Strangiato, this is a no brainer for me. I know that RUSH themselves have said that they believe their best work was on Clockwork Angels, but for me that spot will always belong to Hemispheres, with a special significance put on LVS. It would shape my drumming style for the rest of my life. 1) Mediterranean Sundance - Al Di Meola Yep, Al's duel with Paco De Lucia is my absolute favorite song to listen to. Two of the world's most excellent guitarists going at each other with no pulled punches. I loved Al's work with Chick Corea, Stanley Clarke and Lenny White in the jazz fusion band, Return to Forever. I began following Al's solo work and bought his album, Elegant Gypsy, as soon as it was available. Hearing Mediterranean Sundance for the first time was a revelation of excellence in music I had never heard before. This album went on to become the award winning 1977 Guitar Album of the Year. He celebrated it's 40th anniversary in 2017 with a sold out tour. Gotta tell you part of the story on how this song came to be. Paco flew over from Spain and Al picked him up from the airport. They went straight to the recording studio, sat down and played through without even practicing with each other. Neither was satisfied with the result, so they agreed to come back the next day. So, the following day, they went into the studio again, smoked a little weed together and sat down to record again. Again, no practice, no second take, just the two of them going at it. On the album you can hear their response to each other at the end of the song. Paco is heard going “Whew!”, and you can hear Al say “Yeah!”. What you hear on the album is only the second time they played that song together, and it is One For The Ages!!! ",
            "date": "Answered April 28, 2018",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ty Buxton",
                    "user_href": "/profile/Ty-Buxton-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzanne Lee",
                "href": "/profile/Suzanne-Lee-16"
            },
            "answer_text": "The Logical Song - SupertrampMy feeling about the world and how I have been prepared to co-operate with the world and what it means for me to dream of other things. 2. No Souvenirs - Melissa Etheridge - Your love(r) leaving nothing behind and going, but being the one left behind, it’s painful and this song examines it. 3. Letter to Hermoine - (feat. Bilal) Robert Glasper Project - For anyone who experienced the wanting of another person and have had a connection with them, then to see them with another person who doesn’t treat them well and they are emotionally unhappy and sad of heart. 4. Liberian Girl - Michael Jackson - a true song of love and adoration. I have such happy memories of this song when it was played. 5. The Stranger - Billy Joel - everyone has a side or two we show to different people, or at different places. 6. On Broadway - George Benson This song encapsulates the feeling of wanting to be a star and coupled with the irrefutable pulsing of the guitar and drum. Makes you want to jump up and shake your body or start drumming when you give it a decent level of audio, especially on the headphones. George’s singing and song makes me feel like I’m watching a scene of a movie, or theatre with someone singing for their dreams. 7. My Mother Had a Brother - George Michael I was dismissive of this song, well most of this album for quite some time. It is a what I call a sleeper album - it is ahead of it’s time. I discovered this song some years later and now this is one of my favourite songs of all time. Truthful and raw, one of the most honest, strong songs written by George Michael. 8.November Rain - Guns’n’Roses - Poignant songwriting and truth told as though many hearts including my own feel this song in true rock band way: Slash on the guitar singing the pain out at equal strength through the strings and Axel at his best voice wise in my opinion. 9. Oh Father - Madonna A song that goes right to the heart of me, my own pain and innocence wrapped up in the words. Madonna’s singing is a little off-key in my opinion but great none-the-less. 10. Sad Sad World - Sheryl Crow - we are human and we have relationships with many people who hurt us and we hurt them and it is unchangeable sometimes and painful. ",
            "date": "Answered September 4, 2016",
            "views": "11",
            "upvotes": "0"
        }
    ]
}