{
    "title": "Whatever happened to the 60s rock group Mitch Ryder and the Detroit Wheels? - Quora",
    "tags": [
        "1960s Music",
        "Rock and Roll Music",
        "1960s",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Mulligan",
                "href": "/profile/John-Mulligan-3"
            },
            "answer_text": "At the age of 75, Mitch Ryder continues to tour and record in the US and Europe. After the Detroit Wheels broke up Mitch Ryder had another band called “Detroit,” which had a hit in 1972 with a great version of Lou Reed’s “Rock and Roll.” The kind of success that Mitch Ryder really deserved never materialized. His is revered by the rockers who came after him. Bob Seger was inspired by those early Mitch Rider records. Bruce Springsteen featured a medley of songs by Ryder in his set for a long time. John Fogerty, of Credence Clearwater Revival, was clearly influenced by Mitch Ryder’s singing style. The string of Midwestern rock acts who have admitted to being influenced by Ryder runs the gamut from the MC5 to Ted Nugent to John Mellencamp and more. There were so many hot bands in the sixties playing around Michigan, and most of them played covers of Mitch Ryder songs. He was a Midwestern star and a guiding light to all the young rockers. In the end we can see that Mitch Ryder was highly influential. His authenticity as a soul shout kind of singer with a hot band is unparalleled. After a lifetime of struggle in the music business Ryder has settled in to life as a working musician. He is popular in Europe and seems to play there periodically. ",
            "date": "Answered August 10, 2020",
            "views": "431",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Eric Torgerson",
                    "user_href": "/profile/Eric-Torgerson-8"
                },
                {
                    "user_id": "Duayne Koltowicz",
                    "user_href": "/profile/Duayne-Koltowicz"
                },
                {
                    "user_id": "Barbara Kirk",
                    "user_href": "/profile/Barbara-Kirk-22"
                },
                {
                    "user_id": "Leeane Claggett",
                    "user_href": "/profile/Leeane-Claggett"
                },
                {
                    "user_id": "Bob Smith",
                    "user_href": "/profile/Bob-Smith-6121"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                },
                {
                    "user_id": "Susan Altman",
                    "user_href": "/profile/Susan-Altman-7"
                },
                {
                    "user_id": "Michael Kenny",
                    "user_href": "/profile/Michael-Kenny-76"
                },
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Starstruck",
                "href": "/profile/Larry-Starstruck"
            },
            "answer_text": "Mitch Ryder and company hit the charts for the first time in 1965 with “Jenny take a ride.” The song added the “Jenny take a ride” chorus to the blues standard “c c ryder.” What’s interesting, the background singers do appear to be singing “see Mitch Ryder” during one of the choruses. They also had a mashup with “devil with a blue dress/good golly Miss Molly.” From what I am seeing on the Wiki article, The Detroit Wheels convinced Mitch Ryder to start a solo career with ended up being disastrous for both. Member of the group did form basis for other groups like the Rockets. Here is the article if you are interested The Detroit Wheels - Wikipedia ",
            "date": "Answered August 17, 2020",
            "views": "94",
            "upvotes": " Answer requested by Gary Saunders"
        }
    ]
}