{
    "title": "What makes a great pianist? - Quora",
    "tags": [
        "Pianists",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vladimir Pleshakov",
                "href": "/profile/Vladimir-Pleshakov"
            },
            "answer_text": "I have written on this subject before. As a classically trained concert pianist, and a published composer, I have a personal perspective on what is greatness in music. Here is my personal philosophy. It is not a view of myself as musician, nor of any particular pianist, past or present. It is an synopsis based on a lifetime in music as pianist, composer, listener, researcher. A. There is a vast difference between playing the piano well and making great music while playing the piano. A person who plays superlatively well is not necessarily going to make great music. A person capable of making great music is not necessarily a great pianist. A great pianist who is capable of making great music while playing is a rarity in any age. There are millions of pianists and millions of musicians. Only a handful per generation will be at the top of both aspects of playing the piano - simultaneously top pianist and top musician. B. Playing the piano requires the acquisition of many skills, physical and intellectual. Acquiring them is difficult enough. Infinitely more difficult to achieve is the integration of all of them into one entity, homogeneous and without any weak links, C. The making of a great musician is a mystery that often defies logic. The most improbable people have made it, against all odds. Others, well educated, broadly cultured, wind up as duds. (1). I do not know how important heredity is. But we know that total immersion into the musical world has a lot to do with eventual flowering. No musician can develop fully in a cultural vacuum. Music is a reflection of society, culture, history, literature, art, religion, wars, revolutions, catastrophic events, love, devotion, selflessness, selfishness, strength, weakness, morality, amorality, eternity, the fleeting moment . (2). A great pianist does not have to be a great composer, but must have insight into any composer’s mind. The result is most great pianist do not play everything, but eventually settle down with what they are most in resonance with. Playing a few composers and only a few works by each, but playing superlatively well and memorably, is a better solution than playing everything well - just well - without any illuminating insights that everybody else has missed. (3) After going through the arduous preparation (enormous investment of time and money and dedication) a pianist must have additional knowledge and experience of life, travel, meeting with and mixing with experts in many fields of knowledge, and a lot of listening to live and recorded concerts. (4) I have said before that after everything is said and done, the next classroom setting is the concert stage. This is where you are exposed to the realization that there is no such thing as being overly prepared, EVER!. The weakest links will be the first to pop. Even more importantly, one learns on the concert stage to evaluate the impact on the audience - what is a momentary effect that will be instantly forgotten, what is a deep memory that will linger in the listener’s mind for days, weeks or years. One also learns self-criticism: how much is too much, and how little is too little. Most importantly, one learns what is vulgar, what is not, what is self-serving, what serves art (and mankind). There is no end to improvement. The ultimate question is “quality vs. quantity”. You play for the ages, not for the moment. You will notice that I have never entered into the territory of how do you make a living. There are as many answers to this question as there are pianists. ",
            "date": "Updated May 7, 2019",
            "views": "65",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chloesther Vasilievich",
                    "user_href": "/profile/Chloesther-Vasilievich"
                },
                {
                    "user_id": "Nitin",
                    "user_href": "/profile/Nitin-390"
                },
                {
                    "user_id": "John Smithson",
                    "user_href": "/profile/John-Smithson-70"
                },
                {
                    "user_id": "Jiří Klimeš",
                    "user_href": "/profile/Jiří-Klimeš"
                },
                {
                    "user_id": "Susan Merwin",
                    "user_href": "/profile/Susan-Merwin"
                },
                {
                    "user_id": "Hans Hartmann",
                    "user_href": "/profile/Hans-Hartmann-1"
                },
                {
                    "user_id": "Arthur George Harry Windsor",
                    "user_href": "/profile/Arthur-George-Harry-Windsor"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Peter Walsh",
                    "user_href": "/profile/Peter-Walsh-138"
                },
                {
                    "user_id": "Maria Green",
                    "user_href": "/profile/Maria-Green-125"
                },
                {
                    "user_id": "Peter Ruffolo",
                    "user_href": "/profile/Peter-Ruffolo-3"
                },
                {
                    "user_id": "Deer",
                    "user_href": "/profile/Deer-48"
                },
                {
                    "user_id": "Luke D Mcdonald",
                    "user_href": "/profile/Luke-D-Mcdonald"
                },
                {
                    "user_id": "Maria Tomkins",
                    "user_href": "/profile/Maria-Tomkins"
                },
                {
                    "user_id": "Tamara Munk",
                    "user_href": "/profile/Tamara-Munk-2"
                },
                {
                    "user_id": "Peter John Bailey",
                    "user_href": "/profile/Peter-John-Bailey"
                },
                {
                    "user_id": "Mark Masters",
                    "user_href": "/profile/Mark-Masters-52"
                },
                {
                    "user_id": "William Davidson",
                    "user_href": "/profile/William-Davidson-55"
                },
                {
                    "user_id": "Susan Lees",
                    "user_href": "/profile/Susan-Lees-8"
                },
                {
                    "user_id": "Kate Willats",
                    "user_href": "/profile/Kate-Willats"
                },
                {
                    "user_id": "Adela Perez del Viso",
                    "user_href": "/profile/Adela-Perez-del-Viso"
                },
                {
                    "user_id": "Cathy Bamberina",
                    "user_href": "/profile/Cathy-Bamberina"
                },
                {
                    "user_id": "Csaba Hegyvary",
                    "user_href": "/profile/Csaba-Hegyvary"
                },
                {
                    "user_id": "J. Lew",
                    "user_href": "/profile/J-Lew-7"
                },
                {
                    "user_id": "Ash Evangelista",
                    "user_href": "/profile/Ash-Evangelista-1"
                },
                {
                    "user_id": "Charlotte Nsingi",
                    "user_href": "/profile/Charlotte-Nsingi"
                },
                {
                    "user_id": "Doan Minh Tu",
                    "user_href": "/profile/Doan-Minh-Tu-1"
                },
                {
                    "user_id": "Nanna Mumma",
                    "user_href": "/profile/Nanna-Mumma"
                },
                {
                    "user_id": "Geordie Bol",
                    "user_href": "/profile/Geordie-Bol-2"
                },
                {
                    "user_id": "John Honeycutt",
                    "user_href": "/profile/John-Honeycutt-14"
                },
                {
                    "user_id": "Bob Crowder",
                    "user_href": "/profile/Bob-Crowder-6"
                },
                {
                    "user_id": "Dale Lawton",
                    "user_href": "/profile/Dale-Lawton"
                },
                {
                    "user_id": "Chloe Temple",
                    "user_href": "/profile/Chloe-Temple-4"
                },
                {
                    "user_id": "Gilbert Nii-Okai Addy",
                    "user_href": "/profile/Gilbert-Nii-Okai-Addy-1"
                },
                {
                    "user_id": "Yanis Denis",
                    "user_href": "/profile/Yanis-Denis-1"
                },
                {
                    "user_id": "ROBERT Curtis",
                    "user_href": "/profile/ROBERT-Curtis-109"
                },
                {
                    "user_id": "John Thomas",
                    "user_href": "/profile/John-Thomas-1758"
                },
                {
                    "user_id": "Carol Hindley",
                    "user_href": "/profile/Carol-Hindley"
                },
                {
                    "user_id": "Jacqueline Tashenberg",
                    "user_href": "/profile/Jacqueline-Tashenberg"
                },
                {
                    "user_id": "Deepak Vasudevan",
                    "user_href": "/profile/Deepak-Vasudevan-4"
                },
                {
                    "user_id": "André Noronha",
                    "user_href": "/profile/André-Noronha"
                },
                {
                    "user_id": "Ashley Ow",
                    "user_href": "/profile/Ashley-Ow-1"
                },
                {
                    "user_id": "Ken Madell",
                    "user_href": "/profile/Ken-Madell"
                },
                {
                    "user_id": "Luan Roos",
                    "user_href": "/profile/Luan-Roos"
                },
                {
                    "user_id": "Sam Bell",
                    "user_href": "/profile/Sam-Bell-41"
                },
                {
                    "user_id": "Xavi Sala",
                    "user_href": "/profile/Xavi-Sala"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                },
                {
                    "user_id": "Nicolas Azéraut",
                    "user_href": "/profile/Nicolas-Azéraut"
                },
                {
                    "user_id": "James Romanow",
                    "user_href": "/profile/James-Romanow"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "I think, like Matthew Barnard, that to use the word “great” in an unqualified sense, a pianist should be versatile - able to put his hands to divers genres. However, this is also exceedingly rare, because in reality, many pianists tend to specialise, or be known for their brilliant playing of particular composers, works or even music of a particular era. Actually, we “contemporary” composers have been very grateful to have performers who specialise in “modern” music; otherwise ours wouldn’t be played at all! To give you an idea of the rarity of being an “all-rounder”: As a student, I wrote a duo work for piano and clarinet which had a very testing piano part. I made the mistake at the time of thinking thus: “An Academy Gold Medallist will manage it.” However, while the Academy Gold Medallist was a brilliant interpreter of pre-20th century music (or Post Romantic stuff), he was totally at sea with the kinds of demands a modern composer might make. So, a specialist pianist had to be called in at the last moment. Now, he wasn’t a BETTER pianist than the gold medallist, but he was more experienced in the performance of certain “modern” music. Both pianists were “great” pianists in their own areas of expertise, but you would have to qualify your use of the term great by giving it specificity. With the unparalleled access we all have to music of all kinds today, specialism has taken on a whole new significance, and I have already mentioned the field of contemporary music; but another is in the music of the Baroque era. There again, you will find pianists who have become known as great Beethoven interpreters, Mozart interpreters, Chopin interpreters etc. etc. Thus, once again we are qualifying the term “great”. What ALL great pianists in their various fields DO share in common is an innate ability to communicate with their listeners through the music they are performing. This ability consists of a number of facets: Obviously, they have to be reasonably accurate technically, because who wants to hear an expressive performance of many wrong notes? But they also give intimate attention to the SPACES between the notes, as well as highlighting magical moments - be it a note here or a motif or phrase- as well as exercising profound sensitivity in their control of articulation and dynamic gradation. All these elements are the fruit of the most intimate and careful study of the music itself, and nowadays especially, that includes research into historical practices and what most effective compromises may have to be made in certain situations. For example, with regard to the performance on a modern grand piano of music that was conceived for a less substantial instrument. In this matter, there can be sharp dissension between some musicologists and performers. You have some pianists who play Bach without any sustaining pedal at all, while others (myself included) recognise that the piano has as a resource a sustaining pedal, and a sensible interpretation must acknowledge the existence of whatever facility is available. However, more than a nodding glance must also be cast back to the era in question in these matters, otherwise a thoroughly tasteless performance will result - as did happen in the 19th century in many performances of music of a previous age! ",
            "date": "Answered June 8, 2016",
            "views": "15",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "徐美君",
                    "user_href": "/profile/徐美君"
                },
                {
                    "user_id": "Luke D Mcdonald",
                    "user_href": "/profile/Luke-D-Mcdonald"
                },
                {
                    "user_id": "J. Lew",
                    "user_href": "/profile/J-Lew-7"
                },
                {
                    "user_id": "Charlotte Nsingi",
                    "user_href": "/profile/Charlotte-Nsingi"
                },
                {
                    "user_id": "Rakshit Malhotra",
                    "user_href": "/profile/Rakshit-Malhotra-2"
                },
                {
                    "user_id": "Emily Vuong",
                    "user_href": "/profile/Emily-Vuong-2"
                },
                {
                    "user_id": "Asher Reich",
                    "user_href": "/profile/Asher-Reich"
                },
                {
                    "user_id": "Sylvia Gurney",
                    "user_href": "/profile/Sylvia-Gurney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chrystal Li",
                "href": "/profile/Chrystal-Li-1"
            },
            "answer_text": "I am a pianist myself and what makes a great pianist is basically loving what you’re playing, put your feelings through your playing, telling a story through your pieces, and of course practicing! In everything you play, be passionate about it and enjoy yourself. ",
            "date": "Answered June 7, 2016",
            "views": "208",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebecca Do",
                    "user_href": "/profile/Rebecca-Do-9"
                },
                {
                    "user_id": "Rhonda Layman Partusch",
                    "user_href": "/profile/Rhonda-Layman-Partusch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Barnard",
                "href": "/profile/Matthew-Barnard-5"
            },
            "answer_text": "Great Question! Thanks for the A2A! In my view a great pianist is someone who is flexible! Some pianists get stuck in a certain genre and they have a limited scope and understanding. For a while I faced this problem as I could play most any classical piece but when I was at a party and someone requested “7 years” and I failed to play even a simple song, that didn’t do me any favors. Any of the greatest pianists could play just about anything, often just from ear. Greatness is also built on many smaller aspects of playing such as practice, determination, desire to play, and ability to play. I think many jazz pianists are some of the greatest as they have some of the broadest understanding of music. ",
            "date": "Answered June 7, 2016",
            "views": "879",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luke D Mcdonald",
                    "user_href": "/profile/Luke-D-Mcdonald"
                },
                {
                    "user_id": "Charlotte Nsingi",
                    "user_href": "/profile/Charlotte-Nsingi"
                },
                {
                    "user_id": "Catherine Rose Campagne",
                    "user_href": "/profile/Catherine-Rose-Campagne"
                },
                {
                    "user_id": "Logan Forbes",
                    "user_href": "/profile/Logan-Forbes-1"
                },
                {
                    "user_id": "John Gustafson",
                    "user_href": "/profile/John-Gustafson-1"
                },
                {
                    "user_id": "Kevin Liang",
                    "user_href": "/profile/Kevin-Liang-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "JJoe Townley",
                "href": "/profile/JJoe-Townley"
            },
            "answer_text": "I was tempted to say, “You’re great if you can consistently pack a concert hall who come to idolize you” but then I thought of Liberace. But that’s being unkind to Liberace because have a look at him in the 40’s (skip to midway):  Honestly he COULD have been a great pianist, but the good life took hold of him. I digressed. I really don’t know what makes a pianist great because I never flirted with greatness as a pianist myself, just mediocrity.  ",
            "date": "Answered June 7, 2016",
            "views": "574",
            "upvotes": " Answer requested by Asher Reich and Kat Jolliff",
            "upvoters": [
                {
                    "user_id": "Luke D Mcdonald",
                    "user_href": "/profile/Luke-D-Mcdonald"
                },
                {
                    "user_id": "Avery Kendall",
                    "user_href": "/profile/Avery-Kendall"
                },
                {
                    "user_id": "Asher Reich",
                    "user_href": "/profile/Asher-Reich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Yen",
                "href": "/profile/Arthur-Yen-2"
            },
            "answer_text": "A great pianist, took A LOT of practice and usually having remarkable skills and great feels. They’re not just playing well, they perform comfortably in front of people and having such a confidence while playing it. They enjoy their music much more than anyone else. Seriously, if don’t enjoy your music much, how could you expect others to be enjoying it? ",
            "date": "Answered June 26, 2016",
            "views": "322",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Rose",
                "href": "/profile/Tom-Rose-16"
            },
            "answer_text": "It is very simple. A great pianist understands the musical meaning of everything they play and has sufficient control of the playing apparatus to deliver it with precision and as expressively as a great actor or orator can tell a story or recite a poem in their native language. I disagree that to be considered “great” you need to be an all-rounder or to be able to play all genres. You can be great within a narrow range. ",
            "date": "Updated March 18, 2020",
            "views": "478",
            "upvotes": " View 3 Upvoters "
        }
    ]
}