{
    "title": "What was left out of the Bible? - Quora",
    "tags": [
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Gutbrod",
                "href": "/profile/Rick-Gutbrod"
            },
            "answer_text": "I agree with the words of one of the writers of letters in the first century. He was a student of one of the most respected rabbis of the era. He became a Christian, and in his letters, showed the value of the Hebrew scriptures, and how they gave Christians all that they needed. (2 Timothy 3:16, 17) 16 All Scripture is inspired of God and beneficial for teaching, for reproving, for setting things straight, for disciplining in righteousness, 17 so that the man of God may be fully competent, completely equipped for every good work.There was nothing left out that was necessary for us to be “fully competent” and “completely equipped”. Does it mean it answers ALL questions? No, it wasn’t designed for that. I saw someone listed some questions that THEY wanted, but they were not necessary for us to complete the work assigned to us. (Matthew 28:19, 20) 19 Go, therefore, and make disciples of people of all the nations, baptizing them in the name of the Father and of the Son and of the holy spirit, 20 teaching them to observe all the things I have commanded you. And look! I am with you all the days until the conclusion of the system of things.”",
            "date": "Answered November 28, 2019",
            "views": "61",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Beverly Howerton",
                    "user_href": "/profile/Beverly-Howerton"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Cutler",
                "href": "/profile/Geoff-Cutler"
            },
            "answer_text": "What was left out of the Bible? How to be reborn of spirit. Given this was Jesus’ number one teaching the only remnants of his actual teachings remain in several parables that have not been deciphered by orthodoxy. As an example take “The wise and foolish virgins”. It’s the whole box and dice of Jesus’ teachings if you decipher it accurately. Clue: it’s not about the uncertainty of the time of death. The issue for the clergy is that Jesus really did teach that you need none of them and none of their ceremonies or buildings. It’s purely between you and God. It’s not possible to build a religion on his teachings. They are too simple. ",
            "date": "Answered November 15, 2019",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajesh Kumar Gupta",
                    "user_href": "/profile/Rajesh-Kumar-Gupta-235"
                }
            ]
        }
    ]
}