{
    "title": "What is the meaning behind Fix You by Coldplay? - Quora",
    "tags": [
        "Coldplay (band)",
        "Thinking",
        "Song Meanings",
        "People",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nendra Satria",
                "href": "/profile/Nendra-Satria"
            },
            "answer_text": "Coldplay – Fix You Above is a Genius link with annotations from various contributors regarding their analysis on Coldplay's Fix You. I'll be using it as most of my reference, but I'm here to let you see what I see; or feel, when I hear this song. The song has a distinctive trigger. There are a lot of stories surrounding to the creation of this song, for many songwriters and/or artists, a couple of their great songs are usually triggered by a major event of their lives, or a really authentic idea that they came across to casually. Chris Martin took advantage of both factors to creating this song, combined with the memorable melody that's likely to get everyone in a brief state of a melancholic euphoria, or even a bit of nostalgia. The meaning of the song derived from Chris Martin's then-wife, Gwyneth Paltrow, who had just lost her father when he wrote this song.  The second half of the first verse describes the situation quite well. When the tears come streaming down your face\nWhen you lose something you can't replace\nWhen you love someone but it goes to waste\nCould it be worse? As a pop songwriter, Chris Martin strives to communicate the experience that he had towards a huge audience, thus, he used a second-person point of view rather than relying on a first-person point of view to express how Gwyneth felt. He understood that everyone can feel the same weight of emotions as she did. The chorus describes that he will be there for her, when her dad can no longer be there for her. Chris Martin may have seen her state as somewhat reduced or broken, she has lost a significant part of herself by losing her father. With that in mind, he strongly reminds her of that he is willing to be responsible to getting her back on her feet. [Chorus]Lights will guide you home\nAnd ignite your bones\nAnd I will try to fix you The line 'ignite your bones' can be bewildering, but this line is meant to rhyme. As a songwriter, Chris Martin acknowledges the availability of that line and incorporated that idea into the song, but you can try to make meaning off of it. Think of it as the moment when you're sad or depressed, your body moves inwards, as if it's a shell. You're no longer motivated, and you don't have the fire within you. 'Igniting your bones' is just a metaphor to bringing back the motivation and fulfillment into your life, to the point where you're fully functional and fired up. [Bridge] Tears stream down your face\nWhen you lose something you cannot replace\nTears stream down your face\nAnd I...Tears stream down your faceI promise you I will learn from my mistakesTears stream down your faceAnd I... Finally, the bridge allowed Chris Martin to emphasize the descriptive aspect of the situation, he further illustrates what's happening to Gwyneth externally and internally. He bounces back her emotions and reflect it upon himself to do something about it, then he ends the song with another chorus that reminded the listeners of his words towards her and his promise that he'll fix her. ",
            "date": "Answered April 5, 2016",
            "views": "1317",
            "upvotes": " View 67 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Pavlak",
                    "user_href": "/profile/Adam-Pavlak-2"
                },
                {
                    "user_id": "Erica Duffy",
                    "user_href": "/profile/Erica-Duffy-10"
                },
                {
                    "user_id": "Yashwant Singh",
                    "user_href": "/profile/Yashwant-Singh-50"
                },
                {
                    "user_id": "Adrija Sarkar",
                    "user_href": "/profile/Adrija-Sarkar-4"
                },
                {
                    "user_id": "Misbah Sheikh",
                    "user_href": "/profile/Misbah-Sheikh-23"
                },
                {
                    "user_id": "Cesar Garza",
                    "user_href": "/profile/Cesar-Garza-33"
                },
                {
                    "user_id": "R. .",
                    "user_href": "/profile/R-1341"
                },
                {
                    "user_id": "Aakifa Shahul",
                    "user_href": "/profile/Aakifa-Shahul"
                },
                {
                    "user_id": "Tilmann Dürring",
                    "user_href": "/profile/Tilmann-Dürring"
                },
                {
                    "user_id": "Aditya Umarjikar",
                    "user_href": "/profile/Aditya-Umarjikar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adhiraj Ghosh",
                "href": "/profile/Adhiraj-Ghosh-1"
            },
            "answer_text": "FIX YOU, X&Y, 2005. Blythe Danner, the mother of  Gwyneth Paltrow, and former mother-in-law of Chris Martin, stated in an interview that Martin 'wrote the song for Gwyneth when her father died and I weep every time I hear it'. When writing the song, vocalist Chris originally intended to use a church-style organ for the track. Unable to gain access to the instrument, Martin instead used an old keyboard that his late father-in-law, Bruce Paltrow, to whom the song is dedicated, gave to his daughter.   Line by line interpretation. \"When you try your best, but you don't succeed When you get what you want, but not what you need When you feel so tired, but you can't sleep\" refers to a huge struggle for attention, to be understood and really seen by the other is could be your lover. The difficulty where lots of couples get in to after a time. Expectations which did not come true.\"Stuck in reverse\" means that when everything in your life is backwards and you feel like you're drowning in failure. When everything is opposite of how it should be.Gwyneth was really sad when she returned home to Martin. She was crying. When Martin asked her what he could do for her, she told him to hold her because his love would make her feel better. \"Lights will guide you home and ignite your bones\" means the lights will guide Gwyneth back home and back to happiness, that she will eventually move on from her father's death.\"When you're too in love to let it go But if you never try you'll never know Just what you're worth\" meant that Gwenyth was too in love with her dad to let go of his death, and if she never tries to move on with it, she'll never know what she's worth. If she doesn't move on she'll always be in this dark pit of sadness over her father.\"I will try to fix you\" meant that Martin will try to help her accept the pain she was feeling after the loss by being there for them, allowing them to vent or scream and shout and cry. Letting them get out the emotions that they are feeling.Martin said \"Fix You is probably the most important song we've ever written\". Martin's word is gold. ",
            "date": "Answered March 29, 2016",
            "views": "2208",
            "upvotes": " View 238 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erica Duffy",
                    "user_href": "/profile/Erica-Duffy-10"
                },
                {
                    "user_id": "Jay Stxk",
                    "user_href": "/profile/Jay-Stxk"
                },
                {
                    "user_id": "Subhrabaran Panigrahi",
                    "user_href": "/profile/Subhrabaran-Panigrahi-1"
                },
                {
                    "user_id": "Ibrahim Abbas",
                    "user_href": "/profile/Ibrahim-Abbas-8"
                },
                {
                    "user_id": "Jake Dickinson",
                    "user_href": "/profile/Jake-Dickinson-6"
                },
                {
                    "user_id": "R. .",
                    "user_href": "/profile/R-1341"
                },
                {
                    "user_id": "Nabila Azzahra",
                    "user_href": "/profile/Nabila-Azzahra-1"
                },
                {
                    "user_id": "Himank Kanojia",
                    "user_href": "/profile/Himank-Kanojia"
                },
                {
                    "user_id": "Chinmay Prasad Kelkar",
                    "user_href": "/profile/Chinmay-Prasad-Kelkar"
                },
                {
                    "user_id": "Truth-Seeker",
                    "user_href": "/profile/Truth-Seeker-445"
                }
            ]
        }
    ]
}