{
    "title": "What is the significance of the piano playing in the TV show Westworld for each new episodes? - Quora",
    "tags": [
        "Westworld Season 1",
        "Learning Piano",
        "Pianos",
        "Learning to Play Musical Instruments",
        "TV Show Recommendations",
        "Entertainment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Peters",
                "href": "/profile/Chris-Peters-2"
            },
            "answer_text": "A lot of cool little twists are hiding in that music. Creator Jonathon Nolan has said the pop music serves to remind us that Westworld is not a western, that there is another world outside of the park. It is a great way to get recognizable songs on the show. Cheap too, the producers get big hits without having to pay for the original versions of each song. By reducing these songs to simplistic covers, the show’s music is stripped down, it becomes entirely digital. Music is a naturally digital medium. Frequency, duration, plus intensity are the data needed for a note. Of course, some analog elements exist, like the flourishes that all human musicians add, but music can be reduced to a digital form and still sound like music.  Above is the music roll from the player piano in Sweetwater. Does it remind you of the digital Matrix rain? It should. Both are fantastic symbols for an artificial world.  Hosts have central processing units, which run code not unlike the music roll on that piano. Code is also a method of control. Code is a set of instructions to allow humans to control the hosts. Consider the theme of the piano and layers of hidden control in Westworld’s title sequence. We see a piano being played by an “unskinned” host. Notice the manufacturing robot in the upper right corner. Robots built by other robots, and themselves built by humans.  The manufacturing bot leaves the host to play by itself…  Then the host leave the piano to play itself…  While cresting over the piano is… what? Perhaps the AI that will emerge on the show? A new form of life?  The symbolism suggests life creating life creating more life, with hidden systems of control disappearing before our eyes, all while producing unexpected outcomes. The music of reality. ",
            "date": "Updated November 2, 2016",
            "views": "286",
            "upvotes": " View 339 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shawn Kresal",
                    "user_href": "/profile/Shawn-Kresal"
                },
                {
                    "user_id": "Parker Green",
                    "user_href": "/profile/Parker-Green-1"
                },
                {
                    "user_id": "Sofia Lew",
                    "user_href": "/profile/Sofia-Lew"
                },
                {
                    "user_id": "Audra Ann Morton",
                    "user_href": "/profile/Audra-Ann-Morton"
                },
                {
                    "user_id": "David Festus",
                    "user_href": "/profile/David-Festus"
                },
                {
                    "user_id": "Marla Smith",
                    "user_href": "/profile/Marla-Smith-14"
                },
                {
                    "user_id": "Shelly John",
                    "user_href": "/profile/Shelly-John"
                },
                {
                    "user_id": "Bülent Özgönenel",
                    "user_href": "/profile/Bülent-Özgönenel"
                },
                {
                    "user_id": "Vincent CHIU",
                    "user_href": "/profile/Vincent-CHIU-34"
                },
                {
                    "user_id": "Sebastian Orellana",
                    "user_href": "/profile/Sebastian-Orellana-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sebastien Blanc",
                "href": "/profile/Sebastien-Blanc-4"
            },
            "answer_text": "A lot has already been said - in particular about how playing the piano is a very early form of programming - but I think that there is something else to it: the piano is actually an allegory for the creators themselves - Ford & Arnold or at least for their emotional and creative powers - and it is here to emphasise Ford’s and Arnold’s absolute (godly?) presence on Westworld through the show. There is the obvious: each day starts with the piano playing in Sweetwater - figuratively creating a new loop afresh, replacing the sun as the start of the day. But there are more subtle suggestions: One of the main themes played during the entire show is a piece by Debussy called Reveries, which is also the name Arnold gave to the key piece of code that ultimately allowed the hosts to reach consciousness. It is the piece that plays on the phonograph in the scene where Arnold makes his final attempt at freeing his creations. When a piano plays Reverie, it is a direct mention of Arnold and his creative intentions, a sort of Wagnerian Leitmotiv;Ford’s presence is also closely associated with pianos: When Robert Ford has his first encounter with the Man In Black in the bar mid season, the piano is playing until Ford appears on screen - then it instantly stops. As soon as Ford leaves, the piano resumes, prolonging his presence; There is also of course a piano in Ford’s office, which starts playing as soon as he enters the room and stops when he leaves - Ford’s office piano also plays Reverie once or twice if I remember well - further echoing Arnold’s presence in WestWorld, even beyond the grave;Now - and it may become far-fetched - if the pianos are indeed a representation for the creators and their creative presence, it implies that someone is playing them. As we saw with Bernard, “who is what” and “who creates whom” do not always receive straight-forward answers in WestWorld. Maybe the allegory of the piano is here to remind us of that in yet another way. ",
            "date": "Answered January 6, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bülent Özgönenel",
                    "user_href": "/profile/Bülent-Özgönenel"
                },
                {
                    "user_id": "Riah Reese",
                    "user_href": "/profile/Riah-Reese"
                },
                {
                    "user_id": "Matt Stricklen",
                    "user_href": "/profile/Matt-Stricklen"
                },
                {
                    "user_id": "Dorrie Fletcher",
                    "user_href": "/profile/Dorrie-Fletcher"
                }
            ]
        }
    ]
}