{
    "title": "What affirmation raises your vibration immediately? - Quora",
    "tags": [
        "Vibrations (spirituality)",
        "Affirmations",
        "Manifestations",
        "Psychology",
        "Psychology of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea De Angelis",
                "href": "/profile/Andrea-De-Angelis-4"
            },
            "answer_text": "Thank you for A2A. Any I AM affirmation. Example : I AM Love However it's important to make sure you are at a vibration where you are resonating with what you are affirming to make it stick. So by starting out where you are, check in with your feelings, they will show you where you are. Example: I feel like I need to raise my vibration. And then ask yourself “howz come?” The answer will point you closer to the real feeling. Keep asking yourself to get to the feeling. It may be a yucky feeling or something simple as “well, because that's what they say we are supposed to do!” and you can respond back to yourself with, “Well, that's interesting, I am open to discovering what that is like for myself. But, hey, self wonder if it feels better for us to discover how it feels for us by totally connecting to each other instead of what people say?” Answer is pretty much always (at least for me): Ooo! Yes please that feels yummy. Now, this is where you can start affirming. Yes, connecting to my true self does feel yummy I love feeling yummy Can I feel even yummier? Oh yes! I CAN! I AM feeling yummier and yummier right now and more and more. I AM discovering all the juicy feeling places I can be and I AM loving this discovery and adventure thoroughly. I AM saying yes please to feeling yummy and juicy! Because I love feeling this…feeling which is…Oooo this is a playful feeling! I feel so light and uplifted! Yes please, show me more! Etc etc. You of course can stick with just I AM statements. But I find it way more fun to engage with myself in a way I just described, and that joy, playfulness, and excitement feeling is instantly raising my vibration. Those feelings are the stuff right there. When we are so connected and attuned to our inner being we are able to BE in a state of peace and joy. And the more and more we reach for our connection there the more and more we receive and give out love, joy, and peace. Then there are Lessons in A Course in Miracles that have affirmations that are associated with the lessons that work to expand your awareness progressively which will anchor your raised vibration you are attuning to it by training your mental mind. I recommend checking that that as well. Hope this helps! Xoxo ",
            "date": "Answered June 12, 2019",
            "views": "265",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sheryl Ututalum",
                    "user_href": "/profile/Sheryl-Ututalum"
                },
                {
                    "user_id": "Tiina Rdsksk",
                    "user_href": "/profile/Tiina-Rdsksk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miko Boric",
                "href": "/profile/Miko-Boric"
            },
            "answer_text": "Eating live food, charging water and grounding will help and vibrating on the same lvl as the conciousness. Observer will be key to your individual affirmation only after you find yourself and emotional associations will reveal everything ",
            "date": "Answered June 13, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miko Boric",
                    "user_href": "/profile/Miko-Boric-2"
                }
            ]
        }
    ]
}