{
    "title": "What's the story behind BTS's Blood, Sweat and Tears MV? - Quora",
    "tags": [
        "BTS Songs",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heather Lee",
                "href": "/profile/Heather-Lee-112"
            },
            "answer_text": "EDIT: Hello! I recently wrote a theory to BTS’s Spring Day MV! If you enjoyed this response, check out my Spring Day theory here: Heather Lee's answer to Is there any connection between the Demian, Icarus, Omelas, and Snowpiercer theory in Blood Sweat & Tears and Spring Day? BTS has stated many times that their Wings concept is based on youth/boys falling into temptation and losing their innocence. This is a good continuation of their overarching concept of youth; their previous era, The Most Beautiful Moment in Life, is centered around the idea of a reckless and carefree youth that leads to growing up and falling into temptation (you can see this in the I Need U and Run videos). So in TMBML we saw the boys at the prime of their free-spirited youth and hints of their downfall. Now, in Wings/Blood Sweat & Tears, we will witness their fall & one interpretation of the different ways adulthood tempts the freshly matured. Most people have replied based on the concept’s connection to Hermann Hesse’s Demian. I’ve never read Demian so I can’t analyze the video for you from that angle, but I study art so I can provide some artistic analysis from that perspective. Blood Sweat & Tears has a lot of artistic symbols so I will focus on those instead. There are also a lot of mythological/Biblical references I explain and other observations that I make. Beware, this is really, reallllly long and super detailed. Enjoy! RELATIONSHIP ESTABLISHMENTS & JIN WITH THE PAINTING  This may seem like a really minor detail and super irrelevant (“Ahh!! You’re reading too much into it!!”) but after watching the video several times you will see that this makes a connection later on. The video opens with everyone walking into the museum together, but everyone is paired up: J-Hope with V, Suga with Jimin, Rapmon with Jungkook. This is even exemplified in the Wings concept photoshoots:  There are 7 members in BTS so the odd one out is Jin, who is seen walking away from everyone and towards a painting.  Jin looks at the painting, titled The Fall of the Rebel Angels by Pieter Bruegel. We know that the angels of heaven fell because of direct rebellion against God by siding with Lucifer, who corrupted the angels by sinful temptations. This is a foreshadowing of the future events to come. Jin is the center focus of the music video and is the key symbol of tempted youth (which is ironic because he’s the oldest in BTS!) JUNGKOOK & RAP MONSTER: STORY OF ICARUS AND DAEDALUS  The next painting is seen behind Jungkook, who is dangling from a swing. It is The Lament of Icarus by Herbert James Draper. The story of Icarus is marked by its famous representation of a naïve boy whose innocent curiosity is his fatal flaw. He is given a pair of wax-held wings by his father Daedalus (an inventor/scientist) to fly, but he ignores his father’s warning to stay away from the Sun. He ultimately flies too close to the Sun and the wax holding his wings together melts, destroying his wings and leading to Icarus falling into the ocean below and drowning.  Rap Monster is the one who melts the candle from which Jungkook licks the melted wax from. In the myth, although it is Icarus’ own ignorance that leads to his death, it is his father Daedalus who gives him the option of flying in the first place. So Rapmon would represent Daedaelus and Jungkook can be interpreted as Icarus. Remember, at the beginning Rapmon is shown reading something to Jungkook, which would play into the Daedalus/Icarus relationship where the former educates and guides the latter. Rapmon is also the leader and Jungkook the maknae, which makes the relationship work.  The way Jungkook is positioned on the swing-set looks like he is falling (both physically and symbolically). The melting candle and him licking the wax can be tied to the myth of Icarus, who falls because of the melted wax on his wings. When he is licking the wax he is actually off the swing, which could symbolize his fall. Jungkook “falls” because he has consumed the melted candle wax, which represents temptation. bonus: this is from a later scene that doesn’t really have any significance to this analysis except the fact that it shows Jungkook and Rapmon together again  J-HOPE & MICHELANGELO’S PIETA  Next, we see J-Hope in front of Michelangelo’s Pieta, which shows the Virgin Mary holding the dead body of Jesus Christ following his crucifixion and removal from the cross. If you’ve listened to the Wings album you know that J-Hope’s solo song is titled “Mama” and is about his mom (there are also ties here to Demian with correlations to the character of Frau Eva, Demian’s mother in the novel. But like I said before I didn’t read Demian so you’ll have to refer to the previous replies for clarifications there). This is yet another Biblical reference in the music video. BTS, THE APPLE, AND JIN HEARING SOMETHING   Later on, all of the members are seen gathering at a table in what reminds me of The Last Supper by Leonardo da Vinci (The Last Supper tells the story of Jesus Christ and the distress amongst his Twelve Disciples after it was announced one of them would betray him). Anyways, they’re seen all with a single apple on their plate. The apple is a famous symbol of sin in the biblical story of Adam and Eve where Eve eats the forbidden fruit from the Garden of Eden. And the scenery of the set does look like some sort of garden. In the last of the three photos above, you can see that the boys are all raising their cups to pledge something, but what are they pledging to? Given that the apple is on their plate and they’re ready to eat, it is hinted that they’re all ready to commit to the sins of adulthood together by eating the apple together.  Just as Jin is about to raise his cup/pledge it seems as if he heard something, like a voice calling to him. At this point we are not really sure what it means but it adds on to the idea of Jin falling to temptation because whatever it is that called to him has captured his attention. J-HOPE & V: THE ARROW  So after some research, I came across this verse from Psalm 21:12 of the Bible: “For You will make them turn their back; You will aim with Your bowstrings at their faces.” I thought this was pretty interesting in relations to the video. I don’t know if BTS/production team went as far as basing this entire scene from this verse, but the connection is pretty clear. J-Hope shoots an arrow at V, which lands at his face and splatters the colored liquid everywhere (“You will aim with Your bowstrings at their faces”) I will discuss the other part of the verse (“For You will make them turn their back”) in a bit to maintain things in a chronological order. JIMIN & SUGA: BLINDFOLD AND THE APPLE   Here we see more of the relationship between Jimin and Suga. Again, the apple is used as a symbol of sin and I have some photos from the Wings photoshoot to illustrate this further (bonus: Jimin’s solo track “Lie” is also heavily influenced by the Adam and Eve story). Suga has a blindfold, seemingly for Jimin. This will be discussed later. V FALLING & LANDSCAPE WITH THE FALL OF ICARUS  Here is where things start to get really interesting. We have V sitting on the ledge of a balcony (where he was seen in the beginning sitting at and looking up and down) and he looks back at you, cracks a mischievous grin, and jumps willingly. And in front of him is a big painting: Landscape with the Fall of Icarus, also by Bruegel. The painting shows a spectacular scenery of the sea, but when you look closely, you can see that there are a pair of legs struggling in the sea on the bottom righthand corner. That’s supposed to be Icarus after he falls. So we have this reoccurring motif of Icarus. We saw his death earlier and now we are witnessing his fall. Since I already interpreted Jungkook as Icarus, I won’t also analyze V as Icarus. Just keep in mind that V willfully falling, even enjoying it, is a very important factor in the story of BST. BLINDFOLDED JIMIN WITH JUNGKOOK & FEATHERS  So now we see Suga blindfolding Jimin and he stumbles around the room. Since the apple is nowhere in sight we can assume that Jimin has eaten it, and after he ate it, he’s “lost his way” (wink wink reference) and has fallen into temptation. And I also have another photo of Jungkook floating without the swing (the swing = youth; his youth is also gone) now, and he’s got falling feathers all around him, adding to the idea that he represents Icarus. JIN & THE BALLOON – GIVES INTO THE TEMPTATIONS  Throughout this video Jin has looked pretty conflicted; if you recall the beginning when he’s looking at the painting, he’s got a focused look that’s like “wow this is kind of cool??!” as well as confused. Like he doesn’t really know why he’s drawn to it but he is. And remember when he was at the dinner table with everyone but he gets distracted by something? My interpretation is that Jin is conflicted between wanting to stay blissful to the sweetness of youth, but he keeps getting distracted and enticed by “sinful callings.” This struggle is resolved with this scene of Jin and his balloon. The balloon represents his innocent youth; he’s quite literally holding on to it. He’s not sure if he wants to let go. Then, later on, during the cut with Rap Monster’s narration, we see that Jin has finally let go of the balloon. The balloon is already out of frame when he reaches up towards it, possibly regretting his choice. Remember, everyone else has already given in to the different forms of enticement (Jimin with the apple, V with falling, Jungkook with the wax, etc.) Jin is the last one to fall. FINALE: JIN & V – V AS THE FALLEN ANGEL WHO SEDUCES JIN, THE KISS Suga plays the organ and it is seen that all the boys in their respective pairs exit the museum, except Jin has stayed behind and V has noticed. Jin seems to be looking at/for something, and V shows up with yet another playful look and covers his eyes.  When V removes his hands and Jin opens his eyes, a mysterious statue with large, black wings has appeared and looks like it’s ready to take off.    So in the end, V, who’s been kind of elusive in the story, is revealed to have scars where wings are supposed to be. I believe this statue is V. The way the scenes cut support this theory, because as the cloth covering V is revealed Jin is approaching the statue, and as he kisses the statue the figure under the cloth with the scars on his back is revealed to be V. A kiss often means the sealing of a contract; this means that Jin has officially fallen and “signed a contract” with V the fallen angel and has lost his innocence. The correlation is pretty strong here. Given all of the biblical references and the way V jumps off the ledge earlier supports the idea that V is, indeed, the fallen angel that tempts Jin. And this is where the verse from Psalm 21:12 comes into play: “For You (referring to J-Hope with his bow&arrow) will make them turn their back; You will aim with Your bowstrings at their faces.” V has turned his back quite literally and has also figuratively turned his back on Jin, who did not suspect V to be a tempter. Bonus:  That’s all! I didn’t analyze the video fully till the end, but I really just wanted to focus on the temptation/art portion of the video. And this is already a really, really long post. I spent 3 hours typing this and finding all of the images, lol. Well, I hope you enjoyed this super detailed analysis!! I sure enjoyed writing it. :) ",
            "date": "Updated February 25, 2017",
            "views": "239",
            "upvotes": " View 1.9K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thanya Franklin",
                    "user_href": "/profile/Thanya-Franklin"
                },
                {
                    "user_id": "Flavia Hammer",
                    "user_href": "/profile/Flavia-Hammer"
                },
                {
                    "user_id": "Rohini Sounder",
                    "user_href": "/profile/Rohini-Sounder"
                },
                {
                    "user_id": "Teju Kelhe",
                    "user_href": "/profile/Teju-Kelhe"
                },
                {
                    "user_id": "Rihana Doley",
                    "user_href": "/profile/Rihana-Doley"
                },
                {
                    "user_id": "Sanyukta Uchil",
                    "user_href": "/profile/Sanyukta-Uchil"
                },
                {
                    "user_id": "Ritika Saha",
                    "user_href": "/profile/Ritika-Saha-35"
                },
                {
                    "user_id": "Yerin Kangman",
                    "user_href": "/profile/Yerin-Kangman"
                },
                {
                    "user_id": "Maria Sheikh",
                    "user_href": "/profile/Maria-Sheikh-51"
                },
                {
                    "user_id": "Akansha Singh",
                    "user_href": "/profile/Akansha-Singh-880"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuna Wolf",
                "href": "/profile/Yuna-Wolf"
            },
            "answer_text": "In the beginning of this, the younger boys are with a older member suga and jimin have a bike or slingshot and Jhope has a small telescope. Rap Monster is reading a book to Jungkook. I'm going to assume that he's reading 'Demian: The Story of Emil Sinclair's Youth' by Herman Hesse, since the quotes Rap Monster read in the Wings short films (and later in this MV) are from 'Demian'. Later in this MV Rap Monster reads another quote from the book: \"He too was a tempter; he, too, was a link to the second [world], the evil world with which I no longer wanted to have anything to do.\" In 'Demian' this is a quote in which Sinclair thinks about Demian who is a friend and mentor to Sinclair. The story of Sinclair and Demian makes me think about how BTS have been paired off (a younger member with an older mentor-like member). 1. Jungkook and Rap Monster 2. Jimin and Suga 3. V and J-Hope If you truly want to uncover all the symbolism in this new mv and the short films, I urge Armies to read 'Demian', as it's all very complex to talk about here... You can read 'Demian' online here. [If you don't want to know about all the statues, scroll down until you see a screenshot of Jin looking at that big painting.]  Next we have V and J-Hope who are admiring a statue. I was unable to find the original but my art background tells me that it looks an awful lot like a Four Seasons statue of Autumn. Four Seasons statues are a sculpture set of four pieces, one for each of the Seasons. The Autumn sculptures of Four Seasons sets are usually depicted with a goblet in hand and grapes, or another such autumn harvest in the other hand. Autumn is a time of transition during which wine is typically made (grapes mature into wine, which has often been associated with intellect). The statue to the right (torso and head) is a torso extract of the famous sculpture 'Laocoon and His Sons' which is put forward as being the icon for complete suffering and agony. The statue behind the Autumn sculpture seems to be an extract of 'Marble Statue of a Youth' which is a Roman copy of a Greek sculpture that represents Youth (ties in nicely with BTS, doesn't it?). We'll get to the bronze statue in a bit, where we can see it better, but first let's take the remaining statues.  When they first enter the Museum we can see the many statues and to the very left of the room is another famous one. 'Venus de Milo' by Greek sculptor Alexandros of Antioch-on-the-Meander is a statue of Venus. It is thought that originally Venus held the Apple of Discord up in her left arm. The Apple of Discord was a gold apple that gave eternal beauty. Three goddesses fought over this Apple and that started the Trojan war, which is why it's called the Apple of Discord. So we have Youth, beauty and an Apple, which tie in well with everything else.  Here we see Suga and Jimin with a statue and it's not just any statue. The statue represents a crouching Venus, surprised in her bath. There are many versions of this motif. This piece is called 'Vénus Accroupie' by an unknown artist found in the French King Louis XIV's collection. Venus is a Roman goddess often associated with love, fertility, seduction and desire. She is also a mother figure who is said to be the mother of the Roman people. It is precisely desire and motherhood that I see as the important symbols from this considering the other symbols we'll discuss in this MV.  There is one last statue in this room that we need to mention. This is the sculpture 'Perseus With the Head of Medusa' by Benvenuto Cellini. It presents Perseus winning over Medusa who had hair made of snakes that could turn any man into stone. In the context of this MV I would put importance to this as a symbol of overcoming evil and also of exposing that evil doesn't last forever (or rather that evil and good go hand in hand, as one cannot truly exist without the other).  Here we have a painting that many bright Armys have recognised as 'The Fall of the Rebel Angels' by Pieter Bruegel the Elder. This introduces the theme of fallen angels which continues throughout the MV. It is interesting to note that the fallen angels in this painting are also partly beastly and half human and half demons or monsters. The classical piece of music that plays in the background here is Bach's 'Mass in B minor'. We might also note that there is a door on either side of the painting. One white and one black.  Uh the music is about to start! They are assembled in a room and Suga covers Jimin's eyes. This symbolism is repeated later and I'll treat it then. In the background there is a neon sign with English writing. Only part of it shows, but I believe it says: \"The Tempter\" which would tie in with the quote from 'Demian' that Rap Monster recites in the MV. Behind the Neon lights is the painting of 'The lament for Icarus' by H. J. Draper. Icarus was trapped on Crete with his father who made wings out of feathers and wax for them to escape. His father warned Icarus not to fly too low so the humidity from the sea would not ruin the wings and also asked him not to fly too high so the sun would melt the wax that kept his wings together. Icarus ignored his father's warnings and flew too close to the sun. The wax melted his wings off and Icarus fell to his death. This painting is famous for depicting Icarus with his wings intact and beautiful, even though the legend states that the wings were ruined and fell off when the wax melted. Out of all the paintings of Icarus that they could have chosen, I believe there is some significance in the fact that they chose this one.  Here we see Jungkook in the same room as they all were earlier. Here he is on a swing and seems almost like he is flying, and later in the MV he really does fly (or levitate). This refers back to 'Demian' that Rap Monster reads to Jungkook. In the book Sinclair says that he is afraid of dreams in which he is able to fly. Pistorius who is a mentor figure to Sinclair and an organ player (like how Suga plays the organ later) tells Sinclair that this fear Sinclair has of his flying dreams \"It is the feeling of being linked with the roots of power, but one soon becomes afraid of this feeling. It's damned dangerous! That is why most people shed their wings and prefer to walk and obey the law. But not you. You go on flying. And look! You discover that you gradually begin to master your flight [...] Lacking that, you would be drawn up to the heights, powerless - which is what happens to madmen.\" Guys did you see that? Sinclair' organ-playing mentor, Pistorius, indirectly tells him about Icarus! It's all beginning to come together.  Here we have Rap Monster with a green liquid. The liquid is called Absinthe, or the green fairy. It's a hallucinogenic alcohol. It's prepared by putting a spoon over a glass of Absinthe and melting a sugar cube on it (traditionally with a candle like Rap Monster does). Absinthe was a very popular drug for writers in Paris in the 1900s and when you look at Rap Monster's room it seems to belong in the same era. There are books all around and remember that Rap Monster is the one who always reads aloud. He is the writer in this story. Likely he is Herman Hesse, the author of 'Demian' who lived from 1877 to 1962, exactly during the time at which Absinthe was commonly consumed by writers all around Europe.  Later in the MV Rap Monster (presumably) gives the tempting drug of Absinthe to Jungkook. He tempt Jungkook to the dark side (Boy Meets Evil).  We get an image of a painted bird which ties back into 'Demian' (and the short films). In 'Demian' Sinclair paints a bird..: \"I had painted something, a bird struggling out of the globe. I sent him this painting. After a time I found a piece of paper with the following words written on it: 'The bird fights it's way out of the egg. The egg is the world. Who must be born must first destroy a world. The bird flies to God. That God's name is Abraxas.' [..] We may conceive that the name [Abraxas] as that of a godhead whose symbolic task is the uniting of godly and devilish elements.\" This might sound a little complicated right now, but it's the main theme and by the end it'll make sense. Rap Monster and Jungkook's room full of green smoke also comes into Suga's room, which is directly above Rap Monster and Jungkook's room, and the green fairy smoke affects him too. Now we have J-Hope who sits with an arrow (I know some people have been saying a sword, but if you enlarge the image you can clearly see feather fletchings on the arrow). Behind him is Michelangelo's famous sculpture 'Pieta' which depicts Virgin Mary with the dead body of her son Jesus after his crucifixion before he was placed in his tomb. It is worth noting here that the face and upper body of Jesus has not been carved, although it has in the original work. This seems to be symbolism for Jesus still being under construct. BTS are in the process of choosing their path and are hence under construction themselves. J-Hope later fires off his arrow. This suggests that he is the destroyer of evil (like Perseus destroyed Medusa, remember that sculpture?) His arrow hits V and multi coloured blood splashes out (like at the end, and we'll get to that). He sits in a Roman Bath. In Roman culture the bathhouse was a place where one would go to have a conversation. It was more than a simple cleansing, it was a place where decisions were made. This is where J-Hope makes the decision to oppose V. Remember that J-Hope and V were paired up together at the release of the photos? J-Hope is the mentor figure to V, but he sees that V goes to far and comes to the Roman Bath to think. Here he takes the decision to end it all. And to act like Perseus and rid the world of V's evil. They all assemble for a supper. This seems likely to be a reference to The Last Supper, which took place before Jesus' crucifixion. Thanks to Lulu for correcting me on the specifics of the last Supper. They are as follows: At this supper Jesus predicts that he will be betrayed by someone seated at the table (this turns out to be Judas) and also predicts that Apostle Peter will deny knowing him in the morning. Jin sits at the head of the table and hence represents Jesus. It is also Jin who raises his silver chalice to give a toast. If Jin is Jesus then V seems likely to be Judas, the one who will betray Jin. (Remember the Virgin Mary with Jesus statue? Jesus was not fully cut out as he was still developing, as Jin is!) There is nothing to eat on the table apart from one apple on each of their plates. Apples often represent wisdom. In reference to Christianity they are often said to be fruits that Eve bites into in Paradise. To eat a fruit from the tree in Paradise is said to give knowledge, both of good and evil. At the supper the boys are all presented with the opportunity to get knowledge of both good and evil, but no one is shown taking a bite. Except... remember those short films..? That's right. Jimin took a bite of an apple in his short film. In the MV we now see Suga and Jimin in Suga's room. Jimin, who has eaten an apple and has knowledge of good and evil, holds an apple out to Suga. But Suga doesn't want to eat the apple. He has been corrupted by the green smoke from Rap Monster and Jungkook's room (which we're being reminded is right bellow Suga's room). Suga holds out a blindfold. In the next scene we see Jimin blindfolded (presumably by Suga, just like the beginning of the MV) and tied to the room. Suga wants to shut Jimin's eyes to the knowledge he has gained through the apples. Remember that 'Demian' quote about flying earlier..? Well it might apply here. Are we to understand that Suga has tied Jimin up because he is afraid of being linked to the roots of power? He is afraid of flying and realising his true potential, just like Sinclair was. Next we see V sitting at the edge of his terrace. From this angle we see the scenery he has been looking at it, which is the painting 'Landscape with the Fall of Icarus'. At that sight V jumps and falls down, just like Icarus, because V too is missing his wings, just like Icarus, because he flew too close to the sun. Remember the other 'Demian' quote from earlier? (\"I had painted something, a bird struggling out of the globe. [..] The bird flies to God.\"), which is in the heavens and close to the sun. Icarus (V) flew too far up, too close to the sun, and for this reason he falls (into darkness). On a side note, this is the same painting that is in the wall to the right in the room where Jungkook flies, where the painting of Icarus with the perfect wings also hangs. Suga plays the organ, taking on the role of Sinclair's mentor, Pistorius. Jimin: THE Bias Wrecker Kindly pointed out the piece Suga plays as well as a passage from 'Demian' that I'll get into now: This is a passage from 'Demian' where Sinclair talks about his new mentor the organ player and philosopher Pistorius: \"And for our next meeting he had promised to play an exquisite piece of old music, an organ passacaglia by Buxtehude.\" A-ha, it is precisely this piece that Suga plays on the organ: Passacaglia in D minor by Buxtehude. Another direct connection to 'Demian'. The boys are running out of the museum, all except for Jin, who lingers behind. V approaches him and covers Jin's eyes (like Suga covered Jimin's eyes to the knowledge). When V removes his hand (Jin's blindfold), Jin sees what's really there. Jin sees a large statue with black wings. Meanwhile the veil that has covered V throughout this MV is lifted and his back is exposed. We see two black marks from where his wings were attached. V has jumped off the terrace (without his wings), like Icarus, and just like the painting in the room from the beginning (and in which Jungkook flies) the Wings are intact here, on this statue. We should note that the wings are black and this goes nicely with the lyrics which state that the wings were that of evil (or the devil). Let's recall Rap Monster's 'Demian' quote that he recites a few moments before this: He too was a tempter; he, too, was a link to the second [world], the evil world with which I no longer wanted to have anything to do.\" Now Jin approaches the winged statue. As he approaches we see a bust in the background, to the left of the mirror. The bust is a famous bust of the goddess Artemis, goddess of hunt and, perhaps more importantly protector of young girls and goddess of virginity. Jin kisses the statue. Again this might connect with 'Demian'. In the last chapter of the book we witness a kiss as Sinclair parts with his mentor Demian, who we learn is a part of Sinclair himself, and not a real person. In this scene, when Demian reveals that he resides within Sinclair, he tells Sinclair: \"'Frau Eva said that if ever you were in a bad way I was to give you a kiss from her that she sends by me...Close your eyes Sinclair!' I closed my eyes in obedience. I felt a light kiss on my lips where there was always a little fresh blood which would never go away.\" This is Jin, acting as Demian (on behalf of Frau Eva) and kisses the statue (Sinclair, who might also be V). In the comments Lulu pointed out to me that Judas betrays Jesus with a kiss. Remember a little earlier at the supper when I said that Jin was like Jesus and V was like Judas? What if this comparison goes deeper? Judas identifies Jesus for the soldiers who searched for him by means of a kiss, and hereby betrayed Jesus - with a kiss. What if Jin here identifies V as the winged and fallen Icarus by means of a kiss, in the same way Judas identified Jesus? Now this is where things really come together. Colours are exploding all around J-Hope. He sits and looks defeated because earlier in the MV he shot an arrow at V to defeat evil, but V still managed to get to Jin. The statue Jin kissed begins to weep and bleed in different colours, and so does Jimin as his blindfold is removed. Now that the blindfold is removed the knowledge of good and evil is all that remains and this is why the next few things happen, because the fabricated world of paradise can no longer exist with this new knowledge. Jin approaches a mirror. Above it is a German phrase by philosopher Friedrich Nietzsche that translates to: \"You still have to have Chaos inside you in order to be able to give birth to a dancing star.\" This is when the statue of the weeping Virgin Mary that was behind J-Hope falls to pieces. In the lore Virgin Mary is pure and good, but she gave birth to a dancing star (Jesus), and hence she has to have Chaos inside her. This ties into our quote about the egg from 'Demian' earlier; \"The bird fights it's way out of the egg. The egg is the world. Who must be born must first destroy a world.\" The illusion of paradise is broken, by Abraxas, the god who symbolises both good and evil. The realisation that there is evil in the world, and inside us all, tears the world apart. Its_Cx Pointed out that as Jin approaches the mirror the reflexion is entirely black, which again links into Jin acknowledging the truth of Abraxas, and the evil within himself. Next to the mirror there are some flowers. The first are Lillies. A Lily flower is often associated with birth and motherhood. K kindly commented and said that the other flower might be Liatris (well found!). This ties in really well too! A common name for Liatris is: blazing star (sound familiar? Like a dancing star?) the flower is often given as a romantic gift and signifies a desire to try again (this fits in really nicely, doesn't it?). A flower that signifies birth and one that signifies trying again, this all points to Jin being reborn after opening his eyes to the knowledge of both good and evil. But the theory goes even deeper, with the flowers! Now pay attention. JiminJimout pointed out that the flower vases are the same and they are too close together and are missing reflections, which means that the reflection of the lily in this mirror is the Liatris! Now in literature and art, looking into a mirror is often a way for characters to realise a truth about themselves or a way for them to look inwards into their own minds. The fact that the flowers are different on either side of the mirror, in my opinion, signifies that Jin is looking into another world; \"the other realm, the evil realm, with which I no longer wanted to have anything to do.\" Remember this quote? It's what Rap Monster recites in the MV! The quote recited over an image of Jin who starts to realise where he is. In the MV Jin is in the evil world and when he realises this, he also doesn't want to have anything to do with that realm. When he looks into the mirror he sees Abraxas' first realm (the good one), but over there his face is being torn apart, because Jin can no longer live in just one of his realms, since he has gained the knowledge of both good and evil, he can only live in a mixture of the two! Jin is the mother figure, like Virgin Mary in that he represents what is pure and he wants to unlock his full potential and fly. He wants to shape the Jesus in the sculpture, but to do this (to give birth to a dancing star), he has to have chaos inside him and this comes through when he kisses the statue. Chaos erupts. When Jin looks into the mirror, his own face is falling apart, just like that of the Virgin Mary statue. There is a lot of comparison and similarities but if you watch blood sweat and tears what does it all mean by don’t worry I’m not afraid then you will find more of the answers. This required a lot of study’s on YouTube and 20 mins in each scene of the song. Hope this helped. -Sophie P.S my hands are numb from type it in a glass screen. And I’m in school so if no one read this I’m gonna cry ",
            "date": "Answered June 17, 2019",
            "views": "13",
            "upvotes": " View 110 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teju Kelhe",
                    "user_href": "/profile/Teju-Kelhe"
                },
                {
                    "user_id": "Kayla Annisa",
                    "user_href": "/profile/Kayla-Annisa"
                },
                {
                    "user_id": "Malvika Mahay",
                    "user_href": "/profile/Malvika-Mahay"
                },
                {
                    "user_id": "Ma. Liane Claudette Bote",
                    "user_href": "/profile/Ma-Liane-Claudette-Bote"
                },
                {
                    "user_id": "Christina Mariam",
                    "user_href": "/profile/Christina-Mariam"
                },
                {
                    "user_id": "Kelly Lim",
                    "user_href": "/profile/Kelly-Lim-108"
                },
                {
                    "user_id": "Prathima Prathima",
                    "user_href": "/profile/Prathima-Prathima-15"
                },
                {
                    "user_id": "Ashika Nazrin",
                    "user_href": "/profile/Ashika-Nazrin"
                },
                {
                    "user_id": "Jasmine Flores",
                    "user_href": "/profile/Jasmine-Flores-276"
                },
                {
                    "user_id": "Harshni Priya",
                    "user_href": "/profile/Harshni-Priya-1"
                }
            ]
        }
    ]
}