{
    "title": "What is the best drum set for rock, for the money? - Quora",
    "tags": [
        "Drumming",
        "Drums",
        "Rock Music",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Orban",
                "href": "/profile/Don-Orban"
            },
            "answer_text": "I’m no pro, and I’ve owned around 5 kits over the last 20–30 years. I started playing in college and am self-taught. I guess what I play would fall into the “rock” category, so here’s my take… The things that have been most important to me are the heads and the tuning. I’ve used a “drum dial” in the past before I tuned more by ear and it helped get the sound pretty consistent across all the drums. I’ve played sets that are wrapped in plastic (cheaper) and now have a solid maple ddrum kit that I like. My take would be to worry less about the actual drum shells and focus on these items… Make sure the hardware is good and won’t strip out if you’re setting up and breaking down a lot (playing out)Get good cymbals for the style you’re playing (Ziljian A’s or Sabian AA’s for example)Get good heads, change them as needed and work on getting top and bottom heads to resonate for the sound you want or the room you play inI guess that’s it. HTH. ",
            "date": "Answered August 13, 2018",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jared Willis",
                "href": "/profile/Jared-Willis-19"
            },
            "answer_text": "Some of the most common brands of drums played by popular rock players are Tama and Ludwig. Almost every major drum manufacturer makes drum sets that could be “rock” setups. I play Yamaha drums, and I love them for rock, pop, funk, and just about anything else. It’s more about the sizes of drums, the shell materials, and the head choices than the brand. A common “rock” setup would be: 22″ bass drum, 5.5 x 14″ snare drum, and at least a 12″ rack tom and 16″ floor tom. If you like more toms, you can add in a 10″ rack tom and a 14″ floor tom as well. Maple and birch are some of the most common shell materials for rock drums. The Tama Superstar Classic (maple) and the Yamaha Stage Custom (birch drums) are 2 great options to get you started. Both are under $1,000 and are quality instruments that you’ll own for a lifetime if you take care of them. ",
            "date": "Answered May 29, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Nelson",
                    "user_href": "/profile/Scott-Nelson-204"
                },
                {
                    "user_id": "Eduardo Bruschi Cardoso",
                    "user_href": "/profile/Eduardo-Bruschi-Cardoso"
                },
                {
                    "user_id": "Ken Youmans",
                    "user_href": "/profile/Ken-Youmans"
                }
            ]
        }
    ]
}