{
    "title": "Whatever happened to the 60s rock group The Seeds after their hit single “Pushin’ Too Hard”? - Quora",
    "tags": [
        "1960s Music",
        "Rock and Roll Music",
        "1960s",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Cateris",
                "href": "/profile/Steven-Cateris"
            },
            "answer_text": "The Seeds continued to record after “Pushin’ Too Hard” made the United States Top Forty in 1966. Of their later singles, only a re-release of “Can’t Seem to Make You Mine” in 1967 came anywhere near the Top Forty. They made appearances on the television show ‘The Mothers-in-Law’ and the 1968 film ‘The Psych-Out.’ In 1967, they recorded a blues album under the name ‘A Full Spoon of Seedy Blues.’ In 1968, the band changed its name to Sky Saxon and the Seeds. The band continued to exist until 1972. Lead singer Sky Saxon was involved in Ya How Wha, a religious organization that also released music, and was involved in the Ya How Wha-related album ‘Golden Sunrise.’ Saxon also recorded solo albums. By the Nineteen-Eighties, Generation Jones and Generation X musicians were citing the Seeds as a major influence, and inviting Saxon to collaborate on their albums. Sky Saxon resurrected the Seeds to perform on the Summer of Love tour in 1989, but disbanded them again after the tour finished. In 2003, Saxon resurrected the Seeds again, and various versions toured until Saxon’s death in 2009. In 2014, the band was the subject of the documentary ‘The Seeds: Pushin’ Too Hard.’ In 2017, founding member Daryl Hooper founded a new version of the band to tour the heritage rock and roll circuit. ",
            "date": "Answered June 1, 2020",
            "views": "725",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Heine",
                    "user_href": "/profile/James-Heine-1"
                },
                {
                    "user_id": "Greg Raines",
                    "user_href": "/profile/Greg-Raines-3"
                },
                {
                    "user_id": "Edmund Grondine",
                    "user_href": "/profile/Edmund-Grondine"
                },
                {
                    "user_id": "Gary Saunders",
                    "user_href": "/profile/Gary-Saunders-52"
                },
                {
                    "user_id": "Gary McAdam",
                    "user_href": "/profile/Gary-McAdam-2"
                },
                {
                    "user_id": "Steve Leonard",
                    "user_href": "/profile/Steve-Leonard-67"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary McAdam",
                "href": "/profile/Gary-McAdam-2"
            },
            "answer_text": "At the risk of repeating myself, the answer to a lot of these questions seems to be “they had their moment in the sun and then faded away…..” In this case, they did manage to have a number of further minor hit singles (″Mr Farmer, “Can’t Seem to Make You Mine” and “A Thousand Shadows”) after that, whilst their third album “Future” (released in 1967) has become regarded as something of a pioneer for the psychedelic rock movement of the late 60s & early 70s. Lead singer Sky Saxon kept the band name going until 1972, after which they officially broke up (though the resourceful Mr Saxon would continue to release solo material under variants of the Seeds name until well into the 1980s). They were briefly revived in 1989 for a successful tour alongside other sixties hit acts (Big Brother and the Holding Company, Love, The Music Machine & Strawberry Alarm Clock) and once more in 2003, with Saxon joined by original guitarist Jan Savage and a number of new members. They would continue to work the heritage circuit until Saxon’s death in 2009 at the age of 71. A further incarnation of the band featuring Savage and fellow founder member Darryl Hooper (keyboards) reformed in 2017 and are still touring to this day. Many of their songs meanwhile have been covered by bands/artists as diverse as Garbage, The Smashing Pumpkins, The Electric Prunes, Yo La Tengo, Iggy Pop and The Bangles. The Seeds - Wikipedia ",
            "date": "Answered June 16, 2020",
            "views": "300",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Heine",
                    "user_href": "/profile/James-Heine-1"
                },
                {
                    "user_id": "Gary Saunders",
                    "user_href": "/profile/Gary-Saunders-52"
                },
                {
                    "user_id": "Scott Martin",
                    "user_href": "/profile/Scott-Martin-481"
                }
            ]
        }
    ]
}