{
    "title": "What songs can't you listen to? Why not? - Quora",
    "tags": [
        "Listening to Music",
        "Listening",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trini Cariaga",
                "href": "/profile/Trini-Cariaga"
            },
            "answer_text": "I don’t really have specific songs I can say I don’t like to hear…and I usually can enjoy songs from any genre. But I do have “guidelines” for each song I listen to, on a song-by-song basis: Songs with cussing (I don’t mind d—n and h-ll so much, but dropping f bombs, or saying b—ch, s--t, and slurs really gets on my nerves).Songs to glorify sex/lust (like the ones about going to the club just for sex or how good sex with some girl is or how good it feels—as a demisexual christian person I get nothing out of this anyway other than being grossed out lmbo).Songs that glorify self-love (not motivational/inspirational “I/you can do this” type songs, but the ones that are like “I’m the greatest in the world and no one else matters. I’m better than everyone.” songs that encourage arrogance and self-centeredness).Songs that glorify or mention drugs/alcohol use (I don’t mind it in some cases, if it’s mentioned they are drinking beer or something in the song… but I hate songs solely about drinking or a certain type of alcohol… and I can’t tolerate any songs about drugs).Songs that glorify material possessions and wealth (the ones bragging about nice jewelry and expensive clothes or how great life is having 40 Beemers in the garage, making it seems as if having wealth is the definition of “making it”, when it’s the furthest thing from it lol)…yeah that’s about it. Other than that, I’m pretty game for any song and don’t have any guilty pleasure tunes. ",
            "date": "Answered August 19, 2017",
            "views": "190",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Kuhn",
                    "user_href": "/profile/David-Kuhn-41"
                },
                {
                    "user_id": "Tommy Wimmer",
                    "user_href": "/profile/Tommy-Wimmer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Zachary",
                "href": "/profile/Evelyn-Zachary"
            },
            "answer_text": "Ice Ice Baby. Now don't get me wrong, it's an okay song. It was my jam a few years ago. I would bust out this song any chance I got. But now I refuse to even listen to it. Let me explain. I got really into the band Queen about a year ago. If you don't know, Queen has this song called “Under Pressure,” which they produced along with David Bowie. Under Pressure is a good song. So good, even, that rapper Vanilla Ice chose to use the iconic bassline from it without permission. I get it, it happens a lot in the music producing world, but this instance still triggers me. Eventually Vanilla Ice was involved in a lawsuit regarding copyright and all that jazz, but he was still allowed to sell the song. I remember once when I was rapping Ice Ice Baby for my uncle, and he played the song in the background while I sang. The song started, and I thought everything was all good. Until the first lyrics played. It wasn't Ice Ice Baby; my uncle was playing Under Pressure to purposefully confuse me. I was so disoriented. I felt so violated! I had no idea what Queen or David Bowie was, and I had no idea what this disgraceful song was. But now I know. And now every time I hear Ice Ice Baby, that just plain unoriginal song, I feel a pang of rage. . . Your f(r)iend, Evelyn ",
            "date": "Updated January 3, 2020",
            "views": "96",
            "upvotes": "0"
        }
    ]
}