{
    "title": "What makes a music beautiful? - Quora",
    "tags": [
        "Music Industry",
        "Beauty",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arnold Gregory",
                "href": "/profile/Arnold-Gregory"
            },
            "answer_text": "Short answer Someone to play and someone who perceives it as beautiful makes sounds beautiful. In the Dordogne caves in France a flute made of an animal bone was found. This cave had been buried and undisturbed for 30 thousand years according to archeologists. It seems music has been a human instinct for a long time. Today we choose music from a vast sea of options to suit our mood. However, a vast majority of humanity over the ages had little access other than singing, chanting, and crude drums. Many probably lived and died and never heard any instrumental music. To a peasant toiling most days outside the hour of a church organ on Sunday must have sounded like heaven. To a hunter in a cave before the last ice age a little bone flute must have seemed like magic. To me the most astounding thing about that prehistoric flute is that you could play a modern pentatonic scale on it. Longer answer. We have learned from modern physics that our existence is pretty strange. Everything is made of atoms and atoms are .9999999999999… empty. Everything, including us, is just focused vibrating energy. I find it interesting that my acupuncture doctor (I call her my che whiz) tells me there 7 chakras or energy centers emanating from our bodies. We visually only perceive a tiny part of the electromagnetic spectrum and see 7 colors. And since the unknown past we seem to instinctively gravitate toward a 7 note scale. It is based on logical increments like the octave that doubles the frequency. This 7-note scale and the harmonies derived from it have taken the world by storm. We have divided the octave into 12 steps we call semitones. All western instruments are designed to utilize whole tones and semitones. Clearly to most ears harmonies derived from it are beautiful. When a note is out of tune it is not beautiful. We can analyze these frequencies and harmonies that resonate with human ears, but why they resonate is still a mystery. Why do major and minor keys evoke different emotional responses? Why does fast music make us want to dance, slow music makes us want to think, meditate, chill? Ultimately, as they say in art, beauty is in the eye of the beholder. Music beauty is in the eye of the listener. For most people, the more they listen the more they adapt and appreciate more complex sounds, harmonies and rhythms. What we perceive as beautiful changes with experience. Renaissance music was crude by todays standards. Some harmonies were forbidden by the church or only performed by priests. The development of classical music went through several periods of increasingly complex harmonies. Mirroring visual art, music artists propelled past the emotional into the abstract. Also like the visual arts abstraction is not always beautiful to all eyes and ears. The atonal impressionism of Schoenberg for example takes some getting used to. Many will never will. When bebop jazz was being explored in the 1940s the use of intentional dissonance in improvization sounded harsh and not so beautiful to many listeners. Now after decades of listening music of Charlie Parker, Dizzy, Miles seems a little quant and dated but to me beautiful. If you like it, it is beautiful. But don’t expect everyone to like the music you do. ",
            "date": "Answered August 25, 2017",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eitan Amir",
                    "user_href": "/profile/Eitan-Amir-2"
                },
                {
                    "user_id": "Hannelore B",
                    "user_href": "/profile/Hannelore-B"
                },
                {
                    "user_id": "Dale N Reynolds",
                    "user_href": "/profile/Dale-N-Reynolds"
                }
            ]
        },
        {
            "author_info": {
                "name": "David D'Agostino",
                "href": "/profile/David-DAgostino"
            },
            "answer_text": "We may never find a completely satisfactory answer to the question of what makes music beautiful.  Victor Hugo said, “Music expresses that which cannot be put into words and cannot remain silent.”   Robert Jordain concludes his book Music, the Brain, and Ecstasy, with some thoughts on beauty and music.  The experience of unsullied order persisting simultaneously at every perceptual level may be taken as a working definition of the word “beauty.”  When events in everyday experience come together perfectly, we’re apt to exclaim “Beautiful!” and to register the pleasure of anticipations perfectly met.Many people say that it is beauty alone that draws them to music.  But great music brings us even more.  By providing the brain with an artificial environment, and forcing it through that environment in controlled ways, music imparts the means of experiencing relations far deeper than those we encounter in our everyday lives.  When music is written with genius, every event is carefully selected to to build the substructure for for exceptionally deep relations.  No resource is wasted, no distractions are allowed.  Thus, however briefly, we attain a greater grasp of the world (or at least a small part of it), as if rising from the ground to look down upon the confining maze of ordinary existence.~ Robert Jordain, Music, The Brain, And Ecstasy: How Music Captures Our ImaginationSome researchers have proposed that composers such as Debussy and Bartok used the Fibonacci sequence or golden mean (which have been associated with physical beauty) in their music, but those views have been largely discounted.  See http://bit.ly/cWGMXK.Studies have shown intrinsic emotional qualities in music that are recognized across cultures.  Discovery Health reports on a study which found that that indigenous Mafa tribes from Cameroon could consistently identify emotions in Western music such as happiness, sadness, and fear.These emotional calls, along with the pleasure that music produces, can be experienced as beauty.  A group of researchers from McGill University just published a study indicating that music produces pleasure (or a musical frisson) through enhanced emotional responses and the release of dopamine: Our results provide, to the best of our knowledge, the first direct  evidence that the intense pleasure experienced when listening to music  is associated with dopamine activity in the mesolimbic reward system…One explanation for this phenomenon is that it is related to enhancement of emotions.  The emotions induced by music are evoked, among other things, by  temporal phenomena, such as expectations, delay, tension, resolution,  prediction, surprise and anticipation~ Nature.com – “Anatomically distinct dopamine release during anticipation and experience of peak emotion to music” – January 9, 2011http://bit.ly/g0POoB ",
            "date": "Answered January 19, 2011",
            "views": "99",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emma Hisses",
                    "user_href": "/profile/Emma-Hisses"
                },
                {
                    "user_id": "Jerry Nie",
                    "user_href": "/profile/Jerry-Nie-1"
                },
                {
                    "user_id": "Viola Cake",
                    "user_href": "/profile/Viola-Cake"
                },
                {
                    "user_id": "Alexandra Josephine Gulko-Hyman",
                    "user_href": "/profile/Alexandra-Josephine-Gulko-Hyman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Suqreme"
                },
                {
                    "user_id": "Kshitij Gupta",
                    "user_href": "/profile/Kshitij-Gupta-44"
                },
                {
                    "user_id": "Pranoy Dutta",
                    "user_href": "/profile/Pranoy-Dutta-2"
                },
                {
                    "user_id": "Rizwan Ullah",
                    "user_href": "/profile/Rizwan-Ullah-12"
                },
                {
                    "user_id": "Teona Clariclucio",
                    "user_href": "/profile/Teona-Clariclucio"
                },
                {
                    "user_id": "Scott Miles",
                    "user_href": "/profile/Scott-Miles-2"
                },
                {
                    "user_id": "Bryce Johannes",
                    "user_href": "/profile/Bryce-Johannes"
                }
            ]
        }
    ]
}