{
    "title": "What are the pros and cons of Yamaha Mt 15? - Quora",
    "tags": [
        "Yamaha Motorcycles",
        "Yamaha Corporation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kalachar V M",
                "href": "/profile/Kalachar-V-M"
            },
            "answer_text": "This is completely my personal experience, opinion and little bit of research. PROS: Engine: The first pro has to be the engine. How can anyone someone hate the R15 V3 Engine. It has got the best in class power (19 PS) and respectable torque(14.7 N-m) on offer. This engine loves to be revved. It has got the tech like, VVA. So, engine one of the USP. It has got better low end torque and phenomenal mid range.So, in city riding conditions it got the punch. Moreover - due to VVA technology, it provides the greater fuel efficiency if ride under 7000 rpm. Styling: Looks are subjective. Still MT-15 is one of the best looking 150cc naked on offer, currently in India. Because there are no other mass market bike in India, which looks like MT series.So, it surely turns the head, wherever you go. Ergonomics: MT-15 has very comfortable seating posture. One of the gripe that i had with R15 was the seating posture. I really mean, most of the people who buy these bikes are going to be the daily commuters, where we have leaned to handle bar and which was tire some. But, MT-15 has the better seating posture, when compared to its sibling, which is R15- V3.0. So, kudos for Yamaha, for making this happen. Features : MT-15 shares most of the cycle parts from its R15 V3. Delta box frame, slipper clutch, Instrument console-which is similar to R15 with negative colors. Quality of the materials is very nice and fit and finish feels premium.So, big thumbs-up for that as well. This one also got bi-functional LED which I feel looks best of the lot. Handling: This was no surprise, being Yamaha. With delta box frame, meaty tires - MT 15 is one of the best handler. Sure, it has not as track focused as R15, but in city riding conditions. It has better turning radius and flick-able in traffic.CONS: Pricing: I think this is where Yamaha completely failed to understand the Indian consumer mindset. In India, we (as consumer) thinks, fully - faired bikes will cost more than naked bikes.But, MT-15 is just 3,000 rupees dearer than, R15 V3.0. So, at 1.36 lakh, ex showroom(Bangalore), this more expensive than FZ25 which comes with bigger engine and more power & dual channel ABS. But, MT-15 just got single channel ABS, no USD forks, no aluminium swing-arm. I am completely ok with those, as these things will help to cut the cost down as this bike meant for the city and not for the track. But, even with after so much cost cutting they have done with the bike, they have failed to get pricing right.Colors: This is little bit subjective. Because MT Series, is very popular internationally because of their funky colors. But, in India all we got - 2 colors to choose from. If you see these bikes from distance, you cannot differentiate between - FZ25 & FZS V3. To get its proper identity, they should have offered more funky colors to choose from. Because, this bike looks unique from front and the back. But, those muted, just doesn't cut it for the styling.",
            "date": "Answered April 19, 2019",
            "views": "121",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Brock",
                    "user_href": "/profile/Adam-Brock-41"
                },
                {
                    "user_id": "Srihari H S",
                    "user_href": "/profile/Srihari-H-S-1"
                },
                {
                    "user_id": "Srijan Som",
                    "user_href": "/profile/Srijan-Som-1"
                },
                {
                    "user_id": "Bharath Krishnan",
                    "user_href": "/profile/Bharath-Krishnan-22"
                },
                {
                    "user_id": "Sandesh Hiremath",
                    "user_href": "/profile/Sandesh-Hiremath-6"
                },
                {
                    "user_id": "Atharva Kulkarni",
                    "user_href": "/profile/Atharva-Kulkarni-255"
                },
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Kiran",
                    "user_href": "/profile/Kiran-1157"
                },
                {
                    "user_id": "Bishnu Prasad",
                    "user_href": "/profile/Bishnu-Prasad-24"
                },
                {
                    "user_id": "Prabhu Vijayakumaran",
                    "user_href": "/profile/Prabhu-Vijayakumaran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akmal Faizan",
                "href": "/profile/Akmal-Faizan"
            },
            "answer_text": "Yamaha MT-15 ABS arrived in India with style, leaving everyone stunned with not just the exclusive finish, but also with over the edge pricing. The engine and styling section still stays in favor of the motorcycle.  Here are the pros and cons of buying the new Yamaha MT-15 1. Powerful Engine The 155.1cc, single cylinder engine is good for 19.3 HP and 14.7 Nm. 2. Unique Styling The styling part is the biggest challenge for MT-15 the best part of the bike is the thin tail section and more than that, the unique facial expressions. The side profile is completely inspired by the large-displacement MT series motorcycles. 3. Functional LED Headlight The LED headlight is practical and offers both high as well as the low beam projector. The magic is higher when you see the two LED daytime running lights in action as they save energy. Cons 1. No USD Forks The motorcycle comes with standard forks and the skipping of USD forks is not that great move when taking the price to such a high point. 2. Overpriced Yamaha has launched the MT-15 in India with the pricing of Rs. 1.36 lakh. The add on features from the motorcycle has made it overpriced. So, Yamaha MT-15 model is completely encouraged and influenced by the Yamaha MT-09 ",
            "date": "Answered March 22, 2019",
            "views": "57",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samrat Dutta",
                    "user_href": "/profile/Samrat-Dutta-107"
                },
                {
                    "user_id": "Prabhu Vijayakumaran",
                    "user_href": "/profile/Prabhu-Vijayakumaran"
                },
                {
                    "user_id": "Sai Mani Thrishool",
                    "user_href": "/profile/Sai-Mani-Thrishool"
                },
                {
                    "user_id": "Tariq Anwar",
                    "user_href": "/profile/Tariq-Anwar-44"
                },
                {
                    "user_id": "Atheeq Saqlain",
                    "user_href": "/profile/Atheeq-Saqlain"
                }
            ]
        }
    ]
}