{
    "title": "What are the disadvantages of higher denomination currency notes? - Quora",
    "tags": [
        "Indian Rupee (INR)",
        "Currencies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhisek Das",
                "href": "/profile/Abhisek-Das-55"
            },
            "answer_text": "Disadvantages of higher denomination currency notes are as such like : There are more chances of forgery, printing of fake notes, and duplicacy.There is also the chance of loss. Like by mistake when you lose a 2000 rupee note you at a time, then you tend to lose a lot.As per my personal experience, often, the merchants and shopkeepers do not accept higher denomination currency notes because of the fear of getting cheated or due to lack of changes of smaller denominations. It is a real hassle in real life, I believe.These days people hardly believe others, and that too when the matter of money comes……. We know that high denomination currency results in ease of corruption and weakening of banking system, however its more wide spread and more harmful impact is fake currency and its consequences e.g. weakening of official currency, most importantly this fake currency works as tool for anti-national & anti-human activities. Official investigations agencies have been reporting that alongside most of the terror attacks, it was observed that large amount of fake currency has been brought to India and was used as a tool. It is actually very simple at the same time very shocking to see how high denomination is related to fake currency and yet we are not doing anything about it. To print a fake currency note, the cost is about Rs. 30 to 40/-. So as you might have guessed, it is very easy profitable to print fake notes for the amount 1000, 500 and also 100. So having such high denomination facilitates printing of fake currency. Also there is very astonishing statistics, if you compare the availability of high denominations in other countries, in comparison of their per capita income. It is well known to all that India has unreasonably big highest denomination. Whereas majority of our population do not even use these high denominations and these are causing such detrimental impacts as corruption, weakening of banking, official economy and this ugly fake currency! Realizing the detrimental effects, such currency cut down steps had been taken in the past even by other countries from time to time, like US in 1969, they brought down their highest currency to $100. So it is very obvious that we should remove these denominations higher than Rs. 50/-. ",
            "date": "Answered November 25, 2016",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sagnik Roy",
                    "user_href": "/profile/Sagnik-Roy-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venkateswara Swamy Swarna",
                "href": "/profile/Venkateswara-Swamy-Swarna"
            },
            "answer_text": "It is more attractive to those who want to duplicate them, print fake notes. It is also good for those who want to hoard black money. It is good for those who want to bribe / accept bribe… Thus, it is a problem for honest tax paying citizens like us. Problem of change - even banks can’t help sometimes. There is always a lurking fear of demonetisation… ",
            "date": "Answered September 19, 2020",
            "views": "91",
            "upvotes": "0"
        }
    ]
}