{
    "title": "What is your opinion about Michael Jackson's accusations? - Quora",
    "tags": [
        "False Accusations",
        "Michael Jackson (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paris Boutiette",
                "href": "/profile/Paris-Boutiette"
            },
            "answer_text": " I love this question, it has me talk about my emotions. It angers me, it upsets me and most of all it hurts me. Michael Jackson is someone I can relate to on a deep level. He seemed to understand every problem/issue I’ve had. I know I will be called a freak and a weirdo for saying this but it is what it is, I have heard that so many times, that I can finally now say I am used to it. The accusations about him being a pedo are asinine and preposterous. They upset me. Recent news says that Wade Robson is making and showing to the public a movie he made called “Leaving Neverland.” Yes, I know he is hungry for Jackson’s money. It has been proven over and over again that Michael is innocent and yet he continues to say he is a victim of Michael’s. This is Wade Robson.  I cannot believe I am giving him the time of the day or spotlight right now, but to further prove my point here I go. Check the link for proof that Michael is indeed innocent. Thanks for taking the time to read this chaos. :) KillerThriller on Instagram: “(SWIPE ⬅️) SPREAD THIS POST AS MUCH AS YOU CAN‼️ If they want to air a 4 hour documentary about Michael \"molesting\" two kids who were…” A lot of love. Eiffel. ",
            "date": "Answered January 24, 2019",
            "views": "262",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrea Watts",
                    "user_href": "/profile/Andrea-Watts-23"
                },
                {
                    "user_id": "Nick Holtz",
                    "user_href": "/profile/Nick-Holtz"
                },
                {
                    "user_id": "Adeoluwa Adeoye",
                    "user_href": "/profile/Adeoluwa-Adeoye"
                },
                {
                    "user_id": "Chancelle Ngomo",
                    "user_href": "/profile/Chancelle-Ngomo"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-1829"
                },
                {
                    "user_id": "Sara Ali",
                    "user_href": "/profile/Sara-Ali-486"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek",
                "href": "/profile/Abhishek-1956"
            },
            "answer_text": "I think Michael was innocent. People conspired against him on many occasion. In the 1990s he paid around 21 million to end the case against him to that boy’s father and later when he died that boy came out and said “sorry Michael !”, His dad wanted his money. In 2003 he was proven not guilty in court but we can’t change the bias few people have about him. I’m happy with the fact that people outside of the states knows very little about this disgusting thing he faced in his life. I just feel sorry for him. Also that didn’t stopped the love he got the from the people around the world. Moreover, I think we should talk about a Person’s talent and contributions to the world and not put out nose in their personal life. If we do that, we are only wasting our time, It’s not our business whom he made wife or not. He was proven not guilty ! ",
            "date": "Answered December 15, 2018",
            "views": "149",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deboleena Aich",
                    "user_href": "/profile/Deboleena-Aich"
                },
                {
                    "user_id": "Nick Holtz",
                    "user_href": "/profile/Nick-Holtz"
                },
                {
                    "user_id": "Chancelle Ngomo",
                    "user_href": "/profile/Chancelle-Ngomo"
                },
                {
                    "user_id": "Marina Gkane",
                    "user_href": "/profile/Marina-Gkane"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-1829"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leigh Shaw",
                "href": "/profile/Leigh-Shaw-2"
            },
            "answer_text": "I don't personally have enough facts to say he's guilty or inmocent. Kids with gold digging parents will say any damn thing the parents coach them into saying. On the other hand he was weird as fuck. Who knows??? I've heard stories that his dad had no problem pimping the Jackson kids out to Hollywood perverts in the record industry, and one woman wrote something saying that she and MJ were raped together during childhood, just before a stage performance. Did the victim become a perp or was he innocent all the while? We can't say what happened or what he did/didn't do, we're merely spectators at a red, white and blue circus. ",
            "date": "Answered January 19, 2019",
            "views": "93",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akva Lo",
                    "user_href": "/profile/Akva-Lo"
                },
                {
                    "user_id": "Wilson Ting",
                    "user_href": "/profile/Wilson-Ting-9"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-1829"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepankar Mohanta",
                "href": "/profile/Deepankar-Mohanta"
            },
            "answer_text": "I have been a huge Michael Jackson fan and have not believed in any of the accusations. None of them have ever been proven. I think most of it was just ways to derive money out of him. Other times just half cooked stories in media without any substantial evidence. Although, I am open to believing them if proven. I am not a blind fan. ",
            "date": "Answered December 22, 2018",
            "views": "122",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marina Gkane",
                    "user_href": "/profile/Marina-Gkane"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-1829"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacquie Jackson",
                "href": "/profile/Jacquie-Jackson-11"
            },
            "answer_text": "They were simply awful people who wanted money. ",
            "date": "Answered January 31, 2019",
            "views": "16",
            "upvotes": " Answer requested by Rohit"
        }
    ]
}