{
    "title": "What was it like to be at a doors concert? - Quora",
    "tags": [
        "The Doors (band)",
        "Live Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Kime",
                "href": "/profile/Jon-Kime-2"
            },
            "answer_text": "I saw them perform three times. The first was at the Eagles Hall in Seattle just after their first album was released. It was literally the only time I have seen an audience stunned to complete silence. They were that good. I was right up front and remember turning around to see everyone's eyes and mouths wide open. That's the best description I can offer. The third time was a huge rock concert, all the big names of the day were there. The Doors were late because all the roads had been blocked for hours so they landed behind the stage in a helicopter. Big Jim was so drunk he stumbled around the stage and mostly just talked. I don't think he was the least bit interested in being there. The band tried to turn it into music but it was no use. Then I remember someone yelling \"get f... off the stage ass...., we want Led Zeppelin\". At their best they were fascinating and stunning. At their, or really Morrison's, worst so dreadful you could hardly watch. ",
            "date": "Answered October 12, 2016",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgan Tilley",
                    "user_href": "/profile/Georgan-Tilley"
                },
                {
                    "user_id": "Jakob Hallett",
                    "user_href": "/profile/Jakob-Hallett"
                },
                {
                    "user_id": "Lee Bixby",
                    "user_href": "/profile/Lee-Bixby"
                },
                {
                    "user_id": "Hymie Bildirici",
                    "user_href": "/profile/Hymie-Bildirici-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seth Jackson",
                "href": "/profile/Seth-Jackson-15"
            },
            "answer_text": "The Doors was the first rock concert I ever attended. It turns out that the concert I went to was one of the ones released on the boxed set from the Felt Forum in NY. This concert was only a few months before Jim Morrison died. From what I’m told, he was showing signs of decline at the time. He had a reputation for being an animated showman, but when I saw The Doors, Morrison pretty much stood in one place the whole time, and he performed the songs in yeoman-like fashion. Since The Doors were my favorite band at the time, and since I wasn’t aware of Morrison’s reputation as a live performer, I loved the concert. My biggest disappointments were that it only lasted about 70 minutes and that they didn’t do Soft Parade. ",
            "date": "Answered January 23, 2018",
            "views": "738",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Georgan Tilley",
                    "user_href": "/profile/Georgan-Tilley"
                }
            ]
        }
    ]
}