{
    "title": "What is the process for writing a musical score for a film? - Quora",
    "tags": [
        "Film Musicians",
        "Film Composers",
        "Movie Soundtracks",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randin Graves",
                "href": "/profile/Randin-Graves"
            },
            "answer_text": "That's a pretty huge question! All things can vary but usually a film composer is hired late in the process, after many other people have been involved in the film for a very long time, so usually there are ideas about the music in place before the composer arrives on the scene. Of course, these ideas can affect what composer gets the job in the first place. So if by asking how you even start you're asking how you get the musical ideas, usually the basic direction is given to you when you start the job, and it's all about finding inspiration from the film from there. And it's a collaborative process. A film composer isn't really creating their own music, but rather the film's music, the director's music, the studio's music, or whatever. It's very different from making an album where the music is clearly YOURS. The traditional process is - the composer is given the edit of the film. In the old days, this would have been a final, locked cut, but now with digital editing, films are constantly changing. Most films are also edited with temp music these days, prior film scores or other music used for timing and mood. If at all possible, I like my first viewing of a film to be without temp music, so that I can come to a project fresh rather than being too influenced by temp. But you take what you can get.  Traditionally, the next step would be the spotting session, though temp music these days can make this step less necessary. A spotting session involves the director, composer, music editor, maybe editor, maybe certain produces, going through the film bit by bit in detail, talking about what music is needed, what purpose it will serve, etc. The music editor, or composer if there is no music editor, will keep detailed notes which then go into a master list of the music that needs to be done. There are of course other meetings andmeans of communication over time, but the spotting session would be the main opportunity to talk function and style of the music. Then the composer heads off and gets to work in his own studio. This used to mean lots of sketching at the piano, but now means doing pretty fully produced music in a home studio. With lower budgets, this would be all the composer himself. On bigger films, there can be huge teams involved. The composer, a team of synth programmers, a team of engineers, a team of additional composers who flesh out the ideas of the leader, and a team of orchestrators who translates ideas to notation for the whole orchestra (if there is one used in the score). The composer or team will make mockups, versions of the score with electronic instruments imitating orchestra or other needed instruments, to show to the director and/or producers for approval. This can be in person or via internet. A bit of back and forth will take place, with changes as required. Once everything's ok'd, it's time to finish orchestrations, send those out to copyists who make the printed music parts for each of the instruments, then off to scoring sessions, the recording sessions with the full ensemble. This is often the fun part and directors and producers love to show up, as seeing the film with its own music for the first time is often where it all seems to come together and feel real. This can also be not any fun at all if once you're on the scoring stage, directors or producers decide they don't like the music! Then it's up to mixing engineers and the music editor to get the music sounding  good and timed up with the film all right, then finally it'll go to the final mix for the film, which involves director, editor, music editor, sound editor, etc., in a theater-like space deciding the final mix of the whole film, with all the music, dialogue, and sound effects together. This can be harrowing, as the composer may not have been aware of all the sound effects which may interfere with the music (and vice versa) so tough choices are often made. This is where composers often discover that their brilliant music is all going to be turned down very quiet and covered up by the massive explosions and car noises. :) ",
            "date": "Answered April 7, 2013",
            "views": "51",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ludwig Karl",
                    "user_href": "/profile/Ludwig-Karl"
                },
                {
                    "user_id": "Edwin Leslie Corne",
                    "user_href": "/profile/Edwin-Leslie-Corne"
                },
                {
                    "user_id": "Ujjval Kapoor",
                    "user_href": "/profile/Ujjval-Kapoor"
                },
                {
                    "user_id": "Kavin Kumar",
                    "user_href": "/profile/Kavin-Kumar-7"
                },
                {
                    "user_id": "Lentz Calendre",
                    "user_href": "/profile/Lentz-Calendre"
                },
                {
                    "user_id": "Marcin Ratajczyk",
                    "user_href": "/profile/Marcin-Ratajczyk-3"
                },
                {
                    "user_id": "Lex Szymczyk",
                    "user_href": "/profile/Lex-Szymczyk"
                },
                {
                    "user_id": "Stephan Miguel",
                    "user_href": "/profile/Stephan-Miguel-2"
                },
                {
                    "user_id": "Tarek Bouguerra",
                    "user_href": "/profile/Tarek-Bouguerra"
                },
                {
                    "user_id": "Don Dempsey",
                    "user_href": "/profile/Don-Dempsey-2"
                }
            ]
        }
    ]
}