{
    "title": "What do you find beautiful about calculus? - Quora",
    "tags": [
        "Calculus Classes",
        "Calculus Education",
        "Mathematics Education",
        "Beauty",
        "Calculus"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Zeng",
                "href": "/profile/Chris-Zeng-10"
            },
            "answer_text": "It is no exaggeration to say that calculus is the foundation of modern math. or more generally, the foundation of modern science. Figuratively speaking, I think what calculus is to science and technology is like what a trunk is to a tree, and what feet is to a human being.  Why calculus is beautiful? Try to imagine a tree without a trunk and a human being without feet. Specifically speaking, I think the beauty of calculus lies in its logical nature, i.e. first to find a suitable expression of interrelated differential elements, and then to  integrate them in a logical way to get the macro-properties. It represents an embracive way of thinking.  Faced with a tough problem, we have to divide it into processible parts, then integrate and summarize all the parts into an organic whole. This approach of thinking penetrates into every corner of life, from the design of manned spacecraft to the simple problem of “the volume or surface area of a sphere”. Use calculus or the thinking pattern to solve some practical problems, I believe you can find its magic. ",
            "date": "Answered May 14, 2016",
            "views": "2",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laurence Downie",
                    "user_href": "/profile/Laurence-Downie"
                },
                {
                    "user_id": "Shubham Salunke",
                    "user_href": "/profile/Shubham-Salunke-1"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Rocco de Castro",
                    "user_href": "/profile/Rocco-de-Castro"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-715"
                },
                {
                    "user_id": "Sandeep Krishna",
                    "user_href": "/profile/Sandeep-Krishna-2"
                },
                {
                    "user_id": "V Chen",
                    "user_href": "/profile/V-Chen-3"
                },
                {
                    "user_id": "Ashish Kujur",
                    "user_href": "/profile/Ashish-Kujur"
                },
                {
                    "user_id": "Francis Dickinson",
                    "user_href": "/profile/Francis-Dickinson"
                },
                {
                    "user_id": "Tom Higgins",
                    "user_href": "/profile/Tom-Higgins-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Z. Roberson",
                "href": "/profile/Sean-Z-Roberson"
            },
            "answer_text": "The Fundamental Theorem of Calculus, or just Stokes' Theorem. It's a beautiful statement that powers many of our calculations, and the generalization is so nice: for an appropriate region and differential form, the integral of the form over the boundary can be recast as the integral of the derivative (exterior derivative, that is), over the interior. That's why I love calculus. ",
            "date": "Answered May 16, 2016",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-715"
                }
            ]
        }
    ]
}