{
    "title": "What could be the best quality of a singer? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Andrew William Pulley",
                "href": "/profile/Andrew-William-Pulley"
            },
            "answer_text": "In one sentence, great singers are any whose vocals cause a physically, emotionally, and/or spiritually pleasing sensation within the listener. While there is no guaranteed formula to create an excellent singer, my work has taught me there are certain traits and skills which (usually) contribute to what listeners perceive as a great singer. Some of these are skills which can be developed, and some can honestly be chalked up to dumb luck. Let’s take a look at a few of the more obvious, and not so obvious traits.  Here’s an Obligatory Picture™ of Rihanna looking beautiful to get your attention. Starting with what I believe are skills which can be developed. Pitch Control - A good singer typically has exceptional control over the pitch of their voice. They can maneuver through their range with relative ease. Though range can certainly play a part in this, some of the most iconic singers in the world had little more than a couple octaves in their range. Examples of singers with excellent pitch control are : Mariah CareyBarbara StreisandFrank SinatraTone/Timbre - There are a broad range of timbres which are pleasing. Sometimes, it’s a pure timbre which sounds amazing. More often than not, however, vocalists with a certain amount of “grit” are perceived as more emotional, stylistic, and generally great. Examples of singers with excellent Tone/Timbre: Josh GrobanAdeleGary LeVox - Rascal FlattsAxl Rose - Guns’n’RosesPresence/Emotion - I’m not just referring to stage presence, where an artist commands a stage with body language and confidence, but to artistic presence, where an artist commands their vocal performance, by revealing deep vulnerability and raw emotion through vocal performance. Examples of vocalists who exhibit excellent presence: John LennonWhitney HoustonSiaThe Song - There is a saying in the music industry that says, “It’s all about the song.” I believe this holds true in making a good vocalist. Whitney Houston on “I Will Always Love You,” Robert Plant on, “Stairway to Heaven,” Keith Urban on, “You’ll Think of Me, Celine Dion and Andrea Bocelli on, “The Prayer,” or even Bruno Mars on “Uptown Funk,” are all excellent because because the tunes themselves stir emotional and physical responses. Good vocalists act as a conduit passing along the emotion and story of the song to the listener. What’s amazing about all these traits is that all of them added up do not always create an amazing singer. Sometimes, great singers only hit a couple of these traits, but because they were able to stir an emotional or physical response, they did the job they set out to do, and are rightfully labeled as a great singer. BONUS: Looks/Glamour - As much as we hate to admit to ourselves, and while certainly not true for all good singers, being visually pleasing is one piece that many vocalists use to alter our sense of how good of a vocalist they are. Some vocalists even get away with less technical proficiency and emotion, and are still labeled as good, because they look good doing what they do. Examples:    ",
            "date": "Answered May 30, 2017",
            "views": "109",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vaishnavi Prabhu",
                    "user_href": "/profile/Vaishnavi-Prabhu-30"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                },
                {
                    "user_id": "Larissa Xo",
                    "user_href": "/profile/Larissa-Xo-2"
                },
                {
                    "user_id": "Ryan Po",
                    "user_href": "/profile/Ryan-Po"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                },
                {
                    "user_id": "Tommaso Saibene",
                    "user_href": "/profile/Tommaso-Saibene"
                },
                {
                    "user_id": "Timi Dare",
                    "user_href": "/profile/Timi-Dare"
                },
                {
                    "user_id": "Laura Black",
                    "user_href": "/profile/Laura-Black-120"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "There is no specific answer to this question, since the definition of 'good' is pretty much subjective. However, from what I was taught by my vocal coach, a good singer (or great) often has the following characteristics:  1) Good pitch control - Not sounding sharp or flat most of the time (at least for intermediate singers) 2) An ear for dynamics - Knowing when to soften or amp up his or her volume depending on the needs of the song, instead of being amped up throughout the performance 3) Good diction and pronunciation - Having an articulation that is at least clear enough for listeners to understand the lyrics of the song being expressed, and pronunciation that does not sound annoying or jarring relative to the language of the song being sung 4) Rhythm - Knowing how to keep up with rhythm as well as playing around with it to add tension and dynamics to the song 5) Tone - The most subjective of all aspects, but usually good tone production is not breathy, too nasal (nasal singing is fine depending on the artist's style and musical approach as long as it does not sound annoying or dull), too mouthy/dark, or too tensed up / strained (this also relates to intonation since an extremely strained voice can cause the pitch to be either flat or sharp)  6) Expression - Understanding what the meaning of the song and the intention of the composer / songwriter is and interpreting it accordingly  Just sharing what I can. :) ",
            "date": "Answered June 5, 2015",
            "views": "46",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abigail Juhasz",
                    "user_href": "/profile/Abigail-Juhasz"
                },
                {
                    "user_id": "Larissa Xo",
                    "user_href": "/profile/Larissa-Xo-2"
                },
                {
                    "user_id": "Laura Black",
                    "user_href": "/profile/Laura-Black-120"
                },
                {
                    "user_id": "Alexandra Gulko",
                    "user_href": "/profile/Alexandra-Gulko"
                },
                {
                    "user_id": "Mark Howe",
                    "user_href": "/profile/Mark-Howe-19"
                },
                {
                    "user_id": "Linda Phillips",
                    "user_href": "/profile/Linda-Phillips-78"
                },
                {
                    "user_id": "Elsie Nosike",
                    "user_href": "/profile/Elsie-Nosike"
                },
                {
                    "user_id": "Joseph Long",
                    "user_href": "/profile/Joseph-Long-95"
                },
                {
                    "user_id": "Red Pool",
                    "user_href": "/profile/Red-Pool"
                },
                {
                    "user_id": "Jurij J. Dvořák",
                    "user_href": "/profile/Jurij-J-Dvořák"
                }
            ]
        }
    ]
}