{
    "title": "What is the song, by Green Day, 'Wake Me Up When September Ends,' all about? Surely, the month of September can't be all that bad. - Quora",
    "tags": [
        "Pop Punk Music",
        "Green Day (band)",
        "Song Meanings",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Adams",
                "href": "/profile/Josh-Adams-391"
            },
            "answer_text": "Firstly, September is god awful. School starts again. Case closed. Secondly, “Wake Me Up When September Ends” is a song that was written by Billie Joe Armstrong when his father passed away when Billie Joe was 10. But the music video contains some different themes. It shows a couple. The boyfriend promises never to leave the girlfriend, and everything is great. Until he signs up for the military and is shot dead in the line of duty. Presumably during the US invasion of Iraq. I suppose you could say that the song is about the death, the futility of war, and loss. Mostly loss. ",
            "date": "Updated May 6, 2020",
            "views": "406",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamie Roxanne",
                    "user_href": "/profile/Jamie-Roxanne"
                },
                {
                    "user_id": "Adam Shire",
                    "user_href": "/profile/Adam-Shire-3"
                },
                {
                    "user_id": "Zunaid Habib",
                    "user_href": "/profile/Zunaid-Habib"
                },
                {
                    "user_id": "Brooks Hooper",
                    "user_href": "/profile/Brooks-Hooper"
                },
                {
                    "user_id": "Poppy Read",
                    "user_href": "/profile/Poppy-Read-2"
                },
                {
                    "user_id": "Joel Joy",
                    "user_href": "/profile/Joel-Joy-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alyse Urice",
                "href": "/profile/Alyse-Urice"
            },
            "answer_text": "A2a appreciation: Wake Me Up When September Ends is an ode to Billie Joe Armstrong’s father and, I have a feeling, memories of other things that have happened in Septembers past that created bad memories. In my family, we all tend to get a little sad, cranky, snappish in October. We apologize to one another and say, “I just feel Octoberish.” There were scorched earth events that happened to my children and I in October about 20 years ago. The echo of those events is still here. ",
            "date": "Answered September 22, 2019",
            "views": "233",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joel Joy",
                    "user_href": "/profile/Joel-Joy-43"
                }
            ]
        }
    ]
}