{
    "title": "What was John Lennon and George Harrison’s relationship like, post Beatles? - Quora",
    "tags": [
        "George Harrison (musician)",
        "John Lennon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eirik Randsborg",
                "href": "/profile/Eirik-Randsborg"
            },
            "answer_text": "They were were really close from the time they started to use LSD and Paul did not. But when Yoko Ono came into the picture, it soured. According to George Martin they even had a fistfight during the Let it be sessions. But they formed an alliance for Alan Klein against Paul and they remained friends for a while, with George also playing on the Imagine album and participated in the film. But when George put together the Concert for Bangladesh he wanted John to join, but he did not want Yoko. Regardless of how this really went down (John and Yoko has said different things about it), they did not participate, so their relationship went bad. John also were very upset that George did not mention him in his book “I Me Mine” and was resentful for a very long time, and even said that George was a disciple and that he was like the fans that used to hang around. By the time John was murdered they had reconciled. On his death bed, George pleaded Paul to make amends with Yoko, because he regretted not to have done so. And Paul did keep the promise. George’s song “All those years ago” is a tribute song to John. ",
            "date": "Updated August 25, 2019",
            "views": "367",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Heda Kom TriKru",
                    "user_href": "/profile/Heda-Kom-TriKru"
                },
                {
                    "user_id": "Michael Minikel",
                    "user_href": "/profile/Michael-Minikel"
                },
                {
                    "user_id": "Kendra Tyler",
                    "user_href": "/profile/Kendra-Tyler-9"
                },
                {
                    "user_id": "Benja Poupin",
                    "user_href": "/profile/Benja-Poupin"
                },
                {
                    "user_id": "Victoria Smart",
                    "user_href": "/profile/Victoria-Smart-7"
                },
                {
                    "user_id": "Mike Stevens",
                    "user_href": "/profile/Mike-Stevens-291"
                },
                {
                    "user_id": "Craig Hamann",
                    "user_href": "/profile/Craig-Hamann"
                },
                {
                    "user_id": "Roderick Escolar",
                    "user_href": "/profile/Roderick-Escolar"
                },
                {
                    "user_id": "Donald G Allen",
                    "user_href": "/profile/Donald-G-Allen"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Claflin",
                "href": "/profile/Jon-Claflin"
            },
            "answer_text": "It’s been my understanding that their relationship was tense, but cordial. After parting musical ways, John was a bit ticked that he couldn’t turn on a radio and not hear My Sweet Lord. He commented on it a few times that he found it annoying - for whatever that means. I think it was a John’s was of putting down the song. In turn, George was very prickly about his music being bad mouthed by John. George said that their relationship was strained over their diametrically opposed views on religion, and thought enough of their differences to comment about the irony that he (George) was working on My Sweet Lord in the studio next to John working on Imagine. Two insanely different songs. I have no idea if the “studio next door” is true, but George said it. ",
            "date": "Updated November 28, 2019",
            "views": "253",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rebecca Stager",
                    "user_href": "/profile/Rebecca-Stager"
                },
                {
                    "user_id": "Tom Branagan",
                    "user_href": "/profile/Tom-Branagan-3"
                }
            ]
        }
    ]
}