{
    "title": "What was the debut song of BTS? - Quora",
    "tags": [
        "BTS Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Haya- 김 하야",
                "href": "/profile/Kim-Haya-김-하야"
            },
            "answer_text": "THE DEBUT SONG OF BTS WAS NO MORE DREAM No More Dream Information Original title: No More Dream Released: June 12, 2013 Format: CD, digital download, streaming Length: 3:42 Language: Korean Label: Big Hit Entertainment Songwriter(s): Pdogg, \"Hitman\" Bang, RM, Suga, J-Hope, Supreme Boi Producer(s): Pdogg Chronology: Previous track\tNext track Skit: Circle Room Talk\tInterlude view • edit \"No More Dream\" is a song by South Korean boy group BTS. The song was released on June 12, 2013. This is their debut song and the fourth track in the debut album 2 Cool 4 Skool. This song has a Japanese version featured in the single NO MORE DREAM -Japanese Ver.- and in the album Wake Up. Lyrics Rap Monster: yamma ni ggumeun mwoni yamma ni ggumeun mwoni yamma ni ggumeun mwoni ni ggumeun gyeou geugeoni Suga: I wanna big house, big cars & big rings But sasireun I dun have any big dreams haha nan cham pyeonhage sareo ggum ddawi an ggwodo amudo mwora an hajanheo Rap Monster: jeonbu dadada ddokgagati nacheoreom saenggakhago isseo saeggakkakkamake ggameogeun ggum manhdeon eorin sijeol daehageun geokjeong ma meollirado gal geonikka Jungkook: arasseo eomma jigeum dokseosil gandanikka V: niga ggumkkwo-on ni moseubi mwoyeo jigeum ni geoul sogen nuga boyeo, I gotta say J-Hope: neoui gireul garago dan harureul sarado mworado harago nayakhameun damadwo Jungkook: wae mal mothago isseo? gongbuneun hagi silhdamyeonseo hakgyo ddaeryeo chigineun geobnaji? igeo bwa deunggyohal junbihane beolsseo cheol jom deureo jebal jom, neo ibman saragajigo imma yurimental boy (Stop!) jasinege mureobwa eon je niga yeolsimhi noryeokhaetnyago Rap Monster: yamma ni ggumeun mwoni yamma ni ggumeun mwoni yamma ni ggumeun mwoni ni ggumeun gyeou geugeoni Jungkook: geojitmariya you such a liar See me see me ya neon wiseonjaya wae jakku ddan gireul garae ya neona jalhae jebal gangyohajin marajwo BTS: (La la la la la) Jimin and BTS: ni ggumi mwoni ni ggumi mwoni mwoni (La la la la la) (BTS) gojak igeoni gojak igeoni geoni Suga: jigyeoun same day, banbokdoeneun maeire eoreundeulgwa bumonimeun teure bakhin ggumeul juibhae jangnaehuimang neombeowon.. gongmuwon? gangyodoen ggumeun anya, guhoemal guwontusu J-Hope: sigannangbiin yajae doljikgureul nallyeo jiok gateun sahwe-e banhanghae, ggumeul teukbyeolsamyeon jasinege mureobwa ni ggumui profile eogabman batdeon insaeng ni sarmui jueoga doe-eobwa Jin: niga ggumkkwo-on ni moseubi mwoyeo jigeum ni geoul sogen nuga boyeo, I gotta say Jimin: neoui gireul garago dan harureul sarado mworado harago nayakhameun damadwo Rap Monster: yamma ni ggumeun mwoni yamma ni ggumeun mwoni yamma ni ggumeun mwoni ni ggumeun gyeou geugeoni Jungkook: geojitmariya you such a liar See me see me ya neon wiseonjaya wae jakku ddan gireul garae ya neona jalhae jebal gangyohajin marajwo BTS: (La la la la la) Jimin and BTS: ni ggumi mwoni ni ggumi mwoni mwoni (La la la la la) (BTS) gojak igeoni gojak igeoni geoni Rap Monster: saraganeun beobeul molla Suga: naraganeun beobeul molla Jungkook: gyeoljeonghaneun beobeul molla Rap Monster: ijen ggumkkuneun beobdo molla nuneul nuneul nuneul ddeora da ije chumeul chumeul chumeul chwobwa ja dasi ggumeul ggumeul ggumeul ggwobwa da neo ggumuldaejima umuljjumul daejima wussup! Jungkook: geojitmariya you such a liar See me see me ya neon wiseonjaya wae jakku ddan gireul garae ya neona jalhae (Jimin/Jungkook) jebal gangyohajin marajwo BTS: (La la la la la) Rap Monster and BTS: ni ggumi mwoni ni ggumi mwoni mwoni (La la la la la) (BTS) gojak igeoni gojak igeoni geoni (Rap Monster/Jimin) To all the youngsters without dreams. Rap Monster: 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 니 꿈은 겨우 그거니 Suga: I wanna big house, big cars & big rings But 사실은 I dun have any big dreams 하하 난 참 편하게 살어 꿈 따위 안 꿔도 아무도 뭐라 안 하잖어 Rap Monster: 전부 다다다 똑가같이 나처럼 생각하고 있어 새까까까맣게 까먹은 꿈 많던 어린 시절 대학은 걱정 마 멀리라도 갈 거니까 Jungkook: 알았어 엄마 지금 독서실 간다니까 V: 니가 꿈꿔온 니 모습이 뭐여 지금 니 거울 속엔 누가 보여, I gotta say J-Hope: 너의 길을 가라고 단 하루를 살아도 뭐라도 하라고 나약함은 담아둬 Jungkook: 왜 말 못하고 있어? 공부는 하기 싫다면서 학교 때려 치기는 겁나지? 이거 봐 등교할 준비하네 벌써 철 좀 들어 제발 좀, 너 입만 살아가지고 임마 유리멘탈 boy (Stop!) 자신에게 물어봐 언 제 니가 열심히 노력했냐고 Rap Monster: 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 니 꿈은 겨우 그거니 Jungkook: 거짓말이야 you such a liar See me see me ya 넌 위선자야 왜 자꾸 딴 길을 가래 야 너나 잘해 제발 강요하진 말아줘 BTS: (La la la la la) Jimin and BTS: 니 꿈이 뭐니 니 꿈이 뭐니 뭐니 (La la la la la) (BTS) 고작 이거니 고작 이거니 거니 Suga: 지겨운 same day, 반복되는 매일에 어른들과 부모님은 틀에 박힌 꿈을 주입해 장래희망 넘버원.. 공무원? 강요된 꿈은 아냐, 9회말 구원투수 J-Hope: 시간낭비인 야자에 돌직구를 날려 지옥 같은 사회에 반항해, 꿈을 특별사면 자신에게 물어봐 니 꿈의 profile 억압만 받던 인생 니 삶의 주어가 되어봐 Jin: 니가 꿈꿔온 니 모습이 뭐여 지금 니 거울 속엔 누가 보여, I gotta say Jimin: 너의 길을 가라고 단 하루를 살아도 뭐라도 하라고 나약함은 담아둬 Rap Monster: 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 얌마 니 꿈은 뭐니 니 꿈은 겨우 그거니 Jungkook: 거짓말이야 you such a liar See me see me ya 넌 위선자야 왜 자꾸 딴 길을 가래 야 너나 잘해 제발 강요하진 말아줘 BTS: (La la la la la) Jimin and BTS: 니 꿈이 뭐니 니 꿈이 뭐니 뭐니 (La la la la la) (BTS) 고작 이거니 고작 이거니 거니 Rap Monster: 살아가는 법을 몰라 Suga: 날아가는 법을 몰라 Jungkook: 결정하는 법을 몰라 Rap Monster: 이? 꿈꾸는 법도 몰라 눈을 눈을 눈을 떠라 다 이제 춤을 춤을 춤을 춰봐 자 다시 꿈을 꿈을 꿈을 꿔봐 다 너 꾸물대지마 우물쭈물 대지마 wussup! Jungkook: 거짓말이야 you such a liar See me see me ya 넌 위선자야 왜 자꾸 딴 길을 가래 야 너나 잘해 (Jimin/Jungkook) 제발 강요하진 말아줘 BTS: (La la la la la) Rap Monster: 니 꿈이 뭐니 니 꿈이 뭐니 뭐니 (La la la la la) (BTS) 고작 이거니 고작 이거니 거니 To all the youngsters without dreams. Rap Monster: Hey, what's your dream? Hey, what's your dream? Hey, what's your dream? Hey, is that your dream? Suga: I wanna big house, big cars & big rings But in real, I don't have any big dreams Haha I live an easy life Even if I don't dream, no one says anything to me Rap Monster: Everyone is thinking the same as me When we were still young I said I'll go to some university Jungkook: Okay, mum, I'm going to the library V: What is you that you dreamed of? Who do you see in your mirror, I gotta say J-Hope: Go your own way Even if you live a day Do something Put away your weakness Jungkook: Why don't you say anything? You don't want to study You're too afraid to quit the school, right? See, you're getting ready for school Grow up, don't just talk, You have a weak mind boy (Stop!) ask yourself, when did you try hard Rap Monster: Hey, what's your dream? Hey, what's your dream? Hey, what's your dream? Hey, is that your dream? Jungkook: It's a lie you're such a liar See me, see me ya, you're hypocrite Why are you telling me to go another way? Do well yourself! Don't push others! BTS: (La la la la la_ Jimin] and BTS: What's you dream? What's your dream? (La la la la la) (BTS) Is that your dream? Is that your dream? Suga: Boring same day, every day repeats Adults and parents tell us the same dream Future job number one, public officials? It's not a forced dream, a relief pitcher J-Hope: Throw a fast ball on the after school studying Disobey the hell like society pardon the dream Ask yourself 'bout the profile of your dream Become the subject of your own life, away from suppression Jin: What is you that you dreamed of? Who do you see in your mirror, I gotta say Jimin: Go your own way Even if you live a day Do something Put away your weakness Rap Monster: Hey, what's your dream? Hey, what's your dream? Hey, what's your dream? Hey, is that your dream? Jungkook: It's a lie you're such a liar See me, see me ya, you're hypocrite Why are you telling me to go another way? Do well yourself! Don't push others! BTS: (La la la la la) Jimin and BTS: What's you dream? What's your dream? (La la la la la) (BTS) Is that your dream? Is that your dream? Rap Monster: Don't know how to live Suga: Don't know how to fly Jungkook: Don't know how to decide Rap Monster: Now don't know how to dream! Open, open, open your eyes again Dance, dance, dance again Dream, dream, dream again! Don't hesitate, don't hesitate Wassup! Jungkook: It's a lie you're such a liar See me, see me ya, you're hypocrite Why are you telling me to go another way? Do well yourself! (Jimin/Jungkook) Don't push others! BTS: (La la la la la) Rap Monster and BTS: What's you dream? What's your dream? (La la la la la) (BTS) Is that your dream? Is that your dream? (Rap Monster/Jimin) To all the youngsters without dreams HOPE THIS ANSWER WAS HELPFUL ",
            "date": "Answered September 11, 2019",
            "views": "65",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rutuja Hunari",
                    "user_href": "/profile/Rutuja-Hunari"
                },
                {
                    "user_id": "Mara Waldmann",
                    "user_href": "/profile/Mara-Waldmann"
                },
                {
                    "user_id": "Amy Mendoza",
                    "user_href": "/profile/Amy-Mendoza-67"
                },
                {
                    "user_id": "Christ Olivier",
                    "user_href": "/profile/Christ-Olivier"
                },
                {
                    "user_id": "Mary Janes",
                    "user_href": "/profile/Mary-Janes-20"
                },
                {
                    "user_id": "Izabelle X",
                    "user_href": "/profile/Izabelle-X"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiha Karim",
                "href": "/profile/Samiha-Karim-2"
            },
            "answer_text": "I mean they had a ton of predebut songs, but their first official song and debut is…. No More Dream!! On June 13, 2013.  I had a conversation with a girl another day during my gym period in school and she said she liked BTS and was a huge fan, along with listening to their songs a ton, so I tested her by asking what their debut song was. She responded, “Umm, is it Blood, Sweat, and Tears?” *mental facepalm* “No…” I answered. “BST was released in 2016. A while after they debuted, and their boost to popularity.” “Oh! Oh! I know!!” She jumps up excitedly. “Yes?” I responded eagerly. “Boy In Luv?!” Another mental facepalm. I then proceeded to explain to her it was No More Dream, and Boy In Luv was released in 2014, while NMD was released in 2013. I assumed she knew Boy In Luv because of Boy With Luv. Goes to show how their debut song needs more appreciation. Don’t forget, if it weren’t for this song, you wouldn’t get the new songs like Boy with Luv or DNA or Idol or Fake Love. ",
            "date": "Answered October 11, 2019",
            "views": "2",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rutuja Hunari",
                    "user_href": "/profile/Rutuja-Hunari"
                },
                {
                    "user_id": "Amy Mendoza",
                    "user_href": "/profile/Amy-Mendoza-67"
                },
                {
                    "user_id": "Kriss Lee",
                    "user_href": "/profile/Kriss-Lee-9"
                },
                {
                    "user_id": "Justin Seagull",
                    "user_href": "/profile/Justin-Seagull-117"
                },
                {
                    "user_id": "Rukkie Jeon",
                    "user_href": "/profile/Rukkie-Jeon"
                },
                {
                    "user_id": "Emily Dinah",
                    "user_href": "/profile/Emily-Dinah"
                },
                {
                    "user_id": "Cyta Rosemary",
                    "user_href": "/profile/Cyta-Rosemary"
                },
                {
                    "user_id": "Khanh Huynh",
                    "user_href": "/profile/Khanh-Huynh-67"
                },
                {
                    "user_id": "Yuna Maria",
                    "user_href": "/profile/Yuna-Maria"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        }
    ]
}