{
    "title": "What is the best home recording equipment? - Quora",
    "tags": [
        "Home Recording"
    ],
    "response": [
        {
            "author_info": {
                "name": "J Marsh",
                "href": "/profile/J-Marsh-3"
            },
            "answer_text": "The room. Don't go in the closet. Have a decent-sized room and use some sound treatments to look after the sound reflections in the room. Hang some curtains, watch out for corners and spots that “ trap bass\" (they will resonate certain bass frequencies so they are louder than everything else). You want to dullen the reflections a bit but you don't want a completely dead room. On the other hand you really do not want to get in the shower and sing, it may sound good to you but it does not sound good recorded. Safe and sound insulation is worth every penny but egg cartons have their place too. ( As does a pop filter on your mic - get one!) Other than the room it really depends on what you're recording. If you're recording vocals or speaking, then you really really want a proper microphone and a decent audio interface. Id say skip the USB mics right from the start. Just save yourself the trouble, you'll thank me later... A microphone with an XLR output is usually the best but again that audio interface is your very best friend. I have a 1/4 phono jack on mine and it's ok… You really don't have to drop 500.00 on a mic but don't cheap out, it's important equipment for vocals. Keep in mind if you're using a computer, computers are extremely noisy electronicly. If you're recording with a microphone anywhere near your computer you're going to pick up the fan noise and you're also going to pick up that electronic noise unless you have a good audio interface and your input/output impedance of your equipment is matched correctly. (Read up a bit on that, it's well worth the time) I like to use a laptop myself because it can be much quieter ( both due to increased shielding and a smaller, quieter fan). That being said, that laptop is running into my desktop so if you have a few computers experiment away. There have been many times I've “found\" something by accident that was amazing. Just not for what I was doing at the time! ( Ok, I recorded some vocals with the mic inside a big stock pot. It turned out to be a perfect way to mic a couple drums I had but not for vocals at all). Oh, and don't skimp on the cords either. The first time you hear the sound your cheap cord makes when it moves on the floor during a fantastic vocal recording WILL make you want to cry… If your recording guitar you want you want to match the impedance of your guitar output with the input of your recording device, and the best way to do it it's an audio interface again. But you can also use the line output of an amplifier if that sound is what you want. Run it into the audio interface, or into a hardware mixer if you have one. (Myself it's one thing at a time so the software mixer of a DAW is perfect.)If you've got a Marshall amp in the corner and that's the sound you want… Either mic it or run through it using the line level output if it has one. Personally, I'll either record my vocals with my cell phone, ( it actually has a pretty good microphone), or with a dynamic microphone (mine is a Shure sm58) and an audio interface but I'll leave the room and run the cord into my computer. Now mind you I'm a hobbyist, I'm not making my money at this and starving when I mess something up, but if I have a good night when it's very quiet out I tend to get some pretty decent vocals. For me it's always the background noise that's the hardest to deal with but if you learn how to use a noise gate properly and spend a bit of time with different settings on your compressor you can end up happy with the results. In the end though you can't get any better start than a good quality recording as far as vocals go. No outside noise, cars, dogs, laughing children… you can't fix garbage, it's like putting lipstick on a pig. ( I do have to say though there's been a couple of times when I've just gone along with the kids being there and just used it with them loud and proud in the background) it's up to you. Experiment! That's how you learn. If you have any experience with Linux at all, or are willing to learn a bit, Ubuntu studio is a nice place to start because it has a ton of software included in the suite and you can do things in many different ways. There are also quite a few people who use it so there's a fair bit of Community Support and a lot of people you can ask questions of. There's a few things you should be able to tell from my answer. 1) please be more specific with your questions. You never know when someone like me will come along and use up all the paper with an answer. 2) I use a computer and a DAW. My choice is FL Studio. Experiment, there's quite a few. I like the integration with my cell phone. It absorbs all my ideas when I have them. You could use a hardware mixer and a tape deck. Your end result will be different than mine but not nessisarily better or worse. The Beatles, Abby Road, a four-track recorder. Look that up too, its… amazing. But so we're they anyway. . A s a final note, look into the different things that artists like (for a really good example - from the result ) John Bonham (Led Zeppelin) used to do with his drums ( besides hit them harder than hell) and then listen to the music. ( I'm pretty sure a really good one is on houses of the Holy) You may get ideas you didn't see coming. I got a great snare and a kick sound (both!) out of a foot scuff made in a narrow alley when I was out recording just “stuff” to use one late dark night. Surprise surprise… and hey, check out Jack White as well while your at it. You have to… he still plays the plastic guitar he bought when he was a kid. All the time… on stage too… yeah plastic…seven bucks… like he says, “you don't need money to do this… Sorry for the long winded reply, you asked for it… ",
            "date": "Answered August 22, 2018",
            "views": "391",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikhil Gupta",
                    "user_href": "/profile/Nikhil-Gupta-38"
                },
                {
                    "user_id": "Mark Chance",
                    "user_href": "/profile/Mark-Chance-5"
                },
                {
                    "user_id": "Gus Coelho",
                    "user_href": "/profile/Gus-Coelho-1"
                },
                {
                    "user_id": "Steve Adams",
                    "user_href": "/profile/Steve-Adams-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Jackson",
                "href": "/profile/David-Jackson-416"
            },
            "answer_text": "I know there are a ton of various well-known microphones. But what I recommend is a new black audio technology based on binaural recording method. There is a portable and convenient in-ear binaural microphone Scenes Lifelike, which based on HRTF to mimic human ears hear sound in the natural world. What recorded by it can be heard 3D sound effect as your ears hear in the world. You can just put it on in your ears to record instead of using a dummy head, which is more convenient and affordable. Certified by MFi, it is compatible with all iOS devices equipped with a Lightning connector. That means you can just use iPhone connect with it through the Lightning port to record whatever you want. Also without any app, it directly uses iPhone standard camera to record video in 3D sound effect. Below is one of videos in 3D sound effect recorded by an iPhone and Scenes Lifelike. You can put on your headphones to listen whether it was that magical.  ",
            "date": "Answered May 19, 2017",
            "views": "122",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Wrhel",
                    "user_href": "/profile/Mark-Wrhel"
                }
            ]
        }
    ]
}