{
    "title": "What are the pros and cons of being a piano teacher? - Quora",
    "tags": [
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donna LeVoir",
                "href": "/profile/Donna-LeVoir"
            },
            "answer_text": "It is hard to have a passion to teach piano if you don't have a passion for teaching.   That's really the bottom line. My experience as a teacher had a lot of highs and lows.  I liked being able to charge a good fee for lessons.  I didn't like that the hours were evenings and weekends.  If my students were being forced to take lessons by their parents, they never practiced and made very little progress, but they did make progress.   The few students I had that were truly there to learn were ones I looked forward to teaching.  I would feel inspired to find them the next music they needed to learn and coaching them on skills they needed to improve. I tried to keep my lessons focused on them playing and me not droning on about what I thought the whole time. I had a little boy come in for a lesson and pick his nose during the lesson.  I have an aversion to snot and spit anyways, but I made him go wash his hands.   I had good success with teaching siblings.  They competed with each other, and they were able to play duets and solos for recitals. The worst students by far are adults.  They rarely practice and drop out quickly. Hope this helps!!  ",
            "date": "Answered January 24, 2016",
            "views": "945",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Ow",
                    "user_href": "/profile/Ashley-Ow-1"
                },
                {
                    "user_id": "Trudy Murphy",
                    "user_href": "/profile/Trudy-Murphy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Mar",
                "href": "/profile/Emily-Mar-1"
            },
            "answer_text": "I just recently started getting into piano teaching myself as a side job, but to put it simply, students aren't as good as I am, and it sometimes is frustrating to try to explain something to them but they don't get it. In the music profession, you have to care about music enough to make it part of your everyday life. Many students don't do that. Most people will quit playing or just won't try at all to improve, which is really difficult on the teacher. some of that depends on the level of teaching that the teacher is at, and whether they attract dedicated or lazy students. For the most part i just want to play, or at least teach someone close to my level, but I need the money for the future, and most  people aren't that dedicated. ",
            "date": "Answered January 23, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Corrinne Rochelle",
                    "user_href": "/profile/Corrinne-Rochelle"
                },
                {
                    "user_id": "Trudy Murphy",
                    "user_href": "/profile/Trudy-Murphy-2"
                }
            ]
        }
    ]
}