{
    "title": "What is the best trance lyrics song? - Quora",
    "tags": [
        "Trance Music",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian C McCalla",
                "href": "/profile/Brian-C-McCalla"
            },
            "answer_text": "Some people would also call this Vocal Trance, but I completely understand the question. On this one, two stand out (and that's saying something because unlike the purist trance snobs who snicker at it whilst preaching the falsehood that vocal trance somehow is a pop selfout, I love this subgenre). First, Ive got to go with the simple, poignant, reassuring lyrics of enduring commitment, protection, and devotion that come from Giuseppe Ottaviani's I Am Your Shadow. The breakdown has never NOT brought chills to my spine and tears to my eyes, and I've heard it dozens of times… and you'll almost never see tears in my eyes otherwise. . I Am Your Shadow I am yours; Eternally Tied to all of your tomorrows. I’ll never let go. I watch you sleep. I watch you dream. Every step you take I’ll follow. I am your shadow. I’ll be your light To the end of time. Just so you know: I’ll never let go. When you can’t hide In the darkened night, Just so you know: I’ll never let go. You are not alone. Every night I’ll keep you safe from all you fear. You are not alone. Every time you look around you’ll find me near. You are not alone in this world anymore. You are not alone in this world anymore. I am your shadow. I am your shadow. .  …… On the flip side of that is the angry anthem from the collective known as Dash Berlin in their track Man On The Run: . Man On The Run You stole a kiss and stole my heart.Made me a fool right from the start.Wouldn't have been so bad, exceptThis little plan-it fell apart. If I were you,I'd dare not speak;I'd run like hellIn hopes of seeing tomorrow. It's such a travesty,The way you say our love should be.Yeah, such a tragedy.Think you can just break my heart and leave me?Well, you better run now,Man on the run.Playing for fun.Wind me up.Leave me undone. These lips are sealed, I'll never speakYour name in loving memory.So don't you try to make amends.That's what you get for playing me. If I were you,I'd dare not speak;I'd run like hellIn hopes of seeing tomorrow. Break my heart and leave me now.Man on the run. It's such a travesty,The way you say our love should be.Yeah, such a tragedy.Think you can just break my heart and leave me?Well, you better run now,Man on the run.Playing for fun.Wind me up.Leave me undone. . . The piano and crescendoing supersaws leading to the sidechained hook of the song coupled with the unforgettable “If I were you, I'd dare not speak; I'd run like hell in hopes of seeing tomorrow.” lyrics guarantees the timeless legacy of this innovative track!  Make music. Do it with love . … and vice versa. ",
            "date": "Answered January 8, 2017",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nuhvyn Kumar",
                    "user_href": "/profile/Nuhvyn-Kumar-1"
                },
                {
                    "user_id": "Alvin Lipps",
                    "user_href": "/profile/Alvin-Lipps-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Albert",
                "href": "/profile/Anthony-Albert-29"
            },
            "answer_text": "So far for me I would have to say the best lyrics come from “ Beautiful Things” by andain  Got up early, found somethings missingMy only nameNo one else sees, but I got stuckSince forever cameStop pushing moon for just a second Then nothings changedWho am I, this time where's my name?I guess it crept away No one's calling for me at the door And unpredictable won't bother anymore Silently, it 's harder to ignoreBut straight aheadThere's nothing left to seeWhat's done is doneThis life has got its hold on meJust let it go, one man can never be I forgot that I might seeSo many beautiful thingsI forgot that I might needTo find out What life could bringBeautiful things Take this happy ending away, itsAll the sameGod won't waste this simplicity on possibilityGet me up, wake me up, dreams a feelingThis trace of blameFrozen still I thought I could stop Now who's gonna wait No one's calling for me at the door And unpredictable won't bother anymoreAnd silently gets harder to ignore But straight ahead, there's nothing left to seeWhat's done is done, this life has got it's hold on meJust let it go, what now can never beSo many, beautiful thingsSo many, beautiful things Now, I do, I doCannot change my mindDid I think things through?It was once my life, it was my life at one time Songwriters: David Penner / Josh Gabriel / Mavie Marcos Beautiful Things lyrics © Nettwerk Music Group ",
            "date": "Answered May 25, 2018",
            "views": "724",
            "upvotes": "0"
        }
    ]
}