{
    "title": "What are the cons of being a K-pop fan? - Quora",
    "tags": [
        "Fans and Supporters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tessa Rose",
                "href": "/profile/Tessa-Rose-81"
            },
            "answer_text": "Honestly, there can be quite a few cons to this. A few of them are very apparent I think to anyone, but a few of them I actually read up on from other Kpop fans. Also, some of these only apply to International Kpop Fans, while some apply to any and all Kpop fans, so I compiled a list of the ones that are seemingly the “biggest” issues for both. Expensive - Being a Kpop fan is something that can be incredibly expensive if you’re the kind of person that likes to have the physical copies of albums, and likes to have merchandise. Long story short, if you don’t have a job, or you don’t come from a well-off family (financially), or you’re not lucky to have friends or family members willing to gift you these things, then it’s going to be very difficult for you to get your hands on these things at all, espeically if you’re an international fan.Self-Esteem Issues - This one might seem a little weird to people who may not be Kpop fans, or who are just extremely confident individuals, but liking Kpop makes you too aware of your own self. I talk from experience in this category myself, actually. Before I started getting really into Kpop (like before I watched music videos and interviews everyday of my life), I was somebody who was relatively comfortable with my body. I’ve always known I’ve been on the bigger side ever since fifth grade (puberty is a bitch), and while that thought might have popped up in my head and made me sad here and there before I was into Kpop, it was still never anything that truly bothered me. Now that I AM into Kpop, on the other hand, it’s something that I think about literally every time I see one of my Idols. They’re all so physically… perfect and flawless, in my perspective, and it’s really taken a hit to my self-esteem more than a few times. When I see how physically capable these Idols are it always kills me because I know that I’m not, and it only gets worse when I think about what Idols would think of me if they saw me: Would they think I am fat? Would they think I am ugly because of this? Would they not like to have me as a fan because of my weight? Would they think I am just too lazy and eat too much? etc… Some people (who are probably way more functional than I am) may take this as motivation, but it’s only ever proven to hurt me and make things that much harder.Time-Consuming - As much as many of us like to pretend that we don’t get too caught up with what happens in the media when it pertains to our favorite idols, we do. Now, hear me out: I don’t know why this happens, okay? Before Kpop, I was into a whole lot of different artists/bands, but I had never been as totally consumed by it like I have been with Kpop, literally ever. Now, mind you, I’m not somebody who would be considered obsessed, like I don’t live and breathe Kpop, in other words, but I definitely do spend much more time on the subject of my favorite idol groups than I should. Yes, I do stalk my favorite idols/idol groups on social media, and I do stare at the pictures they post for a few seconds too long (or perhaps a few minutes too long), and yes, I do watch new interviews when they come out, and yes (the one you’ve all been waiting for), I do in fact fantasize about my favorite idols (but I just consider that to be my overactive imagination), and that’s the absolute truth. So, yeah, a lot of my leisure time is most definitely consumed by these things. I reckon that some people, whether they want to or not, can actually become totally consumed by these things simply because everything that’s happening is just so new and exciting to fans that they can’t help it.Non Kpop Fans - Now listen, I am in no way bashing people who don’t like Kpop. It is totally fine if you don’t like Kpop, okay? As an avid Kpop fan, I can probably understand why you don’t like Kpop way more than you think, alright? So nobody is getting bashed during this. I’m just saying that (from personal experience) being a Kpop fan, and then not having any Kpop fans around you, is extremely frustrating both for you and the non Kpop fans. When you very avidly follow an idol/idol group that you really love (like I do), then you probably understand how difficult it is to not talk about it all the time. Seriously, I have had so little real conversations about Kpop that I just burst at the seams anytime it’s brought into any conversation, whether I want to or not, and it can be really embarrassing for me, and extremely annoying to other people, but its honestly just because I’m excited, not because I’m purposefully trying to annoy people that don’t want to hear about it.The Fanwars/competition/”Toxic Fandoms” - Long story short, people get extremely (like fiercely) defensive and protective over their favorite idols/idol groups, almost to the point where I seriously think actual wars could be started over this if we didn’t have actual governments to tell us no. This defensiveness and protectiveness can get so intense to the point where if somebody is caught online saying something bad about a certain idol group/idol (whether if they’re just an ordinary human being or a famous celebrity), the amount of hate that would rain down upon them is insurmountable. In a sense, I could understand why people are so quick to be defensive about this because I wouldn’t want someone to bash or say bad things about my role models either, especially if they made me happy, but on the other hand I just don’t get it. Look, if they’re just expressing their dislike of Kpop, or maybe a certain idol or group, then respect their opinion and move on. But if they’re completely incessantly bashing/ridiculing an idol or idol group for literally no other reason than to just be hateful/to troll, then, well… it’s fair game.For International Kpop Fans all the above cons still apply, but there is, sadly, still a few more for you: Racism/Xenophobia - If you’re an international Kpop fan you will more than likely experience somebody making fun of you, ridiculing you, insulting you, etc., for liking Kpop (especially if you’re someone like me who comes from a very small, conservative town) and many times this “being made fun of” is actually just people being extremely racist towards Asians for literally no other reasons than to just piss you off. Sad thing is they from then on out specifically aim these remarks at you forever and ever just to make you mad and to make fun of you for being so “defensive about Koreans just because you like Kpop,” like no: This isn’t even about Kpop anymore Karen, you’re just being an asshole, and of course I’m going to defend people when you’re literally making fun of them simply because of their RACE, not [insert Spongebob mocking meme] “JUhst BEcAusE I LiKe KpOP”.You will always be accused of being a “Koreaboo,” ALWAYS - This is not to say that Koreaboos don’t exist, because they certainly do and it is certainly very weird, but not every person who enjoys Kpop is a Koreaboo and that seriously needs to stop being such a stigma. Look, if you’re an avid Kpop fan then you’re more than likely going to learn a lot about Korea and the Korean society whether you meant to or not, okay? That’s just a fact. Believe me, I have plenty of knowledge on Korea than I will realistically ever need to know, but that doesn’t mean I’m a “Koreaboo.” God forbid if you ever make a Korean friend whilst simultaneously liking Kpop because you will always be accused of wanting to be friends with them simply because they’re Korean like no, Deborah, chill, they’re just dope. And because of people saying things like that, you will always be too scared to talk them about things like Kpop because you don’t want them to feel like you’re only friends with them because they’re Korean, too. You will also, at least once, be accused of “wanting to be Korean” just because you like Kpop, Like since when has me ever liking potatoes mean that I want to be a potato? (I mean, I basically already am one, but… you get the point)You may be accused of having an ‘Asian Fetish’ - This is also something that is extremely common for International Kpop fans to be accused of. I can’t even recount all of the times my family and friends have accused me of just liking Kpop because I think, and I quote, “Koreans are hot.” It seems as if any time I talk about having a future relationship and getting married, my family always has to hit me with the “Well, once you find yourself a Korean man-,” line. It’s gotten so bad to the point that a family friend had asked me once if I had a boyfriend and my mom replied, “No she’s only in to the Koreans and it’s hard to find one around here.” I cannot even begin to describe to you how annoying this is. Just because I think some Idols are attractive does not mean I suddenly have an “Asian fetish”. I think Shawn Mendes is attractive, I think Harry Styles is attractive, I think Cole Sprouse is attractive(don’t even @ me on this), and I think Ian Somerhalder is attractive, too; how is thinking Idols are attractive any different from that?You Feel a Loss of Connection - Being an international fan can kind of really suck sometimes: maybe you’re favorite idol/idol group isn’t touring where you live, maybe you’re sad you can’t understand the lyrics to their new song since there’s not translation up yet, maybe you’re sad that you can’t sing along properly even with the translation, maybe you’re sad that you can’t understand what they say in interviews, or the posts they make to social media, or maybe you even feel kind of unimportant to them because you’re “just an international fan”. I know that I’ve felt all these things at least once since becoming a fan of Kpop, and it can honestly get you down sometimes, but it’s good to remember that you’re still a fan, whether or not if you’re Korean/from Korea, and that means you’re contributing to their success too. Every fan counts, and I can guarantee that at least half of your favorite idols’ success is due to international fans like you. Also, when you don’t speak Korean, and you’re still unashamedly singing along with songs, you’re literally memorizing countless different sounds that you’ve never even heard before to a multitude of different songs, which is really fucking impressive in and of itself, and some people are actually really fucking good at it.Anyways, that’s the list I came up with. Sorry if I missed something important. ",
            "date": "Answered November 24, 2018",
            "views": "29",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adelina Badea",
                    "user_href": "/profile/Adelina-Badea-5"
                },
                {
                    "user_id": "Mia Muhammad",
                    "user_href": "/profile/Mia-Muhammad-5"
                },
                {
                    "user_id": "47comesafterAK",
                    "user_href": "/profile/47comesafterAK"
                },
                {
                    "user_id": "Kaitlyn Roxby",
                    "user_href": "/profile/Kaitlyn-Roxby"
                },
                {
                    "user_id": "Sumaiyaa Aklan",
                    "user_href": "/profile/Sumaiyaa-Aklan"
                },
                {
                    "user_id": "Rebeca Mio",
                    "user_href": "/profile/Rebeca-Mio"
                },
                {
                    "user_id": "Makaela Levy",
                    "user_href": "/profile/Makaela-Levy-1"
                },
                {
                    "user_id": "Elisha Chua",
                    "user_href": "/profile/Elisha-Chua"
                },
                {
                    "user_id": "Chatise Smith",
                    "user_href": "/profile/Chatise-Smith"
                },
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dionne Estrada",
                "href": "/profile/Dionne-Estrada"
            },
            "answer_text": "First off, sorry in advance if this will be long. With that in mind lets go. Cons of being a K-pop fan Kpop is an expensive lifestyle. -I can make a very long powerpoint on how costly Kpop is. Excluding the expenses for being a multi fan. Even just liking one group can really make you bankrupt if you don’t balance yourself. On average, a kpop group could release 2 albums per year, and one album can have multiple versions which is costing up to 20$-25$ at most. Minus the shipping fee if you live outside Korea, so if, let’s say you buy an album with all 4–6 versions, you are most likely to spend 48$ to 60$ (shipping included). Then aside albums, we have their merchandises which is different depending on the occasions. (Do note that these are more pricey than albums) We got: Summer packages, Season’s Greetings, Concert DVDs, Concert merch, Lightsticks. If I were to give a total rundown on how much if you get them all, it will be roughly an estimate of 250 to 300$ for collecting them all. (PS. The lightstick has versions too, so they upgrade like phones.) Do note, I am not placing concert tickets here because I will point out cons in the latter part.Too much content, too little time to catch up - This varies from which group you follow. If you follow a Rookie group (debut group) then, you are able to keep up because content is casually given. The benefit on supporting a rookie group is that they have minimal exposure compared to huge groups. With big groups, you can ensure they are on the news 24/7 (Unless they are on Hiatus) Kpop members participate in live performances on stages like Music Shows in Korea or even Award Shows. They even appear on KDramas or Variety shows. Normally, if you don’t follow on the group even for a week, you get to miss A LOT of content.Xenophobia! Racism! - This is solely for International K-Pop fans, but I assure you 99% if you like Kpop and live in another country, be ready to be bashed by your friends, your family, and even your co-workers who aren’t into Kpop and aren’t into Asian music. Basically, being a Kpop fan, marks you as a “Liking Boys with Make Up” or “Liking Girls who had plastic surgery” and a bonus remark “You don’t even understand what they are saying.” remarks. The worse kinds of judgment on music taste isn’t for the Heavy Metal, or the Pop song enthusiasts, nope, the worse musical taste comments often lands on Kpop fans. If you are willing to dive into the hole of Kpop, you need a strong will to withstand murdering the next person who tells you this when you mentioned it.Concert Experience - This also varies on the group you follow. If you, let’s say live in US/Asian Countries (Japan, Philippines, Thailand, Hongkong) and is following a small group, you can expect having an easy score on tickets and have a concert once a year if lucky. HOWEVER! If you are following a huge popular group. Pray to all the gods in the world, and have the fastest internet because you only have between an hour to a day to score a tickets before it sells out. When you are hoping for a concert tickets, you really need to be mentally and financially ready cause chances of getting good seats and “at least one seat” can leave you exhausted until you either get it or not. It is a bloody hunger games for tickets toward huge groups like BTS, and EXO. Believe it or not, some fans even go a mile further and buy tickets to concerts in another country just to see the group. (Don’t be surprised if one fan goes the entire world tour).The Fanwars - If you are new to Kpop, then this is something you can avoid…for a certain degree. We all know that fandoms clash, but Kpop fanwars can get pretty intense online and in real life. So if you like one group but hate the other, be ready to be bashed, cause kpop fans protect their stan group intensely. I won’t go into detail for this just for the benefit of not labeling any fandoms cause it would add unnecessary fuel to fire here. But oh, you can’t go fan to see which fandoms are up against each other.Anyways those are my top 5 cons to kpop, truthfully, for a new fan, the pros are really outweighing the cons for kpop for me. You get to be within a huge community and making friends is super easy as long as you share the same hype. ",
            "date": "Answered November 7, 2018",
            "views": "112",
            "upvotes": " View 136 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adelina Badea",
                    "user_href": "/profile/Adelina-Badea-5"
                },
                {
                    "user_id": "Grakitty Xiao",
                    "user_href": "/profile/Grakitty-Xiao"
                },
                {
                    "user_id": "Queenie Lo Hei Yiu",
                    "user_href": "/profile/Queenie-Lo-Hei-Yiu"
                },
                {
                    "user_id": "Elisha Chua",
                    "user_href": "/profile/Elisha-Chua"
                },
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Sania Khan",
                    "user_href": "/profile/Sania-Khan-578"
                },
                {
                    "user_id": "Tereza Šindarová",
                    "user_href": "/profile/Tereza-Šindarová"
                },
                {
                    "user_id": "Aflin Demi",
                    "user_href": "/profile/Aflin-Demi"
                },
                {
                    "user_id": "Lina Bernström",
                    "user_href": "/profile/Lina-Bernström-1"
                },
                {
                    "user_id": "Anamarija",
                    "user_href": "/profile/Anamarija-7"
                }
            ]
        }
    ]
}