{
    "title": "What can I do to get better breath support while singing? - Quora",
    "tags": [
        "Breath",
        "Singing Voice",
        "Breathing",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "Jogging will help but your problem probably isn’t getting air into your lungs as much as how to use what is already there. Most singers actually don’t know how to properly sing from the diaphragm but don’t feel bad, teachers who teach how to don’t know either. Singing from the diaphragm is so easy, a baby can do it. Unfortunately we forget what is natural very quickly. When people breath from the chest and shoulders they only use about a quarter of the air that is really there. When they take a breath they can’t “fill up” because their lungs are already full with air that is not being used and they consequently lose breath. This makes them lose concentration, become self conscious or nervous and a whole downward spiral of “mistakes” ensues. Go somewhere where you can be alone and no one will hear you. Are you there . . . ? Yell at the top of your lungs FIRE! Yell HELP!!! Pretend you are going to jump out at someone and yell BOO!!! Now cough. Play fire engine and sound a siren, each time getting higher and higher. A tsunami is coming, yet RUUUUUUUUN!!!! Your dog just chewed up your favorite sweater, yell BAD DOG. A car is about to run over an unattended infant in the middle of the road, yell STOOOOOOP! My favorite is the get frustrated at trying to do something for the tenth time and just throw up your hands and yell F*** THIS! If you performed these exercises with full and active participation, did you notice where your air came from? It felt like you were pushing from your stomach or belly button. What really happened was you lifted your diaphragm which pushed air, all the air, out of your lungs. Get on all fours and pant like a dog. Notice where your breathing is coming from? Lie flat on the floor and breath. Look down at your stomach. Notice where all your breathing is coming from? Watch the summer Olympic diving competition and notice where SOME of the divers are breathing from. Stand behind a singer who sings properly and notice that with each breath, their sides and back also expand, never the shoulders. The first trick is to stand up and breath from that same spot you yelled from. The second trick is to sing as if you are yelling FIRE from that same spot except with pitch, tone and dynamic control. Every teacher and vocal student knows this stuff, they just don’t know how to apply it. If they do, it is half hearted. Every song you sing must come from the same place that that boo, help, fire, bad, run, stop and hey came from. Join the Marines. They will teach you this. “Stick out your chest, maggot” is to expand the breast plate so the lungs are not being contracted (like most singers do - watch their chest and shoulders - neither should be moving). “Suck in your gut, maggot” is not so you look svelte. It is to activate the diaphragm. Sing with an expanded chest and active diaphragm and you’ll discover three times as much air. It’ll help with your jogging, too. This is also the secret to the dead man’s float. Do this and you can lie motionless in the water for hours. Expand the chest (balloon) and only breath from the belly button. You didn’t read this whole message? F***! ",
            "date": "Answered December 31, 2016",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hunter Wilson",
                    "user_href": "/profile/Hunter-Wilson-83"
                },
                {
                    "user_id": "Sophia Marie Herrick Scott",
                    "user_href": "/profile/Sophia-Marie-Herrick-Scott"
                },
                {
                    "user_id": "Carolina Ferguson",
                    "user_href": "/profile/Carolina-Ferguson-2"
                },
                {
                    "user_id": "Charlene Cerujano",
                    "user_href": "/profile/Charlene-Cerujano"
                },
                {
                    "user_id": "Vicky Styles",
                    "user_href": "/profile/Vicky-Styles-9"
                },
                {
                    "user_id": "Anita Cairns",
                    "user_href": "/profile/Anita-Cairns-1"
                },
                {
                    "user_id": "Sanjeev Singh",
                    "user_href": "/profile/Sanjeev-Singh-2556"
                },
                {
                    "user_id": "Aishwarya Alur",
                    "user_href": "/profile/Aishwarya-Alur-1"
                },
                {
                    "user_id": "Christi Mu",
                    "user_href": "/profile/Christi-Mu"
                },
                {
                    "user_id": "Batuhan Doğan",
                    "user_href": "/profile/Batuhan-Doğan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katarina Hornakova",
                "href": "/profile/Katarina-Hornakova-1"
            },
            "answer_text": "Hi, it is interesting that you are attributing your issue to inadequate “breath support”. Breath support is blamed for all kinds of problems in singing. And that is the problem with breath support. Different people mean different things when they say breath support. Sometimes, I feel like “to have better breath support” is a solution for everything in singing. As someone here already suggested, it is important to know what exactly you are doing when breathing/singing to give you better advice. There are many different reasons why you may feel out of breath during your practices or at the end of your chorus. It can be inefficient breath intake, which causes not enough breath to take you through the sung phrase. Also, you may have inefficient breath control - the way you manage the air you have already inhaled. You may be using too much (or too little) air for a given sung phrase, which makes you gasp at the end of phrases. Or you may be doing extra movements that are not necessary to breathe and sing and that tires you out. Or your posture may be affecting the way you breathe. Or … As you can see, there may be many different reasons for your issue. You are suggesting swimming, jogging, yoga or pilates as a solution. These are great cross-training activities that will improve your lung capacity and muscle strength. But these activities may not necessarily help you gain better “breath support”. Simply, these activities will not teach you how to breathe efficiently during singing because singing requires different “type” of breathing patterns. I would suggest that you ask for advice your choir director. He or she may have some suggestions. You can also discuss your issues with him or her and they may actually assess your breathing/singing and give you appropriate advice. For starter, I am going to offer a video that explains what breath support is and what it is not. It is one video in a series about breath support so if you want to check out the other ones for more information, visit my YouTube channel. I hope you will find this video informative. I wish you all the best in your singing endeavours.  ",
            "date": "Answered June 2, 2018",
            "views": "626",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sophia Marie Herrick Scott",
                    "user_href": "/profile/Sophia-Marie-Herrick-Scott"
                },
                {
                    "user_id": "Carolina Ferguson",
                    "user_href": "/profile/Carolina-Ferguson-2"
                },
                {
                    "user_id": "Anna Chong",
                    "user_href": "/profile/Anna-Chong-26"
                }
            ]
        }
    ]
}