{
    "title": "What are some regal sounding pieces of music? - Quora",
    "tags": [
        "Classical Music",
        "Music Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaylin Pringle",
                "href": "/profile/Jaylin-Pringle"
            },
            "answer_text": "Here are a few: Overture to Music for the Royal Fireworks. The name alone tells you what you're in for.Bacchanalle from Samson et Delilah, Saint-Saens. It's a little more chaotic but I love the ending. It's sounds like the return home from triumph in battle. A German War Song, Mozart. It's a great little March and was used in the Musical Chairs scene in Amadeus.Das Rheingold, Scene 4: Entrance of the Gods into Valhalla. This one takes some time to get through. It's the most satisfying piece of music I've ever heard. I want to use it as a wedding processional but thar might be a bit pretentious.War March of the Priest, from Athalia: Mendelsohnn.  Haydn: Symphony No. 85, movement 1. \"La Reine\" or \"The Queen\" Overture to Handel's Water MusicOverture to Handel's SemeleJauchzet, Frohlocket or The Birth of Jesus from Bach's Christmas Oratorio. Imagine the jubilation after the birth of.....well, Christ.Vivaldi: Concerto Alla Rustica  in G Minor, used in the film Marie Antoinette (Coppola)Resphigi: Pines of RomeWagner's Wedding March from LohengrinZadok the Priest, Handel.",
            "date": "Answered January 30, 2016",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy",
                    "user_href": "/profile/Roy-788"
                },
                {
                    "user_id": "Bijesh Thapa",
                    "user_href": "/profile/Bijesh-Thapa"
                },
                {
                    "user_id": "Mehreen Moon Mehr",
                    "user_href": "/profile/Mehreen-Moon-Mehr"
                },
                {
                    "user_id": "Sarthak Agrawal",
                    "user_href": "/profile/Sarthak-Agrawal"
                }
            ]
        }
    ]
}