{
    "title": "What is the best DAW for producing music and audio recording together? - Quora",
    "tags": [
        "Music Production Software and Apps",
        "Digital Audio Workstations",
        "Digital Audio",
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Audio",
        "Audio Equipment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bernadus Uaku",
                "href": "/profile/Bernadus-Uaku"
            },
            "answer_text": "Ten years ago I started using Magix samplitude pro x, since it was my first DAW that I used I become very sentimental towards it. I could record, mix and master my music in it, which was impressive at the time. Then 6 years down the line I joined the Maschine family at Native instruments, I love their products esp their link with the hardware and many music software companies seemed to be following that route now. I would produce my tracks in Maschine DAW and mix and master them in samplitude. Samplitude is now at pro x 5. One day my avid interface started to make funny sounds every time I was making music or recording an instrument. Had to buy a new one. My country is small so finding a variety of something is tough. They only seem to be having presonus Studio one USB audio interface. Took it home and installed their free studio one artist software. I was impressed with the modern features it had and upgraded to the pro version. Now I have Magix, studio one and, Maschine as my DAW. I then realized there is nothing like, one size fits all with DAW. Ask yourself what type of music you will most be working with, is it electro, dance, pop, live and choose one DAW that matches that requirement and then get another one that is totally in another direction. One day, as many musicians and produce do, you will be bored with your toys, then you can have another toy to discover and play with. Best of all test all DAW for 30 days or rather 2 every month and make a list of things you like and do not like and then buy accordingly. DAW do not come cheap, so choose wisely and stick to it. Get married for life with it and train yourself with whatever you can find on line. Finally, whatever you choose to buy, make sure you have plenty of sold {professional} and free resource to up your know how with that DAW otherwise do not choose to be alone in the desert. Best of luck. Oh check my tutorials on youtube: majestystudiopro ",
            "date": "Answered August 27, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Curtis Dennis",
                "href": "/profile/Curtis-Dennis-5"
            },
            "answer_text": "“Best” DAW is the answer anyone gives you. MY best is Cubase. It does everything fluidly. Easily. And I’m used to it. I record instruments… MIDI… VSTs… vocals. You can also print sheet music. It’s versatile. ",
            "date": "Answered August 31, 2020",
            "views": "9",
            "upvotes": "0"
        }
    ]
}