{
    "title": "What are the best rock songs featuring piano? - Quora",
    "tags": [
        "Classic Rock Music",
        "Pianos",
        "Rock Music",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noelle O'Brien",
                "href": "/profile/Noelle-OBrien"
            },
            "answer_text": "Really anything by Elton John, although “Honky Cat”, “Funeral for a Friend”, and “Burn Down the Mission” might be his best in terms of piano. His Yellow Brick Road album is highly recommended. Also, if you haven’t listened to Aladdin Sane by David Bowie, the entire album features work by the fantastic Mike Garson. In particular, “Lady Grinning Soul” and “Aladdin Sane” are absolutely incredible. He also came back to work on a very unknown song from Bowie’s catalog, “Your Turn to Drive”. It just might be one of my all time favorite songs, and since it was on an unreleased album, nobody has heard it. It’s more mellow than your typical rock, but very good nonetheless. Of course, you have classics as well like Come Sail Away and Billy Joel, but these are my personal recommendations (I’m just a fan of glam rock in general, and this is the best of what I listen to :) ",
            "date": "Answered July 8, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Costco Pretzel",
                    "user_href": "/profile/Costco-Pretzel"
                }
            ]
        },
        {
            "author_info": {
                "name": "D. R. Lovell",
                "href": "/profile/D-R-Lovell"
            },
            "answer_text": "Here are just a few of my all-time favorites: Who Do You Think You Are, by Jigsaw is one of my favorites, especially the intro. Also, although not specifically \"rock\" is Bohemian Rhapsody by Queen. Roadhouse Blues by the Doors. Nothing From Nothing by Billie Preston. Crocodile Rock by Elton John. I Would Do Anything For Love, Out of the Frying Pan (And Into the Fire), Objects in the Rearview Mirror May Appear Closer Than They Are by Meat Loaf. My Old School , and just about anything else by Steely Dan. Let It Roll by Little Feat. Also a lot of Fats Domino, Little Richard, Stevie Wonder, Billy Joel and Ray Charles should be on your list.  ",
            "date": "Answered January 31, 2016",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erica Rivera",
                    "user_href": "/profile/Erica-Rivera-160"
                },
                {
                    "user_id": "Elizabeth Flores",
                    "user_href": "/profile/Elizabeth-Flores-83"
                },
                {
                    "user_id": "Smilla Carr",
                    "user_href": "/profile/Smilla-Carr"
                }
            ]
        }
    ]
}