{
    "title": "What songs are good to choose to audition for YG entertainment if I want to be a rapper (English or Korean but not songs with the n-word)? - Quora",
    "tags": [
        "YG Entertainment",
        "Auditions",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laura Clarke",
                "href": "/profile/Laura-Clarke-178"
            },
            "answer_text": "There isn't really a song in Korean with the word 'naega', as it is how they say 'you' in informal language (banmal). You're especially narrowing that down to very few choices where you want a rap song. Rap songs are notorious for insulting people, therefore you can't get away with not saying 'you' at least once. Korean songs are no different. However, there are a few songs that I thought of when I read this question that I think are 'naega' free, or just about. There are also a few English raps that I think you could definitely pass with. Boys and Girls - Zico Better Now - Post Malone Dally - Hyolyn Blue Moon - Changmo ft. Hyolyn Let You Down - NF (pretty much anything by NF is amazing) Pro tip: DON'T AUDITION USING ANY OF BTS'S SONGS. Just don't do it. YG hates them, and will probably drop you like a hat because of that. Also avoid singing songs by anyone under his label, as it comes off as 'goody-goody'. And don't wear clothes with names of your biases on them. Just wear normal, casual clothes. Good luck, girl! Go get them <3 ",
            "date": "Answered December 13, 2018",
            "views": "19",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chonbeni Shitiri",
                    "user_href": "/profile/Chonbeni-Shitiri-1"
                },
                {
                    "user_id": "Yogyata Rana",
                    "user_href": "/profile/Yogyata-Rana"
                },
                {
                    "user_id": "Pooja Choudhary",
                    "user_href": "/profile/Pooja-Choudhary-945"
                },
                {
                    "user_id": "Moirangleima Khoiyangbam",
                    "user_href": "/profile/Moirangleima-Khoiyangbam-1"
                },
                {
                    "user_id": "Mariz Que",
                    "user_href": "/profile/Mariz-Que"
                },
                {
                    "user_id": "Chuba Soung",
                    "user_href": "/profile/Chuba-Soung"
                },
                {
                    "user_id": "Choi Je Kyung",
                    "user_href": "/profile/Choi-Je-Kyung"
                },
                {
                    "user_id": "Emi Isabel",
                    "user_href": "/profile/Emi-Isabel"
                },
                {
                    "user_id": "Maria Rymaszewska",
                    "user_href": "/profile/Maria-Rymaszewska"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fatheemat Omobolaji Shofunde",
                "href": "/profile/Fatheemat-Omobolaji-Shofunde"
            },
            "answer_text": "In my personal opinion,Song like Tell me you love me by demi lovato is a good option,you can just go for a vocal class for maybe two or three days to enhance your voice as that song is kinda trendy and emotional love song ",
            "date": "Answered September 26, 2020",
            "views": "231",
            "upvotes": "0"
        }
    ]
}