{
    "title": "What is the future of Pune real estate? - Quora",
    "tags": [
        "Commercial Real Estate",
        "Pune, Maharashtra, India",
        "Real Estate Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arindam Mukherjee",
                "href": "/profile/Arindam-Mukherjee-3"
            },
            "answer_text": "It's very difficult to gauge but if economics does eventually catch up with India's property bubble, as it ought to, then investing in real estate in a city like Pune will be a thing of the past. In the first decade of the millennium, property prices climbed a steep curve in lockstep with the income of many Indians including the young upwardly mobile “IT” crowd. The financially prudent among those who could afford invested in a second or even a third house and put it on rent. Rent appreciation was relatively low in most cities but property prices soared till the 2008 recession. In 2009 came a big dip, and saw a second wave of investments. Things picked up again and by 2015 prices were at all time highs. But then demand started dipping, unsold inventories swelled, and prices became stagnant. Delivery schedules took a bad hit and in many places, that gave the builders a bad name. Then came the double whammy of demonetization and GST. DeMon knocked the wind off the sails of the real estate industry because a lot of it was fueled by black money through cash transactions. GST and the ensuing confusion all but completely dissuaded a potential buyer from trying to buy property. The real estate market is reeling from its effects, and that of the “slowdown” in the Indian technology industry. Simply put, far fewer people buy property today than they did on an average over the last fifteen years. This is true of most major cities, and Pune isn't an exception. It gets worse in places like Delhi. Therefore, if you're financially relatively secure and want to buy a house for letting out or to live in, this is a good time to buy but with some caveats. Property prices would be stagnant in the foreseeable future. Also, if you buy an under-construction property, know that work at most sites has either come to a screeching halt or proceeds at a snail's pace - so you must have to wait well more than the estimates builders give you. On the plus side, the interest rates are still low and the Real Estate Regulatory Authority (RERA) has ensured that there are favourable guarantees in terms of possession dates. But don't expect your house to appreciate at 10% per annum. If the employment scenario improves, we might see some appreciation a couple of years down the line. But that's hard to predict and not the most likely scenario. ",
            "date": "Updated October 31, 2017",
            "views": "41",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo Global Properties",
                    "user_href": "/profile/Leo-Global-Properties"
                },
                {
                    "user_id": "Pritesh Kadam",
                    "user_href": "/profile/Pritesh-Kadam-1"
                },
                {
                    "user_id": "Jay Gandhi",
                    "user_href": "/profile/Jay-Gandhi-22"
                },
                {
                    "user_id": "Aashish Tripathi",
                    "user_href": "/profile/Aashish-Tripathi-7"
                },
                {
                    "user_id": "Nitish",
                    "user_href": "/profile/Nitish-33"
                },
                {
                    "user_id": "Biken Sharu",
                    "user_href": "/profile/Biken-Sharu"
                },
                {
                    "user_id": "Rajas Jain",
                    "user_href": "/profile/Rajas-Jain-1"
                },
                {
                    "user_id": "Varun Bilurkar",
                    "user_href": "/profile/Varun-Bilurkar-1"
                },
                {
                    "user_id": "Hussain Nagri",
                    "user_href": "/profile/Hussain-Nagri-1"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pallavi Kale",
                "href": "/profile/Pallavi-Kale-25"
            },
            "answer_text": "The Real Estate market of Pune is headed for a bright sunny days, with all that has been going in and around Pune city, anyone who is looking to invest in these real estate properties will sure receive a positive return on investment. Sure, the metro route is not solely responsible for Pune’s real estate boom, but is a strong contender as a catalyst. Relatively improving the life style and ease of transportation for the urban masses. This thing is going to affect real estate market for sure. one of the best educational facilities in India, IT industry in hinjewadi, Mechanical companies in chakan metro link from nigadi to viman nagar all these things will come together to uplift the real estate market. So according to me Future Real Estate in pune is bright Read this blog Real Estate Development In Pune ",
            "date": "Answered May 20, 2020",
            "views": "367",
            "upvotes": "0"
        }
    ]
}