{
    "title": "What TV series are worth watching? - Quora",
    "tags": [
        "TV Show Recommendations",
        "Entertainment",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ahana Tyagi",
                "href": "/profile/Ahana-Tyagi-1"
            },
            "answer_text": "Here is my list of TV series **WORTH WATCHING**(long list), Hold on till the end, my choices aren’t that bad>>>  THE WITCHERJust wow! I can’t help but think that this show is better than GOT. If you’ve already seen it, you’re gonna agree with me that Henry Cavill was born to play Geralt! This show is the adaptation of the novel series or maybe the game with the same name. I highly recommend watching it. The cast is amazing. The way Yennefer is portrayed, how she evolved, how their destinies are intervened, is something worth watching. Genre- Drama, Adventure, Thriller, Mystery.  \"Evil Is Evil...Lesser, Greater, Milling. It's All The Same.\"  2. SHERLOCK Everyone is aware of Sherlock Holmes! A detective and a doctor team up to solve the crimes of London( 221B Baker Street) Genre- Crime, Comedy.  ”My name is Sherlock Holmes. It is my business to know what other people don’t know.”  3. STRANGER THINGS You wanna see some kids of 15–16 fighting with horrific creatures? Definitely should watch this one. Better than Riverdale, if you’re comparing Where y’all Winona Ryder’s fans? Genre- Horror, Supernatural, Comedy, Drama.   4. BREAKING BAD This show is really the badass one, as the name sounds. 5 Seasons with 9.5 ratings, you can only predict how amazing this show is! Don’t believe me? well, find out yourself. Genre- Drama, Crime, Dark Comedy, Thriller, Suspense, Mystery. (I tell you, boys love such shows;)   5. THE VAMPIRE DIARIES. Here is all-girls’ favorite one-D The binge-watching show. Vampires, werewolves, witches, hybrids, mystic falls, the Salvatore boys, oh, you really get addicted to this one!!! Genre- Supernatural, Drama, Romance, Mystery, Horror.  Damon- “Everything that I like about me…is you.”  6. THE ORIGINALS I must say I loved this show more than TVD. Ratings and reviews are also better here It was more about the family. There were many moments where Klaus and Elijah really made me cry. Well, about the show, they were the family of original vampires who created all the other ones and drama drama drama… Genre- Supernatural, Family, Horror, Drama.   7. LEGACIES. Wait if you’re thinking you’re done with Mystic Falls and New Orleans, no you’re not. Here’s our masterpiece “TRIBRID”(vampire+werewolve+witch) You remember Alaric Saltzman, he is running the Salvatore School in Mystic Falls for all the supernatural teens! It’s simple if you’re Vampire Diaries fan, you are going to like it otherwise NO. Move on:) Genre- Supernatural, Romance, Teen Drama, Mystery.   8. CHERNOBYL It is a mini-series made on the nuclear disaster that happened in 1986. What can I say, if you’re looking for historical drama for just 5 episodes? This is your show. High rating-9.5 Genre- Historical Period Drama.   9. RIVERDALE Jughead, Archie, Betty, Veronica(like every other high-school students, you know just 17 or 18 years old) who are unraveling the dark secrets of Riverdale, fighting against the crime, and drama and drama. Tbh, this show was good in its very first season, now, it’s just going downhill. Sometimes the story seems to be too much complicated. But hey, why not make your own opinion?! Genre- Teen Drama, Mystery.  Kevin- “Betty’s ponytail is iconic and beyond reproach.”  10. LOST It was the best. You really get lost at some point (definitely in a good way) It’s like are they really alive, or dead, or living another life?! It’s about airplane crash survivors on a tropical island in the South Pacific. Underrated show and worth giving a try. Genre- Supernatural, Adventure, Drama, Sci-fi, Mystery, Thriller, Action, etc.   11. VAGABOND Netflix Korean Series. I liked its rating and the title, so I decided to give it a try and it was just a wholesome package of Action and Thriller. Genre- Thriller, Action, Drama.   12. FRIENDS. I guess I don’t have to elaborate the show’s epicness*_* If you hadn’t watch this show already, what are you doing? Genre- Comedy and loads of love and friendship.   Janice- “Oh. My. God.”  13. DARK INTENSE. Periodt. About the plot, When two children go missing in a small German town, its sinful past is exposed along with the double lives and fractured relationships that exist among four families as they search for the kids. The story includes supernatural elements that tie back to the same town in 1986. (Edit: I had to come back here after watching the latest season. It totally deserves all the hype it’s getting rn. It’s confusing as hell but boy was it worth it! I guarantee you, it’s a whole different and another level ride. If you haven't already, then please go watch it.) Genre- Sci-fi, Supernatural, Mystery, Thriller, Drama.   14. SACRED GAMES. Worth Watching. About the first season, Saif and Nawazuddin, they were the gems of the series! The iconic “Gaitonde” and “Sartaj Singh” and their criminal-cop chase. Every scene of Gaitonde was a masterpiece. If you hadn’t watch it already, please do. Genre- Thriller, Mystery, Crime.   15. THE 100. 6 seasons with full of adventure(7 is yet to come). It has everything you know, adventure, mystery, drama, romance, etc.. The show is a gem. Genre- Adventure, Sci-fi, Mystery, Drama, Romance.   16. MODERN FAMILY Another sitcom and pretty good. *Worth Watching and Relaxing* Genre- Comedy.   17. PEAKY BLINDERS Oh, what should I say about this one? Thomas Shelby is the whole show. You’re so gonna love him Crime and Action basically. Genre- Fiction, Crime, Action, Drama.   18. BIG LITTLE LIES. I admire Shailene Woodley and Reese Witherspoon. There are big names here Murder, Suspense, Thriller, it has all of it. I tell you, this is definitely worth watching. Genre- Mystery, Drama, Dark Comedy.   19. THE WALKING DEAD Okay, this show has it’s own fan base and haters also( coz you know, they keep murdering our favorite ones) Apart from everything, this is still the best show ever. It has something which keeps you addicted to it. You get disappointed, you keep watching. Story- Well, everyone has heard about this show. Still, Rick Grims, a police officer, travels in search of a safe and secure home after a zombie apocalypse spreads across the USA. Best Zombie show. The first 5–6 seasons are just BREATH-TAKING. Genre- Zombies………..  Rick- “You really think you’re gonna take this community from us. From Glenn? From Michonne? From Daryl? From me? Do you have any idea who you’re talking to?”  20. THE FLASH Everyone loves this show and Barry Allen. Binge-watching. Friendship-turn-love story. Genre- Superhero fiction, Action, Drama, Romance, Mystery.  DC Comics btw! One more like this is, “The Arrow”, people say it’s better than Flash. You gotta find yourself!  21. BETTER CALL SAUL One of the best shows I’ve ever watched. High rating, great casting, story, many awards, and whatnot! Genre- Crime, Drama, Mystery, Dark Comedy.   22. OZARK Again a Crime Drama not as good as the above one but worth watching. It’s about a financial adviser who drags his family from Chicago to the Missouri Ozarks, where he must launder $500 million in five years to appease a drug boss.” Genre- Crime, Drama, Mystery.   23. TRUE DETECTIVE. Season 1 for the starters, it just blew you away. The detectives, the policemen solving murders and crimes while unraveling dark secrets about themselves as well as others around them. Interesting. Genre- Crime, Drama, Mystery.   24. HOW I MET YOUR MOTHER. You know, the alternative option for friends? This sitcom. Not as big hit as friends but definitely worth watching. In front of the live audience, everyone’s comic timing, a very good relaxing and mood changing show. Genre- Comedy.   25. BLACK MIRROR For typical Hi-tech drama lovers!! Genre- Sci-fi, Drama.   26. SUITS Office drama and romance. The reason behind I watched this show was Meghan Markle specifically. And it turns out to be a good show. Genre- Drama, Romance, Comedy.   27. SUPERNATURAL I love Dean Winchester and his sense of humor!! You wanna watch hot brothers fighting with ghosts and all sorts of supernatural creatures? This is your show They ran like for a full decade(more than that actually), 15 Seasons. The 15th one is going on rn! There’s a new story in every episode beside their own going on in the back( you know family drama). Once you reach the 2nd or 3rd season, you get addicted. Eventually, they’re out of stories now(I think) and this is the very last season of this show( I’m gonna miss it) Genre- Supernatural, Crime, Horror.   28. GREY’S ANATOMY. A Medical Drama. There’re many other good medical shows too, to watch such as “The Good Doctor”, “House M.D.”, etc.. But this one is also not that bad. The medicos among you can binge-watch it. Genre- Romance, Drama.   29. THE END OF THE F***ING WORLD Dark humor. It’s about two 17-year-old teens, James and Alyssa, who goes on a road trip to find her father, who left home when she was just a child. Genre- Drama, dark comedy.   30. NEW AMSTERDAM. The reason for watching this show was “Anupam Kher” in it. A decent and good medical Drama. Genre- Medical Drama.   31. YOU. Love obsession. An obsession that even forces you to kill someone. The main lead(Joe) really scares at some points in the show but that's the beauty of the show, isn’t it? Well, that is somewhat happening here. A bookstore manager finds himself attracted to a girl but soon that attraction turned into an obsession. But I’ll tell you, stay away from such people in real life. It’s only good on the screen. Genre- Crime, Drama, Romance, Psychological.   32. BLINDSPOT Action-packed crime drama. Genre- Crime, Action, Mystery, Thriller.  (It has a twin name show, “Blackspot” I get confused sometimes but hey I know this for sure they both are pretty good)  33. HOUSE OF CARDS. American Political thriller. I love shows with strong female leads and this show certainly has one It has won many awards. The final season was the best season of all!! Watch it if you’re into politics drama stuff. Genre- Politics, Crime, Drama, Mystery.   34. GOTHAM. For those who are into DC comics! Genre- Crime, Drama, Action, Thriller, Mystery.   35. 13 REASONS WHY. I mentioned this show because I think the 1st season is definitely worth giving a try. (But people, just watch it for entertainment purpose, don’t let any character brain-wash you!) Genre- Drama, Mystery, Teen Drama.  Hannah- “Why didn’t you say this to me when I was alive?”  36. THIS IS US. If you’re looking for some decent peaceful show (other than these actions, mystery, thriller, etc)and some good romantic one, you’re not gonna disappoint with this. It has high ratings, good critics’ reviews, and some great performances by the actors. Genre- Romance and Drama.   37. SENSE 8 It’s not like any other show. It’s quite different! It was a disappointment though, it ended so soon(2 seasons) Genre- Sci-fi, Drama.   38. KILLING EVE. 2 seasons till now and still going on! They say once you start this series, there isn’t any looking back. Just 2 seasons and it has already won numerous awards. British one! Genre- Crime, Drama, Thriller.  Villanelle- “You Should Never Tell A Psychopath They Are A Psychopath. It Upsets Them.”  39. BUFFY THE VAMPIRE SLAYER. These vampires are always a topic of attention, right? A 90’s vampire show. If you’re into vampires, give it a try. I admire her character for never taking any bullshit from Men! Genre- Horror(not at all), Supernatural, Mystery, Drama.   40. CHICAGO FIRE. Well, I wasn’t gonna mention it first, but I think people who like watching some shows on a regular basis, like 2–3 episodes per day, they can give it a try. It’s based on the daily lives of the people of the Chicago fire department. Rating is not bad. It’s the first installment of the Chicago series. Some really handsome people here(don’t mind me) Genre- Action, Drama.   41. THE CROWN. Queen and palace vibes The best Historical drama on Her Majesty! If you’re even slightly interested in the British Royal Family, you must watch it. It is so good. The transformation of a princess into a queen is really worth watching. Genre- Historical-Drama, Romance, Politics.  Queen- “History was not made by those who did nothing.” One more, I’ll mention here, it’s also a royal historical drama, but it’s more romantic than the above one, “REIGN”, it’s sweet to watch:-)  42. PRISON BREAK. Again some hot brothers and loads of action and suspense;) 5 Seasons with 8.3 ratings. Genre- Action, Thriller, and Drama.   43. MONEY HEIST. This show is a masterpiece in a true sense You seeing a team below in the pic. Well, this is quite an interesting and different show. They all team up to go for the biggest heist. Dude, you’re gonna love our Professor. It’s in Spanish. Genre- Heist, Thriller, Crime, Drama.   44. MINDHUNTER. Sometimes you need to think from the criminal’s pov to understand their moves! That’s what this show is about and believe me it’s the best crime show. Genre- Crime, Psychological Thriller.  Bill Tench- “How do we get ahead of crazy if we don’t know how crazy thinks?”  45. THE HAUNTING OF THE HILL HOUSE. I think I didn’t mention any horror one, well, this one is good in that category. Great casting. Genre- Horror, Mystery.  Shirley: “It watches,” he added suddenly. “The house. It watches every move you make.”  46. GOSSIP GIRLS. Enough with action, crime, etc guys, here are some high school teen dramas to take your mind off. High school, girls, their boyfriends, their secrets, their best-friends and drama, drama, and drama. 6 Seasons and Binge-Watching show. Genre- Drama and Romance.  Blair- “Three words. Eight letters. Say it and I’m yours.”  47. PRETTY LITTLE LIARS. Almost the same as Gossip girl but more interesting because of its twists and turns, and the iconic mystery of “A”. I loved the squad of Aria(Lucy Hale), Emily(Shay Mitchell), Spencer(Troian) and Hanna(Ashley Benson). Everyone has their favorite one. Mine was definitely Emily Fields. I loved her spirit and positivity. Genre- Mystery, Thriller, Drama, Romance.   48. ELEMENTARY. If you’re a die-hard fan of Sherlock Holmes(like me) and you’re not done with just 13 episodes of original Sherlock series, you can watch thi s one. Though it’s not the same, there’re some changes in it. A big one is John Watson is a lady named “Joan H. Watson” They’re in New York not in London. They live in Manhattan, not at 221B Baker Street. There’re 6 seasons with 23–24 episodes in each one, not just 3 episodes. Actually, it’s the contemporary version of Sir Arthur Conan Doyle’s character Sherlock Holme. It’s not as good as the original one(I mean that was just incomparable) but it’s still something and worth watching:) Genre- Crime, Mystery, Thriller.   I’ve watched almost all of them fully or partially!!! Do let me know if you know some other good ones:) Reason for not including GOT, not quite a fan!!! Edit 1- There’re so many comments about GOT. Why is it so hard to understand that someone can be Anti-GOT?! I know a lot of people love GOT but again I can’t just put anything which I don’t like. Edit 2- I think many of you guys are pissed off because I didn’t add these shows, so here are they from your recommendations,  49. LUCIFER. Interesting plot. High fan-following. Great Performance. So, Worth Watching. A demon, Lucifer, is living in LA and helping out cops in solving crimes but life isn't that easy. Right? Genre- Crime, Mystery, Romance, and Drama.   50. DEXTER. Serial killing always interests me Good show. You’ll love this serial killer. Genre- Crime, Drama, Thriller.   51. BIG BANG THEORY. Underrated one. You’re so not going to disappoint watching it. Find out yourself?! “Four friends, Leonard, Sheldon, Howard and Raj and their rollercoaster journey.” Genre- Comedy. Comedy. Comedy.   52. HOUSE MD I’ve heard so much about this show and I’m pretty sure that it’s a good medical drama out there! It’s about Dr. House who is a physician and has his own rules when it comes to treating patients’ illnesses. Genre - Comedy, Medical Drama.   53. NARCOS. I like the title. The show is a crime drama based on a real high rating. It’s mainly about the rise of the cocaine trade in Colombia and the real-life stories of drug mafias of the '80s. Genre- Crime, Drama, Thriller, Suspense, Action.   54. THE MENTALIST. Again a good crime drama. I tell you there’re very good crime dramas there to watch! Genre- Crime, Drama.   55. CRIMINAL MINDS. Again Crime Drama. Just keep scrolling;) Genre- Crime, Drama, Thriller, Suspense.   56. THE BLACKLIST. Action-packed crime thriller series. Those who’re into crime stuff, another one for you. Genre- Crime, Action, Thriller.   57. TEEN WOLF. A good fantasy one. If you watch this show you’ll love Stiles Stilinski and his sense of humor Watch it if you’re into supernatural with romance and comedy. A teen werewolf, his high-school, his pack, friends, relationships. All in all, it’s interesting to watch it. Genre- Supernatural, Romance, Drama, Thriller, Comedy.   58. THE HANDMAID’S TALE. This is some real stuff. This show has won many awards for its storyline, for the great performances, etc. I strongly recommend this show. June, the main lead, is a fertile woman who bears the child of her owners and lives under the strong rules and restrictions. I love how she fights for her independence as a woman, for her right! Genre- Sci-fi, Drama.   59. ALTERED CARBON. No words for this show. You gotta find yourself... (you’ll find good:) Genre- Sci-fi, Drama, Mystery, Thriller.   60. DEATH NOTE. I’m not really into Anime. But this one is really good. A high rating and high following(who loves anime!) show. It’s about a high school student who discovers a supe rnatural notebook that grants it’s owner the ability to kill anyone/anything! Interesting right? It is. Genre- Anime.   EDIT 3- I am going to add some more shows. Most of them are the latest Netflix series. So, keep scrolling if you are interested>> . . 61. THE SOCIETY. The High school students return from their trip and found that all of the adults in the town are gone. There is no one left in the town. Their freedom is fun at first but then it becomes dangerous. While they struggle to figure out what has happened to them and how to get the town back to normal, they must form orders and alliances in order to survive there! Now that you know the storyline, I tell you this show is good if you’re looking for new series. Apart from Allie’s acting, some of the Campbell scenes really terrifies the hell out of you. Genre- Mystery.   62. GREENHOUSE ACADEMY. It has a little of everything. A little adventure, little romance, little mystery, and some thrilling events. A decent timepass teen-series. Just 25–30 mins episodes. It’s about the students in the “Greenhouse Academy” Genre- Drama, Adventure, Mystery.   63. THE RAIN. In teresting plot. The rain in Scavandia has some kind of virus which soon evacuates the whole life from there. Two siblings, after six years, get out of the bunker where they were hiding the whole time and then get along with some other survivors in search of food and home. Genre- Mystery, Thriller, Drama.   64. ALEXA AND KATIE. A good comedy one for timepass. Alexa and Katie are BFFs! Alexa has cancer but she keeps her enthusiasm for life while Katie is always by her side. Genre- Comedy.   65. RUSSIAN DOLL. You gonna say, “Why the hell I didn’t watch it before?” So before wasting any more time, watch it. Natasha Lyon ne has done an amazing job. Genre- Mystery, Comedy.   66. DEAD TO ME. Well….just watch it for some dark comedy and drama. Genre- Comedy, Mystery, Drama.   67. TIMELESS Watching this show was fun. It has two seasons, but hey, don’t let the fact that this legendary show was given only 2 seasons worth of airtime fool you! We always had this interest in the concept of “Time-Machine”. We all think of how we would change things if we could go back in time. I love adventurous shows and this one has some very important people from history. So, adventurous and history fans will love it for sure :) Genre- Adventure, History, Sci-fi, Mystery, Drama.  Another Time-Travel show, “12 Monkeys”, you sure have heard of it, if not then go watch it.  68. LOCKE & KEY Imagine you have a key and you can go to any place in the world with that key. Sounds magical, isn’t it?! Well, this series is quite magical. If you’re a fan of magic with some thriller and suspense, go for it. Genre: Supernatural, Horror, Drama.   69. ANNE WITH AN E This series is so col. The cast is amazing. The plot is decent. It’s a beautiful historical drama. It is based on a classic book about a 13-year-old orphan who is seeking love, acceptance, and her place in the world. Genre: Historical drama, Coming of age   70. UNBELIEVABLE. This mini-series of 8 episodes made me so angry. The idea of “serial rapist” boils my blood. And above that how people change their behaviour towards you. It is based on a true story. I can’t even begin to imagine that. I mean I coudn’t just watch it, let alone actually going through something like that. All you wonder is how some people terribly fails at humanity. Watch it for some bitter truth of life. And be safe. Genre: Crime, Drama.   Edit- Let me clear this, I just didn’t put any show in my list without proper thorough knowledge, so if I am telling you it’s worth watching, it is. But of course, you got to choose your genre yourself. If you feel like the following shows aren’t your types, then skip them and move on. And yes, I am a movie and series buff so, yeah, my list is gonna be pretty long one>>> - ",
            "date": "Updated August 6, 2020",
            "views": "3739",
            "upvotes": " View 2.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elvis Lakra",
                    "user_href": "/profile/Elvis-Lakra"
                },
                {
                    "user_id": "Rajeswari De",
                    "user_href": "/profile/Rajeswari-De"
                },
                {
                    "user_id": "Cinema Cinema",
                    "user_href": "/profile/Cinema-Cinema-1"
                },
                {
                    "user_id": "Madhurika S",
                    "user_href": "/profile/Madhurika-S-1"
                },
                {
                    "user_id": "Sayali Dahale",
                    "user_href": "/profile/Sayali-Dahale"
                },
                {
                    "user_id": "Pradeep Pradeep",
                    "user_href": "/profile/Pradeep-Pradeep-36"
                },
                {
                    "user_id": "Mayank Dubey",
                    "user_href": "/profile/Mayank-Dubey-89"
                },
                {
                    "user_id": "Radiatun Zidnee",
                    "user_href": "/profile/Radiatun-Zidnee"
                },
                {
                    "user_id": "Nikhitha Kashyap",
                    "user_href": "/profile/Nikhitha-Kashyap"
                },
                {
                    "user_id": "Nish",
                    "user_href": "/profile/Nish-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edison Hasanaj",
                "href": "/profile/Edison-Hasanaj-1"
            },
            "answer_text": "Every year, the best producers work very hard to bring new and exciting TV series. They’re trying to get the most precious prize for a producer… our attention. I personally think that these 10 TV Series are worth watching: 10. Silicon Valley  The main character, Richard Hendrix, has created a superior compression algorithm. And with the help of his friends, he creates the company called Pied Piper in Silicon Valley. They are gifted programmers but lack business experience. And this leads to a serious of mistakes that put their startup at risk multiple times. 9. Brooklyn Nine-Nine  Probably one of the best comedy series right now. Jake Peralta is a talented detective who loves to solve cases but doesn’t like rules. As Seargent Terry Jeffords says on the first episode: “Jacob Peralta is my best Detective. He likes putting away bad guys and he loves solving puzzles. The only puzzle he hasn’t solved is how to grow up.” Everything changes when Raymond Holt becomes the Captain of Brooklyn 99 precinct. Outwardly he is strict, professional, and love rules. But on the inside he is warm, and empathic who cares deeply about employees under his command. 8. Mindhunter It’s a Netflix TV Series based on the true story of the man who pioneered the science of profiling serial killers, John Douglas. FBI agent Holden Ford had the idea of interviewing individuals who committed gruesome crimes. His partner is Bill Tench. Together they seek to understand how a serial killer thinks. And by the way, Bill’s character is based on the FBI agent Robert Ressler who’s credited for coining the term ‘serial killer’. 7. You  This show didn’t attract much attention in Lifetime but its debut on Netflix was huge. Netflix said that You were watched by 40 million households in the first month. It’s based on the novel with the same name by Caroline Kepnes. A seemingly charming bookstore manager meets a beautiful aspiring writer. By using Social Media he finds information which helps him get close to her. And he makes sure to remove every obstacle in his way. 6. Breaking Bad  It’s one of the best-written TV Series. The story of a protagonist who turned into an antagonist. Walter White is an ordinary chemistry teacher who also works at a car wash to make enough money for the family. But one day he collapses and is given a terrible diagnosis, stage-3 inoperable lung cancer. Walter along with his student Jesse Pinkman joins the world of crime and sell methamphetamine to make as much money as possible for his family before he dies. 5. Lucifer  The lord of hell gets tired of ruling the underworld and takes a vacation in Los Angeles where he opens a nightclub. Lucifer has drama, comedy, fantasy, great music, and interesting characters. What more could you ask from a TV show? 4. Mr. Robot  Elliot Anderson is a young man living in New York City. He works for cybersecurity company Allsafe during the day and a vigilante hacker by night. He struggles with social anxiety, clinical depression, and paranoia. A mysterious group called fsociety recruits him to hack Evil Corp - a company that was responsible for the death of his father. Ramy Malek’s extraordinary performance and the mesmerizing cinematography make “Mr. Robot” a must-watch series. 3. Game of Thrones  Probably one of the most popular series in the world. In the mythical land of Westeros, several noble families fight for control of the seven kingdoms. As conflict erupts in the kingdom, an ancient enemy awakens to threaten them all. 2. Narcos  Netflix goes back to the ’80s to tell the story of Pablo Escobar. The drug lord who was smuggling millions of dollars worth of cocaine in the USA every week. The DEA, Colombian police, AUC, and Cali Cartel had one goal… to kill Escobar. Well, the first 2 seasons follow the rise and death of Escobar. The third season is focused on bringing down Cali Cartel. Narcos portrays the fear and violence which captured Colombia during the ’80s and ’90s but is nowhere near as bad as what happened back then. 1. The Big Bang Theory I love this show. I have seen the episodes repeatedly and always make me laugh. It all started with Leonard and Sheldon, two brilliant but socially awkward physicists. Then a beautiful waitress/aspiring actress called Penny moves in next door. Leonard falls in love with her and makes it his life mission to get the penny to be his girlfriend.  Image source Penny quickly becomes part of their group which also includes the engineer Howard Wolowitz, and Astrophysicist Rajesh Koothrappali. ",
            "date": "Updated December 16, 2019",
            "views": "84",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaiden Heath",
                    "user_href": "/profile/Jaiden-Heath"
                },
                {
                    "user_id": "Nadezda Toomik",
                    "user_href": "/profile/Nadezda-Toomik"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-9080"
                },
                {
                    "user_id": "Edith Gonzalez",
                    "user_href": "/profile/Edith-Gonzalez-18"
                },
                {
                    "user_id": "Paul Grey",
                    "user_href": "/profile/Paul-Grey-39"
                },
                {
                    "user_id": "Mohd Abdul Rahman",
                    "user_href": "/profile/Mohd-Abdul-Rahman-16"
                },
                {
                    "user_id": "Tadiwa Manyonde",
                    "user_href": "/profile/Tadiwa-Manyonde"
                },
                {
                    "user_id": "Prabhudev",
                    "user_href": "/profile/Prabhudev-5"
                },
                {
                    "user_id": "Lois Cooksey",
                    "user_href": "/profile/Lois-Cooksey-3"
                }
            ]
        }
    ]
}