{
    "title": "What is the best way to listen to someone? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Paul Kiernan",
                "href": "/profile/Paul-Kiernan-11"
            },
            "answer_text": "This is a good question and it’s a great thing to strive for, better listening. Once you learn to listen better your communication skills all around will be better. So, these are some things I’ve learned being an actor for 35 years and what listening means to me. It’s all applicable to daily life and to business and relationships, you don’t have to be an actor to understand or apply any of this. The first thing you need to do is get out of your own way. We tend to listen poorly when we’re thinking about ourselves, some great story we have to tell or we are needing attention for some reason. We get in our own way which makes us judge the person who is speaking, pick up only bits and pieces of what they are saying and get frustrated because we aren’t getting to say our big thing. When you’re in conversation with someone and it’s a friend or a co-worker and the conversation is important, and every conversation is, you need to set yourself to the side and give them all the attention. Every conversation is important? Yup, it is. Why? Because if you want to be a better listener, then you have to understand that you’ve never had this conversation before and you have no idea what information is in it and what you can learn or gain from it. From co-workers to best friends, to total strangers, every conversation you have with someone is important. Now, is the conversation with the person at the bus stop as important as the conversation with your boss? No, of course not, But the bus stop conversation is still important. It’s important because it helps you realize that maybe you decide before the words are spoken if you need or want to listen to someone and that immediately clouds your listening skills. You’re waiting for the bus, you have nowhere to go, what does it cost you to listen to someone who has started a conversation with you? It costs you nothing but we have excuses, oh I want to listen to my music, I want to prepare for the meeting, I want to, whatever the excuse is. Sure, mornings aren’t easy and we all would love a silent limo to ride to work in but, most of us don’t and there are humans around us and why not practice your listening? So, every conversation is important. And, when you start a conversation and you want to be a better listener, set yourself aside and just be there with the other person. Just hear them. Understand that because you’re listening to someone doesn’t mean they want you to solve their problems or fix their life, sometimes, people just need to say the words out loud. So, when the other person is taking, don’t be thinking about what you can say to help them, solve them, make life better. Just listen. This is just the basics, set yourself aside, your own needs aside and just listen. Next, ask questions. If you don’t understand something or you’re drawn in by something, ask about it. We do this all the time, we meet someone new and the first question, I have no idea why, is usually, what do you do? They tell you and your reply is usually, oh, cool I’m in banking or computers. Try this, they tell you what they do, you ask them five questions about it. How did you get started? What’s your day like? How long have you been doing that? What do you love about it? Did you always want to do that? Or some variation. Ask. This is going to truly engage you with that other person and in their answering, you’re going to hear more about them and who they are. It goes beyond what they do to make money, it becomes who they are. Because you asked and then you listened. You want to take this further when you meet a new person, don’t ask what they do. Ask where they are from. Ask what they like to eat, read, what movie do they love? Ask something that you really want to know the answer to, not just because we have been conditioned to reach the right hand out, make a firm handshake, say our name and ask what the other person does. If you want to listen better, give yourself opportunities to do so. We get stuck in the same old, same old. We go shopping the person behind the register says, did you find everything you need. You say yes I’m fine, thank you and they ring up your items. Both of you have just read off of some socially acceptable script. They have been trained to ask a question, say a phrase that shows they are caring people working for a caring company and you’ve responded the way you’ve been conditioned to believe you should respond. You are in a situation where no one is really expected to listen and that’s a waste of time. To be a better listener, give yourself a chance to listen. If the clerk asks, did you find everything? Say yes, I did and you know, I was looking for white peaches, didn’t think they were in season and I found some. Answer with more than just yes. This gives the clerk a chance to speak beyond the script. If they do, great, listen to them. If they don’t, it’s okay, you tried. Most people don't want to or cannot go off-script. Let’s face it, for all it’s “good” social media has made us less and less social. The art, the skill of conversation is quickly dwindling due to texting and social media. We sit in rooms or at tables and the people around us are on phones which says: I am not going to talk to you, I am not going to listen to you. This is society now so, becoming a good listener is going to take some effort. You will often find that you need to create your own listening opportunities. So, you’ve set yourself aside, you’re asking questions, you’re finding off-script situations to create conversation, what’s next? Be an active listener. This goes back to every conversation is important. If you’re an active listener, you’re listening for a reason. Well, you may have no idea what the reason is. A conversation with the boos, you probably know the reason. He has information to impart or praise or criticism. Whatever the reason, you listen to what the boss says because it directly impacts your job. What about with friends? They are telling a story and it’s easy to think, oh Ted tells this same kind of story all the time and you sort of half listen and think about what you’re going to say. Well, change your thinking. Ted is speaking and there is something I need to get from this conversation, something that is important. What you have done is immediately raised the stakes. Now, you need to figure out what it is that you need to get from this conversation so you’re listening more intently, you’re listening for something, some clue. Now, you’re active. With your boss, it happens naturally, you listen because what he has to say is in direct connection with your job. Because he is the boss, he has the hiring and firing power, you naturally listen deeper. So, with Ted, you have to create that, it is a bit artificial but, you have to tell yourself, this is important and I need to listen carefully. It’s an exercise. You’re not going to wake up one day after never having run a mile in your life and just run out and do the Boston Marathon. You’d die. With listening, if you haven’t been doing it, you’re not going to be able to just decide what’s important and what isn’t. So, to start, every single conversation is important. Tell yourself this person is talking to you because you need to hear something from them. You will notice a couple of things; first, you’re going to start hearing things you would have missed before. Things that before you would have glanced over with your ears, you’re now stopping and taking in fully. You will notice people around you saying things like: I didn't get that, did you get that. Or, what did she just say, a second ago, what did she say? This is because you’re training your hearing to slow down, take in and process. At first, it will feel sluggish but, as you keep practicing, as you keep putting yourself in situations where you are forcing yourself to listen deeper, and be off-script, when you start asking questions, you will get better and better and it will start happening quickly for you. But, you’ll still be hearing more and connecting deeper. The next thing you’ll notice when you start down this path is, more and more people are going to start talking to you. They will sense that you’re listening. They will have no idea what or how, but, they will sense that if they talk to you, you’re going to hear them. This is because we, as a society, as a people, desperately need to be heard. We all need to have our voices validated and we all need to be heard. Once you start truly listening, people are going to be attracted to that and want to talk to you because they will sense that you’re listening. Don’t think we need to be heard? Quora is a site dedicated to people who need to be heard. We all need to be heard. We all have a voice we need to be validated in some way. You do that by listening. So, you’re setting yourself aside, you’re putting yourself in off-script situations, you’re listening actively, trying to hear what each important conversation is imparting to you. What’s next? Next is understanding that good listening means listening with more than your ears. When you’re listening better, you’re listening to the entire person you’re speaking with. That means, you’re hearing their words but you’re also taking in their body language. That is a part of better listening. What they are saying with their mouth is half of the conversation. What are their eyes doing, what is their body doing? All that is part of active listening. Think of a time when a friend or a co-worker has said something and the people in the room or at the table have reacted with silence. This is often referred to as not reading the room. That really means they weren’t listening. They weren’t listening to the way people’s bodies were saying we're upset, we’re unhappy, we’re tried. They come in, and without reading the room, without listening, they tell their joke or story or whatnot and it serves just to upset people. They didn’t read the room. They didn’t listen. When I was a kid and I wanted to borrow the family car, I had to listen really carefully. I would walk into the kitchen and listen to my mother. If, while making dinner, she was slamming doors and throwing pots about, I had to hear that. No matter if I said, “Is everything okay, Mom?” and she answered in a light voice; “Yes, honey, everything's fine.” Her voice is saying one thing but, clearly, her body is saying another. I have to hear all of it in order to form how I’m going to ask to borrow the car. It’s the same way in all situations. You have to hear the words but you also have to hear what the body and tone are telling you. Poor listeners do not listen to the whole person, they just take in the words quickly and then speak. Reading or listening to the whole person is going to give you more information which means you’ll be able to respond better and you’ll be a better listener. The baseline here is, take the attention off yourself and put in on the person who is speaking. The more it’s about them, the better your chances are for better listening. Again, it’s going to take time. Being a good listener isn’t something that comes naturally because, as we have seen, we all have a voice we want to be heard. Good listening involves delayed gratification, patience and putting others first, letting other voices be louder. It’s not easy but, once you start you cannot imagine the things you’ll hear, the connections you’ll make. Good listening will lead to better communication across all areas of your life. I hope that helps. ",
            "date": "Answered September 3, 2019",
            "views": "805",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aneez Mayor",
                    "user_href": "/profile/Aneez-Mayor"
                },
                {
                    "user_id": "Victoria Verheyan",
                    "user_href": "/profile/Victoria-Verheyan-1"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Umang Jaisinghani",
                "href": "/profile/Umang-Jaisinghani"
            },
            "answer_text": "In today’s high-tech, high-speed, high-stress world, communication is more important than ever, yet we seem to devote less and less time to really listening to one another. Genuine listening has become a rare gift—the gift of Time. It helps build relationships, solve problems, ensure understanding, resolve conflicts, and improve accuracy. At work, effective listening means fewer errors and less wasted time. At home, it helps develop resourceful, self-reliant kids who can solve their own problems. Listening builds friendships and careers. It also saves you Money and Marriages. Here are some tips to help you develop Effective Listening skills :- 1.) Communication. For truly effective communication, business people must hone their listening skills to ensure they fully understand the whole message : not just the content, but the motivation behind the what’s being said, the circumstances around which they are conversing, even what gets left out of the conversation. Colleague must listen with ears and eyes, picking up on voice tone and physical cues to take in the whole message. 2.) Hearing. Quite literally, you can’t listen if you can’t receive audible input. To make it easy to hear, find a place with no interruptions and background noise—space that may be difficult to find on an assembly line or sales floor. Reduce background noise, phone calls, pinging email notices or ant other stimuli that might temp you to multi-task. Stop work, look at the colleague and focus on what he is saying. 3.) Attending. With physical distractions minimized, concentrate on the speaker, filtering out extraneous ideas. Wait until the coworker has finished a thought, allowing for pauses between sentences. Even if you agree with what she says, interrupting the thought can distract her or make her feel too comfortable too flesh out the thought further. Important facts or ideas go off-course this way, sometimes permanently. 4.) Understanding. Once you take in the message, follow up to ensure comprehension. Ask questions to clarify parts you feel unsure about, preferably by repeating the particular point that is an issue and asking an colleague to elaborate or even rephrase until you gain clarity. 5.) Responding. Throughout the conversation , but particular toward the end, provide feedback. Maintain eye-contact, with the body squarely facing the speaker, and nod or give encouragement with “yes” or “I see.” Then recap or paraphrase key points, summarizing in your own words what you heard and giving the speaker time to confirm or correct these summaries. 6.) Remembering. The most important way to make the speaker feel confident that he has been heard is to remember the conversation. During the conversation, write down points or phrase to jog your memory later. These notes can include nonverbal cues, like “seemed very agitated” or “was enthusiastic” to help recall the intensity or tone of the message. Look for specifics to act on, then get back to your coworker and show how these actions made a difference. This reinforces confidence and trust that you really do listen, and encourages colleagues to speak up more often. ",
            "date": "Answered October 29, 2017",
            "views": "17",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sakshi Gharat",
                    "user_href": "/profile/Sakshi-Gharat-4"
                },
                {
                    "user_id": "Joelle Marlow",
                    "user_href": "/profile/Joelle-Marlow"
                },
                {
                    "user_id": "Govind Viswanathan",
                    "user_href": "/profile/Govind-Viswanathan-1"
                },
                {
                    "user_id": "Itai Manela",
                    "user_href": "/profile/Itai-Manela"
                },
                {
                    "user_id": "Pankaj Thakur",
                    "user_href": "/profile/Pankaj-Thakur-94"
                },
                {
                    "user_id": "Abhay Brahmane",
                    "user_href": "/profile/Abhay-Brahmane"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-4622"
                },
                {
                    "user_id": "Rahul Mittal",
                    "user_href": "/profile/Rahul-Mittal-324"
                },
                {
                    "user_id": "Ram Sankar B",
                    "user_href": "/profile/Ram-Sankar-B"
                },
                {
                    "user_id": "Tejas Salkade",
                    "user_href": "/profile/Tejas-Salkade"
                }
            ]
        }
    ]
}