{
    "title": "What song has the longest title ever? - Quora",
    "tags": [
        "Song Titles",
        "Song Identification",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Huw Peterson",
                "href": "/profile/Huw-Peterson"
            },
            "answer_text": "Looks like Jamie Winterhalt gave a good answer to this question. I wouldn’t have known what the longest published song title is. However the longest one among my favorite songs is probably this one: I Don't Want Nobody To Give Me Nothing (Open Up The Door I'll Get It Myself), Pt. 1 by James Brown  One difference between this song title and the ones on Jamie Winterhalt’s list is that it was not made to purposely be long and absurd. It is a real, serious title. Some people take this song as being some kind of anti-welfare diatribe showing that James Brown was right wing, but I don’t think that was the case. The key is in the line “Open up the door.” It’s hard to “get it yourself” when when the door is closed and locked. Perhaps the second longest song title among my favorites is: It’s a Long Way to the Top (If You Wanna Rock ’n’ Roll) by AC/DC  EDIT April 23, 2019: Actually a slightly longer one is: When Did You Stop Loving Me, When Did I Stop Loving You  ",
            "date": "Updated April 23, 2019",
            "views": "493",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jamie Winterhalt",
                    "user_href": "/profile/Jamie-Winterhalt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Winterhalt",
                "href": "/profile/Jamie-Winterhalt"
            },
            "answer_text": "My favourite “long title” song is “Several Species of Small Furry Animals Gathered Together in a Cave and Grooving With a Pict” by Pink Floyd (one of their stranger early numbers). But this is only the 26th longest published song title, according to 100 longest song titles. Apparently, the longest title is “Regretting What I Said to You When You Called Me 11:00 On a Friday Morning to Tell Me that at 1:00 Friday Afternoon You’re Gonna Leave Your Office, Go Downstairs, Hail a Cab to Go Out to the Airport to Catch a Plane to Go Skiing in the Alps for Two Weeks, Not that I Wanted to Go With You, I Wasn’t Able to Leave Town, I’m Not a Very Good Skier, I Couldn’t Expect You to Pay My Way, But After Going Out With You for Three Years I Don’t Like Surprises” by Christine Lavin, which almost takes longer to read than to listen to!  ",
            "date": "Answered April 17, 2019",
            "views": "415",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nora Lai",
                    "user_href": "/profile/Nora-Lai"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-737"
                },
                {
                    "user_id": "Eric Johnson",
                    "user_href": "/profile/Eric-Johnson-774"
                },
                {
                    "user_id": "Paisley Davis",
                    "user_href": "/profile/Paisley-Davis"
                },
                {
                    "user_id": "Huw Peterson",
                    "user_href": "/profile/Huw-Peterson"
                }
            ]
        }
    ]
}