{
    "title": "What should I do if I feel lonely for a long time? - Quora",
    "tags": [
        "Dealing with Loneliness",
        "Understanding Loneliness",
        "Loneliness",
        "Advice",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ann Patrick",
                "href": "/profile/Ann-Patrick-17"
            },
            "answer_text": "You should learn to become your own best friend. Including investing in goals and activities that vitalize you. The more lonely we are, the more our neediness drives others away. The more lonely we are, the more any relationships we DO form end up being strangled and dying. If we do not like ourselves and our own company, we will not be able to make our relationships work. Now, we ALL have some degree of internal discontent .. none of us are perfect, but others seen from a distance can appear to be perfect. Also, life has no guarantee and no certainty since change is the only certainty, so we all live with an underlying current of uncertainty and unease. The less we face and work with this underlying “existential angst”, the more we are driven to seek distraction. Pleasure, money, fame, power … love and friendships. All these distract but do not cure. And when we don’t have ENOUGH distraction, then our unease starts to burble up … we get restless and call this boredom, we become afraid of our own inner emotions and call this loneliness. We are all the same inside .. less than content, and just trying to find some way to solve that. But since happiness is a state of mind, 95% of it comes from whatever kinds of subconscious patterns we have previously fed into our brain. Therefore, it is really important what we are NOW feeding into our brain .. the way we “frame” our situation and view, and the messages we feed into ourselves. Loneliness is not bad .. if we like being with ourselves. And usually this stops by accepting that no one - including ourselves - is going to be perfect. And that while we may not BE perfect, out intentions to improve and grow, to share and be self-honest, and to act with integrity in ways that we respect .. these are what allow us to learn to like ourselves. Btw, happiness is not achieved overnight. It takes decades … but every little step towards it brings noticeable improvement, so you don’t have to wait decades to improve how you feel. ",
            "date": "Answered September 8, 2020",
            "views": "82",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Bledsoe",
                    "user_href": "/profile/Brandon-Bledsoe-19"
                },
                {
                    "user_id": "Mason Hayat",
                    "user_href": "/profile/Mason-Hayat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wen Powers",
                "href": "/profile/Wen-Powers"
            },
            "answer_text": "The basic state of life is isolation and alone-ness. It is primal experience that can be a double edged sword. While it is not a pleasant emotion, it is one that can fuel transformation. This transformation looks different for each person. You get to decide what you want to feel and experience with your life. If you want to continue the path of isolation, that is your choice. However, you can select a different road. Here are a few suggestions to help you along a new path: Focus on others. Find ways to help/encourage just one person a day.Join social groups IRL. There are all sorts of hobbies and groups all over the place. Me? I am part of an Iris society. Even with COVID happening, being a part of that small group keeps me connected to others.Reach out to others in forums such as Psych Central . There are several available forums which are moderated and provide a safe place to build a virtual support network.Remember: A lone mammal is a dead mammal. ",
            "date": "Answered September 8, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Purno SJ",
                    "user_href": "/profile/Purno-SJ"
                },
                {
                    "user_id": "Mason Hayat",
                    "user_href": "/profile/Mason-Hayat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Günther",
                "href": "/profile/Eric-Günther-1"
            },
            "answer_text": "learn to meditate. and find ways in experimenting with talking to yourself in helpful ways. things that encourage you to have a good day when doing stuff. for example you clean up something. you can try to imagine how it would be someone else is doing the cleaning instead of you while you talking to this someone and having a good time. you get better with practice. and meditation helps controling this. a bit like a kid having its imaginary friend. its always a better solution than just letting yourself knockdown from this feeling of being lonley and isolated all the time.but it also happens when being surrounded by friends and family people can have experiences of feeling lonely. and this is something you have to work on if it happens. also don’t underestimate if you running out of energies (your eating habbits) you cannot think clearly. same goes for lack in sleep. be creative. but start with small steps. create just a small little helper friend for starts. giving you helpful advice for simple tasks. extend through time and practice with it. it works similar to having something like alexa you can interact with. if you cannot afford such a helper bot its the best decision for starts for building up into your own version of it and created can be anything inside your own mind. the possiblities are limitless. thats why its called the fantasy and imaginay worlds. good luck and don’t let yourself consumed by the lonelyness. fight against this feeling its worth fighting for. ",
            "date": "Answered September 8, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Purno SJ",
                    "user_href": "/profile/Purno-SJ"
                }
            ]
        }
    ]
}