{
    "title": "What are the most meaningful rock songs? - Quora",
    "tags": [
        "Alternative Rock",
        "Classic Rock Music",
        "Rock and Roll Music",
        "Song Meanings",
        "Rock Bands",
        "Song Lyrics",
        "Rock Music",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parth Sharma",
                "href": "/profile/Parth-Sharma-643"
            },
            "answer_text": "Oh Rock Music,Unlike pop ..Rock has a lot of meaningful songs ,Chill and listen to these awesome hits . ⭐Blackbird -Alter bridge Beatles nailed this song but..Alterbridge's version added a lot of depth to it .Both songs have different lyrics but this one is about people who are broke and need help .Well you're gonna love the main vocalist myles kennedy❤️The way he sings adds a lot of emotion to the song ,Check this one out . ⭐So far away-Avenged sevenfold What a well written song ..The band members were in distraught after they lost there drummer who was like a brother to them and dedicated a song to him and there friendship. Lyrics are well written and pretty meaningful. One can feel there pain while listening ..Hive it a try ⭐ November rain - Gun's n Roses What a band …what a song❤️ Where to start…Very well written for a sneak peak here are some beautiful lines ___________ I know it's hard to heal a broken heart  When even friend's seek out to harm you  But if you can heal a broken heart wouldn't time be out to charm you  Well that's not even a fraction of what a epic piece it is …Definitely try this one out ❤️ ",
            "date": "Answered May 15, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Greg Lancour",
                    "user_href": "/profile/Greg-Lancour"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Mosley",
                "href": "/profile/Emily-Mosley-9"
            },
            "answer_text": "Aerosmith - “Dream On”Penned by lead singer Steven Tyler, this track served as the Aerosmith's initial breakout hit back in 1973. 2. Queen - “The Show Must Go On” Even more than its overall uplifting message of carrying on through tough times, the fact that this song exists is a testament to man’s ability to overcome. Recorded in 1990, many in Queen questioned whether Freddie Mercury was up to the challenge of singing. And he did that, despite he was dying.  3. The Beatles - “Let It Be” When you find yourself in times of trouble, mother Mary might not always come to you, but the immortal words of Paul McCartney will. While many believe that the 'Mary' the former Beatle is referring to in the song is the virgin mother of Christ, but it was actually his own departed mother, whose name was Mary who gave him his own bit of inspiration. ",
            "date": "Answered March 22, 2019",
            "views": "796",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Clem",
                    "user_href": "/profile/Jim-Clem-4"
                },
                {
                    "user_id": "Clemence Dl",
                    "user_href": "/profile/Clemence-Dl"
                }
            ]
        }
    ]
}