{
    "title": "What is the song you love to listen before you go to sleep? - Quora",
    "tags": [
        "Sleep",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trini Cariaga",
                "href": "/profile/Trini-Cariaga"
            },
            "answer_text": "I usually listen to music before I take naps (during the day) and it’s usually this: Ocean Camp by Adam Young.  In fact, I’ve done it so much, I’ve conditioned myself that every time I hear it when I’m NOT about to take a nap, I start to feel sleepy haha Earlier this year in January, I caught my first real case of the flu. I was in a pretty bad way and I couldn’t really sleep much...and when I did, I would wake up with fever sweats and chills, even though I was exhausted. Adam Young released this album and this song was literally the only thing that really got me to fall asleep and stay asleep. I’d just put my headphones on, put the song on repeat and drift off. It’s such a great song for lulling you to a warm state of mind where you can just gently fall asleep and wake up feeling rested. If I don’t listen to that one, I will go for Asteroid Belt…  Parking Lot Fireworks…  …or an instrumental progressive house song.  ",
            "date": "Answered September 18, 2017",
            "views": "398",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Atif Khan",
                    "user_href": "/profile/Atif-Khan-188"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashwith Vuppunuthula",
                "href": "/profile/Ashwith-Vuppunuthula"
            },
            "answer_text": "SING ME TO SLEEP Alan Walker’s Sing me to sleep is the one song that I listen before sleep.wonder why the song is so special then listen to it.  \"Sing Me To Sleep\" Wait a second, let me catch my breathRemind me how it feels to hear your voiceYour lips are movin', I can't hear a thingLivin' life as if we had a choiceAnywhere, anytimeI would do anything for youAnything for youYesterday got awayMelodies stuck inside your headA song in every breath Sing me to sleep nowSing me to sleepOh, won't you sing me to sleep now?Sing me to sleep Remember me now, time cannot eraseI can hear your whispers in my mindI've become what you cannot embraceOur memory will be my lullaby Sing me to sleep nowSing me to sleepWon't you sing me to sleep now?Sing me to sleep A-anytimeI would do-do-do-do-do-do-do-do-do-do-doTime awayYesterday-day-day-day-dayA-anytimeI would do-do-do-do-do-do-do-do-do-do-doTime awayYesterday-day-day-day-day ",
            "date": "Answered September 20, 2017",
            "views": "236",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhupinder",
                    "user_href": "/profile/Bhupinder-13"
                },
                {
                    "user_id": "Sidharth Srivatsav",
                    "user_href": "/profile/Sidharth-Srivatsav"
                }
            ]
        }
    ]
}