{
    "title": "What are some controversies BTS had been involved? - Quora",
    "tags": [
        "Controversies",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ulrike Keßler",
                "href": "/profile/Ulrike-Keßler"
            },
            "answer_text": "I guess the answer sort of depends on your definition of ‘controversy’. There wasn’t a sex scandal or anything with drugs - like that most often is seen as a controvery. There have been a few minor-ish things (though some of them less minor than others) Most recently there is the thing with Jimin having worn a t-shirt that one way or another celebrates the bombing of Hiroshima at the end of World War II. Though that actually happened last year already, it only got picked up now and a TV appearance was cancled by a japanese TV station because of it. While that is a pretty dumb thing to do - wear the t-shirt, not canceling the appearance - it is probably rather mind compared to controversies by other (mainly western) celebrities. In regards of music I believe there hardly is an act out there who didn’t have a song or a line that somehow didn’t sit well with someone. Someone always hears something that might not even be there to begin with. BTS had a fair share of scrutiny in regards of that. The song Blood, Sweat and Tears contains the line ‘Peaches and cream, Sweeter than sweet’. Peaches and cream is sort of slang for a sexual act, which I believe very little people actually know. In War of Hormones someone found offence in the way the song apparently felt in regards of respect for woman. *eyeroll* I mean the song is about - as the title suggests - war of hormones, so younger guys doing rather stupid things in regards of women. People also found offence with Converse High, seeing how that again materializes woman. I personally never understood the ridicolousness of that, seeing that there are songs out there that literally spell out entire sexual acts in detail or have little to no respec for woman (western rap songs anyone?) One of the few things that actually doesn’t really sit well with me is the sort of controversy regarding Surprem BOI who in involved with a lot of their songs as producer/writer. He is part of a rap group that isn’t very well known. Apparently he sort of helped (not sure wheher wrote or produced it) with a song that sort of glorifys rape. While that of course doesn’t make BTS bad people it sort of projcts on to them to some extend, seeing that they chose to work with him. Another one - though that isn’t necessarily involving BTS directly - was in regards of a fan that got sort of… credited by RM for making a collab between him and Wale possible. The controversy was that she actually wasn’t the first fan to suggest that - or whatever she did - and she suppodely is not a very nice person. There are stories about bullying and picking fights with other fans - though I’m not sure how true that actually is. It could also be some jealouse fans that made that one up. Speaking of fans there of course what that story last year I think, about a fan that masturbated as sort of a reply to a tweet Suga did. Supposedly BTS have blocked their twitter page to North American fans for a while in regards of this - as in, for other fans not seeing the video/images. I think these are all the ones I actually know of. In my opinion these ‘controvercies’ are really tame, compared to a lot of others. ",
            "date": "Answered November 10, 2018",
            "views": "2",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maria Monte",
                    "user_href": "/profile/Maria-Monte-1-1"
                },
                {
                    "user_id": "Jaiden Treviño",
                    "user_href": "/profile/Jaiden-Treviño"
                },
                {
                    "user_id": "Luis Martin",
                    "user_href": "/profile/Luis-Martin-50"
                },
                {
                    "user_id": "Jordan Paisley",
                    "user_href": "/profile/Jordan-Paisley"
                },
                {
                    "user_id": "Mya Smith",
                    "user_href": "/profile/Mya-Smith-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessivett Sanchez",
                "href": "/profile/Jessivett-Sanchez"
            },
            "answer_text": "Jimin is the MVP of clothing mishaps. Media always get the news when he wears some controversial shirt Atomic Bomb Sweater - This one was pretty bad. Due to the fact that Jimin wore a shirt depicting the bombing of Japan, they got a TV appearance canceled because of it. It also caused a lot of debates on social media. The shirt was only trying to depict the end of Japan's colonial rule of the Korean peninsula which began in 1910. Not everyone got that and it lead to uproar.The Cursing Sweater - This was pure incident because Jimin could not read the language on the shirt. That didn't stop media companies for bashing on the fact he was wearing it. The sweater was in Russian and said ‘Fuck you’. Some took the sweater seriously and tweeted caution. Others didn't care. This one shouldn't have been a big deal. It's a curse word. People say those all the time. He didn't say it and he wasn't directing it to anyone, so what's the harm. Don't you wear shirts about booze and curse words. Both negative things, but you're not acting them out. This was an exaggeration.-Jess the insomniac teen Edit: apparently the tv broadcast was cancelled for broadcasting schedule issues and the shirt was used as an excuse, forgive my poor research! ",
            "date": "Updated June 29, 2019",
            "views": "272",
            "upvotes": " View 129 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrea Marmolejo",
                    "user_href": "/profile/Andrea-Marmolejo-1-1"
                },
                {
                    "user_id": "Nisansala Sandamini",
                    "user_href": "/profile/Nisansala-Sandamini"
                },
                {
                    "user_id": "Dorota Hromadová",
                    "user_href": "/profile/Dorota-Hromadová"
                },
                {
                    "user_id": "Orna",
                    "user_href": "/profile/Orna-2"
                },
                {
                    "user_id": "Carys",
                    "user_href": "/profile/Carys-39"
                },
                {
                    "user_id": "Emma Bidgood",
                    "user_href": "/profile/Emma-Bidgood-3"
                },
                {
                    "user_id": "Julia Truong",
                    "user_href": "/profile/Julia-Truong-8"
                },
                {
                    "user_id": "Barnali Bhattacharya",
                    "user_href": "/profile/Barnali-Bhattacharya-5"
                },
                {
                    "user_id": "Niharika Kotte",
                    "user_href": "/profile/Niharika-Kotte-1"
                },
                {
                    "user_id": "Piya Piya",
                    "user_href": "/profile/Piya-Piya-47"
                }
            ]
        }
    ]
}