{
    "title": "What is your opinion on BTS’ collaboration with Nicki Minaj? - Quora",
    "tags": [
        "Nicki Minaj (musician)",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriela Forte",
                "href": "/profile/Gabriela-Forte-2"
            },
            "answer_text": "To be honest, I liked her part in the song. As a person, she’s not exactly my favorite, but you have to admit, she’s a good rapper. Her flow was nice, her voice-while different-blended well with the overall vibe of the song. The lyrics were cool, they had the same confident tone of the original song. My only issue with the remix is after her verse they put Jimin’s part (the one that was right before hers) right back in after her verse. It throws off the whole remix for me. I feel like if they just kept the instrumental thing that they do in the intro of the song but a bit slower for a little bit after Nicki’s verse, and then sped it up and then did the chorus/beat drop, it would have sounded better and not just a copy-paster remix. Because as far as I know, that’s the only thing they did to change the song, which would have been fine except for the repeat of Jimin’s prechorus that makes everything weird and unnatural. If you mean the fact that she’s in the song at all, I still like it. Sure it’s for the two to gain success, but that’s part of what collaborations are. You work with someone (or several people) to gain mutual success and to work with them creatively. BTS doesn’t really seem to collaborate with artists unless they respect the creatively, so I don’t see the problem with Nicki wanting to rap on a song with the world’s biggest Kpop boy group. Honestly, I was a little suspicious when the song popped up in my recommended the first time I listened to it (this was several months ago). But Nicki was really good in this song, and it pleasantly surprised me. I still have a bit of an issue with how they transitioned into the next part in the song, but overall, I liked it. I still listen to it from time to time, even though I’m not as much into BTS as I used to be.  :) ",
            "date": "Answered September 30, 2019",
            "views": "490",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shreyasi Das",
                    "user_href": "/profile/Shreyasi-Das-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Yang",
                "href": "/profile/Julia-Yang-25"
            },
            "answer_text": "I really like it! First off, I love Nicki Minaj. Just putting that out there. Her crazy Barbie-party concept way back when was creative and funky and unique and wow i love it sosomuch. And when she went a little grittier and more natural, I loved that too. I first started following her for her Monster verse, then for her style, then for her songs lol. I’m also really into the chill, boppy stuff Nicki does these days, and I like how she did a little bit of that in this song. But she also switched it up for the second part of her verse: her voice got a little clearer and stronger, and you could focus more on her lyrics, which were great as always. This may sound a bit inconsiderate since BTS aren’t native English speakers, but I do really appreciate having English lyrics and hooks that aren’t awkward. One of the first things that impressed me about BTS was their commitment to their English lyrics. Their debut-day songs had good pronunciation and sensible lyrics. I mean Jimin pronounced “We go hard” in bulletproof PERFECTLY …. and now we have “can’t stop me lovin myself.” I think the producers balanced her parts with BTS’ pretty well. Considering they most likely didn’t get to work together too closely for this collab, I’m glad that they didn’t just stick her in the song like they did with Desiigner. Not that that collab wasn’t straight fire as well, but I think Nicki’s part fits into the song better. It doesn’t overwhelm the rest of the song, without having the exact same sound as BTS’ verses. I also appreciate the little shout-out at the beginning. I’m not sure if there’s any significance to the fact that this collaboration happened. BTS has collaborated with plenty of big names before, and considering that Nicki made a song with 6ix9ine, I don’t think it’s exactly Harvard admissions to get a feature from her. ",
            "date": "Answered August 24, 2018",
            "views": "23",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Neal",
                    "user_href": "/profile/Alan-Neal-13"
                },
                {
                    "user_id": "Sherry Day",
                    "user_href": "/profile/Sherry-Day-24"
                },
                {
                    "user_id": "Felix Jacobs",
                    "user_href": "/profile/Felix-Jacobs-6"
                },
                {
                    "user_id": "Warren Dean",
                    "user_href": "/profile/Warren-Dean-20"
                },
                {
                    "user_id": "Irma Lawrence",
                    "user_href": "/profile/Irma-Lawrence-1"
                },
                {
                    "user_id": "Socles Joyce Fong",
                    "user_href": "/profile/Socles-Joyce-Fong"
                },
                {
                    "user_id": "Dominic K",
                    "user_href": "/profile/Dominic-K-10"
                },
                {
                    "user_id": "Rico Romeo",
                    "user_href": "/profile/Rico-Romeo"
                },
                {
                    "user_id": "Johnnique Paul",
                    "user_href": "/profile/Johnnique-Paul-1"
                },
                {
                    "user_id": "Olivia Godson",
                    "user_href": "/profile/Olivia-Godson"
                },
                {
                    "user_id": "Ayu Thakur",
                    "user_href": "/profile/Ayu-Thakur"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Brit-Whit-1"
                },
                {
                    "user_id": "Iris Chan",
                    "user_href": "/profile/Iris-Chan-104"
                },
                {
                    "user_id": "Goddess Douglas",
                    "user_href": "/profile/Goddess-Douglas"
                },
                {
                    "user_id": "Venus Kong",
                    "user_href": "/profile/Venus-Kong"
                },
                {
                    "user_id": "Yashica Sadam",
                    "user_href": "/profile/Yashica-Sadam"
                },
                {
                    "user_id": "Song Ci Yong",
                    "user_href": "/profile/Song-Ci-Yong"
                },
                {
                    "user_id": "Anugya Srivastava",
                    "user_href": "/profile/Anugya-Srivastava-1"
                },
                {
                    "user_id": "Ashley Mei Gong",
                    "user_href": "/profile/Ashley-Mei-Gong"
                },
                {
                    "user_id": "Gwen W",
                    "user_href": "/profile/Gwen-W-6"
                },
                {
                    "user_id": "Maura Safina",
                    "user_href": "/profile/Maura-Safina"
                },
                {
                    "user_id": "Ashley Mirror",
                    "user_href": "/profile/Ashley-Mirror"
                },
                {
                    "user_id": "Sophia",
                    "user_href": "/profile/Sophia-1637"
                },
                {
                    "user_id": "Queen Batac",
                    "user_href": "/profile/Queen-Batac"
                },
                {
                    "user_id": "Rebecca Williams",
                    "user_href": "/profile/Rebecca-Williams-553"
                },
                {
                    "user_id": "Lee Show",
                    "user_href": "/profile/Lee-Show-2"
                },
                {
                    "user_id": "Daisy S",
                    "user_href": "/profile/Daisy-S-63"
                },
                {
                    "user_id": "Margret Dizon",
                    "user_href": "/profile/Margret-Dizon"
                },
                {
                    "user_id": "Alvi Khan",
                    "user_href": "/profile/Alvi-Khan-5"
                },
                {
                    "user_id": "Emma Smith",
                    "user_href": "/profile/Emma-Smith-1992"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danel Fentone",
                "href": "/profile/Danel-Fentone"
            },
            "answer_text": "I absolutely hate it… …but, it was necessary. By my observations, english language media has talked more about her than BTS. So in a way, she has been important as a media boost. But, as a rapper in the song, her contribution was weak. I think its overatted Notice, BTS aren’t mainstream yet due to their fanbase being mostly 12–22 young girls/women. The New York Rapper has mostly a male audience so she drive more male audience to listen to her version of the song. Her verse was rythmic but her lyrical content was weak. Now, the album was planned to be released. To cater for streaming buyers, Big Hit had to present something that could appeal to their audience since apps like spotify and apple music are available in some countries only, it seem logical to present collaboration with an artist from their targetted market is necessary. She is viewed by women as an artist that objectifies women whereas BTS are known to stay away from it by even hiring professors with feminism knowledge to consult their lyrics. This is the main reason of my dislike. Overally, we shouldn’t not forget that she has been promoting BTS on various social media. So in some sense she is using her star power for the boys. I used binge watching all her videos but her female objectification is what made me stop watching her videos and most western artist Edit after the MV came out OK what amazed me the most was that she was wearing clothes, didn’t swear and it was very much fitting to the video ratings criteria for 12 age. She did her part in a very funny way and showed that she can coorperate to fit different audiences. Faith in Nicky Minaj restored! According to Naver: ‘’In particular, Niki Minaz proposed the idea of writing her English rap in Korean on the music video, adding the pronunciation of Korean pronunciation in English rap like subtitles. ‘’ The goal here is to use her fame to promote the korean culture. Most articles about idol has been emphasizing on Nicky Minaj rather than BTS so its good to know that she is helping BTS breaking bariers ",
            "date": "Updated September 7, 2018",
            "views": "26",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ranjana Sony",
                    "user_href": "/profile/Ranjana-Sony"
                },
                {
                    "user_id": "Sae Ali",
                    "user_href": "/profile/Sae-Ali"
                },
                {
                    "user_id": "Nancy O. Obi",
                    "user_href": "/profile/Nancy-O-Obi"
                },
                {
                    "user_id": "KiKi O",
                    "user_href": "/profile/KiKi-O-1"
                },
                {
                    "user_id": "Ariana Parada",
                    "user_href": "/profile/Ariana-Parada"
                },
                {
                    "user_id": "Socles Joyce Fong",
                    "user_href": "/profile/Socles-Joyce-Fong"
                },
                {
                    "user_id": "Lux Scarlett",
                    "user_href": "/profile/Lux-Scarlett"
                },
                {
                    "user_id": "Sudipta",
                    "user_href": "/profile/Sudipta-34"
                },
                {
                    "user_id": "Chinmayi Nadhahuni",
                    "user_href": "/profile/Chinmayi-Nadhahuni"
                },
                {
                    "user_id": "Maria Rymaszewska",
                    "user_href": "/profile/Maria-Rymaszewska"
                },
                {
                    "user_id": "Grace Ann",
                    "user_href": "/profile/Grace-Ann-81"
                },
                {
                    "user_id": "The Written Color",
                    "user_href": "/profile/The-Written-Color"
                },
                {
                    "user_id": "Mingyun Seo-Bang",
                    "user_href": "/profile/Mingyun-Seo-Bang"
                },
                {
                    "user_id": "Purva Devrukhkar",
                    "user_href": "/profile/Purva-Devrukhkar-2"
                },
                {
                    "user_id": "Amelia Gray",
                    "user_href": "/profile/Amelia-Gray-25"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Brit-Whit-1"
                },
                {
                    "user_id": "Venus Kong",
                    "user_href": "/profile/Venus-Kong"
                },
                {
                    "user_id": "Olivia Nunez",
                    "user_href": "/profile/Olivia-Nunez-2"
                },
                {
                    "user_id": "Historia Maria",
                    "user_href": "/profile/Historia-Maria"
                },
                {
                    "user_id": "Amy Black",
                    "user_href": "/profile/Amy-Black-54"
                },
                {
                    "user_id": "Camille Chaux",
                    "user_href": "/profile/Camille-Chaux"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denny Mack",
                "href": "/profile/Denny-Mack-3"
            },
            "answer_text": "Honestly, and I know some will not like my answer, but I am looking at it in a natural way, not rose colored glasses, and it did ask for my opinion. So here goes It reminded me of Missy Elliott in the remake of Moulin Rouge with Mya, Pink, Lil' Kim, and Christina Aguilera. She did an intro and an outro. Now with this one the lyrics mixed well together and the flow was perfect. But with BTS and Nicki Minaj I felt it didn't flow very well. BTS lyrics are well they are telling a story, were as Nicki Minaj had several implied statements and it did not seem right or blended in, it felt like 2 different songs were slammed together and not a collaboration. Now don't get me wrong both versions are amazing as individual pieces. I just didn't feel that they belonged together which is what a collaboration is. If they did the intro that would of been fine and had her do a bit of the chorus of there lyrics that is a collaboration. But her style mixed with BTS style was 2 versions pushed together and I thought it was messy.Ok now that I have gave my opinion on this question, and probably made a lot of people mad, here is what I believe how it should of been done. Remember this is strictly my opinion, but in my opinion on this song is, it just doesn't fit for only BTS it is the perfect song for all stars. So this is how I invision this song going.NICKI- Intro and a duet in the chorus with one or more members. NO outro at all.NICKI- Makes here own version of the song Idol, using who she sang with from BTS in the chorus for the transition and connection to the original version and the original music from BTS. This what is called a collaboration, now if multiple artists want to also do their own version then they should be on the one before theirs using them in a section and repeating was done before. When they our done with all the collbrations, then the Outro should be done by the Original BTS members. This would provide the closure of the piece. For example:BTS and Nicki Minaj -Nicki and JK doing a duet in the chorus.NICKI and JK ft DrakeDRAKE and NICKI ft Cardi BCARDI B and DRAKE ft Charlie PuthCHARLIE and CARDI B ft BTS and then Outro to end the series. This would have taking a longer time to organize due to needing samples from each artist that wanted to participate, matching voices and styles for transition to the next, and all the meetings to make sure everyone likes the flow and are happy with the order.It takes a long time and a lot of planning to pull this off, but the one thing I know for sure is BTS could pull it off. They have always thought outside the box. And the bonus is BTS name would be on each of their albums, because they will be using BTS music as their music. This is were producer Suga comes in. The alteration of the sound of the song to fit with each artist style and voice. I am sorry if I offend anyone, but this is my honest opinion about this collaboration. I am not a professional so do not take me as an expert, but I was not meant to like everything. I do know what I want and what I like and sorry if it does not match yours. I love BTS style, music and what they are trying to accomplish, but honestly I do not like all of there stuff. I like 95% of their stuff and still want more stuff. Just because I am Army does not mean I have to like a 100% of their stuff. ",
            "date": "Updated January 8, 2019",
            "views": "958",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ranjana Sony",
                    "user_href": "/profile/Ranjana-Sony"
                },
                {
                    "user_id": "Marcelle Regina",
                    "user_href": "/profile/Marcelle-Regina"
                },
                {
                    "user_id": "Danel Fentone",
                    "user_href": "/profile/Danel-Fentone"
                },
                {
                    "user_id": "Lakaia Kiwi",
                    "user_href": "/profile/Lakaia-Kiwi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lyndsey Jin",
                "href": "/profile/Lyndsey-Jin"
            },
            "answer_text": "This time, both fan clubs will use live broadcasts and online promotions to let their fans buy each other's new singles. The news of this cooperation/agreement has attracted a huge amount of attention. It is said that they will use Excel to record each others' order numbers/amounts. Then they will exchange it one-to-one; for every BTS single purchased by Nicki Minaj fan club, the BTS fan club will buy the same amount of Nick Minaj's new single releasing the next day. Nicki Minaj and BTS Fan Clubs to Collaborate for a New Record This week, the US Billboard rankings had a big blow from a foreign power: BTS. The BTS boy group from South Korea released their first English-only single, Dynamite. The song style is one of the most popular trends this year, which is American Disco in the 1980s. This retro style is well prepared. BTS, the #1 boy group from South Korea, often: toured in Europe and the United States, swept the music charts in various countries and won many pop music awards. They are undoubtedly the representation of globalization in the music market and economy. And because BTS fan club has strong and many purchasing powers and data processing capabilities, Dynamite's streaming media exploded. On the very first day of release, Youtube's click rate reached 100 million, breaking the record and making this song expected to hit the championships(Billboard) this week. BTS actually has never won a Billboard championship for single albums. The US support rate is not so high, and BTS fans will not relax until the Billboard's official deadline. In order to win the championship, many Plan Bs have been formulated, just in case. Today, the fan club that Nicki Minaj herself followed and the BTS fan club have reached a collaboration agreement. Why chooseNicki Minaj's fan club? This is because her fans have the most purchasing power this year, and Ty Dolla $ign announced a new single with Nicki Minaj, releasing this Friday. In addition, BTS and Nicki Minaj have collaborated before, so the fans have long been good friends. Moreover, judging from this week's single album champion, everyone now can see the underlying reason with Nicki Minaj at the top. This time, two fan clubs will use live broadcast and online promotion to let their own fans buy each other's new singles. This cooperation agreement has attracted widespread attention. It is said that they will use the EXCEL to record the order numbers/amount generated by each fan club. Then, they will exchange it one-to-one. BTS's fans buy one song of Nicki Minaj, then Nicki Minaj's fans will buy one song of BTS and vise versa. For example, in this event, if Nicki Minaj fans brought 10,000 paid download sales to BTS, then BTS fans will return 10,000 paid downloads for Nicki Minaj the next week and submit to each other all the order numbers with screenshots as proof. How BTS and Nicki Minaj Fan Clubs Collaborate? Today, Nicki Minaj's fans collectively helped BTS's new single, \"Dynamite,\" to hit the charts, where they all purchase a real order. Tomorrow, BTS fan club will help Nicki Minaj's new single \"Expensive\" to hit the charts, similarly placing orders. This way, the two fan clubs are linked, and the strongest of the strong purchasing power is used to achieve a stable throne, where both received good results. It's a win-win. However, with the deadline for the rankings/billboard not yet finalized, the Nicki Minaj fan club has proposed an additional condition. The condition states that BTS fans must help Nicki Minaj fans to increase the views for \"Anaconda\" on YouTube after meeting the other requirements. BTS ARMY has to help \"Anaconda\" reach 1 billion views, where the current number is 950 million, meaning that BTS fans need to contribute 50 million YouTube clicks to Nicki Minaj. For such conditions, BTS fans were very accepting. Many Korean fans said that the Nicki Minaj fan club had found the right fan club. This is what they do best and also stating that the 50 million views 100 percent will be completed on time. Today, both fan clubs have called on their fans to start buying BTS's new single \"Dynamite\" and pre-ordering Nicki Minaj's new single \"Expensive.\" They also encouraged fans who already bought the albums from participating in the listing(for billboard championship), using hashtag #BARBZXARMYPOWER to show their contribution. There is much controversy about such behavior. Some people will doubt how genuine this single album championship will be? Will this counted as cheating? But I think these events are all just \"passing by.\" As time goes on, people will no longer remember how this championship single came from years later. They will only remember that \"Dynamite\" is the first Korean single album championship in the history of Billboard. After all, people are like this many times, only looking at the results but not the process. I think, whether you like BTS or not, you cannot deny it that they are making history. And as long as Billboard does not say that the BTS fan club is cheating, there will be no cheating. Because all the rules, ranking, and championship are all officially made and determined by Billboard, no matter what method is used, as long as the results/outcomes are not invalidated, they are all compliant and legal in the rules to hit the list. As long as the title of the single is on board, no one can say that it is unworthy. If you want to scold or judge, you can only blame Billboard as an institution that is no longer the same and has flawed rules. So will the next champion single be \"Priceless Sister\"? ",
            "date": "Answered August 30, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Queen Batac",
                "href": "/profile/Queen-Batac"
            },
            "answer_text": "I have no right to judge the group’s decisions to collab to whoever artists they want. And I have no judgement on how they said: “Yes, this definitely could be in the song.” But since questions like these keep popping up maybe it’s okay to voice out my opinions. When I first heard they will be collaborating with Nicki my first thought was: “Nahh. They have very different styles in music. And i don’t think Nicki will compromise.” But since I support everything they do - i mean, these are my kings, they are best at what they do - so i just waited and see if they can actually pull it off And then …. they didn’t. (I’m sorry please don’t roast me. I love them still like a proud momma) The first time I heard it I was like: “That’s it ?? That’s the collab? I expected better”, then i listened to Nicki’s part over and over listening to its lyrics. It really is her style, its very Nicki, very empowering (as a woman). Then I found myself really liking her verse. I was actually rapping with her. But whenever I listened to it with the rest of the song, it just doesn't fit right. It sounded like its half-done. Maybe i was right, Nicki will not compromise. It does not sound like a collab, its more like a “collage” … if you know what i mean. Everything I said is not “a fact” okay. It’s all me, just me.  ",
            "date": "Updated April 5, 2019",
            "views": "47",
            "upvotes": " View 65 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Arianna-McNair"
                },
                {
                    "user_id": "Ranjana Sony",
                    "user_href": "/profile/Ranjana-Sony"
                },
                {
                    "user_id": "Sae Ali",
                    "user_href": "/profile/Sae-Ali"
                },
                {
                    "user_id": "Katharina Schwenk",
                    "user_href": "/profile/Katharina-Schwenk"
                },
                {
                    "user_id": "Socles Joyce Fong",
                    "user_href": "/profile/Socles-Joyce-Fong"
                },
                {
                    "user_id": "Sakambari Dash",
                    "user_href": "/profile/Sakambari-Dash"
                },
                {
                    "user_id": "Krystal Vallitle",
                    "user_href": "/profile/Krystal-Vallitle"
                },
                {
                    "user_id": "Barbara Varova",
                    "user_href": "/profile/Barbara-Varova"
                },
                {
                    "user_id": "Reem Elkelish",
                    "user_href": "/profile/Reem-Elkelish"
                },
                {
                    "user_id": "Shreosi Datta",
                    "user_href": "/profile/Shreosi-Datta"
                },
                {
                    "user_id": "Nicole Astolfi",
                    "user_href": "/profile/Nicole-Astolfi-1"
                },
                {
                    "user_id": "Diana Ward",
                    "user_href": "/profile/Diana-Ward-5"
                },
                {
                    "user_id": "Melanie-Marie Rau",
                    "user_href": "/profile/Melanie-Marie-Rau"
                },
                {
                    "user_id": "Eluney Barrera",
                    "user_href": "/profile/Eluney-Barrera"
                },
                {
                    "user_id": "Mya Smith",
                    "user_href": "/profile/Mya-Smith-61"
                },
                {
                    "user_id": "Chase Barber",
                    "user_href": "/profile/Chase-Barber-7"
                },
                {
                    "user_id": "Pravindya Abeygunawardana",
                    "user_href": "/profile/Pravindya-Abeygunawardana"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jennifer-N"
                },
                {
                    "user_id": "Halima Ali",
                    "user_href": "/profile/Halima-Ali-32"
                },
                {
                    "user_id": "Historia Maria",
                    "user_href": "/profile/Historia-Maria"
                },
                {
                    "user_id": "PrincessJin Taekook",
                    "user_href": "/profile/PrincessJin-Taekook"
                },
                {
                    "user_id": "Alex Smith",
                    "user_href": "/profile/Alex-Smith-1834"
                },
                {
                    "user_id": "Joe Le",
                    "user_href": "/profile/Joe-Le-28"
                },
                {
                    "user_id": "Milica Lukic",
                    "user_href": "/profile/Milica-Lukic-2"
                },
                {
                    "user_id": "Karissa Mitchell",
                    "user_href": "/profile/Karissa-Mitchell"
                },
                {
                    "user_id": "Sanskriti Balaji",
                    "user_href": "/profile/Sanskriti-Balaji"
                },
                {
                    "user_id": "Adina Ackerman",
                    "user_href": "/profile/Adina-Ackerman-1"
                },
                {
                    "user_id": "Emily Mccracken",
                    "user_href": "/profile/Emily-Mccracken-6"
                },
                {
                    "user_id": "Kadeem Deshong",
                    "user_href": "/profile/Kadeem-Deshong"
                },
                {
                    "user_id": "Ashleigh Loa",
                    "user_href": "/profile/Ashleigh-Loa"
                },
                {
                    "user_id": "Shumaila Mirza",
                    "user_href": "/profile/Shumaila-Mirza"
                },
                {
                    "user_id": "Lyndie Slack",
                    "user_href": "/profile/Lyndie-Slack"
                },
                {
                    "user_id": "Goddess Douglas",
                    "user_href": "/profile/Goddess-Douglas"
                },
                {
                    "user_id": "Lee Show",
                    "user_href": "/profile/Lee-Show-2"
                },
                {
                    "user_id": "Rayanna Perez",
                    "user_href": "/profile/Rayanna-Perez"
                },
                {
                    "user_id": "Grace Yang",
                    "user_href": "/profile/Grace-Yang-78"
                },
                {
                    "user_id": "Waitingfortheapocalypse",
                    "user_href": "/profile/Waitingfortheapocalypse"
                },
                {
                    "user_id": "Zus Rotteveel",
                    "user_href": "/profile/Zus-Rotteveel"
                },
                {
                    "user_id": "Nightlight",
                    "user_href": "/profile/Nightlight-3"
                },
                {
                    "user_id": "San Ash",
                    "user_href": "/profile/San-Ash-5"
                },
                {
                    "user_id": "Psychotic Bunnie",
                    "user_href": "/profile/Psychotic-Bunnie"
                },
                {
                    "user_id": "Sam Geary",
                    "user_href": "/profile/Sam-Geary-4"
                },
                {
                    "user_id": "Esmeralda Correa",
                    "user_href": "/profile/Esmeralda-Correa"
                },
                {
                    "user_id": "Urmila Indora",
                    "user_href": "/profile/Urmila-Indora-1"
                },
                {
                    "user_id": "Rebecca Williams",
                    "user_href": "/profile/Rebecca-Williams-553"
                },
                {
                    "user_id": "Sarina Velsa",
                    "user_href": "/profile/Sarina-Velsa"
                },
                {
                    "user_id": "Daniella Pegg",
                    "user_href": "/profile/Daniella-Pegg"
                },
                {
                    "user_id": "Lakaia Kiwi",
                    "user_href": "/profile/Lakaia-Kiwi"
                },
                {
                    "user_id": "Key Manatad",
                    "user_href": "/profile/Key-Manatad"
                },
                {
                    "user_id": "Luis Martin",
                    "user_href": "/profile/Luis-Martin-50"
                },
                {
                    "user_id": "Rosie Dela",
                    "user_href": "/profile/Rosie-Dela"
                },
                {
                    "user_id": "Yui Lee",
                    "user_href": "/profile/Yui-Lee-1"
                },
                {
                    "user_id": "Hannah Pena",
                    "user_href": "/profile/Hannah-Pena-3"
                },
                {
                    "user_id": "Jamie Schneider",
                    "user_href": "/profile/Jamie-Schneider-34"
                },
                {
                    "user_id": "Yashica Sadam",
                    "user_href": "/profile/Yashica-Sadam"
                },
                {
                    "user_id": "Christina Triantafyllidou",
                    "user_href": "/profile/Christina-Triantafyllidou"
                },
                {
                    "user_id": "C.Baker",
                    "user_href": "/profile/C-Baker-21"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dimples-Son"
                },
                {
                    "user_id": "Haku Judas",
                    "user_href": "/profile/Haku-Judas"
                },
                {
                    "user_id": "Darka Novicic",
                    "user_href": "/profile/Darka-Novicic"
                },
                {
                    "user_id": "Hazel Roberts",
                    "user_href": "/profile/Hazel-Roberts-6"
                },
                {
                    "user_id": "Sumaia Afroz",
                    "user_href": "/profile/Sumaia-Afroz"
                },
                {
                    "user_id": "Kajsa Uppsten",
                    "user_href": "/profile/Kajsa-Uppsten"
                },
                {
                    "user_id": "Chloe Russell",
                    "user_href": "/profile/Chloe-Russell-34"
                },
                {
                    "user_id": "Arshia Kapoor",
                    "user_href": "/profile/Arshia-Kapoor-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seli Jajoo",
                "href": "/profile/Seli-Jajoo"
            },
            "answer_text": "Honestly I liked it. TBH I was kind of underwhelmed the first time I listen to Idol. It's a bad song it just felt a little off in my personal opinion. She gave the song a boost. “ What's good Korea?” I also appreciate the fact she toned down her lyrics to fit the song. What I didn't appreciate was all of the misogyny and “slut shaming\" I've read regarding her involvement in the song and BTS in general. It took everything in my power not to tear people a new one and call them out on their B.S. Also people keep bringing up her brother, homophobic lyrics, and that dirty dumb looking dude she supposed to be on tour with. Like a presidential election, BigHit should have vetted her before involving her with BTS. <--------- This is pretty much what I keep seeing on forums . I understand her stance regarding her brother, but I don't agree with it.I'm not a die hard fan of hers, so I don't know which lyrics they're talking about. I didn't go search them out, but someone said they could up to interpretation.That dirty dude I know nothing about, but if she wants to be associated with him, that's on her.Like I said, I liked it. I'm just not sure the all the negativity is warranted. ",
            "date": "Answered August 25, 2018",
            "views": "13",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Indurani Byju",
                    "user_href": "/profile/Indurani-Byju"
                },
                {
                    "user_id": "Ranjana Sony",
                    "user_href": "/profile/Ranjana-Sony"
                },
                {
                    "user_id": "Nancy O. Obi",
                    "user_href": "/profile/Nancy-O-Obi"
                },
                {
                    "user_id": "Olivia Godson",
                    "user_href": "/profile/Olivia-Godson"
                },
                {
                    "user_id": "Shannon Leigh",
                    "user_href": "/profile/Shannon-Leigh-55"
                },
                {
                    "user_id": "Ayu Thakur",
                    "user_href": "/profile/Ayu-Thakur"
                },
                {
                    "user_id": "Aryan Mudgal",
                    "user_href": "/profile/Aryan-Mudgal-3"
                },
                {
                    "user_id": "Historia Maria",
                    "user_href": "/profile/Historia-Maria"
                },
                {
                    "user_id": "Goddess Douglas",
                    "user_href": "/profile/Goddess-Douglas"
                },
                {
                    "user_id": "Keira Spurrell",
                    "user_href": "/profile/Keira-Spurrell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dionne Estrada",
                "href": "/profile/Dionne-Estrada"
            },
            "answer_text": "First off, thank you for the question. I am very 50/50 toward this collab if I were to give my honest opinion on this. Now, I am not against their collaboration but overall…I am not necessarily a huge fan either. BTS and Nicki Minaj came to me like a polar opposites kind of combo. The song itself, the original track is good, but when Nicki’s verse was add, it kind of fell short a bit for me. I just felt like other artists with the same beliefs as them would be a better fit for the song. Yes, Nicki had made good songs, but most of her music is more on a really mainstream American Pop kind of vibe, where as BTS is a bit more diverse from that. Not to mention the kind of reputation Nicki had, tbh, I was a little worried before their MV was release, I was anxious as to how would they pull it off, without it looking too overwhelming toward their audience. In a whole, I am probably a bit biased as well, since I am not a huge Nicki Minaj fan, though her songs are nice, her MVs made me want to stay away from watching MVs. ",
            "date": "Answered November 11, 2018",
            "views": "513",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gayathri Grace",
                    "user_href": "/profile/Gayathri-Grace"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kayla Nunyabiz",
                "href": "/profile/Kayla-Nunyabiz"
            },
            "answer_text": "I loved it! I see a lot of people saying it was unnecessary, but who cares. The boys are big fans (HUGEEE fans) of Nicki, and to see them collaborate with her they were super stoked! I love Nicki, and her rap was actually cute and not sexual this time which made me super happy. It honestly would’ve been better if she would’ve had interactions with the boys. For those who were saying it was unnecessary, do you also think the Boy with Luv collab was unnecessary? Mic Drop? CNS? These type of collabs allow BTS to have more recognition worldwide. I even met an army who became a fan of BTS through the Nicki collab and I thought it was so nice. Of course you may not like the collab, but saying it was unnecessary is kinda disrespectful. ",
            "date": "Answered September 30, 2019",
            "views": "134",
            "upvotes": " Answer requested by Jalen Lee",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nadia-269"
                },
                {
                    "user_id": "Johnnique Paul",
                    "user_href": "/profile/Johnnique-Paul-1"
                },
                {
                    "user_id": "Shannon Leigh",
                    "user_href": "/profile/Shannon-Leigh-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grace Ann",
                "href": "/profile/Grace-Ann-81"
            },
            "answer_text": "To be honest, when I first had her do the intro I was like okayy, not bad, keep it coming. Then RM, Jhope and Suga came in and I was like the rap line are killing it, this could be the best part yet. The others did their thing and it was impressive. Then Nicki’s part came and honestly, I was let down, I didn't feel her part at all in the song. I tried listening to it a couple of times thinking my dislike of it would go but i still found it off. The beats and her intonation didn't do it for me. Till date i skip her part. Her part wasn't needed. Don't get me wrong, i don't hate her. These are just my thoughts on her part. But since bts wanted her in it, I respect that. ",
            "date": "Answered February 4, 2019",
            "views": "191",
            "upvotes": " Answer requested by Jalen Lee",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Orenji-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sef Lok",
                "href": "/profile/Sef-Lok"
            },
            "answer_text": "I was sceptical at first when I found out that she would be featured on idol, because I couldn't imagine The Nicki Minaj on a track with my boys. Like I've listened to her for so much longer than i have to BTS and she's a well known artist and it just made it clear to me again where BTS are at now. Though I was excited, I wasn't sure how she would fit into the song and Music video, but all my expectations were exceeded (?) and there's no one else who could've pulled it off the way she did. BTS said they only collab with people they think fit into their style and they get along with/like and they did not lie. ",
            "date": "Answered November 11, 2018",
            "views": "231",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "GodSeeMeGaming Good",
                    "user_href": "/profile/GodSeeMeGaming-Good"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nadia-269"
                },
                {
                    "user_id": "Johnnique Paul",
                    "user_href": "/profile/Johnnique-Paul-1"
                },
                {
                    "user_id": "Gloria Tav",
                    "user_href": "/profile/Gloria-Tav"
                },
                {
                    "user_id": "Shannon Leigh",
                    "user_href": "/profile/Shannon-Leigh-55"
                },
                {
                    "user_id": "Ayu Thakur",
                    "user_href": "/profile/Ayu-Thakur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranya Ilayan",
                "href": "/profile/Ranya-Ilayan"
            },
            "answer_text": "As always thanks for asking! Well, I kinda like it. Not only did it give them a boost in America, but it also brought a little extra life to the song. I really don’t think she should’ve said everything she did say, and at least try to make it match the message of the story, but they seemed to like having her as part of it, so, I guess we should sorta be happy for them. (Even if she jut went by her own style and not theirs.) As always thanks for asking and I look forward to answering your questions in the future. And all the BTS ARMYs out there, keep supporting our boys!!! They really do deserve it. (I will never type BTS ARMY the same way again. They may be going into the military soon X’C. I mean, my hands will move the same way, but, you know what I mean…) ",
            "date": "Answered February 4, 2019",
            "views": "232",
            "upvotes": " Answer requested by Jalen Lee",
            "upvoters": [
                {
                    "user_id": "Nicole Astolfi",
                    "user_href": "/profile/Nicole-Astolfi-1"
                },
                {
                    "user_id": "Chris Wilson",
                    "user_href": "/profile/Chris-Wilson-1554"
                },
                {
                    "user_id": "Historia Maria",
                    "user_href": "/profile/Historia-Maria"
                },
                {
                    "user_id": "Christina Triantafyllidou",
                    "user_href": "/profile/Christina-Triantafyllidou"
                },
                {
                    "user_id": "C.Baker",
                    "user_href": "/profile/C-Baker-21"
                },
                {
                    "user_id": "Akshat Sinha (अक्षत सिन्हा)",
                    "user_href": "/profile/Akshat-Sinha-अक्षत-सिन्हा"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marijana Maric",
                "href": "/profile/Marijana-Maric"
            },
            "answer_text": "I think they don’t suit together,I mean,it is kinda cool but I like BTS without anything American. As its requested its just my opinion,collaboration between BTS and Nicki Minaj could be refreshing but I see BTS as cute flower boys and then comes Nicki with her raping and all other stuffs which looks like contrast next to Bangtan Boys.  YOU’LL SEE WHAT I’M TALKING ABOUT  ",
            "date": "Answered February 17, 2019",
            "views": "151",
            "upvotes": " Answer requested by Jalen Lee",
            "upvoters": [
                {
                    "user_id": "Chim Chim",
                    "user_href": "/profile/Chim-Chim-277"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aruna Persaud",
                "href": "/profile/Aruna-Persaud-2"
            },
            "answer_text": "I'm assuming you mean their hit song IDOL. To be honest I was very mixed in my opinions. I mean it was Nicki Minaj whether you like her or not she is very famous. Their collaboration just showed how famous BTS themselves have gotten. That's why I was happy about it. But on the other hand. In my opinion, Nick Minaj is someone who gains popularity by showing off her body in her music videos. Where as BTS have a bigger standing with fans who appreciate their music. They talk about quite controversial topics. Some that most people would never talk about. They talk about depression. Self love, peace, politics and so much more. So I am quite indecisive but no matter what the our boys decide I am behind them all the way. I love them so much so I don't really mind. ",
            "date": "Answered January 12, 2019",
            "views": "322",
            "upvotes": " Answer requested by Jalen Lee",
            "upvoters": [
                {
                    "user_id": "Squishy Thor Head",
                    "user_href": "/profile/Squishy-Thor-Head"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah Yin",
                "href": "/profile/Hannah-Yin-5"
            },
            "answer_text": "Honestly, I only watched that music video once and kinda hated it. I don’t think that their collaboration with Nicki Minaj added anything to the video. I don’t like her music. I’m already not an avid listener of BTS but will occasionally listen to their softer music, so adding her into the mix, just made me hate it. I thought that their collaboration with Nicki Minaj was just random and had no meaning to it. ",
            "date": "Answered January 7, 2019",
            "views": "202",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lisa Lee",
                    "user_href": "/profile/Lisa-Lee-1038"
                },
                {
                    "user_id": "Jalen Lee",
                    "user_href": "/profile/Jalen-Lee-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alyssa Snijders",
                "href": "/profile/Alyssa-Snijders"
            },
            "answer_text": "I don’t have any strong feelings about it. I like her rap, she adds a nice touch in it. Her rap itself fits the song pretty well and I don’t think it made the song bad. BTS also got more attention, which is also nice. It promoted BTS a bit more. Collaborations with Western artists will help BTS and K-Pop in the Western market and make it more well known. But I didn’t like how it didn’t flow that well from the song to her rap. It felt a bit like they didn’t know where to place it in the song, so they just choose a random place to put it in. Also Nicki has bit of a reputation, which I don’t want to explain further, so I hope it didn’t bring any bad attention to BTS.   ",
            "date": "Answered February 4, 2019",
            "views": "450",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "C. Yu",
                "href": "/profile/C-Yu-24"
            },
            "answer_text": "thanks for the request !! personally, i actually liked it. i do prefer the original but i definitely don’t mind the feature. i don’t think Nicki’s verse was too long or too short and it surprisingly fit well into the song. but if you asked me if i would be up for another BTS X Nicki Minaj collab, i would say no. BTS already has seven different members who all need to sing/rap and line distributions are already pretty uneven so i’m not the biggest fan of collaborations. ",
            "date": "Answered November 11, 2018",
            "views": "186",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "Jelaminah Roberts",
                "href": "/profile/Jelaminah-Roberts"
            },
            "answer_text": "I hate it. I prefer the original. To me, she just doesn’t fit into the song. AT ALL. I kinda feel like part of the reason she agreed was for clout. I mean think about it: - her career is going down the toilet - Cardi B has created some stiff competition - she’s a little desperate to stay on the charts (Ex. Being on “Fefe” with Takashi 69) Now the Desiigner mic drop collab, that’s my jam. ",
            "date": "Answered November 12, 2018",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Artemis",
                "href": "/profile/Artemis-232"
            },
            "answer_text": "I don’t like it. Her style in IDOL just…… didn’t match. She was wearing clothes but not very modest clothes and I personally don’t like that. Also, she is the reason why any mix of IDOL is played on radios and while I like that IDOL is being played on radio stations, it is because of Nicki and I would rather it be by BTS themselves not by a Western artist that they collaborated with. ",
            "date": "Answered March 7, 2019",
            "views": "110",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "Reem Elkelish",
                "href": "/profile/Reem-Elkelish"
            },
            "answer_text": "I personally thought it was very cool! And its an achievement! For a Kpop boy band to have Nicki Minaj, a rap superstar collaborate is quite something! Its also good exposure and a great way to promote “Idol”. It also didn’t feel off it fits well with the song nor did it feel like was a rushed collaboration for the sake of jist collaborating. It meshes really well together! ",
            "date": "Answered November 15, 2018",
            "views": "180",
            "upvotes": " View 6 Upvoters "
        },
        {
            "author_info": {
                "name": "Cheryl L. Blair",
                "href": "/profile/Cheryl-L-Blair"
            },
            "answer_text": "I hate it, BTS did not need her at all. I refuse to listen to the song with her in. Nicki Minaj really…the boys didn’t need her help to be recognized. Everyone knows them. I guess I shall say that she kind of used the boys since she hasn’t been doing anything lately and so to get recognition she collaborate a song with the boys. The song Idol will always be better without her in!! ",
            "date": "Answered November 11, 2018",
            "views": "157",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Alice Doirin",
                "href": "/profile/Alice-Doirin"
            },
            "answer_text": "Look, some people are saying that they hated the collaboration, but I think it was great. My girl didn’t even get like a whole minute in the song so you can’t say that her contributions were subpar or it didn’t flow. At first, I didn’t like it, but after a while, it grew on me. Great job Nicki! ",
            "date": "Answered February 4, 2019",
            "views": "66",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "Annie Dellaine",
                "href": "/profile/Annie-Dellaine"
            },
            "answer_text": "It was horrible. I don't see how Nicki's style matches BTS, so it was like they started doing collabs with any western artist. Nicki's part in Idol was, when it comes to rap and part in mv, seemed like it was made last minute and just shoved in the song. As if “Idol\" didnt already have horrendous lyrics, Nickis “hand in the air, pants in the air\" didnt help at all. ",
            "date": "Answered January 6, 2019",
            "views": "121",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "KitKat Okey",
                "href": "/profile/KitKat-Okey"
            },
            "answer_text": "I honestly like Nicki's part in their song! I don't really listen to the version without her in it much because they added more to the one with her in it. Not to mention her rap is catchy and I KNOW ALL OF THE WORDS xD ",
            "date": "Answered September 30, 2019",
            "views": "39",
            "upvotes": " Answer requested by Jalen Lee"
        },
        {
            "author_info": {
                "name": "Zoe",
                "href": "/profile/Zoe-812"
            },
            "answer_text": "It had to be done. But it was my bois so I had to support them anyways. I prefer the one without Nicki Minaj. But its funny cus you look at the views with and without Nicki Minaj and the gap is just funny tbh. ",
            "date": "Answered February 3, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jayleen De León",
                "href": "/profile/Jayleen-De-León"
            },
            "answer_text": "Not a fan of NM but I liked anything with BTS, she had good verses though so I enjoyed it ",
            "date": "Answered August 24, 2018",
            "views": "107",
            "upvotes": " View 2 Upvoters "
        }
    ]
}