{
    "title": "What movie is this line from “Love means never having to say you're sorry.”? - Quora",
    "tags": [
        "Movie Quotations and Dialogue",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "A. Bowdoin Van Riper",
                "href": "/profile/A-Bowdoin-Van-Riper"
            },
            "answer_text": "It’s from two movies, actually. It was made famous in Arthur Hiller’s Love Story (1970), in which Jenny (Ali McGraw) says it to Oliver (Ryan O’Neal) and Oliver later quotes it to his father (Ray Milland). But . . . It gets a reprise in the very last scene of What’s Up, Doc? (1972), Peter Bogdanovich’s love letter to the screwball comedies of the 1930s and specifically to Bringing Up Baby (1938). Howard (Ryan O’Neal, again) is telling Judy (Barbra Streisand) — who he’s fallen utterly and hopelessly in love with, even as she’s reduced his life to a complete shambles — that he’s sorry for losing his temper with her in an earlier scene. “Let me tell you something,” Judy replies. “Love means never having to say you’re sorry.” She looks at him with her enormous blue-gray eyes and her thousand-watt smile, and bats her eyelashes theatrically. He looks back at her, completely smitten. “That’s the dumbest thing I ever heard,” he says softly, and she nods enthusiastically, as if to say: “I know, right?” They smile at each other a moment longer . . . kiss . . . and the camera pans away as they begin Happily Ever After. ",
            "date": "Answered January 11, 2020",
            "views": "18",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay Ford",
                    "user_href": "/profile/Jay-Ford-63"
                },
                {
                    "user_id": "Nemo Anderson",
                    "user_href": "/profile/Nemo-Anderson"
                },
                {
                    "user_id": "Xavier Cruz",
                    "user_href": "/profile/Xavier-Cruz-1"
                },
                {
                    "user_id": "Kelly McGovern",
                    "user_href": "/profile/Kelly-McGovern-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "Hi Derek, you asked which movie \"Love means never having to say you're sorry\" comes from? I remember as a teen this was the catchphrase on movie posters in a lot of girls rooms….the movie was 1970's \"Love Story\" with Ali MacGraw and Ryan O'Neal. I've got to. think that if one does a search just using that phrase, \"Love Story\" will pop up although I haven't actually checked to be sure. Just to be clear the idea is just ridiculous…I wouldn't advise trying to be in any relationship with out knowing how to be or say you're sorry when you've screwed up or when your partner is hurt and/or in pain. ",
            "date": "Answered April 12, 2019",
            "views": "15",
            "upvotes": " View Sharers "
        }
    ]
}