{
    "title": "What are the best guitar chord progressions? - Quora",
    "tags": [
        "Chord Progressions",
        "Guitar Chords",
        "Music Theory",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Jones",
                "href": "/profile/Philip-Jones-76"
            },
            "answer_text": "I don’t buy that there are “best” chord progressions, but some are enduring. Take this one: I V vi iii IV I IV V In C: C G Am Em F C F G Bass line: C G A E F E F G This is the familiar Pachelbel Canon (transpose up 1 step), also “\"Jolly Old St Nicholas “ and “\"Let It Be Me.” Another: C Am F G The familiar foundation of “\"Heart and Soul.” Called “50’s chords”, “\"Ice Cream Chords” or “\"Doo Whop Chords.” About a million songs use it. Note: Pachelbel Canon is one of the most abused titles in the music catalogue. It has been variously listed as “Pachelbel by Canon,” “Packel Bell Canon,” and “Taco Bell Canon,” plus many more. Note 2: Bass players take heart. The bass line IS the canon. The rest is improvisation. It’s still interesting after 400 years. ",
            "date": "Answered January 11, 2017",
            "views": "412",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Rego",
                "href": "/profile/John-Rego-12"
            },
            "answer_text": "Boston, kool name btw, so many great progressions, including the time honored I VI IV V that accounted for so many songs over the decades. But, i will limit to a favorite turn around progression, that just tickles me! In key of C lets say: Cmaj7, Dm7, G13 G7#11 resolve back to Cmaj7. Sounds more difficult that it is Boston. Another dandy: Cmaj7, Em7, D#m7, Dm7, Am7 then use same last three chords above, G13 then G7#11 Cmaj7. ( can also do the progression minus the Am7, try both). Just so pleasing and melodic to my ear at least. Keep asking, tons more ideas out there, music is boundless! If of any help, let me know via upvote. Sinply indicates if folks find my input of value ",
            "date": "Answered September 9, 2019",
            "views": "145",
            "upvotes": "0"
        }
    ]
}