{
    "title": "What makes Japanese sounding music sound Japanese? - Quora",
    "tags": [
        "Japanese Music",
        "Japanese (language)",
        "Sound",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Weyl",
                "href": "/profile/Marc-Weyl"
            },
            "answer_text": "I assume you are speaking of traditional or classical Japanese music not J-Pop; this is based on two different pentatonic groups: “In” that contains mi, fa, la, ti, do and “Yo” that contains re, me, sol, la, ti So if you play just those scale steps (not both) but from one set or the other it will sound very Japanese. For example lots of people seem to be crazy about Hirajoshi (one of the “In” modes). 85% of classical Japanese music is Hirajoshi - mi, fa, la, ti, do. For “D” tuning, the most common, use D, Eb, G, A, and Bb. Play ONLY those notes (even in chords) … you will sound somewhat Japanese. Add Japanese techniques like Tsuki-iro (lit Thrust Color (quick press and release) by the way … single sharp is closer to 1/3 step than 1/2 western step and you will be sounding more Japanese. In Japanese the silence is very important, as is form, presence, and technique, but these tonic groupings will start you on the way. ",
            "date": "Answered June 30, 2019",
            "views": "823",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebekah Wilson",
                    "user_href": "/profile/Rebekah-Wilson-44"
                },
                {
                    "user_id": "Robert Wayne Smith",
                    "user_href": "/profile/Robert-Wayne-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sol Fabi",
                "href": "/profile/Sol-Fabi-1"
            },
            "answer_text": "I think it is the musical scales they use plus instrumentation (I’m assuming you are asking about traditional Japanese music) although modern Japanese music might follow some of these musical scales, the musical scales are more pentatonic (5 notes) and heptatonic (seven notes). Some of this musical scales are: Japanese musical scales The common musical instruments used in traditional Japanese music are: Koto (string instrument) Shakuhachi (wind instrument) Shamisen (string instrument) Biwa (string instrument) Taiko (drums) Tsuzumi (drums) There are more, this are some very common traditional Japanese instruments.. I think the combination of this is what makes Japanese music sound Japanese. ",
            "date": "Answered June 30, 2019",
            "views": "289",
            "upvotes": "0"
        }
    ]
}