{
    "title": "What are the top 10 motivational English songs? - Quora",
    "tags": [
        "Motivational Songs",
        "English Songs",
        "Motivation",
        "Music Recommendations",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Menon",
                "href": "/profile/Neil-Menon"
            },
            "answer_text": "Well, if Survivor's Eye of the Tiger doesn't motivate you with lyrics like this, I don't know what will..  Face to face, out in the heatHangin' tough, stayin' hungryThey stack the oddsStill we take to the streetFor the kill with the skill to survive Risin' up straight to the topHad the guts, got the gloryWent the distanceNow I'm not gonna stopJust a man and his will to survive It's the eye of the tigerIt's the thrill of the fightRisin' up to the challengeOf our rivalAnd the last known survivorStalks his prey in the nightAnd he's watching us all with theEye of the tiger Oh wait...Have you heard Celine Dion's The Power of A Dream from the 1996 Atlanta Olympics? That might give you goosebumps.  Deep within each heartThere lies a magic sparkThat lights the fire of our imaginationAnd since the dawn of manThe strength of just \"I can\"Has brought together people of all nations There's nothing ordinaryIn the living of each dayThere's a special partEvery one of us will play Your mind will take you farThe rest is just pure heartYou'll find your fate is all your own creationAnd every boy and girlAs they come into this worldThey bring the gift of hope and inspiration There's so much strength in all of usEvery woman child and manIt's the moment that you think you can'tYou'll discover that you can Feel the flame forever burnTeaching lessons we must learnTo bring us closer to the power of the dreamAs the world gives us its bestTo stand apart from all the restIt is the power of the dream that brings us here (The power of the dream)(The faith in things unseen)(The courage to embrace your fear)(No matter where you are)(To reach for your own star)To realize the power of the dreamTo realize the power of the dream Well, if this still isn't enough to get you going, you could try listening to The Beatles Let it Be When I find myself in times of troubleMother Mary comes to meSpeaking words of wisdom, let it be1 And in my hour of darknessShe is standing right in front of meSpeaking words of wisdom, let it be And when all the brokenhearted peopleLiving in the world agreeThere will be an answer, let it be For though they may be partedThere is still a chance that they will seeThere will be an answer, let it be Let it be, let it beLet it be, let it beWhisper words of wisdomLet it be1 And when the night is cloudyThere is still a light that shines on meShine on until tomorrow, let it be I wake up to the sound of musicMother Mary comes to meSpeaking words of wisdom, let it be Let it be, let it beLet it be, let it beYeah, there will be an answer let it be1 Let it be, let it beLet it be, let it beWhisper words of wisdomLet it be Let it be, let it beLet it be, yeah, let it beWhisper words of wisdomLet it be Well, there are so many more!! These songs always get ME going!! Hope they work for you too!! ",
            "date": "Answered April 4, 2016",
            "views": "74",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikita Thorat",
                    "user_href": "/profile/Nikita-Thorat-4"
                },
                {
                    "user_id": "Adarsh Kumar Amar",
                    "user_href": "/profile/Adarsh-Kumar-Amar-2"
                },
                {
                    "user_id": "Piyush Singh",
                    "user_href": "/profile/Piyush-Singh-1133"
                },
                {
                    "user_id": "Ashish Tiwari",
                    "user_href": "/profile/Ashish-Tiwari-5"
                },
                {
                    "user_id": "Swapnil Verma",
                    "user_href": "/profile/Swapnil-Verma-17"
                },
                {
                    "user_id": "Dyuti Coomar",
                    "user_href": "/profile/Dyuti-Coomar"
                },
                {
                    "user_id": "Arjun Chandur",
                    "user_href": "/profile/Arjun-Chandur"
                },
                {
                    "user_id": "Ram Kowshik",
                    "user_href": "/profile/Ram-Kowshik"
                },
                {
                    "user_id": "Divyam Goyal",
                    "user_href": "/profile/Divyam-Goyal-2"
                },
                {
                    "user_id": "Praveen Devangad",
                    "user_href": "/profile/Praveen-Devangad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kajal Meena",
                "href": "/profile/काजल-मीना-Kajal-Meena"
            },
            "answer_text": "Free advise : Read only Bold letters if you just want song names. Fade up off All the nuisance going on in life,well listen The Nights by Avicii it will lighten your mood.You know what? World gonna know your name one day so just don’t sit instead do whatever it takes(imagine dragons) and you will be standing in Hall of fame(by The scripts)If you ever feel like giving up, You just remeber tha we were all meant to Fly(Avril Lavigne)So Rise (katy Perry) above and Never give up by( Sia ).Feeling fragile, reached your limits? then let me tell you What doesn’t kill you make you stronger so listen Stronger by Kelly Clarkson.Wanted to be perfect,but dear Nobody’s perfect just as Jessie J sang. So chill.Don’t underestimate youself , you know it is really depressing! You are Unstoppable (by Sia) So motivate yourself with Who Says by Selena, Scars to your beautiful by Alessia Cara.Feeling like surrounded by Negativity, loneliness or Past mistakes just have a break and Let it go (frozen).Stop doubting yourself and don’t set your limits Because thats what Superheroes (by The script) do.Are you feeling like You are just running, not feeling peace , money made you its puppet , then dear friend you need to start living. Listen Counting Stars by One republic and Price Tag by Jessie J.Well I know your battle isn’t over yet. You have lot of Fight (by Rachel Plattern) left in you.Don’t feel like you are lonely, nobody is lonely unless you believe “Someone watching over me” (by Hilary Duff).Now at the end I would Like to say that We are the champions (Queen), So Don’t ask yourself That “How Far I’ll go” (by Alessia Cara).There are many songs but these songs really boost my mood I hope you get your motivation by them. P.S. I am not advertising any song here XD. Thanks for reading. Kj(^_-) ",
            "date": "Answered May 2, 2018",
            "views": "103",
            "upvotes": " View 84 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Stark",
                    "user_href": "/profile/Tony-Stark-1041"
                },
                {
                    "user_id": "Pingchieh Tew",
                    "user_href": "/profile/Pingchieh-Tew"
                },
                {
                    "user_id": "Paarth Thakur",
                    "user_href": "/profile/Paarth-Thakur-1"
                },
                {
                    "user_id": "Rahul Shinde",
                    "user_href": "/profile/Rahul-Shinde-93"
                },
                {
                    "user_id": "Nikhil Bhavar",
                    "user_href": "/profile/Nikhil-Bhavar-1"
                },
                {
                    "user_id": "Sarvadnya Sawant",
                    "user_href": "/profile/Sarvadnya-Sawant-2"
                },
                {
                    "user_id": "Gowtham Ravi",
                    "user_href": "/profile/Gowtham-Ravi-70"
                },
                {
                    "user_id": "Megha a.k.a. Sreelakshmi",
                    "user_href": "/profile/Megha-a-k-a-Sreelakshmi"
                },
                {
                    "user_id": "Prateek Srivastava",
                    "user_href": "/profile/Prateek-Srivastava-533"
                },
                {
                    "user_id": "Toxic the Casual The Casual",
                    "user_href": "/profile/Toxic-the-Casual-The-Casual"
                }
            ]
        }
    ]
}