{
    "title": "Whatever happened to the 70s rock group Supertramp? - Quora",
    "tags": [
        "Supertramp",
        "1970s Music",
        "Classic Rock Music",
        "Rock and Roll Music",
        "1970s",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary McAdam",
                "href": "/profile/Gary-McAdam-2"
            },
            "answer_text": "No longer active nowadays I’m afraid - they last toured in 2010, but with only three-fifths of the classic line-up on board. Co-founder and primary songwriter Roger Hodgson left the band in 1983 and bassist Dougie Thomson followed suit five years later. Keyboardist Rick Davies (the band’s other main songwriter) thereafter was the main creative driving force, drafting in additional full and/or touring members to work with him, saxophonist John Helliwell & drummer Bob Siebenberg. Davies had to take a break from the business to undergo emergency treatment for multiple myeloma in 2015 (causing a scheduled tour to be cancelled) and the band has been dormant from that point on to the present day.[1] The only one still plying his trade is (ironically enough) Hodgson, who would have been out & about on tour this summer had it not been for the pandemic. He spent a decade out of the spotlight and away from music after the release of his second post-Supertramp solo album “Hai Hai” in 1987 (partly whilst recovering from injuries sustained in a fall at his home), but returned to recording & touring in 1997 and has been active ever since.[2] Footnotes[1] Supertramp - Wikipedia[2] Roger Hodgson - Wikipedia",
            "date": "Answered August 26, 2020",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Edmund Grondine",
                    "user_href": "/profile/Edmund-Grondine"
                },
                {
                    "user_id": "Gary Saunders",
                    "user_href": "/profile/Gary-Saunders-52"
                },
                {
                    "user_id": "Glenn Winchell",
                    "user_href": "/profile/Glenn-Winchell-1"
                },
                {
                    "user_id": "Dan Wofford",
                    "user_href": "/profile/Dan-Wofford-1"
                },
                {
                    "user_id": "Paul Murray",
                    "user_href": "/profile/Paul-Murray-37"
                },
                {
                    "user_id": "Charles Armstrong",
                    "user_href": "/profile/Charles-Armstrong-57"
                },
                {
                    "user_id": "Byron Quiñónez",
                    "user_href": "/profile/Byron-Quiñónez"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Heaton",
                "href": "/profile/David-Heaton-16"
            },
            "answer_text": "Officially, they’re on hiatus. But, it seems unlikely that they’ll ever reform as the two main writers, Rick Davies and Roger Hodgson fell out over “musical differences” and the fall out has been quite acrimonious at times. Davies has also had health issues that prevented him from playing. Thanks for the A2A. ",
            "date": "Answered August 26, 2020",
            "views": "411",
            "upvotes": " Answer requested by Gary Saunders"
        }
    ]
}