{
    "title": "What are some of your favorite oldies songs? - Quora",
    "tags": [
        "Oldies",
        "Favorites",
        "Classic Rock Music",
        "Music Recommendations",
        "Musicians",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johanes Aditya",
                "href": "/profile/Johanes-Aditya"
            },
            "answer_text": "Last week I was introduced to a remarkable female singer which shone since the 70s, Roberta Flack; since then I have not been able to get her voice out of my head. The lyrics of the songs she sang are pretty bold and combined with her voice (and sometimes with another amazing male singer) she produced songs that are pretty touching. These are a few of my favorites:1. Killing Me Softly With His Song (solo)  2. The Closer I Get to You (duet with Donny Hathaway)  3. Tonight I Celebrate My Love (duet with Peabo Bryson)  4. Where Is The Love? (duet with Donny Hathaway)  Edit 20151127: add videos to answer for convenience.",
            "date": "Answered November 26, 2015",
            "views": "596",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Delgado",
                    "user_href": "/profile/Elizabeth-Delgado-4"
                },
                {
                    "user_id": "Jerilyn Friedmann Burgess",
                    "user_href": "/profile/Jerilyn-Friedmann-Burgess"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhonda Barrett",
                "href": "/profile/Rhonda-Barrett-29"
            },
            "answer_text": "No. 1 is cheesy and cliche BUT it makes me smile. I sing this a lot, especially at work and my staff think “she’s off again!” I’ve listed a few because I love music - all types of music - it’s so therapeutic for the mind and soul. Doris Day: Que Sera Sera…. I love it because it’s nostalgic, my mother used to sing it a lot too. It’s one for the girls but it’s happy and uplifting…  Beach Boys: Help Me Rhonda… my parents would sing this to me time and again because they loved the name! I have also had this played for me many times over the years. But guess what? Who could simply NOT love the Beach Boys??? They were great - superb collection of songs - but this one, it holds special meaning and memories.  Hotel California… awesome track, I’ve always loved this song a great deal.  Romeo & Juliet… Dire Straits were yet again another phenomenal band. “So Far Away” holds magic, as does Brothers In Arms, but I love Romeo & Juliet. It’s an all time classic and simply superb.  Music is one of life’s simple pleasures - it’s just so good to listen to some sounds to put your mind and soul in the happy zone music bestows. ",
            "date": "Answered April 14, 2019",
            "views": "451",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Griffin",
                    "user_href": "/profile/Jack-Griffin-132"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rashi",
                "href": "/profile/Rashi-36"
            },
            "answer_text": " As we all know about this phrase i.e old is gold and this fit for old songs,like if you looking for some best old songs from various popular singers like Mohammad Rafi, Lata Mangeshkar, Kishore Kumar, Asha Bhosle and more. Awara Hoon - MukeshAaiye Meherbaan - Asha BhosleAaja Re Pardesi - Lata MangeshkarChoudhvin Ka Chand Ho - Mohammed RafiAjeeb Dastan Hai Ye - Asha BhosleKhoya Khoya Chand - Mohammed RafiEhsaan Tera Hoga- Mohammed RafiMain Zindagi Ka Saath - Mohammed RafiLag Ja Gale - Lata MangeshkarDiwana Hua Badal- Mohammed RafiI am sure you will love these Old Songs. And if you looking for some best hollywood classic songs from various famous singers and you can play one of these songs - 1. \"Amazed,\" Lonestar Lyrics You'll Love: \"I don't know how you do what you do/I'm so in love with you/It just keeps getting better\". 2. \"As,\" Stevie Wonder Lyrics You'll Love: \"As around the sun the earth knows she's revolving/And the rosebuds know to bloom in early May/Just as hate knows love's the cure/You can rest your mind assure/That I'll be loving you always\". 3. \"As Time Goes By,\" Dooley Wilson (from Casablanca) Lyrics you'll love: \"And when two lovers woo/They still say, 'I love you.'/On that you can rely/No matter what the future brings/As time goes by.\" 4. \"A Thousand Years,\" Christina Perri (from Twilight: Breaking Dawn) Lyrics you'll love: \"Darling, don't be afraid/I have loved you/For a thousand years/I'll love you for a thousand more\". 5. \"At Last,\" Etta James Lyrics you'll love: \"And here we are in heaven/for you are mine/at last\" 6. \"Better Together,\" Jack Johnson Lyrics you'll love: \"It's not always easy and/Sometimes life can be deceiving/I'll tell you one thing, it's always better when we're together\" 7. \"By Your Side,\" Sade Lyrics you'll love: \"When you're on the outside baby and you can't get in/I will show you you're so much better than you know\" I am sure you will love these few old & classic songs collection. ",
            "date": "Answered September 20, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                },
                {
                    "user_id": "Trisha Ganatra",
                    "user_href": "/profile/Trisha-Ganatra"
                }
            ]
        },
        {
            "author_info": {
                "name": "James O'Connor",
                "href": "/profile/James-OConnor-8"
            },
            "answer_text": "I guess I have to think, \"what are oldies to me?\" I'm old enough to remember 60's radio, so things from then? Maybe the 70's, since I was in high school and actually buying music? The 80's were still 30 years ago (plus), so there's a possibility. Nah, I'll stick with what even I think is old enough, the 60's. The Lovin' Spoonful: “Summer In The City”  The Turtles: “Happy Together:  The Zombies: “She's Not There”  The Troggs: “Wild Thing”  The Kinks: “You Really Got Me”  The Yardbirds: “For Your Love”  Steppenwolf: “Born To Be Wild”  Shocking Blue: “Venus”  Los Bravos: “Black Is Black”  The Animals: “Please Don't Let Me Be Misunderstood”  There's a ten list for you. ",
            "date": "Updated March 18, 2020",
            "views": "11",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Leighton",
                    "user_href": "/profile/Daniel-Leighton-12"
                },
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                },
                {
                    "user_id": "Kim Jorgensen",
                    "user_href": "/profile/Kim-Jorgensen-15"
                },
                {
                    "user_id": "Johan De Waal",
                    "user_href": "/profile/Johan-De-Waal-10"
                },
                {
                    "user_id": "Lauren Flynn",
                    "user_href": "/profile/Lauren-Flynn-15"
                },
                {
                    "user_id": "Mayor Iguana",
                    "user_href": "/profile/Mayor-Iguana"
                },
                {
                    "user_id": "Dan Traeger",
                    "user_href": "/profile/Dan-Traeger"
                },
                {
                    "user_id": "Roberta Shapard",
                    "user_href": "/profile/Roberta-Shapard-3"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                },
                {
                    "user_id": "Jerilyn Friedmann Burgess",
                    "user_href": "/profile/Jerilyn-Friedmann-Burgess"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Hearn",
                "href": "/profile/Brian-Hearn-3"
            },
            "answer_text": "I will always love the Beatles, but that is too easy. One of my favorites of all time that usually is never mentioned is Jackie Wilson. In my opinion he is one of the greatest singers of all time! Here is a list of songs that will make you melt because he was such a phenomenal singer he made it sound like the song was coming straight from heaven. Lonely TeardropsI'll Be SatisfiedThat's Why (I Love You So)StardustReet Petite ( The Finest Girl You Ever Want To Meet)To Be LovedThat is just a short list, but anything you find is just amazing. His most popular song is(Your Love Keeps Lifting Me) Higher and Higher, but this song doesn't do his amazing talent justice.  ",
            "date": "Answered March 1, 2016",
            "views": "505",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "A. Michael B. Pabello",
                "href": "/profile/A-Michael-B-Pabello"
            },
            "answer_text": "For me, my favorite olds songs comes from the 1930–1950’s era. Cover version of “Stardust” by Nat King Cole in 1956 is a favorite. The music was written by Hoagy Carmichael in 1927 and Mitchell Parish wrote the lyrics in 1927. “Unchained Melody” by Alex North and Hy Zaret is a 1955 song from a little-known film called “Unchained” The cover version of The Righteous Brothers was used in the movie “Ghost”(1990) starring Demi Moore and Patrick Swayze. “Can’t Help Falling In Love” by Elvis Presley recorded in 1961 for the album Blue Hawaii. “No Other Love” by Jo Stafford in 1950 written by Bob Russell and Paul Weston based on the Frederic Chopin’s piano piece. \"Its Been a Long Long Time” is a song written by Jule Styne and Sammy Cahn that was a hit at the end of Second World War. Sang by Kitty Kallen in 1945. ",
            "date": "Answered May 16, 2019",
            "views": "91",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                },
                {
                    "user_id": "Elizabeth Delgado",
                    "user_href": "/profile/Elizabeth-Delgado-4"
                },
                {
                    "user_id": "Gina Andrews",
                    "user_href": "/profile/Gina-Andrews-29"
                },
                {
                    "user_id": "Jose Rivera",
                    "user_href": "/profile/Jose-Rivera-1017"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Jim Farrington",
                    "user_href": "/profile/Jim-Farrington-2"
                },
                {
                    "user_id": "Jorge Miguel Frankon",
                    "user_href": "/profile/Jorge-Miguel-Frankon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catherine J Fusco",
                "href": "/profile/Catherine-J-Fusco"
            },
            "answer_text": "My Prayer\"\"\"anything The Platters \"\"Maybe\"\"Chantells\"\"What A Difference A Day Makes\"\"\" Dinah WashingtonThe Supremes \"'Everything>.The Righteous Brothers\"\"\"Everything>Stevie Wonder Everything>Yakette Yack>The Four Tops>>Everything>The Tempations Everything>Brooklyn Bridge>Everything Blood Sweat and Tears>.dittoThe Four Seasons>dittoAngel Baby>I could go on however>.too many to list>. ",
            "date": "Answered September 29, 2017",
            "views": "100",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhinaw Singh",
                    "user_href": "/profile/Abhinaw-Singh-53"
                },
                {
                    "user_id": "Mahesh Sharma",
                    "user_href": "/profile/Mahesh-Sharma-91"
                },
                {
                    "user_id": "Himanshu Prajapati",
                    "user_href": "/profile/Himanshu-Prajapati-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitris Palantzas",
                "href": "/profile/Dimitris-Palantzas"
            },
            "answer_text": "Babe Ruth - The Mexican Paco de Lucia - Entre dos Aguas The Routers - Sting Ray. (in 2006 by the way, there was a brilliant remaster by ‘’ The Marketts’ The Marketts - Surfs You Right More widely known: Heartbreak Hotel by Elvis Presley, various Beatles songs. One of the very first house tracks: Marshal Jefferson - Move Your Body. These tracks really impressed me even if I’m just 20 years old. ",
            "date": "Answered May 17, 2019",
            "views": "71",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Prem Biswas",
                    "user_href": "/profile/Prem-Biswas-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roshni Tekwani",
                "href": "/profile/Roshni-Tekwani"
            },
            "answer_text": "Some of the Best old songs (Bollywood) Amar Prem (All songs are too good) Amar Prem - All Songs Jukebox - Rajesh Khanna, Sharmila Tagore - Classic Old Hindi SongsRasm-e-ulfat (Dil Ki Raahein) Rasm-e-ulfat ko Lata Mangeshkar Film Dil Ki Rahen Madan Mohan / Naqsh LyalpuriYeh Dil Tum Bin Kahin Lagta Nahi (Izzat) Yeh Dil Tum Bin Kahin Lagta Nahin | Mohammed Rafi, Lata Mangeshkar | Izzat Songs 1968Yaari Hai Imaan Mera (Zanjeer) Yaari Hai Iman Mera Yaar Meri Zindagi - Manna Dey - Zanjeer (1975).flvPoocho Na Kaise Maine (Meri Soorat Teri Aakhein) Poocho na kaise maine- Manna DeyKaroge Yaad Toh (Bazaar) Bhupinder Singh - Karogay Yaad Toh Har Baat Yaad Aayegi - BazaarJane Woh Kaise Log The (Pyasa) Jaane woh kaise log the jinke pyar ko pyar mila- PYAASA (1957)Lambi Judai (Hero) Lambi-Judai-hero-Heartbroken-indian-Urdu-Sad-SonGSeene Mein Jalan (Gaman) Seene Mein Jalan, Aankhon Mein Toofan Sa Kyun HaiLag Ja Gale (Woh Kaun Thi) Lag Jaa Gale - Sadhana, Lata Mangeshkar, Woh Kaun Thi Romantic SongHazaar Raahein (Thodi Si Bewafai) Hazar Rahen Mudh Ke Dekhen",
            "date": "Answered September 20, 2016",
            "views": "747",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khadam Razzaq",
                    "user_href": "/profile/Khadam-Razzaq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lou Coury",
                "href": "/profile/Lou-Coury"
            },
            "answer_text": "What are some good old songs? I have to fly a lot for work, and I tend to “binge listen” to certain artists during flights. Lately, I have been downloading several albums by a chosen artist onto my phone before taking off, and then using shuffle to play songs in a random order during the flight. This results in a new experience every time, due to the unexpected juxtaposition of songs from different albums. This past week, I chose Phil Manzanera / Quiet Sun / 801 (i.e., a good bit of his his non-Roxy Music work). When I was in mid-air somewhere over the southeastern US, the song “Walking Through Heaven’s Door” from the 1978 album K-Scope came up. I used to love this song - but had forgotten it! Apropos to my situation at the time, the song starts off with the narrator describing coming in for a landing on a passenger plane. As I interpret the song (and I could be wrong), the passenger has flown through a time warp and gets off the plane in the future. The rest of the song describes sensations and feelings of experiencing the future as a traveler. I must admit, I was pretty excited to get off the plane after I landed, but alas, it was just Raleigh, NC, in 2018!  ",
            "date": "Answered August 15, 2018",
            "views": "552",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dai Zote",
                "href": "/profile/Dai-Zote"
            },
            "answer_text": "Make you feel my love by Adele. The song really brings back memories that i will never forget. I was 15 years old then and was in the middle of my exams. Since both my siblings were away from home, it was only me, my father, and my mom. Both my parents are really supportive of me. So, my mother was not home three days in a row and i was confused because not seeing my mother was weird. I thought they had a fight and secretly got divorced but my dad just simply said she was working. Then, the next day i found out that she had a breast tumor but didn't want to tell me cause i was going through serious stress and my ipod was playing and suddenly Make you feel my love came on shuffle. The lyrics to the song really got to me. I felt as though my mom was sitting next to me trying to calm me down. I don't think i will cry as much as i did back then. Life is crazy but it gets better. Trust me. ",
            "date": "Updated May 8, 2020",
            "views": "326",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dd Dd",
                    "user_href": "/profile/Dd-Dd-156"
                },
                {
                    "user_id": "Mohit Kumar",
                    "user_href": "/profile/Mohit-Kumar-33"
                },
                {
                    "user_id": "Abhiram Galla",
                    "user_href": "/profile/Abhiram-Galla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikita Adam",
                "href": "/profile/Nikita-Adam-1"
            },
            "answer_text": "I usually listen to some random musics, so here is my list: Neil Sedaka - Oh Carol!Paul Anka - DianaBobby Darin - Dream LoverThe Archie's - Sugar SugarAstrud Gilberto - Ipanema GirlsDavid Bowie - Under PressureNirvana - Smells Like Teen SpiritTracy Chapman - Fast CarThe La's - There She GoesWhitney Houston - I Wanna Dance With SomebodyPink Floyd - Wish You Were Here",
            "date": "Answered July 6, 2018",
            "views": "179",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suditi Jha",
                "href": "/profile/Suditi-Jha"
            },
            "answer_text": "The answer depends on what one perceives to be an “old song”, for a millennial like me, anything from the 1950s to 2010 can be classified as old music, even if others might not think the same.. So for the basis on this answer I am going to conjecture and say that you mean to imply that the songs are from before the year 2000. My favourite- Bohemian Rhapsody  Mama, just killed a man Put a gun against his head Pulled my trigger, now he's dead Mama, life had just begun But now I've gone and thrown it all away Mama, ooh, didn't mean to make you cry If I'm not back again this time tomorrow Carry on, carry on as if nothing really matters Some others- Ek chatur naar -absolute classic, Hey there Delilah- the old version, I walk the line, Skinny love, I want you to want me, Blue christmas and basically any song by Queen. Thanks for reading. ",
            "date": "Answered March 16, 2017",
            "views": "280",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark White",
                "href": "/profile/Mark-White-163"
            },
            "answer_text": "You will have to be more specific in what genre. I will give you some. Moonlight serenade-Glenn miller In the mood -Glenn miller Perfidia- Glenn miller Rambin Rose- Nat Cole Unforgettable-Nat Cole Frank Sinatra- Something Stupid The way you look tonight- Frank Sinatra Strangers in the night -Frank Sinatra Theme from a summer place- Percy Faith There are hundreds more that i can’ t list here. I hope this helps. ",
            "date": "Answered July 6, 2018",
            "views": "376",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virginia Grant",
                    "user_href": "/profile/Virginia-Grant"
                },
                {
                    "user_id": "Steve Tarver",
                    "user_href": "/profile/Steve-Tarver-1"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                },
                {
                    "user_id": "Elizabeth ‘Lizbeth’ Thornton",
                    "user_href": "/profile/Elizabeth-Lizbeth-Thornton"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Durham",
                "href": "/profile/David-Durham"
            },
            "answer_text": "As is usual with questions like this I’ll put forward some off-the-beaten-path tunes in an effort to give them a bit of exposure. “Confessing the Blues” by Chuck Berry.  “Baby Please Don’t Go” by Muddy Waters.  “Didn’t It Rain” by Sister Rosetta Tharpe.  “2,000 Light Years From Home” by The Rolling Stones.  “Cry Baby Cry” by The Beatles.  “The Wheel” by The Grateful Dead.  “Stir It Up” by Bob Marley and the Wailers.  ",
            "date": "Answered May 6, 2019",
            "views": "251",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Busbin",
                "href": "/profile/Jim-Busbin"
            },
            "answer_text": "Sir, While I’m not unlike most music lovers whose favorites change over time, I’d have to say these songs are in my perennial often listen to list; Little Willow Mona Lisa (Remastered) Gogi Grant The Wayward Wind The Hanging Tree [Marie's The Name Of] His Latest Flame (Alternate Take 4) Surfer Joe (Original Version With Two Additional Verses) Tonight I Fell in Love Then I Kissed Her (Remastered) Waterloo Sunset (Stereo Mix) The Flamingos - I Only Have Eyes For You - 1959 ",
            "date": "Answered March 18, 2020",
            "views": "150",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jerilyn Friedmann Burgess",
                    "user_href": "/profile/Jerilyn-Friedmann-Burgess"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Jackson",
                "href": "/profile/Benjamin-Jackson-130"
            },
            "answer_text": "You will have to be more specific in what genre. I will give you some.Moonlight serenade-Glenn millerIn the mood -Glenn millerPerfidia- Glenn millerRambin Rose- Nat ColeUnforgettable-Nat ColeFrank Sinatra- Something StupidThe way you look tonight- Frank SinatraStrangers in the night -Frank SinatraTheme from a summer place- Percy FaithThere are hundreds more that i can’ t list here.I hope this helps. ",
            "date": "Answered October 19, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Fowler",
                    "user_href": "/profile/James-Fowler-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Smith",
                "href": "/profile/Adam-Smith-338"
            },
            "answer_text": "Sorry in advance to people for whom this was the music they grew up with, and therefore not \"oldies.\" I'm now old enough that the music I listened in high school like Guns n Roses is considered \"oldies\" by some people.  Del Shannon - Runaway   Dion - Runaround Sue   Jo Stafford - You Belong to Me  ",
            "date": "Answered December 10, 2015",
            "views": "279",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catherine J Fusco",
                    "user_href": "/profile/Catherine-J-Fusco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Borle",
                "href": "/profile/Saurabh-Borle-1"
            },
            "answer_text": "Paradise- Dashboard Light Broken Bells- Citizens Broken Bells- Vaporise Walter Reed- Michael Pen Teardrop- Massive Attack Year of the Cat- Al Stewart USSR- Beatles Michelle- Beatles One of the nights- The Eagles Stayin' Alive- Bee Gees More than a woman- Bee Gees Mardy Bum- Artic Monkeys Wind of Change- The Scorpions ",
            "date": "Answered September 13, 2015",
            "views": "305",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nisa Rama",
                "href": "/profile/Nisa-Rama"
            },
            "answer_text": "Johnny Burnette - You're sixteen Frank Sinatra - That's life Del Shannon - Runaway Johnny Mathis - Chances are Peggy March - I will follow him Peggy March - Losing my touch The Mills brothers - Chinatown The Mills brothers - Paperdoll Gilbert O'Sullivan - Clair I could go for a few hours but that's just a taste of my taste, oh and also…. The Shirelles - Will you still love me tomorrow Hare Krishna. ",
            "date": "Answered May 23, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abhinaw Singh",
                    "user_href": "/profile/Abhinaw-Singh-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Ugoji",
                "href": "/profile/John-Ugoji-2"
            },
            "answer_text": "Too many to mention but I'll mention a few. Islands in the Stream - Dolly Parton et Kenny Rogers version Blue Kentucky Girl Coal Miner's Daughter The Sound of Silence Mona Lisa - Nat King Cole Every Step You Take - Sting and Bruce Springsteen’s version Lucille Coward of the County Where Do You Go To My Lovely Gotta Get Along Redemption Song ",
            "date": "Answered September 30, 2017",
            "views": "38",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Suzy Baily",
                "href": "/profile/Suzy-Baily"
            },
            "answer_text": "“STAND BY ME” JOHN LENNON — LENNON and McCARTNEY were pure genius.  “PLEASE, PLEASE ME” PAUL McCARTNEY and THE BEATLES  “ROCK AND ROLL MUSIC” THE BEATLES  “YESTERDAY” THE BEATLES  ",
            "date": "Answered May 18, 2019",
            "views": "35",
            "upvotes": " Answer requested by Clara Azcona"
        },
        {
            "author_info": {
                "name": "Muhammed Hanif Khatri",
                "href": "/profile/Muhammed-Hanif-Khatri"
            },
            "answer_text": "its very difficult to make a list. there are thousands of songs those get place in the list. there are “masters” like naushad sahab, anil bisvasji, hansraj behalji, madan mohan sahab, s.d.burmanda, r.d.burman and many more music directors did great job and created sweet and melodious songs, they were equally supported by unforgettable lyrics from shakil badayuni, sahir ludhyanvi, shailendraji, kaifi azmi, hasrat jaypuri, anand baxiji ,pradipji etc . here are some of them haye jiya roye…..milan o duniya ke rakhvale …….baiju bawra janewale se mulaqat na hone pai…..amar ham tere pyar me sara alam…dil ek mandir mere mahebub tuje………mere maheboob jab rat hai aisi matwali…….mugle azam din dhal jaye haye……..guide dil jo na keh saka……bhigirat main ye sochkar……..haqiqat man re too kahe na dhir……..chitralekha (?) ye zindagi ke mele……….mela piya tose nayna lagere ……guide raina biti jaye….shyam na aaye……amar prem so and so and so………i think its very confusing to make a list….. ",
            "date": "Answered October 18, 2017",
            "views": "462",
            "upvotes": " View 1 Upvoter"
        }
    ]
}