{
    "title": "What are some great business ideas for teenagers? - Quora",
    "tags": [
        "Business Ideas",
        "List Question",
        "Entrepreneurship",
        "Teenagers and Teenage Years",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hector Quintanilla",
                "href": "/profile/Hector-Quintanilla"
            },
            "answer_text": "Are you ready to make more money than your teachers and your parents… combined? Not so fast… First you need to overcome the hundreds of EXCUSES you have in your brain. I don't have enough moneyMy business plan isn't perfectThe timing just isn't rightThere's too much competitionI don't have the skills neededIt’s too difficultMy parents won’t support meI don’t have time… waaa waaa waaa…Come on! You’re a teenager, you don’t sleep at night anyway… so don’t tell me you don’t have time! Okay, once you overcome all the negativity in your brain, dress nicely and get out of your house! Don’t forget to take your best friend with you… … No, not that lazy friend you’think I’m thinking of… I’m talking about your smartphone! Next, go to a shopping mall and visit EVERY single business… You’re searching for these kind of people:  Yes… your target market is un-up-to-date people! Next, use this sales pitch, “Excuse me, Sir, how much business are you currently attracting from social media?” “Huuuhhh,” the business dude will most likely say — that’s when you will see $$$$$ pass through your eyes! “Seems like you’re still using traditional media for your marketing. Am I correct?” “Huuuuhhh?” Now you got him! “Sir, what’s your current marketing budget? How effective do you find it? Are you happy with the results? How effectively are you reaching your target audience?” “Huuuuhhh? Well, hmmm, let me think. Last month we spent $3,000 dollars on marketing,” he may say. “Ka-Ching!” Okay… NO, don’t say that in front of him. You just think it and DO NOT show your excitement. Keep it cool! “How many customers did that budget bring you last month? How are you measuring results?” “Huuuuhhh? It’s not easy to say…” “Sir, I know I’m a teenager, but I was born with this.” You show him your smartphone. “So, naturally, I’m an expert in social media. Are you aware that the trends are increasingly clear — attention is on these devices?”  You show this graph in your smartphone and say, “This trend won’t stop anytime soon. Would you like to start growing the social media presence of your business?” “Huuuuhhh? But, but, I don’t even know what a hashtag is… what should I do?” “Sir, that’s what I do. I can start proving you results with a fraction of your current marketing budget. You pay only for results. No results, you owe me nothing!” “Huuuuhhh? For real?” Now you got him!  Okay, now get to work… you’ve got the idea! No money needed, no special hours, office or location to work, no degrees or fancy MBAs — JUST A PROBLEM TO SOLVE! Manage their social media marketing campaigns and day-to-day activities.Get creative! Help them develop relevant content to reach the company's target customers.Create, curate, and manage all digital content (images, video and written).Monitor, listen and respond to the business customers in a way that cultivates leads for the company and ultimately lead to sales.Your goal is to show results and build a long-term relationship and trust with your new clients. Once you deliver results to one customer, repeat this process — the sky is the limit! ",
            "date": "Updated June 10, 2019",
            "views": "147",
            "upvotes": " View 5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Singh",
                    "user_href": "/profile/Vivek-Singh-212"
                },
                {
                    "user_id": "Shubhankar Singh",
                    "user_href": "/profile/Shubhankar-Singh-19"
                },
                {
                    "user_id": "Kamal Hassan",
                    "user_href": "/profile/Kamal-Hassan-1"
                },
                {
                    "user_id": "Aryaman Upadhyaya",
                    "user_href": "/profile/Aryaman-Upadhyaya"
                },
                {
                    "user_id": "Karangwa David",
                    "user_href": "/profile/Karangwa-David"
                },
                {
                    "user_id": "Eman Mohamed",
                    "user_href": "/profile/Eman-Mohamed-197"
                },
                {
                    "user_id": "Imon Ahmed",
                    "user_href": "/profile/Imon-Ahmed-25"
                },
                {
                    "user_id": "S Rao",
                    "user_href": "/profile/S-Rao-57"
                },
                {
                    "user_id": "Scott Douglas Clary",
                    "user_href": "/profile/Scott-Douglas-Clary"
                },
                {
                    "user_id": "Swanand Kadam",
                    "user_href": "/profile/Swanand-Kadam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Jazz",
                "href": "/profile/Edward-Jazz"
            },
            "answer_text": "Let's be honest, we all hear about how eCommerce is booming and how anybody can create an online store and start selling like crazy, but so few actually succeed in a consistent way... The truth is that a lot of people started an online store or tried dropshipping, and they got burned or gave up too early...They struggled with technical stiff like setting up an online store, pre-paid stock, inventory, fulfilment , cashflow, and so on. There is actually an EASY and FAST way to start - following the“Print On Demand Profits ” business model and it suits all teens to start with Most industries have peaks and troughs. Selling products using Print on Demand is no different. There are seasonal aspects to selling and you will find that some parts of the year are far more lucrative than others. The good news with this type of business is that you carry little in the way of overheads while Brick and Mortar based businesses still have to find money to pay for their business property, electricity, and other running costs . Cashflow and heavy expenses is less of a factor or worry for the POD business. With Print On Demand you can create and sell any custom products that range from apparels, jewelleries, to home decors .There is no inventory needed. You literally just print your products on DEMAND – based on what your customers want...... And you do not need to worry about fulfillment. Everything is taken care of via3rd party providers subject to some online fulfillment orders  to start off check out to get this copy at kindle or googleplaybooks There are literally tens of thousands people of all ages who are on the lookout for a practical and reliable eCom similar type of business that can help them generate a consistent income from ecommerce. This ebook “ Print on Demand Profits ” will provide an up to date guideline with its step by step tutorial content , will discuss on the necessary formality where to get everything they require to quickly and easily launch their own print-on-demand business using a proven 4-step process. With its low barriers to entry and minimal up-front costs - Print On Demand can be the foundation of a rewarding and profitable business Some good example of craft ideas for teenagers to start off hobby or eeven as long term business Mother's Day Craft Ideas When Mother's Day rolls around, kids want to show their moms just how special they are. Store-bought gifts and cards are nice, but they lack that personal touch. Something made just for Mom has much more sentimental value, and kids don't have to spend much money (if any) on it. Even toddlers can make Mother's Day crafts with a little help. Here's a sampling of things kids can make for Mom. Framed Photos Every mother loves to look at pictures of her kids. So why not pick out a favorite picture or yourself with Mom and create a beautiful frame for it? There are many ways you can go about making photo frames. One of the cheapest and simplest ways to make a picture frame is to cut one out of paper. Construction paper, card stock and thick scrapbooking paper are good choices. Or, if you want to make the frame even sturdier, use corrugated cardboard. Just make sure the opening in the middle is large enough to show the part of the photo you want to display, and make the frame any shape you like. Decorate with paint, glitter and stickers. Add a magnet to the back for easy display on the refrigerator. You can also make frames out of craft sticks. Just glue the ends of four sticks together to make a square, and decorate with markers or paint. Or if you prefer, buy a plain photo frame and decorate it as you please. Candle Holders It's easy to make a lovely candleholder out of a small jar. Larger baby food jars work well for tealights and votives. Pint jars can hold votives or small pillar candles. To decorate, use tissue paper. Mix equal parts white glue and water, and stick the paper onto the outside of the jar, stopping below the rim. Use pieces of different colors to create a stained glass look. Cut some shapes out of the paper if you like, arrange them in a pretty pattern, and glue on top of the larger pieces. Coat with the glue mixture to seal, and let dry. Bath Salts Want to help Mom pamper herself on her special day? Make her some homemade bath salts. They will help her relax and leave her skin feeling great. Just mix 3 cups of Epsom salts, 2 cups of baking soda, and 1 cup of table salt. Add about twenty drops of a fragrant essential oil. Lavender, sandalwood and chamomile are good choices. Mix thoroughly. Present the bath salts to Mom in a pretty jar tied with a ribbon. Decorative Flowerpot Moms adore flowers. Creating a unique flowerpot with a plant you've grown for her is sure to bring a smile to her face. Small unglazed terra cotta flowerpots are easy to paint on. Use acrylic paint to make a pretty scene or design. If you don't have a flowerpot, a styrofoam cup will do. You can decorate it with markers, glitter glue and stickers. When your creation is dry, fill it with potting soil and plant a few seeds. Try to do this a week or two before Mother's Day so the plant will have time to start growing. Don't forget to give it plenty of sun and water. Mom is sure to appreciate these simple yet thoughtful crafts. They will give her fond Mother's Day memories for years to come! ",
            "date": "Answered May 7, 2020",
            "views": "965",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Aliaga",
                    "user_href": "/profile/Patrick-Aliaga"
                },
                {
                    "user_id": "Lee S. Mobis",
                    "user_href": "/profile/Lee-S-Mobis"
                }
            ]
        }
    ]
}