{
    "title": "What are some good VST plugins? - Quora",
    "tags": [
        "Virtual Studio Technology",
        "Digital Audio Workstations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Devin Ray Wilder",
                "href": "/profile/Devin-Ray-Wilder"
            },
            "answer_text": "There is quite a variety of them out there but for starters I would highly recommend Native Instruments Massive. It is a very powerful instrument that has the ability to truly generate some unique sounds and it has a nice learning curve. There are also plenty of free tutorials out there for how to use it. Here are some YouTube videos to shed some light on NI's Massive. Also on Native Instrument's website you can download a trial version of massive to play around with it and see what its like. Another great VST is reFX's Nexus2. Unlike Massive, the Nexus2 comes with an amazing high quality sample library that will really turn some heads. I'd also like to mention Lennar Digital's Sylenth1. It is a fun little synth to play with, but it's anything but little. It has a fully layered arsenal of tones that will pack a pretty BIG punch! Hope that helps! ",
            "date": "Answered May 29, 2014",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "C'ameel Suiuu",
                    "user_href": "/profile/Cameel-Suiuu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor Eijkhout",
                "href": "/profile/Victor-Eijkhout"
            },
            "answer_text": "Kvraudio is the best site about software music making. Here is a link to a search for free VSTs in their database: Free instrument VST3 Plugins You should also consider spending a penny or two. I really like U-he Zebra, which is actually not cheap, but it can do just about everything you could possibly want to do. On this track the flute is real; all the synths are Zebra. Vermillion cliffs, by Oakensong (Eh, “Oakensong” is my artist name.) ",
            "date": "Answered August 23, 2016",
            "views": "270",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tracy King",
                    "user_href": "/profile/Tracy-King-65"
                },
                {
                    "user_id": "Chad Davis",
                    "user_href": "/profile/Chad-Davis-124"
                },
                {
                    "user_id": "Sam Sellers",
                    "user_href": "/profile/Sam-Sellers-6"
                },
                {
                    "user_id": "Hannah Stewart",
                    "user_href": "/profile/Hannah-Stewart-89"
                }
            ]
        }
    ]
}