{
    "title": "What is your favorite new song? - Quora",
    "tags": [
        "Music Recommendations",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Klugman",
                "href": "/profile/Rick-Klugman"
            },
            "answer_text": "I have a very easy ear. By that I mean, short of opera, I like just about everything. I'm also very open-minded when it comes to listening to some of the new stuff coming out. My wife has been responsible for much of this with her late night watchings the likes of Jimmy Kimmel, James Corden, Jimmy Fallon, etc who often wrap up their shows each night with the musical guest. When I'm home, “it's on” is my cue that it's time for the musical guest. I usually take a quick seat on the step leading down to the family room so I can beat a hasty retreat if it turns out something that I'm not interested in. When Corden introduced his guest, based on appearance I wasn't expecting much. As she began to sing, my wife and I gave each other a mutual WTF look to one that quickly changed to a slack-jawed one of astonishment. Apparently, despite being American, she's already made her mark in Europe. She's also more well-known for her writing for such people as Cher, the Backstreet Boys, Rihanna, and Christina Aguilera just to name a few. The melody is haunting and her vocal range is amazing. I've now included this song on my current playlist. She goes by the stage name LP and this is her current release, Lost On You,  ",
            "date": "Answered May 20, 2017",
            "views": "952",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "Dağhan Korkmaz",
                    "user_href": "/profile/Dağhan-Korkmaz"
                },
                {
                    "user_id": "Joseph Haynes Kyle",
                    "user_href": "/profile/Joseph-Haynes-Kyle"
                },
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                },
                {
                    "user_id": "Melinda McHenry",
                    "user_href": "/profile/Melinda-McHenry"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Chad Alan",
                    "user_href": "/profile/Chad-Alan-2"
                },
                {
                    "user_id": "Cassandra Sullivan",
                    "user_href": "/profile/Cassandra-Sullivan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manglam Joshi",
                "href": "/profile/Manglam-Joshi"
            },
            "answer_text": "New!! Just listen to this new Green Day song once and I am sure you will love it. (uploaded 5 hours ago!) Troubled Times - Green Day  Some other songs that I like and are new : All we ever knew - The Head and the Heart  Shes out of her mind - Blink 182  Atlas, Rise! - Metallica  Dark Necessities - Red Hot Chilli Peppers  ",
            "date": "Answered January 16, 2017",
            "views": "305",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                }
            ]
        }
    ]
}