{
    "title": "What is the most common blues scale? - Quora",
    "tags": [
        "Blues Music",
        "Music Theory",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brendan Schwarz",
                "href": "/profile/Brendan-Schwarz"
            },
            "answer_text": "“The Blues Scale” is a big pet peeve of mine. It is typically written as follows: 1 - b3 - 4 - b5 - 5 - b7 However, if you actually analyze the majority of blues soloing, you will find that the “Blues Scale” falls woefully short of encompassing what is normally played. A REAL blues scale would look something like this: 1 – 2 - b3 – 3 – 4 - b5 – 5 – 6 - b7 – 7 Notice, that’s 10 out of 12 chromatic notes. Additionally, if you’re playing a jazzier progression that includes a VI7 in the turnaround or a bVI7 to embellish the V, you can end up using all 12 notes. The notes you’ll play over a Blues progression depend much more on the chord you’re currently playing over than anything else. Perhaps the reason that the “Blues Scale” is centralized the way it is, is because you CAN technically play it over the I, IV, or V chords without too much dissonance. However, I find this to be fairly boring, and it’s not how most of the Blues greats played. B.B. King was famous for using 9’s and 6’s - neither of which are involved in the “Blues Scale.” ",
            "date": "Answered October 27, 2016",
            "views": "22",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Chalmers",
                    "user_href": "/profile/George-Chalmers-7"
                },
                {
                    "user_id": "Chris Han",
                    "user_href": "/profile/Chris-Han-2"
                },
                {
                    "user_id": "Hershel Flemming",
                    "user_href": "/profile/Hershel-Flemming"
                },
                {
                    "user_id": "Christopher Smith",
                    "user_href": "/profile/Christopher-Smith-170"
                },
                {
                    "user_id": "Joseph Byrd",
                    "user_href": "/profile/Joseph-Byrd"
                },
                {
                    "user_id": "Nigel King",
                    "user_href": "/profile/Nigel-King-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Seith",
                "href": "/profile/Ed-Seith"
            },
            "answer_text": "There is only one blues scale. It is the pentatonic (literally, “five note”) scale, with the addition of the flatted fifth. My theory is dodgy, so someone like User-13189252085764635660 may correct me, but the Em pentatonic scale is made up of E, G, A, B, and D before resolving on E again. When you add the flatted fifth, it becomes the E blues scale, and is E, G, A, A#, B, D, and E. That A# is the difference (Jay may correct me and say it’s really a Bb, but it’s the same note, regardless). Now, the pentatonic scale, and therefore the blue scale, can be found in five different “box” shapes across the fretboard, but it is still the same scale. This image illustrates that concept pretty well, and can be a learning device:  Note that the root note of the sale is marked with an “R” and is in red. The blue note is marked with a blue “B.” If you leave out the blue notes, it’s a basic pentatonic. ",
            "date": "Answered October 27, 2016",
            "views": "26",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Guy-Testarossa"
                },
                {
                    "user_id": "Elizabeth Gonzales",
                    "user_href": "/profile/Elizabeth-Gonzales-16"
                },
                {
                    "user_id": "Kevin Klein Cartagena",
                    "user_href": "/profile/Kevin-Klein-Cartagena"
                },
                {
                    "user_id": "Binh Nguyen",
                    "user_href": "/profile/Binh-Nguyen-92"
                },
                {
                    "user_id": "Sean O'Flynn",
                    "user_href": "/profile/Sean-OFlynn-1"
                },
                {
                    "user_id": "Jeroen De Wijn",
                    "user_href": "/profile/Jeroen-De-Wijn"
                },
                {
                    "user_id": "Claude Galinsky",
                    "user_href": "/profile/Claude-Galinsky"
                },
                {
                    "user_id": "Alahmed Salah",
                    "user_href": "/profile/Alahmed-Salah"
                }
            ]
        }
    ]
}