{
    "title": "What English songs should I start listening to that will make me like English songs? - Quora",
    "tags": [
        "Pop Music",
        "Song Lyrics",
        "Rock Music",
        "Music Recommendations",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kanish Pal",
                "href": "/profile/Kanish-Pal"
            },
            "answer_text": "Music tastes differs from person to person. So first I’m gonna put up a test for you so that you can understand what kind of genre you are into. Hear these songs first: Linkin Park(LP): Numb, In the End, Leave out all the rest, One more light. Greenday: Wake Me Up When September Ends(WMUWSE) , 21 Guns, Good Riddance, American Idiot, Holiday, Still Breathing, Revolution Radio. AC/DC: Highway to hell Metallica: Fade to Black Iron Maiden: Afraid to Shoot strangers. Eminem: Loose ureself, Not afraid. Bruno Mars: Billionare. After hearing all the songs, if you didnt like any of the above except Eminem and Bruno Mars, then most probably you like pop/hiphop genre. If so, start listening to Eminem, Coldplay, Rihanna and other artists like them. Im sorry but i dont listen to pop so i have no idea about it. If you liked Numb, In the End, Leave out all the rest , WMUWSE, 21 Guns then you definitely like rock. Congrats! You can start listening to songs of Breaking Benjamin, Skillet, 3Day Grace, 1000 Foot Krutch and ofc Linkin Park and Greenday If liked American Idiot, Holiday, Revolution Radio( if you liked these songs then most probably you liked the above songs too) then you like Punk rock. Great! You can listen to Yellowcard, Papa roach, Sum 41 along with the other bands aforementioned. If you liked Highway to hell, Fade to black, Afraid to shoot strangers, then you are a \\m/ METALHEAD \\m/. You like the genre metal. That is awesome. Not many people nowadays listen to metal. You can start from Avenged Sevenfold, Iron maiden, Dream theater, Metallica, Nirvana. If you liked all the songs then that means that you are a very versatile listener. You enjoy all types of genres. You will enjoy all the songs mentioned above. \\m/ ",
            "date": "Answered January 17, 2019",
            "views": "32",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vaibhav Shukla",
                    "user_href": "/profile/Vaibhav-Shukla-532"
                },
                {
                    "user_id": "Minnie",
                    "user_href": "/profile/Minnie-212"
                },
                {
                    "user_id": "Kunal Sharma",
                    "user_href": "/profile/Kunal-Sharma-467"
                },
                {
                    "user_id": "Priyam Soni",
                    "user_href": "/profile/Priyam-Soni-21"
                },
                {
                    "user_id": "Ankush Singh Bhati",
                    "user_href": "/profile/Ankush-Singh-Bhati"
                },
                {
                    "user_id": "Balaji Raoj",
                    "user_href": "/profile/Balaji-Raoj"
                },
                {
                    "user_id": "Ankan Roy",
                    "user_href": "/profile/Ankan-Roy-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eeswaran",
                "href": "/profile/Eeswaran"
            },
            "answer_text": "1 . Happy Together - By Turtles (Teenage Mutant Ninja Turtles 2014) “Imagine me and you.. i think about you day and night…. i cant see me lovin’ nobody but you for all my life.. when you're with me baby my skies will be blue.. for all my life..” 2. Enrique Iglesias - Escape “you can run . you can hide.. but you cant escape my love” 3. Europe - The Final Countdown “We're leaving together, But still it's farewell And maybe we'll come back To earth, who can tell? I guess there is no one to blameWe're leaving ground (leaving ground) .. Will things ever be the same again? It's the final countdownThe final countdown 4.George Micheal - Careless Whispers (Deadpool - End Credits) “Time can never mend . The careless whispers of a good friend To the heart and mind Ignorance is kind There's no comfort in the truth Pain is all you'll find” 5.Robert Miles - One and One “The sky isn't always blue , The sun doesn't always shine , It's alright to fall apart sometimes, I am not always you And you are not always mine It's alright to fall apart sometimes. After all is said and done One and one still is one… When we cry, when we laugh I am half, you are half..” 6. Cant Smile without you - By Barry manilow (Hellboy 2 golden army - Soundtrack) “ You know I can't smile without you , I can't smile without youI can't laugh and I can't sing ,I'm finding it hard to do anything ,You see I feel sad when you're sad , I feel glad when you're glad ,If you only knew what I'm going through , I just can't smile without you You came along just like a song .. And brighten my dayWho would have believed that you where part of a dream .. Now it all seems light years away… “ 7. Behind blue Eyes Song. (The Angry birds movie soundtrack) No one knows what it's likeTo be the bad manTo be the sad manBehind blue eyesAnd no one knows what it's likeTo be hatedTo be faded to telling only lies But my dreams they aren't as emptyAs my conscience seems to beI have hours, only lonelyMy love is vengeanceThat's never free 8.Imagine Dragons - Believer “I was broken from a young age .. Taking my sulking to the masses Write down my poems for the few… That looked at me, took to me, shook to me, feeling me…” 9. Dana Glover - It’s you and I have loved all along (Shrek) There is something that I seeIn the way you look at meThere's a smile, there's a truthIn your eyes But in an unexpected wayOn this unexpected dayCould it mean this is where I belongIt is you I have loved all along It's no more a mystery, it is finally clear to meYou're the home my heart searched for so longAnd it is you I have loved all along 10.Eiffel 65 - I am blue (1999) (Iron Man 3) eiffel 65 i'm blue lyrics Recommended : Survivor - Eye of the Tiger Song , Robert Miles Maresias , Children . ",
            "date": "Answered January 19, 2019",
            "views": "909",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aastha Priya",
                    "user_href": "/profile/Aastha-Priya-23"
                }
            ]
        }
    ]
}