{
    "title": "What's something you love about calculus? - Quora",
    "tags": [
        "Calculus Classes",
        "Calculus Education",
        "Mathematics Education",
        "Calculus"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clark Barcelona",
                "href": "/profile/Clark-Barcelona"
            },
            "answer_text": "As an average student, I learned well in Calculus because I was lucky enough as both of my professors in two semesters were so good yet soooo strict. I took the course while I was a working student that time - school in the morning, then work at night in graveyard shifts - and I couldn't help but to study very hard, because I was so afraid of failing. When I finished those ‘deadly’ semesters, my love in the subject went on and on. I continued to read several textbooks and made a compilation of solved complex problems. In my higher years, when I couldn't remember an engineering formula, I simply derived it using Calculus which has made some of my professors impressed with my solutions. Because of that - even I wasn't qualified - my professor endorsed me to become one of the Math tutors in our school, so I had an opportunity to help my friends and even the students in lower years who were struggling in the subject. My group of friends grew in a hundred. Majority of them are already engineers by now, doing well in their careers and the good thing is, we're still friends. Isn't it worth learning? ",
            "date": "Answered March 1, 2019",
            "views": "329",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Barrett",
                    "user_href": "/profile/John-Barrett-53"
                },
                {
                    "user_id": "Brandon Wallace",
                    "user_href": "/profile/Brandon-Wallace-88"
                },
                {
                    "user_id": "Divakar Vijayan",
                    "user_href": "/profile/Divakar-Vijayan"
                }
            ]
        }
    ]
}