{
    "title": "What are the best song lyrics of all time? - Quora",
    "tags": [
        "Song Lyrics",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Cubed",
                "href": "/profile/Eric-Cubed-1"
            },
            "answer_text": "My belief is that the best lyrics should be timeless, mythological, speaking to the human experience despite culture and time-period. There are only a few artists that have achieved this. Sometimes artists are manipulated by their gatekeeping producers, sometimes by their neurotically driven subjectivity or by conditions and circumstances specific to the here and now. Let’s take a look at a few of the greats: Most people thinkGreat God will come from the skiesTake away everythingAnd make everybody feel highBut if you know what life is worthYou will look for yours on earthAnd now you see the lightYou stand up for your rights. Like Nietzsche, Marley knew the old religious systems would eventually become nonsensical to the modern mind. Once upon a time you dressed so fineThrew the bums a dime in your prime, didn't you?People call say 'beware doll, you're bound to fall'You thought they were all kidding youYou used to laugh aboutEverybody that was hanging outNow you don't talk so loudNow you don't seem so proudAbout having to be scrounging your next meal How does it feel, how does it feel?To be without a homeLike a complete unknown, like a rolling stone. Bob Dylan captured the essence of mastering the developmental stage of adolescent into young adulthood. Every kid leaving their parents for the first time can relate. There are so many by Bob, especially on his first albums before Highway. And even though there are some steam of consciousness and obscure lines (what the hell does a Siamese cat have to do with anything), overall the mood and feeling is clear. That brings us to Pink Floy and Roger Waters—the mirror existential opposite to The Beatles focus on the spiritual aspect of people. Fearless is great, unbelievably great. One person tries to the other he/she cannot achieve their potential and dreams because of their own failure and resentment to do so, but the second half falls into the obscure. We don’t who the magistrates and fools are because these are subjective symbols. “Time” is the next best selection because it captures how potential is ruined by waiting too long. The less you do, the less you can do, the author seems to be saying. Superb, but not, “the best.” No, the best is “Comfortably Numb,” the near perfect rendition of a person who has completely lost their passion and aliveness for life, replacing it with football, Pepsi, pizza and a pension. Too many of us go numb and ignorance is never bliss, no matter how painful self-awareness can be. Well, maybe there's a God aboveBut all I've ever learned from loveWas how to shoot somebody who outdrew yaAnd it's not a cry that you hear at nightIt's not somebody who's seen the lightIt's a cold and it's a broken HallelujahHallelujah, HallelujahHallelujah, Hallelujah Who can argue with Leonard Cohen’s “Hallelujah? It’s love and religion and sin and reclamation all wrapped up into one extravaganza. As much as I love this song, it’s not the best because it relies too much on the bible. And the bible, like so much in these times of change, like marriage and other institutions, is on it’s way out. Let’s take a peak at another Cohen song, one that is more alignment with my parameters (stands the test of time, mythological, helps people cope with the human condition). His best in this regard: Like a bird on the wireLike a drunk in a midnight choirI have tried in my way to be free Like a worm on a hookLike a knight from some old-fashioned bookI have saved all my ribbons for theeIf I, if I have been unkindI hope that you can just let it go byIf I, if I have been untrueI hope you know it was never to you For like a baby, stillbornLike a beast with his hornI have torn everyone who reached out for meBut I swear by this songAnd by all that I have done wrongI will make it all up to thee I saw a beggar leaning on his wooden crutchHe said to me, \"you must not ask for so much\"And a pretty woman leaning in her darkened doorShe cried to me, \"hey, why not ask for more?\"Oh, like a bird on the wireLike a drunk in a midnight choirI have tried in my way to be free. Who can’t relate to that? And now for The Beatles. More than half of their songs imbue the listener with extremely authentic feelings about love, loss, imagination and potential. They counter the self-defeating narratives derived from the world that tells us all, everyday and all the time, we should be something else than who we are. They say, all of us, in our own way, can be heroes relatively. But, which one song to choose for our debate? Like Dylan and Cohen, many of their songs reflect an indulgence in subjectivity, which cannot make our list because doing so dooms timelessness. And yet, no matter what the lyrics are, the music and the passion, it’s unbeatable. We hear, “Help!” and it resonates, as it will resonate with our children. “A Hard Day’s Night” is notable, but sex/gender norms are changing. What shall we do with all the women who have entered the workforce and are fairing in so many ways better than men? (e.g. depression/alcoholism rates are far lower for women than men). Their best lyrics? There's nothing you can do that can't be doneNothing you can sing that can't be sungNothing you can say, but you can learn how to play the gameIt's easyNothing you can make that can't be madeNo one you can save that can't be savedNothing you can do, but you can learn how to be you in timeIt's easy All you need is loveAll you need is loveAll you need is love, loveLove is all you need Hear me out. At surface this is pure cheese. But there is real meaning in there. The song tells us, like above, we can all be heroes in our right, be that working a muscle job to raise a family, dedicating ourselves to a project that will exist after we die or being part of a power greater than ourselves, be it if nothing else our own conscience or a community of others. I am fully aware Lennon was an emotionally abusive person to Yoko and Julien. I suppose we must separate the art from the artist and believe when John was writing songs we had a higher order in mind, which was separate from his abuse of his spouse and children. This brings us to Kurt Cobain. Wow, a truer bluesman, although White, has never graced the cultural landscape since the times of Robert Johnson and Lebelly. But what is the timeless song? “All Apologies” comes to mind but again the lyrics are rif with subjective suffering that may or may not have true intentions. “Come as you are,” and nearly every Nirvana song has this impediment (though I love them). Only “Pennyroyal Tea” captures the last stages of heroin addiction/desperation: Give me a Leonard Cohen afterworldSo I can sigh eternally I'm so tired I can't sleepI'm a liar and a thiefSit and drink Pennyroyal TeaI'm anemic royalty These lyrics made sense and are based on real experience as opposed to Kurt’s often sardonic and passive aggressive approach. The bulb that burns twice as long burns half has never been truer for any artist ever. Let’s take a look at Neil Young, the writer of “helpless.” I've seen the needle and the damage doneA little part of it in everyoneBut every junkie's like a settin' sun. Neil understands addiction. We will never have a cure for addition, only a modifier. “One” by Metallica fits the bill. The powerlessness and massive loss of control, this is something we can all relate to: Now that the war is through with meI'm waking up, I cannot seeThat there is not much left of meNothing is real but pain now Hold my breath as I wish for deathOh please God, wake me And yet we still have not arrived at the best song lyric of all time. Why? Sorry Led Zeppelin, The Who and the Grateful Dead. You didn’t even make the cut. Surprisingly, the honor goes to Pearl Jam, for their song, “Just Breathe.” Yes I understandThat every life must endAs we sit aloneI know someday we must go Oh, I'm a lucky manTo count on both handsThe ones I loveSome folks just have oneYeah, others they got none Stay with meLet's just breathe Practiced on our sinsNever gonna let me winUnder everythingJust another human being Yeah, I don't want to hurtThere's so much in this worldTo make me bleed Stay with meYou're all I see Did I say that I need you?Did I say that I want you?What if I did and I'm a fool you seeNo one knows this more than me'Cause I come clean I wonder everydayAs I look upon your faceEverything you gaveAnd nothing you would takeNothing you would takeEverything you gave Did I say that I need you?Oh, did I say that I want you?What if I did and I'm a fool you seeNo one knows this more than me'Cause I come clean Nothing you would takeEverything you gaveHold me 'til I dieMeet you on the other side TRU DAT! ",
            "date": "Answered October 23, 2020",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juha Oksanen",
                "href": "/profile/Juha-Oksanen-1"
            },
            "answer_text": "Just naming one is very hard and ultimately depends on the mood. Unforgiven by Ulrich, Hetfield and Hammet. New blood joins this earthAnd quickly he's subduedThrough constant pain disgraceThe young boy learns their rulesWith time the child draws inThis whipping boy done wrongDeprived of all his thoughtsThe young man struggles on and on he's knownA vow unto his ownThat never from this dayHis will they'll take away What I've feltWhat I've knownNever shined through in what I've shownNever beNever seeWon't see what might have beenWhat I've feltWhat I've knownNever shined through in what I've shownNever freeNever meSo I dub thee unforgiven They dedicate their livesTo running all of hisHe tries to please them allThis bitter man he isThroughout his life the sameHe's battled constantlyThis fight he cannot winA tired man they see no longer caresThe old man then preparesTo die regretfullyThat old man here is me What I've feltWhat I've knownNever shined through in what I've shownNever beNever seeWon't see what might have beenWhat I've feltWhat I've knownNever shined through in what I've shownNever freeNever meSo I dub thee unforgiven What I've feltWhat I've knownNever shined through in what I've shownNever beNever seeWon't see what might have beenWhat I've feltWhat I've knownNever shined through in what I've shownNever freeNever meSo I dub thee unforgiven Never freeNever meSo I dub thee unforgiven You labeled meI labeled youSo I dub thee unforgiven Never freeNever meSo I dub thee unforgiven You labeled meI labeled youSo I dub thee unforgiven Never freeNever meSo I dub thee unforgiven This song touched me as a teenager, and it is to this day one of the better Metallica songs. And this too, although justice in finland is not quite as corrupt: ...And Justice for All Metallica Halls of justice painted greenMoney talkingPower wolves beset your doorHear them stalkingSoon you'll please their appetiteThey devourHammer of justice crushes you overpower The ultimate in vanityExploiting their supremacyI can't believe the things you sayI can't believe I can't believe the price you payNothing can save you Justice is lost justice is rapedJustice is gonePulling your strings Justice is doneSeeking no truth winning is allFind it so grim so true so real Apathy their stepping stone so unfeelingHidden deep animosity so deceivingThrough your eyes their light burnsHoping to findInquisition sinking you with prying minds The ultimate in vanityExploiting their supremacyI can't believe the things you sayI can't believe I can't believe the price you payNothing can save you Justice is lost justice is rapedJustice is gonePulling your strings Justice is doneSeeking no truth winning is allFind it so grim so true so real Lady justice has been raped truth assassinRolls of red tape seal your lipsNow you're done inTheir money tips her scales again Make your dealJust what is truth I cannot tell Cannot feel The ultimate in vanityExploiting their supremacyI can't believe the things you sayI can't believe I can't believe the price we payNothing can save us Justice is lost justice is rapedJustice is gonePulling your strings Justice is doneSeeking no truth winning is allFind it so grim so true so real Seeking no truth winning is allFind it so grim so true so real James Alan Hetfield / Kirk L. Hammett / Lars Ulrich My opinion is that more people should really listen to metal, and take in the lyrics. There is loads of pointed social commentary to be found. Know Your Enemy Rage Against the Machine Born with insight and a raised fistA witness to the slit wrist, that's withAs we move into '92Still in a room without a view You got to know, you got to know that when IAmp up and amplify defy I'm a brother with a furious mindAction must be takenWe don't need the key, we'll break in Something must be doneAbout vengeance, a badge and a gun'Cause I'll rip the mike, rip the stage, rip the systemI was born to rage against 'em Fist in ya face, in the placeAnd I'll drop the style clearlyKnow your enemy, know your enemyCome on Word is born fight the warNow I've got no patienceSo sick of complacenceD the E F the I A the N and C the E Mind of a revolutionary so clear the laneThe finger to the land of the chainsWhat, the land of the free?Whoever told you that is your enemy? Now something must be done about vengeance, a badge and a gun'Cause I'll rip the mike, rip the stage, rip the systemI was born to rage against 'emNow action must be takenWe don't need the key we'll break in I've got no patience nowSo sick of complacence nowAnd I've got no patience nowSo sick of complacence now I'm sick of, sick of, sick of youTime has come to payCome on Come onYes I know my enemiesThey're the teachers who taught me to fight meYeah compromise, conformity, assimilationSubmission, hypocrisy, brutality, the elite All of which are American dreamsAll of which are American dreamsAll of which are American dreamsAll of which are American dreamsAll of which are American dreams BRAD WILK / TOM MORELLO / TIM COMMERFORD / ZACH DE LA ROCHA Yeah, as current as it was 27 years ago. ",
            "date": "Answered April 28, 2019",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pradip Koirala",
                    "user_href": "/profile/Pradip-Koirala"
                },
                {
                    "user_id": "Colin Hume",
                    "user_href": "/profile/Colin-Hume-4"
                },
                {
                    "user_id": "Antoun Nabhan",
                    "user_href": "/profile/Antoun-Nabhan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}