{
    "title": "What is the best hip hop song you know? - Quora",
    "tags": [
        "Hip Hop Music Recommendations",
        "Hip Hop Song Lyrics",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Waterman",
                "href": "/profile/Luke-Waterman-2"
            },
            "answer_text": "One of my favorites is Roses By OutKast. It's part of their double album entitled: Speakerboxxx/The Love Below. The song itself may not immediately fit the description of a hip hop song to a casual listener. Mostly because of what happened to OutKast around the release of their fourth album: Stankonia.(Speakerboxxx/The Love Below is their fifth LP) On this album, at least in my opinion, they disregarded all of their previous experimentation with sound and just started fresh, drawing from numerous different musical styles. These include soul, rock & roll, psychedelic rock, and some other stuff. It's somewhat difficult to place all of their influences on Stankonia. But anyway, after the experimental and chaotic masterpiece that is Stankonia, they did the same (kind of) with Speakerboxxx/The Love Below. Or at least André 3000 did. Big Boi mostly went for serious raps and some pretty good lyricism. But André went out of this world with his half: The Love Below. André actually sings a lot more than he raps on his half of the album, he includes a lot of different instrumental sounds and a lot of different influences in the 20-something songs on this album. As part of The Love Below, Roses is still a standout. It's a piano-based full-on ballad about love and lust and superiority complexes and a bunch of other things. It's very reminiscent of a number from a musical….and actually the music video itself is based off of West Side Story. Anyway, It's one of my favorites because of how it approaches the subject of love, which is somewhat contradictory to how it's discussed throughout the rest of André's half. And because of Big Boi's effortlessly impressive flow for his verse. And for André's play on \"Down To Earth\" with \"Down To Mars.\" I have several other candidates for this slot as well, but in order to keep this brief, I'll mention this last one: Represent by Nas. Nas's first album: Illmatic, is considered by a lot of people to be the best hip hop album of all time. I partially agree, and despite not listening to it enough in the past couple of months, I have a difficult time choosing which song is the best off this album. It's incredibly consistent and all of the beats have a similar, timeless sound to them. But in the end, Represent sticks out to me a little bit more so. In general, Represent is a celebratory track. Kind of celebrating Nas getting out of the hood, while also paying homage to where he came from, and bringing some light onto the issues that he and others were forced to deal with. Compared to some of the other songs on Illmatic, Represent is pretty high energy. And we can't forget about the beat itself. The beat is pretty infectious, it's quirky, and it feels 90's without feeling dated. Even listening to Represent in 2019, it still feels like you're watching Nas's stories unfold in a modern setting. Before I finish up, a couple of other candidates for the best hip hop song are Gorgeous by Kanye West, When It Rain by Danny Brown, III. Telegraph Ave. by Childish Gambino, Prisoner 1 & 2 by Lupe Fiasco. -Luke ",
            "date": "Answered April 27, 2019",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Bazzinotti",
                "href": "/profile/Jay-Bazzinotti"
            },
            "answer_text": "Although they have changed recently, the Black Eyes Peas have great beat, lyrics and energy. I love them and their music. Yes, I know I am old. Best use of sampling ever in “Pump It”. This song is unfuckingbelievably good:  Meet Me Halfway is a great song  Boom Boom Pow is also phenomenal: this might be one of my favorite songs.  Surprisingly there can be a good message in this song “Shut up”  ",
            "date": "Answered July 9, 2020",
            "views": "130",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vuthy Reach",
                    "user_href": "/profile/Vuthy-Reach-2"
                },
                {
                    "user_id": "Jeff Mackenzie",
                    "user_href": "/profile/Jeff-Mackenzie"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        }
    ]
}