{
    "title": "What is the point of buying songs on iTunes? - Quora",
    "tags": [
        "iTunes",
        "Apple Products and Services",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Sergent",
                "href": "/profile/John-Sergent"
            },
            "answer_text": "The question is incomplete: what’s the point in buying songs through iTunes compared to what? To having no music: you get music. Most people like music, though if you don’t, certainly it makes sense not to buy any. To buying a CD and importing (Thank you, Joe Crofts, for the reminder): buying though iTunes is practically instant, avoiding either a trip to the store or waiting (and usually paying) for shipping, as well as hooking up an optical drive if your computer doesn’t have one built in. It’s also cheaper if you only want a song or two instead of the whole thing. To using a streaming music service of some sort? You get exactly what you want and nothing else, to keep as long as you want without any further payment. To some other online store? Convenience, mainly, if you’re playing it through iTunes or on an iOS device, since it cuts out a couple of extra steps. To copying the files for free from somewhere? Well, I for one prefer to buy, if the track I want is available that way. Aside from the idea that people should be paid for what they sell, knowing it’s legal, good quality, malware-free, etc. brings a bit of piece of mind. If your way of finishing the question isn’t covered, please add it. ",
            "date": "Answered August 21, 2016",
            "views": "29",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                },
                {
                    "user_id": "Priscilla Stern",
                    "user_href": "/profile/Priscilla-Stern"
                },
                {
                    "user_id": "Ken Carriker",
                    "user_href": "/profile/Ken-Carriker"
                },
                {
                    "user_id": "Douglas Michael Massing",
                    "user_href": "/profile/Douglas-Michael-Massing"
                },
                {
                    "user_id": "Scott Sileo",
                    "user_href": "/profile/Scott-Sileo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Sirois",
                "href": "/profile/Michael-Sirois"
            },
            "answer_text": "Not a lot. Google Play has the same songs (for the most part), and they're 320 kbps instead of iTunes' 256 kbps. ",
            "date": "Answered January 3, 2016",
            "views": "688",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Blast Creater",
                    "user_href": "/profile/Blast-Creater"
                },
                {
                    "user_id": "Arup Kumar Nag",
                    "user_href": "/profile/Arup-Kumar-Nag-2"
                }
            ]
        }
    ]
}