{
    "title": "What did you think of BTS when you first saw them and heard their music? - Quora",
    "tags": [
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anvi Bhat",
                "href": "/profile/Anvi-Bhat"
            },
            "answer_text": "I thought BTS is acronym for Blood Sweat and Tears Almost the same thing happened with me like Lucifer Dawn Stella said. I got introduced to Kpop through Superwoman’s “My parents react to Blood Sweat and Tears By BTS” video. When I first saw the video I was like “Video is interesting..song is good.. these boys are probably older than me.. what are they trying to convey through the video? .. Nah Nah I won’t be going into Kpop” *closes the video* After few minutes “Actually that song was really good..let me listen to it again” So I can say, the first thing that caught me is their music. I still LOVE Blood Sweat and Tears song. I found the orange haired guy (It was J-hope, I didn’t know anyone at the time) to be dancing so enthusiastically and I guessed he loves to dance (And I was right :)) And I was kinda scared of Jimin from the video and thought he must be the leader and a serious guy (If you see in the beginning when Jimin sings “Pi ttam nunmul” he looks kinda intimidating or is it just me?). Also, I was finding difficulty to differentiate them. I was really confused at first that who is who. Eventually I started listening to BST on my phone, whenever I was in class and then I looked at the translations to understand what they were singing about and I liked it more. All this time I was like “No i won’t go into Kpop.. only this song.. no more” I don’t know why I was like that. Thinking that it will be fine, I saw one of their videos where they were cracking jokes and goofing around, I found it so funny and started watching all the videos and MVs. I LOVED their dance!!! I was so shocked and surprised watching a group of people dancing so perfectly! They have great coordination. I had never seen that before! And BOOM! THERE I FALL INTO KPOP WORLD! I ended up showing it to my roomie and she started liking them too. We started watching them together from there on. ",
            "date": "Answered July 13, 2018",
            "views": "441",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Joshua Barnes",
                    "user_href": "/profile/Joshua-Barnes-47"
                },
                {
                    "user_id": "Zalfa Aretha",
                    "user_href": "/profile/Zalfa-Aretha"
                },
                {
                    "user_id": "Gwen W",
                    "user_href": "/profile/Gwen-W-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-M-1541"
                },
                {
                    "user_id": "Ellie",
                    "user_href": "/profile/Ellie-437"
                },
                {
                    "user_id": "Gina Ramirez",
                    "user_href": "/profile/Gina-Ramirez-58"
                },
                {
                    "user_id": "Nora Ri",
                    "user_href": "/profile/Nora-Ri"
                }
            ]
        },
        {
            "author_info": {
                "name": "TG Grace",
                "href": "/profile/TG-Grace-1"
            },
            "answer_text": "tbh I thought they were wanna-be pop stars. The first song I listened to was Dope, and that was only because my friend forced me too. I thought they were weird. That they were cringy. And I was wondering why people listened to them even if they didn’t know what they were saying. And then I listened to Fire. Same reaction. Baepsae. Blood Sweat and Tears. Even I Need U. I really didn’t like them. I thought they were just one of the ordinary shallow pop groups that just cared about money and not about the music like so many other “musicians” were. But then I listened to their songs again. This time with subtitles. This time, listening to their music. truly listening. And at first I still didn’t feel much, but I heard the emotion they were putting out. I didn’t love them—not not just yet—and I think it was because I had only heard their title tracks. It when I heard the non-titles that I realized how dedicated these boys were to music—and what a beautiful job they do at conveying it. Every song of theirs has a meaning. You just have to look deep enough to find it. Sometimes its blatantly said—the savage comeback to haters’ comments in Cypher 4—but sometimes it's there in the lyrics, even if the music doesn’t suggest it—like the loneliness in Whalien 52. But the thing is, you don’t need words to convey music. Even if you don’t understand what their saying, you can feel it—and that what music is all about I guess. And that’s what changed from my first reaction of BTS. So yeah um,,, that’s my life story thanks for sitting around and listening to me will update when I die sorry for leaving you in a cliff-hanger bye,,,,,,,,,,,,, ",
            "date": "Answered July 4, 2018",
            "views": "689",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Lisa Dahl",
                    "user_href": "/profile/Lisa-Dahl-19"
                },
                {
                    "user_id": "Ellie",
                    "user_href": "/profile/Ellie-437"
                },
                {
                    "user_id": "Hannah Pena",
                    "user_href": "/profile/Hannah-Pena-3"
                },
                {
                    "user_id": "Hannah Yang",
                    "user_href": "/profile/Hannah-Yang-58"
                },
                {
                    "user_id": "Gaya Abergel",
                    "user_href": "/profile/Gaya-Abergel"
                },
                {
                    "user_id": "Huan Xiao Xi",
                    "user_href": "/profile/Huan-Xiao-Xi"
                },
                {
                    "user_id": "Nicole",
                    "user_href": "/profile/Nicole-3447"
                }
            ]
        }
    ]
}