{
    "title": "What one song after listening thousands of times you still listen with same interest? - Quora",
    "tags": [
        "Listening"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arterolls Matson",
                "href": "/profile/Arterolls-Matson"
            },
            "answer_text": "“The Alan Parsons Project” does a great song called “The Raven” and then there’s another called “Turn it Up”. To me these songs I have listened to at least a thousand times…..each and no doubt will again…. I am again as I type. Try em out. Tales of Mystery and Imagination is the debut studio album by the British progressive rock band The Alan Parsons Project, released on 1 May 1976 by 20th Century Fox Records in the United States and on 1 June 1976 by Charisma Records internationally. The lyrical and musical themes of the album, which are tales of horror stories and poetry by Edgar Allan Poe, attracted a cult audience. The title of the album is taken from the title of a collection of Poe's macabre stories of the same name, Tales of Mystery & Imagination, first published in 1908 and reprinted many times since. Alan Parsons - Turn It Up - YouTube  ",
            "date": "Answered September 12, 2017",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vela Matson",
                    "user_href": "/profile/Vela-Matson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Raghavendra",
                "href": "/profile/Rohit-Raghavendra"
            },
            "answer_text": "The one song that I would still listen with same interest after listening a thousand times is the Hardwell’s Young again ….followed by Hardwell’s Follow me……from the album UNITED WE ARE… United We Are is the debut studio album by Dutch big room house DJ and music producer Hardwell..  Hardwell feat. Chris Jones - Young Again (Official Video HD)  Hardwell feat. Jason Derulo - Follow Me (Official Music Video)  I hope you will definitely enjoy these songs…….. ",
            "date": "Answered June 18, 2016",
            "views": "691",
            "upvotes": "0"
        }
    ]
}