{
    "title": "What is the best piano to use for beginners? - Quora",
    "tags": [
        "Learning Piano",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlet Langford",
                "href": "/profile/Carlet-Langford"
            },
            "answer_text": "The biggest tip I would have is not spending a lot of money on an instrument. If you are beginning, it isn’t known if you will keep at it, at least for a while. If you decide to not continue after a short time, you will have quite the expensive instrument that will sit unused and probably unpaid for. To that end, I would either look for a second hand acoustical instrument in good condition (meaning: it being in tune and all of the keys and pedals being functional), or get an 88-key digital piano with weighted keys. The digital will run you about a couple thousand if it is new, so if you can find one that is used, you can save even more. Do NOT get a keyboard. They are not the same instrument—the touch is nothing like a piano, and typically they don’t have 88 keys. Piano music generally is written assuming an 88 key instrument, so getting a keyboard will not help you to learn. If you want to learn to play piano, get a piano. Full keyboard (88 keys) and weighted keys. As a side note, there are pianos with more than 88 keys (the Bosendorfer), but don’t worry about that. You don’t need that, and they cost as much as a house. It isn’t very important to concentrate on the actual touch (how the piano reacts when you press the keys) at the beginning. As you get more proficient, your repertoire becomes more demanding and you are sure you want to continue playing, then at that point, upgrade to something better. The way the piano reacts when you play (touch) and the sound will add to your enjoyment and help you refine your technique as a more advanced student. But at the beginning while you are still trying to remember where middle C is and learning to play with both hands is still a challenge, it isn’t important that you pop for a Steinway unless that Steinway will also double as part of the room decor, or you have friends or family that play, or you inherit one from your concert pianist uncle—if that’s the case, I won’t hate. I’ll ask if I can come over and practice. ",
            "date": "Answered May 16, 2018",
            "views": "6",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ck Anshida",
                    "user_href": "/profile/Ck-Anshida"
                },
                {
                    "user_id": "Anna Ikoki",
                    "user_href": "/profile/Anna-Ikoki"
                },
                {
                    "user_id": "Fred Yu",
                    "user_href": "/profile/Fred-Yu-32"
                },
                {
                    "user_id": "Ryan Guerra",
                    "user_href": "/profile/Ryan-Guerra-8"
                },
                {
                    "user_id": "Lilian Um",
                    "user_href": "/profile/Lilian-Um"
                },
                {
                    "user_id": "Linda Lee",
                    "user_href": "/profile/Linda-Lee-337"
                },
                {
                    "user_id": "Anirudh Patwa",
                    "user_href": "/profile/Anirudh-Patwa-2"
                },
                {
                    "user_id": "Sneha Bansal",
                    "user_href": "/profile/Sneha-Bansal-2"
                },
                {
                    "user_id": "Ali N",
                    "user_href": "/profile/Ali-N-39"
                },
                {
                    "user_id": "Xinci Fu",
                    "user_href": "/profile/Xinci-Fu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Wilson",
                "href": "/profile/Richard-Wilson-16"
            },
            "answer_text": "The NP-31 only has 76 keys rather than the full 88. The difference might not seem like a lot but you'd be surprised as to how much literature calls for the upper and lower extremities of the piano. I would recommend at least getting a full-sized and weighted keyboard such as the Yamaha P-155. Not necessarily that specific model but a full 88 notes is necessary, as is weighted keys. More than that however, I would recommend just getting an actual piano. Brand new pianos are typically a bit more pricey and most people don't want to purchase one, especially just as a beginner. Rather, I would recommend acquiring a used piano. You can typically find numerous used pianos for sale in any city or town for a decent price. When I first started learning piano, my parents sprung about $300 on a Baldwin Acrosonic. In reality though, pianos can typically be found for even less than that. There is a site which I recommend frequently, Piano Adoption, that is a collection of pianos that people are literally just giving away. Getting one of these very well may not only be a wise decision over a digital piano but also somewhat cheaper. Word to the wise on getting a piano; there are two basic types, grand and upright. Grand pianos are the superior pianos. Typically, the bigger the grand, the better the piano. However, as most people don't have room in their homes for such a large piece of furniture, (even baby grands could practically double as a kitchen table in terms of size) the upright piano is the vastly more popular choice. If you decide to get an upright piano as I would assume, there is one style of upright that you need to watch out for - spinets. Don't purchase, or in any other way acquire, a spinet. In case you don't know, a spinet is a very short upright piano. Typical upright pianos stand 5+ feet tall; a spinet only stands at about 4 feet. I won't bore you with the mechanics of why but this size difference makes spinets inferior pianos. They don't have as sensitive a touch, less dynamic contrast and poorer sound quality. Spinets were really popular in the 1960's and 70's because of their compact size. Then everyone realized that the only size that is actually saved is on top of the piano. It's not typically a major issue for people to have an extra foot above a piano. Now spinets aren't even manufactured. However, as they were quite popular, they are still extremely available to those who purchase used pianos. Heed my words: beware the spinet. Get a taller studio or console upright instead. As I said, a full sized weighted digital piano will work. It would be vastly more beneficial to buy or be given a non-spinet upright piano. Let me know what piano you decide to purchase and keep on playing music! ",
            "date": "Answered March 22, 2015",
            "views": "4",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeevan R",
                    "user_href": "/profile/Jeevan-R-6"
                },
                {
                    "user_id": "Juan Esguerra",
                    "user_href": "/profile/Juan-Esguerra"
                },
                {
                    "user_id": "Navaneeth Gopal",
                    "user_href": "/profile/Navaneeth-Gopal-1"
                },
                {
                    "user_id": "Djanibek Korolev",
                    "user_href": "/profile/Djanibek-Korolev"
                },
                {
                    "user_id": "Jasan Alvarez",
                    "user_href": "/profile/Jasan-Alvarez"
                },
                {
                    "user_id": "Larry Lankston",
                    "user_href": "/profile/Larry-Lankston"
                },
                {
                    "user_id": "Ngoc Nguyen",
                    "user_href": "/profile/Ngoc-Nguyen-25"
                },
                {
                    "user_id": "M. A. Steinberger",
                    "user_href": "/profile/M-A-Steinberger"
                },
                {
                    "user_id": "Tb Schatz",
                    "user_href": "/profile/Tb-Schatz"
                },
                {
                    "user_id": "Richard Brockbank",
                    "user_href": "/profile/Richard-Brockbank"
                }
            ]
        }
    ]
}