{
    "title": "What determines if a sound will have an echo or just reverb? - Quora",
    "tags": [
        "Echoes",
        "Music Production",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Graham",
                "href": "/profile/Richard-Graham-29"
            },
            "answer_text": "To answer your question you need to understand what echos and reverb are, because they are related phenomena. Echoes and reverb are generated when travelling sound is reflected from some surface(s), and the reflected sound finds its way back to the listener, some time after the original has been heard. Echoes are easiest to understand. Imagine standing 100 feet away from a tall wall, facing it, with nothing behind you. You clap, and the sound of your clap travels to the wall and bounces back to you. You will hear the echo some time later - around 170mS later (the exact figure depends on the temperature of the air). If you move further away, the sound takes longer to travel the two distances (i.e. to the wall, and back again) - you get a longer delay before you hear the echo. If you start moving closer to the wall, the echo will come back sooner and sooner the closer you get to the wall, until the “echo” is really a slap-back, and then a “doubling”, and then a “thickening”, and then is indistinguishable from the original sound: actually, once you get close enough to the wall, the original sound will start to change, as phase-cancellations will occur at particular frequencies related to the exact distance to are from the wall - the sound will be “coloured” by the reflection - but never mind that for now ;) Imagine then, adding a movable wall behind you. Both the original and reflected sounds are bouncing off two walls now - the one in front of you, and the one behind. Some sound is getting absorbed by the air, and some of it is escaping above the walls - so the reflections are necessarily fainter than the original sound. But the reflections are now building in complexity, as sound bounces between two walls. They start to be less distinguishable from each other - they “mush together” to some extent. If the movable wall moves closer to you, the reflections get closer together, and they will start to “mush together” more. Now add a ceiling and another pair of walls. You are in a room. Sound is bouncing off all of the surfaces, the reflected sounds are being re-reflected, and so on. You probably won’t hear the original “echo” portions of the sound at all: it’s all one big mush. That’s reverb. There’s a lot more to it than this - but I hope this explanation helps. ",
            "date": "Answered November 30, 2018",
            "views": "128",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Steinmeyer",
                    "user_href": "/profile/Michael-Steinmeyer"
                },
                {
                    "user_id": "Aitch Without an H",
                    "user_href": "/profile/Aitch-Without-an-H"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zeibura S. Kathau",
                "href": "/profile/Zeibura-S-Kathau"
            },
            "answer_text": "How large the space is in which the sound is produced, how straight the edges of the space are, and how long the sound lasts. Reverberation is just a series of very fast echos which we hear so soon after we hear the original sound that our minds don’t interpret them as separate sounds, as we do with distant echos. In a smaller space with more clutter around the walls, sounds that are produced are reflected back to us from all angles in a matter of milliseconds and we hear reverb. In an open space, or a large room, the reflections take longer to get back to us so we hear an echo. Then there are some rooms – like an empty square room in a house with nothing around the walls – where you might not perceive an echo while talking (just a very jarring reverb) but you will if you click your fingers, because that short noise allows for a gap between hearing the sound and the reflection. ",
            "date": "Answered November 30, 2018",
            "views": "140",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Steinmeyer",
                    "user_href": "/profile/Michael-Steinmeyer"
                },
                {
                    "user_id": "Isaac Starobin",
                    "user_href": "/profile/Isaac-Starobin"
                },
                {
                    "user_id": "Kim Sugden",
                    "user_href": "/profile/Kim-Sugden-2"
                },
                {
                    "user_id": "Richard Graham",
                    "user_href": "/profile/Richard-Graham-29"
                }
            ]
        }
    ]
}