{
    "title": "What are the four types of listening? How are they applied? - Quora",
    "tags": [
        "Types of Listening",
        "Listening"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rakesh Chopra",
                "href": "/profile/Rakesh-Chopra-10"
            },
            "answer_text": "Communication is the sum total of three factors. SpeakingListeningBody LanguageContrary to popular belief, the most important part of communication skill is Listening. The more you listen, more you succeed. Very simple. If a child is deaf at birth, he will remain dumb for the rest of his life. How can he learn to speak, if he has not heard anything. Hearing is a physical ability gifted by God. But listening is an art, which can be developed. You can be a fascinating listener and become successful by listening and learning more than others. The first FOUR types are ordinary types of listening and if you continue to do ordinary things, you will continue to get ordinary results. Inculcate the FIFTH type- 1) Formality Listening You listen because you are forced to listen. Your mind is somewhere else, watching TV or reading a book. Known words fall on your ear drums and you get a meaning , that is it. You are not at all involved. 2) Pretended Listening You look in the eyes of the person but your mind is thinking something else. You show that you are listening but you are actually lost. You are preoccupied with something else. The other person feels happy that he is being heard. 3) Selective Listening You listen what you want to listen. Out of the entire conversation, you pick what suits you and you remember only that. You ignore the unwanted and reproduce only relevant when the time comes. 4) Reactive Listening You listen to reply. When the other person is speaking, you are waiting for your turn to reply. In fact, you are actually not listening, you are preparing for your answer. 4) Active listening This is the listening of Successful and effective people. They listen because they consider it as their right, They, in fact feel obliged to listen and learn in the bargain. You have to keep the following things in mind to become an active listener- - Stop talking phisically - Relate to yourself - look what is being said, not who is saying - Focus on the person, not his clothes - Aski questions and re-phrase what you listen - Write down important points - Stop talking mentally People will just love you when you listen to them. Their problem become half when you just listen to them . It doubles if you do not listen because then they tell the same to someone else. Develop the art... Best compliments.... ",
            "date": "Answered July 6, 2018",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Athar Chandio",
                    "user_href": "/profile/Athar-Chandio"
                },
                {
                    "user_id": "Syeda Shehzadi",
                    "user_href": "/profile/Syeda-Shehzadi"
                },
                {
                    "user_id": "Sai Mallikarjuna",
                    "user_href": "/profile/Sai-Mallikarjuna"
                },
                {
                    "user_id": "Beno Jasper",
                    "user_href": "/profile/Beno-Jasper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Godfrey McDonnell",
                "href": "/profile/Godfrey-McDonnell"
            },
            "answer_text": "Critical creative. As in active listening of musicians composing and playing on their instrument. Critical reflex. As in flight, fright, cooperation listening. Critical awareness. As in listening out for key changes and interruptions in back ground sounds. Passive and entertainment listening only with, passive, casual participation. ",
            "date": "Answered December 30, 2016",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Soo",
                    "user_href": "/profile/Timothy-Soo-2"
                },
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                }
            ]
        }
    ]
}