{
    "title": "What video game songs get stuck in your head? - Quora",
    "tags": [
        "Earworms (music)",
        "Video Game Soundtracks",
        "Video Game Industry",
        "Song Identification",
        "Songs",
        "Games",
        "Video Games",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Margo De Noir",
                "href": "/profile/Margo-De-Noir"
            },
            "answer_text": "Well, this one and only what I have learned. :3 Through the Valley I walk through the valley of the shadow of death.I fear no evil because I'm blind to it all.My mind and my gun they comfort meBecause I know I'll kill my enemies when they come.Surely goodness and mercy will follow me all the days of my lifeAnd I will dwell on this earth forevermore.I walk beside the still waters and they restore my soulBut I can't walk on the path of the right because I'm wrong.Well I came upon a man at the top of a hillCall himself the savior of the human race.Said he come to save the world from destruction and painBut I said how can you save the world from itself. Because I walk through the valley of the shadow of death.I fear no evil because I'm blind.I walk beside the still waters and they restore my soulBut I know when I die my soul is damned. ",
            "date": "Answered April 23, 2019",
            "views": "110",
            "upvotes": " Answer requested by Steve Kelly"
        },
        {
            "author_info": {
                "name": "Lyra Tsura",
                "href": "/profile/Lyra-Tsura"
            },
            "answer_text": "To be honest many songs from the video games I love get stuck in your head (yes now I can even sing in chaos language from nier and nier automata) But I would have to say the most catchy songs I've listened to are the ones from Persona 5 and Bayonetta, for which I recommend “last surprise” and “whims of fate” from persona 5 and “mysterious destiny\" and “tomorrow is mine” from bayonetta 1 and 2. Yes they get stuck in your head, but in a toe tapping fun kinda way. They shall live on in my phone ringtones for it ",
            "date": "Answered June 5, 2019",
            "views": "67",
            "upvotes": "0"
        }
    ]
}