{
    "title": "What is your 'go to' song that always makes you feel better? - Quora",
    "tags": [
        "Song Identification",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Perry Wong",
                "href": "/profile/Perry-Wong-19"
            },
            "answer_text": "“Get it Right” by Rachel Berry (portrayed by Lea Michelle) in Glee. This song is sung by Rachel in Glee, who was in a phase where she found herself only capable of messing things up and causing damage to her and everyone around. The lyrics reflects that although she has tried numerous times and still can’t get it right, she realized that she needs to let go of the restriction by what people have been saying around. It’s much actually more deeper than not being sad, it always helps acknowledge me that albeit everyone is different and we all have different vulnerabilities or weaknesses, it does not mean that these stuffs can constrain you. What have I done? I wish I could run away from this ship goin' under Just tryin' to help, hurt everyone else Now I feel the weight of the world is on my shoulders What can you do when your good isn't good enough And all that you touch tumbles down? 'Cause my best intentions keep makin' a mess of things I just wanna fix it somehow But how many times will it take? Oh, how many times will it take for me to get it right? To get it right Can I start again? With my faith shaken, 'cause I can't go back and undo this I just have to stay and face my mistakes But if I get stronger and wiser, I'll get through this What can you do when your good isn't good enough And all that you touch tumbles down? 'Cause my best intentions keep makin' a mess of things I just wanna fix it somehow But how many times will it take? Oh, how many times will it take for me to get it right? So I throw up my fist, throw a punch in the air And accept the truth that sometimes life isn't fair I'll send out a wish and I'll send up a prayer And finally someone will see how much I care What can you do when your good isn't good enough And all that you touch tumbles down? Oh, my best intentions keep makin' a mess of things I just wanna fix it somehow But how many times will it take? Oh, how many times will it take to get it right? To get it right ",
            "date": "Answered July 11, 2018",
            "views": "174",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gia Hill",
                    "user_href": "/profile/Gia-Hill-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bridget McCrea",
                "href": "/profile/Bridget-McCrea-1"
            },
            "answer_text": "I absolutely adore questions like this, as my answers tend to make people scratch their heads in confusion. But the song that always, always, ALWAYS makes me feel better is Every Day is Halloween by Ministry. If I’m scraping the bottom of the barrel for something to remind me that I’m a worthwhile human, this song reminds me that I’m awesome purely for the fact that I’m a unique human, even if I’m not at the level of Al Jourgensen. And it has an awesome baseline. ",
            "date": "Answered July 11, 2018",
            "views": "269",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rene Cantu",
                    "user_href": "/profile/Rene-Cantu-3"
                },
                {
                    "user_id": "Shelby Polis",
                    "user_href": "/profile/Shelby-Polis"
                },
                {
                    "user_id": "Udo Andre",
                    "user_href": "/profile/Udo-Andre"
                },
                {
                    "user_id": "Charlene Zotter",
                    "user_href": "/profile/Charlene-Zotter"
                },
                {
                    "user_id": "Carly Jolan",
                    "user_href": "/profile/Carly-Jolan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Chan",
                "href": "/profile/Emily-Chan-227"
            },
            "answer_text": "It's a song called “Berserk” by a guy named Mafumafu. Somehow, I relate to the lyrics that are desperately screamed out as he tries to express himself. Whenever I feel depressed or down, I'd put the song on full blast in attempts to ignore everything and everyone around me. ",
            "date": "Answered July 11, 2018",
            "views": "180",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cameron Rhees",
                    "user_href": "/profile/Cameron-Rhees-1"
                },
                {
                    "user_id": "Yumiko Chi",
                    "user_href": "/profile/Yumiko-Chi"
                },
                {
                    "user_id": "ZeldaFreak XD",
                    "user_href": "/profile/ZeldaFreak-XD"
                },
                {
                    "user_id": "Akira Wolfe",
                    "user_href": "/profile/Akira-Wolfe"
                },
                {
                    "user_id": "Freyya Lie",
                    "user_href": "/profile/Freyya-Lie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nahmar Cheetah",
                "href": "/profile/Nahmar-Cheetah"
            },
            "answer_text": "Old one: The Chainsmokers - Closer (Lyric) ft. Halsey  Now-a-days: Charlie Puth - The Way I Am [Official Video]  Peace!❤ ",
            "date": "Answered July 11, 2018",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rana Shehroz",
                    "user_href": "/profile/Rana-Shehroz-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kermit Lancaster",
                "href": "/profile/Kermit-Lancaster"
            },
            "answer_text": "Brown Sugar by The Rolling Stones. It always makes me smile and sing along. I just love the guitar work.  ",
            "date": "Answered July 11, 2018",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Scarn",
                "href": "/profile/Mike-Scarn-3"
            },
            "answer_text": "I have many. I guess currently, it’s “I knew I loved you” by Savage Garden. The words of relatable to current situations in my life. The music is also just soothing and makes my mind at ease. ",
            "date": "Answered August 3, 2018",
            "views": "45",
            "upvotes": "0"
        }
    ]
}