{
    "title": "What is the point of living if we have to die someday? - Quora",
    "tags": [
        "Meaning of Life",
        "Death and Dying",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Corkern",
                "href": "/profile/Jeff-Corkern"
            },
            "answer_text": "Nothing whatsoever. Of course. What could be simpler? What give us the point of living is the cold fact we do NOT actually die. And down is his guts somewhere the OP already knows this, or he would never have phrased the question the way he and so many, many others do. Allow me to drag the OP’s unconscious knowledge to the surface, make it clear he really is the eternal being he already senses he is. It is, in the end, such an easy thing to figure out. The point of living is to get smarter. This answer is not something I’m trying to get you to believe because of the power of my personality. I’m not trying to “inspire” you, but to give you the single answer to that question. An answer that can be deduced through a coldly logical process. When I tell you “The point of living is to get smarter”, it is in the same sense as I tell you “Rocks roll downhill.” Both are physical processes that occur in the real world. And like any physical process, if you ignore it, you will simply wind up getting hurt. BADLY. The rock will just roll over you and crush you like a bug. Whether you believe in the rock or not. Consider. All human action has as its end goal the achievement of a state of happiness. Whatever it is a human does, in the end it is to get happy and stay that way. The smarter and smarter you are, the easier and easier it is to get happy and stay that way. So everybody is constantly trying, all the time, to understand how the world works. To get smarter. Whether they want to be doing that or not. About this one thing, they actually have ZERO choice. Please note that as you interact with the Universe every day trying to get happy, you cannot help but get smarter about how the Universe works. Let me put it this way: Are you smarter now than you were ten years ago? One year ago? One week ago? When you go to bed at night, are you a little bit smarter than when you woke up that morning? See how this works? What an automatic process this is? The basic question has now been answered, but there are some additional HIGHLY critical aspects to this question that need to be pointed out. If you use dope (hereafter referred to as “emotion drugs”) to get happy instead of interacting with the Universe, the situation changes radically. When you are stoned on emotion drugs, you are no longer interacting with the Universe. If you are no longer interacting with the Universe, it is impossible to learn anything about the Universe---and the getting-smarter process will stop stone-cold dead and even reverse itself with heavy enough use. The social scientists are starting to detect this, although they don’t understand the process. Heavy dopeheads have a strong tendency to be the same now as they were twenty years ago. They haven’t changed, i.e. they haven’t gotten any smarter. Nobody understands this better than the dopeheads themselves. What have they called the stuff they use from Day One? “Dope.” There is a much, much deeper societal problem here that is again not widely understood. If you believe your personality just zeroes out and disappears when your body dies, then getting happy by using emotion drugs is the smartest thing to do. (This belief is the root cause of the opiod epidemic, and it’s going to get worse before it gets better.) If that is the case, the getting-smarter process is completely useless and without any real meaning. The weird thing is that belief is totally wrong. We are all actually eternal beings who have souls. In this case, we are forced to get smarter simply as a matter of self-defense. Because the Universe will be constantly dropping all kinds of random painful hammers on us if we don’t. And this can be logically, scientifically proved. Here is that proof. Just to continue your education about how the Universe works. So you can be happier. FUNDAMENTAL And would you like to live in a world where nobody is afraid to die? Where you personally are no longer afraid to die? It’s only a single experiment away. Oh, by the way, the eventual result of the scientific confirmation of the existence of souls will be the complete and total destruction of all evil on Earth. See my story at the end. Life after death is real, the cold-sober scientific truth, the way the Universe works. Life after death is not a fiction or a fantasy. It is real, something vitally necessary in order for the Universe to be stable, mainly to keep the Universe’s sentients from blowing the Universe the Hell up. On this one thing, the existence of the soul, those silly religious woo-woos are ABSOLUTELY right. Those moonbeam-dancing, ley-line-loving, crystal-worshiping, long-haired-hippie-freak woo-woos are totally dead-bang right. I can prove ALL of this---if you are smart enough to understand it. (Although intelligence really isn’t the main problem, but rather the ability to think clearly and objectively. THAT is rare, even among scientists. THIS IS AN EASY PROBLEM TO SOLVE. Considered simply as an exercise in logic, the problem of the existence of the soul is entirely trivial.) I can prove it all by the best, most rigorous method the human race has ever found for finding the truth. The scientific method. Observation, hypothesis, and finally confirmation by testing in the lab. By building a soul-detector and detecting souls in the lab. The detecting principle, I suspect, will be rapid changes in Planck’s Constant. You don’t even have to use people. You can use cats. Why cats? Cat-soul dived through my chest once. Also, soul theory indicates the source of emotion is the soul, not the brain, and therefore any animal that shows emotion, in particular love, is an eternal being and has a soul. The observation and hypothesis parts I have solved. I’d get the third one too, if I had the money. Alas, I don’t. It would take a million bucks just to start. I continue to hope some bad-boy millionaire scientist or engineer will trip over my Quora answers one day. (You hearing this, Elon? Would you like to smash the whole damn world? I can show you how.) Let me give you the short version, then the long version. Rigorously objective analysis of human behavior reveals human behavior contains the assumption of eternal existence, on quite a number of levels. Since human bodies are certainly not eternal, human beings MUST contain an eternally existing component, i.e. they must have souls. You might object something as weird as souls could only exist if the Universe had some EXTREMELY powerful need for them. You would be correct. There actually is an extremely powerful need for a Universe’s sentients to ALL be eternal beings who have souls. It inhibits the sentients from destroying their Universe. If a Universe’s sentients are NOT eternal beings, then the Universe logically becomes Hell. Because most sentients’ lives are composed mostly of pain, and unless their existence was without limit, their pain, and their lives, would be completely meaningless. Live in Hell, and then die. Sentients would destroy any such Universe in a cosmic heartbeat. It would be the MORAL thing to do. And oh my, yes, all sentients possess the theoretical capacity to destroy the entire Universe, as one aspect of sentients is knowledge of how the Universe works, as in the ability to write down the Universe’s fundamental laws and then use those laws to change the Universe around them as they see fit. Stephen Hawking embodied the entire situation perfectly. If anybody understood the Universe’s fundamental laws, it was Stephen Hawking. If anybody suffered at the hands of the Universe, it was Stephen Hawking. (RIP, Stephen Hawking.) And waddya know, Stephen Hawking found a way to destroy the whole damn Universe. With a flick of his little finger. He has pointed out the Higgs field exists in an excited state, and that the existence of all the Universe’s particles depend on the Higgs field remaining in that excited state. So, because the Higgs field exists in an excited state, the Universe contains a fundamental instability which can be used to destroy it. If the Higgs field ever drops to its ground state in any particular area, all the Universe’s particles in that area will promptly disintegrate. And from that area the drop in energy (and therefore disintegration) will spread, exactly like dropping a spark into gunpowder. And the entire Universe dissolves back into the Chaos it came from. So all we have to do is build a machine that will catalyze the drop of the Higgs field to its ground state. We will only have to use it once. We punch the button—-and poof, no more Universe, at the speed of light. Remember, if we all are not eternal beings, we all live in Hell, and this is the moral thing to do. The odds are pretty good the human race is NOT the first sentient species to evolve in the Universe, but no sentient species has ever actually done this. The Universe is still there. I hereby conclude this Universe’s sentients are eternal beings, and there is a way to detect souls in the laboratory. That’s the short version. Now the long version. Here is an essay which explores this Universe-destruction thing further. This is the rock-bottom of it all. It’s ALL about keeping the Universe in one piece, man. ON THE SENTIENT CONSTRAINTS OF A SENTIENT-CONTAINING UNIVERSE http://www.theninepointfivetheses.blogspot.com/2007/02/on-sentient-constraints-of-sentient.html Now an exploration of the various ways human behavior contains the assumption of eternal existence. (This is by no means all the ways.) If human beings possess immortal souls, it should be possibly to logically deduce this by objective analysis of their actions. It should be possible to show in your own personal actions. It should be possible to show you ACT like you have a soul, even when you think you don’t. THE MURDER ON A BEACH THOUGHT EXPERIMENT http://theninepointfivetheses.blogspot.com/2007/12/murder-on-beach-thought-experiment-on.html It should be possible to demonstrate the rule exists in collective action. It should be possible to demonstrate the assumption of eternal existence exists in the foundation rules of the world’s stable societies, although they may not be aware of it. ON EMOTION DRUGS http://www.theninepointfivetheses.blogspot.com/2007/02/on-emotion-drugs.html The physical purpose of souls is stability. So it should be possible to demonstrate denying or removing the assumption of eternal existence results in extreme personal pain and extremely violent instability. AND NOTHING HEARD MY SCREAM http://theninepointfivetheses.blogspot.com/2007/05/and-nothing-heard-my-scream.html And now one last stinger. This is for the REALLY smart people out there. The existence of souls is currently perceived as mostly an academic debate. Something that won’t make much difference one way or the other. It is not. The confirmation of the existence of souls will cause the most profound change in human behavior there has ever been. This will be a scientific discovery that will cause a change in humanity’s MORAL behavior, as people will finally understand it is impossible to escape the consequences of your actions. Let me illustrate this with a story. A scientist builds a soul-detector, IMMEDIATELY detects souls—-and smashes the entire world. The total and permanent destruction of all evil on Earth begins as the good guys are finally cut loose. Because science has now proven the MORAL thing to do is also the SMART thing to do. AFTER THE AWAKENING https://futurism.media/after-the-awakening This story is the future, what’s about to happen, right around the corner. The Awakening is coming. Jeff Corkern -------------------------------------------------- Consider the following as a statement of logic, and rank it as \"True\" or \"False\": \"If people possess immortal souls, it should be possible to logically deduce this by objective analysis of their actions.\" http://www.theninepointfivetheses.blogspot.com ",
            "date": "Answered March 25, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nico Wu",
                    "user_href": "/profile/Nico-Wu-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ansh",
                "href": "/profile/Ansh-66"
            },
            "answer_text": "I think, most of us; even though we know that death is inevitable, we still don’t really live with a wholesome acceptance of it. Knowing that we are going to die one day is a piece of common knowledge. But it doesn’t necessarily mean that we have accepted it as a factual phenomenon. You know what; it’s more of the fear of death particularly, that creates a wall between our knowing of death as a factual happening and our subconscious tendency to take life for granted, both, at the same time. Death in all its substance cannot be known until experienced first hand. But accepting it and making peace with the fear of death takes a lot of deep thinking. Or less. But it needs thinking and sincere contemplation. If you truly observe the nature of our daily existence, you may notice that we tend to take life for granted which implies that we tend to pass our time as if we won’t die. The intensity of our worldly pursuits are such that death is not even in our hindsight.This does not mean that we as humans should abandon all pursuits. But once you seriously let go of the fear of death, you’ll realize that your daily existence and mindset towards your goals become more balanced and stable. You feel better and calmer. You feel humbled by understanding that your body is gradually pursuing its death. So trying to live our lives or simply living by surviving is not wrong in any way. It is just what it is. It is as if we have been given the physical existence, the body and a planetary life to realize our higher selves - through meditation, sadhna, yoga and contemplation. We take birth to learn lessons that in turn make us realize who we really are - something beyond just our physical bodies; that we are a part of something higher and bigger. We live to face death and pass on to the beyond. We survive and try to live and achieve things because we have been conditioned towards those pursuits and ways of life. But our physical existence is simply an equipment, a kind of a boat, to help us cross the river of life and realize what’s beyond life itself in all its beauty and truth. So living is probably just a way of giving our journeys a common form so that we all at least try to reach the absolute truth. But most of us don’t do it. So we go on, and on, and on; limited to our mediocre realities. ",
            "date": "Answered January 24, 2018",
            "views": "617",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roger Gaines",
                    "user_href": "/profile/Roger-Gaines-5"
                }
            ]
        }
    ]
}