{
    "title": "What is the difference between an MP3 CD and an Audio CD? - Quora",
    "tags": [
        "MP3 (audio encoding format)",
        "Compact Discs (CDs)",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Dunn",
                "href": "/profile/Mark-Dunn-64"
            },
            "answer_text": "Format. MP3 is a file format. It is a digital object which contains data. That data can be read by a program and interpreted as music, speech, or other sound. Fun! There are many different files which can store sound, each with its own respective parameters, strengths, and weaknesses. MP3 is among the most common because it is compatible with many different programs, it compromises fidelity and quality for speed and size-efficiency, and it is a generalized tool rather than a specific one (meaning it is useful in more places for more people and thus proliferates). MP3s, like many other audio formats, can be put on a CD, whether for storage or playback. CD is a physical format. It is a physical medium (an optical disc, to be more detailed) that stores digital data which can be read by a device and interpreted as all sorts of things. This commonly means programs (games, antivirus suites, graphic design utilities, music or video, etc), but nearly any sort of file can be written to a CD—text documents, pictures, proprietary work project files, business card information, and so forth. In some ways, it is like a tiny portable hard drive, unlike MP3 which is a way of organizing information in a self-contained way on something like a hard drive. Audio CD is a CD (physical medium) which is designed for audio, or is pressed or burned with audio data. Formally released audio CDs will generally meet particular industry standards, ones which surpass your run-of-the-mill blank CDs. Those blank CDs can also be burned with audio data and play similarly to CDs which were pressed by a factory, but most burning processes will not follow the same exacting standards of professionally created audio CDs. The term “audio CD” is often useful in situations where multiple kinds of discs or disc content are included in a product or it is not clear what form certain content will be taking. So, digital files and physical formats are different because they are different kinds of technologies serving different purposes. They are related insofar as they can work together for us to meet particular goals, like playing some music while driving, but they are independent tools and different types of objects. Audio CDs are a particular kind or use of CDs. Sometimes it means that the disc is a special kind of disc which is designed for or mostly limited to burning audio, other times it simply indicates that a disc contains audio (as opposed to video, a program, or other data). One final thing to mention is that audio CDs should contain lossless audio sources (usually burned as WAV files)—putting MP3s on a CD means you are losing out on quality and versatility. If MP3s are all you have, you can still put them on a CD, whether for archiving or to make a playable disc, but it is better to get the original files or highest quality copies desired when putting audio on a CD. This is particularly true if you are wanting to play something through a speaker system, sell a product, or share audio files with someone who will be using them for something more than just listening (such as composing music or doing forensic analysis). ",
            "date": "Answered December 19, 2017",
            "views": "342",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Henderson",
                    "user_href": "/profile/Eric-Henderson-36"
                },
                {
                    "user_id": "Hamthan Jess",
                    "user_href": "/profile/Hamthan-Jess"
                },
                {
                    "user_id": "Víctor Imagison",
                    "user_href": "/profile/Víctor-Imagison"
                },
                {
                    "user_id": "Tarun Sri Harsha",
                    "user_href": "/profile/Tarun-Sri-Harsha"
                },
                {
                    "user_id": "DYNAMICS BOOK",
                    "user_href": "/profile/DYNAMICS-BOOK-1"
                },
                {
                    "user_id": "Lawrence Clark",
                    "user_href": "/profile/Lawrence-Clark-27"
                },
                {
                    "user_id": "Aryan Dara",
                    "user_href": "/profile/Aryan-Dara-2"
                },
                {
                    "user_id": "Gary Ow",
                    "user_href": "/profile/Gary-Ow"
                },
                {
                    "user_id": "Nick Gibson",
                    "user_href": "/profile/Nick-Gibson-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tren Harvey",
                "href": "/profile/Tren-Harvey"
            },
            "answer_text": "Audio CDs are stored in the media in its original uncompressed form at a bit rate of 1411bits/sec. MP3 CDs are stored compressed at bit varying bit rates of around 64 to 256 bits per second. The primary advantage of MP3 CDs is the big difference in the number of files stored in a single disc. This can range in the hundreds compared to the 15 to 20 songs that can be stored into an audio CD. . Audio CDs have been the standard in portable music formats for a very long time. It was the first format that music has been encoded in, and as such all of the music players that accept CDs can play this very basic format. One advantage that audio CDs have over MP3 CDs is the high quality sound that audio CDs can deliver. The uncompressed format means that none of the data is lost due to compression. The hardware needed to play Audio CDs is simpler compared to MP3 players. MP3 CDs burst into the scene a short while after the format was introduced. MP3 is a lossy method of compressing audio files. This means that some data needs to be discarded in order to reduce the file size substantially. The only good aspect of MP3s is the fact that it can be a tenth of the size of the same file in Audio CD format. The loss in sound information means that MP3s are noticeably inferior to Audio CDs when played back in high end sound equipment; though the development of better codecs have gradually reduced the gap between the two. The big difference between Audio CDs and MP3 CDs can come from the hardware for both formats. As stated above, all players are able to play Audio CDs but this might not exactly be the case with MP3 CDs. Although the number of devices that are able to play MP3 CDs have been growing in the past few years, it is still nowhere near as established as the Audio CD format. And the current trend to MP3 players that act as storage media themselves have further dampened the support for portable CD players that support the MP3 format. Currently, MP3s are the most prevalent format when it comes to portable players despite the sudden plunge of MP3 CDs. The Audio CD format still holds a large market presence since it is still the preferred medium in the sales of music albums. Read more: Difference Between Audio CD and MP3 CD | Difference Between http://www.differencebetween.net/technology/difference-between-audio-cd-and-mp3-cd/#ixzz53WGBRiVO ",
            "date": "Answered January 7, 2018",
            "views": "209",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tiago Simão",
                    "user_href": "/profile/Tiago-Simão"
                },
                {
                    "user_id": "Margaret Moss Kashmann",
                    "user_href": "/profile/Margaret-Moss-Kashmann"
                },
                {
                    "user_id": "John Dorito",
                    "user_href": "/profile/John-Dorito"
                },
                {
                    "user_id": "KHM",
                    "user_href": "/profile/KHM-3"
                },
                {
                    "user_id": "Aadhithya Raj",
                    "user_href": "/profile/Aadhithya-Raj-1"
                },
                {
                    "user_id": "Bill Craig",
                    "user_href": "/profile/Bill-Craig-46"
                },
                {
                    "user_id": "Mike Hall",
                    "user_href": "/profile/Mike-Hall-249"
                },
                {
                    "user_id": "William Gordon",
                    "user_href": "/profile/William-Gordon-70"
                },
                {
                    "user_id": "Trenear Harvey",
                    "user_href": "/profile/Trenear-Harvey"
                }
            ]
        }
    ]
}