{
    "title": "What are the most inappropriate outfits female K-pop idols have worn? - Quora",
    "tags": [
        "K-Pop Idols",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hamedah Badmus",
                "href": "/profile/Hamedah-Badmus"
            },
            "answer_text": "Disclaimer: If you are easily offended then you know your drill. (to get the fuck out) Let’s get started Momoland shorts  Can she breath?  Damn why is nancy ass so big (it okay tho)  I like the gogobebe and other one, but the first one is a no for me  She looks so good in this  Pussy what?  Hentai (I like anime sex) (jk)  M. I. L. F what?  honestly this is quite sexy  The shirt says: I’ve never wanted to p*ss on someone’s face more than I want to on yours. (I want that sweater sooo bad)  Everything is shit yerin (That why I Iove this girl she tells it like it is)  We are doing that now tzuyu (just joking) (hoes take off your clothes)  Definitely buying this  Why do i even try?  classic  Love it  So has that pussy? (jk)  Shinee never let me down  Ummm at a fan meeting? (vixx N) (well good luck being black)  ooo, Now I know why they called them nature  The shirt says: I’m only wearing this t-shirt so that I don’t distract everyone with how awesome my t*ts are (well damn)  The shirt says: Make a woman c*m for once Wow  The shirt says: PLEASURES: LIFE, SEX, DEATH I guess they are anus  The shirt says: They hate us cause they anus The face never lies  The shirt says: Иди нахуй (in English: Go sit on a d*ck) Seems like it (the other girl- you better take this fucking evenlope off under me)  The shirt says: GIVE NO F*CKS That why I love dreamcatcher (piri pa do da)  The shirt says: I don’t need t*ts, t*ts need me  The shirt says: I <3 SL*TS I wonder If you found it out already ( if you did your IQ is high)  The shirt says: SHI(R)T (the R is silent) Looks like it (jk)  The shirt says: He’s an obnoxious pr*ck and his shoes are ugly Yessssssss  The shirt says: Do you wanna funk? Oh what is this I see?  The shirt says: Do you wanna funk? Looks like she on it (jk)  The shirt says: Marijuana woowo  The shirt says: KEEP ONE ROLLED whyyyyyy?  The shirt says: C*M WTF?  The shirt says: BEAUTY DIES in LSD OR*Y after SEXY with 100 men I agree  The shirt says: MENTALLY F*CKED Don’t mind  The shirt says: Buy less, f*ck more Exactly like your idol life (jk)  The shirt says: SAME SH*T, DIFFERENT DAY okay this shirt is fuck- oh I mean funking funny  The shirt says: fu*k (at least it’s crossed out!) Me too men, me too  The shirt says: I WANNA F*CK RIHANNA ",
            "date": "Answered June 22, 2020",
            "views": "175",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Theodora-60"
                },
                {
                    "user_id": "Selena Park",
                    "user_href": "/profile/Selena-Park-13"
                }
            ]
        }
    ]
}