{
    "title": "What is the average weight of an electric piano? - Quora",
    "tags": [
        "Electronic Pianos",
        "Keyboards (instrument)",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Campbell",
                "href": "/profile/Tom-Campbell-1"
            },
            "answer_text": "Not enough information. You can get a tiny electric piano from Korg that weighs a few pounds, sounds great, and has a terrible keyboard. You can get an electric piano from Yamaha that costs as much as a real piano and weighs 150 pounds or more, with a keyboard you cannot tell from their lower end acoustic pianos. The main factors in weight are the size of the casing, whether the keyboard is mechanical (weighted hammer action keys are the most desirable because they’re closest to traditional pianos), and the number of keys. A weighted hammer action 88 key mechanism will weigh 20 pounds or so and that doesn’t include the electronics. Other significant factors include the amplifier and speakers, if any. So for a piano with a full-size mechanical keyboard, with an amp and speakers that sound like the real thing, expect something in the 100–300 lb category. For a lightweight 61- or 73-key instrument without a built-in amp, speakers, or weighted keys, figure 15–40 pounds. ",
            "date": "Answered December 27, 2017",
            "views": "4",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Loving",
                    "user_href": "/profile/David-Loving"
                },
                {
                    "user_id": "Mohammed Yahya",
                    "user_href": "/profile/Mohammed-Yahya-115"
                },
                {
                    "user_id": "Erik Verhoef",
                    "user_href": "/profile/Erik-Verhoef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashley Roberts",
                "href": "/profile/Ashley-Roberts-128"
            },
            "answer_text": "I presume you mean an electronic piano. (An electric piano is quite a dated instrument from the 60s/70s with a very distinct type of synthetic sound.) 25 - 50 pounds is a good answer. ",
            "date": "Answered October 22, 2017",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfred Burovadeliya",
                    "user_href": "/profile/Alfred-Burovadeliya"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                },
                {
                    "user_id": "Rob Brown",
                    "user_href": "/profile/Rob-Brown-13"
                }
            ]
        }
    ]
}