{
    "title": "What is the most expensive item ever sold at an auction? - Quora",
    "tags": [
        "Millionaires Club",
        "Christie's",
        "Sotheby's",
        "Expensiveness",
        "Auctions",
        "World Records"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Edwards",
                "href": "/profile/Aaron-Edwards-1"
            },
            "answer_text": "What is the most expensive item ever sold at auction? Well, it is a convoluted answer. It is not the \"The Card Players\" by Cezanne. It is the highest price a work of art has ever sold for, but it was not sold at auction. It was sold at a private sale in 2011 for anywhere from $250 to $300 million. (Exact prices are not known) (1) Before I get to the highest selling item at auction, I feel that I must mention three other works of art sold at private sales for a higher price than the auction record.  \"No. 5, 1948\" by Jackson Pollock sold for $140 million at a private Sotheby's sale in 2006. (2)\"Woman III\" by Willem de Kooning sold for $137.5 million at a private sale by Larry Gagosian in 2006. (3)\"Portrait of Adele Bloch-Bauer I\" by Gustav Klimt sold for $135 million at a private Christie's sale in 2006. (4)The most expensive painting ever sold at public auction is \"The Scream\" by Edvard Munch. It sold for $119.9 million in 2012 at Sotheby's and surpassed the previous auction record of Pablo Picasso's \"Nude, Green Leaves and Bust\" which fetched $106.5 million at Christie's in 2010. (5) However, if you adjust for inflation, the most expensive painting ever sold at auction is \"Portrait of Dr. Gachet\" by Vincent van Gogh, which sold for 82.5 million at Christie's in 1990. In today's dollars that would be $147.8 million. Oddly enough, the whereabouts of this painting are unknown to the public and have been for some time. (6) The most expensive \"thing\" sold at auction was not a painting at all. It is the 22 MHz Bandwidth in the 48 contiguous United States. It was sold by the US Government in 2008 to Verizon for $4.7 billion. If you are looking at corporeal items, though, the paintings are the still most expensive. (7)  As for non-paintings and non-frequencies, the most expensive thing ever sold at auction is \"L’Homme qui marche I\" by Alberto Giacometti. This sculpture sold for $104.3 million in 2010 at Sotheby's. (8) Other notables include the highest selling piece of furniture, the Badminton Cabinet, which sold for $36 million at Sotheby's in 2004 and also da Vinci's Codex Leicester, which was bought by Bill Gates in 1994 for $30.8 million at Christie's. Gates later released a scanned version of the Codex. For other auction records, check the last source. (9)   Sources For $250 Million, Qatar Buys One of Cézanne’s The Card Players, the Priciest-Ever PaintingDavid Geffen Sells Jackson Pollock for $140 millionWillem de Kooning - \u0091Woman III\u0092 - Art - Report - New York TimesLauder Pays $135 Million, a Record, for a Klimt PortraitThe Top 10 Art Auction Sales Ever, Including Record $120 Million For Munch's 'The Scream' - ForbesPortrait of Dr. Gachet700 MHz auction ends: Wireless heavyweights biggest players, others surpriseGiacometti Work Sells for Record $104.3 MillionTop 10 Most Expensive Auction Items - TIME",
            "date": "Answered February 19, 2013",
            "views": "26",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jack Sherlock",
                    "user_href": "/profile/Jack-Sherlock-1"
                },
                {
                    "user_id": "Jacqueline Rousseau",
                    "user_href": "/profile/Jacqueline-Rousseau"
                },
                {
                    "user_id": "Kayla Reid",
                    "user_href": "/profile/Kayla-Reid"
                },
                {
                    "user_id": "Sarah Smith",
                    "user_href": "/profile/Sarah-Smith"
                },
                {
                    "user_id": "Pigyoung Pigyoung",
                    "user_href": "/profile/Pigyoung-Pigyoung"
                },
                {
                    "user_id": "Gosia Rybarczyk",
                    "user_href": "/profile/Gosia-Rybarczyk"
                },
                {
                    "user_id": "Hewitt HU",
                    "user_href": "/profile/Hewitt-HU"
                },
                {
                    "user_id": "Gopi Nath",
                    "user_href": "/profile/Gopi-Nath-4"
                },
                {
                    "user_id": "Andy Lee Chaisiri",
                    "user_href": "/profile/Andy-Lee-Chaisiri"
                },
                {
                    "user_id": "Jeff Harris",
                    "user_href": "/profile/Jeff-Harris-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sadhvi Sharma",
                "href": "/profile/Sadhvi-Sharma-11"
            },
            "answer_text": "This piece has taken a look at a very interesting and expensive auction: Mughal & Maharaja Jewels With 500 Years Of Indian History, Sold At Christie’s For $110 Million In 12 Hours India was truly a rich and bountiful country at one point of time, which is proved once again by the Christie’s Maharaja Mughal Magnificence auction in New York. The noted British auction house is known for selling various rare and historically significant pieces from both public and private collections. This time the Maharaja Mughal auction at their New York branch broke the record for being the highest priced auction for any Indian art with Mughal objects coming at a total of $109,271,875, all gone within 12 hours. It lands just short of being the highest single-owner collection to go at the auction, with that place being taken by collection of Elizabeth Taylor sold in 2011 that totalled at $115.9-million. Some of the thing sold at this auction were: *This article was originally published on ED Times* ",
            "date": "Answered June 27, 2019",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jack Sherlock",
                    "user_href": "/profile/Jack-Sherlock-1"
                }
            ]
        }
    ]
}