{
    "title": "What are the differences between classical harmony and jazz harmony? - Quora",
    "tags": [
        "Harmony (music)",
        "Jazz Music",
        "Music Theory",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saul Tobin",
                "href": "/profile/Saul-Tobin"
            },
            "answer_text": "Given the diversity and overlap of classical and jazz music, it’s probably impossible to answer this question comprehensively. As someone with training in both traditions, however, I feel I’m in a decent position to describe what I think is the biggest philosophical difference. Jazz harmony is vertical; classical harmony is horizontal. This difference in perspective comes out in a lot of ways. Most obviously, jazz chords tend to be very “tall.” Jazz musicians routinely play chords with 5 or 6 notes in them, and they treat these as utterly trivial, functional chords within tonal harmony. Jazz theory provides a sophisticated and nearly exhaustive framework for analyzing the vertical structure of complicated chords, in terms of root, guide tones, extensions, tensions, upper structures, clusters, fourth voicings, shapes, drop 2 mechanical voicings, substitutions, and more. Classical musicians tend to treat anything more complicated than a diatonic seventh chord as spooky arcane chromaticism and leave it at that. If you were to pick a random group of 5 notes on the piano and show it to a classical musician, they’d probably say it’s atonal; if you showed the same group of notes to a jazz musician, they’d probably say it’s a voicing for a dominant 7th chord. And they’d both be sort of right. Jazz harmony is also vertical in the way it views scales. In jazz, as an aid to improvisation, you think about the scale as being defined in relation to the chord. So if you’re playing a ii-V-I in C major, you start on D Dorian, then move to G Mixolydian, then move to C Ionian aka C major. From a classical perspective, the chord is defined in relation to the scale degrees of the tonality of the entire passage, so if the passage is in C major, the ii chord isn’t composed of the 1, 3, 5 and 7 in D Dorian, it’s composed of re, fa, la, and do in C major. This probably seems like a trivial distinction, but that’s only because this is a trivial example. When you start applying more sophisticated scales to more complicated chords, it makes a real difference, because jazz musicians are very comfortable using one set of notes over the ii, another over the V, and yet another over the I. Classical theory would have to bend over backwards to explain the function of all these different chromatic notes in relation to the scale degrees of the key, while jazz theory doesn’t blink an eye as long as each scale fits the chord it goes with. The advantage of the classical approach is that it keeps perspective on the context, voice leading, and function of the chords. If you listen to how old school jazz musicians talk, they actually often mention how you need to look at tunes from the classical point of view too, since otherwise you’ll use the wrong scale for the context of a chord in the entire song. For instance, if a minor 7th chord is the iii, you should play a b9/Phrygian over it, even though that goes against jazz chord-scale theory — because that’s how the iii chord fits into the context of the key of the song. The classical approach lends itself to understanding the melodic and structural pull of chromatic notes, while the jazz approach tends to emphasize the way chromatic notes fit into the vertical structure of a single chord. The way jazz and classical theory view chord progressions is yet another example of the difference between the horizontal and vertical perspectives. In jazz, a chord progression like a ii-V is a self-contained unit that defines a momentary tonality sufficient unto itself. It can be freely combined with other harmonic units in the same key or different keys, substituted for them, nested within them, stacked next to them, or even just replaced with a I chord in the appropriate key. This is how you get a tune like Coltrane’s Giant Steps, where ii-V-Is in three unrelated keys happen one after another, with no transition or resolution required. You see the same principle at work in the chord changes to bebop standards like Charlie Parker’s Blues for Alice, modal tunes like Herbie Hancock’s Maiden Voyage, or even the Duke Ellington classic Satin Doll. Now, that isn’t to say that these tunes can’t be analyzed from a classical, horizontal perspective, where the momentary key changes are explained as part of the tonality of the entire song. But jazz theory doesn’t primarily think of them that way. The classical approach has important advantages of its own, of course, since it allows you to think of chord progressions not as sequences of immutable harmonic objects, but rather as continuous flowing motions. Classical harmony allows you to think more easily about blurring the lines between chords while keeping the overall motion intact. That’s why in classical theory a suspension is a delayed resolution of a note from the previous chord, while in jazz theory a suspension is a substitution of a chord’s fourth in place of its third, not necessarily requiring resolution. In jazz, chords are objects. In classical, chords are incidental combinations of notes formed by the motion of melodies. It would be a mistake to think that either the vertical or horizontal mindset is “correct” or “better.” These aren’t mutually exclusive. In fact, these perspectives complement each other beautifully, since they have different strengths and weaknesses. I wish every composition undergrad were required to take courses in both jazz and classical harmony. ",
            "date": "Updated April 8, 2017",
            "views": "71",
            "upvotes": " View 70 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                },
                {
                    "user_id": "Gustavo Guardiola",
                    "user_href": "/profile/Gustavo-Guardiola"
                },
                {
                    "user_id": "Ethan Hein",
                    "user_href": "/profile/Ethan-Hein"
                },
                {
                    "user_id": "Jesse Green",
                    "user_href": "/profile/Jesse-Green-13"
                },
                {
                    "user_id": "Isaac Blackburn",
                    "user_href": "/profile/Isaac-Blackburn-1"
                },
                {
                    "user_id": "Nils Isberg",
                    "user_href": "/profile/Nils-Isberg"
                },
                {
                    "user_id": "Michael Sheehy",
                    "user_href": "/profile/Michael-Sheehy-11"
                },
                {
                    "user_id": "Vishwas Dubey",
                    "user_href": "/profile/Vishwas-Dubey-3"
                },
                {
                    "user_id": "Avshalom Ofri",
                    "user_href": "/profile/Avshalom-Ofri"
                },
                {
                    "user_id": "Jaymian Poon",
                    "user_href": "/profile/Jaymian-Poon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gustavo Guardiola",
                "href": "/profile/Gustavo-Guardiola"
            },
            "answer_text": "It’s not the harmony what is different, but the structure of the theme. Most jazz is tonal but with strong modal implications. In a chord progression, the chords are organized based on tonal relations mostly, but the structure of the progression is different. The other big difference is about the way tension is assimilated to the chord. So let’s see… Thematic structure and modal implications. In classical music, during the common practice period, the main theme has some well defined features. A classical theme is a musical structure with a defined tonal center. Most classical themes begin in tonic and end with an authentic cadence to tonic, or a semicadence. There are some cases in which the main theme ends with an authentic cadence to the V (when the theme is in a major tonality), or to the v or the relative major (when the theme is in a minor tonality). Besides, themes from the common practice period always begin with a tonic prolongation. When a thematic structure follows those features we can say that it’s strictly tonal and that’s the case for classical themes. For a classical musician from the common practice period, it made sense that the first phrase of the theme presents the tonality and the last phrase establish it. But in jazz music, the theme can begin in a mode, but not necessarily. The chords of the progression are organized according to tonal principles, but the main phrase of the theme can be modal. That’s a major difference. So, the main phrase doesn’t necessarily present the tonic, but it may present a mode of the tonality. When the main phrase of the theme implies a mode, the whole progression takes a completely different character, even though the progression follow tonal relations. Some possibilities open up. For instance, in Beautiful Love, the first time the theme is played, it ends with a cadence to the mode of the main phrase. But in the repetition, the theme ends with a cadence to tonic. So, it’s not the harmony that it’s different, but the thematic structure. The other big difference is about tension and the chord itself. This was very well explained by Saul Tobin, so I’m just going to add some things. Imagine that we have a chord with all the diatonic tensions. If we have Dm, the whole chord would include up to the 13th, so we will get D - F - A - C - E - G - B. It’s the whole diatonic scale! How could we handle it so that it still implies a Dm? Well, jazz musicians made a very sophisticated system of note substitutions. So in the case of Dm, if we use the 9th, we will omit the root; if we use the 11th we will omit the 13th and the 5th; if we use the 13 we would omit the 5th and the 11th. So with this game of substitutions we can create many different sonorities that represent Dm even if the root is not even present; well, the bass usually plays the root anyway. When you put this things together -thematic structure, modal implication and tensions assimilated to the chord- the result is really different. The harmonic relations are still the same, but the progression takes a completely different mood. So, in the case of jazz harmony, it’s not really about saying something new, but about saying something again, but from a different perspective. ",
            "date": "Answered March 30, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adam Zhang",
                    "user_href": "/profile/Adam-Zhang-32"
                },
                {
                    "user_id": "Robert Ehle",
                    "user_href": "/profile/Robert-Ehle"
                },
                {
                    "user_id": "Pedro Henrique Dadalt de Queiroz",
                    "user_href": "/profile/Pedro-Henrique-Dadalt-de-Queiroz"
                },
                {
                    "user_id": "Clifford Meyer",
                    "user_href": "/profile/Clifford-Meyer"
                }
            ]
        }
    ]
}