{
    "title": "What should a 12-year-old watch on YouTube? - Quora",
    "tags": [
        "12 (age)",
        "YouTube Videos",
        "YouTube",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vivaan Mathur",
                "href": "/profile/Vivaan-Mathur"
            },
            "answer_text": "Hello This question just appeared in my feed. So I would answer this. A 12 year old child can watch a lot of interesting content on YouTube. They can pick one topic everyday and research it from there. Then note down whatever they find. This extensively improved their general knowledge. Let them do research on various different topics. Animated content is often easier to understand, so they can search for such videos on YouTube for clearing doubts and getting a deeper view. They can also entertain themselves, there are many interesting videos one days. However, keep my suggestion, do not watch those type of people who fall into the 'YouTuber' category. Entertainment is good. I am not talking about all entertainment but some people who just talk about random things on YouTube, or 'roast' and all that. YouTube was never meant for this. YouTube was supposed to be an intellectual hub like quora but it too got spoilt after all these came. Also gaming and all. What is the point of watching a game :) I do not want to target anyone personally, but I found some channels like those on YouTube which I don't think are worth wasting your time. For example, carry minati, BB vines, Ashish, PewDiePie, etc. There are much more things for YouTube entertainment. They can watch those. Thanks ",
            "date": "Answered September 9, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anthony Anderson",
                    "user_href": "/profile/Anthony-Anderson-528"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suraj Choudhary",
                "href": "/profile/Suraj-Choudhary-249"
            },
            "answer_text": "YouTube has ocean of content in their database and it's really necessary that we should filter out the content that are important for us . Ranging from certain age group if you are taking about a 12 years old then it's become much important as we never wish that out siblings or children to get indulged on erotic content that come in to the home screen so we should always try selections of content, parental control features, and filtering of videos deemed inappropriate viewing for children . If i was 12 years old then i would prefer watching videos like Firstly I would definitely learn musical instrumentsA new language is something i always wanted to thought there are better application on internet for learning languageI find children love learning about space and releted stuff so they can watch it.Rest they should make friends go out and play outdoor games and make lots of memories so they can share with friends further when get to hostle for future study. Sorry for my poor English and grammatical mistake thank you for reading ",
            "date": "Answered September 9, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Raman",
                "href": "/profile/Shubham-Raman-6"
            },
            "answer_text": "You can watch tech channel , gaming channel , educational videos , etc. Its upto you . You can also subscribe my channel you can watch that channel too😂. ",
            "date": "Answered September 9, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}