{
    "title": "What kind of music stimulate creative thinking? - Quora",
    "tags": [
        "Jazz Music",
        "Thinking",
        "Motivation",
        "Classification Question",
        "Classical Music",
        "Creativity",
        "Inspiration",
        "Artists and Creative Professions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mayank Sharma",
                "href": "/profile/Mayank-Sharma-452"
            },
            "answer_text": "According to me music can play the best role to stimulate creative thinking. I have read a book regarding this topic. So the book says— Classical music (Hayden, Mozart) has clarity, elegance, and transparency. It can improve concentration, memory, and special perception. Impressionist music (Debussy, Faure, Ravel) is based on free-flowing musical moods and impressions, and evokes dreamlike images. A quarter hour of musical daydreaming followed by a few minutes of stretching can unlock your creative impulses and put you in touch with your unconscious. Rock music by such artists as U2, Red Hot Chili Peppers, Elvis Presley, the Rolling Stones, etc., can stir the passions, stimulate active movement, release tension, mask pain, and reduce the effect of other loud, unpleasant sounds in the environment. It can also create tension, dissonance, stress, and pain in the body when we are not in the mood to be energetically entertained. Jazz, the blues, Dixieland, soul, calypso, reggae, and other music and dance forms that came out of expressive African heritage can uplift and inspire, release deep joy and sadness, convey wit and irony, and affirm our common humanity. Salsa, rhumba, maranga, Macarena, and other forms of South American musichave a lively rhythm and beat that can set the heart racing, increase respiration, and get the whole body moving. Samba, however, has the rare ability to soothe and awaken at the same time. Big band, pop and top-40, and country-western can inspire light to moderate movement, engage the emotions, and create a sense of well being. Ambient, attitudinal, or New Age music with no dominant rhythm (for example, the music of Seven Halpern or Brain Eno) elongates our sense of space and time and can induce a state of relaxed alertness. Heavy metal, punk, rap, hip-hop, and grunge can excite the nervous system, leading to dynamic behavior and self-expression. Religious and sacred music, including shamanic drumming, church hymns, gospel music, and spirituals, can ground us in the moment and lead to feelings of deep peace and spiritual awareness. It can also be remarkably useful in helping us to transcend—and release—our pain. Gregorian Chant uses rhythms of natural breathing to create a sense of relaxed spaciousness. It is excellent for quiet study and meditation and can reduce stress. Slower Baroque music (Bach, Handel, Vivaldi, Corelli) imparts a sense of stability, order, predictability, and safety and creates a mentally stimulating environment for study or work. Romantic music (Schubert, Schumann, Tchaikovsky, Chopin, Liszt) emphasizes expression and feeling, often invoking themes of individualism, nationalism, or mysticism. It is best used to enhance sympathy, compassion, and love. Source : The Mozart Effect: Tapping the Power of Music to Heal the Body, Strengthen the Mind, and Unlock the Creative Spirit ",
            "date": "Answered February 5, 2017",
            "views": "3",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Varaprasad Chintalapudi",
                    "user_href": "/profile/Varaprasad-Chintalapudi"
                },
                {
                    "user_id": "Teodor Laci",
                    "user_href": "/profile/Teodor-Laci-1"
                },
                {
                    "user_id": "Janet Hempkin",
                    "user_href": "/profile/Janet-Hempkin"
                },
                {
                    "user_id": "TIffanyrose Angeles",
                    "user_href": "/profile/TIffanyrose-Angeles"
                },
                {
                    "user_id": "Shiva Gowda",
                    "user_href": "/profile/Shiva-Gowda-28"
                },
                {
                    "user_id": "Meagan Carr",
                    "user_href": "/profile/Meagan-Carr-1"
                },
                {
                    "user_id": "Christina Goodacre",
                    "user_href": "/profile/Christina-Goodacre"
                },
                {
                    "user_id": "Divya Bharathi",
                    "user_href": "/profile/Divya-Bharathi-88"
                },
                {
                    "user_id": "Rahul Karn",
                    "user_href": "/profile/Rahul-Karn-12"
                },
                {
                    "user_id": "Kalie Rosati",
                    "user_href": "/profile/Kalie-Rosati"
                },
                {
                    "user_id": "Gavin Christopher Patterson",
                    "user_href": "/profile/Gavin-Christopher-Patterson"
                },
                {
                    "user_id": "Jithendra Naladala",
                    "user_href": "/profile/Jithendra-Naladala"
                },
                {
                    "user_id": "Venkatasai",
                    "user_href": "/profile/Venkatasai-1"
                },
                {
                    "user_id": "Erin Dobbin",
                    "user_href": "/profile/Erin-Dobbin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Gibson",
                "href": "/profile/Pete-Gibson"
            },
            "answer_text": "A few artists that have always helped to jack up my creativity are Oscar Petersen, Ramsey Lewis, and Chris Thile (by himself and any band that he has been a part of). These gentlemen are amongst the most talented and creative musicians of all time, by any standards. ",
            "date": "Answered January 20, 2013",
            "views": "28",
            "upvotes": "0"
        }
    ]
}