{
    "title": "What song or music are you listening to right now that the rest of us should take notice of? - Quora",
    "tags": [
        "Songs Recommendations",
        "Listening to Music",
        "Listening",
        "Music Recommendations",
        "Music Industry",
        "Musicians",
        "Songs",
        "Music",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Rawson",
                "href": "/profile/Tony-Rawson-3"
            },
            "answer_text": " 1:08 / 5:23 #MikeAndTheMechanics #TheLivingYears #USNumber1 Mike + The Mechanics - The Living Years (Official Video)  Mike + The Mechanics SUBSCRIBE Official video for \"The Living Years\" by Mike + Mechanics. Released in 1989, this single reached number 1 in Australia, Canada, Ireland and the US, while it was number 2 in the UK, where it went Silver. The song has been covered many times including interpretations by Alabama, Chris De Burgh, West End theatre star Michael Ball, Marcia Hines, Engelbert Humperdinck, James Last, The London Symphony Orchestra, Christian artist Russ Lee, Rhydian, John Tesh, Russell Watson, the London Community Gospel Choir, the Newsboys, The Isaacs, The Katinas, Japanese singer Kaho Shimada, Italian band Dik Dik and Michael English. In 1996 the legendary songwriter Burt Bacharach declared \"The Living Years' is one of the finest lyrics of the last 10 years.\" It was nominated for 4 Grammy awards in 1990 and won the prestigious Ivor Novello award for Best Song Musically & Lyrically in 1989. Lyrics: Every generation Blames the one before And all of their frustrations Come beating on your door I know that I'm a prisoner to all my father held so dear I know that I'm a hostage, to all his hopes and fears I just wish I could have told him in the living years Crumpled bits of paper Filled with imperfect thought Stilted conversations I'm afraid that's all we've got You say you just don't see it He says it's perfect sense You just can't get agreement In this present tense We all talk a different language Talking in defence [Chorus] Say it loud (say it loud) Say it clear (say it clear) You can listen as well as you hear It's too late (It's too late) When we die (oh, when we die) To admit we don't see eye to eye So we open up a quarrel Between the present and the past We only sacrifice the future It's the bitterness that lasts So don't yield to the fortunes You sometimes see as fate It may have a new perspective On a different day And if you don't give up, and don't give in You may just be okay [Chorus] Say it loud (say it loud) Say it clear (say it clear) You can listen as well as you hear It's too late (It's too late) When we die (oh, when we die) To admit we don't see eye to eye I wasn't there that morning When my father passed away I didn't get to tell him All the things I had to say I think I caught his spirit Later that same year I'm sure I heard his echo In my baby's new born tears I just wish I could have told him In the living years [ Chorus] Say it loud (say it loud) Say it clear (say it clear) You can listen as well as you hear It's too late (It's too late) When we die (oh, when we die) To admit we don't see eye to eye ",
            "date": "Answered April 26, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ash Gaming",
                "href": "/profile/Ash-Gaming-46"
            },
            "answer_text": "skrillex - fuji opener skrillex - mumbai power martin garrix -drown blackbear - do re mi blackbear - idfc martin garrix - mistaken nf- when i grow up nf- the search logic - contra travis scott - highest in the room MGK- rap devil ",
            "date": "Answered April 22, 2020",
            "views": "27",
            "upvotes": "0"
        }
    ]
}