{
    "title": "What's considered good music taste? - Quora",
    "tags": [
        "Aesthetics (philosophy)",
        "Musical Taste",
        "Taste (aesthetic)",
        "Music Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohit Sudarsan",
                "href": "/profile/Rohit-Sudarsan"
            },
            "answer_text": "It’s quite subjective but to me, a person with good (or better) taste in music exhibits one or many of the following traits: can appreciate a wide variety of musical genres(Every genre has something good about it. Whether you like all these genres equally is a completely separate matter.) Has matured beyond ‘MY music is better than YOUR music’ or ‘THIS genre is better than THAT genre’ squabbles.(People are different and have different tastes in things. Some people take their music very seriously and search to find very specific art. Some people are happy with what’s dealt in front of them because music is important to them but not THAT important. Some genres/artists’ music make more sense if you understand that context/background from which they arose. Some genres are challenging to get into and might take some time for you to grow into.) Understands that ‘popularity’ and ‘quality’ aren’t the same thing but CAN overlap some times.(It doesn’t take a genius to tell that Lil Pump’s very successful ‘Gucci Gang’ single isn’t exactly ‘high art’) While it is trendy to listen to only what big music magazines (Pitchfork, Rolling Stone,etc.) publish as their ‘year-end lists’, ‘best new music’,etc., a person with ‘good’ taste takes the time to listen to what they like instead of just going with the consensus of what a brand told them.Original question: What's considered good music taste? ",
            "date": "Answered April 24, 2018",
            "views": "105",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Kumar",
                    "user_href": "/profile/Aryan-Kumar-782"
                },
                {
                    "user_id": "Amy Vongvirath",
                    "user_href": "/profile/Amy-Vongvirath-2"
                },
                {
                    "user_id": "Asra Anjum",
                    "user_href": "/profile/Asra-Anjum-66"
                },
                {
                    "user_id": "Dharmika Dharu",
                    "user_href": "/profile/Dharmika-Dharu-2"
                },
                {
                    "user_id": "Susu",
                    "user_href": "/profile/Susu-88"
                },
                {
                    "user_id": "Kalipso Bznuni",
                    "user_href": "/profile/Kalipso-Bznuni-1"
                },
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-37"
                },
                {
                    "user_id": "Josefina Cerna",
                    "user_href": "/profile/Josefina-Cerna"
                },
                {
                    "user_id": "Mohammad Alzahrani",
                    "user_href": "/profile/Mohammad-Alzahrani-18"
                },
                {
                    "user_id": "Coriander",
                    "user_href": "/profile/Coriander-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamir Smith",
                "href": "/profile/Tamir-Smith-4"
            },
            "answer_text": "To me, having a taste in music at all is good. Surprisingly, or unsurprisingly, many people do not sit down and figure out what their musical niche is. It is much easier to collect what you like through memory or storage of the songs using playlists and streaming services, and simply dismiss what you don’t like when it comes up. But more often than not, there is a common theme that strings these music choices together, and only through introspection and brooding can you really figure out what makes you like this and why you don’t like that on a musical and sonic level and how that interacts with your thoughts and behaviors. Knowing oneself is always good and therefore, so are your music tastes. Now that being said, there are some technically incompetent pieces of music that are just simply unbearable to listen, but I listen to tons of music that receives that very same criticism. An incomplete composition isn’t bad; it’s not complete. A highly polished but mediocre pop tune isn’t technically bad; it’s just mediocre, composition wise, and could do more to be more varied and interesting. A 20 minute ear-piercing Drone Metal/Harsh Noise track isn’t bad; it’s noisy, unsettling, and cathartic. But perhaps you see differently? What’s good? What’s bad? As you can see, these things shift and move around based on perspective and whoever bothers to challenge the music tastes of another. It’s all relative, really. ",
            "date": "Updated December 16, 2018",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-37"
                },
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-29"
                },
                {
                    "user_id": "Anna Burns",
                    "user_href": "/profile/Anna-Burns-93"
                },
                {
                    "user_id": "Isa Vincent",
                    "user_href": "/profile/Isa-Vincent"
                },
                {
                    "user_id": "Adrian Kapus",
                    "user_href": "/profile/Adrian-Kapus"
                }
            ]
        }
    ]
}