{
    "title": "What is the best band of all time? - Quora",
    "tags": [
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Fassiotto",
                "href": "/profile/Matt-Fassiotto-1"
            },
            "answer_text": "This is a fun question to answer. On the other hand, the word “Best” is difficult to apply to music. I’ll approach it as though if any one member were missing from the band then “the band” wouldn’t be the same and therefore not on the list. In other words, the less visible members ( usually the drummer) are equally important. The band shouldn’t have any interchangeable parts. They may have had other incarnations, but there should be one “great” version of the band. This is why I am not including great and influential acts such as the Kinks. The Kinks are a unique band, but the drummer and bass player are what I would consider unremarkable. In other words, you could have subbed them out for many other people without losing the unique sound of the band. I’ll also disclose that I’ve seen 3 incarnations of the Grateful Dead a total of 10 times. Only one of those shows with Brent Mydland on Acoustic Piano, at the Greek Theater in Berkeley, was a transcendent event that they were known for. I wouldn’t chose one version of the band over any other. In fact, Bruce Hornsby was the most amazing piano player, vocalist, accoridan player and brought alot to the Grateful Dead, but by that time Garcia was running out of energy. Hard to put one of my favorite bands on the list. Maybe the best Country, American roots band ever for a spell. I also think there are several that would make this list if it weren’t for untimely deaths or not enough output. I’ll call those honorable mention. Honorable Mention : The original Allman Brothers : only 3 albums, one a masterpiece ( Live at Fillmore). They could play anything and would have if Duane Allman and Barry Oakley didn’t pass away so early.Fleetwood Mac : They were/are really two+ bands. If you were to put together a double album of greatest hits, you’d have to include some of the Peter Green Songs. That is a pretty strong catalog.Buddy Holly and the Crickets : Buddy Holly was the face of the band, but the other 3 guys were full participants in the song writing process and were all original/unique players of their instruments. Sonny Curtis, Jerry Allison, and Joe Mauldin all went on to great success despite losing their leader. They made it to the Rock and Roll Hall of fame as “the Crickets” because they made the Everly Brothers successful, and wrote some classic songs on their own, such as “I fought the law”, and several hits for the Everly Brothers. We will always ask what if… ?The Police : Again, known mostly for the front man, who is a great bass player. However, you can’ t deny Stewart Copeland and Andy Summers as equal participants in creating a very unique sound. Andy Summers, I guess gave up guitar, but there’s really never been anybody else that sounds like him. Stewart Copeland is generally considered one of the greatest percussionists on earth. They didn’t have enough output to qualify.The Clash : 4 great and original players, that brought punk rock into the mainstream. Unfortunately, they had the typical drug problems that prevented them from lasting. The drummer and bass player were both exceptionally talented. Even though, “London Calling” is a masterpiece they didn’t have enough output to qualify.Van Halen : Not a big fan of this genre, but the David Lee Roth version was very influential on popular culture and also a complete set of excellent musicians. David Lee Roth had the right delivery for this kind of music. Everyone had to have a candy apple red Charvel guitar right…My top ten : The Beatles : Think about “Day in the Life” without Ringo’s drums. His drumming is unique and fits the song perfectly throughout the Beatles catalog. Often times, we don’t give George the credit he deserves. I was just thinking about what a lesser world we would live in without a song such as “Within You, Without You”. Think about the effort George put into making such a profound work of music that merged two completely different cultures together. As far as I’m concerned, the Beatles could not have existed without all 4 of these unique individuals.The Rolling Stones : They had a run of 4 straight classic albums when transitioning out of the Brian Jones era. So specifically the Mick Taylor, Nicky Hopkins, Bobby Keys era Rolling Stones. I’ve gotta call out the rhythm section during this period. Charlie Watts was an exquisite percussionist, not just on the drum kit, during this era. Just listened to Sticky Fingers and Charlie Watts was doing all kinds of things on that album.Led Zeppelin : 4 master musicians with a whole new style of playing music. Nobody interchangeable in this band. I told Alexa to play Led Zeppelin the other night, and Stairway to Heaven from their 2007 reunion came on. It sounded like Jimmy Page, Robert Plant, and John Paul Jones with somebody else. It didn’t sound like Led Zeppelin.The Who : The Who imho is more about Keith Moon and John Entwistle than the other two guys. I read Pete Townsend's “Auto biography” and was bothered by the lack of credit the other two guys received. Does anybody really think “My Generation” would be that great of a song without Entwistle’s bass and Keith Moon’s drumming? The same could be said for most all their songs of this era. “Tommy” is actually a silly album without Keith Moon and John Entwistle backing it up. Nothing sadder than seeing the Who without the original once in a lifetime rhythm section. Oh yeah, and Entwistle played all the horns on all albums including Quadrophenia. “Who’s Next” is a masterpiece. New instruments played by Pete Townsend and all, but you can’t discount Entwistle and Moon on this album either. I had the pleasure of seeing them with Entwistle in 1981 and yeah they were something else.U2 : Achtung Baby is a masterpiece. Most of their work up to that point was also unique and inspiring. I remember buying “Boy” and “October” when those early albums came out. Though they aren’t master musicians, their collective sound is so powerful and passionate. As much as people like to hate the antics of the leader of this band, the rhythm section of Adam Clayton and Larry Mullen Jr. have always been underrated.Pink Floyd : I own every one of their albums up to “The Wall”. I think the Nick Mason, David Gilmore, Richard Wright combo is in itself one of the best ensembles to exist. Roger Waters is all fine and good, but those other three guys could really play well together. “Dark Side of the Moon” is a masterpiece, and a part of that was that they were smart enough to pull in their friends from Cambridge to enhance the sound. Pink Floyd at their best was at most 20% about Roger Waters.Radiohead : “O.K. Computer” and “Kid A” are master works. All of their albums are exceptional and push the boundaries. When firing on all cylinders they are also one of the best live bands ever. This band is hard to define. Sometimes I don’t even think they play music. Colin Greenwood is a rich bass player. Watching them live, it’s amazing to watch the rhythm section hold the chaos together. The focus between the drummer ( Phil Selway) and Colin Greenwood is pretty intense and unique.The Doors : Another charismatic front man backed by 3 fantastic and unique musicians. They all contributed to the song writing process. Best debut album of all time. The truth about Jim Morrison was he loved playing music in the Doors but he hated being the front man. They were a great band until the end ( no pun intended).Bob Marley and the Wailers : So this was really a band formed in the early sixties by Peter Tosh, Bob Marley, and Bunny Wailer. Even though it seems that it’s Bob Marley and a bunch of other backup musicians it was really a band with those 3 core members who contributed to developing the universal sound of Reggae. I don’t rank this band higher, because there are a few interchangeable musicians that came and went without having a major effect on the sound. They are the only band on this list with less than 4 key people. Next to the Beatles they are also the most influential.R.E.M. : Up until Bill Berry the drummer left the band with a brain hemorrhage they were always getting better and better, exploring new ways of presenting their music. One of the most original sounding bands ever. Bill Berry was apparently much more than a guy who was told what to play. He was key in arranging and even wrote many of their classic songs. All their albums with Bill Berry are excellent. I don’t think any of the R.E.M. albums would be considered a masterpiece, but they squeak into my list because they sustained increasing musical excellence as a team over a long period of time. Hard to classify R.E.M.. Whacked out abstract lyrics, country instruments mixed with the Byrds, and Neil Young? Fantastic band. I regret never seeing them live :-(",
            "date": "Answered October 16, 2018",
            "views": "54",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Lewis",
                    "user_href": "/profile/Jeremy-Lewis-259"
                },
                {
                    "user_id": "Cyrus Applesauce",
                    "user_href": "/profile/Cyrus-Applesauce"
                },
                {
                    "user_id": "Mia Isabell Austli",
                    "user_href": "/profile/Mia-Isabell-Austli"
                },
                {
                    "user_id": "Lukas Poettrich",
                    "user_href": "/profile/Lukas-Poettrich"
                },
                {
                    "user_id": "Bruce Frauman",
                    "user_href": "/profile/Bruce-Frauman"
                },
                {
                    "user_id": "Ami Shah",
                    "user_href": "/profile/Ami-Shah-452"
                },
                {
                    "user_id": "Merrill Russell",
                    "user_href": "/profile/Merrill-Russell-1"
                },
                {
                    "user_id": "Eason Rangarajan",
                    "user_href": "/profile/Eason-Rangarajan"
                },
                {
                    "user_id": "Brad France",
                    "user_href": "/profile/Brad-France"
                },
                {
                    "user_id": "Pushpendra Kumar",
                    "user_href": "/profile/Pushpendra-Kumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marty McCall",
                "href": "/profile/Marty-McCall-1"
            },
            "answer_text": "There are way too many ways to answer this question. First of all, let's assume you mean English-language rock music, an assumption based on the language and placement of the question.  And we'll presume that \"band\" precludes any solo artists, including those that perform under a band-like moniker (like John Ondrasik's Five for Fighting or Trent Reznor's Nine Inch Nails). I guess the question behind the question here is what defines being the \"best.\"  Makes the best music?  Most influential?  Biggest impact? For technical skill, I'd probably lean towards bands like Rush, Yes, Bela Fleck and the Flecktones, Dream Theater, and Van Halen, and between those I'd probably have to choose Union-era Yes, based on sheer band member numbers, but I'm sure plenty of people could construct well-argued alternatives.  For example, a very compelling argument could be made for a band like Queen, which combines skilled musicianship with otherworldly vocal talent. For collective musical talent, it's hard to find a more impressive group than USA for Africa (\"We Are The World\").  With Bruce Springsteen, Bob Dylan, Hall & Oates, Michael Jackson, Smokey Robinson, Tina Turner, Ray Charles, Harry Belafonte, Willie Nelson, Dionne Warwick...the list goes on and on.  Though you could probably make a similar argument for Bob Geldof's Band Aid (\"Do They Know It's Christmas\"), as well as Artists for Haiti (\"We Are The World 25 for Haiti\"). For overall talent (musical and non-musical), I'd probably choose another celebrity supergroup, Voices that Care (\"Voices That Care\").  Besides the (by comparison) modest list of vocal leads, the supporting choir includes the likes of Michael Jordan, Wayne Gretzky, Magic Johnson, Tommy Lee Jones, Whoopi Goldberg, Meryl Streep, and dozens more highly talented celebrities (though it's not clear whether they actually all performed on the song itself).  You could probably still argue for both USA for Africa and Artists for Haiti under this criteria as well. This is the point at which things take a decidedly Beatlesesque flavor. For album sales, The Beatles win hands down, having sold more units than  both of the next two bands on the list (Led Zeppelin and Pink Floyd)  combined.   For impact, creative breadth, longevity, and influence, it's hard to  argue with The Beatles - which is why they're the most commonly given answer to this  sort of question.  For half a century the Beatles have been widely accepted as the root of modern musical influence, and even those that argue alternatives always have to argue against The Beatles, essentially disproving their point.  (That said, the followup meta question -- but who influenced The Beatles? -- is fairly interesting, as the most obvious band to do so is The Beach Boys, who could be said to have driven The Beatles to ultimately become the super-influential band they were, and were a pretty talented bunch themselves.) In terms of popularity, The Beatles likely top the list again, both for height and longevity.  There have been crazes to rival Beatlemania (New Kids on the Block, anyone?), but no group has equaled that level of success.  (Well, perhaps Michael Jackson or Elvis, but alas, neither qualifies as a band.)  And the Beatles are still revered today, in a way that borders on musical religion. But finally there's the big one: who makes the best music?  Sure, I could go down the path of trying to qualify which band's music is better than all others, but I really feel like the answer is whoever's music you like most right now.  Musical enjoyment's underlying subjectivity means you like who you like.  Whoever manages to give you the best version of whatever it is you like, for you, is the best band ever, even if it's They Might Be Giants one day, Two Door Cinema Club the next...and One Direction when your 10-year-old niece is over. So the answer is The Beatles...maybe, but probably not, depending on what you mean by \"best,\" and who you're asking. Hope that clears things up for you. =) ",
            "date": "Answered April 17, 2014",
            "views": "11",
            "upvotes": " View 45 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeremy Lewis",
                    "user_href": "/profile/Jeremy-Lewis-259"
                },
                {
                    "user_id": "Lukas Poettrich",
                    "user_href": "/profile/Lukas-Poettrich"
                },
                {
                    "user_id": "Nakshatra Mahor",
                    "user_href": "/profile/Nakshatra-Mahor"
                },
                {
                    "user_id": "Rushikesh Sunkara",
                    "user_href": "/profile/Rushikesh-Sunkara"
                },
                {
                    "user_id": "Izzy Khirus",
                    "user_href": "/profile/Izzy-Khirus"
                },
                {
                    "user_id": "San",
                    "user_href": "/profile/San-612"
                },
                {
                    "user_id": "Dev Shah",
                    "user_href": "/profile/Dev-Shah-277"
                },
                {
                    "user_id": "John Nath",
                    "user_href": "/profile/John-Nath-1"
                },
                {
                    "user_id": "Roby Lazarus",
                    "user_href": "/profile/Roby-Lazarus"
                },
                {
                    "user_id": "Evan Herzmann",
                    "user_href": "/profile/Evan-Herzmann"
                }
            ]
        }
    ]
}