{
    "title": "What is the most popular Christmas song? - Quora",
    "tags": [
        "Christmas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Holly Root-Gutteridge",
                "href": "/profile/Holly-Root-Gutteridge"
            },
            "answer_text": "This is hard to choose because there are so many utterly beautiful ones, that raise the spirit and are joyful lights to chase away the dark on the longest nights of the (northern hemisphere’s) year. However, my absolute favourite, the one that makes me know it’s Christmas at last, is the setting of Christina Rossetti’s beautiful poem to music, ‘In the Bleak Mid-Winter’: ‘In the bleak midwinter, frosty wind made moan, Earth stood hard as iron, water like a stone; Snow had fallen, snow on snow, snow on snow, In the bleak midwinter, long ago. Our God, Heaven cannot hold Him, nor earth sustain; Heaven and earth shall flee away when He comes to reign. In the bleak midwinter a stable place sufficed The Lord God Almighty, Jesus Christ. Enough for Him, whom cherubim, worship night and day, Breastful of milk, and a mangerful of hay; Enough for Him, whom angels fall before, The ox and ass and camel which adore. Angels and archangels may have gathered there, Cherubim and seraphim thronged the air; But His mother only, in her maiden bliss, Worshipped the beloved with a kiss. What can I give Him, poor as I am? If I were a shepherd, I would bring a lamb; If I were a Wise Man, I would do my part; Yet what I can I give Him: give my heart.’ The way I hear it is usually sung by Cambridge’s King’s College Choir:  They only sometimes play it on Radio 4’s special “Carols from King’s” but it’s utterly magical. ",
            "date": "Answered December 14, 2016",
            "views": "970",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Iris Hwang",
                    "user_href": "/profile/Iris-Hwang-2"
                },
                {
                    "user_id": "Janice Hinkley",
                    "user_href": "/profile/Janice-Hinkley-2"
                },
                {
                    "user_id": "Viv Pereira",
                    "user_href": "/profile/Viv-Pereira"
                },
                {
                    "user_id": "Bill Martinez",
                    "user_href": "/profile/Bill-Martinez-5"
                },
                {
                    "user_id": "Wendi Tibbets",
                    "user_href": "/profile/Wendi-Tibbets"
                },
                {
                    "user_id": "Freni Sillona",
                    "user_href": "/profile/Freni-Sillona"
                },
                {
                    "user_id": "Aaron Boutilier",
                    "user_href": "/profile/Aaron-Boutilier-5"
                },
                {
                    "user_id": "Geoffrey Brickley",
                    "user_href": "/profile/Geoffrey-Brickley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marty Belche",
                "href": "/profile/Marty-Belche"
            },
            "answer_text": " All I Want For Christmas Is You. No joke here. Completely serious. And if it wasn’t a “Cheesy Christmas song” it would be considered one of the greatest songs of all time, PERIOD. Everything about this song was meticulously crafted to be a hit with the talents of only Mariah Carey herself and Walter Afanasieff, produced by them as well. No need for 20 different writers like many singles out today. EDIT: Okay, Last Christmas is in third place now. The second greatest Christmas tune just came back to me, whoops.  Don’t have much productive things to say about this, but I want to retell this . Only a few years after recording this song, Darlene Love had been crushed after Phil Spector had credited songs that she sang under the Ronettes and the Crystals, leaving her with her two sons she had from her two ex husbands after failing to have a career touring. She sold her nice car and was working as a cleaning lady in Los Angeles for $100 a day when she heard this song, her song, playing on the radio. This would be the thing that made her realize that this was all wrong, that she was born to be a star— and with help from friends got back into showbusiness. EDIT 2: Whoops. Forgot Happy Christmas War Is Over. Last Christmas now #4.  Kind of pissed this cut out ‘Happy Christmas Kyoko’ at the beginning. Yoko’s daughter was -just- kidnapped at that time. Ugh. -PRE EDIT BELOW- Close behind would be Last Christmas. (I was listening to it the night before George Michael died, Less than 24 hours before i got the news alert at 5 or 6-ish in the evening on Christmas Day…) ",
            "date": "Updated December 14, 2017",
            "views": "561",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matthew Shaw",
                    "user_href": "/profile/Matthew-Shaw-22"
                }
            ]
        }
    ]
}