{
    "title": "What is the difference between attacking bass and deep bass? And which one is better? - Quora",
    "tags": [
        "Bass (sound)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randy Matthies",
                "href": "/profile/Randy-Matthies"
            },
            "answer_text": "I’m uncertain because I’m not familiar with the terms. If, by attacking bass you’re alluding to style, and if deep bass refers to tone or overall sound, we’re trying to compare two things that aren’t comparable to one another. When you say attacking bass are you thinking of a style like Geddy Lee of Rush, very busy but tasteful and even sometimes allowing the bass to become the lead instrument in a song? Would the sound of deep bass be what Tina, the bass player for Talking Heads used to get, very deep, rumbly and loud? If my supposition is correct, I’d opt for the really deep growly bass that you get from 18″ speakers and a very powerful amp (old school Ampeg is a good choice). I hope this was helpful and if it isn’t perhaps someone who reads my answer can correct my mistakes and truly address your question with more knowledge of what you’re seeking to learn. Cheers! ",
            "date": "Answered February 18, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eduardo Pokadidy",
                "href": "/profile/Eduardo-Pokadidy"
            },
            "answer_text": "Interestingly, people assume a question on bass playing, or maybe sound generation by synthesizers. I think the OP wants to know about the difference between headphones made by Skullcandy, which markets a feature called attacking bass, and those made by other manufacturers, who often promote deep bass, meaning their cans will reproduce very low frequencies. Which is too bad, because a topic on various bass sounds and the impact of their attack on the music would be interesting. ",
            "date": "Answered August 7, 2018",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charan Pandu",
                    "user_href": "/profile/Charan-Pandu-3"
                },
                {
                    "user_id": "Jignesh Virpuriya",
                    "user_href": "/profile/Jignesh-Virpuriya-1"
                }
            ]
        }
    ]
}