{
    "title": "What is your opinion about K-Pop as Christian evangelist? - Quora",
    "tags": [
        "K-Pop",
        "Christianity",
        "Music",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Navya V",
                "href": "/profile/Navya-V-43"
            },
            "answer_text": "Navya V's answer to In your opinion, is K-pop overrated? Quoting from there, I’d like to say that there isn’t any nudity in Kpop and no NSFW content, and its safe for my kids. The Bible doesn’t ask you to ban non white content from your kids so that they become better Christians. Jesus wasn’t white. Being Christian has nothing to do with worshipping whiteness. Just wanted to clear that up in terms of race before moving on to some important points. Kpop Title tracks cannot have any swearing and Korean censorship has cracked down on anything sexy since 2010 as most fans are under 18. I am an exception, so are some mothers and grandmothers in my favourite group’s fandom(20 to 30% are adults). It also has quality content as its a commercial industry and is not some unknown niche like Christian Rap. Korean culture teaches some strict respect to elders (bowing, using honorary terms), commitment to hard work (long training periods and balancing college with work, having good grades,as well as learning a second language like Chinese or Japanese) and having integrity (absolutely no sex allowed, no scandals allowed). Instead of emulating ex Disney girls and boys who are into/out of drugs, partying, underage dating and sex that they so openly propagate through their music and social media, your kids should be emulating kpop idols who frequently thank their parents and speak humbly. About the Western artists, if I use their music videos to prove these things about them , I’ll have fandoms mass reporting my answer. But you know who they are. Conversely, look at this example for a song that criticises entitled children for breaking their parents’ backs with expensive demands (Spinebreaker by BTS).  As a Christian you will be “evangelising” to convert other parents to Kpop lovers, since this is the way to go for parents who would like kids to learn some good values. Sorry about the bad pun. Since kpop idols are active on social media (Social 50), their good behaviour (charity, thanking staff during awards, and more) is always there for kids to watch and learn. Some idols and actors are also religious Christians, like Bogum Park (Park Bo Gum: 10 Fun Facts You Should Know About The 'Moonlight Drawn By Clouds' Star), although not being so vocal about it is recommended by management so that they can be accessible to most Koreans . Koreans also have a Mormon church (Breaking Soles, Saving Seoul: Teen Mormon Missionaries | KOREA EXPOSÉ) which is supposedly better than the US counterpart (Why the US Mormon Church should follow the Korean Mormon Church • r/exmormon). Moral speech and character is important to Koreans but a religion isn’t really required to back it up. Kpop has now started using deep concepts as well, for example BTS Blood Sweat and Tears is a musical adaptation of the novel Demain, where a youth struggles between choosing the church or the evil, but his friend says that are both important. So what does the boy choose? This music video represents the Boy vs Evil and the Temptation concept. The album has songs like Lie, and Lost, Boy meets Evil, etc that show you why teens are being mislead and how they feel about it. Its a good moral lesson, and much more fun than a Bible study class.  I hope this clears your doubts! ",
            "date": "Updated April 29, 2018",
            "views": "6",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rianza De Wet",
                    "user_href": "/profile/Rianza-De-Wet"
                },
                {
                    "user_id": "Rea Gan",
                    "user_href": "/profile/Rea-Gan-1"
                },
                {
                    "user_id": "Miso",
                    "user_href": "/profile/Miso-26"
                },
                {
                    "user_id": "Benjamin Hirt",
                    "user_href": "/profile/Benjamin-Hirt-1"
                },
                {
                    "user_id": "Amppu Julia",
                    "user_href": "/profile/Amppu-Julia"
                },
                {
                    "user_id": "DJ Fontanilla",
                    "user_href": "/profile/DJ-Fontanilla"
                },
                {
                    "user_id": "Kaio What",
                    "user_href": "/profile/Kaio-What"
                },
                {
                    "user_id": "Iris Minor",
                    "user_href": "/profile/Iris-Minor"
                },
                {
                    "user_id": "Hillary Perdomo",
                    "user_href": "/profile/Hillary-Perdomo"
                },
                {
                    "user_id": "Andreas Adinatha",
                    "user_href": "/profile/Andreas-Adinatha"
                },
                {
                    "user_id": "Teleri Ferch Nyfain",
                    "user_href": "/profile/Teleri-Ferch-Nyfain"
                },
                {
                    "user_id": "Kpopper 536",
                    "user_href": "/profile/Kpopper-536"
                },
                {
                    "user_id": "Lovelle Martinez",
                    "user_href": "/profile/Lovelle-Martinez-1"
                },
                {
                    "user_id": "Anjali Priyadarshi",
                    "user_href": "/profile/Anjali-Priyadarshi-1"
                },
                {
                    "user_id": "Autri Basu",
                    "user_href": "/profile/Autri-Basu"
                },
                {
                    "user_id": "Alexander Goodwill",
                    "user_href": "/profile/Alexander-Goodwill"
                }
            ]
        }
    ]
}