{
    "title": "What metric does Spotify use to know when to play ads? - Quora",
    "tags": [
        "Spotify (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nelson R. Elliott",
                "href": "/profile/Nelson-R-Elliott"
            },
            "answer_text": "Spotify, like any publisher/player would like to run as many ads as possible. There are, of course, limits that are likely set by two variables - 1: timing, 2: targeting.  TIMING - First, Spotify has to determine how many ads it could possibly show. They could just play 100% ads, but then no one would listen. They could play 100% music, but then they would go bankrupt. So, they have to find a medium.  They do this by testing profitability vs. number of ads.  If they run one more ad per hour (or per 5 songs, etc.), does the money they make from the extra ad offset the number of users who stop listening? If so, run the ad. Essentially, they are looking for the ad density elasticity of listening demand.  TARGETING - Once Spotify understands the optimal number of ads to run, they have to sell those ads to agencies and advertisers, based on their audience. Advertisers may buy a run of network - targeting all listeners - or they may buy a smaller segment.  Since Spotify connects to Facebook, I'm guessing their targeting capabilities include basically anything on Facebook (age, gender, likes, etc.), as well as listening behavior. In cases where demand overlaps, they probably use some kind of ad serving technology to project inventory levels, and then fill with the highest-paying contracts first.  If they haven't sold as many ads as they would like, they will have to either run ads at a lower density or fill the open inventory with \"house ads.\"  To avoid underdelivering and ticking off a big agency or advertiser, it is also possible that they would run more ads than is optimal. Since they are essentially driving users away to fulfill a contract, this would not be a very good strategy to execute often.  --- N.B. This is a guess based on what I've seen from other publishers. I haven't worked directly with Spotify, so I can't say for sure.  ",
            "date": "Updated April 29, 2016",
            "views": "172",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nathan Arthur",
                    "user_href": "/profile/Nathan-Arthur"
                },
                {
                    "user_id": "Philip Wood",
                    "user_href": "/profile/Philip-Wood-35"
                },
                {
                    "user_id": "Jules Du Chaffaut",
                    "user_href": "/profile/Jules-Du-Chaffaut-1"
                },
                {
                    "user_id": "Dianthe V",
                    "user_href": "/profile/Dianthe-V"
                },
                {
                    "user_id": "Blake Harris",
                    "user_href": "/profile/Blake-Harris-22"
                }
            ]
        }
    ]
}