{
    "title": "What are your expectations on Blackpink's song 'Lovesick Girls'? - Quora",
    "tags": [
        "BLINKS",
        "Kim Jisoo",
        "Rosé (BLACKPINK member)",
        "Jennie (BLACKPINK)",
        "Lisa (Black Pink member)",
        "BLACKPINK",
        "K-Pop Idols",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Semi Owo",
                "href": "/profile/Semi-Owo"
            },
            "answer_text": "Stay Themed and meaningful lyrics  People are probably tired of hearing me say this, lol. In the (whole group) teaser I could hear that some acoustic sounds have been used in the production. It also looks like a really sad song. No choreography in mv  I feel like it would be one of the music videos with a planned out story, I don’t think they will dance in it. It will probably involve more acting. In the teaser they are also running so I think it would be more like a ‘girl’s night out’ or ’young forever’ thing, if you get what I mean… I don’t even understand myself tbh… Car driving scene   I just feel it… I will most likely be wrong though but I feel like there’s going to be a scene where their all in a car just enjoying the moment and laughing happily together like the BTS picture above. I really hope so, it would feel soooooo refreshing to get a scene like that. Sad at the start but gets happier throughout  At the start of the teaser the girls look sad but near the end they are running and are looking more free. Maybe the song will have a really nice build up and we’ll get to see the girls go on an emotional roller coaster throughout the mv. Small moment of silence   I feel like music will suddenly stop playing and everything goes silent and it feels like time just froze... Check the BTS video above to understand what I mean, I’ve put it at the current time (2:48 - 3:00). Their individual teasers made me think this, since it’s mostly silent expect for that high pitch sound and wind. That’s all! I will probably add more later. I hope you enjoyed my answer and feel free to ask me questions about BTS and Blackpink.  -semi- ",
            "date": "Answered September 28, 2020",
            "views": "2",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nevil Jay",
                    "user_href": "/profile/Nevil-Jay"
                },
                {
                    "user_id": "Sieun Lee",
                    "user_href": "/profile/Sieun-Lee-25"
                },
                {
                    "user_id": "Sabiha Khan",
                    "user_href": "/profile/Sabiha-Khan-234"
                },
                {
                    "user_id": "Madhu Dakshinamoorthi",
                    "user_href": "/profile/Madhu-Dakshinamoorthi-1"
                },
                {
                    "user_id": "Maan Sidhu",
                    "user_href": "/profile/Maan-Sidhu-5"
                },
                {
                    "user_id": "Suha Rahman",
                    "user_href": "/profile/Suha-Rahman-8"
                },
                {
                    "user_id": "Areez Atif",
                    "user_href": "/profile/Areez-Atif"
                },
                {
                    "user_id": "Park Lisa",
                    "user_href": "/profile/Park-Lisa-10"
                },
                {
                    "user_id": "Rahul Kudgi",
                    "user_href": "/profile/Rahul-Kudgi-3"
                },
                {
                    "user_id": "Shailendra Khade",
                    "user_href": "/profile/Shailendra-Khade-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lily Mel",
                "href": "/profile/Lily-Mel-1"
            },
            "answer_text": "Totally not answering my own question.. So, I do know quite a bit about Love Sick Girls. Here are some hints on the new Blackpink single coming out in ~1 week. ✨ Dissing women-obsessed men. This is not-so obvious as the name „Love Sick Girls” does not seem to be related to creepy womanizers.. ✨ First, you saw her in a tank, now she’s in a HELICOPTER.. Does this say anymore? ;) ✨ Jisoo queen might say „Blackpink in your area~!” ✨ RAPPER JENNIE WILL BE BACK. I REPEAT, WE’LL GET RAPPER JENNIE!!! ✨ This comes at a cost - there will be a surrounding controversy when it comes to her rap.. ✨ Military-themed. ✨ This is going to break records (NO DUH.) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ You guys, we are going to have the best comeback ever. Let’s reach 1 billion in 10 days everyone!! Stan Blackpink~  ",
            "date": "Answered September 28, 2020",
            "views": "768",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yoo Taeyang",
                    "user_href": "/profile/Yoo-Taeyang-2"
                },
                {
                    "user_id": "Mia Garrett",
                    "user_href": "/profile/Mia-Garrett-18"
                },
                {
                    "user_id": "Chou Tzuyu¹²⁷",
                    "user_href": "/profile/Chou-Tzuyu¹²⁷"
                },
                {
                    "user_id": "Chicken Nugget",
                    "user_href": "/profile/Chicken-Nugget-813"
                },
                {
                    "user_id": "Suha Rahman",
                    "user_href": "/profile/Suha-Rahman-8"
                },
                {
                    "user_id": "Kim Yuna",
                    "user_href": "/profile/Kim-Yuna-55"
                },
                {
                    "user_id": "Lily Hawthorne",
                    "user_href": "/profile/Lily-Hawthorne-6"
                },
                {
                    "user_id": "Rogemel Manito",
                    "user_href": "/profile/Rogemel-Manito"
                },
                {
                    "user_id": "Jennifer Wallace",
                    "user_href": "/profile/Jennifer-Wallace-286"
                },
                {
                    "user_id": "Destiny Jones",
                    "user_href": "/profile/Destiny-Jones-451"
                }
            ]
        }
    ]
}