{
    "title": "What's better, old music or new music? - Quora",
    "tags": [
        "New Music",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abdul Hanan",
                "href": "/profile/Abdul-Hanan-30"
            },
            "answer_text": "When compared to modern music, old music is leagues ahead. Doesnt matter what you enjoy listening to but the truth remains that music has gone downhill since the 90s. You could easily see it in the lyrical complexity of modern music. Almost all the songs have lyrics with same meaning. And many of them sound the same. If you consider a particular song, you could see that it doesnt have much variety and uses the same words over and over again. I know its not fair, but lets look at led zeppelin; they sung about cult, vikings, love, had middle earth references and greek mythology. How many songs today have such variety of words? One of the biggest reasons many people like todays music is that they are FORCED to like it. Think about it, you must have listened to a song that seemed ridiculous and you didnt like it. But as you got to listen to it more and more, you started to enjoy listening to it. Its a basic psychological technique, if you listen to anything for a long amount of time, you begin to enjoy it. And many of the popular songs are shown in the movies, played on radio, played in malls, and so on. You cant escape it. So you also start to like it because you have listened to it long enough. In 20th cent, artists had to be really really amazingly good to win our hearts. If they werent they were forgotten. So the music industry was much more selective. Which means that those artists were among the best in the world. But you cant say about today’s artists. They are not unique, They are all the same and sing and play whats popular. So in short, music has taken a hard hit. ",
            "date": "Answered November 25, 2018",
            "views": "72",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rolando Fuentes",
                    "user_href": "/profile/Rolando-Fuentes"
                },
                {
                    "user_id": "Andreea Cristina",
                    "user_href": "/profile/Andreea-Cristina-61"
                },
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-183"
                },
                {
                    "user_id": "Abhigyan Roy",
                    "user_href": "/profile/Abhigyan-Roy-3"
                },
                {
                    "user_id": "Gabriel Rose",
                    "user_href": "/profile/Gabriel-Rose-23"
                },
                {
                    "user_id": "Jack Harrison",
                    "user_href": "/profile/Jack-Harrison-267"
                },
                {
                    "user_id": "Nakshatra Mahor",
                    "user_href": "/profile/Nakshatra-Mahor"
                },
                {
                    "user_id": "Fabian Te Raaij",
                    "user_href": "/profile/Fabian-Te-Raaij-1"
                },
                {
                    "user_id": "Brayden Bunce",
                    "user_href": "/profile/Brayden-Bunce-2"
                },
                {
                    "user_id": "Cole Handy",
                    "user_href": "/profile/Cole-Handy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bely A. P.J.",
                "href": "/profile/Bely-A-P-J"
            },
            "answer_text": "Say which kind of music is better depends on what we like to hear more, because for me I think that modern music, it’s not the better but I like it more. But when we say that we prefer modern music, many people relate it with trap, which has obscene words and now is the most heard by younger people at parties and many places like malls, radios even in movie. But I don´t like that kind of music, because the first thing that I notice in a song are the lyrics, because I like to try to feel what the singer wants to express and what he can be feeling when he wrote it. But besides of this, I think old music is pretty too with nice meanings, and many of them are more to dancing. The old music had great exponents that make us remember it until now. Finally, apart from that, I prefer the sounds that the modern music have now like the mix of instruments of classical music like violins with electronic music, or how electronic music can be mixed with any other kind of it. And the last is that I like more songs with specific meanings according of what I feel in that moment and for that reason many times I like to hear English modern songs because I like what they sing about and sometimes I feel identified and that in that way I can hide what I feel when I want because normally they do not understand what I hear. ",
            "date": "Answered February 9, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charity Jane Barte",
                    "user_href": "/profile/Charity-Jane-Barte"
                }
            ]
        }
    ]
}