{
    "title": "What are some of your most favorite songs that were not hits in U.S., but were huge hits in the U.K.? - Quora",
    "tags": [
        "United States-United Kingdom Relations",
        "Pop Music",
        "Music Recommendations",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Boorer",
                "href": "/profile/Laurence-Boorer"
            },
            "answer_text": "There's the group \"Madness\". Whilst they have had some thirty five chart hits in the UK with sixteen of them being top ten placed and one No1 they have only had three appear on the Billboard chart, and only one got into the top ten. Singles that got into the upper reaches of the UK top ten without appearing in the Billboard charts include:  \"One Step Beyond\" (UK No7, Fra No1, Sw No3)  \"My Girl\" (UK 3, Ire 3)  \"Baggy Trousers\" (UK 3, Ire 5, NZ 3)  \"It Must Be Love\" (UK 4, Aus 3, Ire 5, US33) And that really is Labi Siffre at 3:20  \"House Of Fun\" (UK 1, Aus 5, Ire 1) Yes a song about trying to purchase condoms topped the British and Irish charts  \"(My Name Is) Michael Caine\" (UK 11, Ire 3)  \"Uncle Sam\" (UK 21, Ire 17) Madness are still performing with 6 of the original members. ",
            "date": "Answered February 4, 2019",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julian Smith",
                    "user_href": "/profile/Julian-Smith-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Busbin",
                "href": "/profile/Jim-Busbin"
            },
            "answer_text": "Sir, Pretty Flamingo by Manfred Mann from 66’ Manfred Mann - Pretty Flamingo The Carnival Is Over by The Seekers from 65’ The Seekers The Carnival Is Over (1967 In Colour Stereo) Wandering Star by Lee Marvin from 69’ Lee Marvin I was born under a Wandering Star remastered Man of the World by Fleetwood Mac from 69’ Fleetwood Mac - Man Of The World (live) Get Away by Georgie Fame from 66’ Georgie Fame - Get away (HQ) All or Nothing by The Small Faces from 66’ Small Faces - All or Nothing 1966 ",
            "date": "Answered February 2, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charalampos Xenophon Lampadarios",
                    "user_href": "/profile/Charalampos-Xenophon-Lampadarios"
                },
                {
                    "user_id": "Tim de Paravicini",
                    "user_href": "/profile/Tim-de-Paravicini"
                }
            ]
        }
    ]
}