{
    "title": "What are your favourite lyrics? - Quora",
    "tags": [
        "Song Lyrics",
        "Songs",
        "Music",
        "Survey Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Phillips",
                "href": "/profile/Sue-Phillips-22"
            },
            "answer_text": "The Labi Siffre song “Something Inside so Strong” has massive meaning for me. I used to be physically very fit and energetic until I contracted M.E. at age 40. Suddenly every muscle in my body went on strike. I was stranded in bed facing the wall because I did not have the strength to move position. The change was unexpected and frightening, but more terrifying still was what was happening to my brain. It seemed to have changed to a dense cloud with holes drilled through it. Memories were falling through the holes and disappearing. I woke one day and wondered where I was. The room looked like some basement or junk room with odd wooden things I didn't even realise I was in a bed looking at the furniture I'd owned for years. Somewhere outside a voice was calling : “Mum, …” I've no idea what the other words were, I didn't understand them, but assumed that the owner of the voice was looking for someone whose name was Mum. Moments later a girl poked her head round the door and asked if I needed anything. This I understood, but wondered why a stranger would say this. Totally confused I muttered something and closed my eyes. The door closed and I was alone again trying to piece together who I was, who she was and what I was doing there. Other people came from time to time, bringing food and drink, asking if I was feeling any better. Gradually I remembered that I was in my upstairs bedroom and that the kind strangers were my family. Not all memories returned and other episodes robbed me of much of my past. I began to fear that my mind was going completely and that I would become a vegetable staring heedlessly into space. Siffre’s song ran through my head and reminded me that no matter what was going wrong with my brain and body, my spirit would stand strong . A few weeks later I saw a neurologist who cheerfully informed me that some of my brain cells had died, taking the memories with them, so my punctured cloud vision was not so wide of the truth. Because M.E. is so little understood, I needed that strength of spirit time and again to battle towards some level of functionality, especially when my darling girl fell ill with the same condition and I had to struggle from my bed to fight school and doctors in a failed attempt to get her some support. She suffered far more than me and continues to experience prejudice from people who “don't believe” in a very real and destructive illness for which there is, as yet, no cure. These “unbelievers” have no idea of the harm they do, especially if they are in positions of power over a sufferer. As we both learned to live with our personal difficulties and worked out ways to help each other, and friends and family began to give their support, things improved. We've now both got a pretty good life. She grew up and moved out, facing a whole new raft of challenges and I wrote half a dozen books, some with friends and a couple on my own. At 53 I went to university in hopes of retraining my brain, still inspired by the words of that song. Sadly, despite good grades, I didn't manage to complete the course before relapsing, but I did enough to achieve the next qualification down, which isn't bad for someone with holes in her brain. Here are a few of the most meaningful lyrics that remind me that whatever happens with the M.E., I am still me: “The higher you build your barriers, the taller I become. The further you push my rights away, the faster I will run. You can deny me, you can decide to turn your face away, but there's something inside so strong. I know that I can make it, though you're doing me wrong, so wrong. You thought that my pride was gone; oh no! There's something inside so strong.” ",
            "date": "Answered April 1, 2017",
            "views": "549",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yashika Gupta",
                "href": "/profile/Yashika-Gupta-274"
            },
            "answer_text": "“I am MALALA” This one is very inspiring song..Loved it. Look, i wanna make a nation proudone day we’ll say things loud and be freewith the power of our speechwe can change our world and how it’s perceivedwe’ve got doubts and beliefsbut not one thing’s truly out of our reachdon’t tell me the sky’s the limitcause nothing can pull me down when I dreami’m working on turning ’em into a reality and opening eyesand sharing a vision with every personwho had chose to be blindi wanna focus their mindsto show that despite we’re broken insidewe can stand powerful together without a cloak or disguisei hope in the future that I can look backon a new generation that’s peacefulthat’s grateful they’re equalcause those before made a change for the peoplewith paints and an easel we picture perfectdrew our attention to making the most of our timecreating more than useless inventionsi’m only young so I guess it’s down for you to decidewould you choose to fight for what you believe inwould you do what is right if I needed youwould you stand tall with me right here by my sidebe the change you want to see, take a look through my eyes I am MalalaI am infinite hopeI am Malala, I am, I am, I amI am MalalaI am infinite hopeI am Malala, I am, I am, I amI am Malala they say the harder the culture, they say the harder the girli say the smarter the girl, then the stronger our worldfrom a country where we made fortunesof others misfortunes and betray our own peoplethen we mourn for a portion of timealways taught to fight for my rightsMalala fought for education then she fought for her lifeit’s hard to strive to be betterwhen oppressed by the suppressorstreated like the lesser, just be cleverignore the ignorance from the ignorantsociety is ridiculous but it’s the world that we living inchauffeurs our drive and denies our desirebeing silent doesn’t help, it adds fuel to the firehow can somebody young like me even find any truthwhen nobody’s looking for truth in the youthlife isn’t a choice, so who are we to say what’s voidand Malala gave a voice to me cuz… hard work and talent equals infinite growthin school a child and a teacher equals infinite hope. Thanks ",
            "date": "Answered August 5, 2016",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muskan Khushi",
                    "user_href": "/profile/Muskan-Khushi-9"
                },
                {
                    "user_id": "Ashutosh Kumar Pradhan",
                    "user_href": "/profile/Ashutosh-Kumar-Pradhan"
                },
                {
                    "user_id": "Gautam Gehlot",
                    "user_href": "/profile/Gautam-Gehlot"
                },
                {
                    "user_id": "Ashish Pawar",
                    "user_href": "/profile/आशिष-पवार-Ashish-Pawar"
                },
                {
                    "user_id": "Amitesh Sahu",
                    "user_href": "/profile/Amitesh-Sahu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vivien-O"
                }
            ]
        }
    ]
}