{
    "title": "What are the benefits of playing the violin? - Quora",
    "tags": [
        "Learning Violin",
        "Benefits",
        "Violins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abigail Ng",
                "href": "/profile/Abigail-Ng-7"
            },
            "answer_text": "The other answers are pretty good in equipping you with the general idea. But I'd like to throw in a few more: Violins are one of the most important sections in an orchestra. And I'm just talking about strictly the violin here, not the whole string family. They often play the main parts, get solos and get more recognition. Violins almost never have to worry about being left out or fuss over whether they have a part to play. It's also pretty versatile in a sense that it could be in a string quartet, an orchestra or a duet with the piano.It's one of the hardest musical instruments to play. It's not an official fact but the general public agrees with this. You don't get keys like the piano or position markers like the guitar. You get a black board and your fingers are supposed to dance across it. This could just be me and I have only very briefly attempted to play the piano, cello and harp. It certainly has its own set of challenges but it didn't take quite as long for me to pick it up.They're light and easy to carry around. Of course, many woodwind instruments such as the flute could easily beat this, hands down but the violin is still very accessible compared to the tuba, piano and cello.",
            "date": "Answered August 7, 2016",
            "views": "25",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evelyn N",
                    "user_href": "/profile/Evelyn-N-17"
                },
                {
                    "user_id": "Teodor Bahchevanov",
                    "user_href": "/profile/Teodor-Bahchevanov"
                },
                {
                    "user_id": "Abhishek Hegde",
                    "user_href": "/profile/Abhishek-Hegde-5"
                },
                {
                    "user_id": "Aman Singh",
                    "user_href": "/profile/Aman-Singh-768"
                },
                {
                    "user_id": "Nathan Klopper",
                    "user_href": "/profile/Nathan-Klopper"
                },
                {
                    "user_id": "Pallavi Bajpai",
                    "user_href": "/profile/Pallavi-Bajpai"
                },
                {
                    "user_id": "Shivani Nidikonda",
                    "user_href": "/profile/Shivani-Nidikonda"
                },
                {
                    "user_id": "What",
                    "user_href": "/profile/What-872"
                },
                {
                    "user_id": "Emiko Kokoro",
                    "user_href": "/profile/Emiko-Kokoro"
                },
                {
                    "user_id": "Shad Azmi",
                    "user_href": "/profile/Shad-Azmi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tapasya Patki",
                "href": "/profile/Tapasya-Patki"
            },
            "answer_text": "The biggest perk is the ability to go beyond the 12-tone scales and not being bound by frets, keys, note-holes and the likes. That is, not bound by selected discrete frequencies. In Indian classical music, we distinguish between shruti (which literally translates to “can be heard”) and swara (which refers to a musical note at a fixed frequency). Most of us focus on perfecting our swara, which is our ability to be as close to a particular note’s frequency as possible. Shruti, on the other hand, is that unconventional part of playing that looks at the infinite amount of music that can be possible between two known swaras or musical notes. Violin is an instrument where you can play and hear shruti, going beyond the conventional 12 notes, adding dimensions to music that are not always possible with other instruments. It is closer to human voice, which is more continuous and not always discretized. When you use slurs on an instrument such as violin or cello or veena, you capture shrutis that bring more warmth, depth and feeling to what you’re playing. More details can be found in the wikipedia article here: Shruti (music) - Wikipedia Violin is also an instrument that brings a lot of comfort, love and can capture a wide variety of emotion: it can soothe your pain after a sad event, it can accentuate a romantic dinner, it can be an aggressive storm that helps you get past your anger, it can inspire you on a day full of failures. It can make you laugh and it can make you cry. I find that difficult to achieve with other musical instruments I’ve played. ",
            "date": "Answered November 16, 2017",
            "views": "843",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evelyn N",
                    "user_href": "/profile/Evelyn-N-17"
                },
                {
                    "user_id": "Abhishek Hegde",
                    "user_href": "/profile/Abhishek-Hegde-5"
                },
                {
                    "user_id": "Pallavi Bajpai",
                    "user_href": "/profile/Pallavi-Bajpai"
                },
                {
                    "user_id": "Wayne Dallas",
                    "user_href": "/profile/Wayne-Dallas"
                },
                {
                    "user_id": "Bruce Williamson",
                    "user_href": "/profile/Bruce-Williamson-18"
                },
                {
                    "user_id": "Aamer",
                    "user_href": "/profile/Aamer-4"
                },
                {
                    "user_id": "Anagh Deshpande",
                    "user_href": "/profile/Anagh-Deshpande-3"
                }
            ]
        }
    ]
}