{
    "title": "What are the best sad songs? - Quora",
    "tags": [
        "Sad Songs",
        "Music Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "McKaylah Oakenshield",
                "href": "/profile/McKaylah-Oakenshield"
            },
            "answer_text": "I have a lot of favorites. XD ~ How Could You Leave Us by NF. In How Could You Leave us, Nathan expresses his anger and grief through this song as if he were engaged in a conversation with his deceased mother, who overdosed when Nathan was a child. ~ Paralyzed by NF. This one is Nathan saying that he has lost feelings and isn’t who he used to be. Both typically make me tear up. ~ Friend, Please by Twenty One Pilots. The singer, Tyler, talks to an unknown person, asking them not to commit suicide. As someone that has had some… unhealthy thoughts, it always felt as if he was speaking to me and has gotten me through some hard times. (a beautiful animatic can be found on Youtube with this song as the story!!) ~ Demons by Imagine Dragons. This video hurts so much, yet it cannot be overlooked. We meet so many people and don’t know what they go through. We don’t know how close they are to death or what kind of demons they have residing in their head. ~ Pieces by Red. Out of all the songs on this list, this is probably the most calming. It is about six minutes long and the first minute and a half is purely instrumental. That’s all I can think of at the moment. :) Edit: I’m back after like two years!! jinkies… ~ please never fall in love again by Ollie MN. This acoustic plea to someone who broke his heart is just,,, soothing?? To me at least. Also there’s a line where he says that he wants his Shrek DVDs back. So yeah. ~ Ending by Isak Danielson. This dude’s voice. He’s able to convey such a desperate, somber tone. His dulcet voice is complemented well by piano accompaniment. ~ everything i wanted by Billie Eilish. Okay, no matter what you think of her fanbase (another opinion for another day), this girl makes some banger songs. With a percussion line that reminds me of a pulse, she sings about having a dream where she killed herself and nobody cared. After waking, her brother tells her the words of the chorus, “As long as I’m here, no one can hurt you.” This theme hits a little close to home, reminding me of the conversations I’ve had with my best friend about said unhealthy thought patterns. In my absence, I’ve expanded my tastes to include music outside of my first language. It’s entirely valid if you do not listen to foreign music because of the language barrier. However, there are multiple means of translation, one of which is the captioning found on most MVs or translated lyric videos. And music should not be constrained to that of what you understand immediately, for there are so many talented creators that are not English natives. While there are a lot of songs in Korean, there are also several ones that are hybrids of both English and Korean. So, for the lyrics is state in Korean, I will put the Hangul iteration and then the agreed translation into English beside. :) I’m definitely not a connoisseur of all foreign music by any stretch, and I don’t even know a lot of KPop. I just ask that you genuinely give them a try before writing them off. Thanks. ~ The Truth Untold by BTS feat. Steve Aoki. The story behind The Truth Untold is based upon La Citta di Smeraldo. I’m not gonna write the myth down here cause I’m already crying. If you look in the comments of one of the lyric vids for it, someone most likely posted the whole thing. Long story short, it’s really, really sad and the pure emotion of the four vocalists only adds to the meaning of the ballad. ~ Outro: Tear by BTS. I swear, if anyone ever tells me rap can’t get emotional, imma hit them with this suffocating banger. Outro: Tear just has a finality to it. The last minute or so is jarringly constrasting. For about fifteen seconds, Lead Rapper, Suga, takes almost a vocal role of the bridge, calming down the tone of the song. Only for it to be shifted into high gear once J-Hope jumps into his verse, ending the song on an adrenaline high. What a way to finish an album. ~ Spring Day by BTS. This is a ballad reminiscing the victims of the Sewol Ferry Disaster of 1970, which kill 326 of its 338 passengers. The main phrase of the song is ‘보고 싶다’, which translates into ‘I miss you’. ~ Levanter by Stray Kids. Levanter’s theme is a goodbye to who they once were and accepting themselves for who they are, saying in the chorus, “I wanna be myself. I don’t care.” (This one sort of connects to me on a deeper level because it was released a little over a month after the eldest member, Woojin, left the group for personal reasons and was the first MV with him not present. In a way, the lyrics of the bridge can be related to them saying a goodbye to him as well, lamenting that “It’s all good now.”) sorry it’s so long, but I hope you find something that you connect with. who knows maybe in another two years, i’ll still be alive and come back here. ",
            "date": "Updated April 23, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aydan Mustafazada",
                    "user_href": "/profile/Aydan-Mustafazada"
                },
                {
                    "user_id": "Amiata Alf",
                    "user_href": "/profile/Amiata-Alf"
                },
                {
                    "user_id": "Shubham Kumar",
                    "user_href": "/profile/Shubham-Kumar-2017"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Moore",
                "href": "/profile/Chris-Moore-384"
            },
            "answer_text": "For me, it is this one: The Last Resort Eagles She came from Providence, the one in Rhode Island Where the old world shadows hang heavy in the air She packed her hopes and dreams like a refugee, Just as her father came across the sea She heard about a place people were smilin', They spoke about the red man's way, how they loved the land And they came from everywhere to the Great Divide Seeking a place to stand or a place to hide Down in the crowded bars out for a good time, Can't wait to tell you all what it's like up there And they called it paradise, I don't know why Somebody laid the mountains low while the town got high Then the chilly winds blew down across the desert, Through the canyons of the coast to the Malibu Where the pretty people play hungry for power To light their neon way and give them things to do Some rich man came and raped the land, nobody caught 'em, Put up a bunch of ugly boxes and, Jesus, people bought 'em And they called it paradise, the place to be, They watched the hazy sun sinking in the sea You can leave it all behind and sail to Lahaina Just like the missionaries did so many years ago They even brought a neon sign 'Jesus is Coming', Brought the white man's burden down, brought the white man's reign Who will provide the grand design, what is yours and what is mine? 'Cause there is no more new frontier, we have got to make it here We satisfy our endless needs and justify our bloody deeds In the name of destiny and in the name of God And you can see them there on Sunday morning Stand up and sing about what it's like up there They called it paradise, I don't know why You call some place paradise, kiss it goodbye Songwriters: Glenn Frey / Don Henley The Last Resort lyrics © Cass County Music / Wisteria Music / Privet Music, Warner/Chappell Music, Inc, Universal Music Publishing Group, Red Cloud Music ",
            "date": "Answered January 28, 2019",
            "views": "995",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorie Norman",
                    "user_href": "/profile/Lorie-Norman-3"
                },
                {
                    "user_id": "Christopher Ford",
                    "user_href": "/profile/Christopher-Ford-62"
                },
                {
                    "user_id": "Eric Heiss",
                    "user_href": "/profile/Eric-Heiss"
                }
            ]
        }
    ]
}