{
    "title": "What makes a woman attractive? - Quora",
    "tags": [
        "Understanding Attraction",
        "Women",
        "Attractive Women",
        "Attraction (interpersonal)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sangam Van ‘T Sant",
                "href": "/profile/Sangam-Van-T-Sant"
            },
            "answer_text": "I’ve wanted to write this essay for quite some time. Here we go. As you may know from reading my content, I believe looks really matter, and are the most important factor in attracting people for both genders. If your looks aren’t attracting somebody, the chance you can ever compensate with other factors is minimal. But what exactly makes women attractive? Can we even define attractiveness, or is beauty really in the eye of the beholder?  Certain physical traits are generally found attractive. These traits indicate health, strength and fertility. For instance, men are attracted to large breasts, because it shows fertility. You as a woman are probably attracted to a strong jawline, because it indicates low body fat, which in turn correlates with high testosterone levels and thus fertility. A receding hairline is a turnoff to most women, as it shows a man’s ageing and thus his fertility is declining. Etc. Etc. Etc. For this reason, we can make some general concensus of attractiveness levels. However, if we’re going to rate people, you’ll see that still opinions may vary. And they vary more the more attractive someone is found in general. Someone you’ll find a 7 will more easily be found a 9.5 by someone else than someone you find a 3.5 will be found a 6 by someone else. The more attractive someone’s found on average, the more diverging ratings become and the bigger the role of your personal taste. But why is this subjectiveness? Well, it’s basically because a lot of traits that are important to your looks, are subjective. Think of race or hair color. Besides that, different people prioritize different traits. Are you a girl with a preference for strong, muscled, tall guys, or do you care more about the face and prefer a prettyboy? Can a jawline compensate for ugly eyes to you? Is a bigger nose an immediate turnoff for you? It’s a matter of personal taste. So there’s people more attractive than others, but the more attractive people get the harder it is to say who’s more attractive. Attractive people often aren’t more or less attractive than eachther, just different. There’s different types of being attractive. So what makes women attractive? Various things.  The attractive types of women I made a classification of the main types of women that men are attracted to. This classification is not in any way an absolute divide of attractive women in three branches, and probably incomplete, but it is made to give you an understanding of the three main vibes girls can give that attract guys.  The prettygirl The prettygirl type is the female equivalent of the prettyboy. Prettygirls don’t need to rely on their curves to be found attractive, its mostly in the face. Prettygirls display a lot of youthfulness and cuteness. This gives them a sort of “underdog”-vibe compared to women who would be more mature or more sexy. Too much curves can actually ruin a prettygirl-vibe, as they make a girl appear more rounded and thus larger. An ideal prettygirl is at a healthy weight and is not curvy, which makes her appear thin. Guys love curves, but not on prettygirls. It may seem weird, but this is actually very appealing to guys, especially when they’re younger (until early 20s). Also, the cuteness of prettygirls gives off some warmth, indicating a future high physical mom potential, something guys crave at a later age. Warning: don’t take me talking about being thin as a motivation to develop anorexia, which is unhealthy and dangerous and will make you unattractive and skinny, which is different from being thin. If you have too much curves to be a prettygirl, you should keep reading because you’re made to be one of the other types. Anyways, here’s an example of what I consider to be a prettygirl:  Her face is attractive, but young. She’s of normal weight. There are no curves visible in this picture. She looks even thinner due to the long sleeves. Yes, being a prettygirl is for a large part about how you dress. Don’t dress too sexy for instance, it’ll make you look too mature and give too much overlap with the other types.  The beautiful woman A beautiful woman, like a prettygirl, has a very appealing face. The difference with a prettygirl, is that a beautiful woman looks more mature and less thin. Beautiful women aren’t fat, and can be both average, above average or below averagely curve, but they appear larger and broader than prettygirls due to their mature looks. Beautiful women’s attractiveness is in a combination of warmth and strength, in softness and power, visible in their looks. This indicates to a man she’s capable of motherhood (physical mom potential), something men are genetically inclined to not only sleep with, but actually get emotionally attached to. Beautiful women also tend to look a bit mysterious, and seem to have a lot of depth. Men of all ages are attracted to beautiful women, but men approach these women more often as they mature themselves. An example of a beautiful woman:   Hot woman A hot woman is basically the opposite of the prettygirl; she relies mostly on her body. Her face of course, is in general pretty as well. The hot woman has a large sex appeal. Everyone knows about guys being attracted to nice bodies, to nice curves, to women wearing clothes that show. But you don’t even need the biggest curves or the least clothes to be hot, to have this sex appeal. It’s actually also a vibe. Just understand that being hot is okay, but it might get you relatively more hookups and less guys that are really interested in you than the other two types, and you’ll attract more thirsty creeps. That being said, be who you want to be and it’s not less attractive, just different. An examole of a hot woman:   Well, that’s what I had to say for today. I hope you’ll understand the three main types I defined and how they each have their different vibes. Part of a woman’s vibe is genetic potential, but of course a woman can change a lot about her appearance with make-up and clothing to give off the vibe she wants to give. ",
            "date": "Updated August 18, 2019",
            "views": "728",
            "upvotes": " View 114 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Willis",
                    "user_href": "/profile/James-Willis-355"
                },
                {
                    "user_id": "Adryan Rock",
                    "user_href": "/profile/Adryan-Rock"
                },
                {
                    "user_id": "Queen Sanay",
                    "user_href": "/profile/Queen-Sanay"
                },
                {
                    "user_id": "Isidora Lopez",
                    "user_href": "/profile/Isidora-Lopez-2"
                },
                {
                    "user_id": "Shivanjali Sharma",
                    "user_href": "/profile/Shivanjali-Sharma-22"
                },
                {
                    "user_id": "Ethan Haleem",
                    "user_href": "/profile/Ethan-Haleem"
                },
                {
                    "user_id": "Thunya Haase",
                    "user_href": "/profile/Thunya-Haase"
                },
                {
                    "user_id": "Rosa Davidson",
                    "user_href": "/profile/Rosa-Davidson-5"
                },
                {
                    "user_id": "Carl Lau",
                    "user_href": "/profile/Carl-Lau-2"
                },
                {
                    "user_id": "Rolake Omi",
                    "user_href": "/profile/Rolake-Omi"
                },
                {
                    "user_id": "My Nguyen",
                    "user_href": "/profile/My-Nguyen-504"
                },
                {
                    "user_id": "Tahmina Hussain",
                    "user_href": "/profile/Tahmina-Hussain-1"
                },
                {
                    "user_id": "Reama Tora",
                    "user_href": "/profile/Reama-Tora"
                },
                {
                    "user_id": "Laura Leong",
                    "user_href": "/profile/Laura-Leong-2"
                },
                {
                    "user_id": "Estela Rey",
                    "user_href": "/profile/Estela-Rey"
                },
                {
                    "user_id": "Diana Lewis",
                    "user_href": "/profile/Diana-Lewis-130"
                },
                {
                    "user_id": "Helen Chan",
                    "user_href": "/profile/Helen-Chan-19"
                },
                {
                    "user_id": "Kelly Wang",
                    "user_href": "/profile/Kelly-Wang-281"
                },
                {
                    "user_id": "Jan Láža",
                    "user_href": "/profile/Jan-Láža-1"
                },
                {
                    "user_id": "Jane Danielle",
                    "user_href": "/profile/Jane-Danielle-4"
                },
                {
                    "user_id": "Jeanette Robertson",
                    "user_href": "/profile/Jeanette-Robertson-16"
                },
                {
                    "user_id": "Eline Laurenc",
                    "user_href": "/profile/Eline-Laurenc"
                },
                {
                    "user_id": "Hema Vathi",
                    "user_href": "/profile/Hema-Vathi-57"
                },
                {
                    "user_id": "Shubham Valecha",
                    "user_href": "/profile/Shubham-Valecha"
                },
                {
                    "user_id": "Alex Choi",
                    "user_href": "/profile/Alex-Choi-135"
                },
                {
                    "user_id": "Federica Aiello",
                    "user_href": "/profile/Federica-Aiello-1"
                },
                {
                    "user_id": "Fran Duckman",
                    "user_href": "/profile/Fran-Duckman"
                },
                {
                    "user_id": "Kaz Gov",
                    "user_href": "/profile/Kaz-Gov"
                },
                {
                    "user_id": "Ruth Ayodeji",
                    "user_href": "/profile/Ruth-Ayodeji"
                },
                {
                    "user_id": "Fronie Cezara",
                    "user_href": "/profile/Fronie-Cezara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damian Lopez",
                "href": "/profile/Damian-Lopez-25"
            },
            "answer_text": "Very feminine. With very little masculine attributes. Every human being tends to have both male and female attributes. Heck Even I have female and male attributes. That is normal in a human being. In my perfect fantasy woman..she will have almost zero male attributes..lol..lol. She will just ooze femininity. And be glamorous and delicate. Yet a bit strong. Not weak. I love Curves. Big breasts,big butt. Nice clear skin. Grey(gray)or brown or Dark eyes. Healthy Eyes. Preferably no glasses. I wear glasses so In a way it is to balance out my DNA so any kids will be born most likely with 20/20 vision… .lol. No disgusting tattoos of any kind. A symetrical face. I'm very much attracted to a curvy kinda chubby woman. I can't stand skinniness in a woman. I don't say they are ugly as (beauty is in the eyes of the beholder). In my eyes a curvy volumptuous woman is a real beauty to behold. Good symetrical breasts are a huge turn on as well as feminine WIDE hips and plump legs. Without a space between her thighs when she puts her legs together. I also love light skin or pale but clear skin. I can also love a woman with black or brown skin…it MUST BE SPOTLESS. NO DISGUSTING TATOOS. No tan lines or suntans. Preferably no freckles. No sun damaged skin. Spotless white skin. Like I mentioned..black or brown skin is also fine as long as it's flawless. Straight healthy shiny hair preferably. A happy friendly and gentle disposition is a must!!! What does physical beauty have without a kind sweet character to go with it?. Because the content of a person's character is paramount. What does it matter that she is physically beautiful with a rotten heart??? In that case I prefer a skinny woman. And I will repeat NO DISGUSTING FREAKIN' TATOOS OF ANY KIND. NOT EVEN A MINISCULE TINY ONE. Now as you are aware I'm being totally superficial and extremely shallow in my answer. In reality. I would love a woman who is kind gentle feminine and sweet. Peace. ",
            "date": "Answered October 27, 2019",
            "views": "54",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mickey Rose",
                    "user_href": "/profile/Mickey-Rose-10"
                },
                {
                    "user_id": "Sunny Alwan",
                    "user_href": "/profile/Sunny-Alwan"
                },
                {
                    "user_id": "Zaara Zaman",
                    "user_href": "/profile/Zaara-Zaman-2"
                },
                {
                    "user_id": "Ioanna Kal",
                    "user_href": "/profile/Ioanna-Kal-2"
                },
                {
                    "user_id": "A Hashbrown",
                    "user_href": "/profile/A-Hashbrown"
                },
                {
                    "user_id": "Jade Lee",
                    "user_href": "/profile/Jade-Lee-313"
                },
                {
                    "user_id": "Tumi Thomas",
                    "user_href": "/profile/Tumi-Thomas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlet Langford",
                "href": "/profile/Carlet-Langford"
            },
            "answer_text": "I'd say: Be an interesting person. Have a hobby or a talent that you develop and pursue. Tap into your passions, and persue them. People like to be around people who are interesting to talk to. Having a talent or skill is a very attractive thing, it signals you are a cut above the ordinary, and that is attractive. Be well read/informed. Be able to intelligently discuss a wide variety of things: sports, music, current events, politics, etc. You don't have to have an encyclopedic knowledge, but know enough to maintain an interesting conversation. For example, I don't really care about sports, but I kind of know something about whatever major sports event is going on. You can be drop dead gorgeous, but if you are as dumb as a post, you won't keep anyone's attention for very long, at least those people with whom you want to have a relationship with. This means reading the paper, magazines, watching the news, etc. Develop a sense of humor. People like to laugh. 'Nuff said. If you can make someone laugh, you've pretty much there. Don't take yourself terribly seriously, be a person that someone can playfully poke fun at. Pay attention to your looks. Now this can be fraught with a lot of potholes, but I really mean: Do you look your best? Could you look better? Ask yourself these questions when you look in the mirror:   Is your hair styled and kept up? Find a hair stylist that can help you with a cut/color that is flattering and that you like and feel good about. The stylist can make sure to give you a cut that will work with your hair type so that you don't spend hours fixing it up.Are you dressing stylishly in a way that suits your shape and age, or do your clothes say, \"I've given up/don't care/I'm desperate to look younger/sexy/etc?\" Hit the mall and get a personal stylist to help you. Look at fashion magazines for some ideas. Go shopping with some stylish friends, and let them help you find those clothes that will make you gorgeous. Observe women on the street who are wearing clothes you like, and make a note to find something like it when you go shopping.Are you carrying more weight than you should? Hit the gym and watch your diet. Cut out the processed food and fast food, and put in more veggies, fruits, and lean meats/seafood as well as dairy products in your diet. Not only will you look better, you will feel better and be healthier.How about your skin? Is it well taken care of? Moisterize it, and adjust your diet. Makeup can do only so much if your skin is bad. See a dermatologist for acne, rashes, etc if you have severe skin problems.Makeup? Learn to apply it so that your features are brought out and you don't look like a clown. You want to look like YOU, only better.How are your teeth? Do you have missing/yellow/crooked teeth? Look into dental work. Not only is this a cosmetic thing, it can be a health thing too. A healthy mouth is an attractive thing. You'd be amazed at what a little fixing up can do. Have you ever seen photos of celebrites when they aren't dolled up and when they are? It's amazing how unremarkable many of them are in the looks department without makeup and nice clothes,  but when they get the hair, clothes and makeup going, they are stunning. ",
            "date": "Answered February 7, 2014",
            "views": "117",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allegra Summers",
                    "user_href": "/profile/Allegra-Summers"
                },
                {
                    "user_id": "Elgen Torregosa",
                    "user_href": "/profile/Elgen-Torregosa"
                },
                {
                    "user_id": "Carl Lau",
                    "user_href": "/profile/Carl-Lau-2"
                },
                {
                    "user_id": "Estefani Liu",
                    "user_href": "/profile/Estefani-Liu"
                },
                {
                    "user_id": "Saad Ba",
                    "user_href": "/profile/Saad-Ba-1"
                },
                {
                    "user_id": "Amani M",
                    "user_href": "/profile/Amani-M-3"
                },
                {
                    "user_id": "Parasuraman Krishnan",
                    "user_href": "/profile/Parasuraman-Krishnan-2"
                },
                {
                    "user_id": "Diana Linares",
                    "user_href": "/profile/Diana-Linares-1"
                },
                {
                    "user_id": "Pancake no Banana",
                    "user_href": "/profile/Pancake-no-Banana"
                },
                {
                    "user_id": "Amaura France",
                    "user_href": "/profile/Amaura-France"
                },
                {
                    "user_id": "Liena Hoper",
                    "user_href": "/profile/Liena-Hoper"
                },
                {
                    "user_id": "Amy Miller",
                    "user_href": "/profile/Amy-Miller-918"
                },
                {
                    "user_id": "Navya Poonia",
                    "user_href": "/profile/Navya-Poonia"
                },
                {
                    "user_id": "Debra K Word",
                    "user_href": "/profile/Debra-K-Word"
                },
                {
                    "user_id": "Hannah Tranaf",
                    "user_href": "/profile/Hannah-Tranaf"
                },
                {
                    "user_id": "Maggie Li",
                    "user_href": "/profile/Maggie-Li-133"
                },
                {
                    "user_id": "Xia CHEN",
                    "user_href": "/profile/Xia-CHEN-42"
                },
                {
                    "user_id": "Averma",
                    "user_href": "/profile/Averma-5"
                },
                {
                    "user_id": "Nadiyah Ford",
                    "user_href": "/profile/Nadiyah-Ford"
                },
                {
                    "user_id": "Bree Blydon",
                    "user_href": "/profile/Bree-Blydon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Kataria",
                "href": "/profile/Vishal-Kataria"
            },
            "answer_text": "I find many aspects about a woman attractive — her eyes, her hair, her class. But a woman who can drive me crazy is one who believes in herself. A woman who believes in herself personifies self-assurance. She knows what she wants and relies on herself to get it. She doesn’t play a ‘damsel in distress’ to make another person do something for her. A self-assured woman knows how to hold her own in public. She can take care of herself instead of depending on someone (man or woman) to make her feel comfortable. A self-assured woman has a dazzling smile. She knows when to speak and when she’d rather keep quiet. She shares her deepest feelings and thoughts with select people whom she trusts deeply. This trait keeps people guessing about what she’s thinking, and lets her hold the power. A self-assured woman wants personal time to do what she wants. That’s why she appreciates her partner wanting time off to do what he wants, rather than pestering him with the cliché, “You NEVER have time for me.” She has friends regardless of gender, because people who find confidence attractive get drawn to her. She knows people bitch behind her back, and why — because they can never be her. She understands what friendship means, and isn’t jealous of her partner’s friends. A self-assured woman gets into a relationship when she believes the person will complement her, not because she craves for romance. She knows she’s enough by herself. She enjoys romance and being pampered, but doesn’t demand it or get upset if it’s amiss. She has better things to do and keep herself happy. A self-assured woman rarely gets angry, but when she does, the world stops spinning. I know such a woman. She was a senior executive at a company I worked in. Her self-confidence drove me insane. After 6 years, I can still smell her perfume. She knew the effect she had on me. Yet, she never showed it. My only regret? Never having asked her out for a coffee. ",
            "date": "Answered December 7, 2017",
            "views": "247",
            "upvotes": " View 99 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Younan",
                    "user_href": "/profile/Sarah-Younan-2"
                },
                {
                    "user_id": "Arthur McKenzie",
                    "user_href": "/profile/Arthur-McKenzie-1"
                },
                {
                    "user_id": "Queen Sanay",
                    "user_href": "/profile/Queen-Sanay"
                },
                {
                    "user_id": "Irene Postolero",
                    "user_href": "/profile/Irene-Postolero"
                },
                {
                    "user_id": "Tom Phalen",
                    "user_href": "/profile/Tom-Phalen-2"
                },
                {
                    "user_id": "Khom Tanapond",
                    "user_href": "/profile/Khom-Tanapond"
                },
                {
                    "user_id": "Ioanna Kal",
                    "user_href": "/profile/Ioanna-Kal-2"
                },
                {
                    "user_id": "Reama Tora",
                    "user_href": "/profile/Reama-Tora"
                },
                {
                    "user_id": "Helen Chan",
                    "user_href": "/profile/Helen-Chan-19"
                },
                {
                    "user_id": "EBbonee Terry",
                    "user_href": "/profile/EBbonee-Terry"
                },
                {
                    "user_id": "Elizabeth Filipovski",
                    "user_href": "/profile/Elizabeth-Filipovski-1"
                },
                {
                    "user_id": "Jeanette Robertson",
                    "user_href": "/profile/Jeanette-Robertson-16"
                },
                {
                    "user_id": "Tsujimoto Riko",
                    "user_href": "/profile/Tsujimoto-Riko"
                },
                {
                    "user_id": "LIU Estelle",
                    "user_href": "/profile/LIU-Estelle-1"
                },
                {
                    "user_id": "David Hooper",
                    "user_href": "/profile/David-Hooper-88"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maria-4304"
                },
                {
                    "user_id": "Tiffanius Smily",
                    "user_href": "/profile/Tiffanius-Smily"
                },
                {
                    "user_id": "Suby Bakare",
                    "user_href": "/profile/Suby-Bakare"
                },
                {
                    "user_id": "Joyce Adena",
                    "user_href": "/profile/Joyce-Adena"
                },
                {
                    "user_id": "Jessica Cing",
                    "user_href": "/profile/Jessica-Cing-1"
                },
                {
                    "user_id": "Eliza Paras",
                    "user_href": "/profile/Eliza-Paras-1"
                },
                {
                    "user_id": "Isma Syakila",
                    "user_href": "/profile/Isma-Syakila"
                },
                {
                    "user_id": "Giuliana Fessia",
                    "user_href": "/profile/Giuliana-Fessia"
                },
                {
                    "user_id": "Angel Cooper",
                    "user_href": "/profile/Angel-Cooper-67"
                },
                {
                    "user_id": "Caitlin Drachen",
                    "user_href": "/profile/Caitlin-Drachen"
                },
                {
                    "user_id": "Ryan Joshi",
                    "user_href": "/profile/Ryan-Joshi-5"
                },
                {
                    "user_id": "Kelsi Rippberger",
                    "user_href": "/profile/Kelsi-Rippberger-1"
                },
                {
                    "user_id": "Angela Rodriguez",
                    "user_href": "/profile/Angela-Rodriguez-81"
                },
                {
                    "user_id": "Himani",
                    "user_href": "/profile/Himani-228"
                },
                {
                    "user_id": "Averma",
                    "user_href": "/profile/Averma-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Svendsen",
                "href": "/profile/Mark-Svendsen-1"
            },
            "answer_text": "Men are visual creatures, it's not complicated, a nice figure, nice clothes, nice face, nice voice all help to attract men. A problem to meeting men is women copy other womens behavior. The number one place to find a women is at home, they don't go out in public and therefore cannot be seen. When women do go out it is directly to there car, directly to their job or school then directly back to there car and directly back home. Women usually avoid coffee shops and any public place because they don't want to be approached by rude loud mouthed guys. But guys women want to meet are in public places. Women who get coffee, order the coffee, pickup the coffee in three minutes and there gone, no lingering. Meeting women in public is like trying to catch a bird in flight. Get yourself in shape and sit down in a coffee shop and you will meet guys! If you put up barriers like sun glasses, earphones, cell phone, never look at him you may not be approached. DO NOT put your bag or feet on the empty seat next to you, it prevents anyone sitting next to you. We have to stand and talk to you while your sitting, awkward. I remember a girl who was determined to get married in a small town. She would sit down in a coffee shop by herself and read or do something. No sunglasses, no earplugs, no cell phone, no bag on chair, dressed all in leather (not my taste) within months she had a diamond ring on her finger. Her mind was set on meeting someone and you knew it by how she acted. Another way is to stand on the street corner for 15 minutes and see who walks buy. I met several asian girls in San Diego this way. They were foreign students, texting and standing or walking slowly. I could walk up to them and start talking. The American girls never stand still or walk slow so you can walk up to them. By the time you see them, if you hesitate, you have to run to catch up and then walk fast as your talking, not easy or fun. Other things that prevent men meeting you . . . your lazy with appearance (would you marry you?) Over weight, even a little. too much makeup too many tatoos too many bfs your not new foul words you smoke weird clothes a proven way to meet someone is use LOA http://www.thesecret.tv/story-topics/relationships/ ",
            "date": "Updated July 10, 2019",
            "views": "103",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "THIS IS NOT YOUR GALAXY",
                    "user_href": "/profile/THIS-IS-NOT-YOUR-GALAXY"
                },
                {
                    "user_id": "Fronie Cezara",
                    "user_href": "/profile/Fronie-Cezara"
                },
                {
                    "user_id": "Sasha Rory",
                    "user_href": "/profile/Sasha-Rory"
                },
                {
                    "user_id": "Kanika N",
                    "user_href": "/profile/Kanika-N-5"
                },
                {
                    "user_id": "Izabela Iskra",
                    "user_href": "/profile/Izabela-Iskra-1"
                },
                {
                    "user_id": "Morgan Hadley",
                    "user_href": "/profile/Morgan-Hadley-2"
                },
                {
                    "user_id": "Lauren Purser",
                    "user_href": "/profile/Lauren-Purser"
                },
                {
                    "user_id": "Do you Even Lift Bruh?",
                    "user_href": "/profile/Do-you-Even-Lift-Bruh"
                },
                {
                    "user_id": "Coco Ree",
                    "user_href": "/profile/Coco-Ree"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SHIBNARAYAN-DAS"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukas Schwekendiek",
                "href": "/profile/Lukas-Schwekendiek"
            },
            "answer_text": "When I first started out dating I thought it was mostly about the looks.  Not about the body, per sé, although it was a nice bonus, but rather about the way she smiled, the cute faces she could make and how attracted I would feel just meeting her gaze. However, as I grew older and as I dated more, I realized that those things did not matter nearly as much. Of course everybody says that, but the physical attraction to someone is something that you get used to and disappears, their character, however, stays forever! Now, what makes a woman attractive to me is her character behind the scenes. It’s nice if she is nice, kind, smart, and ambitious with people around, but if she doesn’t act that way alone then it’s just a facade. To me the most attractive woman is one that has a strong sense of self. One that knows what she wants and works towards that especially when no one is watching. I find women attractive that are independent and driven towards a goal; those that keep growing. If that kind of a woman is attracted to me I know that she isn’t doing that because she needs me or because I provide something for her, but rather because she desires me from a reason deeper within. Women that are too codependent, that take you for granted or that do not respect you are very quickly more trouble than they are worth. They make you feel pressured as the expectation is that you are supposed to make them happy all the time. A relationship should never be codependent, but rather interdependent! When a woman is confident in herself, excitable and positive in her approach towards the future, she is instantly more attractive as she shines a light that inspires everyone around her. But as strong as that woman is, an attractive woman is also one that is weak… or rather, one that is not afraid of being weak. It’s not about always being strong, confident, positive and persistent, but rather about being honest with herself.  That all being said, there are women that are physically attractive and I know that what I find physically attractive is not what every man/woman finds attractive. Every person has a different type that they are attracted towards, and some are just aesthetically very beautiful. But that attraction means nothing if her character does not match yours. The problem is that relationships match ~ 1/1,000,000 times right away; every other relationship is a collaboration that takes time and effort to make amazing. There needs to be a certain spark, but beyond that spark it is all about igniting it yourself and not waiting for random chance to do it for you. And attractive women are those that put in a constant effort to make that happen. Women that are strong, emotional, honest with themselves, and women that live their life actively, rather than hoping it goes their way. ",
            "date": "Updated November 16, 2019",
            "views": "168",
            "upvotes": " View 46 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allegra Summers",
                    "user_href": "/profile/Allegra-Summers"
                },
                {
                    "user_id": "Sarah Younan",
                    "user_href": "/profile/Sarah-Younan-2"
                },
                {
                    "user_id": "Nguyễn Nga",
                    "user_href": "/profile/Nguyễn-Nga-3"
                },
                {
                    "user_id": "Randb Chapmam",
                    "user_href": "/profile/Randb-Chapmam"
                },
                {
                    "user_id": "Rrezarta Krasniqi",
                    "user_href": "/profile/Rrezarta-Krasniqi-3"
                },
                {
                    "user_id": "Ioanna Kal",
                    "user_href": "/profile/Ioanna-Kal-2"
                },
                {
                    "user_id": "Shanza Syeda",
                    "user_href": "/profile/Shanza-Syeda"
                },
                {
                    "user_id": "Emmelieke Nuijten",
                    "user_href": "/profile/Emmelieke-Nuijten"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maria-4304"
                },
                {
                    "user_id": "Trang Nguyễn",
                    "user_href": "/profile/Trang-Nguyễn-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harun Lari",
                "href": "/profile/Harun-Lari"
            },
            "answer_text": "A2A Looking at some of the answers already posted, I see references to scientific research and culture, among other things, when it comes to defining an attractive woman. So I can't really add much there.  However, what I can add is what I would find attractive about a woman, and as far as that goes, looks do matter, but I'm also a cynical enough person to not immediately lose my mind over every hot woman I see. Usually, at least. I'll notice, and probably stare a little if I can get away with it, but that's about it. I know they don't care about me, and that I barely exist in their worlds if at all, and so I figure that I might as well ultimately return the favor. Which brings me to what I think makes a woman attractive. In regards to what I consider hot or attractive in a woman, I don't think that my tastes are 100% conventional (whatever that means), and not just because I'm black. I think that I might even be a bit of a perv at times when considering some of the women that I've found attractive over the years. At any rate, as long as a woman is clean-looking, then that's a plus. What do I personally mean by clean-looking? I mean that she's healthy (at most slightly overweight but not obese), has a wholesome or relatively wholesome demeanor (unselfish, rarely uses bad language, good hygiene, mild-mannered, sweet voice, chaste [or close enough to chaste without being a complete prude]), and is feminine (obviously, but she also doesn't have to be super-girly). Even with all of those qualifiers, she'd still probably register as a 5 or a 6 on the conventional attractiveness scale, by my estimation (and maybe a 7 or even a low 8 if she dolled herself up right). But I'm a butt guy, so as long as she has one of those (full and at least somewhat firm, and attached to a round, ample set of hips and thighs), then I'd be okay with a (sorta) Plain Jane. But above all else, the one thing that won't sag or gather wrinkles is the one thing that I would want out of a suitable woman first and foremost: for her to want me. Cheap Trick said it best. I want her to smile at me because she genuinely likes me and is happy to see me, and not because she's trying to be nice or because her job requires it of her or something. I want her to want to do for me and to do right by me even as I would want to do the same for her. I want to know that I can tell her things that I wouldn't even tell my relatives, and that I'm her hero. I want to be able to hold her in the dead of night and to show her tenderness, and other mushy shit like that. I want to feel secure in doing this, and not feel as if my being a sweetheart is unwelcome to her, or that she's undeserving of sweetheart treatment in the first place, or that she's smiling at my sweet words while secretly fantasizing about being some ex-felon biker's wanton as he chokes her, slaps her, hits it from the back while she's wearing a dog collar, and then kicks her out of bed post-coitus to get him a beer and a steak so that he doesn't miss the start of the game. Keep in mind that I'm not really an emotional person, and in fact I get kind of annoyed with sappy, mushy behavior myself, even something as simple as saying \"I love you\" (I'm virtually incapable of saying that). So wanting a woman who can inspire in me a desire to be sweet and tender towards her is probably an innate desire that most men share, hell, even most players. It doesn't matter if a woman is a 10 in looks, because if she's a harridan harpy with a tongue like a flaying knife or a stuck-up princess who would hardly care if you were gone, then a wise man's penis would curl at the sight or thought of her. So, yeah, there is no universal thing that makes a woman truly attractive. It's ultimately personalizable to each man, and it's got everything to do with the way she makes him feel (Hee-hee). ",
            "date": "Answered April 14, 2016",
            "views": "112",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bria Duru",
                    "user_href": "/profile/Bria-Duru"
                },
                {
                    "user_id": "Lydia Burns Windatt",
                    "user_href": "/profile/Lydia-Burns-Windatt"
                },
                {
                    "user_id": "Selorm Yawa Gavor",
                    "user_href": "/profile/Selorm-Yawa-Gavor"
                },
                {
                    "user_id": "Catherine Doran",
                    "user_href": "/profile/Catherine-Doran-3"
                },
                {
                    "user_id": "Sharon Stadtmiller",
                    "user_href": "/profile/Sharon-Stadtmiller"
                },
                {
                    "user_id": "A AYAY",
                    "user_href": "/profile/A-AYAY"
                },
                {
                    "user_id": "Mary Rose Pelaez",
                    "user_href": "/profile/Mary-Rose-Pelaez"
                },
                {
                    "user_id": "Alexandra Josephine Gulko-Hyman",
                    "user_href": "/profile/Alexandra-Josephine-Gulko-Hyman"
                },
                {
                    "user_id": "Amanda Oh",
                    "user_href": "/profile/Amanda-Oh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siba Fatyi",
                "href": "/profile/Siba-Fatyi-2"
            },
            "answer_text": "Disclaimer: Answer is subjective as every person has their own ideal and opinions as to what makes a woman attractive. Beauty is in the eye of the beholder and every person has their own preference and thoughts about attraction and what attracts them. What makes a woman attractive to me: How feminine they are - A woman being feminine allows me to me more masculine and showcase my more manlier side which is what I personally like. Kinda like the whole damsel in the distress where the man has to step up and take the leadership role while there’s the cute female that the man has to help and attract through his masculine presence. Meaning that I want a woman who I can me more manly with and she can be more feminine with by her mannerisms, her voice and the way she looks at me like I need to “save her”. Not literally but like I am the man who she can turn to if anything were to happen, that is the kind of vibe I want my woman to give me.Physical features - Of course when talking about attraction, it all starts with the physical. Not saying it’s all physical but it’s a big part as that is how we determine our attraction level by appearance. Ideally, I like petite woman, brunettes and shorter girls around 5′2–5′5. But somehow I really, really like girls that are taller like 5′10–6′0 ft and kind of on the thicker side and still brunettes for me.How they dress - A woman who take the time into their appearance and knows what clothing best fits their body is something I really find attractive. Shows they take great care into their appearance, and the power of clothing especially for woman is super powerful. Girls who wear heels, hoop earrings, lip stick, short shorts, tube tops are all items that I love to see on a woman that will make me go head over heels.   Again this is solely on what I think makes a woman attractive, I cannot speak for every person as they have their own thoughts and opinions to what attracts them. Hopefully this answer was helpful!! ",
            "date": "Answered November 6, 2019",
            "views": "85",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amani M",
                    "user_href": "/profile/Amani-M-3"
                },
                {
                    "user_id": "THIS IS NOT YOUR GALAXY",
                    "user_href": "/profile/THIS-IS-NOT-YOUR-GALAXY"
                },
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "Timea Czirjék",
                    "user_href": "/profile/Timea-Czirjék"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maria-4304"
                },
                {
                    "user_id": "Kristoff Etranos",
                    "user_href": "/profile/Kristoff-Etranos"
                },
                {
                    "user_id": "Heather Lauren",
                    "user_href": "/profile/Heather-Lauren-4"
                },
                {
                    "user_id": "Sneha",
                    "user_href": "/profile/Sneha-865"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andreas Frenz",
                "href": "/profile/Andreas-Frenz"
            },
            "answer_text": "There are so many attractive types of women. I generally don’t go for black girls, but I knew a girl that was attractive; her only issue was she’d suddenly ignore you if another black person walked into the same vicinity. Generally, I like white, hispanic and asian women; but I’d only date someone who was culturally compatible. I like big brown eyes, sparkly blue or deep blue or emerald green eyes. Blondes, redheads (though brown eyes rarely go with red hair, except Nikki Cox) and brunettes. So, that’s most women; but I mean really thick rich brown hair like Erin Burnett on CNBC. Not orange hair or fake looking redheads. Not bleach blonds or the ones with black roots. Clean skin, nice smile, healthy tan, slim figure with some muscle tone. Plump thighs, large breasts and a round butt. Most importantly, tight, hot, wet and clean partial shave. Now wasn’t that superficial. That’s life. I want a woman that’s a good kisser, cuddly, good in bed, knows how to cook. Once you have all of those features and one of the hair/eye combinations, I want someone who’s fitness oriented, ambitious but not stepping on me and a collaborator. As to if they want kids, I’m all or nothing. If they want kids, I want a polygamist family; the first wife gets to pick additional wives and the other wives get a vote (I get a veto if they want Amy from TBBT.) If they don’t want kids, we’ll work real hard, get rich; retire and sail the world just the two of us. Of a girl I wasn’t trying to get with asked what makes a woman attractive, I’d tell her cleanliness and being reasonable and honest. ",
            "date": "Answered July 19, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fayaz Ahmed",
                "href": "/profile/Fayaz-Ahmed-70"
            },
            "answer_text": "I think everyone's idea of a pretty girl will be different. To me it means a lot of things. Like the saying goes, \"Beauty is in the eye of the beholder\", and to me that means that beauty, or prettiness often has to do with what the person means to me. The more important someone is to me, or the more I like them as a person, the more I tend to notice how pretty they are. If we're just talking about physical features that I find pretty, there are a few. I'm sorry if anyone is offended by any of these or disagree; these just come to mind when I think \"pretty\": Nice Eyes Something I often notice in girls I consider pretty are their eyes. The kind you can look into and get lost in...Though I suppose thats just me being overly romantic. I like it when I can maintain eye contact without feeling uncomfortable because I feel stared at, or without her feeling uncomfortable that I'm looking at her. However, I do understand that many girls/women will feel uncomfortable doing this, due to the amount of guys who think along the lines of \"She looked me in the eyes. I should bother her until she admits she likes me\" and get harassed because of it, and that's a problem. Being Healthy in terms of Weight I don't think you have to be skinny or try to look like one of those Victoria's Secret models to be pretty, but healthiness is attractive. Different people obviously have different body types, but there's a clear difference between \"my genes make me this way\" and \"I'm not exercising or eating healthily\", the latter of which shows a lack of care for yourself, which is decidedly not a good thing. That includes unhealthy skinniness and anorexia, not just obesity. So, basically, I like girls who look like they take care of themselves and their bodies The Way She Walks There's something I often notice in some girls I find pretty, and that's the way they carry themselves, especially when they walk. Some girls seem pretty aloof, basically paying no heed to anyone around themselves, and some people like that level of confidence, but I think its pretty when someone looks more down to earth. Some girls look shy, looking around a lot, and I find that cute sometimes. But I also like the girls who just seem kind of interested in what's going on around them, but still project self-confidence in their stride. I really don't know how to describe this one, it's just something that comes to mind. The Smile This is one of the most beautiful things I notice in girls I consider pretty. Again, its not something I know how to describe. If we're going personal, the girl I consider the prettiest has a smile that seems to make her eyes sparkle, the corners of her eyes wrinkle, and pull up her cheeks, and I just can't look away. But only when she's smiling genuinely. Too many people worry about how bad their smile is when they look in a mirror, because they're seeing a false smile instead of the one others see when they're actually happy. So, basically, just having a genuine smile and smiling often is something I find pretty.  Again, these are just a few of the general things I notice in girls that I find pretty. It's a highly individual thing, from girl to girl; there are things that I would find pretty in one girl but I wouldn't in another girl trying to emulate that trait. Honestly, the prettiest things are confidence and comfort, which make me notice all the little things about the girl that make her pretty to me. Hope this helped, or gave you some insight into my (somewhat convoluted) mind! ",
            "date": "Answered January 19, 2016",
            "views": "451",
            "upvotes": " View 120 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elgen Torregosa",
                    "user_href": "/profile/Elgen-Torregosa"
                },
                {
                    "user_id": "Reama Tora",
                    "user_href": "/profile/Reama-Tora"
                },
                {
                    "user_id": "Anh Le",
                    "user_href": "/profile/Anh-Le-638"
                },
                {
                    "user_id": "Laura Leong",
                    "user_href": "/profile/Laura-Leong-2"
                },
                {
                    "user_id": "THIS IS NOT YOUR GALAXY",
                    "user_href": "/profile/THIS-IS-NOT-YOUR-GALAXY"
                },
                {
                    "user_id": "Ioanna Kal",
                    "user_href": "/profile/Ioanna-Kal-2"
                },
                {
                    "user_id": "Dharma Neesha",
                    "user_href": "/profile/Dharma-Neesha"
                },
                {
                    "user_id": "Aditi Garg",
                    "user_href": "/profile/Aditi-Garg-162"
                },
                {
                    "user_id": "Marisa E",
                    "user_href": "/profile/Marisa-E-3"
                },
                {
                    "user_id": "Christin Holloway",
                    "user_href": "/profile/Christin-Holloway"
                }
            ]
        },
        {
            "author_info": {
                "name": "Songyi",
                "href": "/profile/Songyi-3"
            },
            "answer_text": "i’ll be answering this based on appearance and why my eyes linger over them, not because i like them as a crush. i talked to only males for a couple months because i didn’t know if there were any girls in the same community. i created an ideal list in order to relate with them whenever they talked about girls, because obviously i can’t talk about boys to boys. that’s just wack. i like to look at pretty faces. although, pretty faces in your terminology probably means every girl you don’t see horrible to look at. to me, a pretty face is something you don’t see often. thots and abgs are mostly found everywhere, making them a copy and paste style that tire my eyes. short girls aren’t my type, as most of them look mad stubby and have to look down at them. enough about height and copy paste girls. unique figures are what i look at and their looks. how they style themselves and how healthy and good of a personality they have. to be honest, there are only three girls that i like looking at. one of them have really dull eyes, but she’s mad pretty in my eyes. her skin’s great too. another one is someone who everyone would consider perfect. she’s slim and my height, which makes her attractive because she doesn’t look stocky. the last one is someone i see during lunch. she’s not on the slim side and she’s taller than me. she puts on makeup and looks like your average asian thot, but her body’s really nice. by body, i don’t mean chest and ass. i don’t look at that. i look at how the fat/muscle fits. she’s the healthy type girl i’d consider pretty, even though i don’t know her personality. i don’t know. she walks like a model and is very distinct from her other friends. i edited this answer, by the way. my first one was kinda wack. ",
            "date": "Updated June 24, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maria-4304"
                },
                {
                    "user_id": "Joyce Adena",
                    "user_href": "/profile/Joyce-Adena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rolando Gómez",
                "href": "/profile/Rolando-Gómez-1"
            },
            "answer_text": "As a photographer of women, from Playboy Playmates to an American Idol star, my exposure to women exceeds the client list of an average gynecologist, and like the latter, I’ve seen some very attractive and not so attractive women in my lifetime. Here are the things that make women attractive to my eyes; her soul, her heart, her candor, her confidence, and her eyes.  Soul Part of attractiveness I find in a woman is the beauty that she radiates from the inside out. That incorporeal essence that holds no physical form, aka their soul. The average man only sees beauty but never hears the soul of a woman. I prefer to listen first, then look. Socrates said it best, “What screws us up the most in life is the picture in our head of what it's supposed to be.”  Heart I don’t need a beautiful individual that creates haters, or a B.I.T.C.H., there are plenty of those. An attractive woman has a great heart that cares about others, not just herself. An attractive woman has a great heart that produces charisma that everyone can’t help but like. An attractive woman has a great heart that flows with morality, not just love.  Candor I value integrity and honesty. An attractive woman won’t jeopardize her integrity for anyone and will put her best foot forward to express her honesty. She doesn’t try to prove anything to anyone, she just does it on her own by being herself; she’s not an animation, she’s real. An attractive woman doesn’t try to replicate or duplicate anyone, that’s falsehood, instead she lives by candor.  Confidence I look at a woman’s grace, does she stand or walk with confidence? I love confidence in a woman and usually if she has it in her poise, she’ll display it naturally in her eyes. As Audrey Hepburn so eloquently put it, “The beauty of a woman must be seen from in her eyes, because that is the doorway to her heart, the place where love resides.”  Eyes Eyes to me reflect what’s inside a person’s heart, and a woman with a great heart, in my opinion, will smile naturally through the corners of her eyes when they harmonize with the corners of her lips — this four-corner smile has nothing to do whether you see her teeth or not, it’s all about sensing the soul of a person in a natural smile of their face. ",
            "date": "Updated May 23, 2018",
            "views": "323",
            "upvotes": " View 174 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thanhphuong Nguyen",
                    "user_href": "/profile/Thanhphuong-Nguyen"
                },
                {
                    "user_id": "Sunny Alwan",
                    "user_href": "/profile/Sunny-Alwan"
                },
                {
                    "user_id": "Paula Bade",
                    "user_href": "/profile/Paula-Bade"
                },
                {
                    "user_id": "Jamison Cooper-Leavitt",
                    "user_href": "/profile/Jamison-Cooper-Leavitt"
                },
                {
                    "user_id": "Joann Mccormack",
                    "user_href": "/profile/Joann-Mccormack-2"
                },
                {
                    "user_id": "Randb Chapmam",
                    "user_href": "/profile/Randb-Chapmam"
                },
                {
                    "user_id": "Rrezarta Krasniqi",
                    "user_href": "/profile/Rrezarta-Krasniqi-3"
                },
                {
                    "user_id": "THIS IS NOT YOUR GALAXY",
                    "user_href": "/profile/THIS-IS-NOT-YOUR-GALAXY"
                },
                {
                    "user_id": "Aysha Shahid",
                    "user_href": "/profile/Aysha-Shahid-7"
                },
                {
                    "user_id": "Diana Linares",
                    "user_href": "/profile/Diana-Linares-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khaash F Kaur",
                "href": "/profile/Khaash-F-Kaur"
            },
            "answer_text": "I’m a pansexual woman and the first thing I look at (physically) at are the eyes, jawline and cheekbones. The gauntness of her face often tells me how emotionally mature she is and gives a hint to what she’s been through. I’ve been through some hard times and when a woman isn’t mentally well, I see myself in her and there’s an instant connection. In addition to that, when a woman is tired and in pain, I seek the need to comfort her and shower with love. I’m attracted to the sense of vulnerability and the strength women show after a traumatic experience. I don’t know why, I think it’s cause I s Continue Reading",
            "date": "Answered August 14, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Gould",
                "href": "/profile/John-Gould-6"
            },
            "answer_text": "Question originally answered: What makes a woman attractive?  A curious question to say the least. At least if it is asking for some objective criteria which would universally be agreed upon. There is of course a reason for the well-known adage “Beauty is in the eye of the beholder.”. It clearly states the notion of beauty to be be a subjective one. Now, while I recognise that ‘attractive’ and ‘beautiful’ might denote different concepts, I hold that both are subjective in the extreme, however much commonality we might find amongst people’s perceptions. Attractiveness, I take to be that quality of Continue Reading",
            "date": "Answered May 14, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Concepcion",
                "href": "/profile/Lisa-Concepcion-2"
            },
            "answer_text": "Ladies!!! Here’s a list of what the high quality men I coach find super attractive in women. These are the qualities I help my female clients step into so that they can then attract better quality men. Confident with who she is. So if you are doubtful about how wonderful you are, handle that. Louise Hay has a load of content for free on YouTube worth checking out as do I.Easy going with zero drama. So handle you ex’s, your job drama, whatever else you have stressing you out.Available yet has a life of her own, friends, hobbies, fitness, volunteers. She’s got her own thing going on. If you find Continue Reading",
            "date": "Answered November 20, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexander Porter",
                "href": "/profile/Alexander-Porter-21"
            },
            "answer_text": "WARNING: Unpopular opinion. Look, this isn’t going to be popular and I get that. But if I wanted to be popular I wouldn’t have run for class President in grade 6. My Mum was my campaign manager and honestly it was a shambles from the start of the campaign. I should have run on a policy of putting coca cola in the drinking fountains like all the other kids. Instead I talked about real issues. The type of issues that my fellow student should actually care about. Needless to say I was crushed in the polls. You haven’t seen a bigger blood bath since my uncle Andrew cut himself shaving and filled the ba Continue Reading",
            "date": "Answered May 19, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amitesh Gita Singh",
                "href": "/profile/Amitesh-Gita-Singh"
            },
            "answer_text": "I would like to modify this question in my own way as: What makes a woman beautiful? (Since ‘Beautiful’ sounds more fascinating and respectable than ‘Attractive’) Women are the most beautiful being in this world. If you would ask me of what I actually like in them, I could go on telling for days together. I have been given birth by a beautiful woman(Gita Singh, the name reflects as my middle name), also there's nobody in the world that knows me better than my sister(Varsha Singh). And since my childhood, I have been so lucky to share a beautiful, healthy and special bond with my female friends.  Continue Reading",
            "date": "Updated March 8, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Farris",
                "href": "/profile/Ian-Farris-1"
            },
            "answer_text": "Well. This is coming from a 16-year-old boy. I’ve looked at many girls in my time, and many more to come. Being at the height of my hormonal imbalances I don’t understand a lot of things, but I do know this. I LOVE to look at good looking women. Not in a creepy way. I don’t stare at a girl for minutes on end, but it’s always nice just to see them and interact with them. Anyway, every guy loves cute girls, and every girl loves cute guys. Now, the definitions of cute changes for every person, but rarely do people date people they find unattractive in one way or another. This much is known. What i Continue Reading",
            "date": "Answered January 7, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shaifali Singh",
                "href": "/profile/Shaifali-Singh-53"
            },
            "answer_text": "Woman is more attractive when Trustworthy: when she keeps her private secrets only to herself and does not even tell other’s secrets to others too. Because of this many arguementable topic does not open up, so this feature is unique and rarely found.(lol 😂) Sense of humour: This is very special quality in woman so that everyone wants to connect with you and wanted to talk to you. If you are a funny and to the point at the same point then you have a great sense of humour and you have a quality to attract anyone towards you. (first impression is always good). Personality: Most of the woman have a  Continue Reading",
            "date": "Answered August 17, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marie-Anne Wits",
                "href": "/profile/Marie-Anne-Wits"
            },
            "answer_text": "I would like to share with you that I think that it's really out of your hands what other people find attractive about YOU visually. You can't please everybody (not even as a top model).  What I find attractive in others, and I'm sure this goes for nearly everyone, is how they can make my life easier and more fun. I'm wildly attracted to people who do me favors, make me feel useful and make me laugh.  What you can do:  Make 2 genuine compliments every day. So say things like 'Well done!', 'You did that really well', 'It's nice to see you smile', 'I'm glad you're my friend', 'It's good to hear Continue Reading",
            "date": "Updated January 15, 2014",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Burris Rodenkirch",
                "href": "/profile/Burris-Rodenkirch"
            },
            "answer_text": "After reading many of these answers, I am a little frustrated. I’ve certainly enjoyed the stories of grandmothers and wonderfully caring giving and strong women. But understand that these women did not want to be strong. Their strength came from some inescapable hardship. Usually that is where strength comes from and many times it comes with baggage. These women were great in that they used the hardships to create goodness. Their wisdom and goodness were birthed from evils we can’t imagine. To come out on the other side of something so difficult is truly cause for celebration! My frustration c Continue Reading",
            "date": "Answered March 6, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexandre Ribeiro Miquilino",
                "href": "/profile/Alexandre-Ribeiro-Miquilino"
            },
            "answer_text": "In what sense? Every human being has associated with them both a physical aspect, and a mental aspect, and due to their interactions this means that the whole is way more than the sum of its parts. And this also applies to women - shocker, right? Therefore I believe it’s impossible to point out the most beautiful thing in women as a whole, because the functional unit she is in the end depends not only on one particular aspect or another. We then have to resort to refine our criteria and subdivide things back into the physical aspect and the mental aspect - and even then we still fall prey to sub Continue Reading",
            "date": "Answered July 19, 2017",
            "views": "0",
            "upvotes": "0"
        }
    ]
}