{
    "title": "What is the meaning of the song 'Betty' by Taylor Swift? - Quora",
    "tags": [
        "Folklore (2020 album)",
        "Taylor Swift Songs",
        "Taylor Swift (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vansh Sharma",
                "href": "/profile/Vansh-Sharma-79"
            },
            "answer_text": "Before jumping right into the song 'Betty' , there are a few things I would like to point out from the album first. 'FOLKLORE' is very different from her previous works both in terms of sonically and story telling. It is not a typical Taylor Swift Confessional album. She has woven different fictional characters and stories and sang about them in the album. There's ofcourse a couple of songs about her relationship with Joe but majority of album is pure stories inspired by her real life experiences. During a chat session on YouTube, she told fans that this album consists of a 'Teenage Love Triangle' plotline which includes three songs. After spending almost an entire day listening to the album and thanks to the internet, I have figured out everything about this love triangle. First of all the songs Cardigan, August and Betty are all part of this plotline. Each song is sort of incomplete without others in terms of story. The plot goes as follows: There are three different characters - James, Betty and Inez. James and Betty were in love with each other but one summer in August (yes, which the song August is about), James cheated on Betty with Inez due to some misunderstanding (we know how teenage dramas work) which is discussed in detail in the song 'Betty'. Later on James apologized to Betty about the summer fling as told in the lyrics - “I'm 17, I don't know anything but I know I miss you”. So, Cardigan is from Betty's perspective. You can easily tell from the lyrics that she's talking about James' summer fling - “A friend to all is a friend to none, Chase two girls lose the one” , “I knew you'd come back to me..”(talking about how James finally came back to her) , “when I felt like I was an old cardigan under someone's bed, you put me on and said I was your favourite” (she was feeling used by James but in the end he made ammends and they were together). Betty is from James’ perspective. In the song he talks about why the summer fling happened and now he is unable to face Betty. August is from Inez's perspective. She talks about the summer fling and how she always knew that he wasn't hers. This album is a true masterpiece. ",
            "date": "Answered July 25, 2020",
            "views": "302",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siya Kothari",
                    "user_href": "/profile/Siya-Kothari-4"
                },
                {
                    "user_id": "Richa Bhujbal",
                    "user_href": "/profile/Richa-Bhujbal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanika",
                "href": "/profile/Kanika-106"
            },
            "answer_text": "Before the release of cardigan MV Taylor mentioned that there are three songs that describes a love triange situation between three individuals and all these songs are from these individual's perspective. The three songs are- Cardigan, August and Betty And the three individuals are: Betty, James and the person James cheated with on Betty. All three of them goes to the same school. Betty and James are in a relationship but during the summer James cheats on betty with this other girl. Cardigan is from the pov of Betty. She talks about how even though he cheated on her she knew he would come back to her when things doesn't seem exciting with the other girl. From the lyrics we know she is much more older here and she is remembering her days with James. And even though it has been a long time she still remembers him. Lyrics: ‘Chase two girls, lose the one' She knows about the other girl. This whole bridge is her talking about how she has this longing for James even after so many years. But I knew you'd linger like a tattoo kissI knew you'd haunt all of my what-ifsThe smell of smoke would hang around this long'Cause I knew everything when I was youngI knew I'd curse you for the longest timeChasing shadows in the grocery lineI knew you'd miss me once the thrill expiredAnd you'd be standing in my front porch lightAnd I knew you'd come back to meYou'd come back to meAnd you'd come back to meAnd you'd come back August: This song is from the perspective of the girl James cheated on with. It is more recent in the time when all these events happened. Probably when the summer ended and they have to go back to school. The girl James spent his summer knew he was never hers because he had a girlfriend Betty. And despite knowing that she still wants him even though it is not possible. It is kind of like the song Cruel summer from her last album Lover. Wanting someone and wishing they were yours. Lyrics: I can see usLost in the memoryAugust slipped away into a moment in time'Cause it was never mine Your backBeneath the sunWishing I could write my name on itWill you call when you're back at school?I remember thinking I had you Remember when I pulled upAnd said \"Get in the car\" Betty is from James Pov where he is apologising to Betty for cheating on her. He is explaining that why he did what he did and that even when he was with the other girl, she was the only thing on his mind. Lyrics: You heard the rumors from InezYou can't believe a word she saysMost times, but this time it was trueThe worst thing that I ever didWas what I did to you He is regretful for what he did to her. And he is stating why all of this mess happened. His reason is that he saw her dancing with a guy so felt mad about it. Betty, I know where it all went wrongYour favorite song was playing from the far side of the gymI was nowhere to be found, I hate the crowds, you know thatPlus, I saw you dance with him The cobblestones are also mentioned in Cardigan- High heels on cobblestones. I was walking home on broken cobblestonesJust thinking of you when she pulled upLike a figment of my worst intentionsShe said \"James, get in, let's drive\"Those days turned into nightsSlept next to her butI dreamt of you all summer long This lyric She said \"James, get in, let's drive\" relates back to the august lyric Remember when I pulled up and said \"Get in the car\". It shows that the girl metioned in both Betty and August are the same person. Standing in your cardiganKissin' in my car againStopped at a streetlight The line ‘Kissin' in my car again’ is also present in Cardigan- ‘To kiss in cars and downtown bars.’ This is how we know the cardigan James is referring to is of Betty. ",
            "date": "Answered July 27, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Richa Bhujbal",
                    "user_href": "/profile/Richa-Bhujbal"
                }
            ]
        }
    ]
}