{
    "title": "What is the best way to describe Schubert and his music? - Quora",
    "tags": [
        "Franz Schubert (composer)",
        "Composers",
        "Descriptions",
        "Classical Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Falroski",
                "href": "/profile/Jack-Falroski"
            },
            "answer_text": "Melodic, light, and not particularly revolutionary. Most of Schubert’s music is a step back from Beethoven, and has much more in common with Mozart than the newer trends in music. He was a very insecure person for most of his life, and wasn’t particularly popular apart from a few devoted followers. He was apparently a soft spoken individual and a skilled improviser at the piano. Not much is known about his love life, but contrary to the beliefs of those who say he was gay, we have diary entries (or letters..I can’t remember) that show he was very much in love with a young Austrian woman. He supposedly wrote his piano sonata D664 in A major as a musical picture of her. Other than that, we just know he loved Beethoven and writing German lieder. His music frequently tries to immitate the style of Beethoven, but never keeps it up. Beethoven had a heaviness and fierce determination of a stereotypical grumpy German that Schubert never possessed. As a result, Schubert’s music is much more singing; Beethoven’s more shouting/declaring. Another characteristic of Schubert’s music is that when assigning “imagery” to it, one would never think of the indoors. His music evokes a sense of open space, winds, and mountains. This would make sense, as Schubert frequently took vacations to mountain getaways and forests. ",
            "date": "Answered April 25, 2020",
            "views": "236",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jaymian Poon",
                    "user_href": "/profile/Jaymian-Poon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Hicks",
                "href": "/profile/Steve-Hicks-64"
            },
            "answer_text": "I remember hearing this hilarious cliche story back when I was an undergraduate. Supposedly on Schubert’s 19th century death bed—mid-storm, of course—the man managed to utter but one final word before succumbing to death that stormy night: “Beethoven”. In short, Schubert is the Coors Light answer to Beethoven’s Boneshaker IPA (I’m Canadian, insert your own beer reference). Generally took Beefovens tonal language and ran with it; except where Beethoven screams to the heavens “MORE EVERYTHING!”, Schubert gives us a deceptive cadence and goes on to something else. Schubert’s melodic lines are generally singable and memorable; I think that leads to a modern bias. We typically associate easily recognizable/singable melodies (that is to say, simple melodies) with popular music of the pre-90s (before, even in Disney, they started making the songs more complicated so you had to bring the kids 8 times to the movie so they could remember the fucking words—to this day, I remember every word of Bear Necessities, go figure). On the other side of the coin, simple melodies at the time were associated with folk music. This expanded Schubert’s potential client base, but ultimately left him lacking in the expression experimentation department: something the lovely Ludwig van excelled at. There is also a fascinating debate from the 90s regarding Schubert’s sexuality and the subsequent result on his music. This feels too much like made-up identity politics to me to pursue further, but such arguments do exist for some reason. It should be worth noting that one of the forerunners in that debate, despite her immense prestige, is also the same person who made her name analyzing Beethoven’s 9th as a prolonged rape… soo ehhhh. ",
            "date": "Answered April 27, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jaymian Poon",
                    "user_href": "/profile/Jaymian-Poon"
                }
            ]
        }
    ]
}