{
    "title": "What would you say to the one that got away? - Quora",
    "tags": [
        "Using Psychology in Relationships",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Mattsson",
                "href": "/profile/Peter-Mattsson-4"
            },
            "answer_text": "Assuming I could pluck up the courage to say anything, “Hi. Want to go for a coffee?” I had this huge crush on a girl at school, and although she flirted a little now and again, we were always just friends. But the kind of friends who wrote long letters to each other in the summer holidays (like, 15 pages, with illustrations and footnotes) and generally just really enjoyed hanging out. We did eventually go on one date (my first ever!) just after she left school, and although we had a lovely evening, talking through the night in her room at uni and listening to the Beatles (she literally only had one tape, so we listened to Sergeant Pepper's Lonely Hearts Club Band on repeat), it stayed strictly platonic. We were so platonic, in fact, that she later shared a bed with me after my 21st birthday party (due to a carefully-arranged bed shortage) and we again just talked. I didn't get any sleep that night, but not for the hoped-for reasons. When I asked her about it, she'd always give me some variation on the theme of “you can do better”. To this day, I don't know if that was her letting me down gently, or caused by a genuine lack of self-confidence on her part. Not that she had anything to lack confidence about: she was no supermodel, but she was pretty and had a vivacious way about her that was entrancing, at least to me at the time. Anyway, we kept in touch through my uni years, writing epic screeds back and forth, until I got this email from a guy I'd never met telling me that he was her boyfriend and I should back off. (Mind you, by this point I'd long since stopped trying to flirt with her and just got on with being friends.) So, I asked her about it. And she said she was in love, he was the one, but he didn't like her having contact with any other guys. Even to my socially-clueless brain at the time, that seemed more than a bit off, so I tried to talk to her about it. Not so I could be with her, but because I worried how her life would be with him. Except I made the mistake of trying to do that secretly, so he wouldn't find out. Of course, he did find out, because I'm about as good at sneaking around as an elephant with sinus trouble, and I got this long ranty email telling me never to talk to her ever again, on pain of death. And another one from her shortly after saying I'd better do as he said. Well, what could I do? And shortly after that, we graduated and I lost any chance of getting in touch with her for good. In recent years, I've tried to find her online, but couldn't find any trace of her. Which I'm hoping just means she's not that into the internet, rather than that anything bad's happened. So yes, if I ran across her again, I'd really like any chance to catch up and find out how she's been. Whether that guy was as much of an ass as he seemed, and whether she got away. What she's doing now. And I'd really like to stay in touch after that, too. Not for any romantic reasons, but just because she was a great friend, and I've missed her. But in 20 years, that's never happened, and I doubt it ever will. :/ ",
            "date": "Answered February 7, 2019",
            "views": "939",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zoe Karran",
                    "user_href": "/profile/Zoe-Karran"
                },
                {
                    "user_id": "Tanya Stevens",
                    "user_href": "/profile/Tanya-Stevens-14"
                },
                {
                    "user_id": "Kirstin Huiber",
                    "user_href": "/profile/Kirstin-Huiber"
                },
                {
                    "user_id": "Ronald Denson",
                    "user_href": "/profile/Ronald-Denson-2"
                },
                {
                    "user_id": "Bridget McCrea",
                    "user_href": "/profile/Bridget-McCrea-1"
                },
                {
                    "user_id": "Duncan O'Brate",
                    "user_href": "/profile/Duncan-OBrate"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ullycris Bagtas",
                "href": "/profile/Ullycris-Bagtas"
            },
            "answer_text": "You said you love me once. Then you told me twice. Then you made it thrice. Eventually you say it to me EVERY SINGLE DAY. That should have made me happy, right? It didn’t. Sure it flattered my ego that I can make someone love me as much as you love me. That I can make you go crazy with wanting with only the barest whispers and touches from me. That made me ecstatic. It made me powerful. Knowing I can control and manipulate your happiness. You see, I now know that I was an ungrateful bitch. For I never did say I love you too or I love you back. My reply was “I don’t know what to say” and you’ll say “It doesn’t matter. Just know that I love you” and I’ll say “That’s so sweet baby.” I now have an idea how much it must have hurt you back then. Opening your sincerest words and having no reply in return. And if only I’ve known and understood the feeling I felt for you, would I have done differently? Honestly speaking, I don’t know.  Maybe. As I look back now, there’s still a part of me that couldn’t and won’t let you go. Reminiscing how you made me happy. Making me giggle like a silly little girl. And though I’m not that old for I’m only in my early twenties, you made me remember a time in my childhood when I still trust people, still ignorant of the ways of this world, still living happily in my own naiveté. I’ve always wondered if there’s someone for me out there. And then I found you. We had our moments of happiness, though we also had our moments of tears. And I wasn’t satisfied. I thought that if I let you go, I’ll find someone else who could love me more than you do.  And that’s the problem. I want more.  More of your time.  More of your love. More of everything.  More of you.  And then one day, you realized that you’re tired of all my shit, and called to say you quit. And as much as I want to return in that moment and take back everything I’ve said. To swallow the bitter words that I shouldn’t have spoken. I can’t.  If only I have the power to reverse the hand of time. And every day since that fateful day, I blame myself for losing a love such as yours. And wasting something precious such as “us.” ",
            "date": "Answered December 21, 2015",
            "views": "16",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Brady",
                    "user_href": "/profile/Jennifer-Brady-18"
                },
                {
                    "user_id": "Zoe Karran",
                    "user_href": "/profile/Zoe-Karran"
                },
                {
                    "user_id": "Kathy Pelgone",
                    "user_href": "/profile/Kathy-Pelgone"
                },
                {
                    "user_id": "Pooja Pawar",
                    "user_href": "/profile/Pooja-Pawar-23"
                },
                {
                    "user_id": "Sadaf Said",
                    "user_href": "/profile/Sadaf-Said-1"
                },
                {
                    "user_id": "Tom Gee",
                    "user_href": "/profile/Tom-Gee-8"
                },
                {
                    "user_id": "Andraž Športnik",
                    "user_href": "/profile/Andraž-Športnik"
                },
                {
                    "user_id": "Suree Beniwal",
                    "user_href": "/profile/Suree-Beniwal"
                },
                {
                    "user_id": "Prasanna Venkatesh",
                    "user_href": "/profile/Prasanna-Venkatesh-24"
                }
            ]
        }
    ]
}