{
    "title": "What is your opinion on Elvis Presley? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Azza Paterson",
                "href": "/profile/Azza-Paterson"
            },
            "answer_text": " Teenaged Elvis Presley. My opinion is Elvis was a one of a kind, although he was really two of a kind being an identical twin to brother Jesse Garon Presley!  Yes he was good looking, dressed differently from other kids loved singing country music songs such as some by Hank Williams, his mother Gladys was a huge fan of Canadian country artist Hank Snow who came out with his first big smash hit ‘I'm Movin' On' circa Korean War. Elvis would have heard country songs on the radio, heard his mum singing along with the radio, joined her in singing and develeoped his interest in country music as well as the environment he grew up in in Shakerag, a small black area of Memphis where prostitution, drinking, carousing and fighting went on. He was known to sneak into smoke filled music joints to hear his favourite blues artists, locals ‘Memphis Slim, and ‘B.B. King'.  Elvis with his lead female gospel group singer, Cissy Houston, mother of Whitney Houston. These musical influences combined with watching his mother dance would have developed his love for music and movement which he became famously known for, or for him, infamously known for not liking the nickname, ‘Elvis the Pelvis'. Growing up in a southern environment, his access to musical talent was a precursor to his wanting to as they say ‘cut a record' for his mother at Memphis Sun Studios, those two songs I believe were ‘Ole Shep' and ‘My Hapiness' both country songs.  Elvis of course rose to fame, enlisted and served in the Armed Forces, got more into movies which his manager Col Tom Parker, an illegal Dutch Immigrant had him singing mundane love songs churned out repeatedly throughout the 1960′s. The opportunity to do a TV special, later known as the ’68 Comeback special shot him into the spotlight again and kicked off a new fresh career of doing what he loved best, singing quality songs.  Elvis with mum and dad, Tupelo, Mississippi. Sadly, Elvis wanted to please everyone, continued his search for who he really was, why was he put here on earth and this coupled with his reliance on medication not necessarily the best medication for his personal health led him into a decline that he did not or could not pull him out of. There were no ‘intervention programs' and the lack of his hanger-ons pushing him to improve his health led to the biggest shock of all, dying aged 42, only metres away from his eight year old daughter Lisa Marie Presley in his million dollar Graceland Mansion.  Lisa Marie Presley & Elvis. His love of God, Music, Kindness, Hope and inspiration was a legacy not many other artists if any can be named equalled?  Vernon Elvis Presley, Elvis Aaron Presley and Gladys Love Presley. He was once told not to record the inspirational song ‘In The Ghetto' a scary time in America's history, the mid to late 1960’s when good men such as Bobby Kennedy and Martin Luther King were gunned down [1968] and race riots were prevalent in American society, an unpopular war in Vietnam. He was told this song might inflame people and lesson his star appeal but he recorded ‘In The Ghetto' as his contribution to understanding and reasoning in a troubled society during those heady times.  Elvis’ rise to fame. My humble opinion is God gave us all a gift in the man, Elvis Aaron Presley. ",
            "date": "Answered August 8, 2018",
            "views": "17",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlie Johnson",
                    "user_href": "/profile/Charlie-Johnson-245"
                },
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Victoria Nicholson",
                    "user_href": "/profile/Victoria-Nicholson-29"
                },
                {
                    "user_id": "Carl Powell",
                    "user_href": "/profile/Carl-Powell-21"
                },
                {
                    "user_id": "Anton Jeldres Tiselj",
                    "user_href": "/profile/Anton-Jeldres-Tiselj-1"
                },
                {
                    "user_id": "Shyamal Lartius",
                    "user_href": "/profile/Shyamal-Lartius"
                },
                {
                    "user_id": "Georgia K",
                    "user_href": "/profile/Georgia-K-9"
                },
                {
                    "user_id": "Rishampreet Kaur",
                    "user_href": "/profile/Rishampreet-Kaur-2"
                },
                {
                    "user_id": "Jimmy Cool",
                    "user_href": "/profile/Jimmy-Cool-4"
                },
                {
                    "user_id": "Barrie Creedon Wennberg",
                    "user_href": "/profile/Barrie-Creedon-Wennberg"
                },
                {
                    "user_id": "Micky Benillouche",
                    "user_href": "/profile/Micky-Benillouche"
                },
                {
                    "user_id": "Sarah Drake",
                    "user_href": "/profile/Sarah-Drake-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Stewart",
                "href": "/profile/David-Stewart-8"
            },
            "answer_text": "I’ve always believed that he should be held up with The Beatles and Bob Dylan as the Holy Trinity who influenced and shaped modern music more than anyone else. He was one of the real gamechangers who totally changed what went before and made it something new and more exciting. And I’ve always had that respect without needing to actually listen to his music. But it’s only recently that I’ve actually sat down and really paid a lot of attention to his musical input and come to appreciate how timeless a talent he was. His voice is brilliant and he had an incredible onstage presence. He surrounded himself with talented people and produced some of the greatest music of the last 100 years. It’s true that his film work is mainly bollocks and he was terribly mis-managed (and I hate the Jordanaires) but his pre-army stuff is mainly brilliant and he had moments after he returned that show he never stopped having moments of greatness. I’ve been an admirer for a long time but recently I’d say I’ve become a fan. I regularly put on his Sun Studios output and marvel at how great the guy was. ",
            "date": "Answered May 21, 2016",
            "views": "11",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Joe Elliott",
                    "user_href": "/profile/Joe-Elliott-27"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Chris Martin",
                    "user_href": "/profile/Chris-Martin-571"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Christine Leigh Langtree",
                    "user_href": "/profile/Christine-Leigh-Langtree"
                },
                {
                    "user_id": "Gary Don Peck",
                    "user_href": "/profile/Gary-Don-Peck"
                },
                {
                    "user_id": "Allan Bloxham",
                    "user_href": "/profile/Allan-Bloxham"
                },
                {
                    "user_id": "Yash Sharma",
                    "user_href": "/profile/Yash-Sharma-478"
                },
                {
                    "user_id": "Alexander Kroeker",
                    "user_href": "/profile/Alexander-Kroeker"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Rob Fletcher",
                    "user_href": "/profile/Rob-Fletcher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Hauser",
                "href": "/profile/Dennis-Hauser"
            },
            "answer_text": "Instead of the usual answer, like great charisma, great vocals, first in everything, I'm going to give you my first impression of Elvis Presley, from the beginning of me becoming a fan.Picture late 60s-preteenager- staying all summer at my Aunt & Uncles' house.They let me go thru stacks of 45s to listen to and borrow.I don't have much time, so I would let the needle play a few lines and put it in the yeah or nay stack. I started noticing a lot of black labeled ones with a white dog with his' head tilted, in front of an old Victrola, with the message under himsaying. \"His Masters' Voice.\"Who is this guy? Thru these worn labels I read Elvis Presley & the Jordanaires.Hmmmm. Jailhouse Rock, Love Me Tender, I Got Stung. Even thru all the scratches, his sound, his' power came thru to me.Still trying to figure this out, Elvis Presley? Then a light bulb came on, Oh! I know this guy, I just watched his' movie Kid Galahad and last week Roustabout. That's the guy that makes movies! And from there, When I started making my own money, who do you think I bought first,.... Elvis!Oh! Opinion wise-the Greatest part of Rock-N-Roll and the saddest part. ",
            "date": "Answered August 21, 2018",
            "views": "366",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Carl Powell",
                    "user_href": "/profile/Carl-Powell-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Spinney",
                "href": "/profile/Keith-Spinney"
            },
            "answer_text": "I recenty read on here where someone called him a overrated cover performer. It blew my mind. Yeah the guy didn’t write his own songs but he didn’t really cover old songs. He songs were written for him. Anyway, I think at the time he hit the airwaves he was a rare bird. A white man singing black music. Basically he brought into light what everyone else was ignoring. That black musicians(most who wrote their own songs) were the real rock stars. Elvis was an innovator. I think Hollywood ruined him but that shouldn’t surprise anyone. George Harrison met him backstage in Vegas in 1971. They had a short conversation but George told him he should get ride of the flashy costumes and start playing his guitar again. If you notice Elvis didn’t stop wearing the costumes but he did start playing his guitar in his shows. Was he a genius? Probably not. Was he talented? Hell yeah. ",
            "date": "Answered August 21, 2018",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Billy Roberts",
                "href": "/profile/Billy-Roberts-2"
            },
            "answer_text": "Elvis was a poor white kid until Sun Records discovered him. He did some of his best recordings with Sun. Most poor white kids wanting to get into the music business were Country music fans. Elvis was different. He wore long hair and flashy clothes. Carried his guitar everywhere in high school. He was really into the Blues music. He also loved Gospel music. I think Country took third place with him. He seemed like a big happy kid even in his 40’s. He or his manager felt in the late 50’s through most of the 60’s that songs were costing too much. The guys who wrote his songs were being told no unless they wrote a cheaper song. The movies sucked also. Elvis started taking drugs that he took in the Army. His manager thought it was time to marry, so he did. Elvis grew tired of plain Vanilla so his manager got the 68 special for him. Elvis let other people tell him what to do. His Mom spoiled him when he was small all the way to adult- hood. There were people around him, but who was going to tell him he needed to quit taking drugs? He was a really good man who would give the shirt off his back to anyone.Lot’s of people received cars, houses and other presents. But nobody knew the private Elvis. When he and Priscilla divorced, he started downhill. He was a womanizer which broke up every relationship he ever had. I feel that he died of a broken heart. He couldn’t live the life he lived anymore. ",
            "date": "Answered August 23, 2018",
            "views": "444",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vicky Watson",
                "href": "/profile/Vicky-Watson-3"
            },
            "answer_text": "I'm assuming you mean Presley? Well let's discount the obvious firstly.  He was gorgeous! Musically though, he was innovative with a wonderful voice, deeply coated with base.   He moved through style with no difficulty, from full on Rock n Roll one second to deep southern Gospel the next. The way that he is able to express such a wide range of emotion using just the range of his voice is almost totally unique (IMO). His movements too were astounding for the time.  He was considered so outrageous that they insisted that he be filmed only from the waist up. Sadly though, he was mismanaged by one Tom Parker, who signed him up to numerous poor films, some with very dubious scores considering his range.  Thankfully he made a live comeback in 68 which was wonderful, but by that time he was so medicated that he started to go downhill. And yes, in the couple of years before his death he WAS heavy, but if you look at the early days of his Vegas career (71) he is still very very slim, even if he is wearing the suits that all impersonators seem to wear. ",
            "date": "Answered May 11, 2016",
            "views": "12",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Lisbet",
                    "user_href": "/profile/Lisbet-1"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Gary Don Peck",
                    "user_href": "/profile/Gary-Don-Peck"
                },
                {
                    "user_id": "David Stewart",
                    "user_href": "/profile/David-Stewart-8"
                },
                {
                    "user_id": "Scott Turner",
                    "user_href": "/profile/Scott-Turner-34"
                },
                {
                    "user_id": "Ryann Olechow",
                    "user_href": "/profile/Ryann-Olechow-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "To me, Elvis was and is definitely one of the greatest singers popular culture has ever seen. Not only that his vocal ability was amazing, but he also possessed great versatility that enabled to sing several genres and styles of music such as rock ’n’ roll, Gospel, soul, country, pop and blues, a feat that is not necessarily achievable by all good or great singers out there. His tone was also unique while his range was extraordinary - he can go down low like a bass-baritone and sing incredible high notes like a tenor in the next. Most importantly, however, he never stops singing with tons of passion and emotion - his stage presence and charisma, until today, is totally unmatched. Certainly, he was not just another overhyped pop star back in the day, but rather a true born performer. Certainly, he was an icon for his time, and rightfully so - the King of Rock ’n’ Roll indeed. To conclude this answer, here is one incredible Elvis performance for all readers out there, covering Simon & Garfunkel’s Bridge Over Troubled Water:  ",
            "date": "Answered May 30, 2016",
            "views": "693",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Lisbet",
                    "user_href": "/profile/Lisbet-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marina Gkane",
                "href": "/profile/Marina-Gkane"
            },
            "answer_text": "Americans think of Elvis as a semi god. He had unquestionably a great voice , some really good songs, he was a fairly good dancer and actor. He was charismatic on stage no doubt . His vocal range was untouchable no doubt but at times i prefer Tom Jones as a singer. Of course , some covers Elvis made are amazing, he had a very distinctive voice. Elvis was a white man who could sing like a black man. Elvis was born with the natural ability to sing. At the same time i think Elvis was tortured and taken advantage of . He was very lonely deep down. I believe he had a good heart. I think he died too young. One of Elvis’ fears was whether he would be remembered after he was gone. I don’t believe he was very self confident. He was by nature shy and humble. RIP Elvis ",
            "date": "Updated January 12, 2019",
            "views": "678",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Joline Hebert",
                    "user_href": "/profile/Joline-Hebert"
                },
                {
                    "user_id": "Tyler White",
                    "user_href": "/profile/Tyler-White-184"
                },
                {
                    "user_id": "Latagia Copeland-Tyronce",
                    "user_href": "/profile/Latagia-Copeland-Tyronce"
                },
                {
                    "user_id": "Samuel Orona",
                    "user_href": "/profile/Samuel-Orona-4"
                },
                {
                    "user_id": "Ani Taylor",
                    "user_href": "/profile/Ani-Taylor-1"
                },
                {
                    "user_id": "Carl Brown",
                    "user_href": "/profile/Carl-Brown-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tammy Money",
                "href": "/profile/Tammy-Money-1"
            },
            "answer_text": "Elvis was a true rags to riches. He believed in God and worshipped the ground his Mother walk on. He was raised right and carried his manners with him up until his death. He knew he had a talent and was going to pursue it no matter what obsticles he faced, including ridicule, embarrassment by others, and put downs by those that did not know him. I believe he finally realized that Col. Parker was good for him in the beginning and made him who he was to become. But he also felt towards the end that the Col. Parker held him back in so many ways. But being raised to honor his word, he kept his contract as it was with the Col., but I believed that is what slowly brought him, amongst other things to his early grave. I idolized Elvis since I was 9 years old. I am now 59 years old and I still get goose bumps when I watch him in concert videos. The GREATEST entertainer EVER! ",
            "date": "Answered July 31, 2018",
            "views": "390",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                },
                {
                    "user_id": "Joline Hebert",
                    "user_href": "/profile/Joline-Hebert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Stark",
                "href": "/profile/Gary-Stark-8"
            },
            "answer_text": "Forget the bloated white-suited 1970s Las Vegas Presley. This was just a caricature of the 1950s Elvis. He exploded onto the world’s consciousness in the mid-50s. He was good looking, had a beautiful voice, and moved like a sex-god. The repertoire was raw and blues driven, oozing the promise of illicit sex and his hip movements drove girls wild and adults into apoplexy. If you weren’t around then it’s hard to appreciate just how he changed the world of music from bland crooners to wild, dangerous, sexy Rock and Roll. He was simply the second greatest performer of the 20th century after Sinatra and it was a great shame that his talents were not exploited better thanks to Colonel Parker his manager. ",
            "date": "Answered March 10, 2019",
            "views": "201",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Susan Davis",
                    "user_href": "/profile/Susan-Davis-209"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Holmes",
                "href": "/profile/Chris-Holmes-19"
            },
            "answer_text": "Presley - very mixed feelings. OK as a performer when he started but he never wrote anything (although the Colonel made sure he got some of the royalties of the people who did which I find dishonest & disgusting. After the initial burst of rock ’n’ roll, & following his spell in the army, the attempt to re-invent him as good family entertainment & a film star completely neutered him. & his act as an anti-drugs spokesman while drugged up to the eyeballs under Richard Nixon was another disgusting low point. Personally I always much preferred the songs of Rick Nelson, the Everleys & my hero then & still, Buddy Holly, who inspired covers by both the Beatles & the Stones. ",
            "date": "Answered August 21, 2018",
            "views": "236",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carl Powell",
                    "user_href": "/profile/Carl-Powell-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victoria Nicholson",
                "href": "/profile/Victoria-Nicholson-29"
            },
            "answer_text": "Genius musician. I dislike how he went around with Anne Margaret when he had a young thing at Graceland. I also dislike how Elvis said he left no one special behind in Germany though its arguable that him saying that kept Priscilla safer. Elvis gave Priscillia anything she could want and though not from as working class roots as Elvis she benefitted from him. Elvis Presley was deservedly a great philanthropist, christian humanitarian, and cultural icon. Priscilla got to read, have a gun, have a horse, dance, karate etc. From Elvis. Many women have more dull lives than her. Most men still mess around on their women if they can. I dont want to be a adulterer even if I was a man. ",
            "date": "Answered February 10, 2020",
            "views": "180",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Ron McPhetrige",
                    "user_href": "/profile/Ron-McPhetrige"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Robert Haughton",
                "href": "/profile/Ian-Robert-Haughton"
            },
            "answer_text": "A iconic figure of the twentieth century like no other. Elvis Presley is the King of music. John Lennon said before Elvis there was no one there would have been no Beatles if there was no Elvis Presley. The greatest solo career ever a true Legend. A man who was human but is now revered like A God.  ",
            "date": "Answered August 1, 2018",
            "views": "133",
            "upvotes": " Answer requested by Sarah Drake",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pamela Black",
                "href": "/profile/Pamela-Black-1"
            },
            "answer_text": "He was the king! I and millions of people love his voice and his songs, and I like to watch his videos because his old ones show you why he was so special. The way he delivered his performance was like no other entertainer. Go to iTunes and find some old videos when he was just starting out. Amazing! ",
            "date": "Answered March 17, 2019",
            "views": "118",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cristy Fifield",
                    "user_href": "/profile/Cristy-Fifield"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Mickey Bakayi",
                    "user_href": "/profile/Mickey-Bakayi"
                },
                {
                    "user_id": "Izzy Phipps",
                    "user_href": "/profile/Izzy-Phipps-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Shirland",
                "href": "/profile/Jeremy-Shirland"
            },
            "answer_text": "The King. Unlike Michael Jackson, who insisted on being called the King Of Pop, by the media, Elvis did not anoint himself that title - he didn’t like it… ",
            "date": "Answered November 19, 2017",
            "views": "142",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Knut Knut",
                "href": "/profile/Knut-Knut-3"
            },
            "answer_text": "I have never been a huge fan of Elvis Presley. But I have to admit he had an incredible voice. “If I can dream” is my favorite Elvis Presley song. Probably not his greatest song. You need to have some serious skills performing this song and it seems so effortless when Elvis performs this song. Just an outstanding performance. ",
            "date": "Answered May 19, 2018",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Mickey Bakayi",
                    "user_href": "/profile/Mickey-Bakayi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derrell Lewis",
                "href": "/profile/Derrell-Lewis"
            },
            "answer_text": "No Doubt “THE GREATEST ENTERTAINER” that has ever walked the face of the earth. I know there towards the end of his life he had problems but even with all his troubles he could still sell out arenas and sing a song like no other, he was definitly “THE KING.” ",
            "date": "Answered January 23, 2018",
            "views": "169",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce Murrell",
                    "user_href": "/profile/Bruce-Murrell-1"
                },
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                },
                {
                    "user_id": "Patricia Hanson",
                    "user_href": "/profile/Patricia-Hanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mercedes Jones",
                "href": "/profile/Mercedes-Jones-33"
            },
            "answer_text": "He was \"Entertainer of the (20th) Century\" speaks for itself. He still is: the most handsome on the planet. His music is and will always be relevant. The movies although entertaining failed to showcase his immense talent. I love him still. ",
            "date": "Answered May 4, 2018",
            "views": "180",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kay Dee",
                "href": "/profile/Kay-Dee-57"
            },
            "answer_text": "Costello? Stojko? Duran? Crespo? Presley?  Which Elvis did you mean? I like some of Costello's music, same for Crespo. Thought Stojko was a talented skater, as Duran is a talented radio personality. Presley? He never was one of my favorites, but I know that millions love(d) him.   ",
            "date": "Answered May 9, 2016",
            "views": "274",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suraiyah Ratay",
                "href": "/profile/Suraiyah-Ratay"
            },
            "answer_text": "Warum alle Memphis Mafia und Stiefbruder von Elvis Priscilla Presley nicht mögen. Ich hatte das Gefühl, dass sie neidisch auf sie sind und dass sie nicht akzeptieren können, dass sie eine elvis Presley-Frau ist. Sie wollen elvis nur für sich selbst ",
            "date": "Answered January 27, 2019",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Garner",
                "href": "/profile/Sean-Garner-8"
            },
            "answer_text": "I love him. he was a great artist and will always be the king ",
            "date": "Answered July 2, 2018",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jewell Garrett",
                    "user_href": "/profile/Jewell-Garrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Morrissette",
                "href": "/profile/Michelle-Morrissette"
            },
            "answer_text": "He’s the best ",
            "date": "Answered June 30, 2018",
            "views": "64",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "The Awkward",
                "href": "/profile/The-Awkward"
            },
            "answer_text": "I think he is overrated. He only had a good voice. He didn’t write any of the songs he sings. So he is just a poser. ",
            "date": "Answered November 24, 2018",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sergio Lenuzza",
                "href": "/profile/Sergio-Lenuzza"
            },
            "answer_text": "I like him. ",
            "date": "Answered July 4, 2018",
            "views": "100",
            "upvotes": "0"
        }
    ]
}