{
    "title": "What is the most beautiful language for singing songs? - Quora",
    "tags": [
        "Specific Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Bianchi",
                "href": "/profile/Alessandro-Bianchi-29"
            },
            "answer_text": "I didn’t listen to all the languages in the world in music, but considering the ones I’ve heard a lot… Best languages that I know: ENGLISH: Not the best opera and songs with a similar style of singing. It’s very good for any other genre and wins over romance languages for any song that requires a lot of monosyllabic words. It’s the main language of rock music. ITALIAN: Perfect for any genre but it maybe it suffers in rock ’n’ roll. It has on average more syllables and it needs melody. For rap I didn’t notice for rap I didn't notice a disadvantage compared to English. SPANISH: Basically I could do copy-paste with what is written for Italian. Maybe it has an edge in some dance songs, but it depends on what songs. PORTUGUESE: Other copy-paste with Italian and Spanish. It’s the language of Bossa Nova and Fado. FRENCH: It’s like in the middle between English and Italian. It’s easier to change the same song from english to french than from English to Italian or Spanish or Portuguese. GERMAN: The only contraindication is in my opinion romantic songs ... I’ve listened to songs in other languages but not so many to give an opinion. I can say that I liked songs in Romanian, Greek, Japanese, Serbian, Swedish, Finnish, Norvegian, Icelandic, Albanian… ",
            "date": "Updated June 18, 2020",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luisa Meroni",
                    "user_href": "/profile/Luisa-Meroni-1"
                },
                {
                    "user_id": "Salonii Prakash",
                    "user_href": "/profile/Salonii-Prakash"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bizz Lamichhane",
                "href": "/profile/Bizz-Lamichhane"
            },
            "answer_text": "Yea, English comes first as an international language. But, if I have to chose secondary language for singing a song, I would chose Hindi, Indian language to sing a song. Here, I am sharing my own opinion and experiences: Hindi songs and movies are now getting renowned by the world and I have seen many foreigner who love Hindi songs and sometimes they sing as well. The most wondeful thing is they could sing as exact as we Nepalese and Indian people do. However, they feel weird to speak Hindi, but when they hear Hindi song, they can easily catch the lyrics, because Indian music and lyrics are so catchy. When I was very young, was vising local religiuous site, I met with foreigner, I forgot wheere was he from but I can remeber him singing Pardesi Pardesi Jana Nahi form hindi movie Raja Hindustaani. Similarly, when I was in Abu Dhabi, working in hotel, i met many Moroccan and Arabic people, even some African people sang hindi song from Shah Rukh Khan’s movies. ",
            "date": "Answered November 6, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jiten Gahir",
                    "user_href": "/profile/Jiten-Gahir-1"
                },
                {
                    "user_id": "Dhaval Kulkarni",
                    "user_href": "/profile/Dhaval-Kulkarni-6"
                },
                {
                    "user_id": "Jim Annino",
                    "user_href": "/profile/Jim-Annino"
                }
            ]
        }
    ]
}