{
    "title": "What is the relationship between the Greek gods and humans? - Quora",
    "tags": [
        "Greek Gods and Goddesses",
        "Deities (gods)",
        "Greek Mythology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vic Newman",
                "href": "/profile/Vic-Newman-3"
            },
            "answer_text": "At the time of the Greek Culture Lucifer was the principal being working against humanity, Lucifer is the Angel of literature, fantasy and imagination and deluged the Greeks with Myths which held a great deal of wisdom hidden with in them, but which on the surface swept Greece into fantasy and rampant superstition. Socrates, Plato and others,with their logic and questioning managed to tip the balance against the forces of Lucifer. Today we have the opposite being Satan working in the opposite direction, bringing humanity into a constant relationship with materialism. Satan takes the opposite position to Lucifer and postulates that there are no Gods, that all of the Myths are superstition and without any meaning or reality. That only the “facts” taught by Satan are real - that the universe is composed of dead matter and has no purpose and our lives are meaningless as are all of our achievements and that the universe will eventually end and as the universe came from nothing it will end with nothing. ",
            "date": "Answered May 22, 2020",
            "views": "250",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tomas Kindahl",
                "href": "/profile/Tomas-Kindahl-1"
            },
            "answer_text": "In general they are pretty wary of humans interfering with their plans and responsibilities. Sometimes they opt to support certain humans with fitting virtues since it supports their goals, but mostly they have their own mutual battles. If a human is trying to overreach the gods themselves, they are violently and cruelly put in place by a nasty fate. ",
            "date": "Answered May 22, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}