{
    "title": "What did Tolkien think of Wagner's Ring Cycle? - Quora",
    "tags": [
        "Richard Wagner (composer)",
        "J. R. R. Tolkien (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Martinez",
                "href": "/profile/Bill-Martinez-5"
            },
            "answer_text": " Deciding just what Tolkien thought of Wagner’s Ring Cycle and just what influence it may have had on his own work poses some thorny problems. First of all, it’s kind of a “loaded” question in that Richard Wagner is the undoubted “bad boy” of the world of classical opera. A vicious anti-Semite and all around creepy character, Wagner was also the very favorite composer of German dictator, author of World War II, and the murderer of millions—Adolf Hitler! What does it say of a composer, however talented, to have inspired a psychotic like this? So there are undoubtedly very good reasons why Professor Tolkien would have wanted to deny any connection with Wagner, however subtle or indirect. Tolkien always purported to hold Wagner’s work in contempt, and once told his publisher, “Both rings were round, and there the resemblance ceases.” But coincidences and connections, whether intentional or unconscious, tenaciously linger. Some similarities remain undeniable. Both Tolkien’s Lord of the Rings trilogy and Wagner’s Ring Cycle of four operas comprise heroic epics featuring a magical golden ring of immense and indescribable magical power, upon which the fate of an entire world hinges. Both star stalwart heroes and warrior maidens. Both have grasping dragons with fabulous treasure hoards and greedy dwarves obsessed with gold. Both feature mortal protagonists who must reforge the swords of their fathers in order to triumph. And in both of these works that aforementioned ring is virtually a discrete character—an irresistible and corrupting force that shapes the destiny and twists the wills of the mighty. All a coincidence? I think not! Some critics have argued that Tolkien was directly influenced by Wagner, while others have diplomatically posited that his real influence were Wagner’s own sources. These were the classic Volsunga saga and the Nibelungenlied. These epics concerned events in the 5th and 6th centuries and were written down in the Middle Ages. Tolkien was undeniably more than familiar with these Norse and Germanic source materials, going back to his undergraduate days. We know that he studied them extensively and even wrote about them. Other sources that Tolkien would also have had an intimate knowledge of were the Prose Edda, the Poetic Edda, and the Legend of Norna-Gest. In the end, I don’t think it’s credible that Wagner had absolutely no influence on Tolkien’s creation. Some of the chapters of Unfinished Tales have a distinctly Germanic, if not an operatic feel to them. But it’s fair to say that Tolkien’s deepest inspiration most likely came from sources quite a bit older than Wagner.  ",
            "date": "Answered February 13, 2017",
            "views": "12",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mitch Johnson",
                    "user_href": "/profile/Mitch-Johnson-9"
                },
                {
                    "user_id": "Betul Sahin",
                    "user_href": "/profile/Betul-Sahin-1"
                },
                {
                    "user_id": "Ananda Barton",
                    "user_href": "/profile/Ananda-Barton-1"
                },
                {
                    "user_id": "Felipe Argolo",
                    "user_href": "/profile/Felipe-Argolo"
                },
                {
                    "user_id": "Robert Berger",
                    "user_href": "/profile/Robert-Berger-28"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                },
                {
                    "user_id": "Michele Clabassi",
                    "user_href": "/profile/Michele-Clabassi"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Paul Schaaf",
                    "user_href": "/profile/Paul-Schaaf-3"
                },
                {
                    "user_id": "Tom Jackson",
                    "user_href": "/profile/Tom-Jackson-7"
                }
            ]
        }
    ]
}