{
    "title": "What musical instrument demands the most attention in the philharmonic orchestra? - Quora",
    "tags": [
        "KPM Philharmonic Orchestra",
        "Symphonies",
        "Cellos",
        "Orchestral Music",
        "Violins",
        "Classical Music",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew LaPorte",
                "href": "/profile/Matthew-LaPorte"
            },
            "answer_text": "Whichever one the composer wants it to be. Usually, orchestral composers use horns when they need a melody to stand out, due to how loud a horn can be over an orchestra, but a composer can make any instrument stand out, simply by making them play loud whilst everyone else plays soft so they can hear a more traditionally quiet instrument. Edit: As pointed out by Clayton Young in the Comments, you can also make a particular instrument stand out if there aren’t other things going on in that register, or particular timbres as well, with the most common being french horns, trumpets, violins and several of louder percussion instruments such as the timpani or the various cymbals and gongs. Other textures that aren’t as common include particular percussion instruments like the glockenspiel or the chimes. However, these don’t guarantee that an instrument will stick out, merely that they can in a group. ",
            "date": "Updated June 14, 2019",
            "views": "131",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jaymian Poon",
                    "user_href": "/profile/Jaymian-Poon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Field",
                "href": "/profile/Geoff-Field-2"
            },
            "answer_text": "When playing something with a sharp attack - like most percussion instruments - in synchronism with instruments with a more gentle attack (such as most wind or string instruments), it takes a lot of attention to keep the instruments sounding together. This is even more important when there are instruments that “speak” slowly such as tubas. ",
            "date": "Answered February 23, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}