{
    "title": "What was it like to be a young adult in the 70s? - Quora",
    "tags": [
        "Nostalgia",
        "Young Adults",
        "1970s",
        "The High School Experience",
        "Teenagers and Teenage Years",
        "History",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debra Harrison",
                "href": "/profile/Debra-Harrison-49"
            },
            "answer_text": "It was GREAT! It was stimulating, interesting and full of freethinking concepts and social change. Remember, this was just following the riots and civil rights protests of the 1960s. I graduated from high school in 1971 and spent the 1970s in college and in venturing out into the world to find my way. At college, I met and befriended some of the first black folks I had ever seen having grown up in a very small Southern town. I made some excellent choices and a few questionable ones. I took a break from college and went from a small Arkansas town to San Diego where I became a stripper (exotic dancer) for about a year and a half (here is where the questionable choices comes in - though I do not really regret the experience). I returned to Arkansas and married “the boy next door” to me in an off campus rental I lived in before going to San Diego. We had an open marriage (he dated men and I dated women) that turned out to be much more complex than we originally thought it would be. More of that 1970s free thinking… that upon close inspection was not so free and should have been done with a lot more thinking… My husband and I eventually parted ways amicably. At thirty eight years old, I met and fell in love with a wonderful woman whom I have married and lived happily with for 28 years… ",
            "date": "Answered June 8, 2020",
            "views": "112",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryson Watson",
                    "user_href": "/profile/Bryson-Watson"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Burden",
                "href": "/profile/Michael-Burden-6"
            },
            "answer_text": "I was very interested to read the article which you can read if you access this link :- Brits believe it was better to be young in the 1960s/70s | YouGov It really does seem that we British believe that our young people had it better in the 1960s and 1970s than they do today. As for myself I cannot speak so much for the 1960s, but I was a young adult back in the 1970s, a decade which I am fondly reminded of in the pictures below. Back in the middle of the decade in 1975 I graduated from university at the age of 21.  During the first half of that year I was in my final year as an undergraduate at Nottingham University, studying civil engineering. During my time at university I had spent two three month periods (between my first and second year, and then between my second and final year) in temporary paid employment, in which I gained much valuable experience. And then when I graduated in July 1975, I had no less than five job offers from which I could choose. I started full time employment in the job I chose in September 1975. When I started work I noticed how most of my work colleagues only a year or two older than me, and mainly under 25 years of age, were already married and had bought their own homes, and so were already well on their way towards getting on the “property ladder” and becoming settled in life. By contrast, students today find it much harder to gain temporary paid vacation employment and often are instead employed only as unpaid interns who are happy to work just for the sake of gaining experience in the workplace. Also it is much harder for graduates nowadays to find a well paid job that makes use of their talents, and so they settle for a job that is much lower paid than they had expected and which they could have done without a university education. I know of a family who have a 25 year old daughter who graduated in English a few years ago but now only has a low paid job that is unrelated to her degree. However her sister who is a few years younger than her never went to university, but earns more than she does by working as a waitress in a restaurant. Compared to students in the 1970s whose university tuition fees were paid by the state here in the U.K., students nowadays (apart from in Scotland) have the financial handicap of having to repay their university tuition fees when they secure full time employment, and these are usually almost £30,000. They generally pay these over several years in the form what is effectively a higher rate of income tax. Also of course compared to the 1970s property prices nowadays are so much higher and continue to rise at a faster rate than incomes, which makes it much more difficult for young people to get their foot on the property ladder by saving up a deposit so that they can purchase their first home. Instead of purchasing a home soon after university graduation, as was often the case when I graduated in the 1970s, many graduates nowadays move back in with their parents after they leave university, and it can take them a few years to save up for that deposit. ",
            "date": "Answered June 14, 2020",
            "views": "161",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria N. Kelliher",
                    "user_href": "/profile/Maria-N-Kelliher"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        }
    ]
}