{
    "title": "What’s your favorite album? - Quora",
    "tags": [
        "Music Albums"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pedro Abbade",
                "href": "/profile/Pedro-Abbade"
            },
            "answer_text": "My favorites albums are: Grimes - Art Angels (2015) This album is the reason why I started listening to music seriosuly, especially indie. It is so intense and different, the use of loud guitars and the strange lyrics can be surprisingly enjoyable;  Radiohead - In rainbows (2007) It is a recent discovery. The band covers different genres and intensities, without losing consistency. My favorite track is “All I Need”;  Beach Boys - Pet Sounds (1966) I describe this as the best album in history. This masterpiece (with a terrible cover) is truly immersible and a complete experience. Some tracks have harps or even bicycle bells. “I could try to be big in the eyes of the world; What matters to me is what I could be to just one girl” - That’s not me.  ",
            "date": "Answered March 27, 2020",
            "views": "180",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Acree",
                    "user_href": "/profile/Tim-Acree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Jack",
                "href": "/profile/Todd-Jack"
            },
            "answer_text": "too hard to single one out but for me is the first BOSTON album . for a debut album it is a masterpiece of music. every cut is fantastic. vocals and musicians are a 10. another is the first CARS album. same as BOSTON . masterpiece of music. those guys hit it out of the park. EAGLES HOTEL CALIFORNIA , SAME AS ABOVE, ",
            "date": "Answered March 29, 2020",
            "views": "151",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randy Meyer",
                    "user_href": "/profile/Randy-Meyer-15"
                }
            ]
        }
    ]
}