{
    "title": "What is the best but easiest BTS dance to learn? - Quora",
    "tags": [
        "Learn to Dance",
        "Dance Music",
        "Dance (activity)",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Margaret G",
                "href": "/profile/Margaret-G-40"
            },
            "answer_text": "I am sure, like anything, the answer will vary from person to person. A lot depends on who is answering the question. For example, there would be differences between the opinion of a non dancer versus a dancer… or the opinion of the average fan versus a choreographer. There would be differences between dancers opinions as well, depending on their area of focus. A side observation: I did try to learn Fire myself. I like to dance but I am definitely not a dancer. I can attest that the choreography is hard. Not only for the moves but the for the speed of execution. Whew. It is hard to keep up. I had to start at half speed, then 3/4 speed before attempting full speed. But one dance does not an expert make. Since I am not a dancer, I consulted with a dancer acquaintance who studied ballet but also does kpop covers. She also does choreography for contemporary and ballet. She said that, in her opinion, 21st Century Girls was among the easiest. Next comes GoGo and Boy with Luv. But she indicated that there are elements some may not find easy such as high kicks. She me told me that many would pick Idol or Baepsae as being easy but she felt they were difficult. Not so much because the steps themselves are difficult but that it was difficult to get the right “texture” so that you don’t look awkward. She also acknowledged that there are so many dances that it is hard to answer. One caveat: She is not an avid follower of BTS in particular so she may not be up on all the more recent choreography. Also, she typically learns group dances and not solos. ",
            "date": "Answered October 22, 2020",
            "views": "74",
            "upvotes": " Not for Reproduction "
        },
        {
            "author_info": {
                "name": "Carmen Lin",
                "href": "/profile/Carmen-Lin-29"
            },
            "answer_text": "I don't think there is a best dance in BTS because I think each have their own respective conceits that matches the mood and quality, that is different than others, so it can be just as god as the other in its own way. Although I would say best is subjective according to our preferences and taste in concepts, I would say the easiest is a objective truth, and although it depends on our dating ability, I would say that Go Go, and Dimple, is the easiest from their collection of choreographies because it is only hard from there, and especially topics that are more complex, than the others, may be even more difficult for people are less advanced like me. but I think it would fun to dace to it, without much effort and just have fun with it. there is no specific guidelines to follow, or asking for tons of experience. sometimes it is just abut dancing to the music the way you want to, without really being earnest about mastering it, and just enjoying it in your own terms. I think that’s what dancing is to some people, and I am glad you are trying to explore ways to dance and enjoy BTS dance by starting easy, so you can dance to it, as well but also enjoy without too much pressure and stress, which I think Go Go would be perfect for you. ",
            "date": "Answered October 22, 2020",
            "views": "43",
            "upvotes": " Answer requested by Soomin Lee"
        }
    ]
}