{
    "title": "What were Michael Jackson's favorite songs? - Quora",
    "tags": [
        "Michael Jackson (musician)",
        "Musicians",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bonnie Bennett",
                "href": "/profile/Bonnie-Bennett-6"
            },
            "answer_text": "It might surprise a lot of people that Michael Jacksons favorite music to listen to and sing(around the house)are, respectively, classical and Broadway show tunes. I believe that this was a big part of his attempt to relax as well as be inspired. The first classical music he became enamored with was called “Peter and the Wolf” by Sergei Prokofiev. I remember listening to it as a child and I fell in love with it too. His overall favorite classical musicians were Mozart and Debussy. At his Neverland ranch the only music piped in all over the property was classical and in the book, “Remember The Time”(great read), his former bodyguard shared that the only music Michael wanted to listen to in the car was a classical music station. As with his love of old movies and artists like Michelangelo, Michael appreciated such unique and incredible talent. He used them as inspirations for his own work as well as wanting to share them with others. But Michael also admired current artists such as Justin Timberlake and Beyoncé. When he was “studying” for his own projects(albums, concerts, short films, etc)he would always listen to the newest music of that particular period to get a sense of where he would like his music to go. He was an incredible innovator in his own right but said that-paraphrasing-”you must always study the greats and then make it greater”. In my opinion, he certainly followed through with this, in everything he gave us artistically. So I guess, in conclusion, Michael Jackson loved all music- for different reasons and uses. He had such a great “musical ear” and that is why he was able to create entire, completed songs In His Head and then used his voice to “act out” or interpret them for each instrument. This capability always blows me away no matter how many times I read or talk about it. His human body was truly an instrument, in and of itself. He was made of music so it's no surprise that he would also be in love with so many variations of it. ",
            "date": "Answered January 8, 2017",
            "views": "17",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Debra Nicholson",
                    "user_href": "/profile/Debra-Nicholson-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jor-13"
                },
                {
                    "user_id": "Jess Evans",
                    "user_href": "/profile/Jess-Evans-112"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shashouw-1"
                },
                {
                    "user_id": "Alex Mann",
                    "user_href": "/profile/Alex-Mann-121"
                },
                {
                    "user_id": "Barbara Platt",
                    "user_href": "/profile/Barbara-Platt-2"
                },
                {
                    "user_id": "Joyshree Borborah",
                    "user_href": "/profile/Joyshree-Borborah"
                },
                {
                    "user_id": "Micha Henckel",
                    "user_href": "/profile/Micha-Henckel"
                },
                {
                    "user_id": "Sergio (Checo)",
                    "user_href": "/profile/Sergio-Checo-1"
                },
                {
                    "user_id": "Ashley Hernandez",
                    "user_href": "/profile/Ashley-Hernandez-360"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reidun Saxerud",
                "href": "/profile/Reidun-Saxerud"
            },
            "answer_text": "He loved the Beatles, and often said one of his most favorite songs was “Love is All You Need,” and it’s well-known he adored Charlie Chaplin’s “Smile,” which is why Jermaine sang it at his public memorial, as well as he performed a beautiful cover on HIStory in 1995. He often talked about The Nutcracker Suite and how much he adored the rest of Tchaikovsky’s work, and Debussy, and he mentioned Prelude to an Afternoon of a Faun but I can’t recall anything else he specifically mentioned. Some other things he liked: “Closer” by Nine Inch Nails. He was crazy about The Downward Spiral as a whole album. It was a huge influence on him and you can hear it in “Morphine,” and I believe gave him a big creative push and inspiration for Invincible. Michael’s musical taste was all over the place. He also loved showtunes. There’s a really funny story about the songs he played at Neverland (at the attractions themselves, not the ambiance classical that played throughout the grounds), but it dims in the telling. ",
            "date": "Answered January 5, 2017",
            "views": "12",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Debra Nicholson",
                    "user_href": "/profile/Debra-Nicholson-1"
                },
                {
                    "user_id": "Kosi Onwuamaegbu",
                    "user_href": "/profile/Kosi-Onwuamaegbu"
                },
                {
                    "user_id": "HJ Bee",
                    "user_href": "/profile/HJ-Bee"
                },
                {
                    "user_id": "Despoina Nikolaidou",
                    "user_href": "/profile/Despoina-Nikolaidou"
                },
                {
                    "user_id": "Jocelyn Abenion",
                    "user_href": "/profile/Jocelyn-Abenion"
                },
                {
                    "user_id": "Elisia McPherson",
                    "user_href": "/profile/Elisia-McPherson"
                },
                {
                    "user_id": "Isabel Devia",
                    "user_href": "/profile/Isabel-Devia"
                },
                {
                    "user_id": "Sara Ali",
                    "user_href": "/profile/Sara-Ali-486"
                },
                {
                    "user_id": "Sakhi",
                    "user_href": "/profile/Sakhi-7"
                },
                {
                    "user_id": "Clorus Belafonte",
                    "user_href": "/profile/Clorus-Belafonte"
                }
            ]
        }
    ]
}