{
    "title": "What's Eddie Van Halen really like in person? First hand accounts please.  - Quora",
    "tags": [
        "Eddie Van Halen (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Bailey",
                "href": "/profile/Robin-Bailey-6"
            },
            "answer_text": "I met Eddie 3 times in 1996 and 1997. The first 2 times were when I worked in a bike shop in Santa Monica that was (still is?) next door to his AA meeting place. One day he parked his Porsche on the street behind my truck, and a co-worker said to me “you see that car? That's Jon Bon Jovi’s car. He goes to the AA meetings next door”. I thought “cool” as I've always liked Bon Jovi to a large degree. Then, that same co-worker said to me “you know when I said that was Jon Bon Jovi’s car? Well I meant Eddie Van Halen”. That got my attention real fast, and I looked over at the car just in time to see Eddie jump in and take off. I was bummed that I was that close to meeting him, but no dice. I made a mental note of the time and day that he was there. He left at 11AM on a Monday.” About 2 weeks later I spotted his car again parked behind my truck on the street at the 10:00 hour on a Monday. I was busy with work, so I didn't see him leave. Then a couple of Monday mornings later, I spotted his car parked on the side street of the bike shop. I looked out the 2nd floor window, and he was talking on his phone in the secluded backyard of the AA meeting house, and then walked in through the back door. It was 10:00. That meant that he was probably going to be walking through the back parking lot of the bike shop to get to his car at about 11:00, since it seemed like the meetings started on the hour, every hour. So I positioned myself to be working in the back parking lot at 11:00, helping people get their bikes in or out of their car, and sure enough like clockwork, Eddie came strolling through the lot. I said to him “hi Eddie”. He looked at me as if he was supposed to know me, but then realized that I was just a fan and said hi as he continued to walk. I then said “how's the band?” And he replied “good. We just finished recording 2 new songs with Roth, and we're looking for a singer”. He saw my puzzled look and then said “it was cool and all, but the guy can't sing”. He continued “it took him 2 weeks to do what should've taken him 15 minutes”. I replied “bummer” and he kept walking. This meeting was bittersweet for me: Cool that I met him, but bummed that Roth wasn't permanently back in the band. This all happened in the end of July of 1996. Sammy Hagar announced his departure of the band a month earlier, and the word was out that VH was back with Roth recording 2 new songs. So in reality, he gave me the 411 that they were looking for a new singer about 2 months before Van Halen went public that they had a new singer. The 2nd time I met Eddie was about 6 weeks later in the same bike shop that I worked at. It was about 10:30 or so in the morning, and I was straightening out a display, when I saw someone in the corner of my eye. I turned around and saw him and said “oh hi Ed” as if we were friends. He graciously asked me if I could break a $20 for change for the parking meter, at which time I looked out the front window and saw an Orange early ‘70s Lamborghini parked. I said “sure” and went to the register and gave him change. While I was getting him change, I asked him how the singer search was going. He said “we found one!” and started elaborating that the new guy sings amazing, like he has elephant balls, and best of all, he doesn’t have LSD. I looked at him puzzled when he said LSD, then he clarified “Lead Singer’s Disease.” He then said that he’s fairly well known, but wouldn't say who it was. He then concluded that they were thinking about not revealing who it is and just coming out with the album. Then he was off to his AA Meeting. When he was finished with his meeting, a few of my co-workers and myself came out and met him by his car. He started talking about it and opened the hood and showed off the engine. He also gave us autographs when we asked for them. This was 2 days after Van Halen had gone on the MTV Awards show with Dave and presented an award to Beck. Dave was being Dave in front of the crowd, which made Eddie visibly uncomfortable. But this action of all 4 original members of VH walking onstage together made the whole world think that Dave was back in VH. One of my co-workers asked him “What was up with Dave at the Awards show?” To which Eddie replied I don’t know. the guy’s from another planet”. Eddie has these big headphones on his head, and was listening to an ADAT player, and somebody noticed that the car didn’t have a stereo in it. They asked him why it didn’t, and his reply was, “when you have an engine that sounds like this, you don’t need a stereo. Then he said his goodbyes and left. The 3rd time I met him was when he was doing a signing a few months later at the NAMM Convention in LA. It was cool, but we couldn’t really talk like he did at my workplace. He graciously signed a picture, and I moved on. Those were my 3 times meeting Eddie Van Halen. He was cool. And to turn around and see Eddie trying to get my attention to get change for the meter with no expectation of it being Eddie is a pretty cool moment. One day as a kid, I was listening to his albums, had his posters on my wall, and was going to his sold out concerts, and then 10–15 years later on a different coast, he comes to me to break his bill for the meter. I’ve also met Dave about 6 times, and Michael Anthony once, but those are another story for another time. In retrospect, it turned out that there were 3 singers that week who thought they were the singer of Van Halen shortly before I met Eddie that 2nd time: Dave: Dave just walked out on stage with them at the MTV awards show. Eddie hadn’t told Dave that he was looking for another singer that whole time, but they showed up on stage as if it was an announcement to the world that Dave was back in the band. Gary Cherone: Gary showed up a couple of weeks or so before the awards show and was hanging out in LA and waiting for the band to come back for their MTV appearance. To his knowledge, he was Van Halen’s new singer, and he ended up being the singer for the next album and tour. Mitch Malloy: Mitch was also in town at that time and was told that he was the new singer. However, when he saw that they did the MTV Awards show with Dave, he wrote his letter of resignation, saying that they just made it hard for it to be any other singer besides Dave. He recommended that they do it with Dave, but Eddie wasn’t having it. ",
            "date": "Updated June 28, 2019",
            "views": "469",
            "upvotes": " View 95 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/HDLifter"
                },
                {
                    "user_id": "S",
                    "user_href": "/profile/S-552"
                },
                {
                    "user_id": "Missus Bee",
                    "user_href": "/profile/Missus-Bee-1"
                },
                {
                    "user_id": "Allison Carroll",
                    "user_href": "/profile/Allison-Carroll-4"
                },
                {
                    "user_id": "Stephen Coulter",
                    "user_href": "/profile/Stephen-Coulter-16"
                },
                {
                    "user_id": "Denise Bayer",
                    "user_href": "/profile/Denise-Bayer-3"
                },
                {
                    "user_id": "Rick Cote",
                    "user_href": "/profile/Rick-Cote-12"
                },
                {
                    "user_id": "Ashmede Asgarali",
                    "user_href": "/profile/Ashmede-Asgarali"
                },
                {
                    "user_id": "Joseph Muldoon",
                    "user_href": "/profile/Joseph-Muldoon"
                },
                {
                    "user_id": "Rich Stolte",
                    "user_href": "/profile/Rich-Stolte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Collins",
                "href": "/profile/Greg-Collins-25"
            },
            "answer_text": "It was 1995 and Van Halen played at Rupp Arena the night before in Lexington, KY. The day after the concert Michael Anthony and Eddie came into Louisville to play golf at Valhalla, I was a caddy there at the time. We were down on the practice range and standing next to the putting green and Eddie walks up to me and puts his hand out so I shook his hand and he says “Hi, I’m Eddie Van Halen, and I said “Yeah, I know”, I told him my name and I also said “What happened to the mullet”? (His hair was super short) He said that Valerie made him cut it. lol But he was as humble and down to earth as you or I. I gained a lot of respect for him that day as well as Michael Anthony. Both superstars who didn’t act it. They also had their accountant with them and he was the best. The stories he told us that the band did back in their hay days were priceless. I’ll never forget that day. I was already a Van Valen fan but after that day they became one of my all time favorites. I met a lot of superstars out there but they were probably the coolest ones I’d ever meet. Great day. So to answer your question, Eddie Van Halen is top shelf as well Michael Anthony. To follow up to this story, Michael Anthony hits a putt on No. 1 that was tracking for the hole but came up a little short, Michael Anthony said after his ball dies just short of the hole, “come on Baby”! Another caddy in the group timely chimes out “Finish what you started, I’m incomplete!” to which the whole group comes with “that ain’t the way to treat the broken-hearted, I need some sympathy”! Lol It was the best moment of the day. ",
            "date": "Updated August 29, 2019",
            "views": "106",
            "upvotes": " View 54 Upvoters",
            "upvoters": [
                {
                    "user_id": "S",
                    "user_href": "/profile/S-552"
                },
                {
                    "user_id": "Lisa Murphy-Solarski",
                    "user_href": "/profile/Lisa-Murphy-Solarski"
                },
                {
                    "user_id": "A Guest",
                    "user_href": "/profile/A-Guest-13"
                },
                {
                    "user_id": "Stephen Coulter",
                    "user_href": "/profile/Stephen-Coulter-16"
                },
                {
                    "user_id": "Jonas Jönsson",
                    "user_href": "/profile/Jonas-Jönsson-2"
                },
                {
                    "user_id": "EJ Haub",
                    "user_href": "/profile/EJ-Haub"
                },
                {
                    "user_id": "David Torrey",
                    "user_href": "/profile/David-Torrey-2"
                },
                {
                    "user_id": "Rancid Iodine",
                    "user_href": "/profile/Rancid-Iodine"
                },
                {
                    "user_id": "Jan Alley",
                    "user_href": "/profile/Jan-Alley"
                },
                {
                    "user_id": "Michael Axman",
                    "user_href": "/profile/Michael-Axman"
                }
            ]
        }
    ]
}