{
    "title": "What is the difference between pitch correction and auto tune? - Quora",
    "tags": [
        "Pitch Correction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preet Giuliani",
                "href": "/profile/Preet-Giuliani"
            },
            "answer_text": "PITCH CORRECTION IS DONE MANUALLY BY ANALYSING DEFAULT NOTES SUPPOSED TO BE USED IN A GIVEN SONG WHICH IS RECORDED AS A COVER SONG OR BY ANALYSING NOTES OF A NEWLY COMPOSED SONG AND THEN FIGURING OUT THE MISMATCHING NOTES OR COMBINATION OF NOTES RECORDED IN RECORDING AND THEREAFTER RECTIFYING THE SAME ACCORDING TO ORIGINAL SONG OR PRESCRIBED NOTES PATTERN OF A COMPOSED SONG. WHEREAS AUTOTUNING IS A SIMPLER AND MOREOVER AN AUTOMATED SOFTWARE ORIENTED FEATURE FOUND IN MOST PROGRAMMING SOFTWARES SUCH AS FL STUDIO, CUBASE, GARAGE BAND, LOGIC PRO ETC. WHICH INVOLVES MANNUALLY PREDEFINING OF DESIRED REQUIRED NOTES PATTERN AS A PARAMETER TO THE SYSTEM SOFTWARE AND HENCE THE NOTES OF A SONG ARE REPLACED AS PER USERS INPUT THIS PROCESS (OF VOICE TUNE) IS SIMPLER AND USER FRIENDLY FOR BEGINNERS AND AMATEURS BUT FOR PROFFESSIONAL LEVEL WORK MANUAL PITCH CORRECTION WORK IS A MUST.V ",
            "date": "Answered June 24, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Kris",
                "href": "/profile/Ryan-Kris"
            },
            "answer_text": "These are related audio editing processes. Pitch correction would generally be a manual process. Adjusting musical notes manually of an audio file to the desired pitch or note. Commonly for a vocal track, where the singer has sung some bits slightly sharp or flat. Auto tune is, as the name implies, a more automated process. You generally set the musical key for the tool you are using and the notes in the audio files are adjusted automatically by the plugin software. There are sometimes ‘hard’ and ‘soft’ settings on how much pitch correction can be applied. The hard type settings have become popular themselves in recent years, particularly in RnB and Hip Hop where they have become key vocal effects in a song. ",
            "date": "Answered November 15, 2016",
            "views": "44",
            "upvotes": "0"
        }
    ]
}