{
    "title": "What's better: Burning Man, SXSW, or Coachella? - Quora",
    "tags": [
        "SXSW",
        "Burning Man Culture",
        "Coachella Music Festival",
        "Burning Man",
        "Festivals",
        "Parties and Partying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Denning",
                "href": "/profile/Erik-Denning"
            },
            "answer_text": "Burning Man all the way! Burning Man has a few great things going for it that the other don’t. It’s not a commercial venture. No one is getting rich off of Burning Man. Most of the ticket costs go to Bureau of Land Management fees (a lot!), infrastructure such as lots of porta-potties, paying the, sadly now required, law enforcement and emergency services people, and paying some of the key employees who bust their asses. A lot of money also goes to funding the artists who make those incredible giant things you’ll encounter nowhere but on the playa. Burning man is a break from consumerism. There are no sponsors, ads, trinket stands, or anything to but but reasonably priced ice, coffee, and tea.It’s a real community, with newspapers, a funky post office, radio stations and everybody being cool to each other.Burning Man is participatory. Forget standing passively in giant crowds watching bands. At Burning Man, you encouraged to participate, create, and interact. You’re as important as anything else going on there, if you put in a little effort. You can express yourself radically and not get harassed for it at Burning Man.Ask anyone who has been to Burning Man what they thought of it. It’s like NOTHING else in the world. And don’t believe the sensationalists stories you read about it. Yeah, they’re probably true, but there are MANY aspects that don’t get covered.Burning Man physically takes you away from the default world of traffic, cell phones, shopping, television, and all the other crap that is twisting us the wrong way.The other two events are just a bunch of bands and djs, with continued options to spend a lot of money. is that really the best experience you can find? And if you still want bands and djs, there are plenty of those at Burning Man, too.",
            "date": "Answered September 9, 2016",
            "views": "57",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Pergiel",
                    "user_href": "/profile/Andrew-Pergiel"
                },
                {
                    "user_id": "Javier Gonzales",
                    "user_href": "/profile/Javier-Gonzales"
                },
                {
                    "user_id": "Grace B",
                    "user_href": "/profile/Grace-B-253"
                },
                {
                    "user_id": "Gaylord Mamborafiki",
                    "user_href": "/profile/Gaylord-Mamborafiki"
                },
                {
                    "user_id": "Jacob Powers",
                    "user_href": "/profile/Jacob-Powers-1"
                },
                {
                    "user_id": "Vincent Favereau",
                    "user_href": "/profile/Vincent-Favereau"
                },
                {
                    "user_id": "Jens Kuppe",
                    "user_href": "/profile/Jens-Kuppe-1"
                },
                {
                    "user_id": "Andy Weisner",
                    "user_href": "/profile/Andy-Weisner"
                },
                {
                    "user_id": "Sasha Westerfield",
                    "user_href": "/profile/Sasha-Westerfield"
                },
                {
                    "user_id": "Uroosa Imtiaz",
                    "user_href": "/profile/Uroosa-Imtiaz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Holden",
                "href": "/profile/Michael-Holden"
            },
            "answer_text": "Those events have NOTHING to do with each other. The question might as well read, “which of these the three things is the best? A dodo bird, a lightbulb, or the number zero? Show your work.” there might be overlap in attendees, but that is probably more in your imagination than in actuality. To be clear SXSW is a new media convention. Workie work time! Coachella is a mainstream music festival. Good times. And burning man is an art festival that might kill you, which is convenient for your afterlife because it is located roughly in the pit of hell itself. Assuming that the event does not kill you, it will make you weirder. SXSW will seem like a garden tea party attended by people more into hype than actually doing stuff. And your now former Coachella buddies will start to resemble those geese that they force feed to make pate, what with their waddling their pack behavior and the always looking up at some distant figure/DJ. You will refer to both of these kinds of people as assholes and douche bags, and you will do this while wearing pink and white polkadotted assless chaps with and an eel skin holographic g string. You will not find this ironic or even slightly unusual, you have shit to weld and it's going to happen right now. Never go to burning man. Stick to whatever it is that normal people do, not that I know what that is, in my case the damage is permenant. ",
            "date": "Answered September 8, 2016",
            "views": "55",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amber Stara",
                    "user_href": "/profile/Amber-Stara"
                },
                {
                    "user_id": "Ann Poplick",
                    "user_href": "/profile/Ann-Poplick"
                },
                {
                    "user_id": "Char Zvolanek",
                    "user_href": "/profile/Char-Zvolanek"
                },
                {
                    "user_id": "Jennifer St.Antoine",
                    "user_href": "/profile/Jennifer-St-Antoine"
                },
                {
                    "user_id": "R. Blaine Whittle",
                    "user_href": "/profile/R-Blaine-Whittle"
                },
                {
                    "user_id": "Andrew Pergiel",
                    "user_href": "/profile/Andrew-Pergiel"
                },
                {
                    "user_id": "Katherine Catmull",
                    "user_href": "/profile/Katherine-Catmull"
                },
                {
                    "user_id": "Nandi Dube",
                    "user_href": "/profile/Nandi-Dube"
                },
                {
                    "user_id": "Gaylord Mamborafiki",
                    "user_href": "/profile/Gaylord-Mamborafiki"
                },
                {
                    "user_id": "Nataliia Kuchai",
                    "user_href": "/profile/Nataliia-Kuchai-1"
                }
            ]
        }
    ]
}