{
    "title": "What are the qualities in Lata Mangeshkar? - Quora",
    "tags": [
        "Lata Mangeshkar (singer)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jam",
                "href": "/profile/Jam-155"
            },
            "answer_text": "Much like Amitabh, it would be iron-clad discipline and fixation on her work, a great work ethic, a lack of diva-like unprofessional behaviour at work, and most of all, career longevity. It would be my guess that if Mohd Rafi were alive as singing to this day, such question would undoubtedly be raised about him too (although, to be fair, the fact that he had such a stellar career in such a short duration of time makes him pretty amazing). People often call her the nightingale of Bollywood, an incarnation of the goddess of music, etc, and while such accolades certainly have merit, they are more a reflection of the public perception about her music and her public persona. At her end, I imagine, she just went about her work with great diligence and soldiered on for over 5–6 decades, the first half of which was a time when being a working woman and associated with films were considered signs of ill-repute. So, she is a great example of a professional working woman from a time when such a species did not exist. Lastly, I would like to add that as my exposure to classical and other music from around the world increases, I do realize that Lata’s voice is pretty distinctive, and in her later years, has grown a bit too reedy. This can make her later music not everyone’s cup of tea, even if he/she grew up on Bwood, etc. I loved her voice the most when it was young and supple. Now, since the 80s, I have refrained from listening to her music but do admire her professionalism and dignified bearing immensely. And also, her sense of filial piety (something she shares with Amitabh Bachchan). Lastly, I do think that her sister Asha shares these qualities. In addition to the challenges she’s shared with Lata, Asha also had to deal with the pain and indignity of a broken marriage, fending for a young family by herself, and now, in her elder years, the heartbreak of losing her husband and grown-up daughter. I shudder to think how hard it must be for Asha to wake up each morning and just engage with her life. I respect her immensely for having braved these enormous odds. ",
            "date": "Answered July 26, 2018",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dreamz",
                    "user_href": "/profile/Dreamz-16"
                },
                {
                    "user_id": "Pushpendra Kumar",
                    "user_href": "/profile/Pushpendra-Kumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seshachalapathi Rao",
                "href": "/profile/Seshachalapathi-Rao"
            },
            "answer_text": "She is the most reputed singer of Bollywood for years and together with her sister Asha Bhonsle she ruled the field as no other artiste could do in any field. The essential quality was her outstanding skill and the voice. She could sing for any actress and even when is aged she could sing for a young actress and there was no trace of age in her voice. Personally, she was found dependable by most music directors. Though some would say that she did not allow other singers to grow, there may not be so much truth in it as nobody can stop a superior talent in a competitive industry such as films for a long run. ",
            "date": "Answered July 26, 2018",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Venkat Ajay Pamuri",
                    "user_href": "/profile/Venkat-Ajay-Pamuri"
                }
            ]
        }
    ]
}