{
    "title": "What are your favorite vinyl records you own? - Quora",
    "tags": [
        "Vinyl Records",
        "Records",
        "Audio",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Piazza",
                "href": "/profile/James-Piazza-2"
            },
            "answer_text": "Records have incredible stories behind them.  They are so much more than 40 minute capsules of sound.  Below are a few of my favorites, and their incredible stories. For admittedly sentimental reasons, I’ve accumulated over 40 albums and box sets of Sesame Street / Muppet / other Jim Henson LPs in a shameless attempt to reclaim my childhood.  No great story here, just pure nostalgia.   My late 50s – early 70s electronic music collection began (as it did for many listeners) when I picked up Carlos’ Switched-On Bach.  The original release, known as the “Constipated Bach cover” was quickly recalled by the label for fear that it might upset the classical community.   This was the album that really secured the synthesizer as a viable musical instrument and not just a noise box.    The KLF are legendary for many of their anarchistic anti-art escapades as the K-Foundation, but Chill Out and Space are absolutely outstanding music milestones in their own right.  Chill Out is the sound of driving across the American Midwest after a weekend rave. The VG+ copy I ordered was destroyed at US customs, but the seller generously sent me his mint original disc as a replacement!     Space was a collaboration between Dr. Alex Paterson and Jimmy Cauty, the original line-up of The Orb and was released on KLF Communications.   The first official Orb release soon followed – The Orb’s Adventures Beyond the Ultraworld (best-known for the hit single, “Little Fluffy Clouds”) and pioneered the sounds of the chill out genre which had begun with their DJ sets in Paul Oakenfold's Land of Oz night in the club Heaven. Together, these records track the timeline of the birth of 90s ambient house.   Tom Waits absolutely must be mentioned in this favorites list, but picking a favorite Tom Waits LP is like asking a parent to pick their favorite child.  I had the outrageous fortune of walking into a record shop right after the owner brought in a near-complete discography of Tom Waits’ music. Each disc had been purchased upon its release, played once, and shelved by the owner.  I didn’t hesitate for a second and bought them all on the spot. But, like most listeners who discovered Tom in the 90s (more than 20 years into his career), Raindogs was my initiation into his weirdly wonderful music.     Also issued in the 90s was Low’s Things We Lost in the Fire – a milestone of the slowcore genre.  As an added bonus to the album’s hauntingly beautiful music, the band hand-wrote their lyrics in a 12” spiral and had the words etched onto side D of the 2LP set.   The album is a treasure for fans of the band.    Another classic of the decade is Flaming Lips’ Soft Bulletin.  Universally acclaimed as their finest effort, the record is brilliant from start to finish.  This LP includes a bonus disc of otherwise-unreleased tracks from the Bulletin sessions.   Also as a listener who began to refine his musical taste into the mid-90s, I developed a great appreciation for Beck Hansen's more melancholic and mature works, particularly Mutations and the much-acclaimed Sea Change.      And one more milestone of 90s music - this one from Mr. Elliott Smith.  I was lucky yet again when I came upon a sealed mint copy of Either/Or in a thrift store for $1.99.  I’m still wrestling with the decision of whether or not to open this insane prize.   Fans of Elliott Smith will likely dig another favorite I was lucky enough to find - a pink vinyl edition of Nick Drake's Pink Moon.     But perhaps my single greatest punch-me-in-the-face-good-luck LP is an Italian bootleg of Pink Floyd – The Wall Performed Live at Earls Court London 6.8.80.  I found the mint disc with a 12x12 color insert sneakily tucked into another album’s jacket at a yard sale and bought it for fifty cents.  The etching in the run-out groove helped me track down the disc at Page on floydboots.com – excellent audio quality and a rarity of 4/4 stars.  Outstanding!   I love avant-garde 20th century music, so I hunted high and low to secure a copy of Moondog’s self-titled 1969 release on Columbia.   How can you pass up beautiful contemporary classical music composed and performed by a blind viking dressed as the Norse god, Odin?   In line with my penchant for “characters,” I also love the first three Doctor John “the Night Tripper” LPs.  Gris Gris is pure bliss – swampy New Orleans gravel-throated-bongo-pounding anthems from the late 60s.   For a crazy tie-in – shoegaze masters, Spiritualized are renowned for their 70-minute neo-psychedelic space rock opus, Ladies and Gentlemen We Are Floating in Space.  Originally released in a limited edition blister pack foil with each CD packaged to look like prescription medication, the album culminates with the 17-minute “Cop Shoot Cop” with none other than Doctor John on the piano.  This is a gem on vinyl.   Another must-have on my list isn’t so much for the audio, but for the incredible cult-status of the thing.  I have a copy of the “Six-of-One” Prisoner Appreciation Society soundtrack LPs by Ron Grainer (the same man credited to the BBC Radiophonic Workshop’s theme for Doctor Who.) In 1967 Patrick McGoohan’s 17-episode man-vs-society epic sparked an international fascination which lives on to this day, with a fan club that reunites in Portmeirion each year in full costume to celebrate the series. The LP includes a die cut prison bar cover mimicking the closing credits, a fold-out map of the Village, a book, and poster.   I also enjoy pop artists’ adventures beyond their regular territory, like Lou Reed’s Metal Machine Music.   64 minutes of unyielding noise, it was hailed by critics for being bold and avant-garde.  In reality, the record was a grudging fulfillment of a contractual obligation to Lou Reed’s label.  He was essentially giving RCA the finger, but the public ate it up.  Still, for the right listener, it is meditative noise music, perhaps proving that Lou Reed couldn’t even make a bad record when he tried.   Another strange noise record for a pop artist is George Harrison’s Electronic Sound.   In November 1968 George asked Bernie Krause to demonstrate the synthesizer for him.  Unknown to Krause, without his permission and expressly against his wishes, a recording was made of that demonstration and an unauthorized version was released by Harrison titled \"No Time Or Space\" – the entire second side of the Electronic Sound LP released the following year.  I keep it filed beside Beaver & Krause’s The Nonesuch Guide to Electronic Music (also from 1968) and Perrey and Kingsley’s The In Sound from Way Out! (1966) – all essential early electronic LPs.       But perhaps the first great milestone in proto-electronic music is Louis and Bebe Barron's 1956 score to Forbidden Planet.  The sounds were so revolutionary that the industry refused to acknowledge the record as music, instead calling it a work of \"electronic tonalities.\"  Here is the 2012 Record Store Day edition.   One other electroacoustic record makes my favorites list – The 3LP Manhattan Research set of the collected recordings of Raymond Scott.  Pressed this in the Netherlands by Basta Records, this collection compiles the wacky futurama sounds produced by Scott for commercial jingles and radio themes throughout the 1960s like, “Don’t Beat Your Wife Every Night... chew Wrigleys.”   Like with Tom Waits, it’s hard to pick just one Miles Davis album as a favorite.  Kind of Blue is the obvious choice, followed by Bitches Brew, but just last month Music on Vinyl (another great label in the Netherlands) released a 6LP box set of Miles’ four Fillmore East and West performances.  This set is the complete and uncut concerts, available for the very first time on vinyl.  These performances were culturally significant as they marked the Fillmore’s rock audiences’ first exposure to jazz.     Easily one of my favorite artists and producers of the last 40 years – Brian Eno pioneered the ambient genre with his 1982 album, Music for Airports.   From the Wikipedia:  The inspiration for Discreet Music, No Pussyfooting, and Airports began when Eno was left bed-ridden in a hospital by an auto accident and was given an album of eighteenth-century harp music.  After struggling to put the record on the turntable and returning to bed, he realised that the volume was turned down (toward the threshold of inaudibility) but he lacked the strength to get up from the bed again and turn it up.  Eno said this experience taught him a new way to perceive music as part of the ambience of the environment just as the color of the light and the sound of the rain were parts of that ambience.   In 2010, The Black Dog produced a culmination of over 200 hours of field recording - a contemporary response to Eno’s LP titled, Music for Real Airports.  My copy is hand-numbered as the 16th set produced in a short run by Soma Records.   Another ambient milestone is Vangelis’ score to the film, Blade Runner.  Astonishingly it took 12 years for a proper official release of the 1982 soundtrack, and still another NINETEEN years after that before an official recording was available on vinyl.  This is the 2013 limited edition red vinyl audiophile release, and it sounds beautiful.   With over 20 LPs in my Parliament Funkadelic collection, one disc stands out as an absolute favorite. Their first record – Osmium (1970) was pressed as a picture disc in Italy on Earmark Records in 2003 in a limited run.  I picked up a copy from a gent in Argentina and brought it up to George Clinton after a show in my town.  He took off his sunglasses and grinned at the disc, and passed it around the bus to have everyone sign it for me.  I know PFunk autographs are no great achievement, but it was a wonderful memory in my live music experience.    Another classic in the realm of funk was the highly political Last Poets’ self-titled record from 1970.  All of rap and hip-hop traces back to this incredible free jazz spoken-word LP.     Entirely left-field and a milestone of avant-garde rock – Captain Beefheart’s Trout Mask Replica is a Dadaist cacophony of noise recorded by the Captain’s Magic Band.  Don Van Vliet made the band rehearse the record endlessly for 8 months until they could perform the audio convulsion with absolute precision.   Some albums remind you that packaging isn’t nearly what it used to be.  I found one such treasure behind the counter at a Half Priced Books for $7 – a 1957 box set of Cyril Ritchard reading Alice’s Adventures in Wonderland. The four LPs came with a clothbound facsimile hardcover of the original publication, and the cover had never been opened.  A spoken-word favorite.   And check out the outstanding packaging on this un-circulated gift item from American Gramophone, collecting the first four volumes of Mannheim Steamroller's Fresh Aire.  Velvet-bound and numbered with a large pewter engraved seal, each disc is housed in a silver foil sleeve.   Another artist with incredible attention to packaging detail is Lemon Jelly.  The band was also a highly-acclaimed graphic design team known as Airside.  Even their bootlegs were beautiful.  The “Soft / Rock” single was a baby blue 7” disc packaged in a screen-printed sleeve cut from a pair of Levi’s 501 jeans with a flavored condom tucked into the pocket.  “Rolled / Oats” was a gold spray-painted and screen-printed single in a hessian “burlap” sack.  And check out the beautiful packaging for their full-length Lost Horizons and Lemonjelly.ky LPs.       One more artist-and-graphic-design band ranks on my favorites list – Underworld and their design team, Tomato.  Their 1994 album, Dubnobasswithmyheadman was the first music I ever heard which wasn’t top-40 radio rock, and the album’s packaging directly inspired my decision to pursue a degree in graphic design.     And here is the 7” picture disc of their humble beginnings as “Freur” – originally an unpronounceable squiggle with the synth pop hit, “Doot Doot.”    Finally, last but not least – the limited edition Disintegration Loops 9LP + 5CD + DVD + coffee table book set by William Basinski.  Basinski was capturing the decay of old tape loops on a recorder in his Manhattan flat on September 11th 2001 when the towers were hit.  He rushed to the roof and filmed the billowing smoke for an hour and set the slow death of the loops as the score to 9/11.  On the 10th anniversary of the attacks, Basinski's work was performed at the Metropolitan Museum of Art as a live orchestration.  The performances were released exclusively as bonus material on this limited edition set. A milestone for both process music and for our culture.   ",
            "date": "Answered July 26, 2014",
            "views": "29",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eman Caindec",
                    "user_href": "/profile/Eman-Caindec-1"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                },
                {
                    "user_id": "Tomas Estocin",
                    "user_href": "/profile/Tomas-Estocin-2"
                },
                {
                    "user_id": "Dina Gilmour",
                    "user_href": "/profile/Dina-Gilmour"
                },
                {
                    "user_id": "José Araújo",
                    "user_href": "/profile/José-Araújo-19"
                },
                {
                    "user_id": "Siiri Pappinen",
                    "user_href": "/profile/Siiri-Pappinen-1"
                },
                {
                    "user_id": "Mark Lubinsky",
                    "user_href": "/profile/Mark-Lubinsky-1"
                },
                {
                    "user_id": "Monitors R. Pettyandpartisan",
                    "user_href": "/profile/Monitors-R-Pettyandpartisan"
                },
                {
                    "user_id": "Robert Betke",
                    "user_href": "/profile/Robert-Betke"
                },
                {
                    "user_id": "Thomas Green",
                    "user_href": "/profile/Thomas-Green-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Welch",
                "href": "/profile/Rodney-Welch"
            },
            "answer_text": "First of all, thanks for asking a question I am delighted to answer. I love vinyl because I grew up with it, and the sound cannot be improved upon. Also, records are distinct. Everyone who listens to an MP3 has the exact same experience as everyone else, but every single vinyl is as fragile and vulnerable as you and me. They get scratched, they skip, they develop a hiss -- and these defects may only make them more endearing. Why? Because they are physical products that have aged along with you. When I listen to an album, I think not only of all the good memories associated with the music but with that very object. When I listen to, say, my vinyl of Led Zeppelin's In Through the Out Door, I have the strange comfort of knowing it's the exact same vinyl I listened to during my favorite college romance. It was with me then, it is with me now and, as the years pass, there just aren't that many things you can say that about, are there? So here are my favorites with a hopefully interesting sentence or two as to what makes it so memorable. Bob Dylan, Blonde on Blonde. The greatest rock album ever made. Heard it many times on tape before ordering it through the mail. Still play it every month or so.  Fleetwood Mac, Rumours. In the summer of 1977, I didn't have a car. I walked two miles in the middle of the summer to buy this record. Who does that now? No one. Bruce Springsteen, Darkness on the Edge of Town. I saved up enough at my summer job at a packing plant to buy a cheap Sears stereo. It broke on about the 89th day of the 90 day warranty, which they grudgingly honored. Celebrated by buying this album, which was the first thing I played on it. Definitely related to the song \"Factory.\" Gateway to being a lifelong and very forgiving Springsteen fan. Neil Young, Decade. A three-record greatest hits set that I played non-stop at full volume for most of 1979.  Velvet Underground, 1969. First VU record I bought. My brother was getting married and I didn't have anything better to do, so I bought this record and listened to \"Heroin\" on headphones while my future sister-in-law was getting fitted for her bridal gown. Best live album ever. The Clash, London Calling. Never did a record receive more hyperbolic praise from every critic in the world. Never was it more justified. Tom Waits, Blue Valentine. Bought it for 25 cents sometime in the early 1980s, long after it came out, when stores were hastily dumping all their vinyl. It made me a fan for life. The Rolling Stones, Big Hits: High Tide and Green Grass. Here is a perfect example of what albums do better than any other format: packaging. Double gatefold comes with huge oversize pictures of the band in their prime. The record, of course, is great too: the creme de la creme of the early years. Love, Forever Changes. Depending on my mood, I often say this masterpiece of sentimental hippie whimsy is my favorite album. Nothing like it in the world. When my daughter was a teenager and started digging through my vinyl collection, she latched on to this one. A mutual fave of ours ever since. Captain Beefheart & His Magic Band, Trout Mask Replica. Not exactly a mutual fave with the daughter -- although I personally love it-- but one with a long history between us. I had the CD, and we'd argue whether this was a great or terrible album as I drove her to school. Then she took it and loaned it to her history teacher and that was the last I ever saw it. A few Christmases ago she bought me the vinyl, and it was the first record I played on my new turntable. Unique doesn't begin to describe it. Kind of the record you'd get if Robert Johnson gave Tristan Tzara some bad whiskey and decided to teach him to play blues guitar. ",
            "date": "Answered July 23, 2014",
            "views": "21",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Lubinsky",
                    "user_href": "/profile/Mark-Lubinsky-1"
                },
                {
                    "user_id": "Monitors R. Pettyandpartisan",
                    "user_href": "/profile/Monitors-R-Pettyandpartisan"
                },
                {
                    "user_id": "Florian Baptist Gypser",
                    "user_href": "/profile/Florian-Baptist-Gypser"
                },
                {
                    "user_id": "Sam Seely",
                    "user_href": "/profile/Sam-Seely"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                },
                {
                    "user_id": "Kenny Tai",
                    "user_href": "/profile/Kenny-Tai"
                },
                {
                    "user_id": "Doug Dingus",
                    "user_href": "/profile/Doug-Dingus"
                },
                {
                    "user_id": "Anne Luher",
                    "user_href": "/profile/Anne-Luher"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                },
                {
                    "user_id": "Shankar Iyer",
                    "user_href": "/profile/Shankar-Iyer-5"
                }
            ]
        }
    ]
}