{
    "title": "What causes rage issues? - Quora",
    "tags": [
        "Rage (emotion)",
        "Behavioral Psychology",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikki Griffiths",
                "href": "/profile/Nikki-Griffiths-3"
            },
            "answer_text": "This is a million dollar question, as there are so many possible reasons that someone may have issues with rage. Before looking introspectively about this, you need to establish whether this is simply a way of letting off steam occasionally, or whether this impacting your life negatively. There are many psychological reasons and diagnoses that can cause the response of rage, and whilst these can be useful to help you get some answers, ultimately, whether you have a diagnosis or not, the strategies you use will be the same, with or without the diagnosis.  There are many different types of anger disorders and there is lots of information about these on the internet. A few of the main ones are Intermittent Explosive Disorder, Narcicistic Personality Disorder (Narcicistic rage), Bipolar and Depression. Assuming that your anger is outside of a normal emotional scope, you may want to look at these types of anger to see which category you fall in to. Chronic anger: this is usually prolonged, can impact the immune system and be the cause of other mental disorders Passive anger, which doesn’t always come across as anger and can be difficult to identify Overwhelmed anger, which is caused by life demands that are too much for an individual to cope with Self-inflicted anger, which is directed toward the self and may be caused by feelings of guilt Judgmental anger, which is directed toward others and may come with feelings of resentment Volatile anger, which involves sometimes-spontaneous bouts of excessive or violent anger My advice would be to set up an appointment with a psychologist, who can assess you properly. It may be that there's just something that you need to talk through/ work through. Good luck. ",
            "date": "Answered December 13, 2015",
            "views": "541",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miranda Duckworth",
                    "user_href": "/profile/Miranda-Duckworth"
                },
                {
                    "user_id": "Bavita Raghunath",
                    "user_href": "/profile/Bavita-Raghunath"
                },
                {
                    "user_id": "Gina Amira",
                    "user_href": "/profile/Gina-Amira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Devine",
                "href": "/profile/Jennifer-Devine-4"
            },
            "answer_text": "Repressed anger causes rage.  Emotions or experiences not entirely dealt with and settled in ones mind/body/spirit causes rage. Victims of violence often experience rage after the event.  CBT can help these people, as can meditation and yoga.  Rage can be a useful motivator if directed well. ",
            "date": "Answered December 19, 2015",
            "views": "200",
            "upvotes": "0"
        }
    ]
}