{
    "title": "What makes the Renaissance different from the Baroque period? - Quora",
    "tags": [
        "Baroque Period",
        "Baroque",
        "The Renaissance"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-56"
            },
            "answer_text": "This is a far more difficult question to answer that the extremely superficial and trivial answers by others would suggest. The first question is, to which of the arts do you refer? The Renaissance, as an historical period, runs from the 1330s to the later 17th century; symbolically I like to bracket it with letters of Petrarch in the 1330s as a beginning of the intellectual movememt, and 1687, the first edition of Newton’s Principia, with the triumph of scientific rationalism, because one very important aspect of the Renaissance is as a transitional period between the Middle Ages and the Enlightenment and the beginning of modern history. Furthermore, it subsumes at least five interrelated intellectual, religious, scientific, political, and artistic movements, each with its own distinct characteristics. Leaving aside everything but the artistic movement, we further must make a distinction between the visual arts and music (and, for that matter, literature, which presents its own challenges in periodization). For the visual arts, I like the framework that Wylie Sypher developed in four stages of Renaissance style—Renaissance, Mannerist, Baroque, and Late Baroque. The Baroque style is a Renaissance style, and the Baroque period is part of the Renaissance. Without going into all the subtleties of Sypher’s argument (which does fit to a fair degree with Wölfflin’s schema, although it is considerably broader), one can immediately see difference between the intitial Renaissance style and the Baroque style. As a excellent example of a mature Renaissance style, take Perugino’s Delivery Of The Keys, 1481, in the Sistine Chapel:  Key elements? The pictorial frame, with a clear vanishing point perspective (right in the door of the building at the dead center in the background) is focused on a single dramatic moment: Christ delivering the keys of heaven to St. Peter (the foundation for the authority of the Pope), in a literal form, not the metaphorical form in Matthew 16: 18–19: 18 And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. 19 And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven. It’s highly symmetric and tightly controlled; all of the energy is contained within the frame. It is both realistic in detail, and symbolic, with multiple saints and two other incidents from the life of Christ in the middle distance, the Tribute Money and the stoning of Christ. Now, the issue with the classical Renaissance style is that the energy wants to go in different directions. In the Mannerist phase, we see distortions of figures and of perspective. In Baroque painting, the energy explodes outside of the frame into an enormous volume of space, as with Gaulli’s Triumph Of The Name Of Jesus, 1660s, which explodes over a frescoed ceiling:  The genie is, so to speak, out of the bottle. In architecture, one can use as examples the classical restraint of Brunelleschi’s Pazzi Chapel, 1443:   Or Palladio’s St. Giorgio Maggiore, completed in 1599:   All instances of highly contained energy I found some remarks in Pevsner’s Outline Of Western Architecture that are very apt descriptions of the essence of Renaissance architecture. One is a quote from Alberti about how beauty lies in the exact maintenance proportions, in his design for the Palazzo Rucellai in Florence, first Pevsner and then Alberti. “The windows of the Palazzo Rucellai are bipartite as in the other palaces, but an architrave separates the main rectangle from the two round heads. The relation of height to width in the rectangular parts of the windows is equal to the relation of height to width in the bays. Thus the position of every detail seems to be determined. No shifting is possible. In this lies, according to Alberti’s theoretical writings, the very essence of beauty, which he defines as ‘the harmony and concord of all the parts achieved in such a manner that nothing could be added or taken away or altered except for the worse.” If you read how Michelangelo persuaded multiple popes not to allow any deviations from his designs (the anecdote is in Vasari’s Life Of Michelangelo), you see much the same mentality. Pevsner summarizes: “In the Renaissance style the building is an aesthetic whole constituting of self-sufficient parts. A composition in the flat or in space is arrived at by grouping such parts according to a static system.” The applicability to painting is obvious. Compare with a masterpiece of German Baroque, Vierzehnheigen, a pilgrimage church dedicated to the 14 Holy Helper saints, third quarter of the 18th century. Its relatively restrained facade:  belies the explosive energy of the interior:   If you can to a degree ignore the decoration, which is a significant part of the affect, note how the space itself tends to expand outward, rather than rest upon itself. Vierzehnheiligen could serve as a good example of baroque sculpture. Let me contrast a prototypical example of Renaissance sculpture, the David of Michelangelo, 1504:  Self-contained, all the energy is in the figure. Contrast this Asam’s extraordinary Assumption group of c. 1720:  The Blessed Virgin, overcome by astonishment, is borne to a heaven of putti and puffy clouds by angels while observers on the ground, also overcome with astonishment, gesticulate wildly. Energy explodes out from the group. As much as Bernini’s St. Theresa, this exemplifies Baroque sculpture. Pevsner notes that the most extreme example of Baroque architecture and sculpture are in Spain and southern Germany and Austria. This is of course very cursory, but it gives some sense of how classical Renaissance visual art and Baroque art differ, and how styles do not always fit comfortably in simple time boundaries. When we come to music, the same scheme does not work. The evolution of musical style does not follow the same kind of pattern. There is a lot of nonsense that one hears about the distinction between Renaissance and baroque music—one of the chief being that baroque music is dominated by counterpoint. Every composer writes counterpoint, which is simply the harmonization of two different melodies played simultaneously. The origins of counterpoint in Western music goes well back of the Middle Ages, and the apex of counterpoint is not in Baroque period, but in the Renaissance. Nothing Bach wrote, for instance, approaches the intricacy and scale of the large-scale polyphonic works of the Renaissance, like Striggio’s 40 voice Ecce Beatam Lucem or Tallis’s answer, the 40 voice Spem In Alium, both mid-16th century:   Or, for sheer ingenuity , Desprez’s 24 voice Qui Habitat (Psalm 90), c. 1520 with 4 interlocking 6 voice canons:  The fact is, Bach was old-fashioned in his day. Some characteristics of Renaissance music: polyphony and counterpoint; instrumental ensembles tended to be small, although there are a number of large scale choral works like the three above. Renaissance music emphasizes a smooth texture often with very rich harmonies.The first large-scale polyphonic mass was Brumel’s Missa Et Ecce Terrae Motus, sometime called the Earthquake Mass, in 12 voices. (The cantus firmus which supplies the title is from an Easter antiphon.) Here is a recording of the Gloria:  Secular works tended to be small in scale—dances, chansons, madrigals. pieces for small ensembles like the broken consort. There is also music for solo instruments; Byrd, for instance, wrote a great deal of keyboard music. As you can see, this doesn’t really fit the paradigm of Renaissance art exactly; the large scale polyphonic works are however somewhat comparable to Baroque architecture. In part, this may be because we experience both arts in time, music by sitting through performances and architecture by walking around and inside building through space. Wikipedia’s summary isn’t bad: Renaissance music - Wikipedia The term “Baroque” applied to music is quite recent; it started to becomes standard, for no particularly good reason, in 1940s, simply, I think, because the period 1600–1750, the usual markers for Baroque music, correspond to the high points of Baroque art. Since this is a long post already, I might as well quote Wikipedia on the etymology of “Baroque” as applied to music: “The term \"baroque\" is generally used by music historians to describe a broad range of styles from a wide geographic region, mostly in Europe, composed over a period of approximately 150 years.[1] Although it was long thought that the word as a critical term was first applied to architecture, in fact it appears earlier in reference to music, in an anonymous, satirical review of the première in October 1733 of Rameau's Hippolyte et Aricie, printed in the Mercure de France in May 1734. The critic implied that the novelty in this opera was \"du barocque\", complaining that the music lacked coherent melody, was filled with unremitting dissonances, constantly changed key and meter, and speedily ran through every compositional device.[3] Jean-Jacques Rousseau, who was a musician and composer as well as philosopher, wrote in 1768 in the Encyclopédie: \"Baroque music is that in which the harmony is confused, and loaded with modulations and dissonances. The singing is harsh and unnatural, the intonation difficult, and the movement limited. It appears that term comes from the word 'baroco' used by logicians.\" [4] Rousseau was referring to the philosophical term baroco, in use since the 13th century to describe a type of elaborate and, for some, unnecessarily complicated academic argument.[5][6] The systematic application by historians of the term \"baroque\" to music of this period is a relatively recent development. In 1919, Curt Sachs became the first to apply the five characteristics of Heinrich Wölfflin's theory of the Baroque systematically to music.[7] Critics were quick to question the attempt to transpose Wölfflin's categories to music, however, and in the second quarter of the 20th century independent attempts were made by Manfred Bukofzer (in Germany and, after his immigration, in America) and by Suzanne Clercx-Lejeune (in Belgium) to use autonomous, technical analysis rather than comparative abstractions, in order to avoid the adaptation of theories based on the plastic arts and literature to music. All of these efforts resulted in appreciable disagreement about time boundaries of the period, especially concerning when it began. In English the term acquired currency only in the 1940s, in the writings of Bukofzer and Paul Henry Lang. [1] As late as 1960, there was still considerable dispute in academic circles, particularly in France and Britain, whether it was meaningful to lump together music as diverse as that of Jacopo Peri, Domenico Scarlatti, and Johann Sebastian Bach under a single rubric. Nevertheless, the term has become widely used and accepted for this broad range of music.” Adding to this confusion is the fact that in many respects Bach is more like a Renaissance composer in technique than a Baroque one. In terms of Baroque style, you can take as an example a little cantata by J. S. Bach’s first cousin once removed father-in-law which is far more Baroque in style than J. S. Bach’s work often is, the splendid Es Erhub Sich Ein Streit, for the feast of St. Michael the Archangel:  There are a few key elements of Baroque style in music that help to differentiate from the Renaissance. The first is the principle of concertato, or contrast. The second is emotive display as one finds in the madrigal. Both are fundamentally dramatic principles; you begin to see both around 1600 or so in opera—the first great innovation of the Baroque period—in dramatic and emotive madrigals, and in the way the style influences what is still the primary function of music at this time, sacred music. You can see it in the madrigals of Gesualdo and in works like a setting of the psalm Beatus Vir by Monteverdi:  Note the similarities to a secular madrigal by the same composer, Zefirio Torna.  One should note that this is a different type of emotionality than one would find in Tchaikovsky or Chopin; extraverted, rather than introverted. It is not an exaggeration to call Baroque style theatrical. Concertato contrasts similar melody and harmony in differing groups of instruments and voices. It is different from the similar principle of concerto, not in the sense of a work for ensemble and solo, but in the sense of a concerto grosso, which contrasts similar melody and harmony in similar groups of instruments; the concerto grosso is perhaps the single most important development of the late 17th century. The technique of cori spezzati, separated choirs, first developed by Adrian Willaert at St. Mark’s in Venice in the late 16th century and perfected by the Gabrielis, is another aspect of concertato. Here’s an example, a Gabrieli motet for Pentecost, Hodie Completi Sunt, late 16th century:  And, for good measure, Deus Qui Beatum Marcum:  And Praetorius’ 19-voice In Dulci Jubilo, a bit later in the 17th century:  Biber’s Missa Saisburgensis and associated motet Plaudite Tympana in 53 vocal and instrumental parts—one of the most sublime things in the history of music—from 1682 take the style about as far as it can go. This is the motet:  Older forms in newer styles are common. Variations are one of the oldest forms in Western music. There are many sets of variations on the Spanish tune “La follia” in Baroque music; here is Corelli’s 12th Violin sonata (just scroll to 1:59 for it)  And here it is as transcribed by Geminiani as a concerto grosso:  As an example in the later baroque of these principles, I’ll close with one little bit of Handel, one of the most dramatic things he ever wrote, the chorus “He Gave Them Hailstones For Rain” from Israel In Egypt:  You could summarize the significant difference between Renaissance and Baroque style in music in a way that somewhat parallels painting, sculpture, and architecture by saying that Renaissance music is architectural, and Baroque music, theatrical. As true as most observations in civilized life. ",
            "date": "Answered August 30, 2020",
            "views": "145",
            "upvotes": " Answer requested by Rachelle Mendoza"
        },
        {
            "author_info": {
                "name": "Monty Mason",
                "href": "/profile/Monty-Mason-2"
            },
            "answer_text": "The comments by Hill and Phillips are certainly correct. All the arts, science and religion were hide bound in Medieval times. The gloves came off (but not quickly) during the Renaissance period. Then the Baroque doubled down on the Renaissance. So far so good… if you could recognize it. However, if I didn’t know when an art work was done, I’d have hard time knowing which period must have produced it. This seems to say that I’m not sophisticated or knowledgeable. I plead guilty. But here is my shabby defense: About *&%$# years ago, when TV was black and white, I used to watch a program called “What in the World”, (which should have been called “Stump the Experts”). Art objects of all sorts would be displayed to a panel of, you guessed it, experts. Each would address questions such as: “Who did it? When? What’s it worth? No, you can’t touch it!” After watching and listening to each expert opine on the object, the correct description would be revealed. The camera came in for a close up. Printed on a label affixed to the bottom or back was the answer. Some were cheap plastic reproductions. Some were fake paintings. Some were genuine and on loan from museums. The experts were wrong about half the time! And, of course, that was the fun. So, let’s suppose you memorize the dates of the Renaissance and the Baroque periods. Suppose you memorize the cultural, religious, scientific, musical and representational art descriptions that college classes in each period would embrace. Then what? For me, as artistic as a mud fence, I’d be no better off. I’d still want to know when it was done. Still, here’s my suggested approach: Learn the usual dates and descriptions. Then start haunting museums and exhibits. Get some “coffee table” art books. In short, become your own expert. Learn all the distinctions without differences. But be sure you enjoy it. If you don’t, it’ll be a slog. Oh, “One more thing,” (said Lt. Colombo). Avoid being a panelist on a reprise of “What in the World.” ",
            "date": "Answered August 27, 2020",
            "views": "33",
            "upvotes": "0"
        }
    ]
}