{
    "title": "What is the song Photograph by Ed Sheeran about? - Quora",
    "tags": [
        "Ed Sheeran (musician)",
        "Song Meanings",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Adams",
                "href": "/profile/Kate-Adams-38"
            },
            "answer_text": "Well let's take a look at the lyrics. Loving can hurt, loving can hurt sometimes But it's the only thing that I know When it gets hard, you know it can get hard sometimes It is the only thing that makes us feel alive We keep this love in a photograph We made these memories for ourselves Where our eyes are never closing Hearts are never broken And time's forever frozen still So you can keep me Inside the pocket of your ripped jeans Holding me closer 'til our eyes meet You won't ever be alone, wait for me to come home Loving can heal, loving can mend your soul And it's the only thing that I know, know I swear it will get easier, Remember that with every piece of you Hm, and it's the only thing we take with us when we die Hm, we keep this love in this photograph We made these memories for ourselves Where our eyes are never closing Hearts were never broken And time's forever frozen still So you can keep me Inside the pocket of your ripped jeans Holding me closer 'til our eyes meet You won't ever be alone And if you hurt me That's okay baby, only words bleed Inside these pages you just hold me And I won't ever let you go Wait for me to come home Wait for me to come home Wait for me to come home Wait for me to come home You can fit me Inside the necklace you got when you were sixteen Next to your heartbeat where I should be Keep it deep within your soul And if you hurt me Well, that's okay baby, only words bleed Inside these pages you just hold me And I won't ever let you go When I'm away, I will remember how you kissed me Under the lamppost back on Sixth street Hearing you whisper through the phone, \"Wait for me to come home.\" I think it is about love (obviously) and expressing how in a picture of the two people in love, their love is frozen and eternal in that picture, until that picture is destroyed. So I think he is saying the keep that picture of us in our perfect moment of love with you, close to your heart to never let go. That while I'm away, you still will have my love with you if you keep that photograph. Right now, we may fight sometimes and we may hurt each other while in love, but the photograph is a memory and proof of when things are best with us and how our love is pure and all we need. No matter what we go through, Inwant you to keep that picture and remember that my love and our love is still here, forever shown in that picture. Thanks for asking this question, I didn't realize until now just how romantic and deep that song is. I knew before it was romantic, but I hadn’t scrutinized the lyrics until now. I think I have a new favorite song! ",
            "date": "Answered May 17, 2017",
            "views": "18",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neeraj Awagan",
                    "user_href": "/profile/Neeraj-Awagan"
                },
                {
                    "user_id": "Rumki Goldar",
                    "user_href": "/profile/Rumki-Goldar"
                },
                {
                    "user_id": "Prabhat Sharma",
                    "user_href": "/profile/Prabhat-Sharma-278"
                },
                {
                    "user_id": "Utsav Shukla",
                    "user_href": "/profile/Utsav-Shukla-3"
                },
                {
                    "user_id": "Beanflush",
                    "user_href": "/profile/Beanflush"
                },
                {
                    "user_id": "John Price",
                    "user_href": "/profile/John-Price-262"
                },
                {
                    "user_id": "Shreyansh Singh",
                    "user_href": "/profile/Shreyansh-Singh-91"
                },
                {
                    "user_id": "Kekeke Kpop",
                    "user_href": "/profile/Kekeke-Kpop"
                },
                {
                    "user_id": "Santa Amaya",
                    "user_href": "/profile/Santa-Amaya"
                },
                {
                    "user_id": "Poornank Ojha",
                    "user_href": "/profile/Poornank-Ojha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pooja Prasad",
                "href": "/profile/Pooja-Prasad-161"
            },
            "answer_text": "Photograph A song that taught us  Memories are immortal irrespective of good or bad, Sometime it hurts but that's the only thing makes us feel alive,It's hard but heal by time, A place where you can be happy forever. A photograph that holds a story which can never be deleted . We can fight or can hurt each other but photograph is the proof that we had the best with us . But now their love is only locked only in photograph \"When I'm away, I will remember how you kissed me,Under the lamppost back on Sixth streetHearing you whisper through the phone, Wait for me to come home\" this really hit hard ♥️ ",
            "date": "Answered October 11, 2020",
            "views": "501",
            "upvotes": "0"
        }
    ]
}