{
    "title": "What can we learn from classical music? - Quora",
    "tags": [
        "Classical Composers",
        "Contemporary Classical Music",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vincent Novara",
                "href": "/profile/Vincent-Novara"
            },
            "answer_text": "That’s the problem that frankly I've become annoyed with. People are constantly complicating classical music. They’re so hung up on classical form and making music unique with and making their music so atonal that it’s no longer is music. That’s why i like this question. You see, the question is, “What can classical music teach you?”. lets look back at the great composers of the 18th and 19th centuries. they took very simple yet beautiful melodies, and through harmonies and repetition, they create masterpieces. Take beethoven’s 5th symphony, an iconic piece that’s bound to send chills down your spine, but when you take it a part for what it really it, it kind of seems comical and painfully simple. It’s two different notes being played over and over and over and over again, but it is how he develops his melody with those two seemingly simple notes that is ingenious. He layers harmonies and melodies and more melodies on top of each other until the orchestra explodes in immense power, with every instrument in unison. Beethoven composed for orchestra like it was one instrument. His music was not annoying or atonal in any way. It was simple and melodic, yet it didn't lack dissidents and power. Classical music teaches us that simplicity is key and that through repetition and development, beautiful melody can be achieved. ",
            "date": "Answered January 14, 2017",
            "views": "985",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Duggan",
                    "user_href": "/profile/Michael-Duggan-16"
                },
                {
                    "user_id": "Nathan Qi",
                    "user_href": "/profile/Nathan-Qi-2"
                },
                {
                    "user_id": "Andrew Orihuela",
                    "user_href": "/profile/Andrew-Orihuela"
                },
                {
                    "user_id": "Frank Wilcox",
                    "user_href": "/profile/Frank-Wilcox-9"
                },
                {
                    "user_id": "Bill Miller",
                    "user_href": "/profile/Bill-Miller-144"
                },
                {
                    "user_id": "Eddelson Bravo",
                    "user_href": "/profile/Eddelson-Bravo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catherine Velazquez",
                "href": "/profile/Catherine-Velazquez-3"
            },
            "answer_text": "Everything. Classical music captures the full spectrum of human emotion. According to Johannes Brahms, a single piece among classical music does just that. \"On one stave, for a small instrument, the man [Bach] writes a whole world of the \"On one stave, for a small instrument, the man [Bach] writes a whole world of the deepest thoughts and most powerful feelings. If I imagined that I could have created, even conceived the piece, I am quite certain that the excess of excitement and earth-shattering experience would have driven me out of my mind.” Here, he is referring to Bach's Chaconne for Unaccompanied Violin in D Minor. Sometimes, we're not even aware of our own inner workings. If you really listen to what the music is saying, you will be in touch with your own humanity and soul. ",
            "date": "Answered February 9, 2019",
            "views": "481",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Duggan",
                    "user_href": "/profile/Michael-Duggan-16"
                },
                {
                    "user_id": "Andrew Orihuela",
                    "user_href": "/profile/Andrew-Orihuela"
                },
                {
                    "user_id": "Frank Wilcox",
                    "user_href": "/profile/Frank-Wilcox-9"
                }
            ]
        }
    ]
}