{
    "title": "What is the most toxic thing you did as a fan? - Quora",
    "tags": [
        "Toxic",
        "BLACKPINK",
        "Toxic People",
        "Fans and Supporters",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deborah Duran",
                "href": "/profile/Deborah-Duran-10"
            },
            "answer_text": "I do not think is toxic but I used to defend BTS back in 2017 (I was new to their fandom) whenever other fans would throw them shade and hate. Now I just scroll past the hate lmao, I got used to it and don’t care anymore. I would also occasionally read fanfiction. Some people are okay with them, but now I think fanfiction is quite toxic cause they reinforce the delusional behavior, and many of them romanticize violence/mental health issues or sexualize the boys. Other than that, I think I’ve been quite a good fan. It’s the first time I’ve ever fangirled over an artist. ",
            "date": "Answered July 12, 2020",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amaria Harris",
                    "user_href": "/profile/Amaria-Harris-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "I DrAw",
                "href": "/profile/I-DrAw-6"
            },
            "answer_text": "I never really did anything toxic I think the worst things I did was cringe about the “HE/SHE IS MINE! “ fangirls/boys and get defensive whenever someone insulted me on a rp group chat. One person called me a little b**** and I got really defensive over it and i told them that they were being mean and I didn't like it (I was 9 at the time) they actually got removed from the amino which was sad since we had made up and became pretty good friends. ",
            "date": "Answered July 20, 2020",
            "views": "91",
            "upvotes": "0"
        }
    ]
}