{
    "title": "What song has the lyrics 'I find it very very easy to be true'? - Quora",
    "tags": [
        "Country Music",
        "Song Lyrics",
        "Song Identification",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diane Sanders",
                "href": "/profile/Diane-Sanders-27"
            },
            "answer_text": "The song is I Walk the Line by Johnny Cash. I keep a close watch on this heart of mineI keep my eyes wide open all the timeI keep the ends out for the tie that bindsBecause you're mine, I walk the line I find it very, very easy to be trueI find myself alone when each day is throughYes, I'll admit that I'm a fool for you Because you're mine, I walk the lineBecause you're mine, I walk the line You've got a way to keep me on your sideYou give me cause for love that I can't hideFor you I know I'd even try to turn the tide Because you're mine, I walk the lineBecause you're mine, I walk the lineOh, because you're mine, I walk the lineBecause you're mine, I walk the lineBecause you're mine, I walk the line Source: LyricFind Songwriter: Johnny Cash ",
            "date": "Updated March 2, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Zibailo",
                "href": "/profile/Christopher-Zibailo-1"
            },
            "answer_text": "Well, if I do a DuckDuckGo search of the internet for that phrase I see it in Johnny Cash’s “I Walk The Line” as the first line of the second verse. I find it very, very easy to be trueI find myself alone when each day is throughYes, I'll admit that I'm a fool for youBecause you're mine, I walk the line ",
            "date": "Answered February 17, 2020",
            "views": "351",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heather Michelle",
                    "user_href": "/profile/Heather-Michelle-154"
                },
                {
                    "user_id": "Maria Patricia",
                    "user_href": "/profile/Maria-Patricia-22"
                },
                {
                    "user_id": "Steven Robinson",
                    "user_href": "/profile/Steven-Robinson-45"
                }
            ]
        }
    ]
}