{
    "title": "What is the procedure for selling a song to a music company ? - Quora",
    "tags": [
        "Record Labels",
        "Music Industry",
        "Sales",
        "Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darrell Ellis",
                "href": "/profile/Darrell-Ellis-3"
            },
            "answer_text": "Working with a publisber is your best ber. True 20 years ago and still the same today. Trkue is most guys think they know publishing amd actually habe no vlue how it really work. As as arrist submittimg I've written the followimg below. I would highly recommend packaging your so g as you would be prese ting any other product. Today's market is much different then 15 yrs ago. Labels what to know what makes you different.Keep in mind that as much as they may lime your music, they are investing and expect a return on that investment. Here are a few tips, there be others that can provide info I may miss:1. A damn good bio2. Social following3. Mix and mastered product (Yes mastering still matters)5. Are you currently performing and where6. Good photos And if at all possible have your management or attorney do your submission. Years ago while working a deal with Warner, they would not even discuss a deal unless through my attorneys. I'm fairly certain that hasn't changed. Keep things simple and professional. No matter how good you think your music is there a a 1000 more in the same line from all over the world.There may be others with better insight. Im am speaking from my own experiences over the years.D ",
            "date": "Answered July 12, 2017",
            "views": "658",
            "upvotes": " Answer requested by Mario Romillo II"
        },
        {
            "author_info": {
                "name": "Michael Tedstone",
                "href": "/profile/Michael-Tedstone"
            },
            "answer_text": "You need a music publisher to pitch your songs to labels and artists. The best way to get a music publisher is to write a load of quality songs that evoke the current songs that are doing well - or perhaps you could associate with current artists that are doing well. After that, target some publishers.. find out who works there, their email address and send them an email with a short, to the point message with a link to a SoundCloud playlist with the songs. Once you find a publisher willing to pitch your songs, they'll send it to labels etc and hopefully someone will bite. You can also go down the route of music libraries. Your song/s will be put on an album of other songs in a similar style, and it'll be advertised to TV production companies etc who might use your song on a TV show or advert and you will split the royalties with the library music publisher. ",
            "date": "Answered July 12, 2017",
            "views": "707",
            "upvotes": " Answer requested by Mario Romillo II"
        }
    ]
}