{
    "title": "What’s unique to k-pop? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Selisa.Janssens-Vibes",
                "href": "/profile/Selisa-Janssens-Vibes"
            },
            "answer_text": "thanks A2A!!!:3 Well kpop is ofcourse Korean and exists mostly out of groups and in USA (pop) are it more solo artists. Heres the thing Kpop has groups with each its area and vibes and thats what makes the kpop industry so intresting,as u hear they have hiphop-rnb-electro-rock-metal etc.. as style of music and so does Pop (American music)but kpop groups has Visual,Vocals,dancers and rapper so in each kpop song with the full group u will hear a rap part and that doesnt have the pop industry since there are almost no groups.Some kpop artists write there own songs and some dont,albums are bigger and consts out of pictures and lyrics and a photcard and sometimes a poster and so does some album songs have a story where the members sing solos to make it one part. Albums  As you can see this is a album of NCT and thats with cover and all,picture book and cd and a photocard.Well NCT has much sub-units and this album has all the sub-unit songs in it so its one big album.  This is a BTS album box and has on each album a letter S-E-L-F They Always have a story in every MV they shoot with some messages to a new song or has a good massage to the listeners and thats why BTS is pretty known for its MVs and Songs since theres Always a message (what makes the group diffrent) Industry Its also kpop idols had to be 4 years (starts somewhere at a 10–15 year old age)a trainee to acually get into the kpop world and lets say make it true to be a idol so they also follow a diet,some need surgery and being a idol is no joke bc u get treated diffrently than others (depents to each copany).Its a hard world when u enter it and a huge rollercoaster for your emotions.Much training for your voice and much training for the dances,you have to dance each day for hours and have to watch your food alot and if youre famous you have to tour with that all in so they are VERY buisy. Plot Theres much diffrence between pop and kpop and thats why its diffrent (XD) Hope this helped you!! ———-S.J———— ",
            "date": "Answered May 19, 2019",
            "views": "715",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elisa Janssens",
                    "user_href": "/profile/Elisa-Janssens-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vanessa Chao",
                "href": "/profile/Vanessa-Chao-2"
            },
            "answer_text": "Update 2: After stopping resisting the idea of EXP Edition being considered a K-pop group, I suddenly gain a whole new perspective on K-pop and become much more open-minded about it. Seriously, any pop music performed by artists signed to and managed by Korean entertainment companies is K-pop. I guess I’d been brainwashed into thinking K-pop can only mean one thing—its “music idol industry” lol. And quite honestly no one knows how long the “Korean music idol industry” will continue to dominate K-pop. Still, I look forward to what it has to offer in the future! :D EXP Edition (I’m not a fan but they really got me thinking about what K-pop is! Kudos for the efforts to follow their dreams! ^ ^)  My ultimate definition of K-pop:K-pop, in short, is any pop music performed by artists signed to and managed by Korean entertainment companies. It is best known for its mass production of pop music that combines: a rigorous trainee systempretty Asian idols with the ability to look cute and sexy at the same timeversatile groups in which every idol is assigned at least one role (e.g., leader, vocalist, rapper, dancer, or visual)super catchy songs with addictive beats and choruses and repeated simple English words (or phrases)amazingly synchronized choreography and memorable, easy-to-learn dance movesglamorous and trendy fashion styleshigh-quality and visually appealing music videossubtle East Asain cultural concpets in muisc, dance moves, and stylescolorful (pun intended) cheering and support culturecustomized fanservicemany many variety show appearances/(for some idols) occasional starring roles in dramas (or even movies), andgreat marketing strategies such as prolific use of social media!My original answer:I think there are two main things that really set K-pop apart from other music genres—the trainee system and young-looking Asian idols who are made to look as pretty as possible in front of the camera. Some of them are naturally good-looking but because of the impossibly high standard, most of them have to achieve the “K-pop-idol kind of prettiness” either through heavy makeup or plastic surgery. Also, they are often put on an extreme diet to ensure skinny appearance on screen. This is especially true of female idols. :( As for the musical styles and dance routines, both are heavily influenced by Western pop music and incorporate elements from hip hop, R&B, rock, etc. Except the language, there is nothing distinctly Korean. Some K-pop groups even have songs in other languages and these without a doubt still belong to K-pop music. I would say K-pop is like “the upgraded packaging” of Western pop music’s idea of boy bands and girl groups. But this is just my opinion. Many K-pop idols are talented in their own unique ways. :) Update 1:Come to think of it, J-pop also has a trainee system. And good-looking idols are definitely not new in Asia’s pop music industry. When I first submitted my answer, I was mainly focusing on the predominant features of K-pop that Western music doesn’t have. I also didn’t discuss the things in K-pop (or in East Asian pop culture for that matter) that are rarely seen or not fully developed in Western pop culture. But I don’t have time to elaborate too much now. So here I succinctly present my concluding thoughts: What makes K-pop so different is that it is the only music genre that solely, amply and of course wonderfully represents the combination of— a rigorous trainee systempretty Asian idolsversatile groups in which every idol is assigned at least one role (e.g., leader, vocalist, rapper, dancer, or visual)super catchy songsamazingly synchronized choreographyglamorous fashion styleshigh-quality and visually appealing music videoscolorful (pun intended) cheering and support culturecustomized fanservice, andmany many variety show appearances/(for some idols) occasional starring roles in dramas.In order (for countries where such combination is unheard-of) to successfully reproduce K-pop, all of the above-mentioned components need to be included (in addition to great marketing strategies!). P.S. I know it is PSY who brought global attention to K-pop. But I think he is a very special case and the only performing artist in K-pop who can make up lack of good looks with charisma and talent. And there is no denying that a fairly small number of non-K-pop-group-esque performing artists exist in Korea. But honestly they do not make K-pop stand out from other music genres such as C-pop and J-pop. In other words, when people talk about K-pop, nothing else but groups like these come to mind: BTS (my bias K-pop group ^_^)          TWICE (I watch their videos for Tzuyu. :D)  BIGBANG  2NE1  Girls' Generation a.k.a. SNSD  Rain (Solo artists like him, in my opinion, are essentially one-person K-pop groups and I truly mean it as a compliment.)  f(x) (The first and only K-pop album I ever bought is their “Electric Shock”. ;D)  Wonder Girls (Their song “Nobody” got me into K-pop~~)  ",
            "date": "Updated February 5, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mahathi Pemma",
                    "user_href": "/profile/Mahathi-Pemma"
                }
            ]
        }
    ]
}