{
    "title": "What are the differences between modern and traditional dance? - Quora",
    "tags": [
        "Sinigang",
        "Modern Clothing",
        "Modern Farming and Traditional Farming Differences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raphael Alexis",
                "href": "/profile/Raphael-Alexis"
            },
            "answer_text": "What we call ‘traditional’ dance is often ‘old’ styles, that did not evolve with the times. This is often coupled to ‘old’ styles of music that those dances were ‘traditionally’ danced to. The truth is that most ‘modern’ dance styles evolved out of those very same ‘traditional’ styles. Personally I prefer styles that evolve - but if that means staying the same for a long time, it just means they were solid to begin with. That said, the reason I prefer ‘modern’ dance styles, is that they tend to be more open to fusion and improvisation, which I both enjoy very much. Switch fluently between Tango and Lambada in the same piece? Count me in. Mix Cuban and L.A. styles in Salsa? Hell yeah! Throw some hip-hop moves into my Swing routine? You bet! So, there you have it. I prefer ‘modern’ dance styles. But I also love ‘traditional’ styles, as long as they’re fun to dance, and I can appreciate the music. ",
            "date": "Answered June 26, 2019",
            "views": "54",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Faith Prieto",
                    "user_href": "/profile/Faith-Prieto"
                },
                {
                    "user_id": "Amakor Justina",
                    "user_href": "/profile/Amakor-Justina"
                },
                {
                    "user_id": "Michael Olowu",
                    "user_href": "/profile/Michael-Olowu-2"
                },
                {
                    "user_id": "Robert C Coward",
                    "user_href": "/profile/Robert-C-Coward"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allyson Way",
                "href": "/profile/Allyson-Way"
            },
            "answer_text": "I have looked at the answer you received from Raphael Alexis, but your question is cryptic to someone who is a professional dancer, yet does not work in social dances at all. Modern dance can be considered a style of dance which was a post ballet reaction that often has been considered beginning by the Isadora Duncan era influences and leading on to the post-war German Mary Wigwam and Kurt Jooss, then extending to Martha Graham and Merce Cunningham techniques in the 50s in the USA, Traditional dances can also mean ethnic and folk dances from various societies which have been passed on through the generations. Are you asking for personal preferences to which style is prefered in general, or do you mean (as Mr Alexis has stated), that you want to know personal preferences for different influences for social dances? ",
            "date": "Answered June 26, 2019",
            "views": "2",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dalmas Omolade",
                    "user_href": "/profile/Dalmas-Omolade"
                },
                {
                    "user_id": "Juliet Cunningham",
                    "user_href": "/profile/Juliet-Cunningham-1"
                }
            ]
        }
    ]
}