{
    "title": "What are some motivating songs for students? - Quora",
    "tags": [
        "Motivational Songs",
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Inspiration",
        "Music Recommendations",
        "Students",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Privi Agrawal",
                "href": "/profile/Privi-Agrawal"
            },
            "answer_text": "Music is an amazing thing. The right inspiring lyrics, or motivational songs can give you a kick in the backside; provides a quick pick me up to motivate you to accomplish your goals; or just a reminder about appreciating the beauty of the world that we live in and provides that little lift that we occasionally need. Here is a list of 28 inspiring songs that will help you to stay the course and go for it. 1. Stronger (What Doesn’t Kill You) – Kelly Clarkson 2. Don’t Stop Believing – Journey 3. Ain’t No Mountain High Enough – Marvin Gaye & Tammi Terrell 4. Save the World – Swedish House Mafia “Who’s gonna save the world tonight? Who’s gonna bring you back to life?”. It’s down to you, motivate yourself to do what it takes to bring some activity back. 5. Skyscraper – Demi Lovato “Go on and try to tear me down. I will be rising from the ground”. If you are seeing obstacles blocking you, you can circumvent them and build back up. Life has it’s ups and downs and it’s up to you to build strong foundations so that you can continually build your own skyscrapers. 6. Get up Stand up – Bob Marley “Get up, stand up: don’t give up the fight!”. It’s not over yet. 7. You’re Beautiful – James Blunt 8. It’s My Life – Bon Jovi 9. Beautiful – Christina Aguilera “You’re beautiful. No matter what they say”. There’s something beautiful for someone in almost everything. Don’t focus on the negatives, focus on the positives. 10. Tubthumping – Chumbawamba “I get knocked down, But I get up again, You’re never going to keep me down”. Persistence is important, take those setbacks into your stride. You’ve probably heard this inspirational song on countless sports shows. That’s how effective it is. 11. You Gotta Be – Des Ree “Listen as your day unfolds. Challenge what the future holds”. Set your goals for the day and accomplish that challenge 12. We are the Champions – Queen “And bad mistakes I’ve made a few I’ve had my share of sand kicked in my face – But I’ve come through”. We’ve all had bad days where everything feels like its on top of you, but think about how you’ve traversed through it and how you have learned from those lessons. 13. Not Afraid – Eminem 14. Walking on Sunshine – Katrina and the Waves This is just a great feel-good song. 15. Harder, Better, Faster – Daft Punk “Work it harder, make it better, do it faster, makes us stronger;”. Working smart increases your output. Focus on doing it smart. 16. Human – The Killers “Close your eyes. Clear your heart”. We’re all human, sometimes we need to take a bit of time to reset so that we can move on. 17. Lust For Life – Iggy Pop “I’m worth a million in prizes”. Whatever motivates you, find that vigor that makes you feel like a million dollars. 18. Remember the Name – Fort Minor “This is ten percent luck, twenty percent skill, Fifteen percent concentrated power of will ,Five percent pleasure, fifty percent pain”. Focus and work hard, it’s not going to be plain sailing, but if you want to reach your destination, you need determination. 19. Imagine – John Lennon “You, you may say I’m a dreamer, but I’m not the only one”. Figure out what your dream is and strive for it. 20. Perfect Day – Lou Reed “Just a perfect day, problems all left alone”. Take a break from your problems and take some time to enjoy yourself. 21. Teardrop – Massive Attack “Most faithful mirror. Fearless on my breath”. Take a look at yourself and see if you’re heading in the direction you want. Make course corrections without fear. 22. Don’t Worry be Happy – Bobby McFerrin “In every life we have some trouble. But when you worry, you make it double”. Bobby McFerrin’s inspirational 80’s song reminds us that everyone is worried about something, and we need to take time out to have some happy time. 23. Always Look on the Bright Side of Life – Monty Python “If life seems jolly rotten, There’s something you’ve forgotten!”. Focus on the positives. 24. Here Comes the Sun – The Beatles 25. Beautiful Day – U2 “It’s a beautiful day. Don’t let it get away”. Celebrate your victories and achievements, no matter how small. 26. Lovely Day – Bill Withers “When the day that lies ahead of me. Seems impossible to face”. Life sometimes seems impossible, but there is always a way, you just haven’t though of it yet. 27. Stand By Me ~ Ben E. King “No I won’t be afraid. Oh I won’t be afraid”. That challenge may seem daunting, but don’t be afraid it. We have to overcome our fears and comfort zones to progress. 28. What a Wonderful World – Louis Armstrong “The colors of the rainbow so pretty in the sky”. Life is not in black and white, there is so much color out there to keep motivated for life. This song is terrifyingly inspirational when you consider how long this song has lasted. ",
            "date": "Answered April 8, 2018",
            "views": "164",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "I Am Venus",
                    "user_href": "/profile/I-Am-Venus"
                },
                {
                    "user_id": "Manavi Mishra",
                    "user_href": "/profile/Manavi-Mishra-5"
                },
                {
                    "user_id": "Vivek Chauhan",
                    "user_href": "/profile/Vivek-Chauhan-85"
                },
                {
                    "user_id": "Harshali Bansal",
                    "user_href": "/profile/Harshali-Bansal"
                },
                {
                    "user_id": "Sindhu Vemuru",
                    "user_href": "/profile/Sindhu-Vemuru"
                },
                {
                    "user_id": "Surbhi Garg",
                    "user_href": "/profile/Surbhi-Garg-145"
                },
                {
                    "user_id": "Praveen Agrawal",
                    "user_href": "/profile/Praveen-Agrawal-157"
                },
                {
                    "user_id": "Pawan Agrawal",
                    "user_href": "/profile/Pawan-Agrawal-200"
                },
                {
                    "user_id": "Ekta Agrawal",
                    "user_href": "/profile/Ekta-Agrawal-92"
                },
                {
                    "user_id": "Bhagwan Das Bansal",
                    "user_href": "/profile/Bhagwan-Das-Bansal"
                },
                {
                    "user_id": "Anup Bara",
                    "user_href": "/profile/Anup-Bara-4"
                },
                {
                    "user_id": "Abhishek Thakur",
                    "user_href": "/profile/Abhishek-Thakur-866"
                },
                {
                    "user_id": "Asha Agrawal",
                    "user_href": "/profile/Asha-Agrawal-37"
                },
                {
                    "user_id": "Ayushi garg",
                    "user_href": "/profile/Ayushi-garg-181"
                },
                {
                    "user_id": "Ayushi Garg",
                    "user_href": "/profile/Ayushi-Garg-179"
                },
                {
                    "user_id": "Ayush Singh",
                    "user_href": "/profile/Ayush-Singh-1150"
                },
                {
                    "user_id": "Praveen Agrawal",
                    "user_href": "/profile/Praveen-Agrawal-133"
                },
                {
                    "user_id": "Manju Agrawal",
                    "user_href": "/profile/Manju-Agrawal-32"
                },
                {
                    "user_id": "Nitesh Bansal",
                    "user_href": "/profile/Nitesh-Bansal-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajni Sah",
                "href": "/profile/Rajni-Sah-1"
            },
            "answer_text": "I am a student too. Like everyone else there are times when I feel low and about to give up on what I had previously taken. But then there's this girl Calysta Bevier, whose courageous and beautiful voice always encourages me to keep trying. Originally sung by Rachel Platten, Fight Song , is a must listen for the much needed motivation at any point u r down. Calys has sung this song for Audition for AGT. But what makes it special is her own fight against Cancer at an early age of 14-15 yrs. Her story with the lyrics of song, the feel of it makes it the best motivational song according to me. There's been many such moments when this particular song has helped me be strong. And as far as question is concerned ‘ Some Motivation Song ‘ , its always the ONE which has the power to do its magic if it at all has to. ",
            "date": "Answered May 2, 2017",
            "views": "33",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rupam Sinha",
                    "user_href": "/profile/Rupam-Sinha-9"
                },
                {
                    "user_id": "Hemanth Srinivas",
                    "user_href": "/profile/Hemanth-Srinivas-1"
                }
            ]
        }
    ]
}