{
    "title": "What was Queen's last album? - Quora",
    "tags": [
        "Queen (band)",
        "Music Albums",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brandon Montgomery",
                "href": "/profile/Brandon-Montgomery-7"
            },
            "answer_text": "This question actually has two answers.  In February 1991 Queen released Innuendo.The record was sort of return to Queen’s roots - A hard rock sound with complicated yet playful compositions, lots of effects, and an epic single even longer than Bohemian Rhapsody. It was their best selling album in the US in seven years. The record had some hang-ups, however; The band wanted to release the album in time for Christmas season 1990 but had to slow down their pace just a bit to accommodate Mercury’s health. Speaking of his health, rumors that he now had AIDS had begun to spread leading up the album’s recording. Mercury refused to comment on the matter, privately telling people he didn’t want Queen’s records to sell out of “sympathy.” Nonetheless, reports swamped his home and wherever they thought he may be (read: Recording studio) in a chance to harass an answer out of him. This lead the band to flying out to Switzerland to record the album. Around the time sessions for Innuendo was wrapping up, Mercury decided to record vocals for songs which the rest of the band was supposed to complete in the event of his death, having vowed to “keep working until I fucking drop.” He ended up recording vocals when his health allowed for it up until around May of that same year. He died on the 24th of November, 1991 - about nine months after the release of Innuendo.  Now it was up to the band (minus Mercury, of course) to go into the study and make songs out of the vocal takes he had left behind. The problem was that they didn’t have nearly enough to make an album out of (about three of them were made into songs.) Together, with producer David Richards, the band assembled various vocal takes Mercury had recorded for solo records or, really just whatever hadn’t been released on a Queen album already, and constructed different songs around them with new instrumentation they had written. That album was eventually released in late 1995 as Made in Heaven.  So which one was technically Queen’s last album? If you’re picky, you could argue that Made in Heaven isn’t technically a “proper Queen studio album” and more of a Frankenstein monster. If you’re not as picky you can argue that 3/4ths of Queen recording new music is still a new Queen album, even if the other 1/4th of the band’s contributions to the album come from sources never intended to be used in this way - And what’s more, Mercury had explicitly told the band to basically do something like this after his death. Which side is right? Which album is Queen’s “final” album? That’s for you to decide. ",
            "date": "Updated April 13, 2020",
            "views": "55",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Lang",
                    "user_href": "/profile/Robert-Lang-125"
                },
                {
                    "user_id": "Karen Krutzsch",
                    "user_href": "/profile/Karen-Krutzsch"
                },
                {
                    "user_id": "Petya Gancheva",
                    "user_href": "/profile/Petya-Gancheva-1"
                },
                {
                    "user_id": "Joyce Task",
                    "user_href": "/profile/Joyce-Task"
                },
                {
                    "user_id": "Nancy Lytle",
                    "user_href": "/profile/Nancy-Lytle-4"
                },
                {
                    "user_id": "Liz Camerone",
                    "user_href": "/profile/Liz-Camerone"
                },
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                },
                {
                    "user_id": "Connie Todd",
                    "user_href": "/profile/Connie-Todd-4"
                },
                {
                    "user_id": "Mark Watson",
                    "user_href": "/profile/Mark-Watson-295"
                },
                {
                    "user_id": "Dawn Diliberto",
                    "user_href": "/profile/Dawn-Diliberto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maud Trvn",
                "href": "/profile/Maud-Trvn"
            },
            "answer_text": "The last queen album with Freddie alive is innuendo, then you have made In heaven which is with Freddie but he was dead when the album was released. Queen released several albums after Freddie’s death but it’s up to you to decide if you consider them queen albums or no ",
            "date": "Answered March 26, 2020",
            "views": "144",
            "upvotes": "0"
        }
    ]
}