{
    "title": "What is your favourite love song? - Quora",
    "tags": [
        "Grunge",
        "Love Songs",
        "English Songs",
        "Song Lyrics",
        "Love Life Advice",
        "Love",
        "Music",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parul Chaudhari",
                "href": "/profile/Parul-Chaudhari"
            },
            "answer_text": "Felix Jaehn - Ainâ\u0080\u0099t Nobody (Loves Me Better) ft. Jasmine Thompson  Lyrics: Captured effortlesslyThat's the way it wasHappened so naturallyI did not know it was loveThe next thing I felt wasYou holding me closeWhat was I gonna do?I let myself go And now we're flyin' through the starsI hope this night will last forever Oh oh oh ohAin't nobodyLoves me betterMakes me happyMakes me feel this wayAin't nobodyLoves me better than you I've been waitin' for youIt's been so longI knew just what I would doWhen I heard your songYou filled my heart with a kissYou gave me freedomYou knew I could not resistI needed someone And now we're flyin' through the starsI hope this night will last forever Oh oh oh ohAin't nobodyLoves me betterMakes me happyMakes me feel this wayAin't nobodyLoves me better than you [2x:]I make my wish upon a starAnd hope this night will last forever Oh oh oh ohAin't nobodyLoves me betterMakes me happyMakes me feel this wayAin't nobodyLoves me better than you At first you put your arms around meThen you put your charms around meWe stare into each other's eyesAnd what we see is no surpriseGot a feeling most would treasureAnd a love so deep we cannot measure. [2x:]Ain't nobodyLoves me betterMakes me happyMakes me feel this wayAin't nobodyLoves me better than you ",
            "date": "Answered June 22, 2016",
            "views": "721",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Narcisa Gacusan",
                    "user_href": "/profile/Narcisa-Gacusan"
                },
                {
                    "user_id": "Jay Mehta",
                    "user_href": "/profile/Jay-Mehta-239"
                },
                {
                    "user_id": "Rishi Jalan",
                    "user_href": "/profile/Rishi-Jalan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan James",
                "href": "/profile/Ethan-James-22"
            },
            "answer_text": "Space Bound by Eminem  Despite what some people think, this isn’t an anti-love song. It fully indulges itself in the immersion that love usually brings. It just acknowledges the futility of love the whole way. The hook blends perfectly with the beat. Eminem tells a sad and poignant failed love story with perfect flow and lyricism that makes you feel like you’re feeling everything as if you’re Marshall himself. He tells his story in a way that’s succinct but beautiful in the rhyming department. We touch, I feel a rush We clutch, it isn’t much But it’s enough to make me wonder what’s in store for us It’s lust, it’s torturous You must be a sorceress Cause you just did the impossible Gained my trust I don’t know about you, but I feel this. This resonates with me on a metaphysical level. Being hesitant to fully trust and love someone because of how badly you’ve been fucked up in the past? I feel that. You almost wanna believe that there’s a happy ending in store. But unfortunately, this song is based on Eminem’s life, and somebody decided Eminem doesn’t deserve love, so naturally this ends tragically. The first verse shows the raging fire in someone’s heart when they meet that one. That person who broke down their barriers and trust issues and became their world. But acknowledges how fucking paranoid afraid they are to lose them. Second verse ain’t much better. This is when he gets desperate, but through no fault of his own. This fictitious bitch has manipulated Marshall to the point that he lives and breathes her. Until she has him dying, both inside and out. There's no limit on how far I would goNo boundaries no lengthsWhy do we say that until we get that person that we think’sGonna be that one and then once we get em it's never the sameYou want em when they don't want you, soon as they do, feelings changeIt's not a contest and I ain't on no conquest for no mateI wasn't looking when I stumbled onto you, must've been fateBut so much is at stake, What the fuck does it take,Let's cut to the chase, 'fore a door shuts in your facePromise me if I cave in and break and leave myself open, that I wont be making a mistake This is where I normally get hit right in the feels. Unfortunately he was making a mistake by caving in and breaking. I’ve been there, and it killed me. Eminem’s been through that pain, and he put it from pen to pad. Third verse gets even worse. This is the withdrawal point. When they leave you at the time when you’re most dependent on them. They leave you at your absolute lowest point. It kills. So after a year and six months It’s no longer me that you want But I love you so much it hurts Never mistreated you once I’ll pour my heart out to you Let down my guard, swear to God I’ll blow my brains and you’ll laugh Lay here and die in your arms Drop to my knees and I’m pleading I’m tryna stop you from leaving You won’t even listen so fuck it I’m tryna stop you from breathing I put both hands on your throat I sit on top of you squeezing Till I snap your neck like a popsicle stick Ain’t no possible reason I can think of To let you walk about this house and let you live Tears stream down both of my cheeks Then I let you go and just give Before I put that gun to my temple I told you this (GUNSHOT) This song hurts. Love hurts. Everything hurts. Everything in this world will not only kill me, but put me under intensely excruciating pain while it kills me slowly and agonizingly. Big big sad. ",
            "date": "Answered February 17, 2019",
            "views": "34",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A-Ro Rosaly",
                    "user_href": "/profile/A-Ro-Rosaly"
                },
                {
                    "user_id": "Krystal Ramsook",
                    "user_href": "/profile/Krystal-Ramsook-1"
                },
                {
                    "user_id": "Shahid Ullah",
                    "user_href": "/profile/Shahid-Ullah-96"
                },
                {
                    "user_id": "Anushka Pratap",
                    "user_href": "/profile/Anushka-Pratap"
                },
                {
                    "user_id": "Jaylyn Brooks",
                    "user_href": "/profile/Jaylyn-Brooks"
                },
                {
                    "user_id": "Sateesh Sangamalla",
                    "user_href": "/profile/Sateesh-Sangamalla-1"
                },
                {
                    "user_id": "Helen",
                    "user_href": "/profile/Helen-734"
                },
                {
                    "user_id": "Kashaf Rizvi",
                    "user_href": "/profile/Kashaf-Rizvi-2"
                },
                {
                    "user_id": "Irtaza Ahmed",
                    "user_href": "/profile/Irtaza-Ahmed-1"
                },
                {
                    "user_id": "Ribaldo Salvatierra",
                    "user_href": "/profile/Ribaldo-Salvatierra-1"
                }
            ]
        }
    ]
}