{
    "title": "What are the best songs about love from Pierce the Veil? - Quora",
    "tags": [
        "Pierce the Veil",
        "Music Recommendations",
        "Songs",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tamara Batty",
                "href": "/profile/Tamara-Batty-1"
            },
            "answer_text": "I’d have to say Gold Medal Ribbon from their newest album, Misadventures. It is one of their lesser known songs that hasn’t been released as a single, but that doesn’t make its message any less profound! The title refers to an ice cream flavour: Vic Fuentes (the lead singer) had a girlfriend whose favourite ice cream flavour was Gold Medal Ribbon, but unfortunately she passed away. The lyrics portray a sense of desperation, pleading her to return: Are you up there? Just give me a signal I’m reaching you now Those are the song’s opening two lines that are sung at the higher end of Vic’s vocal range which implies struggle. The chorus is quite short, but has some great lyrics that pull at your heart-strings: I swear that I can hear you in the wind You’re singing to me and dancing in the halls outside again I’m always listening The fact that he can “hear” her is quite sad because it might not even be true: the sense of longing he has for a person that is no longer living is so strong that he feels her presence despite knowing he will never see her in this life again. It isn’t a generic love song which is what makes it all the more special; it’s tailored to one specific person and something personal in the relationship they had.  ",
            "date": "Answered February 16, 2018",
            "views": "41",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Mennuti",
                    "user_href": "/profile/Joseph-Mennuti"
                },
                {
                    "user_id": "Flo Edmonds",
                    "user_href": "/profile/Flo-Edmonds"
                },
                {
                    "user_id": "Wes Schoenfeldt",
                    "user_href": "/profile/Wes-Schoenfeldt"
                },
                {
                    "user_id": "Joelle Ann Reformado",
                    "user_href": "/profile/Joelle-Ann-Reformado"
                },
                {
                    "user_id": "Jess W",
                    "user_href": "/profile/Jess-W-12"
                },
                {
                    "user_id": "Conaill Mac Daid",
                    "user_href": "/profile/Conaill-Mac-Daid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jess W",
                "href": "/profile/Jess-W-12"
            },
            "answer_text": "For me the best PTV songs about love would be Bulletproof Love, Caraphernelia, Gold Medal Ribbon, Kissing In Cars and Texas Is Forever. Kissing In Cars is certainly their most romantic song. Bulletproof Love is about betrayal from a significant other, while Gold Medal Ribbon was written for Vic’s first girlfriend. In interviews it has been suggested that Caraphernelia and Texas Is Forever are both about the same girl and Vic’s inability to get over his relationship with her. ",
            "date": "Answered July 23, 2016",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Makayla Champion",
                    "user_href": "/profile/Makayla-Champion-1"
                }
            ]
        }
    ]
}