{
    "title": "What are the best free and legal music download sites? - Quora",
    "tags": [
        "Free Download",
        "Free Products Website Recommendations",
        "Free Products",
        "Website Recommendations",
        "Downloading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Dunn",
                "href": "/profile/Mark-Dunn-64"
            },
            "answer_text": "There are dozens of places you can go.  I will list some of the most common, and a few weirdos: http://Archive.orghttp://Bandcamp.com --- TOP RECOMMENDATIONhttp://FreeMusicArchive.orghttp://Last.fmhttp://NoiseTrade.comhttp://PureVolume.comhttp://ReverbNation.comhttp://Soundcloud.com It is very, very easy to Google for more websites and for what bands are out there putting their hard work online for your enjoyment. Keep in mind that free music is most often found by non-commercial bands, and non-commercial bands most usually play non-commercial styles.  If you are just looking for \"new popular song/album X\", you might be wasting your time trying to search free archives for that kind of thing. In addition to catch-all website, there are a ton of netlabels (online music labels) that offer entire catalogues of releases for free download, including digital-only and multi-format releases.  I did not put any there because they are genre-specific, even if they span multiple kinds of music. Also, get into bands that offer entire free previews and entire albums on public hosting websites like Mediafire and 4shared.  If your music is costing you a lot of money for digital formats (which don't have the same manufacturing overhead as vinyl, for example), you are most probably being ripped off.  A person could easily live entirely on music that artists and labels offer for free. ",
            "date": "Updated April 13, 2018",
            "views": "45",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakriti Vishwakarma",
                    "user_href": "/profile/Prakriti-Vishwakarma-1"
                },
                {
                    "user_id": "Bhavana Gupta",
                    "user_href": "/profile/Bhavana-Gupta-40"
                },
                {
                    "user_id": "Nuno Rocha",
                    "user_href": "/profile/Nuno-Rocha-13"
                },
                {
                    "user_id": "Ben Sinclair",
                    "user_href": "/profile/Ben-Sinclair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nazmul Hasan",
                "href": "/profile/Nazmul-Hasan-406"
            },
            "answer_text": "Free music isn't difficult to find, in the event that you realize where to look, and you're willing to tune in to music that is less standard. Here are a portion of the . Music is the thing that moves us. It's not only an adage. Huge amounts of steaming locales out there can stream the majority of your most loved tunes, as Spotify and Apple Music. Be that as it may, not every person has a magnificent information intend to give you a chance to stream music constantly, and not every person needs to pay for music. Additionally, standard specialists are incredible and all, however there's an entire universe of music that you can find that isn't played on your nearby radio station. There are craftsmen out there who are as great, if worse than Taylor Swift — better believe it, I said it — who simply haven't discovered the national spotlight at this time. That is the place free music download destinations come in. ",
            "date": "Updated December 25, 2018",
            "views": "124",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dharmveer Jakhar",
                    "user_href": "/profile/Dharmveer-Jakhar"
                }
            ]
        }
    ]
}