{
    "title": "What was Socrates' first name? - Quora",
    "tags": [
        "Socrates",
        "Ancient Greece",
        "Names and Naming",
        "Given Names"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Griffin",
                "href": "/profile/Michael-Griffin-3"
            },
            "answer_text": "I can add a little to the points above. Basically, if we were engaged in familiar conversation with Socrates, we'd simply address him as Sōkratēs, \"Socrates\" – by far the most common usage in Plato's dialogues. In more formal (or mock-serious) contexts, we might add his patronymic (father's name): Sōphroniskou, \"[Son of] Sophroniscus\". To get more formal still, we might add his demotic name, referring to his district of origin: \"Alōpekēthen\" or \"from [the deme of] Alōpeke. Something like a \"full name\" in our sense would resemble \"Socrates, son of Sophroniscus, from Alopeke\" – Sōkratēs Sōphroniskou Alōpekēthen. In a bit more detail, the two core elements of a personal name in (most of) classical Greece were (1) the given name and (2) the patronymic (father's name). For example, Socrates was (according to the ancient tradition) the son of a stonemason called Sophroniscus. So he could be called Sōkratēs Sōphroniskou (literally \"Socrates of Sophroniscus\", i.e. Socrates, Sophroniscus' [son]). In the Platonic dialogues, Socrates is usually addressed by his given name (Sōkratēs) in casual conversation, but sometimes by his father's name (for example, Laches 180D: \"O son of Sophroniscus\"), which can offer variation in conversation, or suggest (often in play) a more formal or respectful context. Depending on the situation, a third element could be added: (3) an ethnic or demotic name, denoting the person's place or community of origin. In fifth-century BCE Athens, where Socrates was a citizen, the local usage often referred to a \"deme\" or district of Attica. Socrates' deme was Alopeke, and he's addressed (mock-seriously) in one of the Platonic dialogues by his demotic name (Gorgias 495D). If we were outside Attica, elsewhere in the Greek world, we might add (or simply state) that Socrates was from the city of Athens in general. The Lexicon of Greek Personal Names project has a nice online summary of how the names are constructed, if useful: http://www.lgpn.ox.ac.uk/names/practices.html ",
            "date": "Answered February 14, 2012",
            "views": "102",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Pyle",
                    "user_href": "/profile/Robert-Pyle"
                },
                {
                    "user_id": "Tim McClennen",
                    "user_href": "/profile/Tim-McClennen"
                },
                {
                    "user_id": "Oscar Heath",
                    "user_href": "/profile/Oscar-Heath"
                },
                {
                    "user_id": "Melody Segura",
                    "user_href": "/profile/Melody-Segura-1"
                },
                {
                    "user_id": "Tracy Dale McCarthy",
                    "user_href": "/profile/Tracy-Dale-McCarthy"
                },
                {
                    "user_id": "James Rothering",
                    "user_href": "/profile/James-Rothering"
                },
                {
                    "user_id": "Andi Alexander",
                    "user_href": "/profile/Andi-Alexander"
                },
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                },
                {
                    "user_id": "Enna Đorđević",
                    "user_href": "/profile/Enna-Đorđević"
                },
                {
                    "user_id": "Steve Theodore",
                    "user_href": "/profile/Steve-Theodore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "Greeks of that era tended to be known by a single name.  If there was confusion, they might adopt a qualifier, such as the town that they were from or their occupation, or perhaps from their father's name. So you could say that Socrates was his first name, or rather, his given name.  There have been other people named Socrates before and since.  If there were others running around Athens at the time, they might all turn around if you yelled out the name. The Greeks tended to be fairly clever about their namings.  (Unlike the Romans, who only had a small pool of given names to draw on, including resorting to just numbering their children.)  Socrates was named for \"Isokratos\", \"equal power\" (the same \"kratos\" that makes up the word \"democratic\", \"power of the people\").  This freedom in naming meant that there wouldn't have been all that many people with the same name around. ",
            "date": "Answered February 7, 2012",
            "views": "163",
            "upvotes": " View 103 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagnik Saha",
                    "user_href": "/profile/Sagnik-Saha-16"
                },
                {
                    "user_id": "Lashanda Price",
                    "user_href": "/profile/Lashanda-Price"
                },
                {
                    "user_id": "Tim McClennen",
                    "user_href": "/profile/Tim-McClennen"
                },
                {
                    "user_id": "Vinicio Hernandez",
                    "user_href": "/profile/Vinicio-Hernandez"
                },
                {
                    "user_id": "Senodh Jay",
                    "user_href": "/profile/Senodh-Jay"
                },
                {
                    "user_id": "Alexander Junxiang Chen (陈骏翔)",
                    "user_href": "/profile/Alexander-Junxiang-Chen-陈骏翔"
                },
                {
                    "user_id": "Sebastián Aírton",
                    "user_href": "/profile/Sebastián-Aírton"
                },
                {
                    "user_id": "George Venetos",
                    "user_href": "/profile/George-Venetos-2"
                },
                {
                    "user_id": "Pablo Esteban Aguilar Castro",
                    "user_href": "/profile/Pablo-Esteban-Aguilar-Castro"
                },
                {
                    "user_id": "Roger Jamieson",
                    "user_href": "/profile/Roger-Jamieson-2"
                }
            ]
        }
    ]
}