{
    "title": "What was it like to meet BTS in person? - Quora",
    "tags": [
        "Meeting New People",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Taron Rose",
                "href": "/profile/Taron-Rose"
            },
            "answer_text": "When I first met them in 2016, I hadn’t come out as a trans boy yet. I was still known by everyone as a girl when in reality, I was a boy. Namjoon was the first member I met. He called me pretty and I interjected and said ‘handsome’. When he looked confused, I showed him a small note I wrote (in terrible Korean since I am still learning) explaining I was a transgender boy and used he/him/his pronouns. Namjoon quickly apologized, to which I said it was fine, and that no one knows yet but me and him. To my shock and worry, a few tears filled in his eyes because he felt so grateful he was the first person I came out to. I felt guilty and said “don’t cry don’t cry.” He quickly smiled though when I gave him a giant Ryan plushy. Hobi was next. He had heard what I said to Namjoon, aka me being trans, and I gave him the same note as well as my preferred name. He said my name was very handsome and I clumsily bowed, almost hitting the table, and thanked him. I then complimented his dancing and that he was my bias wrecker (Seokjin’s been my bias since I found them in 2013) and he was super happy to know this. I then met Taehyung who I then gave the same “i’m trans” note too and was happy I came out to him. He then asked me when I became an army and I said “July 2013” to his amazement. I was a bit flustered during this interaction because he is SO HANDSOME up close. Jungkook was next. He was beyond excited when I gave him some food and complemented my hair (at the time I had dyed my hair purple.) He said “thank you for telling me” when I said I was trans. I asked him about Korean snacks he liked and then said his singing voice is very comforting. Yoongi was next and possibly, next to Namjoon, the most emotional. He smiled adorably when I came out to him. Things got sad, however, when I had moved my hoodie sleeves a bit because they were a bit big and my self-harm scars were showing. He saw them and frowned, his eyes a bit sad. He asked why I hurt myself and I said “my brain is sick.” He patted my hand before asking me if he could write something on my wrist. I nodded, shocked since I had never seen an idol do this before, and I saw he drew a heart. I started crying because everyone else in my life whose seen my scars had looked at me with pity or told me something was wrong with me (telling this to someone with depression and anxiety isn’t good.) I thanked him for the heart and promised I would work on getting better. It’s 2020 now and I haven’t cut in about three months. I broke my promise but I am trying to get better. Seokjin, worldwide handsome himself, was next. I was a bit flustered, similar to Tae, because of his visuals and ended up not talking too much. I did hand him my “i’m trans” note thankfully and he smiled brightly. I told him he inspired me to start baking and told him I made my own bday cake, to his excitement. Last, but never least, Jimin. I was crying when I made eye-contact with him and he was super worried. I told him that he had inspired me to admit I had a eating disorder and to work on it. He smiled, a little sad, and was grateful I told him. When I mentioned being trans, he fist-bumped me (I don’t like high-fives) and said I was “a very cool and handsome boy.” ",
            "date": "Answered September 9, 2020",
            "views": "103",
            "upvotes": " View 435 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sraddha Sarkar",
                    "user_href": "/profile/Sraddha-Sarkar-2"
                },
                {
                    "user_id": "Unknown",
                    "user_href": "/profile/Unknown-7984"
                },
                {
                    "user_id": "Lisha Dilip",
                    "user_href": "/profile/Lisha-Dilip"
                },
                {
                    "user_id": "Anugya Jaiswal",
                    "user_href": "/profile/Anugya-Jaiswal-1"
                },
                {
                    "user_id": "Terra Willy",
                    "user_href": "/profile/Terra-Willy"
                },
                {
                    "user_id": "Maleena Sander",
                    "user_href": "/profile/Maleena-Sander-1"
                },
                {
                    "user_id": "Melissa Mendez",
                    "user_href": "/profile/Melissa-Mendez-175"
                },
                {
                    "user_id": "Ria G",
                    "user_href": "/profile/Ria-G-24"
                },
                {
                    "user_id": "Siva Varshini Thangapandian",
                    "user_href": "/profile/Siva-Varshini-Thangapandian"
                },
                {
                    "user_id": "ShelleyMonica",
                    "user_href": "/profile/ShelleyMonica"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaisla Lehtipuu",
                "href": "/profile/Kaisla-Lehtipuu"
            },
            "answer_text": "Meeting bts was simultaneously the best and the worst thing that has ever happened to me. I met bts when they decided to “join” the annual cruise we go on with some friends from high school. I live in Finland, and on the second day of the trip, when the ship was leaving Stockholm, I noticed there were some new familiar faces walking the decks with us. So how was it? The minute I realised they were there I got super nervous. I felt sick. My heart was pounding. I was screaming inside. But, I realised that I have to keep it together for the sake of bts. That night, there were no idols on board, only normal tourists. So, meeting them was weirdly normal. We were standing in the same elevators and walking behind each other a lot, getting food side by side and so on. It wasn’t until the night when we “spent time together” dancing at the club and chilling on the sofas (tae, jin, joon, hobi hmu we had fun). The only memeber I tried to have a conversation with was jimin, but me being my awkward self and him being shy it didn’t last pretty long. He is the sweetest and very polite though. After those 30 hours breathing the same air we arrived in Helsinki. On my way home I realised that that was probably the only time I would ever see them in private. I started to regret a lot, about not just going to talk to them about music and life and more. That shitty feeling lasted for almost a year. Now I’ve finally gotten over it and it’s just a good memory. I’m pretty sure if bts knew about the situation they would appreciate it. I mean, I waved at them a couple of times so if they noticed/cared they could’ve figured out that I was a fan? The most important thing is that they had a great time and were comfortable the whole trip. You never know how they would react i they knew a fan slept literally a couple of corridors away. I think all fans should remember that idols are people too. If you meet them, please don’t be creepy and follow them everywhere. Don’t be a paparazzi. For everyone’s sake: try to stay calm. You’ll get so much more out of the experience with a nice chat and a smile on your face! It’s hard but totally worth it! When I was watching bon voyage later and heard taehyung saying he enjoyed the cruise probably the most, i couldn’t help but smile. Me too tae, me too. • Additional fangirl rant about their looks: They look so good. Wtf. Better than in pictures. But at the same time, they look weirdly different. Jungkook looked younger than usual and could’ve easily been one of us. Seeing them irl may confuse you. It’s like, as a fan you see those faces every day, but you haven’t actually ever seen them. So when you do, it takes a moment to adjust. The first time I saw jin, before I realised that bts were there, he went past me so quickly I thought he was just some 16 year old #finnishboy. I even glared at him for he was running around almost crashing into people and I wasn’t having it in my hangover. Oops. ",
            "date": "Answered June 28, 2017",
            "views": "2489",
            "upvotes": " View 2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Carol Mary",
                    "user_href": "/profile/Carol-Mary-9"
                },
                {
                    "user_id": "Maleena Sander",
                    "user_href": "/profile/Maleena-Sander-1"
                },
                {
                    "user_id": "Reagan Butler",
                    "user_href": "/profile/Reagan-Butler-11"
                },
                {
                    "user_id": "Siva Varshini Thangapandian",
                    "user_href": "/profile/Siva-Varshini-Thangapandian"
                },
                {
                    "user_id": "Kat V",
                    "user_href": "/profile/Kat-V-42"
                },
                {
                    "user_id": "Manasi Chaudhari",
                    "user_href": "/profile/Manasi-Chaudhari-20"
                },
                {
                    "user_id": "Roohani Naik",
                    "user_href": "/profile/Roohani-Naik-1"
                },
                {
                    "user_id": "Sevval Bozkurt",
                    "user_href": "/profile/Sevval-Bozkurt"
                },
                {
                    "user_id": "Alejandra Tarazona",
                    "user_href": "/profile/Alejandra-Tarazona-4"
                }
            ]
        }
    ]
}