{
    "title": "What are the examples of best listening skills? - Quora",
    "tags": [
        "Listening"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Begun",
                "href": "/profile/Adam-Begun-1"
            },
            "answer_text": "Your question is a little vague so I presume you are kind of new at this. I will try to help. Probably the first thing you will notice-without even trying-is the beat/rhythm. It's a good place to start. Rap won't sound like Taylor Swift (I hope not!) or Alabama Shakes etc. The rhythm of a piece (bass/drums/rhythm guitar and keyboards) will tell you the style the piece was written in. (There ARE strange mash-ups but heavy metal salsa bands or country and western reggae bands are a pretty rare species.) Second, and more advanced, is the harmony. Is it blues based (I-IV-V changes)? Or 1950′s rock and roll style (I-vi-ii-V)? Or something more unique? Third if you play an instrument you can figure the harmony by finding individual notes that fit in with the song. If you find enough common notes, and have a basic understanding of theory, you can figure out the tonic and what key the song is in. Finally-and most-important-sing along with as many parts of the song as possible. The vocal line and the bass part are the two most important parts to pay attention to. (And no, it doesn't matter if you don't like your voice-you're not putting on a show.) Figuring out the rhythm, harmony and melody are the basics to learning by ear. And being able to identify these elements will make communicating your ideas to other musicians much, much easier. ",
            "date": "Answered June 21, 2017",
            "views": "746",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Norman McCormick",
                "href": "/profile/Charles-Norman-McCormick"
            },
            "answer_text": "One good listening skill is to talk half as much as you listen. You were given one mouth and two ears for a reason. Other great listening skills include: Place importance on what the other person is saying. All too often we have a message we want to deliver that takes precedence over what they are trying to say.Ask questions and wait for the answers.Don’t be plotting your retort while they are talking. That is not listening.Be curious about the speaker and where they are coming from.If in a conference or meeting, take notes. Try to capture the gist of what each person is saying.Stay awake. You are not listening if you are falling asleep.Find out what the basis is of their position. If they are venting anger over something that happened, hear what they have to say.Don’t get in an argument over who is right and who is wrong.",
            "date": "Answered August 18, 2019",
            "views": "586",
            "upvotes": "0"
        }
    ]
}