{
    "title": "What are some 'hard to swallow' facts about BTS? - Quora",
    "tags": [
        "BTS Songs",
        "Facts and Trivia",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sireen Star",
                "href": "/profile/Sireen-Star"
            },
            "answer_text": "Here’s my unfiltered opinion- if you disagree then write your own. I personally think they’re very talented individuals who are bound by their contracts which waters down their artistic talent. EDIT: SOME of the replies to this comment are exactly what you expect from Army. If you wonder why people dislike our fandom here’s a great example. You can’t let others have their own opinion and will defend BTS to your dying breath and invalidate everyone’s thoughts as long as they don’t align with yours. I’m not sure which part of opinion are people not getting, really? Your replies are just your own opinions vs mine, and we’re not here to argue over this. The question is hard to swallow, which is clear because some people just CAN’T be mature and accept that not everyone will agree with you. Jesus. LONG POST AHEAD** 1- They are grateful for their fans but they don’t love them and think about them all the time. It’s part of their training to say these things so it comes out naturally now. 2- All their recent albums are lower in quality because BH is choosing mainstream to sell instead of songs that fit their vocals and style. This can be noticed in most of their latest album solo songs. 3- All their collabs don’t fit their style. 4- RUN episodes are very childish and hard to watch, especially when you remember their age. If I were BTS I’d fucking hate my job. 5- They hate most of the things they do however they’re bound by contracts. 6- They don’t have freedom as much as their fans would like to delude themselves. They can’t even release songs without approval, they can’t decide concepts without approval, they can’t do solo stuff without approval(IF any approved..), they can’t go live or post without approval. They’re monitored all the damn time, hence my next point. 7- I believe some members regret signing BH but are now stuck in their comfort zone. They could have achieved similar success with less demanding contracts. 8- I believe some members would love to go solo but are too scared of the backlash and how their career will go from there. This is not because they don’t like the members or BTS as a band.. no no. I believe this is because they’re constricted and have no opportunities outside of this damn band. Not fair to all of them. 9- They’re most probably in serious relationships. 10-Their public image doesn’t reflect their real life personality. I believe KPOP artist in general are the most well hidden from their fandom. 11- I believe the members don’t hang out as much as they used to. Please don’t confuse this with them not being friends anymore, because I believe they’re genuine friends and love each other. They just grew up which is something their fans hate to admit. 12- Controversial.. I believe Tae willingly distanced himself from Jimin and JK (on camera) as he doesn’t want to be involved in ship wars. I believe recently Taehyung in specific want people to know him for his talent only rather than looks and shipping. 13- Speaking of Tae, he is definitely one of the members that has had enough with all the bullshit and can’t put on a face anymore. This is very clear from how he wants people to know him for his talent, and how he tries to do all his Vlives alone speaking his mind (as much as he can). It’s very clear how much he didn’t like his live with JK and I believe because they were forced to do that the ridiculous paper shit(don’t know what that was) 14-Their support to BLM was due to public backlash and not because they support the movement. Why? because they’re not affected and can’t relate. It has nothing to do with them being racists. 15-Some members are clearly favored over others, like Jimin and JK. 16- They’re ALL not getting paid enough. They’re getting nothing compared to how much they sell. 17- Army fandom is toxic and have different categories -The entitled and aggressive ones that when bored will even attack the members themselves if they dare breathe -The blind followers who will not hold the boys accountable for anything they do and treat them like 5 yo babies who they must “protect” -The “omg look how smol or tiny” ones.. yeah I mentioned them -The INSANE Tae/JK/JM Solo stans and shippers.. those are a breed of their own. They literally fight each other all the time and send the members death threats. 18- BTS will not last, and it will start falling once the members go to military especially JK/JM/Tae. All I wish for is the members being more honest and showing their true thoughts and feelings to their fans. I want to hear music they truly want to produce without any interference. I want to know the artist I support and not the fake image their company presents. ",
            "date": "Answered June 21, 2020",
            "views": "204",
            "upvotes": " View 492 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Melody Myers",
                    "user_href": "/profile/Melody-Myers-27"
                },
                {
                    "user_id": "Malachi Williams",
                    "user_href": "/profile/Malachi-Williams-35"
                },
                {
                    "user_id": "Shaki Yasin",
                    "user_href": "/profile/Shaki-Yasin-1"
                },
                {
                    "user_id": "Adriana Jimenez",
                    "user_href": "/profile/Adriana-Jimenez-147"
                },
                {
                    "user_id": "ANime Anime",
                    "user_href": "/profile/ANime-Anime-97"
                },
                {
                    "user_id": "Joker Xx",
                    "user_href": "/profile/Joker-Xx-1"
                },
                {
                    "user_id": "Bahnishikha Debnath",
                    "user_href": "/profile/Bahnishikha-Debnath"
                },
                {
                    "user_id": "Priyadarshini Basu",
                    "user_href": "/profile/Priyadarshini-Basu-6"
                },
                {
                    "user_id": "Saloni Rathore",
                    "user_href": "/profile/Saloni-Rathore-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seok Jinnie",
                "href": "/profile/Seok-Jinnie-10"
            },
            "answer_text": "edit: before you go on reading this, if you’re a sensitive army and can’t stand a word against bts, then please don’t bother reading. some of the comments under this answer made me add this. they’re called ‘hard to swallow’ for a reason, if you can’t take them then better not read them at all. they have reached the peak of their popularity and from here it won’t go up but it will go downhill.some of them are in relationships, maybe some of them even have kids because their reactions when taehyung mentioned seeing their kids were really fishy. this is just my opinion and what i noticed.they all have crushes on people and find other people attractive. maybe even male/female idols.not every love song they make is about army. i found it so funny when i saw armys commenting things like “awww how much they love us, they always make songs about us” under the lyric video for Outro: Her. just go and see the lyrics of this song if you haven’t already. they seem really raw and personal and armys seem to make everything about themselves.they say they love army but that doesn’t mean they love you personally, they don’t even know you exist. every kpop idol is trained to mention their fans in everything they do. some of them are even trained to treat their fans as their girlfriends. it’s all a part of their training.some of their run! bts episodes seem staged. edit: an example is episode 88 where they had to paste stickers on each other’s backs. the whole thing with jimin and taehyung and the plot twist at the end looked like a script to me.everything is a play. for example in the most recent run episodes, they were shown stitching inexpensive thrift store clothes while wearing the most expensive clothes. only the watch j-hope was wearing costed $25,000.they don’t always have fun and enjoy as they are shown in their run! bts and bon voyage episodes. they only choose to show the side of them that they want to show you. your average friend circle is maybe more entertaining than they are in real life.bts is a business and one of the reasons of their success is because of excellent marketing strategies of bighit.army is one of the most toxic fandoms. period.bts didn’t pave the way. they just helped spread the way that was already paved. armys using this phrase to degrade other groups is toxic. edit: this is the most argued topic, how about we say that 2nd generation groups/psy paved the way for bts and bts paved the way for other coming kpop groups? no? a little positivity don’t hurt nobody.some of the armys don’t care about bts’ music because it’s kpop. they only care about their visuals and focus more on their personalities.bts is kpop. accept it or not. they are becoming westernised but they will always be seen as kpop.one of the reasons why some armys leave the fandom is because of toxic stans.these days armys care more about youtube views/streaming/breaking records than enjoying their music.they don’t ENTIRELY produce their music. they have a whole team of producers and song writers.every bts member has a different taste in music and maybe it isn’t always pop/kpop.bts isn’t the only kpop group that is famous around the world now.they are friends with many kpop idols including male and FEMALE idols. they are just good at acting like strangers in front of cameras because of ships.they are probably tired of the idol life and producing music. just listen to black swan and some of the lyrics like: “the heart no longer races, when hearing the music play“nowadays bighit focuses more on the quantity of their music than it’s quality.taehyung vapes. maybe some of them even smoke. mind it they are humans just like us and they can do whatever they want to do.dispatch hasn’t exposed any of the bts member’s dating news yet not because they don’t date/have never dated. it’s because bighit and dispatch have signed a contract. edit: or what happens is, when dispatch has to expose a couple, it always contacts the idols’ companies if they want to negotiate and pay them to not expose the news. since bighit is so protective over bts, maybe their company has the money to make dispatch remain silent.bts is favoured by the South Korean government not because of their music but because they are one of the main reasons behind South Korea’s rising economy.bts is just a phase that came into our lives. one day everything will come to an end. there will be no more comebacks, vlives, run episodes, bangtan bombs. every member will be off to live his own life. bts will become a memory.a western celebrity being nice to bts or promoting their music doesn’t always mean they are using them for clout. i’m living for charlie puth calling out toxic armys in his recent tweets.youtube deleted views from ON music video not because it had any personal issues or beef with bts. youtube changed its viewing policy in september 2019 and many armys had no idea about it. armys keep dragging other groups and continue saying “bts are the biggest group, how come they get more views than bts”. hey, every fandom works hard to support their group. just because you had no idea how to stream properly doesn’t mean you can drag other groups. edit: in my opinion, fans shouldn’t even care about streaming/views in the first place and should focus on their music. bts don’t care if you are giving them views on their music videos, what they care about is how fans are enjoying their music and how they are able to relate to it. this is just what i noticed and thought i should mention it.armys victimise bts a little too much. i know it’s good to reflect back on bts’ past and see how much they’ve grown. the problem comes when they start comparing it to big 3 groups. you think big 3 groups don’t suffer to get where they are? maybe they don’t suffer financially but becoming a kpop idol isn’t an easy job even if you’re from big 3. an ex: bigbang debuted when yg was a small company and they had to suffer as well. bts isn’t the only group.bts stan twitter is cringy and straight up a bullying arena. (not all of it, there are good people in the fandom as well). i followed a bunch of bts stan accounts on twitter and had to unfollow them after a week because of how cringy they were. i saw tweets like “i got two holes for a reason: for jungkook and taehyung” i got second hand embarrassment and felt disgusted. also if you speak anything honest about bts/disagree on something or say something nice about any other group, you are bullied and called an anti.some of the bts members are atheists. they don’t have a religion. RM said he is an atheist and taehyung said that he has no religion during bts festa 2019 (starting from 00:42:50). i am not sure about other members because i couldn’t find any proof.suga using a sample of jim jones’ speech in one of his songs on his mixtape is insensitive. hear me out on this one, i love yoongi and i think he probably added it without any research. if you don’t know, jim jones was a cult leader who led his followers into a mass suicide (practically murder because they had no idea about it) in which more than 900 people died and is known as Jonestown Massacre. yoongi should have never used a highly controversial political person for his song considering how sensitive this topic is and how big of a fanbase he has.bighit is becoming more money hungry as bts is reaching more success.they don’t live together anymore. they have their own lives and their own families when they are not at work.these are facts/opinions about bts and army. i can only think of these right now. if i think of more i’ll add them. ",
            "date": "Updated October 7, 2020",
            "views": "418",
            "upvotes": " View 1.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zoe Quaziz",
                    "user_href": "/profile/Zoe-Quaziz"
                },
                {
                    "user_id": "Nadiya Sarkar",
                    "user_href": "/profile/Nadiya-Sarkar-1"
                },
                {
                    "user_id": "Shadow Queen",
                    "user_href": "/profile/Shadow-Queen-28"
                },
                {
                    "user_id": "Syalva Azhura",
                    "user_href": "/profile/Syalva-Azhura-2"
                },
                {
                    "user_id": "Jasmine Wald",
                    "user_href": "/profile/Jasmine-Wald"
                },
                {
                    "user_id": "Zara Smith",
                    "user_href": "/profile/Zara-Smith-118"
                },
                {
                    "user_id": "Na Na",
                    "user_href": "/profile/Na-Na-643"
                },
                {
                    "user_id": "Anusha Agarwal",
                    "user_href": "/profile/Anusha-Agarwal-58"
                },
                {
                    "user_id": "Reyna Mariyam",
                    "user_href": "/profile/Reyna-Mariyam"
                },
                {
                    "user_id": "Rose",
                    "user_href": "/profile/Rose-3358"
                }
            ]
        }
    ]
}