{
    "title": "What other chords can I put in between the I-IV-V chords to make it sound better? - Quora",
    "tags": [
        "Chords (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Warnock",
                "href": "/profile/Tony-Warnock"
            },
            "answer_text": "If you are thinking about the progress I-IV-V in a major key in that order, there are many possible insertions. The obvious one (dating back hundreds of years but very popular in the 1930s-1960s) is to insert vi between I and IV giving I-vi-IV-V. Another is to extend the I with I-IV6-I6-IV-V or the like. A long but useful idea is to extend things to a 7-chord long cycle of fifths (or fourths depending on which way you look at it.) I-IV-vii0-iii-vi-ii-V. Sometimes one can use part of the above by dropping the vii0 so I-IV-iii-vi-ii-V is possible. There are a few chromatic possibilities in the latter two: I-IV-vii0-iii-vi-ii-Aug6-I64-V7 or the like. (Optional augmented sixth and second inversion I chord leading to the V) The whole pattern can have sevenths or alternate between root and first inversions chords. Very common is to replace the IV with a ii or ii6 or II even. Common for the last few hundred years is I-IV-I-V . Listen to lots of songs and adapt what you find. ",
            "date": "Answered March 4, 2019",
            "views": "119",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Davis",
                    "user_href": "/profile/Brian-Davis-144"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gustavo Guardiola",
                "href": "/profile/Gustavo-Guardiola"
            },
            "answer_text": "There are many. This is the theory behind some of them: A major scale has modes, right? Ok, each one of this modes represents a region. Major modes represent major regions; minor modes represent minor regions. For the moment we are not going to talk about the diminished mode, so for the moment the locrian is not going to represent a region close to tonic. So, for C major, we have the following regions: I Tonic - C major ii dorian - D minor iii mediant - E minor IV subdominant - F major V Dominant vi submediant viib5 Ups! This region is not that close. I’ll tell you why later. Yes, I know, you should be thinking: “why mediant and not frigian?” Well, this are not modes, these are names of regions. We say dorian to differentiate it from the region of the supertonic (II major). So, the major regions are closely related to tonic. And these major regions have minor relative regions. ii is the relative minor of IV iii is the relative minor of V vi is the relative minor of I (vii is the relative minor of II, but we don’t have a D major chord that appears naturally, so this region should be not that close). So I was saying that the ii, the iii, the IV, the V and the vi are closely related to tonic. Well, we can import the alterations of this regions, we can use the key signature of them to build artificial chords. This artificial chords don’t belong to the tonality, that’s why they are artificial. But they are very close to the tonality. We can use them to ornament a progression. So, which are those alterations? Let’s see… From F major and D minor, we import Bb. But the ascending vension of the melodic scale of D minor has also B natural and C#. B natural is already in C, but C# is not. We can import it too. From G major (and E minor, it’s relative minor) we import F#. But the melodic scale of E minor presents C# and D# in the ascending version. We can import them too. So in C major we can import:  Remember this formula: +4, -1, where “+” is the number of sharps to add and “-” is the numbers of flats. Let’s call it the hidden key signature. You will never write it on the score, it’s just a way to explain close relations to tonic. 4 sharps and one flat are close to a major tonality. This formula is relative to the real key signature. If we were in G major, four sharps and one flat would be:  … And in Eb, we would have:  So what’s the point with all this stuff? Four sharps and one flat are alterations that belong to regions that are close to tonic, and you can use them to build artificial chords: artificial dominants (they are also called secondary dominants), artificial semidiminished chords and even an artificial diminished chord.  So, when you have a progression, you can ornament it by adding artificial chords in between. Artificial dominants are fifth degrees. So if we are in C major and you want to reach the IV, you can put the V of the IV, which is C7. You can also use the vii° of the IV (Eb5, or Eb5 7). So in your progression, you can add: I - (I7) - IV - (II7) - V You could also use half diminished chords, and it would be fine. Half diminished and diminished chords are seventh degrees of the target chord. The seventh degree must be a leading tone (half step below your target chord). There are many other chords that can be used, that come from not so close regions. I’m not going to explain them here, because it will take a long explanation. But augmented sixth chords can be used to replace the subdominant or to ornament the resolution to V. You could also add the I 6/4 in between the IV and the V. This is a diatonic ornament, no accidentals needed, and it was very common in the classical period. And of course you could also add suspensions, sevenths, anticipations, melodic ornaments, etc. If you know about voice leading, even a simple chord progression can sound really cool. All of this works fine for very conventional purposes but it also works for jazz. In jazz music you could use many other things, but in many cases they would be also related to this explanation. Edit: Now, the most important thing to understand is that harmony is not about formulas, but about technique. Many diatonic and non-diatonic chords can be used. Good or bad results depend on your purpose and the musical contexts. I hope this answer helps. Good luck. ",
            "date": "Answered September 4, 2017",
            "views": "714",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chirag Deshpande",
                    "user_href": "/profile/Chirag-Deshpande"
                },
                {
                    "user_id": "Annalise Giezekamp",
                    "user_href": "/profile/Annalise-Giezekamp"
                },
                {
                    "user_id": "Jeremy A.M",
                    "user_href": "/profile/Jeremy-A-M"
                },
                {
                    "user_id": "Gabriel Souza",
                    "user_href": "/profile/Gabriel-Souza-6"
                },
                {
                    "user_id": "Richard Waltman",
                    "user_href": "/profile/Richard-Waltman-4"
                },
                {
                    "user_id": "Brian Peters",
                    "user_href": "/profile/Brian-Peters-59"
                },
                {
                    "user_id": "Joao Pereira",
                    "user_href": "/profile/Joao-Pereira-60"
                },
                {
                    "user_id": "John Paul Eze",
                    "user_href": "/profile/John-Paul-Eze"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Stu-Art-X"
                },
                {
                    "user_id": "Nevi Løvfelt",
                    "user_href": "/profile/Nevi-Løvfelt"
                }
            ]
        }
    ]
}