{
    "title": "What is music to a deaf person? - Quora",
    "tags": [
        "Deafness (physiological condition)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Casselden",
                "href": "/profile/Jacob-Casselden"
            },
            "answer_text": "I'm 30 years of age and studied the world of drumming since the age of two three thanks to my father. I am fully deaf without the use of aids since they are of no use for someone like myself. I have worked as a professional drummer for years ears and often work as a rhythm and bass consultant for well known musicians, around the world. But they never knew beforehand that I am a deaf person, just to see the surprise on their faces once I appear. Now, music and the deaf is something really worth discussing and it is a lot deeper than that. In my view there are three routes between the deaf and music. - There is a group of deaf people that objects music wholly. They believe they shouldn't learn to speak and only to sign. This is due to their belief of 'no ears, no bother'. In some ways they believe music is for the hearing community only and often vent their anger towards the deaf who follows the music world. - Deaf people may just like the feeling of music! 'Oh wow!' Comes to mind however, with the short attention span we have, they become bored quite easily and label the art to belong to the hearing community and not to bother with it any further. But they still respect anyone who appreciates music. You'll see the individuals dance but off the rhythm. - there are deaf people who understand music really well due to their background and education. For example, I was taught to play the drums and studied ballet, tap and modern up to the professional level from the age of three. For this reason, I am able to understand, communicate and even manipulate rhythm, frequencies, tones, lyric patterns and so forth. But many deaf people have not been given similar opportunities. It is really rare to find a deaf person obsessed with the understanding of music. I did have an argument for a several years about music. Since singing is inaccessible for us, I started to question; 'Is lyrics music or poetry?' In the end, the decision were not reached. Whilst singing is lovely since there are meaningful messages inside, I still feel it is not technically 'music'. The sounds and vibrations that drives the lyrics is the concept, music (for me). Music is such a powerful tool and is extremely important in anyone's lives. It is a good source of therapy and I strongly believe it is also made for the deaf. I have seen what deprivation of music can do to deaf people and the increase of isolation it causes. So it is important to introduce music as part of education for the deaf but sadly, most schools don't bother. It is interesting to see someone comment along the line of, 'if loud enough they would be able to hear the music'. I'm afraid it is not that simple. There are so many different level of deafness. Whilst I think May go through the damaged ears (from birth), the sound would be different in compared to what you hear as a hearing person. Whilst I have no means of listening whatsoever, I still have a way somehow. So let the rhythm of life continue... It is official - Im mumbling and I should stop. But I hope this message have opened the eyes of many. ",
            "date": "Answered April 22, 2017",
            "views": "853",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Markus Nashorn",
                    "user_href": "/profile/Markus-Nashorn"
                },
                {
                    "user_id": "Halo Milan",
                    "user_href": "/profile/Halo-Milan"
                },
                {
                    "user_id": "Adair Holton",
                    "user_href": "/profile/Adair-Holton"
                },
                {
                    "user_id": "Célio Ferreira",
                    "user_href": "/profile/Célio-Ferreira"
                },
                {
                    "user_id": "Radhika Agarwal",
                    "user_href": "/profile/Radhika-Agarwal-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Watson",
                "href": "/profile/Jack-Watson-146"
            },
            "answer_text": "Hearing people always assume that there is only one way to enjoy music, and that is by listening/ hearing to it. In a world dominated and driven by able bodied privilege, that assumption is prevalent, and when a deaf person shows up at a concert, heads turn. However, deaf people can enjoy music in ways that differ from how hearing people enjoy music, but they can definitely derive pleasure out of it. First of all, deafness does not mean that someone does not hear anything at all – there are varying levels of deafness. Second, deaf people can feel the vibrations produced by the music being played and consume those vibrations through their body. The humming sound produced by picking a bass string or the boom of the drums can be felt very easily by them. The lyrics evoke different types of feelings, and the combination of vibrations and lyrics is how deaf people enjoy music. Someone who wears hearing aids or Cochrane implants may have some enhanced levels of hearings but for those who don’t, they turn up the volume so they can feel the vibrations from beats and bass more strongly as they read the lyrics. Concerts for deaf people are a different experience. Typically the music at concerts is very loud, and that can damage hearing aids and someone’s hearing. In such a situation, deaf people turn off their hearing aids which may make them hear music even less but then they enjoy the music through amplified vibrations being produced by large speakers around them. It is also common for bands/ musicians to have sign language interpreters who sign song lyrics for their deaf audience. This way, deaf people feel the music and also get to know the words to the songs! Hope this helped! ",
            "date": "Answered June 20, 2018",
            "views": "388",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Balter",
                    "user_href": "/profile/Brad-Balter"
                },
                {
                    "user_id": "Ryan Hauser",
                    "user_href": "/profile/Ryan-Hauser-7"
                },
                {
                    "user_id": "Eric Takabayashi",
                    "user_href": "/profile/Eric-Takabayashi-1"
                },
                {
                    "user_id": "Samantha Gil",
                    "user_href": "/profile/Samantha-Gil-7"
                }
            ]
        }
    ]
}