{
    "title": "What is the difference between minor and major pentatonic scale boxes in guitar? - Quora",
    "tags": [
        "Pentatonic Scale"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Huether",
                "href": "/profile/Brian-Huether"
            },
            "answer_text": "People refer to boxes because of the shapes that these scales produce on the fretboard, when played 2-notes-per-string. With Minor Pentatonic, if we relate its intervals to Major Scale, we say it has notes 1 b3 4 5 b7. Which by the way is the 1st, 3rd, 4th, 5th, and 7th notes of a Natural Minor Scale, since Natural Minor, when defined relative to Major Scale’s intervals is 1 2 b3 4 5 b6 b7. The b3, b6 and b7 means take the 3rd, 6th, and 7th notes of the Major Scale starting from same root note and lower the 3rd, 6th, and 7th notes by a half step. So A Major = A B C# D E F# G#, and then A Minor = A B C D E F G. And so A Minor Pentatonic is A C D E G. With Major Pentatonic, if we relate its intervals to Major Scale, we say it has notes 1 2 3 5 6. Below shows an A Minor Pentatonic box shape as well as A Major Pentatonic. Notice these are not in same key, since the A Major Scale and the A Minor Scale are not from same key. This is to say that this is A Minor Pentatonic and its parallel A Major Pentatonic Scale.  But because any given Pentatonic Scale has its own version of modes (well, sort of), we also have the idea of relative Major and Minor Pentatonic. Since A Minor/Aeolian is the C Major Scale’s relative Minor, we know its relative Major Pentatonic Scale must be C Major Pentatonic. See below:  Notice how C Major Pentatonic starts from the 2nd note of the A Minor Pentatonic Scale. That is just a natural result of A Minor being the relative minor of C Major. And notice that they actually have the same notes. A Minor Pentatonic = A C D E G. C Major Pentatonic = C D E G A. That is why I said we sort of have the idea of modes. Once you understand how to repeat these scales across octaves and move them up and down the fretboard, you see how we can play Pentatonic lines all over the fretboard and not be confined to these boxes! Consider this:  That is one of endless ways to play Pentatonic all over the place! I highly recommend figuring out all the 2 note per string patterns starting from each note of the Pentatonic Scale. You already see the shapes starting from A and C. Next figure out starting from D. Because you know it will be same 5 notes, you just go up in order: D E G A C. And so on. Hope this all makes sense! I am not a big fan of scale books, thousands of scale diagrams, etc. I always recommend trying to understand scales at deep level so that you free yourself from even having a desire to look up scales online… Comment if something is not clear. Have fun! Brian Advanced Guitar Lessons on Technique and Theory ",
            "date": "Answered November 13, 2018",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Levi Pelc",
                    "user_href": "/profile/Levi-Pelc"
                },
                {
                    "user_id": "Sean Kabanuk",
                    "user_href": "/profile/Sean-Kabanuk"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "Dharma Shukla",
                    "user_href": "/profile/Dharma-Shukla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Whalen",
                "href": "/profile/Jerry-Whalen-1"
            },
            "answer_text": "The major and minor pentatonic scales are both contained in the same frame work. Using the G pentatonic scale as an example you can see how this works. The 1st one is the pentatonic minor, G Bb C D F // The 2nd one is the pentatonic major, Bb C D F G. By listing each scale type in a straight line you can see how they fit together. Ex: minor first, G Bb C D F // Bb C D F G. Next the pentatonic major as 1st, Bb C D F G // G Bb C D. A good formula for understanding the process is that the 2nd note of a pentatonic minor is the 1st note of the pentatonic major. The 1st note of a pentatonic major is the 5th note of the pentatonic minor. Jam with both major and minor forms in each of the various block configurations. You will be amazed with the combinations you can come up with. Good luck! ",
            "date": "Answered November 12, 2018",
            "views": "871",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}