{
    "title": "What is the correct order of sharps in a key signature? - Quora",
    "tags": [
        "Key Signatures",
        "Keys (music)",
        "Electronic Signatures",
        "Keys",
        "Signatures",
        "Music Theory",
        "Music Composition",
        "Pianos",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Whalen",
                "href": "/profile/Jerry-Whalen-1"
            },
            "answer_text": "I use a system that puts all the major scale keys in an easy-access format. This system is outside the circle of 5ths and 4ths but it is more easily accessed because you can recognize the key signature directly from the staff. The key of C major has no sharps # or flats bs. The key signatures in sharps evolve in 5ths. The note one-half step below the octave note is the name of the key signature. In each case, the last # is one half-note below the root. ( ) Key of G major has 1 # / F# (G) Key of D major has 2 #s / F#, C# (D) Key of A major has 3 #s / F#, C#, G# (A) Key of E major has 4 #s / F#, C#, G#, D# (E) Key of B major has 5 #s / F#, C#, G#, D#, A# (B) Key of F# has 6 #s / F#, C#, G#, D#, A#, E# (F#) Key of C# has 7 #s / F#, C#, G#, D#, A#, E#, B# (C#) For key signatures in flats bs, the key signatures evolve in 4ths. In each case, the 2nd to the last flat is the name of the key signature. Key of F major has 1 b / Bb (F) Key of Bb major has 2 bs / Bb, Eb (Bb) Key of Eb major has 3 bs / Bb, Eb, Ab (Eb) Key of Ab major has 4 bs / Bb, Eb, Ab, Db (Ab) Key of Db major has 5 bs / Bb, Eb, Ab, Db, Gb (Db) The key of Gb major has 6 bs / Bb, Eb, Ab, Db, Gb, Cb (Gb) The key of Cb major has 7 bs / Bb, Eb, Ab, Db, Gb, Cb, Fb (Cb) This is for the major scale key signatures for sharps#, and flats bs. All you have to do now is to use them to create your music! I hope you find this useful! Good luck! ",
            "date": "Answered July 12, 2020",
            "views": "195",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dimitri Czapkiewicz",
                    "user_href": "/profile/Dimitri-Czapkiewicz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Bethune",
                "href": "/profile/Larry-Bethune-2"
            },
            "answer_text": "Simple answer, if not the most profound… They are added in the order they appear; meaning the first key with a sharp is the key of G with F#; then key of D with F# and C#… The keys go in order of a 5th higher than the preceding key, so the keys with sharps are, in theory: G, D, A, E, B, F#, C#, G#, D#, A#, E#… etc. (in practice, once you get to C#, the rest do not get used as it is easier to use another name with fewer #s, example G# is the same notes as Ab, D# the same notes as Eb, and so on. Someone else may be able to give a better and clearer answer… too early on a Sunday morning to be clear headed :-) ",
            "date": "Answered July 12, 2020",
            "views": "132",
            "upvotes": "0"
        }
    ]
}