{
    "title": "What is your favorite red velvet fashion style? - Quora",
    "tags": [
        "Red Velvet (K-pop group)",
        "Fashion Trends",
        "Fashion and Style"
    ],
    "response": [
        {
            "author_info": {
                "name": "Redd Belbet",
                "href": "/profile/Redd-Belbet"
            },
            "answer_text": "Part 1 - Stage fashion / Part 2 -Street fashion of members (bottom) As a Reveluv, 70% of them are bad. Red Velvet needs a new stylist and has one of the worst stylist in kpop right now to be honest. Only few are good. She can only dress them well if they are wearing the same outfit, boring. We have weird concepts but it’s not an excuse to dress them terrible and Joy in skirts and she/he never considers Yeri and Irene’s body. My favorites include: Bad Boy, Peek a Boo (these two were always good), Psycho, and Be Natural and Automatic because they’re wearing the same thing (no stylist issues..) lmao   2. Street fashion Irene dresses pretty mature, Seulgi and Joy are fashion queens, Yeri pops off sometimes, and Wendy is very simple and sweet. Irene   As expected of our very mature leader. Very simple. Seulgi     Seulgi can go from mature, to tomboyish, to experimental (like the athletic shoes and with the suit/shorts, a suit, a dress, summer outfits. She’s very athletic so she can wear anything. She literally wakes up and puts her hair up and walks out with sweatpants sometimes haha. So good. Joy     Sooooo experimental and she looks so good in everything (like dresses the other members can’t pull off) because of her height and she is fit too. Joy is the biggest on Instagram and is wearing a different outfit each time. She is an inspiration to many. Yeri    Very simple at times but she has very good outfits from time to time. She’s young and likes to follow trends and has being following cottagecore lately. She’s not afraid to dress unusual either. She’ll have very good fashion as she gets older, she’s young! Wendy    Simple like Irene’s but she looks very good in puffy jackets and wears button ups from time to time. A tomboy like Seulgi but more simple. Wendy wears dresses sometimes too. Hope you enjoyed ",
            "date": "Answered October 4, 2020",
            "views": "200",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sakura Fun",
                    "user_href": "/profile/Sakura-Fun"
                }
            ]
        }
    ]
}