{
    "title": "What age did Freddie Mercury start singing? - Quora",
    "tags": [
        "Freddie Mercury",
        "Queen (band)",
        "Singing Voice",
        "Singers",
        "Rock Music",
        "Singing",
        "Age",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Meadows",
                "href": "/profile/Robin-Meadows-15"
            },
            "answer_text": "He started singing semi-professionally when he joined Ibex as their lead singer in August of 1969 at the Octagon Theater in Bolton, England at the age of 22. He was so nervous that he had his back to the audience during most of the first song but “by the end of the first number, the shyness had gone and he was performing well.” (from “Is This The Real Life” and “A Kind of Magic”) Then in October he first performed with them at Ealing College but he had gotten them to change their name to Wreckage. After Wreckage broke up he then became singer for a group called Sour Milk Sea for a short time before they broke up. From the beginning Freddie was very interested in singing songs with harmonies as well as being a lead singer. His mom said he loved to sing at a very young age and sang frequently. Long before he was sent to boarding school shortly before he turned 8 he would sing for their friends when they had company at the house and be “paid” in candy. In boarding school he immediately joined the school choir and loved it. He and four close friends formed a band called the Hectics and performed Elvis, Little Richard, Ricky Nelson and Fats Domino songs among others. But Freddie was not the singer for the group and didn’t seem to want to be as he was quite shy and was happy to remain in the background. However, he was the star in one sense because of his piano playing. Once he learned the chords he wasn’t interested in learning how to read music or in continuing with piano lessons because he could hear a new rock and roll song on the radio once then sit down at the piano and play it perfectly. The others in the group had makeshift instruments so his piano playing was key. When they performed at a girl’s school nearby the girls screamed at the front of the stage like they were at an Elvis concert. Quite an encouraging start. At Ealing College when it was discovered that Freddie could hear a pop or rock song and then play it by ear a group of boys would hang around the school piano and sing together. One of them was the lead singer for Brian’s and Roger’s group Smile named Tim Staffell who Freddie had already become friends with. They would all even meet in the bathroom to sing harmonies together because of the superior acoustics. Friends there recall Freddie grabbing a ruler as a mic and breaking out in loud song posing like a rock star. So like most who go on to become one of the greats he started with a love for his craft at a young age and was gifted with a great ear that not only allowed him to sing so beautifully but to master music and become a great song writer. ",
            "date": "Answered September 4, 2019",
            "views": "55",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rochelle Bydlon",
                    "user_href": "/profile/Rochelle-Bydlon"
                },
                {
                    "user_id": "Faye Conner",
                    "user_href": "/profile/Faye-Conner-3"
                },
                {
                    "user_id": "Gerlinde Bruckner",
                    "user_href": "/profile/Gerlinde-Bruckner"
                },
                {
                    "user_id": "Tara Baughman",
                    "user_href": "/profile/Tara-Baughman-3"
                },
                {
                    "user_id": "Thelma Sorenson",
                    "user_href": "/profile/Thelma-Sorenson"
                },
                {
                    "user_id": "Lynn Lorenz",
                    "user_href": "/profile/Lynn-Lorenz-2"
                },
                {
                    "user_id": "Eleanor Miser",
                    "user_href": "/profile/Eleanor-Miser"
                },
                {
                    "user_id": "Shawna Kimble",
                    "user_href": "/profile/Shawna-Kimble"
                },
                {
                    "user_id": "Marc David",
                    "user_href": "/profile/Marc-David-24"
                },
                {
                    "user_id": "Mary Wiley",
                    "user_href": "/profile/Mary-Wiley-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Briana Carper",
                "href": "/profile/Briana-Carper"
            },
            "answer_text": "Mercury spent most of his childhood in India where he began taking piano lessons at the age of seven while living with relatives. In 1954, at the age of eight, Mercury was sent to study at St. Peter's School, a British-style boarding school for boys, in Panchgani near Bombay. At the age of 12, he formed a school band, the Hectics, and covered rock and roll artists such as Cliff Richard and Little Richard. One of Mercury's former bandmates from the Hectics has said: \"the only music he listened to and played, was Western pop music.\" ",
            "date": "Answered April 19, 2019",
            "views": "380",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zhaoheng Chai",
                    "user_href": "/profile/Zhaoheng-Chai"
                },
                {
                    "user_id": "Lynn Lorenz",
                    "user_href": "/profile/Lynn-Lorenz-2"
                }
            ]
        }
    ]
}