{
    "title": "What are the best songs about sisters? - Quora",
    "tags": [
        "Sisters",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Holmes",
                "href": "/profile/Chris-Holmes-19"
            },
            "answer_text": "A few from my collection Sisters of Mercy Leonard Cohen, Beth Orton; Judy Collins, Dion Oh Sister Bob Dylan, Pearls Before Swine Sister Morphine Rolling Stones, Marianne Faithful Jiving Sister Fanny Rolling Stones Sister's Got a Boyfriend Rufus Thomas Superman’s Big Sister Ian Dury & the Blockheads Big Sister’s Clothes Elvis Costello Big Sister Elvis Costello Little Sister Elvis Presley, Ry Cooder Little Sister Nico Little Sister Rufus Wainwright Hello Little Sister The Fool Little Sister Leaving Town Tanita Tikaram Look At Little Sister Stevie Ray Vaughan Wake Up Little Sister Lindisfarne Wayward Sisters Klaus Nomi Baby Sister Dolly Parton Did Jesus Have A Baby Sister Dory Previn Sister Madrugada Sister Iain Matthews Sister Chris Holmes (not me, someone of same name) Sister Kate Tom Rush, Dave Van Ronk Sister Disco Who Sister Isabelle Del Shannon Sister Golden Hair America Sister Rosetta Alabama 3 Sister Rosetta Goes Before Us Plant & Page Sister Midnight Iggy Pop Soul Sister Allan Toussaint Babylon Sister Steely Dan Simple Sister Procol Harum Sister Madly Crowded House Like Sister & Brother Drifters My Sisters & Brothers Jerry Garcia Two Sisters Tom Waits You Are My Sister Anthony & the Johnsons Song for My Sugar Spun Sister Stone Roses Drivin’ Sister Mott The Hoople Don’t Cry Sister J. J. Cale Sister’s Coming Home Emmyllou Harris Tell My Sister Kate & Anne McGarrigle Sisters Are Doing It For Themselves Eurythmics ",
            "date": "Answered July 21, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gabriel Gn Jianlun (鄞建论)",
                    "user_href": "/profile/Gabriel-Gn-Jianlun-鄞建论"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Tearne",
                "href": "/profile/John-Tearne-1"
            },
            "answer_text": "Hmmm, does this question refer to nuns, brother- sister songs, sister- sister songs, or sisters as in the sisterhood. Nuns. This is a pretty small genre. I'll go with Dominique by the Singing Nun. This is purely nostalgia. Just don't translate it into english.  Having purged, scourged and cleaned after that, what comes next? Brother-sister I'm going with Stevie Ray, this maybe simply a reaction to Dominique.  Now I'm feeling better, whats up next? Sister-Sister. Two Little Sisters by Carly Simon.  Finally the Sisterhood. Comes down to a choice between two. You pick.   At last a better nun genre song.  ",
            "date": "Answered December 7, 2017",
            "views": "26",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Entwisle",
                    "user_href": "/profile/Jim-Entwisle"
                },
                {
                    "user_id": "Neal Miyake",
                    "user_href": "/profile/Neal-Miyake-1"
                },
                {
                    "user_id": "James McCallum",
                    "user_href": "/profile/James-McCallum-3"
                }
            ]
        }
    ]
}