{
    "title": "What's a song you listen to when you're sad? - Quora",
    "tags": [
        "Sadness",
        "Music Recommendations",
        "Songs",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marie Dyer",
                "href": "/profile/Marie-Dyer"
            },
            "answer_text": "You know? That's a great question that I find myself asking my self constantly! Maybe someone out there can tell me why it is that when I am sad 'n blue, l listen to sad 'n blue songs!? When I think of my childhood / teenage yrs. I think of the song by Janic Ian, \" At 17 \" EVERYTHING in that song-even making up guys or calling phone numbers picked out of the phone book, just to talk- describes my life before I became a mother. I loved Carol King, Gladys Knight, Janis Joplin, Cher, Etta James, Motown, Percy Sledge.... During the later yrs., before I met my husband I would listen to sad love songs about being dumped or left behind. To me, music was THE ONLY way I could describe my life to anyone who'd listen. I was not and still not good with words when it comes to describe true feelings, be it good or bad! When I got pregnant the song I found to describe the relationship between his biological father and I was \"Night Moves\" by Bob Seager. The night of my son's birth was \"You are so beautiful\" was the theme song. As he grew, Rod Stewart's song, \"Forever Young\". After he left home the song was, is and will forever be to my son and his children \" I hope you dance\". Speaking of Celine Dion, what's really crazy is when I heard the song that she sang to her husband \"Because you loved me\", says EXACTLY what I had been saying to God. Through all the seizures, car accidents, all the physical, emotional, psychological stress, how did I get through it? Because the strength, the courage He gave me. Just a few yrs ago everything started to come together. I love Percy Sledge's voice. The graveling sound, the high notes all still gives me chills, as many others do, but this particular song dont know who wrote it, that I had never heard, that has been song by many others was shown straight up on my phone. I'll never forget this...I was getting ready for bed and laid my phone on the bed. A few minutes later I went to pick up my phone and on it was the title of a gospel song. Mind you, I am not a person of religion, I don't go to church. But I do, at least now anyway, I absolutely do believe in God. The title staring back at me was \"Why me Lord\"? I was like, what?? Where did this come from? But being it was sung by one of my top favorites I felt I owed it to Percy, to me and to God to say, \"ok, (G)guys let me have it\"...during the first verse the tears came streaming down! I finally got the answer! Why me, Lord? Because \"just maybe, Lord, I can show someone else what I've been through myself on my way back to You\" Amen!! Trust me everyone, I have absolutely no reason to believe iothern anything other than the fate of God is with me always. During the last days of my husband's fatal illness, I was riding on the bus and ANOTHER song, by Percy Sledge appeared, \"First you cry\" ironic? Yes, but even more so eerie. I guess the words were to strengthen me up, hold tight getting me ready to face the inevitable. On March 26th, 2015, my husband passed and to this very second as I write, when the words from that song go through my head \" there's no happiness without any rain, ...don't be so sad, it ain't so bad you'll get by, but first you cry\" when I play that song i still cry. But I have noticed myself getting stronger. I do still cry when I hear those words, but not as often and definitely not as hard. With all that being said, when someone has the answer to that very question above ... please fill me in! Thanks, God Bless everyone and have a safe, happy holidays Marie ",
            "date": "Updated November 12, 2016",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jithendra Sampathi",
                    "user_href": "/profile/Jithendra-Sampathi"
                },
                {
                    "user_id": "Lix Marie",
                    "user_href": "/profile/Lix-Marie-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Summer-Morales-10"
                },
                {
                    "user_id": "Mike Letour",
                    "user_href": "/profile/Mike-Letour"
                },
                {
                    "user_id": "Candy Carter",
                    "user_href": "/profile/Candy-Carter-9"
                },
                {
                    "user_id": "Jayne Womack",
                    "user_href": "/profile/Jayne-Womack-1"
                },
                {
                    "user_id": "Joaquin Markison",
                    "user_href": "/profile/Joaquin-Markison"
                }
            ]
        },
        {
            "author_info": {
                "name": "N Rose",
                "href": "/profile/N-Rose-7"
            },
            "answer_text": "There's an old, old, old song I always resort to when I'm feeling a little sad. I'm not sure who wrote it or when. I just know how it goes. When I sing this song I feel that a sense of calm, and strength prevail over the sad. There is a huge learning that comes from the struggles and triumphs of those who have been able to take the best from the worst and overcome unbeatable challenges. This is what I remember. Chorus It takes a worried man to sing a worried song. It takes a worried man to sing a worried song. It takes a worried man to sing a worried song. I'm worried now, but I won't be worried long. Verse one: I went across that River and I lie down to sleep. I went across that River and I lie down to sleep. I went across that River and I lie down to sleep, When I woke up, I found shackles on my feet. Chorus Verse two: I asked the judge what's going to be my fine. I asked the judge what's going to be my fine. I asked the judge what's going to be my fine, Twenty one years, on the Rocky Mountain Line. Chorus Verse three: I look down the road as far as I can see. I look down the road as far as I can see. I look down the road as far as I can see, And all I saw, was a little hand waiving back to me. Chorus ",
            "date": "Answered November 9, 2019",
            "views": "350",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janet Moala",
                    "user_href": "/profile/Janet-Moala"
                }
            ]
        }
    ]
}