{
    "title": "What are some methods for staying awake while driving at night? - Quora",
    "tags": [
        "Staying Awake",
        "Insomnia",
        "Night",
        "Tips and Hacks for Everyday Life",
        "Sleep Science",
        "Tips and Hacks",
        "Sleep Habits",
        "Driving",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wilfred Firley",
                "href": "/profile/Wilfred-Firley"
            },
            "answer_text": "i worked for greyhound for many many years and was on what they called the spare board, meaning i was on call 24hrs a day, as one could imagine, being in this kind of working environment we drove all night or all day depending on the call up from dispatch, the best trick i would do while i drove and started to nod off was i would stick my hand out of the little side window of the bus, the cold air would give my body a shock and invertedly would shock it awake, im not saying this would work for everyone but the trick is not to eat a heavy meal before a long drive, keep the vehicle cooler , stop the car and get out, kick a few tires, have a break, even talk to a few people if its possible, thats my best advice and it served me well, ",
            "date": "Answered July 27, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Langley",
                "href": "/profile/Scott-Langley-30"
            },
            "answer_text": "Well to be honest there are 2 ways to do that. One way works perfectly but has side effects and long term repercussions that are worse for some than others. That is stimulants of varying degrees of strength. Starting with lots of coffee and running the spectrum to shooting crystal meth in your veins but it's all the same thing. The best way is lots of sleep and water and in an emergency if you're nodding off and you can't pull over, then pinch the skin on the inside of your thighs where it's very thin close to your genitals but not them. Unless you're into that. Fresh cold air helps but if you're tired pull the fuck over please. Unless you're high than carry on sir. Good luck. ",
            "date": "Answered October 21, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gautam Khanna",
                    "user_href": "/profile/Gautam-Khanna-32"
                }
            ]
        }
    ]
}