{
    "title": "What made you like emo-rap? - Quora",
    "tags": [
        "Emo Rap",
        "Music Trends",
        "Juice Wrld",
        "XXXTentacion (rapper)",
        "Independent Music",
        "Genres",
        "Rap Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zain Arshad",
                "href": "/profile/Zain-Arshad-35"
            },
            "answer_text": "Emo rap has been apart of my collection for 6 months now. What caused it to be there Well, it all started 1.5 years ago. I was doing well in school, but lost who I actually was. Around this time, I started listening to the Into the Spider-verse Soundtrack. I thought it wasn’t too good. I listened to it a few more times, and found a song that helped me through the rest of the year. Hide, by Juice WRLD. This song helped me finding who I actually am, what I enjoy. Listening to this for months, then I hear about Juice’s death. It shattered me. The guy that helped me through my darkest times, is now gone. I start listening to other hits of Juice’s like Lucid dreams, All girls are the same etc. 4 months prior to this answer, I was given an assignment of analysing rap songs. I chose Scared Of The Dark. I did good on the assignment, got a B, but lets get back to the point. I was invested in X’s part in the song. It was short, but still had so much meaning to it. I researched about him, and listened to his music, with the first being Hope. I just loved the way X is able to add so much meaning to his lyrics, and the way he uses the music to his advantage. To later on find out about his death shocked me. So now today, I listen to Juice and X My two favourite music legends  ",
            "date": "Answered June 25, 2020",
            "views": "403",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Petrini",
                    "user_href": "/profile/Jonathan-Petrini"
                },
                {
                    "user_id": "Samuel Paul",
                    "user_href": "/profile/Samuel-Paul-254"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Holtz",
                "href": "/profile/Nick-Holtz"
            },
            "answer_text": "I used to hate emo rap back in high school, but after hearing about Lil Peep’s overdose, XXXTentacion’s murder, and Juice Wrld’s overdose, I started to like emo rap a little bit more because they all got the concepts of being emo and combining emo music with rap rock. That’s what emo rap is supposed to be. Plus, I didn’t know about one of my favorite rap rock artists, Travie McCoy, I never knew that he’s emo rap, too. ",
            "date": "Updated October 9, 2020",
            "views": "148",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Malibou-Blu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abraham Oliva",
                "href": "/profile/Abraham-Oliva-2"
            },
            "answer_text": "Honestly, I didn’t listen to emo rap in the past. But then some of my friends told me to check it out. I wasn’t really excited and I didn’t think I would like it. I was curious though. After hearing a couple songs I found myself liking it. Then I listened to XXX Tentacion. Damn. That made me start listening to it more often. RIP XXX. ",
            "date": "Answered October 28, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Carla Marie",
                    "user_href": "/profile/Carla-Marie-142"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daunte Seegobin",
                "href": "/profile/Daunte-Seegobin-1"
            },
            "answer_text": "Emo rap… Its relatable to everyone who has gone through depression and me dealing with that and self-harm it makes it even more relateable to those who have heartbreak or had a hard life in general, I was going through a hard time when I discovered xxxtentacion it was a very sad year my mother and father split up and I needed guidance I listened to some of his songs then looked at his interveiws and realized that he had been through a lot of the same things as us… he was a person and did not have a “gangstar\" persona then I also to Juice WRLD, Trippie Redd, Lil Peep etc. Short answer: It is relatable to everyone who has been through something like depression or been through some type of struggle. ",
            "date": "Answered September 6, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Carla Marie",
                    "user_href": "/profile/Carla-Marie-142"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aura Taylor",
                "href": "/profile/Aura-Taylor-3"
            },
            "answer_text": "Honestly, at the time, I think I was heavily influenced by the people I surrounded myself with. I took park in the whole emo-fashion style, and therefore we all listened to that style of music. Don’t get me wrong, I genuinely enjoyed it at the time, but have now moved on and found a genre I prefer on my own. I still listen to some songs and enjoy them, more because they’re linked to good memories at the time. ",
            "date": "Answered May 5, 2020",
            "views": "87",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carla Marie",
                    "user_href": "/profile/Carla-Marie-142"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carla Marie",
                "href": "/profile/Carla-Marie-142"
            },
            "answer_text": "XXXTenacion  I started being an XXXtenacion fan when I heard his album titled “17”. “Everybody Dies In their Nightmares” , “Jocelyn Flores” , and “FxCk Love” are among my favorites I would say his music inspired me in certain ways to understand my feelings about life.  He also had such a unique look. Songs Like “Look at me” at first deterred me from actually listening to his music. ",
            "date": "Answered May 5, 2020",
            "views": "257",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash Tiwari",
                    "user_href": "/profile/Yash-Tiwari-140"
                },
                {
                    "user_id": "Devontae Crawford",
                    "user_href": "/profile/Devontae-Crawford-5"
                },
                {
                    "user_id": "Nathan Lucas",
                    "user_href": "/profile/Nathan-Lucas-58"
                },
                {
                    "user_id": "Annabell Iwaizumi",
                    "user_href": "/profile/Annabell-Iwaizumi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura M. Jones",
                "href": "/profile/Laura-M-Jones-1"
            },
            "answer_text": "I was kinda depressed when I first started to listen to emo-rap. One of XXXTentacion’s songs came up on my Google Music Playlist, SAD!, and I related to it so much that I started exploring that genre a little more. Now it’s one of my favorites. ^.x.^ Magz ^.x.^ ",
            "date": "Answered May 5, 2020",
            "views": "80",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carla Marie",
                    "user_href": "/profile/Carla-Marie-142"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Sims",
                "href": "/profile/Brian-Sims-61"
            },
            "answer_text": "I don’t like emo-rap ",
            "date": "Answered May 17, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sebastian Flores",
                    "user_href": "/profile/Sebastian-Flores-61"
                }
            ]
        }
    ]
}