{
    "title": "What do you do when you feel lonely and are single? - Quora",
    "tags": [
        "Dealing with Loneliness",
        "Coping with Loneliness",
        "Understanding Loneliness",
        "Being Single",
        "Solitude",
        "Loneliness",
        "Understanding Emotions",
        "Emotions",
        "Dating and Relationships",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "I cannot ever remember feeling lonely when alone but I have felt lonely following someone saying goodbye..sometimes in an unpleasant way (so for me, the parting can be sad, but not me being alone). I’m 73 and live alone and long ago I learned to stay busy with the topics and behaviors I am attracted to and remain curious about. Personally, I have many simple daily routines that “I love” (by choice) so I always look forward to them….they are like friends to me…their assured predictability is very satisfying to me. Plus as I said, I have topics I am forever curious about….they are unending in being curious to me. And that is again, because I am deliberate in creating them to be attractive. I don’t sit back and “judge/condemn” those topics or behaviors because i decided I would love and appreciate them. This is very much a mindset to “be happy” with what I can easily and ongoingly access and spend time with. Mostly, instead of people (and their predictability or unpredictability) being friends, I have those topics and behaviors as friends. I can and do spend time with family members at times but invariably, after (too long) of a time near them, some “fairly predictable” conflict arises as some inner issues they have “come out”. I actually prefer my preferred topics and behaviors so I can very comfortably turn away from what I find offensive rather than hurt the feelings of other people when I turn away.  Example: I spent a week with three of my five children and then two months later, a week with my wife (we’re separated) and her son and four grandchildren. I truly enjoyed that time with them and saying goodbye was, as usual, a bit sad. But for sure, I looked forward to being home and alone again and it was beautiful walking back into my apartment complex, my apartment and all those topics and behaviors I love.  I hope this helps. ",
            "date": "Updated October 24, 2020",
            "views": "192",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Roberts",
                    "user_href": "/profile/Matthew-Roberts-601"
                },
                {
                    "user_id": "Elizabeth Morrow",
                    "user_href": "/profile/Elizabeth-Morrow-17"
                },
                {
                    "user_id": "Moreen Coyle",
                    "user_href": "/profile/Moreen-Coyle"
                },
                {
                    "user_id": "Amani",
                    "user_href": "/profile/Amani-61"
                },
                {
                    "user_id": "Bella Rose",
                    "user_href": "/profile/Bella-Rose-689"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaliyah Muhammad",
                "href": "/profile/Kaliyah-Muhammad-2"
            },
            "answer_text": "I’m single and it often happens where i feel lonely. What I suggest is that you find something that makes you happy and keeps you entertained. For example, I like to scroll through TikTok a lot and I’m honestly obsessed with it. It distracts me from feeling lonely sometimes, and it gave me an opportunity to meet some pretty amazing people in the TikTok community <3 Honestly though, sometimes it’s okay to just listen to sad music and cry the loneliness out. I use to do it all the time when I went through (and still going through) my breakup. Crying allows your emotions you’ve been bottling up to be released through your tears. It definitely helped me and still does Hopefully this helps <3 ",
            "date": "Answered October 18, 2020",
            "views": "261",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Zeng",
                    "user_href": "/profile/Greg-Zeng"
                },
                {
                    "user_id": "Anna Shaw",
                    "user_href": "/profile/Anna-Shaw-100"
                },
                {
                    "user_id": "Bella Rose",
                    "user_href": "/profile/Bella-Rose-689"
                }
            ]
        }
    ]
}