{
    "title": "What are the best Stone Roses songs? Why? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Saurav V Gill",
                "href": "/profile/Saurav-V-Gill"
            },
            "answer_text": "They have a short Discography but it would be like Quality over Quantity.  If I’ll give them numeric ranks out of ten (for my best 5 songs of them) then I'd say. 1. I Wanna Be Adored - 10/10 Why - Just amazing voice of Ian Brown and a different tone than other TSR songs. 2. Love Spreads - 10/10 Why - Groovy beats and the only song of them for any mood. 3. I Am the Resurrection - 9/10 Why - The masterpiece of over 8 minutes and Instrumental outro is at their best. 4. Fools Gold - 9/10 Why - Drums, rhythmic beats and for mood of dance. 5. Waterfall - 9/10 Why - Best lyrics by them ever along with Intro and Guitar riffs. ",
            "date": "Updated October 3, 2017",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Malik",
                    "user_href": "/profile/Rahul-Malik-405"
                },
                {
                    "user_id": "Justin Afrika",
                    "user_href": "/profile/Justin-Afrika"
                },
                {
                    "user_id": "Shamith Ka",
                    "user_href": "/profile/Shamith-Ka"
                },
                {
                    "user_id": "Craig Thomson",
                    "user_href": "/profile/Craig-Thomson-12"
                },
                {
                    "user_id": "Tom P",
                    "user_href": "/profile/Tom-P-17"
                },
                {
                    "user_id": "B A",
                    "user_href": "/profile/B-A-176"
                },
                {
                    "user_id": "Scott Smith",
                    "user_href": "/profile/Scott-Smith-106"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Johnson",
                "href": "/profile/Rob-Johnson-90"
            },
            "answer_text": "I usually cringe at asking a question about music this way because “best” is subjective in music imho. Are you going to rate “best” on “how many notes?” or “how many chords?” or “are there key changes?”? Don't mean to be pedantic about this, but I think it's fun to discuss this as what your favorite songs are by a band, or in a genre, ever etc. That said, the correct answers are: She Bangs the DrumsI am the ResurrectionMersey ParadiseFool’s GoldBreaking into HeavenMade of StoneI wanna be adoredWhy? Cuz I said so. ;-) ",
            "date": "Answered February 22, 2017",
            "views": "627",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Afrika",
                    "user_href": "/profile/Justin-Afrika"
                },
                {
                    "user_id": "Craig Thomson",
                    "user_href": "/profile/Craig-Thomson-12"
                }
            ]
        }
    ]
}