{
    "title": "What musical artist did you stop listening to and why? - Quora",
    "tags": [
        "Listening to Music",
        "Listening",
        "Singers",
        "Artists and Creative Professions",
        "Rock Music",
        "Music Recommendations",
        "Music Industry",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glenn Huthersall",
                "href": "/profile/Glenn-Huthersall"
            },
            "answer_text": "Led Zeppelin. I stopped listening to them many years ago (didn’t buy any of their product after Presence). There are several reasons but I’ll provide one: Robert Plant As he got older his voice was dodgy at best. And he knew it, but why didn’t he just say that? Somehow, I couldn’t see him relying on pitch control devices and other technical enhancements to improve his voice so it’s obvious to see why he nixed the reunions. Also his arrogance, mostly because he had “grown tired” of the constant question; “When’s the next Zeppelin reunion?” What did he expect people to ask him? “How’s the stamp collection coming?” And when the questions did stop and more and more people began to lose interest, who was the first to start the rumours again? Him. I just got sick of the pompous asshole and his excuses. Page once told The NY Times he was ready to hit the stage with Zeppelin again – but blamed the lack of progress on a disinterested Plant. “I was told last year that Robert Plant said he is doing nothing in 2014, and what do the other two guys think? Well, he knows what the other guys think. Everyone would love to play more concerts for the band. He’s just playing games, and I’m fed up with it, to be honest with you. I don’t sing, so I can’t do much about it. It just looks so unlikely, doesn’t it?” Then on June 24, 2018 · Robert Plant and Jimmy Page are in talks to reunite as Led Zeppelin for the band's upcoming 50th anniversary. Only to hear, “Plant refuses to return to the stage with Page.” Hundreds of times I’ve heard the story that Led Zeppelin will reunite, only to hear hundreds of denials from Plant - all while getting the attention he still desperately craves. So he can engage in all the childish bubble-bursting he likes. I fail to see his relevance.  ",
            "date": "Answered April 13, 2019",
            "views": "56",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will Houston",
                    "user_href": "/profile/Will-Houston-10"
                },
                {
                    "user_id": "Chris Leotti",
                    "user_href": "/profile/Chris-Leotti"
                },
                {
                    "user_id": "Eason Rangarajan",
                    "user_href": "/profile/Eason-Rangarajan"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires-2"
                },
                {
                    "user_id": "Mohit Rathore",
                    "user_href": "/profile/Mohit-Rathore-133"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Strife",
                "href": "/profile/Dan-Strife"
            },
            "answer_text": "First of let me claim one thing for my well being: Different music drives different people. So that out of the way, I stopped listening to any rapper in general. My first reason is because when I was a child, I had a past where I grew up on rap. I listened to it all of the time, but when I hit the right age, I finally started getting what the words meant. Usually talks about sex, porn, and irritable behavior that is atrocious. At this point, I started to read the Bible. It was my only escape from anything that involved sex, something I was convinced (under proverbs chapter 7) that involved women who were voluptuous and just basically ruined my childhood. Of course, this didn’t go un-noticed. Eventually my hormones kicked in and I started to listen to Rap once again. This made me start digging the hole i’m constantly trying to get out of. Secondly, the hole I’m in became constant. I watched porn over and over, and before you know it, rappers started justifying the term “fucking” over good mutual sex. And then it started. Our schools began to corrupt. Want to know why rape culture is so prominent now? It’s because… three: A lot of rap songs now talk about sex or “fucking” or hookers and hoes, prostitutes, etc. So to get me out of my hole, I prayed to god. I started listening to people like Eminem got morals rather than people like “lil pump” or etc… So now I have found a happy-medium that limits the porn I watch, and I force myself to read the Bible so I don’t lose the idea of a normal relationship and why girls are not prostitutes. I even started writing a book you may see later under my pen-name. That is, IF it comes out. So I encourage those who are in the same hole of addiction that I was to consider religion over pornography, and your life will be so much better. I promise you. Take my advice, or don’t, it’s up to you to change it. -Dan Strife ",
            "date": "Answered March 29, 2019",
            "views": "459",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohit Rathore",
                    "user_href": "/profile/Mohit-Rathore-133"
                }
            ]
        }
    ]
}