{
    "title": "What are some good classical songs? - Quora",
    "tags": [
        "Music Recommendation Lists",
        "Song Lists",
        "Classic Rock Music",
        "Classical Music",
        "Music Recommendations",
        "List Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaron Squire",
                "href": "/profile/Aaron-Squire-6"
            },
            "answer_text": "It would be hard to give a true top 10 of my favorite classical songs, since there are so many different types out there, so I will narrow this question down and answer my top 10 favorite piano songs. 10- Piazzolla - Libertango: this song is almost action like, and reminds me of a boss fight theme almost. It was hard for me to chose this number 10 spot, but I am going to give it to Libertango. 9- Chopin - Prelude in E Minor (Op. 28 No. 4): very slow sad song. Excellent use of diminished chords throughout. 8- Passacaglia – Handel/Halvorsen: I may be biased towards this one since I just heard it for the first time the other day, but this is a very good piece of music. It is very different and gives me a certain feeling that no other piece of music was able to do. 7- Chopin - Waltz in C Sharp Minor: very classic Chopin. Pretty song throughout, just a very well done piece of music. 6- Liszt - Hungarian Rhapsody No. 2: This song can be very hit or miss for me. When a really good pianist is playing, this is one of my top spots, but if there is any hesitation or lack of confidence from the pianist, than it can completely ruin it. 5- Chopin – Etude Op.25 No.5: This is the only song that uses “wrong” notes right. The dissonance in the first section is so brilliantly done, that there will never be another piece to replicate this sound. 4- Liszt – Liebestraum No. 3: Just a very good slow song. Does everything right. 3- Kreisler - Liebesleid (Love's Sorrow): I love when pieces tell a story, and this one does just that. The way it’s structured is just so good, and is easily my favorite “hit you in the feels” song. 2- Satie - Gymnopédie No. 1: I know this is going to be a little cliche, but this song is just so simple, yet so good. I have never seen such a simple piece evoke so much emotion into the listener, so you gotta give the song props there. 1- Chopin - Nocturne in E Flat Major (Op. 9 No. 2): This song will simply never be topped on my list. It is just the perfect song to me. Everything about it is perfect, and I can remember listening to the first time and just being in awe from how well done this piece is. This list is obviously subjective, and I recommend that the listener listens to performances by Kassia or Rousseau on YouTube, as both of them are very good pianists. Also try to limit the distractions around you to get the most out of each piece. Happy listening :) ",
            "date": "Answered November 26, 2019",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Tucker",
                    "user_href": "/profile/Dennis-Tucker-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Kandpal",
                "href": "/profile/Akshay-Kandpal-1"
            },
            "answer_text": "kashmir and stairway to heaven by led zeppelin comfortably numb and high hopes by pink floyd hotel california by the eagles layla and white room by eric clapton piece of my heart, summertime, ball and chain by janis joplin against the wind and night moves by bob seger in my life , here comes the sun , something , cant do that , while my guitar gently weeps , hey jude , tomorrow never knows, all you need is love, dont let me down , and helter skelter by the beatles woman, woman is the nigger of the world , imagine, real love, nobody told me, working class hero, jealous guy, beautiful boy and instant karma by john lennon three little birds, redemption song, no woman no cry, buffalo soldier , is this love , and jamming by bob marley knocking on heavens door and november rain by guns and roses voodoo child and all along the watchtower by jimi hendrix man who sold the world , heart shaped box , something in the way, where did you sleep last night , plateau, in bloom , serve the servants, dumb, all apologies , on a plain by nirvana bohemian rhapsody , show must go on and under pressure by the queen tambourine man, blowing in the wind, like a rolling stone and positively fourth street by bob dylan when the music over, light my fire, the end, hyacinth house, moonlight drive and riders on the storm by the doors highway to hell, back in black and thunderstruck by ac/dc you cant always get what you want and sympathy for the devil by the rolling stones ",
            "date": "Answered April 23, 2017",
            "views": "155",
            "upvotes": "0"
        }
    ]
}