{
    "title": "What constitutes plagiarism in music? - Quora",
    "tags": [
        "Plagiarism Detectors",
        "Plagiarism",
        "Music Composition",
        "Copyright Law",
        "Music Industry",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Plagiarism is the ethical concern that ideas are being taken from one person and used by another without attribution. That’s not really something that music worries about. There are no sanctions by audiences or publishers if you use ideas from someone else, not like there are in academia or journalism. If you commit plagiarism in those two fields, your career is over. I suspect you are really asking about copyright infringement, the law against using actual parts of someone else’s music in your music. Frankly, juries have been pretty much on the side of small musicians in the past decade and it is not a good time to be borrowing any elements at all. Some of these are legally “bad decisions”, but they are jury decisions and thus the verdict of your peers. So currently, Katy Perry has lost a lawsuit by using a three note aprecio[1], Pharrell lost a lawsuit for writing a song in the “style” of Marvin Gaye[2] without actually copying any line of music at all, and Led Zepplin are looking at getting a re-trial[3] on a case against Stairway to Heaven using a chord progression from someone else’s song (a chord progression that is, in fact, common in a lot of rock music). Sampling is definitely not legal if you lack permission. The Federal Court decided that back in the 90s[4] And parody musicians like Weird Al definitely ask for permission first. A lawsuit, after all, could delay the release of an album by years. So why wouldn’t you just ask for permission and not deal with getting sued in the first place, whether or not you would win? Footnotes[1] Katy Perry and Co-Writers Call ‘Dark Horse’ Decision a ‘Travesty of Justice’[2] Marvin Gaye family prevails in 'Blurred Lines' plagiarism case[3] Led Zeppelin’s ‘Stairway to Heaven’: Appeals Court to Review Lawsuit Decision[4] Biz Markie Guilty of Copyright Infringement - Today in Hip-Hop - XXL",
            "date": "Answered September 20, 2019",
            "views": "249",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaymian Poon",
                    "user_href": "/profile/Jaymian-Poon"
                },
                {
                    "user_id": "Barnaby Page",
                    "user_href": "/profile/Barnaby-Page"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Maria Solare",
                "href": "/profile/Juan-Maria-Solare"
            },
            "answer_text": "Plagiarism is not taking a musical idea from another composerm but the actual notes. For instance, if you take the idea of making an opera about Aida, you are not plagiarazing Verdi.You are if you take the actual melodies and say they are yours. If you compare with literature: writing about the plot (i.e. the idea) of Otello is not copying/plagiarizing Shakespeare. Copying the wording, is. Of course the point becomes extremely difficult when you consider two (in principle legitimate) possibilities: a) quotation b) copying a structure of a music piece, not the melodies (that can be a chord progression, as Norman Graham mentioned, or the form, or whatever half-hidden construction element). Juan Maria Solare ",
            "date": "Answered September 24, 2019",
            "views": "211",
            "upvotes": "0"
        }
    ]
}