{
    "title": "What is the first thing girls look for in guys? - Quora",
    "tags": [
        "Dealing with Attraction",
        "Attraction and Attachment",
        "Dating Advice for Young People",
        "Attraction (interpersonal)",
        "Relationships and Dating of Young People",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aarzoo Jain",
                "href": "/profile/आरज़ू-जैन-Aarzoo-Jain"
            },
            "answer_text": "Once at a party, a guy just grabbed my attention for the rest of the evening. He was dapperly dressed and danced like he was celebrating his success which by the way was not the case. I saw him hugging people, to guys a hard pat on back, to female a subtle touch with tenderness​. He had a smile throughout. Noticed. Once a guy friend of mine touched my palm so gently to make me feel better out of a situation. And it did and I almost fell in love with that gesture. Noticed. Once I held the door open for a guy to pass first. He gave a quick nod, walked through, stopped and turned just to thank me. Noticed. Once at a restaurant, as the food was being served, I looked up at the waiter saying Thank You with a warm smile. The guy with me chose to compliment me the very next moment,not before not after. Noticed. Once at a library, the guy was deep into his books. Marking, underlining, writing. Hundreds of distraction with everyone coming and going, door noise, chair noise but he seemed so immersed and dedicated, he'd just look up to glance and then back to his books. Noticed. Once at a lecture, the guy spoke with such pitch and firmness that I was compelled to turn my head to look as to who just articulated. Noticed. Once at a building, the guy with me smiled at the little girl and offered her a chocolate from his bag. She beamed with joy. He beamed with happiness. Noticed. Once at a temple, the guy bowed his head with utmost sincerity that was hard to go unnoticed. Noticed. Once at an event, the guy wore a neat white shirt. Noticed. What is common among all the guys mentioned above is their mere Sense of Self, the first thing we look for in guys. Organic and unbeatable. What we see, what we notice depends mainly on what we look for. Courtesy, humility, politeness, confidence, discipline, generosity, chivalry, almost everything gets noticed and admired if not faked. Get yourself some brownie points by keeping it simple yet significant and that would be the golden rule. ",
            "date": "Answered August 26, 2017",
            "views": "1099",
            "upvotes": " View 752 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ruben Tzolov",
                    "user_href": "/profile/Ruben-Tzolov"
                },
                {
                    "user_id": "Animesh Arya",
                    "user_href": "/profile/Animesh-Arya-9"
                },
                {
                    "user_id": "Maisum",
                    "user_href": "/profile/Maisum"
                },
                {
                    "user_id": "Helen Tan",
                    "user_href": "/profile/Helen-Tan-130"
                },
                {
                    "user_id": "Akib Zuhair Samin",
                    "user_href": "/profile/Akib-Zuhair-Samin"
                },
                {
                    "user_id": "Vaishali Kanwar",
                    "user_href": "/profile/Vaishali-Kanwar-5"
                },
                {
                    "user_id": "Joey Lee",
                    "user_href": "/profile/Joey-Lee-382"
                },
                {
                    "user_id": "Jeff Sanders",
                    "user_href": "/profile/Jeff-Sanders-169"
                },
                {
                    "user_id": "Adarsh Sajeev",
                    "user_href": "/profile/Adarsh-Sajeev-2"
                },
                {
                    "user_id": "Tex Westbrook",
                    "user_href": "/profile/Tex-Westbrook"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daphne Anne Enriquez",
                "href": "/profile/Daphne-Anne-Enriquez"
            },
            "answer_text": "This is just my personal opinion on what I looked for before my boyfriend and I got together: Gentleness - Girls like me don’t really like men who are easily angered or have a short temper (mostly because my dad is that and I’d hate to marry a man who breaks a nerve at the smallest things). This doesn’t necessarily mean that girls don’t like dominant guys. Just that a short temper can be a big turn off. Add gentleness with kindness, then there’s a chance girls would like to get to know you better.Giving without expecting anything in return - My boyfriend does this thing where he gives people online (even strangers sometimes) a game they like on Steam on their birthday. He never really mentioned it a lot. I just found out he did it when I asked. When I asked why, he just says that making people happy made him happy. I fell in love deeper when he admitted that.The same humor she has - Whatever humor it may be. Dark, fart jokes, puns, memes, Rick rolls. A girl would usually find someone whom they can share her humor with. This is also another good foundation in a relationship. Also laughing with your partner is just the best thing :3 My boyfriend and I laughed hard at a fart joke for about 3 minutes and it was amazing.A shoulder to cry on - Women will get turned off to a man who invalidates her struggles. If you brush off her problems, tell her to grow a pair when she cries, or call her stupid when she gets anxious, they won’t like that. You are not being a reliable source of comfort and they will find that with someone else.A healthy mindset - It pisses me off when people judge with just one look and then act like a dick to that person. Keep an open mind and look at the positive every once in a while, especially in the relationship. Be kind to even the person that pisses you off sometimes. It will show her that she can trust you to be mature when both of you will encounter arguments. Girls will like that.Patience - Men who force themselves on a woman would send her lots of red flags and make her run away from you. If she’s having a bad day and is venting over it, don’t get mad back. If she says “no”, don’t beg for her yes but earn it. If she’s taking too long to prepare herself, compliment her little mannerisms and she might be flustered enough to just get it done XDDThat’s just some. Of course girls always have a preference with looks and beliefs. But every girl is different and each girl doesn’t look at each guy the same way as another girl does. I just shared mine because, while I was crushing on my boyfriend before, those were the things I looked for and he has everything I looked for. It’s not the same for all girls. But majority would probably look for most of those. ",
            "date": "Answered April 18, 2018",
            "views": "455",
            "upvotes": " View 81 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vaishali Kanwar",
                    "user_href": "/profile/Vaishali-Kanwar-5"
                },
                {
                    "user_id": "Dennis Lopez",
                    "user_href": "/profile/Dennis-Lopez-78"
                },
                {
                    "user_id": "Jessica Niver",
                    "user_href": "/profile/Jessica-Niver"
                },
                {
                    "user_id": "Jibriel Odorosh",
                    "user_href": "/profile/Jibriel-Odorosh"
                },
                {
                    "user_id": "Tex Westbrook",
                    "user_href": "/profile/Tex-Westbrook"
                },
                {
                    "user_id": "Lynda Franchino",
                    "user_href": "/profile/Lynda-Franchino"
                },
                {
                    "user_id": "Yoong Dominic",
                    "user_href": "/profile/Yoong-Dominic"
                },
                {
                    "user_id": "Prince Dennis",
                    "user_href": "/profile/Prince-Dennis-16"
                },
                {
                    "user_id": "Omode Paul",
                    "user_href": "/profile/Omode-Paul"
                },
                {
                    "user_id": "Aadesh Chauhan",
                    "user_href": "/profile/Aadesh-Chauhan-10"
                }
            ]
        }
    ]
}