{
    "title": "What are some 'hard to swallow' facts about the K-pop group Ateez? - Quora",
    "tags": [
        "ATEEZ (K-pop group)",
        "K-Pop Idols",
        "South Korea"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chicka Jefe",
                "href": "/profile/Chicka-Jefe"
            },
            "answer_text": "I am writing these from the perspective of the industry and not as a die-hard fan and these are my opinions, I am not hating or criticizing Ateez in any way, I absolutely love and adore these boys. 1)The rap line is weak and needs a third member. Honestly, Hongjoong and Mingi are good but both have major flaws that make them be considered as weaker rappers compared to many other idols out there and since they get many lines their flaws stand out in comparison. Also for an 8 member group it makes no sense why there are only 2 rappers, I hope Seonghwa gets to rap in the future as he wanted. 2)They lipsync. All members lipsync during most of their performances. And honestly, it makes complete sense. They don’t have very good stability but are improving each comeback and have to perform extremely hard choreographies. They are also rookies, haven’t even completed 2 years in the industry so for the time being this should not be a problem, especially since they do sing live for less dance-heavy songs like fever and even try to sing in the heavy ones. 3) San, Hongjoong, and Seonghwa should get the most center time in performances. These three have the best stage presence in the group and have been responsible for bringing 90 percent of the fandom in. From a marketing perspective, the group should try to use their strengths to their best in the beginning and gain as many fans as they can. I am not saying they should be the only ones getting all the lines and center time, but most overall. 4)Yeosang, Yunho, and Jongho have the least stage presence. Jongho and Yunho have A LOT of potential when it comes to stage presence as proven by their before debut performances and many stages as well. But because Jongho’s parts are almost always belting or high notes he has to focus on his technique and his expressions fall painfully flat. Yunho too seems blank for most of his parts except a few times, this is also why I feel these two should get less center time than they do. When I first checked Ateez out I had no idea why they were so hyped because their stage performance seemed very blank to me, later I found out it was because most of the center time was given to Jongho and Yunho. 5)Yeosang gets the number of lines that he should. I will probably get a lot of hate for this but like I said, from an industry perspective I get it. He has the weakest vocals among the vocal line and is the most unstable live, and probably has the least stage presence in the group along with the fact that the dance line is more eye-catching dance wise. Yunho and Jongho need to get more lines because of being the Main vocalist and Main Dancer respectively but there is no particular area Yeosang stands out so he gets the least lines compared to the members. 6) There is nothing wrong with San standing out. A lot of fans hate the fact that San stands out during stages and wants him to tone it down but honestly, I don’t get why. I have watched all their performances and San doesn't overpower the members to the point where it affects the group balance drastically or makes you notice no one but San. Other than that him standing out is a good thing because it attracts so many fans (me included) and is now being deemed by one of the best performers in the 4th generation. I am afraid all this criticism will get to him and he’ll withhold his potential because god I absolutely LOVE watching him perform. 7) They will always get compared to BTS especially as they get more and more popular. This is disappointing for me too but the similarities between the two groups will definitely bring a lot of comparisons and hate. Both are from relatively small companies, have insane talent and passion in their eyes that is reflected in their stages. Both have stories in their concepts and both have similar music styles from debut. Both have hard hitting choreographies and show great appreciation for fans and staff. People are already calling them the ‘Next BTS’ and they are already getting hate for all the comparisons and they are still relatively small. The bigger they get the more this will continue. 8) The debut wasn’t as revolutionary and many people claim it to be. Many Atinys have been going around saying ‘Pirate King’ and ‘Treasure’ are absolutely revolutionary with the concept, style, and music but really it’s not. Both are great songs, yes but there is nothing new about them especially for a debut song. What is something that should be hyped is Ateez’s performances live and the energy they bring. 9)The group dynamic isn’t as great as fans claim yet. The members are close but there are many awkward moments between them multiple times that show they haven’t reached that level of bonding yet like that of let’s say BTS. This will obviously come with time as they have barely been together for long but I am afraid they might not. Yeosang in all honestly seems like he is opposed to San and how he performs while the other members view it positively. I observed this in their last two Weekly Idol episodes and then there was the Christmas Vlive situation with Wooyoung. Ignoring all the extra fanservice San seems very very emotionally dependent on Wooyoung and seems to have a lot of insecurities and I am afraid if they get distant he might break down. I have noticed these in interviews and how San seems to go closer to Wooyoung for comfort. Again, I could be wrong about all of this and am just over reading into things but just what I have observed. 10)TXT deserved ROTY. As an atiny I was salty, yes, but TXT had the numbers and statistics. They also had the advantage of a GP friendly debut concept. And TXT is a VERY talented group as well, so saying they didn’t deserve it is beyond me. There are many factors that TXT is better than Ateez in and there are many factors that Ateez is better than TXT in. Just because one comes from a big company and doesn’t have a hardcore concept doesn’t mean they deserve it any less. 11)Ateez lacks synchronization. They are still rookies so they should not be criticized over this greatly but they do lack synchronization compared to many groups like TXT and Verivery. The members' movements and energy are almost always different from each other. Some make big movements others make small ones. And they have such intricate and fast choreographies that the difference is heavily obvious. An example I can think of is Utopia performances. 12) San gets hate and called out by many ‘Atinys’ This one makes me so sad but San gets a lot of hate and criticism by ‘Atinys’ who say that he needs to tone his dancing and energy down, he does it to seek attention, he is overshadowing the members, is too popular, and that he is coming in between Wooyoung and Yeosang’s friendship etc. I felt important to say this because the amount of comments I have seen against San by atinys themselves is insane and I feel the fandom loves to promote the whole ‘we are a great fandom and love all members’ and deny such comments saying they are very few. 13) They are not underrated at all. For a two year group, Ateez has achievements that other idols die for. They are VERY popular internationally. And while they have little recognition in Korea they still have 4 music show wins and MAMA and GDA awards under their belt. Underrated groups do not get their first win within the first year of their debut, they do not get to attend award shows, their name is barely known in the industry. Stop saying they are underrated just because they haven’t reached the success of EXO or other groups. 14) The small company card does not work anymore. While Ateez are from a small company, their success nullifies whatever ‘empathy’ card it brings. They blew up from pre-debut, have grown a lot and are one of the most successful 4th gen boy groups along with TXT and Stray Kids. They perform on all music shows, they are invited to variety shows and got to perform on MAMA and GDA. They are on the same level as TXT and SKZ in terms of success with each group being slightly ahead in one of the things like digitals, physicals, charting etc. Not comparing to BTS but the reason why their small company card worked to bring empathy from others was because of the brutal mistreatment they received due to being from one. None of which Ateez is receiving. I want to conclude this by saying I am a die-hard Atiny myself and these were simply my unbiased opinions. These are things I have observed and in no way am I hating. I will probably add more over time. ",
            "date": "Updated October 21, 2020",
            "views": "72",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonia Henderson",
                    "user_href": "/profile/Antonia-Henderson-2"
                },
                {
                    "user_id": "Alyaa Alateibi",
                    "user_href": "/profile/Alyaa-Alateibi"
                },
                {
                    "user_id": "J o Y C E",
                    "user_href": "/profile/J-o-Y-C-E-5"
                },
                {
                    "user_id": "Char",
                    "user_href": "/profile/Char-371"
                },
                {
                    "user_id": "Amicia Rosé",
                    "user_href": "/profile/Amicia-Rosé"
                },
                {
                    "user_id": "Lilian Wilson",
                    "user_href": "/profile/Lilian-Wilson-13"
                },
                {
                    "user_id": "Lon Talley",
                    "user_href": "/profile/Lon-Talley"
                },
                {
                    "user_id": "Choi San",
                    "user_href": "/profile/Choi-San-16"
                },
                {
                    "user_id": "Gabriella Isburg",
                    "user_href": "/profile/Gabriella-Isburg-1"
                },
                {
                    "user_id": "Mariam Quinte",
                    "user_href": "/profile/Mariam-Quinte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Favour Egbune",
                "href": "/profile/Favour-Egbune"
            },
            "answer_text": "So I see ATEEZ has become popular enough for people to direct this question at them. I guess its a sign of growth, since we'll probably be seeing more people trying to find their faults like this as the fandom becomes larger. That being said, I've come to spill tea. I'm not really a fan of questions like these which seem aimed at antagonizing/degrading a group, but I'm answering this because I feel like I've watched enough of ATEEZ's content to have a say. My facts won't be “hard to swallow” because most Atinys already know and accept these things. This is for the people who are a more uninformed. Jongho belts most of the time. Because he can. That's just how he sings. Not every kpop star who can belt and does it often is using bad technique. And notice that he really only “yell-sings” when he’s tired, which is natural. He's lowkey carrying ATEEZ’s vocals on his back and he prides himself on singing live, so he tries his best to the very end. For goodness sake, some of y'all act like you're vocal coaches. Let it go.Hongjoong may not have the best grasp of English in the group, but he still leads interviews because he's the leader and that's his damn job. No one knows if the other members actually want to take charge of their American interviews.Yeosang's voice is deep, and it doesn't fit a lot of their title tracks. So listen to their side tracks. He did the chorus in Horizon and his vocals were plenty stable. Trust the producers, they know what they're doing. Yeosang's voice is not going to waste.Mingi's stamina could improve. He runs out of breath a lot and sometimes that makes his rapping kind of sloppy. He's improved recently, but he's far from perfect. That's why…They lip sync/double. Most kpop stars sing and rap with a backing track. It's difficult to dance and simultaneously sing perfectly. I'd say it's nearly impossible for any group, much less a rookie group who've just started out.That's all I have to say. These are things you can observe, so I'd call them facts. Any opinions you have about who should've been the main vocalist (or whatever position), or whose personality is the fakest, which album was their weakest, or them using whoever else for clout is just an opinion. If it's purely speculation no one has confirmed, don't call it a fact. You're allowed your opinion, but don't stir up stuff in a largely peaceful fandom just because you can get away with it by being anonymous. Atinys are kind, but we draw a line too. I've become uncharacteristically salty, so here's a fancam of Mingi to bless you and your household.  ",
            "date": "Answered January 11, 2020",
            "views": "188",
            "upvotes": " View 280 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grey Bunny",
                    "user_href": "/profile/Grey-Bunny"
                },
                {
                    "user_id": "Lee Know",
                    "user_href": "/profile/Lee-Know-26"
                },
                {
                    "user_id": "Siobhan D'cruz",
                    "user_href": "/profile/Siobhan-Dcruz"
                },
                {
                    "user_id": "Lon Talley",
                    "user_href": "/profile/Lon-Talley"
                },
                {
                    "user_id": "Ananya A",
                    "user_href": "/profile/Ananya-A-64"
                },
                {
                    "user_id": "Zahraa Zerkan",
                    "user_href": "/profile/Zahraa-Zerkan"
                },
                {
                    "user_id": "Ramasamy Azhagurani",
                    "user_href": "/profile/Ramasamy-Azhagurani"
                },
                {
                    "user_id": "Geneva Gadrey",
                    "user_href": "/profile/Geneva-Gadrey"
                },
                {
                    "user_id": "Petalji",
                    "user_href": "/profile/Petalji"
                },
                {
                    "user_id": "Leighcia Meylan",
                    "user_href": "/profile/Leighcia-Meylan"
                }
            ]
        }
    ]
}