{
    "title": "What were your favorite bands at various stages in your life, childhood, teenage, young adult, current, etc.? - Quora",
    "tags": [
        "Childhood",
        "Bands (music)",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ruth Da Ponte",
                "href": "/profile/Ruth-Da-Ponte"
            },
            "answer_text": "These are some of my favourite rock bands of the past/present. I’ve excluded boybands because that’s just on another level, hehehe Childhood: The Beatles, Duran Duran, INXS, Billy Idol, Poison, Twisted Sister, ZZ Top, The Ramones, The GoGos, Midnight Oil, David Bowie, The Village People, Culture Club Teenage: Skid Row, Guns N Roses, LA Guns, Red Hot Chili Peppers, Nirvana, Smashing Pumpkins, The Pixies, Sonic Youth, L7, No Doubt, Jesus And Mary Chain, Depeche Mode, Bon Jovi, Extreme, Faster Pussycat, Shonen Knife, New Order Young Adult: Rage Against The Machine, Radiohead, The Smashing Pumpkins, Sonic Youth, Soundgarden, Alice In Chains, The Eagles, LED Zeppelin, Rush, Guns N Roses, Nine Inch Nails, System Of A Down, Alien Ant Farm, Pink Floyd Adult: More or less everything previously listed plus: The Clicks, Disturbed, Earth Wind And Fire, Boney M, Current: Onewe, CNBlue ",
            "date": "Answered March 10, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evan Askew",
                "href": "/profile/Evan-Askew-1"
            },
            "answer_text": "Prior to grunge it was guns n Rose's and poison. I also like motley crue, faith no more, midnight oil and inxs. When grunge came out it put me onto other music, all the other bands remained prized possessions in my music collection but I also grew to love the music of Red hot chilli peppers, alice in chains, slayer, mettalica and pantera. By the mid to late 90s I had acquired more purchasing power and began to check out the older music that influenced the music I grew up with. From this I developed a live of the Beatles, rolling stones, creedence Clearwater revival, jimi hendrix, cream, led zeppelin and Kiss in particular. To this day I live red hot chilli peppers and Kiss above all others. In addition to that I love some rap artists, sir mix a lot, round dmc, eminem, nwa and also the pynk band misfits, in their Glenn danzig and Michael graves incarnations, plus German Folk band Faun and Faroe Island artist Eivor Palsdottir. ",
            "date": "Answered March 10, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}