{
    "title": "What's the history of Green Day's Boulevard of Broken Dreams? - Quora",
    "tags": [
        "Boulevard of Broken Dreams",
        "Green Day (band)",
        "Music History",
        "Song Meanings",
        "Dreams and Dreaming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Lebert",
                "href": "/profile/Michael-Lebert"
            },
            "answer_text": "Source: Wikipedia “\"Boulevard of Broken Dreams\" is a song by American punk rock band Green Day, recorded for their seventh studio album American Idiot (2004). Reprise Records released \"Boulevard of Broken Dreams\" as the second single from American Idiot. The song's lyrics were written by lead singer Billie Joe Armstrong, and composed by the band. Production was handled by Rob Cavallo and Green Day. \"Boulevard of Broken Dreams\" remains one of Green Day's signature songs. The song speaks from the point of view of American Idiot's main character, Jesus of Suburbia, and is a moderate midtempo song characterized by somber and bleak lyrics. This is in contrast to the previous track on the album, \"Holiday\", which illustrates Jesus of Suburbia's high of being in The City. MTV's Green Day Makes a Video described \"Holiday\" as a party, and \"Boulevard of Broken Dreams\" as the subsequent hangover. The song was ranked the number one on Rolling Stone's Reader's Choice: Singles of the Decade list in 2009 and number 65 on the 100 Best Songs of the Decade list in the same year. It has sold over 2 million copies in the United States as of 2010.[1] The single peaked at number two on the Billboard Hot 100, behind \"Candy Shop\" by 50 Cent and Olivia, making it Green Day's most successful song in the United States. The song was the ninth-highest-selling single of the 2000–2009 decade with worldwide sales exceeding 5 million copies.[2] As of 2017, \"Boulevard of Broken Dreams\" remains to be the only song in history to win both the Grammy Award for Record of the Year and MTV Video Music Award for Video of the Year.” ",
            "date": "Answered May 8, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankan Dutta",
                    "user_href": "/profile/Ankan-Dutta-11"
                },
                {
                    "user_id": "Aditya Narayan Dubey",
                    "user_href": "/profile/Aditya-Narayan-Dubey-1"
                },
                {
                    "user_id": "Vidit Kothari",
                    "user_href": "/profile/Vidit-Kothari-2"
                }
            ]
        }
    ]
}