{
    "title": "What are the most beautiful French songs? - Quora",
    "tags": [
        "French Music",
        "French (language)",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Louis Amiot",
                "href": "/profile/Louis-Amiot"
            },
            "answer_text": "Let's start our tour of French music with every style of music: Rock Music Telephone - ça c'est vraiment toi    Telephone was one of the biggest rock French band in the nineties ! They have many good songs (Cendrillon, Un autre monde, La bombe humaine,...) Johnny Hallyday - Allumer le Feu    Jonnhy Hallyday is one of the most pupular French artist from the sixties to nowadays. Chanson Jean-Jacques Goldman - Quand la musique est bonne    If you have to remember one name, please remembre this name: Jean Jacques Goldman ! One of the biggest French singer, guitarist and composist ! He Has written songs for the best: Céline Dion, Patricia Kaas,... Claude François - Comme d'habitude    Claude François a very popular French singer during the 70's. The famous \"My Way\" of Frank Sinatra is based on this song, only the lyrics are changed. \"My Way\" is often quoted as the most covered song in history. France Gall - Poupée de cire, Poupée de son    I have to mention this song which is the 1965 Eurovision winner. France Gall, which was only 17 at the time of the Eurovision, is a famous French singer with numerous songs such as Evidemment, La déclaration. Céline Dion - Pour que tu m'aimes encore    I cannot make you a tour of French music without mentionning one of the biggest Francophone singer: Céline Dion. Her French songs are often said as her best songs. Rap Music Diam's - La boulette    Diam's was one of the most popular rapper in France in the 2000's. Very controversial character. She is now retired after falling in depression. Sexion d'assaut - Désolé   This rap band is famous today especially with the teenagers.  Music from the 20th century Barbara - L'aigle Noir    This song is the most famous song from Barbara and one of the most powerful French song ever. The lyrics described a rape and a incest through a conceit. Boris Vian - Le déserteur   Boris Vian is a French singer as well as a famous French writer. This song was very popular at the time of its release. Edith Piaf - L'hymne à l'amour    Edith Piaf is one of the French most famous singer by foreigners. Her most famous song is L'Hymne à l'amour.  New stage Kyo - Le Chemin   Grégoire - Toi + Moi   Short Anecdote: Grégoire signed a contract with the young label My Major Company, which gives subscribers the possibility to become music producers. Grégoire's first album was produced by 347 producers, of which forty feature in the music video of this song. Ben L'oncle Soul - Soulman   Bonus: Two bonus songs French Anthem - La Marseillaise   One of the most epic anthem according to foreigners. Disney - Ce rêve bleu (= A whole new world)    Just for fun, this wonderful disney song in French sung by a cutie girl. This is the end of our tour.If you want more songs, feel free to ask me ! :)Also feel free to correct any spelling mistake ;) ",
            "date": "Answered May 1, 2013",
            "views": "71",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Mandhane",
                    "user_href": "/profile/Aditya-Mandhane-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Annie-119"
                },
                {
                    "user_id": "Emma Saboureau",
                    "user_href": "/profile/Emma-Saboureau"
                },
                {
                    "user_id": "Clara Le Gros",
                    "user_href": "/profile/Clara-Le-Gros"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christophe Taesch",
                "href": "/profile/Christophe-Taesch"
            },
            "answer_text": "What is some of the best French music? I’ve been a DJ for 15 years… you need to be really more precise about your taste. It all depends what your style is, and if you’re advance enough to leave the classics behind and go for rap and pop. Now I will give you an answer based on music that you could be given in a french class at different level and still be cool and most of their songs would fit the description. Classic (crooner, big bands, my parent’s classics) : Edith Piaf, Charles Aznavour, Charles Trenet, Bourvil, Fernandel, Ray Ventura. Jacques Brel. Jazz, Jazzy : Claude Nougaro, Dany Brillant, Morane, Boris Vian, Le grand orchestre du Splendid. Poets, Engaged, Avant Garde. Leo ferre, Serge Reggiani, Georges Brassens, Babara, Juliette Greco. Rap : Claude MC Solaar, Maitre Gimms (select carefully, not all the songs could suitable) Folk : Tri Yann, Yann Stevel, Sixties : the ones who did some careers. Johnny Halliday, Nino Ferrer, Jacques Dutronc, Eddie Mitchell (with or without the Chaussettes Noires), Sylvie Vartan, Polnareff, Serge Gainsbourg (!! his eighties songs are for most rated “R.” !!) Seventies : Johnny Halliday, Nino Ferrer, Jacques Dutronc, Eddie Mitchell, Sylvie Vartan, Michel Sardou, yes, the same ones, they’re so good. Eighties : Etienne Daho, Telephone, Indochine, Jean-Jacques Goldman, Michel Berger, France Gall. Francis Cabrel, Renaud Nineties : Etienne Daho, Telephone, Indochine, Jean-Jacques Goldman, Michel Berger, France Gall. Francis Cabrel, Renaud, Noir Desir (indy Rock). 2000 and now : William Balde, Natasha St Pier, Renaud (come back), Grand Corp Malade, Yannick Noah And so on, I’ve tried to be eclectic, and for all kind of taste, these artists are still the one you will hear on the french radios, and they are the typical that you would put on a wedding’s playlist for background or dancing, it doesn’t mean that they’re too commercial, but they will fit a wide public. ",
            "date": "Answered March 26, 2018",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Dajenerie",
                    "user_href": "/profile/Lisa-Dajenerie"
                },
                {
                    "user_id": "Nicholas Cianfanelli",
                    "user_href": "/profile/Nicholas-Cianfanelli"
                },
                {
                    "user_id": "Juliano Axel",
                    "user_href": "/profile/Juliano-Axel"
                },
                {
                    "user_id": "Jim Morrissey",
                    "user_href": "/profile/Jim-Morrissey-11"
                }
            ]
        }
    ]
}