{
    "title": "What are the down sides of being a professional musician? - Quora",
    "tags": [
        "Professional Musicians",
        "Professionals",
        "Music Industry",
        "Musicians",
        "Music",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Romero",
                "href": "/profile/John-Romero-21"
            },
            "answer_text": "People complain about their jobs all the time. Conductors, other musicians, the parts, the odd working hours, the venues, the brass players. It's all fair game. So if you're looking for a negative nancy, look no further than the professional classical music community.Hearing loss. Most musicians are subjected to unsafe levels of noise daily, and unless you wear profession (expensive) earplugs every day you're almost guaranteed to have some greater-than-average hearing loss by the end of your career. And many musicians don't wear earplugs because it interferes with their ability to play at a professional level.Carpal Tunnel syndrome, repetitive motion injuries, and general soreness in the muscles you use to play your instrument. For me, my left shoulder blade has a large, annoying, and permanent knot from holding up the trombone.An inability to connect to amateur musicians. You may think more experience with instruments would make this not the case, but we hear “oh you're a musician, I play guitar!” so often it's kind of a running joke in the community. Not that guitarists aren't musicians, but the majority of guitarists are casual amateurs and they usually have no idea what it's like to practice 4–8 hours every day for 20 years to get to the level we're at. It's like telling a doctor, “oh you do heart surgery? I played operation as a kid!” I personally am not bothered so much because I know they're just trying to find some common ground, but it's akin to anti-vaxers thinking they know more than the researchers who come up with the vaccines.You're never finished with work. Ever. It could always be better. For people with general anxiety, this often leads to feelings of guilt when you didn't have a “perfect” day of practicing enough. And you always have to stay “in shape.” I haven't taken a vacation without my trombone in 8 years.Speaking of which, flying with an instrument is one of the scariest things every musician has to do. Small PSA, but if you see someone with an instrument and you're on a full flight, it would mean the world to us if you voluntarily gate-check your bags. If you have fragile stuff in it, I understand. That's probably why you put it in your carry on in the first place. But even brass instruments are fragile (a dented slide can be unplayable), and our instruments can be worth hundreds of thousands of dollars. Mine is worth around $6000, but that's not exactly quick cash for most musicians either, and insurance doesn't always cover damage from flying. Also, we're often flying for work, so if we show up with a broken instrument we've lost that income as well. So put yourself in our shoes and try to be understanding when we desperately beg flight attendants to let us put our instruments in the coat closet or something.Practicing. Some people love it. Others hate it. I'm in the middle somewhere, but there's something very tiring mentally about finding flaws in yourself every single day.There's more I'm sure, but that should give you an idea. There are a lot of upsides too! But I'll save it for another answer. EDIT: With regards to the amateur musician comment, I've gotten some pushback saying that I'm elitist and snobby for saying what I said. So again, it doesn't bother me personally, but it's a common enough phenomenon that it's definitely worth going on the list. And for the people it does bother, I think for some of them it totally is an ego elitism thing. But most of the time, it's just that amateur musicians think they know everything about your job and what you do, but they end up asking all the wrong questions and it can be awkward and embarrassing for both parties. I've experienced the phenomenon trying to talk to a math major. I love math. I'm good at math. I was going to be a computer scientist were music to not work out. But I looked like a total idiot trying to connect with her on her level and sounded like a 5 year old trying to understand general relativity. Sometimes you just don't know enough to be able to talk about a subject, even if you dabble. ",
            "date": "Answered March 6, 2019",
            "views": "348",
            "upvotes": " View 991 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                },
                {
                    "user_id": "Carlet Langford",
                    "user_href": "/profile/Carlet-Langford"
                },
                {
                    "user_id": "Kirk Eipper",
                    "user_href": "/profile/Kirk-Eipper"
                },
                {
                    "user_id": "Neil Bullock",
                    "user_href": "/profile/Neil-Bullock-6"
                },
                {
                    "user_id": "Oladipupo Diamond",
                    "user_href": "/profile/Oladipupo-Diamond"
                },
                {
                    "user_id": "Clark Powell",
                    "user_href": "/profile/Clark-Powell-3"
                },
                {
                    "user_id": "Ashique Desai",
                    "user_href": "/profile/Ashique-Desai"
                },
                {
                    "user_id": "John Webb",
                    "user_href": "/profile/John-Webb-181"
                },
                {
                    "user_id": "Lenny Rothbart",
                    "user_href": "/profile/Lenny-Rothbart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Chu",
                "href": "/profile/Dave-Chu-6"
            },
            "answer_text": "If you’re a freelancer, the pay is unsteady. That makes it hard to support a family, for one thing. Are there steady jobs, like in orchestras or school teaching? Yes, but now that’s really uncommon. Even if you are great and competitive enough to get one of these rare gigs, you’re not going to make a king’s ransom. (If you’ve never heard of that expression, it means serious money). An unexpected thing that’s a possible downside is that music can become just a job, as opposed to a source of joy and creativity, especially if you’re stuck playing material that you’re not crazy about, or if you’re working with jerks. I think many players become weekend warriors so that they will have fun and not rely 100% on that for their living. Another concern is that you can get injured. For instance, repetitive strain injury is no joke, and there are many other ailments that can come with playing all the time. They can be musical career-enders. Frankly, the musicians I know rarely do a great job of staying fit and strong. Their idea of staying fit is often just vaguely trying to be careful, as opposed to training and really working on their fitness. I’m certified as a personal trainer, so I see the value of being in shape, especially when playing technically rigorous styles and instruments that are more physical. One thing that is wonderful, so much free music being available on YouTube and elsewhere, also has a downside. People become accustomed to paying nothing for music. A restaurant, club, or other location may just eliminate all live music and just have Spotify or Pandora. Along similar lines, government (and other) funding of music programs and performance is shrinking. Despite the proven benefits of a musical education, such as increasing intelligence and the ability to work with others, many people will happily vote down any funding for music programs. It’s not viewed as a cultural value - it’s just a frivolous luxury. ",
            "date": "Answered March 7, 2019",
            "views": "353",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lenny Rothbart",
                    "user_href": "/profile/Lenny-Rothbart"
                },
                {
                    "user_id": "Jennifer Stanley",
                    "user_href": "/profile/Jennifer-Stanley-104"
                },
                {
                    "user_id": "Sabira Woolley",
                    "user_href": "/profile/Sabira-Woolley"
                },
                {
                    "user_id": "Eve Brey",
                    "user_href": "/profile/Eve-Brey-1"
                },
                {
                    "user_id": "Amy Goldfarb",
                    "user_href": "/profile/Amy-Goldfarb-1"
                },
                {
                    "user_id": "Kim Davis",
                    "user_href": "/profile/Kim-Davis-2"
                }
            ]
        }
    ]
}