{
    "title": "What was the #1 song in 1999? - Quora",
    "tags": [
        "1999",
        "1990s",
        "Song Identification",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "David McQuillen",
                "href": "/profile/David-McQuillen-1"
            },
            "answer_text": "1999 was actually one of the weakest years since the 1950s for singles, it’s top rated song - Aphex Twin’s Windowlicker clocking in at just 267 on acclaimed music.nets aggregate best 10,000, and the year only landing three songs in the top 500 all-time on the same list. For my money, the best regardless of critical ranking are the two standouts from The Flaming Lips The Soft Bulletin - Race For The Prize and Waitin’ For A Superman, Bonnie Prince Billy’s I See A Darkness, Eminem’s My Name Is, one of the tracks on Sigur Ros’ Ageatis Byrjun (I forget which, it’s the one with the super heavy bass intro) and the title track to Primal Scream’s Accelerator. ",
            "date": "Answered January 23, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Smith",
                "href": "/profile/Bob-Smith-6121"
            },
            "answer_text": " Well if I had my way…… But I rarely do so bear with me. Well according to BillBoard Hot 100, Cher with “ Believe” held the number 1 spot that year... Hey, I was busy that year so did not cast my vote ;-\\ #2 on the list that year was TLC with “ No Scrubs” Crap year for music that year, thus I paid little attention to most of it, but there were some astounding songs ground out that year. But another answer for another time. ",
            "date": "Answered July 22, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Don Bruck",
                    "user_href": "/profile/Don-Bruck"
                }
            ]
        }
    ]
}