{
    "title": "What is the meaning of two souls that feel connected? - Quora",
    "tags": [
        "Spirit Science and Spiritism",
        "Soul (metaphysical entity)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Parker, PhD",
                "href": "/profile/Jonathan-Parker-PhD"
            },
            "answer_text": "Often people who believe they have found their soulmate will describe feeling their souls are connected. In some cases they may even feel entwined and bound to the person with a strong and intoxicating passion.  What this looks like energetically is their auras overlap and some of their chakras are corded together. This causes intense emotions, strong bonds, and sometimes an overwhelming intensity in the relationship. Of course, not all soul connections are this intense. It is possible to have overlapping energies with another person without the drama.  Usually, if a person has had emotional past lives with another and they meet in this life they will experience strong feelings of knowing the other and an energy of familiarity comes over them. This can happen if the past life was positive or negative. In either case, the forces creating the attraction and meeting in this life is usually to work out differences or continue what was wonderful in the previous life.  ",
            "date": "Answered April 8, 2016",
            "views": "214",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivani Sapkal",
                    "user_href": "/profile/Shivani-Sapkal-13"
                },
                {
                    "user_id": "Daa'iyah Wallace",
                    "user_href": "/profile/Daaiyah-Wallace"
                },
                {
                    "user_id": "Laura Mohammed",
                    "user_href": "/profile/Laura-Mohammed-6"
                },
                {
                    "user_id": "Adrii Lucilfer",
                    "user_href": "/profile/Adrii-Lucilfer"
                },
                {
                    "user_id": "Shilpa Marwah",
                    "user_href": "/profile/Shilpa-Marwah-3"
                },
                {
                    "user_id": "Dipak Abhyankar",
                    "user_href": "/profile/Dipak-Abhyankar"
                },
                {
                    "user_id": "Jeromie Williams",
                    "user_href": "/profile/Jeromie-Williams-1"
                },
                {
                    "user_id": "Steevson Joy",
                    "user_href": "/profile/Steevson-Joy"
                },
                {
                    "user_id": "Miana Davis",
                    "user_href": "/profile/Miana-Davis"
                },
                {
                    "user_id": "Sharma Sneha",
                    "user_href": "/profile/Sharma-Sneha-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Davis",
                "href": "/profile/James-Davis-119"
            },
            "answer_text": "It is life fulfilling itself. It is destiny. It is the foreshadowing of the world to come. All souls are connected in love and there is a mystical unity, a sense of oneness, that pervades true soul consciousness. When we are externally or superficially focused, then we do not perceive it, but the reality of unity still shines in the background of our consciousness like the sun behinds dense clouds. Brotherhood is a light, it is not simply an ideal but a reality that lives in the soul. When love is real, it is spiritual and it can be evoked between two, among a few, or through many, but ultimately it extends to embrace all humanity. Love between two is a portal for love without limits. “...the particular loved one is really only a window through which that Immortal Beloved is glimpsed...Love is therefore in its essential nature and in the last analysis, the worship of the divine through the human.” Old Lamps For New, Claude Bragdon “When lovers pledge their love forever It means a glimpse of the soul's immortality Has penetrated the brain. The heart sees the existing infinity of love. We rightly designate all who cross this threshold As realists of the One Reality.” Morphing with Light ",
            "date": "Updated January 7, 2020",
            "views": "89",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivani Sapkal",
                    "user_href": "/profile/Shivani-Sapkal-13"
                },
                {
                    "user_id": "Jason Chamberlain",
                    "user_href": "/profile/Jason-Chamberlain-33"
                },
                {
                    "user_id": "Kelly Yu",
                    "user_href": "/profile/Kelly-Yu-74"
                },
                {
                    "user_id": "Bloom R Badal",
                    "user_href": "/profile/Bloom-R-Badal"
                },
                {
                    "user_id": "Jahnvi Ahluwalia",
                    "user_href": "/profile/Jahnvi-Ahluwalia-1"
                }
            ]
        }
    ]
}