{
    "title": "What motivates you to study and why? - Quora",
    "tags": [
        "Motivation",
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sneha Ramesh",
                "href": "/profile/Sneha-Ramesh-102"
            },
            "answer_text": "HE IS THE ONE WHO INSPIRED ME. A PERSON WHO TOPPLED THE WORLD WITH HIS IDEOLOGY: LET US SEE HIS PASSION FOR LEARNING: A 21-year-old teenage boy was diagnosed with motor neuron disease, more commonly known as Lou Gehrig's disease or amyotrophic lateral sclerosis (ALS). He was not expected to live for more than two years. Completing his doctorate did not appear likely. Yet, Hawking defied the odds, not only attaining his Ph.D. but also forging new roads into the understanding of the universe in the decades since. As the disease spread, he became less mobile and began using a wheelchair. Talking grew more challenging and, in 1985, an emergency tracheotomy caused his total loss of speech. A speech-generating device constructed at Cambridge, combined with a software program, served as his electronic voice, allowing him to select his words by moving the muscles in his cheek. Even though the disease destroyed his response system, it did not have any impact on his powerful thoughts. His body did not respond to his commands but his mind was not ready to accept the denial. He did everything that he could do to give a noble contribution to his field of study. You may be more interested to know the name of that great person, it is none other than the great Stephen Hawking-the uncrowned king of physics. Stephen Hawking was regarded as one of the most brilliant theoretical physicists in history. His work on the origins and structure of the universe, from the Big Bang to black holes, revolutionized the field, while his best-selling books have appealed to readers who may not have Hawking's scientific background. \"All of my life, I have been fascinated by the big questions that face us, and have tried to find scientific answers to them. If like me, you have looked at the stars, and tried to make sense of what you see, you too have started to wonder what makes the universe exist.\"  It is not possible for every human to become a Stephen hawking but I think that it is possible for every human to work hard like Stephen hawking Luck may not bend according to your needs but hard work will. ",
            "date": "Answered January 16, 2020",
            "views": "23",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jenna Shelby",
                    "user_href": "/profile/Jenna-Shelby-6"
                },
                {
                    "user_id": "Jatin Mamodiya",
                    "user_href": "/profile/Jatin-Mamodiya"
                },
                {
                    "user_id": "Ajay Rawat",
                    "user_href": "/profile/Ajay-Rawat-357"
                },
                {
                    "user_id": "Kuhu Dubey",
                    "user_href": "/profile/Kuhu-Dubey-3"
                },
                {
                    "user_id": "Avni Sharma",
                    "user_href": "/profile/Avni-Sharma-47"
                },
                {
                    "user_id": "Bala",
                    "user_href": "/profile/Bala-384"
                },
                {
                    "user_id": "Rafi Uddin Ahmed",
                    "user_href": "/profile/Rafi-Uddin-Ahmed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pawan Kumar Gupta",
                "href": "/profile/Pawan-Kumar-Gupta-172"
            },
            "answer_text": "So here I am going to reveal the facts what motivates me to study .. I have seen many poor , helpless people begging and suffering alot due to there financial condition , due to their disability and many other reasons are there ..They are not getting proper food of one time of one meal ..I have seen many little little children of age of 3–4 working , begging and doing many other things to support there family financially . In the age of studying and enjoying their life playing with toys with their friends .. They are involved in all these work. They are not doing it willingly but they are helpless .There are many old poor who are suffering alot ..Here are the some images below :        There are many kind and generous people who are there for helping them to come out of this situation but there number are very less .    I want to be one of them .. After seeing this kind of condition of such people like them . I feel really pitty but I am helpless now.. But whatever I can do for them from my side I do .. If I see them like this ..But in future when I will become successful in my life and help them as much as I can . For being successful in my life I am studying ..So that I can provide them little bit of help .. In future I am planning to have one YouTube channel One website for them so that willing people can help them .. There are many ideas in my mind but I am not going to reveal them now .. Also requesting you all to help from your side whenever you see people like them suffering .. This is my motivation for studies .. Thanks .. Edits are welcomed .. ",
            "date": "Updated January 22, 2020",
            "views": "36",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Nohlin Lanic",
                    "user_href": "/profile/John-Nohlin-Lanic"
                },
                {
                    "user_id": "Jenna Shelby",
                    "user_href": "/profile/Jenna-Shelby-6"
                },
                {
                    "user_id": "Uday Kumar",
                    "user_href": "/profile/Uday-Kumar-5291"
                },
                {
                    "user_id": "Matin Barzani",
                    "user_href": "/profile/Matin-Barzani-2"
                },
                {
                    "user_id": "Shrusti Sahu",
                    "user_href": "/profile/Shrusti-Sahu"
                },
                {
                    "user_id": "Akshi Gayandi",
                    "user_href": "/profile/Akshi-Gayandi"
                },
                {
                    "user_id": "Arvind Spartan",
                    "user_href": "/profile/Arvind-Spartan"
                },
                {
                    "user_id": "Hira Hussain",
                    "user_href": "/profile/Hira-Hussain-13"
                },
                {
                    "user_id": "Dina Chen",
                    "user_href": "/profile/Dina-Chen-8"
                },
                {
                    "user_id": "Kiran Gupta",
                    "user_href": "/profile/Kiran-Gupta-691"
                }
            ]
        }
    ]
}