{
    "title": "What is vibrato? - Quora",
    "tags": [
        "Vibrato"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diane Severson Mori",
                "href": "/profile/Diane-Severson-Mori"
            },
            "answer_text": "Vibrato is the regular oscillation of the pitch on a sustained tone. In instruments this is done overtly and mechanically, by moving the finger (stringed instruments) or altering the flow of air (Wind instruments). In the voice, it is a naturally occurring phonomenon, when the opposing forces governing the tone production are in balance. It is something that can be produced (or taken away) on purpose, but when occurring naturally it is subtle and lends the sound a vibrancy, buoyancy and direction to the tone and shouldn't. E the first thing you notice about the singers voice. There is a narrow frequency in which the oscillations occur if it is well balanced and occurring naturally. Too fast and it is called a tremolo and sounds nervous, goat like. Too slow and it's a wobble and is what we associate with many opera singers with big voices (whether it is actually a wobble depends!). ",
            "date": "Answered October 31, 2016",
            "views": "418",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Syirona 'Anoriys' Dingwall",
                    "user_href": "/profile/Syirona-Anoriys-Dingwall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charis Kerstetter",
                "href": "/profile/Charis-Kerstetter"
            },
            "answer_text": "Vibrato is when you sing, (or play a musical instrument) and make your pitch go up and down. You can make it go fast or slow too. When singing you get a deep breath from your diaphragm, and push you air stream continually and simultaneously, really fast, and slow, and then it should sound like a wave. On an instrument however, its still kind of the same concept, but you push you air through it continually fast and slow… I hope this helps someone!! ",
            "date": "Answered October 30, 2016",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "Going slightly sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp, then flat, then sharp over a pitch. Now I’m dizzy. Though, that could be the Sambuca. ",
            "date": "Answered October 29, 2016",
            "views": "171",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Abutin",
                    "user_href": "/profile/Evan-Abutin"
                },
                {
                    "user_id": "Emil Wahlgren",
                    "user_href": "/profile/Emil-Wahlgren"
                },
                {
                    "user_id": "Annette Blankenship",
                    "user_href": "/profile/Annette-Blankenship"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manasa Moravineni",
                "href": "/profile/Manasa-Moravineni"
            },
            "answer_text": "Vibrato is a slight variation in pitch when singing. Vibrato is seen in a singer (could be in an instrument) that is well developed, and has a matured voice, with also correct singing form (singing properly with the throat). ",
            "date": "Answered October 30, 2016",
            "views": "125",
            "upvotes": "0"
        }
    ]
}