{
    "title": "What are some 'rock' songs without any guitar? - Quora",
    "tags": [
        "Rock Songs",
        "Classic Rock Music",
        "Rock and Roll Music",
        "Guitars",
        "Rock Music",
        "Music Recommendations",
        "Musical Instruments",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Huw Peterson",
                "href": "/profile/Huw-Peterson"
            },
            "answer_text": "There are some other good answers out there already by people far more knowledgeable about the rock genre than I am. My first inclination when considering this question was to think of early rock pioneers, particularly ones who were piano players such as Fats Domino, Little Richard and Jerry Lee Lewis. Rock & Roll largely evolved from jump blues, in which guitar was not a prominent component, and rockabilly, in which it was. Horns, drums, bass and piano were the key instruments of jump blues since the genre was rooted in small swing jazz groups. However, most of the early rock artists, including the three listed above, did have guitar in the mix even if it was not prominent. Here is a song from around the birth of rock ’n roll that does not have guitar in it. There is argument whether is actually actually R&R or R&B, and I actually lean towards the latter, but plenty of people consider it to be early Rock and Roll. Shake, Rattle and Roll (1954) - Big Joe Turner  ",
            "date": "Answered August 13, 2019",
            "views": "491",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-11"
                },
                {
                    "user_id": "Alison Overton",
                    "user_href": "/profile/Alison-Overton-2"
                },
                {
                    "user_id": "James O'Connor",
                    "user_href": "/profile/James-OConnor-8"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "James O'Connor",
                "href": "/profile/James-OConnor-8"
            },
            "answer_text": "Though guitars are really the instrument that made Rock Music famous (I mean, really, Chuck Berry?, Led Zeppelin?, Metallica?), it’s not necessary for a Rock nband to use them all the time. The genre evolved along the way to the point where guitar wasn’t always featured or even used in the mix. I love a good guitar solo or a great riff, but sometimes, a great tune is a great tune without it. Here’s a list of a few you might recognize, others you may not. But they were all Rock tunes and I know and love them all. Elton John: “Talking Old Soldiers” (from Tumbleweed Connection, 1970)  Black Sabbath: “Changes” (from Vol. 4, 1972)  Egg: “Enneagram” (from The Civil Surface, 1974)  Grand Funk Railroad: “Some Kinda Wonderful” (from All The Girls In The World, Beware!, 1974)  Supertramp: “Fool’s Overture” (from Even In The Quietest Moments, 1977)  Gary Numan: “Cars” (from The Pleasure Principle, 1979)  Pink Floyd: “Nobody Home” (from The Wall, 1980)  Radiohead: “Everything In Its Right Place” (from Kid A, 2000)  Gary Jules: “Mad World” (from Trading Snake Oil For Wolftickets, 2003)  Keane: “Somewhere Only We Know” (from Hopes And Fears, 2004)  No guitars! But great stuff! ",
            "date": "Answered August 6, 2019",
            "views": "1",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diane Boyle Harder",
                    "user_href": "/profile/Diane-Boyle-Harder"
                },
                {
                    "user_id": "Laura Canton",
                    "user_href": "/profile/Laura-Canton"
                },
                {
                    "user_id": "Mateus Bez",
                    "user_href": "/profile/Mateus-Bez"
                },
                {
                    "user_id": "Lou Coury",
                    "user_href": "/profile/Lou-Coury"
                },
                {
                    "user_id": "David Tshulak",
                    "user_href": "/profile/David-Tshulak"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                },
                {
                    "user_id": "Guyton Jingle",
                    "user_href": "/profile/Guyton-Jingle"
                },
                {
                    "user_id": "Huw Peterson",
                    "user_href": "/profile/Huw-Peterson"
                },
                {
                    "user_id": "Thomasita Taylor",
                    "user_href": "/profile/Thomasita-Taylor"
                },
                {
                    "user_id": "Alex Neuenfeld",
                    "user_href": "/profile/Alex-Neuenfeld"
                }
            ]
        }
    ]
}